[{"comment_id":"10153218890796336","commenter_b":"^ baseball, hockey, and wrestling","commenter_a":"Should white people riot the NFL Draft?? 95% black were drafted last night","post_message":"JUST IN: Five of the six Baltimore police officers charged in the death of Freddie Gray are in custody, according to Mayor Stephanie Rawlings-Blake. @webpagelink"},{"comment_id":"10157024443115354","commenter_b":"But you'll let your politicians scrub the term \"illegal alien\" from your laws!!! Just another step towards amnesty!!!","commenter_a":"We began a WRITE IN campaign for Donald Trump in Colorado. We will show America we can not only Recall Libtard Legislator's who go after our Gun Rights, we will also go after Fascists hidden in the GOP.","post_message":"Colorado Republicans OUTRAGED..."},{"comment_id":"10153931139325695","commenter_b":"Omg poor @username lmao. What a nut job . So should we deport whites for crimes? Since this wasn't really our land to begin with?","commenter_a":"Really disappointed with you, WSB.","post_message":"Our investigation found the number of refugees deported for violent crimes is skyrocketing, and it includes numerous refugees here in Georgia. Today at 5, the numbers that leaders call a \"game changer\" in the Syrian refugee debate."},{"comment_id":"1152094041550315","commenter_b":"This is Trump he's racist or rapists he brings crime and does drugs is insane and sometimes maybe nice but lies all the time! He only hooks up with foreign women probably keeps them in the basement until needed no American woman would ever marry him no matter how much money he has!","commenter_a":"Make America great again by getting rid of Trump! Check out the smile on that white boys face makes me sick and I'm white! Trump is nothing but a trouble maker and an embarrassment for America! Do any of his supporters listen to him I mean really listen and heed what he says and does?? I doubt it must be mental illness","post_message":"The laughter of the Trump supporters will haunt you."},{"comment_id":"10154533749294062","commenter_b":"Lilly Cantor your a dumb young blond and still blind to the horror the earth has to offer so let me educate you . Among these people that actually need help there are terrorist trying to infiltrate us to attack us . So while your feeling bad terrorist are coming over plotting an attack . Bam attack happens then your like awww so sad but don't realize among these refugees there were terrorist . Terrorist are cowards that attack dirty . There goal is killing as many people as they can . So before you let people into our house AKA United states might want to consider would I let these people in my own house not knowing who they are","commenter_a":"Thank you Canada! It will take all of us to save these people from the horror of ISIS. They have already suffered so much and lost everything. The least we can do is welcome them With compassion.","post_message":"Canada will allow 25,000 refugees to resettle in the nation by February, with up to another 25,000 by the end of 2016."},{"comment_id":"971601666302233","commenter_b":"It seems like all the intelligent women with morals have been fired... This show needs to be cancelled!","commenter_a":"Yes","post_message":"Do you think The View should be CANCELLED from TV?"},{"comment_id":"1270876669600008","commenter_b":"Jean Miche","commenter_a":"We aren't. Some may be.","post_message":"Why is a fear of spiders so common?"}]
