[{"comment_id":"10154416316781833","commenter_b":"@username lmao there is no such thing as gun violence only violence. And back off gun control laws won't stop criminals or terrorists from getting guns. Your gun control laws only harm law abiding citizens and get people killed wake up. More states are banning gun control laws. I'm moving to Arizona. They have no gun control laws and have Constitutional carry. No permits no waiting periods no finger printing. Just a simple and quick background check and I'm free to get my gun. And I will buy loads of AR 15s and other types of guns. Gun control = death","commenter_a":"I don't see what the problem is with strict background checks and a ban on assault rifles. This guy was under investigation by the FBI twice for suspected terror affiliations. A background check would have certainly stopped him from obtaining such a weapon. Noone wants to take away anyone's guns, just keep them out of the hands of lunatics","post_message":"Americans were shocked and disgusted to learn of another act of terrorism on our soil. But calls for more gun control are a desperate attempt to create the false illusion that government - and politicians - can keep us safe at all times."},{"comment_id":"10154308698454607","commenter_b":"Do these liberal protesters have jobs!!!!!!","commenter_a":"The US is being ridiculed by idiotic liberals who are obviously clueless on what President Trump is doing, protecting Americans!!! I live less than 20 miles away from that radical Islamic terrorist attack in San Bernardino, where 14 innocent people were murdered!! It's not Trump's fault that our government is so corrupted and does not have an immigration accountability system to know who exactly is entering our country! There are Isis training camps all over the United States! If you don't believe me Google it!!! There is an Islamic training camp less than 10 miles away. They are spreading like a disease everywhere! Last year local law enforcement caught 16 radical Islamic Muslims training near the a river bed all of them had AK-47's!!! All of them are now being investigated by FBI! 5 of which are on the top 10 most wanted list!!! Do you want to know why ...","post_message":""},{"comment_id":"10153614155549117","commenter_b":"@username you seem perfectly willing to dismiss the notion that the unborn have rights. I have no idea when to legally call a fetus a human. If a pregnant woman is beaten and loses her child is it simple battery. I don't know. When I was young I learned hunting and gun safety and rule one, you don't shoot at noise, a rustle in the bushes. Why not? Because there is a chance it may be a person. A real libertarian solution would be upon finding out she is pregnant she must claim she doesn't want to take care of a child and surrender right to it. If someone else is willing to take that child and be legally responsible for it then it gets rights and she needs to take personal responsibility (libertarian) and not be aggressive towards the fetus and turn it over on delivery.","commenter_a":"The best thing libertarians could do is reexamine their approach to abortion as their current stand favors personal privacy over personal responsibility and non aggression. Another possibility is to slightly widen the area we need to defend, to treaties,in order to be safe at home. Remember, economic liberty is the most important issue.","post_message":"John McAfee: \"The truth is this year at least there's maybe a 0.005 percent chance that any candidate on this [L.P.] stage wins the election. If we don't, if we get 20 percent, I promise you, if we don't do something to win in a real sense, this world is going to collapse.\""},{"comment_id":"10153249235547894","commenter_b":"here Sharnise Nisec Brown since you are behind on the times lol Lauren Payton Katrina Elizabeth","commenter_a":"Zanehya Rayshaun Corleone","post_message":"Exclusive: K. Michelle Opens Up About Her Relationship with Idris Elba and Backlash from Black Women: ‘The Women I Fight For Have Been The Women That Attack Me’ [Video]"},{"comment_id":"10153424802654255","commenter_b":"Hillary 2016.....@webpagelink","commenter_a":"That'd be great if a liberal were running.","post_message":"When liberals go to the polls, liberals win."},{"comment_id":"10153633611351337","commenter_b":"Joey Nicgorski Edward Contreras","commenter_a":"Thank god!","post_message":"POSSIBLE REUNION? Slash reveals that he and Axl Rose are buddies once more. What does this say for the future of Guns N' Roses?"},{"comment_id":"1211339922259660","commenter_b":"Love it!!","commenter_a":"Next Congress will be investigating the rape charges against Trump..............right? No? How about the fact that he doesn't pay income taxes.......? How about his dealings with China? No! Wait a minute, this sounds like another witch hunt, fact finding repeat of all the other investigations that Congressional Republicans have tried to have brought against Clinton. I've never seen anything like it.","post_message":"\"You are hereby served.\" Rep. Jason Chaffetz served a subpoena demanding the FBI’s full investigative file on the Hillary Clinton email probe. @webpagelink"}]
