[{"comment_id":"10154888080729099","commenter_b":"@username idiot","commenter_a":"Yorkshire UK. Police shot a person the other Day, Last time they shot someone was 6 years ago.","post_message":"Breaking News: Police have shot and killed a man in Prospect Heights. The shooting comes less than 12 hours after an NYPD officer fatally shot a man in Canarsie @webpagelink"},{"comment_id":"10155759756435354","commenter_b":"Such a witch. Don't want people saying these things then start arresting and deporting the mexican criminals and all other illegals because they are criminals just by being here.","commenter_a":"How about giving guns to jihadist to fight Syrian Prez. YOU, Clinton, armed ISIS.","post_message":"WATCH Hillary's Race-Baiting Remarks Slamming Donald Trump"},{"comment_id":"10154293209899153","commenter_b":"What do you mean what is happening...It's been going on for thousands of years....There are POS's everywhere","commenter_a":"What is happening too many men are raping these young children, ladies be careful who you have in your home , keep your eyes on your children at all times never leave them with anyone these days it could be your closest to molest these kids...","post_message":"Joseph Genitempo is accused of sexually assaulting an 11-year-old girl. Anyone who may know where he is located is asked to call the Delaware State Police."},{"comment_id":"545037952353451","commenter_b":"Racist people!","commenter_a":"He is right ON. Sick of all this PC!!","post_message":"This man chose to stand up to Obama's lies, and now he's facing this. What a sick joke. This man needs our help, let's show him we have his back. Do you support this Sheriff standing up to Obama?"},{"comment_id":"10153948445168812","commenter_b":"you gonna adopt it?","commenter_a":"And for Christmas the pup should be freed from its current owners and gifted to a loving home.","post_message":"A pup from Hardin County, Iowa, got a sweet surprise this Thanksgiving when she was gifted a brand new dog house after living outside for almost three years."},{"comment_id":"1069240676520375","commenter_b":"I'm confident Mr. Trump is the answer to America's future. With Obama (or Clinton) . . . America had no future. God Bless President Elect Trump.","commenter_a":"Depends on whom U ask?! Do not TRUST him. He will NOT b under a microscope as Pres. Obama was. He will NOT make America great...agn This country will never UNIFIED....","post_message":"Yes or no: Will Donald Trump be a good president?"},{"comment_id":"1411212282241061","commenter_b":"That's DIRECTED To YOU Mr Joe Biden. .oh my mistake. .mr. Joe bishop!","commenter_a":"Trump is still a fraud and will always be! Go Ted Cruz 2016!","post_message":"The #NeverTrump movement has been around longer than you'd expect."}]
