[{"comment_id":"1685289261757038","commenter_b":"So true. She needs disarm them!!","commenter_a":"not just disarm, but \"quickly\"","post_message":"Hillary said that guns don't keep you safe. If she really believes that she should demand that her heavily armed bodyguards quickly disarm!"},{"comment_id":"1056647814370639","commenter_b":"Let's be honest. HE is not confused. HE is still a MALE. And absolutely a disgrace.","commenter_a":"NO, are you kidding me?","post_message":"Do you agree with MAC's decision? Yes or no?"},{"comment_id":"10157205870170354","commenter_b":"Cats don't like her.","commenter_a":"She can hate him all she wants but I bet more people in this world hate her pathetic ass. She is a washed up piece of shit who is completely irrelevant and means nothing to no one except maybe a few fucking cats","post_message":"Rosie O'Donnell's worst yet..."},{"comment_id":"10153520680806077","commenter_b":"Marine's can be so cocky ugh","commenter_a":"Some people are so trigger happy, its ridiculous and disturbing.","post_message":"Jesse Nelson's 32-year-old brother Christopher was killed after he tried to break into a house in Denver. \"Dying like this, it's not worth it,\" Nelson said."},{"comment_id":"10153846244313984","commenter_b":"Dumb bitch","commenter_a":"Well said Rubio!","post_message":"WOW. Out of all the things she could have been doing, or should have been doing - THIS is what she chooses. It's pretty unreal to think that some people actually want her to become the next POTUS... Do you think it's time for Hillary Clinton to drop out of the 2016 presidential race?"},{"comment_id":"1018417158220401","commenter_b":"That wall will not get built under Obama . To bad election voting wasn't today!!","commenter_a":"Need to do this America Wide. And build the wall Now","post_message":"BOOM! TEXAS Infuriated Obama And Illegals With Their Plan To Protect Texans- Mess With Texas @webpagelink"},{"comment_id":"10153430470412217","commenter_b":"Oh no no no....this woman is only about herself. My America would be a disaster if this witch were to gain the presidency. She is a fake and a phoney. She lies more then she tells the truth. She thinks our rules don't apply to her. God helps us if she wins!","commenter_a":"Speaking as a Scotsman who likes the USA, I think Hillary is the best choice to be the next president","post_message":"The latest in the battle to be the Democratic presidential candidate."}]
