[{"comment_id":"10153100903362061","commenter_b":"She's ugly!!","commenter_a":"Denise has had some work done.","post_message":"Juicy pop news - first photos of Kermit the Frog and his girlfriend Denise have hit the web: @webpagelink - The Muppets ABC"},{"comment_id":"10153183843753188","commenter_b":"Boy if they can do all that in Mexico why are they crossing our borders","commenter_a":"i just came home to Seattle from 10 days in Mexico and it made me think. I think it would be better to be in a country like Mexico if the world went crazy. Those people know how to survive on nothing because they have done it all their lives. They know what to do when the lights go out... they know how to grow food and take care of themselves. I can't even imagine what Seattle would be like if this area was thrown into the same poverty level as Mexico... it would be a mad house!!!","post_message":"I don't watch The Walking Dead like most people..."},{"comment_id":"10152834207221130","commenter_b":"Suzie Mills when all the GB is gone xx","commenter_a":"Mark O'Halloran","post_message":"Practice makes perfect, little buddy."},{"comment_id":"10153527234442434","commenter_b":"Lies! Aryan Jesus is from Florida!","commenter_a":"Bruh, even your religion came from the Middle East, STFU","post_message":"“I’d ask you to go back through history and figure out, where are these contributions that have been made by these other categories of people that you’re talking about, where did any subgroup contribute more to civilization?” asked Congressman Steve King"},{"comment_id":"1115555701831927","commenter_b":"Get and keep satan out of the White House!! SAVE AMERICA TRUMP 2016 ALL THE WAY!!!!!!!!!!!","commenter_a":"Done","post_message":"LAUGHABLE: Clinton Press Secretary Gives Conditions Under Which She Will Give A Press Conference Let's just plan on this not happening...EVER!"},{"comment_id":"1125811740844678","commenter_b":"That is one crazy bitch!","commenter_a":"Am I dreaming?! Bernie supporters BOOED Nancy Pelosi?! Well, YAY! Be still my trembling heart! It couldn't happen to a \"nicer\" Democrat...except for ol' Hillary!!","post_message":"Hard not to enjoy this"},{"comment_id":"10153771650684415","commenter_b":"Wake up!!? Fourty years of Democrats running this country..... Democraps running our country into the ground! EVERY AMERICAN CITIZEN WORKING PAYS 12% of his income to Social Security! Social Security is broke!!! People who have never paid a dime in ..are drawing on it, but they are going to reduce the benefits of those who PAID IN!!! Hmmm.... Only democraps think like that!!! @webpagelink","commenter_a":"Congress makes laws then the Govt turns around and will not enforce them thats why we slowly are losing America to Mexico...our immigration laws are not broken the Govt that will not enforce them is","post_message":"The First Amendment states: 'Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble …' yet despite these constitutional protections, speech-restrictive policies in our nation’s public colleges and universities remain. Today, I sent a letter to 162 public colleges and universities today asking them to update their free speech codes."}]
