[{"comment_id":"10154370353509714","commenter_b":"She must be a psycho...","commenter_a":"I sense a new song coming","post_message":"Taylor Swift and Calvin Harris have called it quits."},{"comment_id":"10153363808198010","commenter_b":"How do we know the restaurant would go out of business anyway? It happens all of the time. I live in Seattle and the rate increase is just slowly beginning to take effect. No conclusions of this sort can be made.","commenter_a":"In Seattle where they just raised minimun wage to $15 a hour some restaurants are now going out of businss as restaurants are having to pass on to their customers a lot higher prices for the food they serve.","post_message":"An L.A. City Council committee has endorsed a hotly contested plan to raise the citywide minimum wage to $15 by 2020, up from the current $9 an hour. The proposal now heads to the full city council."},{"comment_id":"10155247657250294","commenter_b":"Flush her down the toilet","commenter_a":"So very sad.","post_message":"When she was told she couldn't board the plane, police say a Florida woman did the unthinkable."},{"comment_id":"1746066945644780","commenter_b":"Sickening","commenter_a":"If Hillary wins we are fucked. All will end for this once dear nation. Adios America this nation is now a dump China & Russia are the leading nations now. Deceiving Hillary is going to backstab everyone. She will do anything to get your vote but at the end you will see her lies.","post_message":"Does Trump's violent rhetoric and bigotry remind you of something? Let's take a look back at history and find out...  Big thanks to Marianne DeMarco for making this video."},{"comment_id":"10154437348239087","commenter_b":"Crooked swamp dwellers. Lock them up!","commenter_a":"Let's run a government with a weakened opposition and lack of independent oversight. What could possibly go wrong?","post_message":"BREAKING: Republican lawmakers have decided not to strip the Office of Congressional Ethics of its independence following massive public backlash."},{"comment_id":"10154235562969456","commenter_b":"Who's going to put the food on your table ? This country needs illegal immigrants who work for low wedges and keep the prices down .. trump and the gop knows that but keep believing this idiot","commenter_a":"The man never said he was against the Mexican people or their country, traditions, etc. ! JUST those entering our country illegally! Even Hispanics that came to the United States and became citizens LEGALLY, support his platform on this subject. Why would anyone think it’s okay to go to a foreign country, have anything and everything that country has to offer and get it for nothing! I don’t believe any other countries in the world would allow that…why should we?! My husband and children are of Hispanic decent and their relatives came to this country, did what was expected and became citizens legally. It can be done! So, go ahead Donald..build that wal!","post_message":"Despite promises to build a wall along the Mexican border, Donald Trump is still a fan of Cinco de Mayo. >>> @webpagelink"},{"comment_id":"10153867019782061","commenter_b":"That was good","commenter_a":"What an idiot.Typical liberal though.","post_message":"WATCH: Penny-wise or penny-foolish? Man decides to pay a fine with 22,000 pennies, but over-paid doing so."}]
