[{"comment_id":"10153519416973812","commenter_b":"God rest their souls! That sicko should rot in hell!","commenter_a":"R.I.P god bless this good people.","post_message":"These are the 9 people who lost their lives after a gunman opened fire during a bible study at a Charleston church: @webpagelink"},{"comment_id":"10153958527368822","commenter_b":"apparently you havent done your homework or been around long enough to have seen and heard her bigot comments in the past. She stated she will raise all taxes and healthcare. unless you are wealthy and dont care about others who are not your ok with paying more. Also I would still love to see Bush in prison right beside OBUMMER and KILLary. She is not for woman. She was the lawyer for a man who raped a 14 year old girl and got him off. Do some homework. Ive studied both sides and a liar , a cheat and a murderer for president of my country. our country that so many have died for no F_G way. Your so hung up on a stupid wall and blinded on real issues. Our parents and grand parents have worked all there lives for ss and its a loosing battle because the ...","commenter_a":"So to the people that are angry by this. You are willingly admitting that you are and support racism, bigotry, homophobia, xenophobia, getting rid of women's rights, allowing abuse of children and women to be legal. To literally rounding up whole races of people tagging them and putting them in camps. Exactly what the Nazi's did. You are saying that you are unable to think for yourselves, that you think there is this america that you are being held back from that doesn't actually exist. If so I hope you are proud of being a horrific human being. You are a traitor to America and all that it stands for. You are scum, a filthy plague on human society. You are the embodiment of everything that you hate.","post_message":"\"We are a city of bridges, not a city of walls,\" said Congressman Mike Doyle, referencing Donald J. Trump, at Clinton-Kaine rally in #Pittsburgh."},{"comment_id":"1782906415286798","commenter_b":"Old bitch","commenter_a":"I have to believe this woman is mentally ill. I can't find any other way to wrap by head around it. I mean can sane people be this cruel?","post_message":"So awful."},{"comment_id":"1065854716799003","commenter_b":"It looks like a piece of food. Im a Trump supporter. I think these stupid battles between the two are immature and I think making this some huge talking point in the world is exactly why all of us keep electing the wrong people. We care more about a piece of food on someones face then what theyre actually saying. I don't like Cruz. my money is on Trump all the way but we need to all grow up and look at the issues because this isnt Saturday night live. This is real life and the wellbeing of many people is at stake here.","commenter_a":"What about Father's Rights Movement and an overhaul to how child custody and parental time and child support are handled? If elected is Mr. Trump looking at this issue?","post_message":"We will save over $300 billion a year if we properly negotiate our healthcare expenses! #GOPDebate"},{"comment_id":"10155894445780093","commenter_b":"Certainly grown women can make decisions. . And as soon as you grow up, become mature, recognize there is a world beyond our own noses and that maybe a person could be right, or, disturbing for some, a person could be wrong... then they can make decisions. But the arrogant ought to be circumspect.","commenter_a":"One simple question: for the Christians who believe that life begins at conception; if God wants every potential human \"life\" to be born so much so that you have to create laws that every American woman whether they believe the bronze age fairy story or not, why when god destroyed all life during the Noah flood did he kill pregnant women? Or innocent new borns? Weren't their lives so precious too? Square that circle.","post_message":"The deliberate killing of an innocent human being, with the killing performed in such a way as to preserve a of the most valuable parts. That sounds totally ethical, right?"},{"comment_id":"1017433231703049","commenter_b":"Cách đốt mỡ =)))))))))))))))))))))))","commenter_a":"Vivi Nguyen733970070144470 á đm....","post_message":"This is a giant ball of fire ants."},{"comment_id":"10153459295185927","commenter_b":"A radical MUSLIM!!!! Keep searching granny at the airport.","commenter_a":"We do NOT NEED gun regulation. We need ARAB regulation!!!! And we need HEARTS rehabilitated more than ANYTHING!!! We need GOD put back into our country!!! And along with God put back into every American's heart, we need a GUN put into every American's HAND!!!!!!!!!!!","post_message":"UN Human Rights Chief Zeid Ra al Hussein: the United States, however, there are hundreds of millions of guns in circulation"}]
