[{"comment_id":"10153122884761130","commenter_b":"This article suggests I'll never find a smart woman to have kids with. That's disheartening","commenter_a":"Hmmmm.....","post_message":"As if being a woman is just about having kids."},{"comment_id":"10153992733094726","commenter_b":"Beautiful, smart elegant lady","commenter_a":"Let Ivanka rest for a while . she will have a new Baby soon .","post_message":"Trump's wife Melania steps into the spotlight, joining his daughter Ivanka"},{"comment_id":"1823601691207734","commenter_b":"Share it with everyone, we must insure Hillary is not elected!","commenter_a":"\"BILL CLINTON'S LOVING WIFE --- by DICK MORRIS If you happen to see the Bill Clinton five minute TV ad for Hillary in which he introduces the commercial by saying he wants to share some things we may not know about Hillary's background, beware as I was there for most of their presidency and know them better than just about anyone. I offer a few corrections: Bill says: \"In law school Hillary worked on legal services for the poor.\" Facts are: Hillary's main extra-curricular activity in 'Law School' was helping the Black Panthers, on trial in Connecticut for torturing and killing a 'Federal Agent.' She went to Court every day as part of a Law student monitoring committee trying to spot civil rights violations and develop grounds for appeal. Bill says: \"Hillary spent a year after graduation working on a Children's rights project for poor kids.\" Facts are: Hillary interned ...","post_message":"He actually said it."},{"comment_id":"10153082331816600","commenter_b":"I agree Kaliah Nichole! I am not a fan of what Obama is doing either, however, to say that vaccinations don't work is absolutely ridiculous! The comment about hippie is because there are so many people \"hippies in the 70s\" that thought that we were all invincible and that we shouldn't have any restrictions and that the whole world was all about \"love\". This is not a game and even though our children get vaccinated and should be immune and resilient to certain viruses, this is not a game and not all immunizations are foolproof! So it's better to be safe than sorry and if people don't want to have their children vaccinated then they should all go to a communal area and go to school with each other and spread diseases amongst one another.","commenter_a":"Let's BAN @username! Go to a foreign country and bring back all types of diseases and parasites because of your lack of knowledge! Clearly by the looks of your picture you're a hippie who thinks that every thing you do is okay and that your indestructible because you smoke weed! Get an education and do your research!","post_message":"If a parent refuses to vaccinate their child and the child goes on to spread a deadly illness to others, do you think there should be consequences?"},{"comment_id":"619503418188720","commenter_b":"This monkey is a joke.","commenter_a":"Spoken like a true tyrant.","post_message":"Barack Obama: Soft on ISIS, Brutal on States"},{"comment_id":"1813003575594431","commenter_b":"Us white people got to go yuh eard meh","commenter_a":"Were pray tell is this \"white rage\"? I am white and I feel no rage nor the desire to go out in public and carry signs around. I am not happy with where this country is going but I am not out all day every day protesting and tearing things up..oh wait a minute...I work all day.","post_message":"According to a new book by Emory historian Dr. Carol Anderson, many of the struggles faced by the African-American community are the result of \"white rage.\""},{"comment_id":"1129560600439389","commenter_b":"Why doesn't everybody wake up and send them back to their own country WTF","commenter_a":"Peaceful What?! No such thing! All vicious rabid ranting carnivorous things from hell! Satan has sent them from the burning sands of the deserts to murder, rape and pillage all others! Be gone you vermin from the bowels of perdition!","post_message":"HIDDEN CAMERA: This Is How Moderate Muslims REALLY Treat Peaceful Christians!  wow!"}]
