[{"comment_id":"10153823007621636","commenter_b":"The US is no longer safe for the blacks, pls find other homes.","commenter_a":"\"He's put on a paid administrative leave\"!!!!!!! What on earth is happening in America???? These are not police officers in fact they're BLACKAMERICANKILLERS.. cos surely where I live police officers protect people from harm and do not to blindly shoot them.","post_message":"In North Miami"},{"comment_id":"1237347102949965","commenter_b":"You and me, (and millions of others, I'm sure), both!","commenter_a":"It isn't because she's a woman. I would stand in line for 5 hours to vote for Elizabeth Warren. Hillary? *shrug* It better be a short line.","post_message":"Here’s a strong but fair piece from the heart on the media establishment in DC by CNN’s Jeff Greenfield, whose long experience in politics and journalism began with Robert F. Kennedy back in the 60s."},{"comment_id":"10153026521466955","commenter_b":"Women of the world just took a hit, sorry","commenter_a":"it's all lies and if you even think for a moment it's true then your the fool","post_message":"MAG: Bruce Jenner 'Transitioning into a Woman'... Filming momentous docu-series..."},{"comment_id":"10153474188676350","commenter_b":"But they can't make babies it takes a man and a woman to have s baby","commenter_a":"So wrong","post_message":"#BREAKING: Supreme Court makes same-sex marriage legal nationwide in landmark decision."},{"comment_id":"10153787170708338","commenter_b":"@username would you like an A for English ? You got the picture right? That's all that matters, just for you I'll make it politically correct Lose!!!! Here you go","commenter_a":"Round the gangbangers up, they need to see what it looks like to lose an innocent child!!! Round them up and have them put in detainee prisons and ship they butts off to a open area so they can be at war with each other so that Chicago can live in peace!!! No need for burials and insurance just leave them right where they lay!!!! This is truly sad , this baby won't see thanksgiving or look forward to the surprise of his favorite gift on Christmas","post_message":"Visitation for 9-year-old Tyshawn Lee is being held today at Haven of Rest Missionary Baptist Church. CBS2's Mai Martinez will have a live report at 5:00 PM."},{"comment_id":"1033684776642992","commenter_b":"Really???? No more than white folks killing each other!!! Racist azzes!!!","commenter_a":"where is black lives matter now?","post_message":"A deadly weekend"},{"comment_id":"10157863685855354","commenter_b":"she will be the death of our country","commenter_a":"She ain't no lady. She's a hydra. Think about it- during the whole day every MSM outlet was focused on a 10 yr old comment while- An arms dealer was not charged because he said he'd tell on POTUS and Clinton Russia had drills for its citizens to go to underground shelters The FBI was caught being more than complicit in helping destroy evidence The internet was given away The UN is coming for our small arms- both thanks to POTUS","post_message":"JUST IN..."}]
