[{"comment_id":"1260826810599396","commenter_b":"Fuck her","commenter_a":"Carla A. Auguste Imani Rice Qiana Lewis Shequla Mason @username","post_message":"For everyone who hates Sallie Mae..."},{"comment_id":"1641151569508654","commenter_b":"'@username: no fault but Puerto Ricos...pretty sure they had a chance to vote for independence, and y'all didn't take it. You can have all the cultural pride you want...but it's the Olympics man, it is only for countries to compete in. Why not have Coca Cola and Pepsi join in?","commenter_a":"The underdog defeating the #2 in the world for gold.. Monica eres grande!!! PUERTO RICO!!! and to the bunch of salty Americans go read a book and learn about the damage the USA has done to PR!!","post_message":"After some of her more dramatic points, fans were shouting 'Si se puede' and waving the flag of Puerto Rico."},{"comment_id":"10153430098934342","commenter_b":"Lame","commenter_a":"Keep control of your dog. If your uncontrolled dog bites someone it is a felony.","post_message":"The dog darted between her owner's legs and out the door. Seconds later, the beloved pet was lying in a pool of blood."},{"comment_id":"10153185628051615","commenter_b":"Dude we should just start bombing them f*** that worry about the details later","commenter_a":"Come on. Can we stop leaving out important facts like that the passport was likely planted AND fake? World and even French news is properly reporting that. @webpagelink","post_message":"LATEST: A French official says the suspected mastermind of the Paris attacks was also linked to thwarted train and church attacks. Channel 11 Morning News will have updates all morning long."},{"comment_id":"10153265527170950","commenter_b":"Oh stfu","commenter_a":"The blood is on their hands. This is a typical reaction from a Liberal Democrat.. Like a small child they point the blame on some one or something else.. The Democrats have made California a safe haven for Illegals, Criminals and Terrorist with their Sanctuary and open border polices.. The Blood is on your hands Moon-beam.. You and your Lawless Democrats. @webpagelink","post_message":"'Increased surveillance, creating relationships with mosques in the Muslim American community across the country. We did that after 9/11 and prevented attacks in New Jersey and all across the country.'"},{"comment_id":"917042908355458","commenter_b":"Shut your moaning you wench","commenter_a":"so all three of them are showing themselves to be dickheads!!! i hope to god they dont get another show. may and hammond are basically saying its acceptable to punch an employee! DISGRACEFUL!!","post_message":"Top Gear's May and Hammond ‘WILL quit with Jeremy Clarkson’"},{"comment_id":"1153087074711321","commenter_b":"we need more sex workers to solve crimes the cops can't","commenter_a":"They should give her an award. She has saved countless lives.","post_message":"Police found what they described as a 'kill kit' in the trunk of Falls' car — including handcuffs, several long knives, a box cutter, two axes, a machete, a sledgehammer, a bulletproof vest, another gun, shovels, a rubber tub large enough to hold an adult, and bleach and other cleaning supplies."}]
