[{"comment_id":"611608348972347","commenter_b":"You just broke the Internet with that post!!!! Lmao! I DESPISE HER! And her INNER GODDESS! Freakin lunatic!","commenter_a":"Just seeing Oprah made me want to take a dump.","post_message":"Absolutely brilliant write up."},{"comment_id":"1015647588491215","commenter_b":"@username Hillary hasn't officially won the nomination there my dude... Did I say I was voting for her?","commenter_a":"In his defense, and I am in no way voting for this guy, he said the economy ran better under democrats but it SHOULD NOT be that way. So, that plays into him wanting to be a different option within the party. But whatever, the guy is a moron and I'm voting DEM!!","post_message":"LOL, WOW. You could ask this guy what he had for breakfast, and his answer would change from one minute to the next.   Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"496338953890018","commenter_b":"Dumb as hillbilly racist. This ain't your country. You must of been beaten to many times by your hillbilly husband. Stay the fug out of their area then. You KKKrackers have many don't go zones, outsiders not welcomed. Most trailer parks in Auburn CA. and any white town in Mississippi. Live and let live mafaacaas!","commenter_a":"yes spray the area with pig fat","post_message":"First our schools, then our public areas, what's next?  'SHARE' this post, we have to let the nation know what the MSM won't.  Do you agree Shariah must be stopped?"},{"comment_id":"928783390554410","commenter_b":"This is who he is at his core. This is what he will be. He has done us the great service of showing his true face, not the shiny, practiced veneer of the professional politician. Whether he learns to act presidential or not, this is the man you will be getting if you vote for him, a man who wants to pull out a measuring tape to settle disputes over issues. The fact of the matter is that there are no good choices this time. There aren't even any ok choices. But this man is a bully with all the character flaws that go with that, and he will do almost as much damage to this country as Clinton or Sanders. I am seriously dismayed by the continued popularity of this man, but I am equally dismayed by my other choices. And I am dismayed with a general electorate who ...","commenter_a":"It's past time for him to be acting more presidential. He also needs to do some research in preparation for the debates. Chris Wallace made him look like a fool when he put up those slides on his economic plan. He's making it harder and harder to not only defend him to skeptics, but to also remain an enthusiastic supporter instead of being a reluctant one.","post_message":"Despite what polls had shown days before Super Saturday, DONALD TRUMP lost two of the four states on Saturday to Sen. Ted Cruz, and the states he did win were at a lesser margin than predicted.  Some supporters and pundits are placing the blame on Trump's performance during the Thursday night debate, stating his \"less than presidential\" behavior is catching up to him.  In the past, DT has stated he will act more presidential when the time is right, so we ask you to take our poll knowing DML will read the results later tonight on UNFILTERED.  POLL: Does Trump need to act more presidential in order to win?  @webpagelink"},{"comment_id":"10153670710614255","commenter_b":"Nitwit with not very many followers - whew!","commenter_a":"Check the 14th Amendment Mike - you are dead wrong.","post_message":"Facepalm."},{"comment_id":"10153582550231336","commenter_b":"Hi Donald Trump, what about putting those illegal people in the row to go fight against IS IS if they want to stay so bad. The America way!!!!just a thought.","commenter_a":"Hillary will send food stamps.","post_message":"In an interview, Donald J. Trump said that he would deploy U.S. troops to Iraq to seize ISIS-held oil fields, in order to choke the financial spigot that fuels the terror group."},{"comment_id":"10153302851129087","commenter_b":"@username Medicare advantage.","commenter_a":"The ACA made billions in cuts to medicare.......","post_message":"\"[W]hy do Republican politicians keep bringing up the idea of cutting or eliminating Medicare, a losing proposition among every voting group, including Republicans?\""}]
