[{"comment_id":"936091029833983","commenter_b":"Shut up LIBTARDS","commenter_a":"Trump 2016.","post_message":"We have a message for Donald J. Trump: We're going to do everything we can to make sure you never become president. Sign this letter if you agree: hrc.io/2aaJYl5"},{"comment_id":"10153666561423984","commenter_b":"She doesn't know her ass from a hole in the ground.Correction,she know what her ass is huge.","commenter_a":"Kardashian doesn't have the brain capacity to make those decisions and you better believe Kanye has security we don't have. Go live in the hood, kimmie, and then you can tell us how to protect ourselves.","post_message":"BOOM! Kim K thought she'd talk about gun control laws, and it immediately blew up in her face.   Do you support gun rights in America?"},{"comment_id":"10156214197580725","commenter_b":"Right!!...She belong in JAIL, PERIOD!! PERIOD!!!!","commenter_a":"You're all ignorant","post_message":"Check out OAN and compare to what you are watching now! #DemDebate"},{"comment_id":"1012675578755490","commenter_b":"Stupid women","commenter_a":"shut up skanks, cancel the p.o.s....","post_message":"Umm ACTUALLY it is in the Bible!"},{"comment_id":"10154623133343812","commenter_b":"maybe you cheat a wife","commenter_a":"Bill stated how wonderful a wife Hillary is...question...why did you have all those affairs then Bill???","post_message":"JUST IN: Tim Kaine officially wins the Democratic vice presidential nomination. @webpagelink"},{"comment_id":"1221087354570479","commenter_b":"It is French and Spanish ancestries some of the women probably do have more hair than the guys... I should know I was one pretty hairy teenage girl growing up in New Orleans!","commenter_a":"school board has a policy that does not allow any facial hair on male students, Tangipahoa Parish school superintendent Mark Kolwe told ABC News. So female students can have facial hair? Seems sexist to me.","post_message":"The school told all students with facial hair that they had to shave before the ceremony, but the rule was not enforced during the school year."},{"comment_id":"10154450700759411","commenter_b":"Not Only Gay, what about all females that Catholic Church burned at dark age?.","commenter_a":"We all need to REPENT turn from our wicked ways and worship the Lord Jesus. Judgment will come to all when the lord returns... Even the Pope will be judged for his words and actions.","post_message":"'The questions is: if a person who has that condition, who has good will, and who looks for God, who are we to judge?'"}]
