[{"comment_id":"1585670881742175","commenter_b":"DRAIN THE SWAMP","commenter_a":"END THE CORRUPTION!","post_message":"WATCH LIVE: Donald Trump campaigns in Golden, Colorado before he comes to Phoenix."},{"comment_id":"836581726388456","commenter_b":"I've always respected women.","commenter_a":" declare to you today that you shall surely perish. You will not prolong your days in the land where you are crossing the Jordan to enter and possess it. 19\"I call heaven and earth to witness against you today, that I have set before you life and death, the blessing and the curse. So choose life in order that you may live, you and your descendants, 20by loving the LORD your God, by obeying His voice, and by holding fast to Him; for this is your life and the length of your days, that you may live in the land which the LORD swore to your fathers, to Abraham, Isaac, and Jacob, to give them.\" Now you anti's are taking the Bible out of context.....","post_message":"Powerful words to live by."},{"comment_id":"606394809493701","commenter_b":"Wish they would come here n do that to woman who use lil kids as weapons against their Dads .","commenter_a":"Christians werent complaining when they wiped out the indians or burned people in the south","post_message":"Show this a liberal."},{"comment_id":"551801648301945","commenter_b":"I don't get it?Hillary will finish off this country!why not trump?He loves this country,He loves our military,he will get jobs bk from china&other countries that are ripping us in every way,He is rich enough that he doesn't need donations or special interests groups.That sounds a lot better than flooding America with illegal immigrants,Raising Taxes,&bankrupting the Country.","commenter_a":"I like Sanders but I believe he is too far left to win. Hillary has baggage but I believe she can win. Either way we have to keep the GOP out of the White House","post_message":"No matter which candidate you support - attacking each other isn't helping the cause. ~Marty"},{"comment_id":"987364064653456","commenter_b":"What about the case of the stay at home mom, divorces, etc. where does she fall in your explanation Michael?","commenter_a":"Keep it in your pants or out of your pants until AFTER you finish school. I don't have to pay for your daycare.","post_message":"Juggling the demands of an education with parenting is a reality for over 25% of American college students—and it’s time that we create affordable childcare options for those seeking a degree."},{"comment_id":"1446844205342023","commenter_b":"She needs to STFU!!!","commenter_a":"Why publicly, tho? 😡","post_message":"This woman has some nerve...."},{"comment_id":"10153882907494024","commenter_b":"The monkey bitch and her brood can't be gone soon enough for my taste.","commenter_a":"She complains about the \"house\" she lives in. Is she chained to the wall-?? Just move, bitch-!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"}]
