[{"comment_id":"10152658419777894","commenter_b":"Girl Bye!! Bitch Please!! #DelusionalWhore","commenter_a":"Get her life....","post_message":"Say What Now? Joseline Hernandez Says She 'Knows for a Fact' that Cookie Lyon from 'Empire' is Based On Her [Video]"},{"comment_id":"10153246280989411","commenter_b":"Why there is nobody helping Palestine. Come on Russia or China. Could you plz give Palestine nukes. Let those two countries to finally start playing a little more realistic games.","commenter_a":"So they are trying to destroy them............fuckers...","post_message":"'Israel cannot maintain military control of another people indefinitely.'"},{"comment_id":"755392124560784","commenter_b":"Happy New year","commenter_a":"Go Bernie..he's the right person for the job!!","post_message":""},{"comment_id":"1159474340740147","commenter_b":"we don't give flyin fk what she does lmfbo she is a pig an evil ugly witch","commenter_a":"Donald Trump CNN just reported you declined an invitation to speak at the NAACP convention. Are you nuts? Hillary accepted, you declined. All I hear about is how hillary is sensitive to the American people and even though she is a liar, there are a whole lot of American people that believe her. Right now I hear her speaking in a calm mature voice how this country is divided. Wow is she tearing your character completely apart. It's all about you she is saying. All this is about you. I got to tell you Trump old man, she is using every lying skill she has to make you look bad. Real bad. A bad guy. Yeah a real bad guy.","post_message":"I agree! Lets MAKE AMERICA GREAT AGAIN...VOTE FOR TRUMP! Thank you for your support- it means the world! DJT"},{"comment_id":"10153433467800950","commenter_b":"Lmfao living in the hood ...Girl u crazy ..","commenter_a":"I don't care how you spin it...I feel for this man...we send our children off to defend a country that doesn't give two shits about the lives of those we send!!! We expect them to come home the same as when they left after killing people and watching theirs friends die...REALLY?! He was a kid who got caught up in and then taken against his will..He suffered years of torture and now we want to punish him more...I'm sorry but that is as wrong as you can get!!!!!","post_message":"In October, the leading GOP candidate called Bergdahl a \"traitor, a no-good traitor, who should have been executed.\""},{"comment_id":"10154550088456633","commenter_b":"I don't know HOW she got pregnant, she is such a tease!","commenter_a":"Oliver is pacing more this morning!","post_message":"Will today be the day? When will New York's April the giraffe give birth? More info >> @webpagelink Stream via Animal Adventure Park in New York."},{"comment_id":"970408816303922","commenter_b":"John, women don't care what you think is acceptable. Abortion is a legal medical procedure. Women don't need your approval, your acceptance, or your opinion. Do you expect women you've never met to weigh in on your private medical decisions? Of course not! Stop being so arrogant. What isn't acceptable is your flawed thinking that you can control a woman. You can only control yourself.","commenter_a":"\"Birth control\" is a misnomer. If one thinks about it, it signifies controlling an already conceived being. Therefore, i do not embrace birth control. Like stopping birth. I do embrace control prior to the embryo attaching itself to the wall of the uterus. We need to find a name for that.","post_message":"How you REALLY stop unintended pregnancies."}]
