[{"comment_id":"910598689036384","commenter_b":"You belong down in NO with the rats. You must be proud to live in one of the shittest places on earth. Simple math there's more whites than other races of course its going to be a higher number.","commenter_a":"What choice do they have? They were forced into this public position. They can't exactly say \"please burn these racist institutions to the ground until America really feels our pain\".","post_message":"Freddie Gray’s family asks for calm in Baltimore."},{"comment_id":"1060970767293401","commenter_b":"Diana Serrano those hard headed girls just don't listen!!!","commenter_a":"Hahaha.... Acha hai acha hai","post_message":""},{"comment_id":"10153648963644203","commenter_b":"I assure you, Hillary has more political experience than ALL the male candidates. Her being female just makes it better. You men who hate powerful females are gonna be maaaaad! lol","commenter_a":"I think so. It's equally difficult to imagine what Hillary Clinton's appeal to anyone, women included, is.","post_message":"\"Being a woman does not give you the right to be the next president. Whether you Carly Fiorina or Hillary Clinton. It going to be your campaign that matters.\""},{"comment_id":"1027708620606666","commenter_b":"They have no sense of humor! They can not take any kind of criticism or satire! The most boring people on this planet!","commenter_a":"Because he exposes the truth of Muslim infiltrators! Roaches hate the light.","post_message":"Why is designated terrorist group CAIR condemning this FOX News report about Muslims as “racist and Islamophobic?” What ‘race’ is Islam?"},{"comment_id":"10152874600638598","commenter_b":"The men in China are becoming desperate for wives and there is none to be had. Men are now kidnapping small girls to keep for wives.","commenter_a":"I don't see any of you adopting the millions of unwanted children from china. The thrown away ones because they were girls, or the second child. The unwanted and given up for adoption, living in an orphanage or on the streets ones.","post_message":"China Has No Plans to Suspend Its One-Child Policy Resulting in Forced and Sex-Selection Abortions"},{"comment_id":"443280275797013","commenter_b":"Its not just the cops with thug goggles on. The actions of blacks in Ferguson and Baltimore do nothing but reinforce that view. Racism, disrespect of laws and common decency toward others and their possessions, just begets more of the same focussed in the opposite direction.","commenter_a":"You are so racist against white people it's not funny.","post_message":"As a news team, we are not agreeing with either side of this photo as a philosophy but sharing it for perspective and as a piece of artwork which should generate honest conversation."},{"comment_id":"10153284046734228","commenter_b":"Th!at girl blacked her eye","commenter_a":"That dude is either Prior service (MP) or a local cop. His entire demeanor and physical behavior scream it. I don't think brandishing was the best idea either way..","post_message":"Teens who frequent the skate park say they aren surprised by the fight, but they can believe how it was stopped. A man pulled a gun. - @webpagelink"}]
