[{"comment_id":"1365265100160183","commenter_b":"Joseph, a woman gave birth to a shadow demon in (I think) season 2.","commenter_a":"Its time to give serious thought of graduating this show to the big screen. Follow the same playbook used by the James Bond.","post_message":"All good things must come to an end. Unfortunately, Game of Thrones is one of them."},{"comment_id":"882172088504463","commenter_b":"Do you guys know Bernie is a SOCIALIST.. A SOCIALIST !!!! why do you guys hate America so much, I tell you why, because YOU HAVE NO IDEA HOW IT IS TO LIVE IN A SOCIALIST SYSTEM , go to any South American Coutry , tell any parson who have lived under this system that YOU support a Socialist in America, be careful you might get your ass kicked due to stupidity ...pick a Socialist country, live there for 6 months then wee talk ....IGNORANT!!!!!!!","commenter_a":"It's one thing to get elected as Mayor of Burlington, VT, then, Congress, and the US Senate with a population of 800,000 where $5 or $10 makes a difference and running for President. We all know the game is fixed. And, as an incumbent, it was fixed in his favor.","post_message":"Five years ago, the Supreme Court issued what I think is one of the most disastrous decisions in its history, Citizens United v. FEC. Billionaires buying elections is not what our Constitution stands for. Add your name to my petition if you agree that our democracy is not for sale: @webpagelink"},{"comment_id":"10153952652862293","commenter_b":"I guess you are happy with the Clinton globalist international crime family in the White House (along with the money laundering Clinton Foundation). She will continue to ship your jobs overseas (she supports NAFTA and the TPP), promote open borders that bring in criminals and support unlimited immigration of Muslims bringing Sharia Law and terrorism. Maybe you could then move to a \"no go zone.\" Ask Europeans (and the people in Dearborn, Michigan) how that is working for them?","commenter_a":"How is it not completely obvious to anyone with two eyes that this family is a bunch of con artists? Literally nothing they say is true. And half the country wants to give the most important job on the planet to this guy? Amazing.","post_message":"Eric Trump said he could not name a single instance when his father had given such a gift."},{"comment_id":"10154004463969060","commenter_b":"We did, we along with many other countries liberated Europe…you're welcome. But in all serious we have and we continue to do, but we know when we're being played! But you're so busy with statistics, you failed to look over the problem! You need to understand the difference between migrants and refugees! The human catastrophe you're talking about is in Syria, they're refugees (although most are single males - who should be heading in the other direction to fight for there freedom and their families) The majority are economic migrants (for outside the EU), exploiting the current situation - and Germany.","commenter_a":"She does what she thinks it's good for Germany and EU, and not what she thinks would give her more votes!!!!!!! That's the difference!!!!!!!","post_message":"“I don’t have a Plan B,” she said with fighting passion. It is “my damned duty” to find a common path for the EU"},{"comment_id":"10154441251316756","commenter_b":"Dousing has been around for a long time.","commenter_a":"Funny how those diving rods never find the plumbing or septic tanks..","post_message":"Our reporter says the rods she was holding \"forcefully cross[ed],\" without her moving them. She doesn't know how it happened."},{"comment_id":"1190551201025975","commenter_b":"You can now add Tucson to the list of sanctuary city's. We should recall the city supervisors. Our southern border is now wide open. There want to increase the city sales tax to take care of the influx of illegals.","commenter_a":"Has anyone else noticed that whether the terrorist attack is in Europe or America, the police and other authorities already know about the terrorist? Just asking.","post_message":"The Berlin attacker was a refugee and known terrorism suspect, and Germany still didn't deport him! How will this affect Donald Trump's America? Your hosts: Christopher Bedford, Katie Frates and Saagar Enjeti."},{"comment_id":"10153302910759087","commenter_b":"But the sheep love the Queen of BS and her Lies, Hillary the evil millionaire theft by deception. and lair","commenter_a":"Carly doesn't back down from a fight. I would NEVER go on that show after that BS. She's a better woman than I!","post_message":"“My message to the ladies of ‘The View’ is, ‘man-up,’” Carly Fiorina said. “The Obama administration, for example, has been bad for women. Planned Parenthood is harvesting body parts. If you don’t like those facts and those messages, than man up and debate me on them. Don’t sink to talking about my face.”"}]
