[{"comment_id":"10153131425722293","commenter_b":"They are our imagine of the 'freedom' .","commenter_a":"Yes.","post_message":"Experts fear a whole slew of risks that may follow should these tribes come into full contact with the outside world."},{"comment_id":"10153300908534411","commenter_b":"She doesn't want the truth.","commenter_a":"Blacks kill more blacks if you really want the truth.","post_message":"An analysis released last week shows that more white people died at the hands of law enforcement than those of any other race in the last two years, even as the Justice Department, social-justice groups and media coverage focus on black victims of police force."},{"comment_id":"10153525058378984","commenter_b":"I I do not believe in Political Correctness, I believe in following and standing for my Christian Convictions, and e e expecting others to respect me and what / how I live, as much as I respect others .... and I do not need the Government to tell me how to do it or try to force me to abandon any part of my faith.","commenter_a":"Frankly I dont give a damn what they say.","post_message":"Wow, I thought I'd heard it all from the politically correct left, until I saw this...  Do you think liberals are getting out of control with their constant censorship of America?"},{"comment_id":"10150664369884999","commenter_b":"Rule of thumb: Economists don't generally have armies at their disposal to help overthrow democratic governments who oppose their 'theories.'","commenter_a":"You'd think true conservatives would be happy about the expansion of rights (gay marriage) and making sure everyone chips in on the healthcare system everyone uses (Obamacare). I guess they're not conservatives, just simple Republicans.","post_message":"The way some Republicans tell it, America is a pretty awful place these days."},{"comment_id":"10153767217919497","commenter_b":"Let's really make a team effort to versnitchinize the fizemignots.","commenter_a":"Area intern tells employer 'I'm more into first person shooters, than platforming' is fired on the spot","post_message":"The buzzword has yet to be expounded on or put in context by anyone at the company."},{"comment_id":"10155176603990389","commenter_b":"Don't know of anyone who did. Won by fraud.","commenter_a":"I didn't vote for this useless President!!!","post_message":"ICYMI: Republicans cheered as President Barack Obama said “I have no more campaigns to run.” Obama, cracked a smile and responded: “I know because I won both of them.”"},{"comment_id":"1044972152190462","commenter_b":"My penis book says the penis breaks off and swims after her! !Get away from me you dick!!","commenter_a":"lol","post_message":"Via Sciencegasm."}]
