[{"comment_id":"10153514022490047","commenter_b":"Why couldn't they give birth control wouldn't that been cheaper going have to do better than that","commenter_a":"Except what little they give women for birth control. When I couldn't afford birth control, much less a birth, they were there to help.","post_message":"A senior Planned Parenthood abortionist was caught on camera detailing how they \"crush\" the baby and sell the organs.       Planned Parenthood must be stopped.  SIGN our petition to take action: @webpagelink"},{"comment_id":"10153095720526051","commenter_b":"You poor sick woman, you must have never gone to school ever.","commenter_a":"Not saying what he did by any means was right.... But blacks are openly threatening to kill us everyday... The Black panthers said they were going to bomb white nurseries and how they need to rape and kill all white women and children. All this can be looked up. There are numerous hate crimes committed by blacks against whites everyday yet finally a white boy snaps and it's everywhere on fb and everyone wants him publicly hung. Obama is now pushing his gun control bs again over this but why doesn't he do that over the thousands of shootings everyday pointed towards the black on black crimes? Open your eyes people... I think you're all missing the much larger picture here.....","post_message":"Dylann Roof just confessed to the #CharlestonShooting. He says he had just one goal in mind when he opened fire."},{"comment_id":"1420936454624649","commenter_b":"I hope that this administration will figure out how to keep us safe without becoming totally isolationist. Not all immigrants or Muslims are terrorists. Weed out the bad but don't turn away those who honestly need our help and who only want to make this counrty a better place.","commenter_a":"Do you know you have done more than every other country to help?","post_message":"Senior Politics Writer John Haltiwanger is at JFK International Airport where there's a massive protest against President Donald Trump's refugee and Muslim traveler ban."},{"comment_id":"1276618955685054","commenter_b":"When are these yahoos going to discuss issues that are important to the American people???","commenter_a":"The funniest joke is Rubio not winning his own state. Hysterical. \"Two weeks left buddy, & counting.\"","post_message":"Spray tan? Is Marco Rubio trying to beat Donald Trump by doing his best impression of Donald Trump?"},{"comment_id":"10153067391792217","commenter_b":"One day all Europeans will see how big mistake s to accept those who come as victims and in the future their children will try to impose sharia law","commenter_a":"It's a big mistake Europe is doing. They will regret in 10 yrs time. Why can't the arabs countries take them. Sorry for the Europeans. They will lose their freedom for sure.","post_message":"The plight of people trying to reach Europe is moving many to declare \"Refugees Welcome\"."},{"comment_id":"10154460256056509","commenter_b":"Let's not forget she's a sleazy hooker who is doing the work of an immigrant that no American would do.","commenter_a":"Oh so what! trump made fun of Bush having his 90 yr okd Mom campaigning. At least you can understand her, unlike Trumps trophy wife who needs speech lessons. Do we really need a flotus who barely speaks u derstandable englush!","post_message":"See if you can tell why Ted Cruz's campaign pulled this ad."},{"comment_id":"10154656538916037","commenter_b":"Did she forget her campaign started birther in 08. non issue move along...Besides Obama is not running...","commenter_a":"Thats the problem here, nobody questions.... Some Americans are like a bunch of sheep","post_message":"“For five years [Donald J. Trump] has led the birther movement to delegitimize our first black president.\""}]
