[{"comment_id":"10153095086985496","commenter_b":"I ain't never seen a man look like her from the neck down. Really???","commenter_a":"Just don't get how people beating the crap out of each is a sport and other makes them role models, I always taught my kids not to fight.","post_message":"The reaction may surprise you (then again, it might not): @webpagelink"},{"comment_id":"1710140202573363","commenter_b":"I know it will be hard for Trump to send back all of the illegals, but he'll try his damdest. I hope he goes after the ones that are draining our system and leaves the ones that are hard working and honest people with good families not asking for handouts. Once we get rid of all the sponges in this country then we only have to deal with the riff raff , junkie americans that we already have to support!!","commenter_a":"Hallo everyone economy is getting worse because of Obama's and Bush's stupid policy so we need to make great world with Donald Trump.No to unlegal immigration no to Islam","post_message":"The economy is bad and getting worse-almost ZERO growth this quarter. Nobody can beat me on the economy (and jobs). MAKE AMERICA GREAT AGAIN"},{"comment_id":"10156504920260389","commenter_b":"Yes. Keep replying on this joke of a feed.","commenter_a":"Do we expect Sheriff Clarke to say anything different. Why doesn't Mr. Hannity ever have some real dialogue on his show. I would have more respect for him. I have been following Mr. Hannity for about 10 years now. His revolution is taking forever. I don't think it will ever come. if Mr. Trump is elected is that the revolution. Senator Cruz is the only true Conservative. But in today's world conservatism means unyielding which is not a good thing. President Reagan would be turning over in his grave if he saw what was happening to the conservative movement in our country today","post_message":"Milwaukee County Sheriff David A. Clarke Jr. had some strong words on \"Hannity\" tonight for President Obama, Hillary Clinton and the Democratic Party in the wake of Obama announcing his planned executive action on gun control."},{"comment_id":"10154532453451051","commenter_b":"@username, do you kiss your boyfriend with that mouth?","commenter_a":"You're goddamn right I do. Hope he cracks down on the obstructionist Dems swiftly, and mercilessly, and for those who will inevitably say \"Oh, but the GOP were nothing but obstructionist with Obama! Buhuhuhu.\" To that I say: Elections are a game of King of the Hill, we now have the Hill and soon all 3 branches of Government. I'm not gonna entertain that \"moral high ground\" game, no, this is strategic warfare plain and simple, and we have the strategical advantages.","post_message":"Do you support Jeff Sessions as attorney general?"},{"comment_id":"425439057626422","commenter_b":"Can you imagine an entire supreme court of Ginsburgs? Elect Hillary and we'll have it. She is a wretched witch that is a discrace to the court and she's not alone.","commenter_a":"She woke up cranky from her nap.","post_message":"It was completely inappropriate for Justice Ruth Bader Ginsburg to attack Donald Trump’s candidacy. This is not the role of the Supreme Court, and it serves as another reminder of what we’re up against in 2016. Help me fight for the Constitution and protect the integrity of the Supreme Court by joining my Fight for the Court campaign. www.fightforthecourt.org"},{"comment_id":"822966724405417","commenter_b":"Does anyone that says she was young and dumb and made a MISTAKE? THIS WOMAN WAS IN HER T H I R T I E S. The ones that are saying must not know this. So, therfore, there is no forgiveness and she will always be a TRAITOR PERIOD!!!!!!!","commenter_a":"The photos were not the biggest mistake. Her biggest mistake was even going over there.","post_message":"Jane Fonda has changed her tune. She apologized for her Vietnam photos. What do you think? Better late than never, or too little too late? Should she be forgiven?"},{"comment_id":"10153008628783721","commenter_b":"of course I'm involved!","commenter_a":"Sara Kasperski are you involved? I know Shia is...","post_message":"The watchers become the watched."}]
