[{"comment_id":"1174271395944428","commenter_b":"The real Hillary afraid that the porn industry wont donate money to her or maybe they have some film!","commenter_a":"Perhaps under the advice from Bubba, he's planning ahead! Lol","post_message":"Hillary Clinton refused to sign a pledge Monday that would protect children from exploitation by the porn industry."},{"comment_id":"1128902297147109","commenter_b":"go home...STFU!","commenter_a":"Kasich you are an idiot!!!!!","post_message":"John Kasich said of the idea: \"It doesn't feel right.\""},{"comment_id":"10153113291310667","commenter_b":"He needs nothing...but some of his followers want to contribute anyway..Trump for president 2016!...","commenter_a":"Only person that can change America.","post_message":"He says he doesn't need the money -- he's getting it anyway."},{"comment_id":"10153064906873984","commenter_b":"Providing we can sue you - You don't even secure the borders .","commenter_a":"Another Hitler.With his name being Barrack Hussein Obama,what do you expect. He's proud of his name,and being a Muslim.","post_message":"A government in control of all cyber space is slowly taking shape. Consider yourself warned."},{"comment_id":"1126542647424270","commenter_b":"@username oh I wouldnt doubt that, that witch needs to go down!!!!","commenter_a":"Not the first time this reporter has accused someone of the same type of assult, just another reporter looking for the spotlight!!!!","post_message":"The Secret Service just dropped a massive bombshell about the charges against Donald J. Trump's campaign manager, Corey Lewandowski... this is huge. What this agent says about the \"assault\" will completely change the case..."},{"comment_id":"814443405353112","commenter_b":"if that be the case then throw the Muslims out!","commenter_a":"And what if their choice of attire offends Americans? Will they change their dress code? I doubt it. Squeaky wheel getting attention yet again","post_message":"Catholic University Investigated for Having Too Many Crosses Because It’s Offensive to Muslims @webpagelink"},{"comment_id":"1284368551656196","commenter_b":"It is true that staying home and taking care of the kids is cheaper but also if both parents are working to meet their needs then they can apply for daycare help to cover daycare instead of staying home and collect food stamps and cash from the government.. I'm a single mother and I was working full time and couldn't afford daycare or a full-time nanny and I did went to get help and they cover the daycare or babysitter cost...some people work half on the books and half off the books just so they can collect government help I see it every day...","commenter_a":"Is taking care of several under school age children not a full time job That mothers are not getting paid for. What should they do . For food .","post_message":"EXACTLY!"}]
