[{"comment_id":"1099878783413317","commenter_b":"Thank-YOU!!!!!","commenter_a":"Damn good question! Ask obama!!","post_message":"America's Freedom Fighters"},{"comment_id":"962643217106352","commenter_b":"all i can say is zombies! now we have to worry about zombies crossing the border, thanks south America.","commenter_a":"Freaky.","post_message":"A family in Honduras that claimed teen was screaming from inside her coffin have made international headlines with their actions."},{"comment_id":"10153147518933984","commenter_b":"This guy must be screwing oshithead or he wouldn't get so mad.If he loves illegals so much he needs to go live with the scum.If the illegals get into our country,crime will run rampant.","commenter_a":"Vote the asshole out next term.","post_message":"Who does he think he is to make these kinds of threats?"},{"comment_id":"1033502426742811","commenter_b":"True!","commenter_a":"That cop had been dismissed from another police dept for being 'too immature to handle a gun' and lack of ability to follow orders. Fact.","post_message":"BREAKING: a grand jury has chosen not to indict the cop who murdered Tamir Rice in cold blood. Something is seriously wrong with our criminal justice system when a cop can kill a fully innocent kid with impunity. Read more here: @webpagelink Image by Occupy Democrats, like our page or more."},{"comment_id":"10152836781859117","commenter_b":"Couldnt agree more. My sister had to go take a nursing exam the day after her 6 year old son died. Then missed the following exam for his funeral and had to make up the days the following weekend. If this bitch wants sympathy she can look in the dictionary between shit and syphilis.","commenter_a":"She is full of shit and her so called \"crippling anxiety\" is also a mound of shit.","post_message":"Brace yourselves for what might be the most frivolous higher education lawsuit of the century."},{"comment_id":"999294776794334","commenter_b":"An epic read to do at 5.45am but i feel it went nowhere","commenter_a":"Sean Weir @username","post_message":"What if you found out there was a key that would enable you to open and close your doors of perception at will, void of psychedelics? What if you found out you not only held the key, but you were the key? Would you unlock the doors, or keep them shut? This is a good read."},{"comment_id":"10153227996393812","commenter_b":"And feminazis want to be equal. Smfh","commenter_a":"Men can be abused too...","post_message":"\"Why is it so hard to see black and blue?\" #TheDress being used to fight back against domestic violence: @webpagelink"}]
