[{"comment_id":"1397527680309345","commenter_b":"Give Facebook some competition techies.","commenter_a":"YOU BETTER LOOK AT THE FACTS ,TRUMP ALLOWS IMMAGRANTS IN ,BUT IT HAS TO BE LEGALLY ,WHATS WRONG WITH THAT ,AMERICAS SAFETY FIRST","post_message":"PISSED Off Facebook CEO Sends Giant YOU To Trump Didn Expect THIS To Happen Moments Later!"},{"comment_id":"1115332378507619","commenter_b":"Shame on you Arizona. This is the doing of ALL your citizens. I have spent a lot of time in Southern Arizona - at one time I would have retired near Tucson when we arefnished traveling. Not any more. Shame on you.","commenter_a":"Conservatives want to go to war with ISIS because they are destroying ancient sites but have absolutely no qualms about destroying our own indigenous holy places","post_message":"Should it be legal for Congress to give away ancient Apache holy land to a foreign-owned mining company? Represent.Us has the scoop."},{"comment_id":"10153344405883984","commenter_b":"what more does this witch have to do before they put her where she belongs, PRISON!!!!!!!","commenter_a":"Hillary's political career ended with her departure from the State Department as far as I'm concerned. She's never been a vialble candidate for that office.","post_message":"I don't see any way Hillary can escape from this one. She's probably kicking herself right about now... Do you hope this ends Hillary's presidential chances?"},{"comment_id":"10153090995473984","commenter_b":"They both need to be jailed or shot as the traitors they are!","commenter_a":"Dems must be psycho after all she has had to do with the deaths of Stevens etc she thinks SHE should run for POTUS! The audacity of entitiled politicians is RUDE!!","post_message":"She probably thought she had gotten away with it. Not so fast, Hillary... Should she face criminal charges for this?"},{"comment_id":"10153354510959714","commenter_b":"He technically could put kids in danger. His fans tend to be a bit over the top. One of those fan girls could and would easily shove someone out of their way to get near him without any thought given to whether or not the person they just shoved is ok.","commenter_a":"OMG I'm not a fan of the guy but u all are over reacting...putting the kids i danger seriously...how...he is not a terrorist he a singer...u all need to get a life...","post_message":"Justin Bieber totally crashed a prom, you guys."},{"comment_id":"10153921857951323","commenter_b":"seductive dancing is an ancient art form...and a rare 5% of woman have any natural talent at it at all.","commenter_a":"'Sex industry' is not an industry. Sadly you were not given enough opportunities and maybe this is why you think this is a job.","post_message":"\"The sex industry is one of the very few industries in which middle-class to upper-class men regularly give large sums of money to working-class women. I wonder if that’s one of the reasons why people hate us.”"},{"comment_id":"10153633737712464","commenter_b":"Go Cruz go. Tell the facts and let the media put a liberal spin on it. Planned Parenthood was meant to be racist by stopping more poor from the welfare rolls. \"HA!!!!\" They will say,\"It was an attempt to keep the Black Community from expanding the Voters Rights', or something like that. That's why Planned Parenthood buildings are in poor economic ares and not down the street from the $600,000-2 million dollar homes. Don't have to waste the fuel bills on buses that far out. Economics for the city. See it's not about lives. IF \"BLACK LIVES MATTER\", why is there even a dialogue about the killing of souls.","commenter_a":"Smarti - I aam not really interested in PP and I am sure you are looking up everything you can find to repudiate what Cruz says. Good for you if you think PP is on the up and up. I just don't understand paying all that money when it is not a gov operation. If it is a private business - great - let them fund themselves, don't use our money to help pay$ 600,000 salaries along without mentioning all the other expenses. I read $1.2 mil spent on things other than women's health. I really don't care about that stuff. I am more interested in what is going on in Syria etc.","post_message":"It says something about just how corrupt this administration is that there is not a soul on earth that believes the Obama Justice Department would even begin to investigate Planned Parenthood."}]
