[{"comment_id":"10153225867682061","commenter_b":"How can you cut taxes, increase military spending And balance the budget and the only thing going is Obama Care?","commenter_a":"CHILDREN DON'T CHOOSE TO HAVE POOR OR INCOMPETENT PARENTS. FATE GRABS CHILDREN BY THE THROAT AND SAYS, is your life. Poor Child and the Politicians Beneath the greedy iron fist of the Politicians, a ragged, hungry, poor child dwelled Poor Child family tried to climb over poverty restraining wall, but their fragile world collapsed during a cold-blooded eviction from their shoddy shelter Poor Child moved onto a filthy, freezing street, their destitution once again a widespread and noisy public dispute Poor Child body and hope were quickly fading away, tho for their soul, many fellow sufferers continued to wail Politicians and their cronies only cared that reduced assistance and lowered wages for the poor would increase their already huge fortunes Poor Child only wanted, one last chance to be warm, to be dry, to eat. @username","post_message":"WATCH: The #GOPDebate in a minute. More on the debate from last night: abcn.ws/1NJnjrU"},{"comment_id":"925323364324906","commenter_b":"@username yes it was look at the lady who ran it she has ties to hamas open your eyes","commenter_a":"There was no pro Sharia Law March. There was a \"we don't want a president calling women who disagree with him fat pigs\" march. A \"no man has the right to give another man permission to call his daughter a piece of ass\" march. A \"why would you take away funding from violence against women programs as one of your very first acts as president\" march. A \"don't remove health insurance before you have another plan in place march\".","post_message":"Ayaan Hirsi just took the gloves off. She couldn't let this go unnoticed, and neither could we. Do you agree with her?"},{"comment_id":"10153780723343984","commenter_b":"the Muslim parents could have kept their brats at home that day and celebrate their butts off.","commenter_a":"Yes","post_message":"Tempers flared after this city's board of education refused to take a day off of school in observance of an Islamic holiday, and these Muslim parents were NOT happy about it. Do you agree with the decision these school officials made?"},{"comment_id":"10154324502466051","commenter_b":"Oh SHUT UP WOMEN!!!!!","commenter_a":"Your shrill voice","post_message":"Hillary Clinton just revealed the big reason why she believes she lost to Donald Trump."},{"comment_id":"1113642245398693","commenter_b":"Ummm....which part of the Constitution did he need help reading again ? Seems like the Constitution is only good for these biggots when it works in their favor...picking and choosing again...no wonder this Country is in such shambles right now. Get over it Ted Cruz...get over it.","commenter_a":"The thing is, how do Republicans make the, \"follow the constitution\" argument after this? The constitution is clear, that the President must nominate a Supreme Court Justice when there is a vacancy. Where in the constitution does it set a time limit based on when the vacancy occurs?","post_message":"Senator Ted Cruz tweeted: \"Justice Scalia was an American hero. We owe it to him, & the Nation, for the Senate to ensure that the next President names his replacement.\""},{"comment_id":"1060173974080560","commenter_b":"You always do a fantastic job so thank you!","commenter_a":"Thank you for covering","post_message":"Christopher Heath WFTV has a look at the crowds waiting in Orlando for the Donald Trump rally, which is set to start at 4pm. More details here: @webpagelink"},{"comment_id":"831063543595735","commenter_b":"and what would having military service help with illegal aliens......","commenter_a":"Every Presidential candidate should have had at least 3 years active duty! No exceptions! Would stop illegal aliens, and other scum from infiltrating the white house like NOW!","post_message":"We need a leader who supports our military, now more than ever! www.thepoliticalinsider.com"}]
