[{"comment_id":"10155993516865354","commenter_b":"How in da hell can a fine ass hoe like this want to go to hajji land to have a scarf put over that fine ass mug of hers","commenter_a":"what a shame. arrest them !!!","post_message":"This Mississippi Teen Honors Student and Her Husband Have Been Charged with Attempting to Join ISIS. Her Father-in-Law is Imam of the Islamic Center of Mississippi in Starkville..."},{"comment_id":"10156776105275354","commenter_b":"Difference between American and European women...","commenter_a":"And we pay $260 billion a year for our government.","post_message":"CHAOS IN AMERICA'S STREETS..."},{"comment_id":"742531822604062","commenter_b":"PLEASE PUT HIS ASS IN IT","commenter_a":"All this shit is posted and nothing is ever going to happen to this goat fucker or his bestie Hillary Clinton","post_message":"Obama Caught In Major Lie - This Could Be The Nail In The Coffin [VIDEO] He cannot be trusted. End his term early. Do you want a president who will tell the truth?"},{"comment_id":"10153123685718690","commenter_b":"Exactly , he got 72 Virgin girls.","commenter_a":"So jihad was killing none believers and was killed? so he died a hero?","post_message":"The mood was sombre as mourners gathered in Beirut southern suburbs to pay their respects to Jihad Mughniyeh, one of the six Hezbollah fighters killed in an alleged Israeli air strike in Syria. @webpagelink"},{"comment_id":"10154246766848797","commenter_b":"Denise unfortunately this is what your kid will probably end up doing! And you're beyond IGNORANT & clueless lady btw!!!!","commenter_a":"Black on black. Stop. We have to fight murder from the pd, ourselves, institutional genocide. Proverty. Racism. Chicago public schools. Residuals of enslavement. We are protesting all day and everyday.","post_message":"TUESDAY VIOLENCE: Five people were injured in shootings Tuesday on the South Side. Most recently, two teenage boys were shot in the Englewood neighborhood."},{"comment_id":"1160101854032719","commenter_b":"Build that wall!!!","commenter_a":"U tell em Trump","post_message":"Watch as Donald J. Trump discusses his education plan."},{"comment_id":"1702569516701619","commenter_b":"Soetoro the ineligibles wife did do that! But why are the D traitors who condone it with NFL players so upset??","commenter_a":"Oh yeah would of never heard the end of it.","post_message":"Oh, how they would SCREAM! Shared by Occupy Democrats, LIKE our page for more!"}]
