[{"comment_id":"10154864481904170","commenter_b":"I know enough about Trump and Clinton. Only one has committed crimes worthy of prison time. Can't dispute facts.","commenter_a":"Ivanka is an amazing woman which demonstrates that President Trump is not only successful in business, but with his family too. A real winner in every sense of the word. #MAGA","post_message":"This should get people's attention."},{"comment_id":"1582505828713381","commenter_b":"@username That is right on the money but it goes even further than that. The phrase well regulated militia did not mean the same thing that people understand it to be now. At that time well regulated meant that every man was to be completely equipped on his own dime. Every citizen was expected to be armed and ready to defend their community. Consider that at that time there were still unfriendly hostiles that raided towns and farms. Each citizen was expected to be armed and would have been quite foolish not to be. These days as civilization seems to be degenerating we are also faced with the dangers of criminals and terrorists and yes even perhaps our own government. People have been conditioned to be drones who don't bother with thinking so they let the government do it for them. What they fail to realize is that the government ...","commenter_a":"People have rights, not militias. Militias depend on people having rights, people's rights do not depend on being in a militia. Let's parse this: The 2nd Amendment consists of two clauses. The first clause \"A well regulated Militia, being necessary to the security of a free State\" is a dependent clause, because it is not a complete sentence. It cannot stand on its own. The second clause \"the right of the people to keep and bear Arms, shall not be infringed\" forms a complete sentence, it is an independent clause. The first clause is dependent on the second clause. Or, in simple English, the existence of a militia (which is essential to the security of a free State), is DEPENDENT on people having un-infringed rights, not the other way around. No laws, licenses, permits or taxes that by design are designed to keep Americans from exercising their 2A right can ...","post_message":"California Lt. Gov. Gavin Newsom, who's pushing more gun control in The Golden State, recently appeared on Chelsea Handler's show. Not only did they slam the NRA (not surprising), Handler also said American gun owners are \"embarrassing.\""},{"comment_id":"10152962778127411","commenter_b":"Not in Texas! It's illegal!","commenter_a":"So the f what....... it's not illegal to smoke marijuana. The question is, how'd she get it while in custody? Aren't all the jails covered in cctv cameras? Where is the footage? WHO gave her the weed? is that also the same person who murdered her?","post_message":"SANDRA BLAND: A toxicology report has been released showing the levels of THC in Sandra Bland's system were so high, some experts believe she either smoked marijuana in jail or was a chronic pot smoker."},{"comment_id":"10155829380115354","commenter_b":"Give it up Rubio!","commenter_a":"Of course he did!","post_message":"16 days after Trump gave his speech... why not stick his neck out before the media created this bandwagon?"},{"comment_id":"10154444925336336","commenter_b":"Hillary supports Islamic terrorist and their right to open borders. Will you continue to support such a wicked evil woman?? Vote Trump2016!!","commenter_a":"The JV team strikes again. How long before we hear Obama say \"religion of peace\"? I don't know how he says it with a straight face. #PrayforFranceAGAIN","post_message":"Sky News now reports that the death toll has reached 60 after a truck drove through a crowd celebrating Bastille Day in Nice. French President Francois Hollande has returned to Paris for crisis talks."},{"comment_id":"487411828113777","commenter_b":"No kill these mofos","commenter_a":"These people are evil beast.","post_message":"This is INSANE...Deport Them ALL!"},{"comment_id":"10153525332906323","commenter_b":"More like Donald Trump.","commenter_a":"Perhaps he must be having a midsummer's night dream?","post_message":"It takes a genius to know one..."}]
