[{"comment_id":"738159049657328","commenter_b":"I think that crooked, lying, evil bitch needs to be in prison","commenter_a":"K, this bit%h is really out there! She and her cronies want total power! I pray that God stops her!","post_message":"WOW. People NEED to listen to Hillary's response when asked if an individual's right to bear arms is a constitutional right... Do you think Americans should be scared of a Hillary Clinton presidency?"},{"comment_id":"10153217086893984","commenter_b":"Get them outta there ,","commenter_a":"IDIOT.","post_message":"Unreal. Does she realize what she's doing? Is Michelle Obama bad for America?"},{"comment_id":"10153394425273352","commenter_b":"What a racist, ignorant bitch!! THE MAN WAS BLACK!!!!! Smh","commenter_a":"If this was a Black person who did this it would not be the same these white people make there own law when they break the law .what a Shame.you all get away from man ,But Y'ALL Didn't get away from God pls.","post_message":"Mother breaks down in court after her ex-husband is cleared of strangling to death their 4-year-old son because he was SLEEPWALKING when he did it"},{"comment_id":"1017809398240071","commenter_b":"Thought it was a low-res depiction of a chicken...","commenter_a":"Lexi Langlinais !!!","post_message":"A huge asteroid is set to pass close to Earth."},{"comment_id":"10155736096870231","commenter_b":"Its not about the braids.....its about the #whitegirlsdoItBetter","commenter_a":"What is it called, then, when black women get relaxers to wear their hair straight?","post_message":"The young actress is making sure her comments about appropriation are taken seriously."},{"comment_id":"10153083604111350","commenter_b":"They have noses ! Lori Askeland","commenter_a":"Please be sure to share that Etsy link when she does start a page up!! I'm interested in these adorable dolls!","post_message":"We just love the way this artist transformed these dolls -- they look like kids again! Click to check out all the awesome make-unders."},{"comment_id":"10152683402245667","commenter_b":"She must like getting stuff for free.","commenter_a":"He's republican. Enuff said. Lost my vote.","post_message":"Marco Rubio has \"something\" important to say."}]
