[{"comment_id":"1130006897113975","commenter_b":"Get out of America then","commenter_a":"It is a sad day in America. One of the most disgusting men in in our country won the election. I am so sickened by the citizens who would cast their vote for such an evil man. Do they really feel he is person to speak for us as a nation. I find him so repulsive by his words and actions.","post_message":"THESE 23 HOLLYWOOD IDIOTS PROMISED TO MOVE IF TRUMP WINS..... LET'S HOLD THEM TO IT"},{"comment_id":"10153823979101107","commenter_b":"And then Hillary would be the next POTUS.","commenter_a":"Rand can still be nominated by the libertarian party and would be a viable third party to trump and Hillary...he could take at least 20 percent from the GOP and DEM... The sore loser laws in many states shouldn't apply to him because he dropped out after Iowa","post_message":"'Sen. Rand Paul (R-Ky.) has put a hold on the plan, with the intention to protect the Constitution, American taxpayers, businesses, and the nation’s economic health by blocking these dubious treaties.'"},{"comment_id":"10156389241130725","commenter_b":"if the so called good muslims are offened with what Donald Trump is saying why are they not stepping up and reporting the ones that are trying to hurt us,that offens ME!","commenter_a":"On Trump, his blocking Muslim entry is due to terrorists in with refugees, Americans as terrorists coming back not the innocent and good ones, he wants to stop the entering to get the bad ones out first to protect Americans. I agree with @username","post_message":"Statement on Preventing Muslim Immigration:"},{"comment_id":"842856589085016","commenter_b":"Jesus never existed. It's all in your head woman.","commenter_a":"The should stop being christian then","post_message":"'...a most agonizing situation.'"},{"comment_id":"1783677398519787","commenter_b":"'@username TRUMP IS OUR NEXT PRESIDENT.GET OVER IT.","commenter_a":"I am really not a trump fan.. But if his election gets rid of half the asshats that say they will leave he's got my vote","post_message":"She's out."},{"comment_id":"1154513944599658","commenter_b":"Open primaries work just fine Terrence.","commenter_a":"Yea- Bernie baby! This was a closed primary and they are near a tie!!!!! Can you imagine if they 'allowed' everyone to vote?!!!!! #therevolutionishere","post_message":"UPDATE: Sanders wins the Oregon primary, while Clinton appears likely to eke out a narrow win in Kentucky. Sanders' cut into Clinton's 270+ pledged-delegate lead likely will be single-digits."},{"comment_id":"10158042812305551","commenter_b":"I have trouble with Rhinos who profess to be one thing, but are LYING. I have not trusted John McCain for several years. I am beginning to wonder about Marco. Time will tell. As for Hillary and John Kerry, They are trying to destroy what America stands for and that is FREEDOM. Than there is Eric Holder who along with Obama and Clinton, sold guns to Mexico Mafia. Corruption is what WE THE PEOPLE are sick of.","commenter_a":"Trump is right again. John McCain is no war hero and never has been.","post_message":"Two Senators Have a Problem with Tillerson, but not Hillary Clinton or John Kerry"}]
