[{"comment_id":"10153581421506336","commenter_b":"How do you go so wrong in life before you're even out of high school??","commenter_a":"But they look like law abiding professionals","post_message":"Four high school students have been arrested in the carjacking and kidnapping of a Texas border patrol agent who was vacationing with his family in Florida authorities said."},{"comment_id":"10154462042369062","commenter_b":"Lmao... Con el nopal en la frente y encontra de illegales.... Everyone with a hispanic latino last names shall research theyre ancestry our families come from illegal immigrants","commenter_a":"We are not \"united\" and Trump is not racist. I am against illegal immigration and support Trump!","post_message":"It translates to, \"United Latinos: Don't vote for racists.\""},{"comment_id":"10153891687451782","commenter_b":"And what of Betty Shelby??? When will they lock that monster up? When will her day come?","commenter_a":"It is not over he may not but I saw a tweet today by a new elect and NY police are ready for several charges including the spirit dinners were those poor children are molested and then killed!! It may take time but all of them will be charged! Trump will be too busy to do it but their day will come!!","post_message":"President-elect Donald Trump's aide is suggesting that he will not pursue a probe of Hillary Clinton private email server in an effort to help her ;  @webpagelink"},{"comment_id":"1364681343563732","commenter_b":"@username DA MAO POW!!!","commenter_a":"Kaaren Eric","post_message":"When a  meets a .   Check out more of our panda videos here: bbc.in/2hI4DPR"},{"comment_id":"10153448946523984","commenter_b":"We have a process for people to come this country and become citizens. These illegals should should not be put ahead of the people who are doing it the legal way.","commenter_a":"I'm not a crook","post_message":"Barack Obama’s bad week just got even worse...  Are you glad to see this happen?"},{"comment_id":"1334341989975359","commenter_b":"@username We should give them hard labor in the form of building the wall.","commenter_a":"This arrogant convicted criminal is an excellent example to bring up next time any leftist Democrats claim there isn't any voter fraud. Safe to say we know where she will be for about the next 3-4 years with good behavior.","post_message":"ARROGANT ILLEGAL ALIEN Who Voted 5 Times In 2016 Election Gets 8 Years…Lawyers Call Sentence “Harsh”…Blame Trump…LOL! [VIDEO]"},{"comment_id":"10154286339391756","commenter_b":"We pay nine (right now, eight) people to say \"no\" to that type of demagogic gasbaggery.","commenter_a":"It's a consistent source of amazement to me that he does not understand that if, heaven forbid, he somehow manages to become President, he cannot just unilaterally change/enact/dismantle any law he chooses. He and his equally terrifying supporters might want to learn how this all actually works.","post_message":"\"What we don't have in this country is a tradition of punitive actions trying to silence speech,\" says one D.C.-based attorney."}]
