[{"comment_id":"498451153654689","commenter_b":"This is one more reason we need you","commenter_a":"I want to vote for you. However, would you please address the very serious immigration issue.","post_message":"Just spoke to National Right to Life Convention. We are united in cause. Thanks for having me. Defend the defenseless. We are the voice for the voiceless. #HealInspireRevive"},{"comment_id":"1754483651501060","commenter_b":"When they take our gun rights away, what are we to protect ourselves with when evil terrorist get guns off the black market? And don't people see that more people are killed by drugs and drunk driving in America than by people shooting others? They just want to take our rights away!!!","commenter_a":"Barbaric!!","post_message":"Watch Rep. Louie Gohmert shout \"radical Islam\" at House Democrats who were staging a sit-in on gun control. @webpagelink"},{"comment_id":"948371528584407","commenter_b":"They will never be Americans .. They are all murders and need to go home..","commenter_a":"His typical BS. Lie Muslims. Don't belong here !!!","post_message":"Do you think there was anything wrong in saying this?"},{"comment_id":"10153699957431336","commenter_b":"Muslims need to stay in the Middle East. Or hell. Same thing.","commenter_a":"The Tsarnaev brothers were \"refugees\". Don't forget that.","post_message":"Secretary of State John Kerry says the U.S. will accept 85,000 refugees from around the world next year, up from 70,000, and the number will rise to 100,000 in 2017."},{"comment_id":"10154611817649087","commenter_b":"Diana , sthu . Don't call me names . We went through 8 years of that black racist pos muslim traitor obama . Now we get a real American President that wants to help America and people like you don't even give him a chance . So crawl back under your rock and take obama with ya .","commenter_a":"So many liberals . I mean clueless liberals . With obama and hillary we would have been a 3rd world muslim country in no time . STHU and give Trump a chance . He's done more for America in weeks that obama did in 8 years .","post_message":"\"It's apparent that President Trump is clueless when it comes to nuclear weapons.\""},{"comment_id":"10153228470879170","commenter_b":"Idiots abound everywhere","commenter_a":"Lol","post_message":"If only for comedic value, we hope these people are successful in their bid to \"Draft Joe Biden!\" ....Utterly crazy video included."},{"comment_id":"10153091745866523","commenter_b":"You're a pig!!!","commenter_a":"This whole thing was started by a Lawyer whose wife was a Teacher and a School Board Member. She was hysterically crying over the whole...Act 10 thing, so her dutiful hubby wasted millions of our tax dollars to pull out a witch hunt. Which begs the question: Did his wife put out after all that? Because I want to know if my tax dollars amounted to a 'Happy Ending' for most dutiful hubby.","post_message":"JUST IN: Wisconsin Supreme Court ends probe into 2012 recall campaign of Gov. Walker."}]
