[{"comment_id":"795005380646682","commenter_b":"Y'all must be crazy","commenter_a":"Drain the swamp","post_message":"The United Nations resides on American soil, and the U.S. pays about 25% of its budget."},{"comment_id":"10152814329771636","commenter_b":"The LibDems should have fought for a workable PR system when they had the opportunity.","commenter_a":"As much as I don't like the UKIP he is right","post_message":"'I now have to think seriously about my future life, and what I want to do'"},{"comment_id":"10153203713812894","commenter_b":"She's a damn lie! Ain't nobody stupid! That's what's wrong with her lying ass all them babies and surgeries!","commenter_a":"What did she do to her face? She looks weird","post_message":"Kim Zolciak Reveals Doctors Discovered a Hole in Her Heart While She Was Hospitalized After Her Stroke"},{"comment_id":"1091887850889750","commenter_b":"She is a POS racist cluck bum bitch and NFL you Scumbag should give all the ticket holders half their money back","commenter_a":"What about the planners of NFL Super Bowl did they not know what her performance was about there's a little bit more to blame then just solely on Beyonce. The Super Bowl planners NFL new what hurts halftime show was about was not announced or advertised of being such as low blow off base nutcase to let it going on so take that NFL maybe you should pay attention what's going on around you to","post_message":"Last weekend Beyonce got to have her racist fun at the Super Bowl. But now she's gotten some massive bad news. Looks like you can't go off and support cop killers without having to pay a big price later on. Boom!"},{"comment_id":"971472706302942","commenter_b":"That's where she belongs! That's where she belongs! That's where she belongs! That's where she belongs! LOCK HER UP!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"More Wikileaks revelations: 1) Ted Cruz allegedly asked the DNC for MONEY to help fund his delegate fight in Cleveland (specifically: Eric Bennett to and from Ken Cuccinelli, R-Virginia working with Ted Cruz and the DNC to undermine the delegate selection before the convention). Working to push through rules changes in the rules committee and working to flip bound delegates against the rules and state law. All co-ordinated with the DNC. 2) Jake Tapper of CNN allegedly colluded with the DNC. They gave him questions to ask his interview guests. 3) Chuck Todd of NBC allegedly was also colluding with the DNC and put pressure on others at the network to go easy on Democrats at the DNC’s request. 4) The New York Times allegedly co hosted parties with the DNC. This is against the law. 5) Hillary Clinton allegedly setup a slush fund through the DNC to launder donor ...","post_message":"Live Now: Jesse Watters and Brian Kilmeade are here at the Facebook Live Lounge from the Democratic National Convention and they're taking your questions! Comment below:"},{"comment_id":"408303332684881","commenter_b":"Maxine, you don't know much do you. The minorities already have the right to vote. Sorry if they won't let you count the votes that some people made with the names of dead people. Illegal aliens don't have the right to vote, because they are not citizens of the USA.","commenter_a":"As long as the current conservative, sorry ass Republicans are controlling both the House and Senate, there will never be a vote on a new Voting Rights bill!!!:( They are against anything good for minorities, women, seniors, and the working class.","post_message":"On this day in 1965 President Johnson gave his Voting Rights Act Address to Congress. Today, we should DEMAND Congress pass a new Voting Rights Act. Sign this petition if you agree."},{"comment_id":"552998604866610","commenter_b":"How dare you sir!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Another \"unverified story\" from Dr. Carson. Reporters visited the library and the librarian at the desk does not recall the event at all. Never happened! Carson lied and people died!!!","post_message":""}]
