[{"comment_id":"10154140637508984","commenter_b":"She's a she bitch..she's sappose to be neutral.","commenter_a":"Megan started this mess! Now the Balls in her Court, she can act like a person doing her job are act like the Establishment with the Mean Spirited Questions. FOX this could be the End for what you call Fair and Balanced. News Max looks pretty good.","post_message":"The long-awaited rematch between Donald Trump and Megyn Kelly will occur at tonight's Fox News debate. Kelly has a plan if Trump starts to attack her, and it's going to surprise you."},{"comment_id":"10153157843033984","commenter_b":"I am thrilled! I pray someone stops the madness. We must enforce our immigration laws abs seal our borders.","commenter_a":"A judge with Balls","post_message":"Obama received a major smackdown last week! Amnesty plans halted!! Are you as happy about this ruling as we are?"},{"comment_id":"10156710754945093","commenter_b":"I dont think so!Murderous old hag!","commenter_a":"Everyone should know she is the liar, news video proves it.","post_message":"This woman knows no shame."},{"comment_id":"10153379437614411","commenter_b":"To Turchinov's bitches.","commenter_a":"Ukraine have just had a 175 Billion dollar loan about 3 weeks ago, Plus a 1.8 billion dollars this week from the EU and now they are getting ready to default on these debts. Could someone please tell me where all the money has gone in such a short space of time????","post_message":""},{"comment_id":"1402866583068901","commenter_b":"HOW DO YALL EXPLAIN RICE COMMITTING CRIME AGAINST THE U.S, HOW BOUT HOW OBAMA LIED ABOUT ASSAD NOT HAVEING CHEMICAL WEAPONS. OBAMA LIED ! HOW BOUT TRUMP BEING PROVEN RIGHT ABOUT THE SURVEILLANCE ON HIM AND TEAM! HOW DO YOU FELL ABOUT YOUR CHILDREN BEING TAUGHT SHIRA LAW IN SCHOOL. ECT....","commenter_a":"I am glad to see to the media is holding their ground and calling him out. We need them to stay strong and sound the bullshit alert as needed.","post_message":"Trump lied SO much today, CBS had to call him out. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154449321726729","commenter_b":"Fuck u bitch.. I'm an Obama supporter and wouldn't say no shit.like.that.. FUCK U!","commenter_a":"You know what's amazing about Trump's supporters? They are so cult-like that if Donald Trump raped a little girl, his supporters would insist that's okay. They would say that she was probably asking for it. No true conservative supports Trump.","post_message":"BREAKING: The decision desk has now called the winner of Kansas..."},{"comment_id":"10152814040437293","commenter_b":"Especially among Liberals.","commenter_a":"It's not a surprise that Fox 'Faux' news should top the polls as the most trusted because most people (sheeples) are obviously dumb because common sense isn't in fact that common.","post_message":"Even among independents."}]
