[{"comment_id":"1009830989039949","commenter_b":"Don't even watch the view anymore.. THose women have so much anger in them.. They never say anything nice about anyone.. Joy was off the show for awhile,, needs to stay off the show.. Just my opinion..","commenter_a":"Who in the Hell is Joy Behar, and why is anybody listening to her or her or anyone on the View?","post_message":"Joy Behar calls out Carly Fiorina.  Is she right?"},{"comment_id":"483283155193311","commenter_b":"Good ridance! Sorriest show on TV. Sorriest people on a show on TV. Both of the women above should be in a mental institution. Lock them two and Obama in a room together and let them live out their lives in peace. :)","commenter_a":"Hope so , it will be a blessing","post_message":"FINALLY!"},{"comment_id":"571151523088148","commenter_b":"Woopi is possessed. She can't help it.","commenter_a":"This is the woman who tried to lower the RAPE benchmark by stating in defense of an acused rapist that it wasnt \" RAPE rape.\" I heard her with my own ears.","post_message":"Did Whoopi just blame women for having affairs with Bill Clinton?  Watch the clip."},{"comment_id":"1082800578422029","commenter_b":"She can squat but that don't put bread on the table!","commenter_a":"who makes up these polls for you ?","post_message":"BREAKING"},{"comment_id":"1296273287105505","commenter_b":"You can go to hell liar","commenter_a":"Thank you president Obama. You will always be my president . The orange one will never be able to walk in your shoes he is a lier and con man and most of all a racist sob. Never put president before his name.","post_message":"\"That's what separates us from tyrants and terrorists.\" Nearing the end of his presidency, President Obama shared his hopeful vision of America's future."},{"comment_id":"1007362382702564","commenter_b":"That's uncle Ernie sitting on the eggs","commenter_a":"@username get off of here!","post_message":"ONE EGG IS HATCHING! Eaglet Watch 2016 continues as Harriet and her mate M15 wait for their two eaglets to hatch. One egg began to crack yesterday! Fingers crossed we get an eaglet today!   Once an eagle egg begins to crack, it can take 12 to 48 hours for the eaglet to fully hatch.   Live video: Southwest Florida Eagle Cam MORE: @webpagelink"},{"comment_id":"1155384687884221","commenter_b":"That's what you get for working for him.....I wonder if he ever payed the little girls who sang and danced for him for a rally","commenter_a":"Trumps motto : if you're stupid enough to trust me you get what you deserve.","post_message":"If you work for Trump, you're going to get burned."}]
