[{"comment_id":"10153566353686323","commenter_b":"Paul, I live in Heidelberg Germany. The Americans have left, and the army barracks have been filled with refugees. The plan was for 1200, but we have 1900. This summer, I drove to the UK. The British press reported trouble and riots in Calais and Dover - we sailed through, in both directions. Germany has taken 8x the number of refugees than Britain. And, incidently, I find that if I post here, I often receive an extremely rude and aggressive reply from someone in the UK. I find the British to be quite aggressive, probably frustration with the pro military, right wing, Banker Government, for whom they voted. (Preparing for a tirade of abuse here :) )","commenter_a":"Considering that the surge in recent immigration to EU is mainly due to military and political actions initiated and undeertaken by UK, US and France the hospitality displayed by Germany is more than commandable ... And the British attempts to refuse responsobility for the Lybian and middle eastern mess is plain shameful ...","post_message":"In July, Germany received 37,531 asylum applications, that is 5,586 more applications than the UK had in the whole of 2014."},{"comment_id":"1149773515076812","commenter_b":"Hillary should be in prison.","commenter_a":"Intelligent much??? I heard she said he was like an octopus...with six arms...omg","post_message":"OOPS! HILLARY'S HIT WOMAN LIED About Trump Groping Her…Eye-Witness Comes Forward: \"It was she that was the one being flirtatious”"},{"comment_id":"10153080591266748","commenter_b":"He's a fucking queen.","commenter_a":"Better headline: Tom DeLay urges a complete breakdown in the judicial/governmental structure. Because 'murica.","post_message":"Former GOP House majority leader Tom DeLay urges anti-gay conservatives to stand up to the \"ten\" Supreme Court justices."},{"comment_id":"971579579554776","commenter_b":"Trump.. love him","commenter_a":"The hugs he remembers were on September 11th? I believe what rand Paul was talking about was when New Jersey got slammed with a hurricane and he was thanking Obama for sending assistance so quickly. That isn't anything more than being an adult professional. Something 99% of republicans are incapable of being.","post_message":"ICYMI: Here are the top moments you were talking about during the #GOPDebate. Who do YOU think won? @webpagelink"},{"comment_id":"1321112227930500","commenter_b":"I reckon there's still a chance he'll be persuaded to step aside, and Pence will be inaugurated on Jan. 20.","commenter_a":"Looking forward to the impeachment.","post_message":"It's official"},{"comment_id":"10153123905806800","commenter_b":"What??!!! A telling point, if in jest, that she made her own rules!","commenter_a":"Sorry, John. I usually love your stuff, but you missed the point on this one. As someone who used to have a government email account, this is a big deal. Every government employee must have one, and to access most government systems, you need to use it. This allows those emails to be captured as part of the public record. This is significant enough that it's caused me to reevaluate my support for her. I see two major issues: 1. I can't imagine the hurdles and hoops her staffers had to jump through to make this happen. And it wasn't like it made things easier for Hillary. Several high-ranking people I worked for had a government email account and hardly ever read it. Their staff checked their emails and passed on the ones they needed to know about (like just about any high-ranking person in a company). This just put ...","post_message":"\"Is that against the law not to have an email account? It seems less of a scandal and more of like a nerd snap. 'Oh, she so old she doesn't even have an official email account!'\" -- Jon Stewart ►Watch the episode: @webpagelink"},{"comment_id":"10154333518999641","commenter_b":"It's about time america should have their own female leader, if they truly wanted a real change, that lady touch would make a real difference for a great nation to reach further.","commenter_a":"VOTE FOR HiLLARY CLINTON 2016 . Hillary for America","post_message":"\"We just put the biggest crack in that glass ceiling yet.” - Hillary Clinton appears via satellite at DNC in hat-tip to history @webpagelink"}]
