[{"comment_id":"1817386261807116","commenter_b":"I agree! She is pure evil!!","commenter_a":"Totally agree with Newt Gingrich! She has no scruples! She belongs in prison! Cannot stand this heartless woman! She just won't disappear!","post_message":"Newt Gingrich says Hillary Clinton is without a doubt one of the most corrupt politicians in American history. Do you agree or disagree?"},{"comment_id":"570070006492803","commenter_b":"Beat trump I. Want a Christian men with a back bone .we can live better cleaner an safer","commenter_a":"I bought what I was getting for Christmas before Thanksgiving so that I could concentrate on the ultimate gift , Jesus.","post_message":"Hello everyone, I wanted to make sure we had some time tonight to spend with each other. As always, remember to keep sending me your questions via text to ASKBEN (@username on your mobile phone).   There were many questions from all of you asking “what is one of your favorite things about Christmas?”     Honestly, I love to see the look on everyone’s faces as they open presents – that’s the best part for me, seeing the look children have in anticipation of a gift. During this season, I always try to remind myself of the greatest gift…our savior Jesus Christ.   I know that many of us spend the week leading up to Christmas frantically rushing around buying presents, our time occupied with “how much to spend” on loved ones, rather than spending much time occupied with those loved ones. It’s about relationship, not retail. We should remind ourselves of that more often.   It is easy to become distracted by the world when we are constantly being bombarded with competing priorities, our time becomes monopolized by differing pursuits and positions, fleeting moments that will pass. Our true pursuit should be everlasting, one that cannot be wrapped in bows, it does not perish. It is peace. It is good news, in pursuit of others as we share with those we encounter. Just as we are now, you and I, sitting here together sharing this moment in time, these are the moments that do not fade or wither upon snow’s first falling – this is the season to be joyous with one another, lift others as He has lifted you, our hands united in hope.   That is why Christmas is special to me – I am reminded of the greatest of gifts every time I see my children and grandchildren’s faces. Hope.   Thank you for sharing your evening with me, I look forward to many more.   Goodnight, Ben"},{"comment_id":"10152713060892623","commenter_b":"Those disgusting guys would not have made it off the beach if I was there. I know I'm just a women but I would hv done everything I could to hurt them","commenter_a":"I don't understand why they did nothing? ! I think I would have screamed, throw things at them, run for help, SOMETHING!","post_message":"'There’s hundreds, hundreds of people standing there. Watching, looking, seeing, hearing what’s going on.'  Police say spring break in Panama City Beach will change big-time after video of an alleged gang rape went viral:"},{"comment_id":"10153618510960329","commenter_b":"How bad do you want to see picture number 4s titties?!","commenter_a":"Dave David Craig so Mark was right all along...","post_message":"Drinking beer in the shower is a thing and you should all be doing it."},{"comment_id":"1009004349187234","commenter_b":"first she needs to be a lady","commenter_a":"Watch out she will pick your pocket ...","post_message":"Michelle Obama Invites Muslim Refugee To Sit With Her At State Of The Union  She should invite a soldier who fought for our country. This is ridiculous.  Do you think Michelle Obama is the worst first lady ever?"},{"comment_id":"10153846038466336","commenter_b":"Smug calculated shrew. She's nothing short of evil. WHY ISN'T SHE IN PRISON?","commenter_a":"She is a lying self serving witch and she has a list of dead people that believed in her and knew to much that could destroy her and Bill.","post_message":"WATCH: Rep. Jim Jordan questioned Hillary Clinton on emails she sent regarding the motive for the #Benghazi attack.   “You tell the American people one thing. You tell your family an entirely different story,” he said."},{"comment_id":"634421746711040","commenter_b":"Yur all ignorant fucks","commenter_a":"Of course he's guilty, adults never have the right to release their anger on minors, no matter the situation!! Smh!!","post_message":"Horrifying footage shows a Texas police officer body-slamming a middle school student. #MicBrights"}]
