[{"comment_id":"10156520680400354","commenter_b":"Atheists can suck my balls.","commenter_a":"Why do all the liberal atheists shit on Christianity on this page so often? Why don't you dis Islam? Why not any other religion? It's pretty pathetic that you join a conservative page with one intent, to act like complete dicks to anyone with a conservative or a Christian belief. Are you trolls being paid?","post_message":"Not EVERYONE is afraid to stand up and be counted..."},{"comment_id":"10153747063291336","commenter_b":"I agree with him we don't need any more illegal Mexicans in the US","commenter_a":"Even dead Trump is making money! Trump 2016!","post_message":"A former NYPD commissioner is warning Donald J. Trump to not take the purported threat lightly."},{"comment_id":"558741910917069","commenter_b":"Well a lot of the problem is, is she is a woman. I guarantee you she is going to have to fight a lot to become President, now and if she becomes president it will only get worse.and I am not voting for her.","commenter_a":"Shut up, Ben!!! You're out of this race.....","post_message":"Does Clinton's use of a private email server prove she has poor judgment and is unfit to be president?"},{"comment_id":"10153065757271636","commenter_b":"nope, men rape men too.","commenter_a":"Oh I see. Rapists are just misinformed. If only they had read this first, or someone had read it to them at an early age then we wouldn't have this problem that we have today. Women taking sensible precautions has nothing to do with preventing rape. Maybe we should write and share a ten point guide for thieves on why they shouldn't steal. Then we wouldn't have to lock our doors.","post_message":"Worth re-sharing"},{"comment_id":"854160414621300","commenter_b":"That's because they don't know it, and they think they're smarter and know more than anyone else. Truth is, they're afraid of Gowdy!","commenter_a":"GO GET EM!!! If anyone can do it you can.Luv your passion and fire!!!The dems DON'T think anyone knows the Constitution...","post_message":"\"I'll make you this promise...\""},{"comment_id":"1117028848356591","commenter_b":"An illegal can not vote. Period. God only knows what other conspiracy theories you are listening to","commenter_a":"Another Liberal Lie!!!! Did she make a statement or pose a question? \"If 45% of Americans pay no taxes, should they be aloud to vote?\" They are reaching They are losing and they know it They are getting desperate No choices Lying Old Woman Communist Old Man","post_message":"She has lost her damn mind."},{"comment_id":"886212474747508","commenter_b":"she is a trashy shank","commenter_a":"This guy rips her a new one. Good for you.","post_message":"Michelle Obama has no class, and he sets the record straight!"}]
