[{"comment_id":"10153715486157144","commenter_b":"Boom bitch!","commenter_a":"Y u gotta say boom","post_message":"BOOM."},{"comment_id":"10156744379040093","commenter_b":"'@username Have you SEEN Trump on the debate stage? He doesn't know policy, he doesn't think ahead, and he stumbles when it comes to content. Add to that the media penchant for tailoring questions to compliment the dem candidate, and <bam> Hillary looks like a freaking scholar on the stage. The thought makes me physically ill. On top of that, Trump has considerable damning words and actions the media and dems (but I repeat myself) will toss like confetti upon constituents. In multiple polls, Trump sits in the mid-30s, without waver. This is going to suck.","commenter_a":"Do the right thing and vote for Cruz. I write such because the thought of Trump facing Hillary in debate makes me cringe. Kasich, the newest favorite of the GOP, cannot win. I love my home state, but Ohio doesn't save Kasich from toppling.","post_message":"Not budging."},{"comment_id":"1562278293792195","commenter_b":"Hillary for PRISON !!!","commenter_a":"Deplorable in fl","post_message":"Join Chris Jansing at the polls from the key battleground state of Ohio Live! Full coverage all day: @webpagelink"},{"comment_id":"981168698591584","commenter_b":"Wow! That's insane.","commenter_a":"They have been","post_message":"Tel Aviv says the Israeli military must have a freer hand to shoot young Palestinian stone-throwers."},{"comment_id":"1191980840884045","commenter_b":"Seth Rich, DNC staffer, suspected of leaking information to WikiLeaks about the Clinton campaign randomly gets shot in the back walking down the street.... Why are so many Americans blind to the corruption in the Clinton campaign? People with credible evidence against Hilary are turning up dead. This is not a random instance. @webpagelink","commenter_a":"Trump will make changes, and yes Obama Trump doesn't think we faked the moon landing.","post_message":"Barack Obama’s greatest strength? “Probably that I’m always early.” hillaryclinton.com/makeaplan"},{"comment_id":"10153258097608984","commenter_b":"And reporting them doesn't help. Even though you should ... This is disgraceful","commenter_a":"The sick part is my neighbor/friend gets 1800.00 a month via foodstamps and cash aid. Crazy huh. And she's an illegal and so is her boyfriend.","post_message":"Wow, I had no idea the government could do this. Now I'm terrified...  Are you tired of getting pushed around by big government?"},{"comment_id":"10156035361815354","commenter_b":"and its only the begining","commenter_a":"WHAY ELSE????","post_message":"An UNDERWATER tunnel."}]
