[{"comment_id":"502464629957050","commenter_b":"NOOOOOOOOOOOO GO HOME WHERE YOU RUINED YOUR OWN COUNTRY","commenter_a":"If they are offended by the anthem of the country they chose to live in....the country that is giving them the right to spew their BS....the country that provides their safety and many welfare services....then I guess they can just GTFO.......","post_message":"Multiple Choice Quiz time, kiddies! Which answer did you chose? A or B?"},{"comment_id":"10153132641871051","commenter_b":"Wow marla racist much? What else can we minorities thank you whites for?","commenter_a":"REMOVE YOUR HEAD DRESS!!!!!I!!!YOU'RE IN MY COUNTRY NOW HABIBA!!!!!!❤","post_message":"The police told this woman: take off your head scarf or you’ll be sorry. She didn’t take it off."},{"comment_id":"10155453199626729","commenter_b":"Illegal immigrants big issue here too, handing out drivers licenses that look identical doesn't help with the voter fraud issue we definitely have, but don't acknowledge.","commenter_a":"We have the same problem in Nevada. My guess would be 25% of the plates are Californian, maybe an exaggeration, but at least 10-15% are, and these aren't tourists because they're parked and driving out in our neighborhoods. These are just the ones that haven't bothered to register their cars here. Overwhelming people you talk to are Californians and most have come within the last 5-10 years. Majority of true Nevadans, natives and long time residents, are embarrassed by the color our state was on that election map. I wish the infestation would retreat to their looney state but it appears we've been overrun.","post_message":"So simple, a liberal could understand it"},{"comment_id":"667942883338893","commenter_b":"No.","commenter_a":"Because whites haven't been a suppressed race for hundreds of years.....does stupid hurt? I figured I would ask the idiot that runs this page wth a grade school education.","post_message":"Hmmmm....."},{"comment_id":"1714085968841110","commenter_b":"WTF WORLD U LIVIN IN THEN MOTHA FUCKA GTFOH","commenter_a":"He need to take him and his gang go play I'm traffic","post_message":""},{"comment_id":"10154160437056943","commenter_b":"Of course she did !","commenter_a":"Yes","post_message":"Share if you agree!"},{"comment_id":"1023375851016759","commenter_b":"You're wasting every body else's.","commenter_a":"67 out of the HOW MANY THOUSANDS of people that visit daily? Get your shit straight IFLS. scaring people for no reason. Pathetic.","post_message":"Way to go, anti-vaxxers."}]
