[{"comment_id":"10153656346543352","commenter_b":"I could careless about all that bullshit it's a proven fact your ugly ass hell & I damn sure look better than you on my bad day, you look old & wash up do your hair & get some better make up stop acting like your a model , you don't have ninjas checking for you mines face looks. Better than yours hoe","commenter_a":"Remove this dumb bitches ovaries make sure she doesn't get the chance to even enjoy a child if she ever wanted one after you take her shit out throw her away in jail","post_message":"Woman Hit With Murder Charges For Aborting Her Own 5-Month-Old Fetus In Her Car With Illegal Abortion Pill, Causing Baby To Die 30 Minutes After Abortion"},{"comment_id":"10153580270695575","commenter_b":"If this is true, which I'm sure it is, how sick. But this is what the female liberals want. Oh is saying female liberals not PC?","commenter_a":"The Missing link!","post_message":"The Gateway Pundit - Muslim Dad Kills 4 Year-Old Daughter for Not Covering Her Head"},{"comment_id":"1316522848388184","commenter_b":"Trust me, women punish themselves way more than is good for them.","commenter_a":"He makes no sense why this man Willi never be president we heard what u said","post_message":"Trump manages to offend women in a completely new way."},{"comment_id":"10153030735456378","commenter_b":"Weather this is true or not I don't know,but one thing I do know is none of us would be in the water if we saw what was swimming around or beneath us!!!","commenter_a":"Hoax","post_message":"REAL OR HOAX? A video showing a great white shark circling a surfer has gone viral... but now, people are questioning its authenticity. What do YOU think? Is it real or is it a hoax?"},{"comment_id":"847757325414844","commenter_b":"fly your flag and tell these invaders to get out","commenter_a":"Let him fly his flag, this is America","post_message":"There is nothing threatening about an American flag.  He wants to show his pride for his country, let the man!  Do you think he should be able to fly his flag?"},{"comment_id":"1173415112684267","commenter_b":"Society is being destroyed by this abomination! Gay lifestyle brought the AIDS virus, now innocent woman and children are dying because of promiscuity, bisexual acts, and gay relationships! Sin has deadly consequences that all in society pay the price for! That's why Rian!","commenter_a":"I agreed ban same sex marriages.","post_message":""},{"comment_id":"10154237264628908","commenter_b":"Safe from all the predators but not from mosquitos.","commenter_a":"I like the idea of being up off the ground. I wonder if you could feel the bear or tigers fur under your back? The option of over the water is very appealing when it comes to lions, tigers, and bears oh my! Army Ant territory too. I think I would feel safer over a calm river, not up too high, but out of reach of most animals, than on the bank. Also, I imagine up in the air, not as much heat is extracted from your body as when you are on the ground.","post_message":"These tents suspend from trees! Get the experience of a hammock and a tent all in one. Thanks Tentsile!"}]
