[{"comment_id":"1242790859084298","commenter_b":"She's a wife and mother. Needs to grow up, cover up, and act like a lady!","commenter_a":"Fortunately the majority of police officers are good, hard working people serving/protecting their communities. Are there a few bad ones? Of course! The media really hypes the bad police officers, the knuckle heads looting and destroying communities \"in protest\". Not highlight the wonderful police officers laying their life on the line to protect our butts. Not highlighting the people that truly feel stepped on and are peacefully coming together with all to promote positive changes. \"Be the change that you wish to see in this this world.\" This is what I live by and teach my children. We should be brought together by love, not torn apart by hate.","post_message":"#EntertainmentNews  And the #BoycottBeyonce battle continues...the singer is being accused of using her recent Super Bowl performance \"to divide Americans by promoting the Black Panthers and her antipolice message.\"  Do you agree?"},{"comment_id":"1093998960667966","commenter_b":"party endorsed toadies dont age well","commenter_a":"PUT these clowns out too pasture","post_message":"BEYOND TIME  America's Freedom Fighters"},{"comment_id":"685645904949943","commenter_b":"Go fuck your sister","commenter_a":"59% don't care to show his taxes!!! But I put money on that same percentage CARED about his birth certificate!!!! People of this country make me sick!","post_message":"The Rachel Maddow Show is right –– this is an \"unimaginable corruption scandal.\"  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1021077537953055","commenter_b":"Stupid assbag thug asshole !! Stupid is as stupid does !","commenter_a":"yes","post_message":"Chevez Antwann Fiason wasn’t expecting this homeowner to be armed. This is why Americans have the right to bear arms. Can we get 70,000 ‘LIKES’ for the Second Amendment?"},{"comment_id":"944666172296302","commenter_b":"She's has a mental illness","commenter_a":"At this point she's coming across as delusional and totally disingenuous.","post_message":"“It means that I have really gone there with the experience in terms of being a mother with two black sons.\"  -Rachel Dolezal on being black"},{"comment_id":"1244871155548303","commenter_b":"You ain't going anywhere you f. Ing. Liars.......where u gonna make your money.....u should feel lucky that this is the only bonehead country that would pay your assets to do anything on film!!! BIG FAT LIARS......THEY R WHAT THEY IS !!!!!","commenter_a":"Yea.........see ya","post_message":"The last slide Don Jr. has a nice surprise for all of them!"},{"comment_id":"10153347814342426","commenter_b":"glad they got this on camera so she can't talk any bull about this officer!! crazy women","commenter_a":"Should've knocked all her teeth out period.....","post_message":"Going to the DMV can be stressful, but this Florida woman completely lost it at the counter. After she was asked to leave, the 31-year-old woman would not go without a fight -- with a Florida State Trooper."}]
