[{"comment_id":"10153219716141336","commenter_b":"Geraldo is out there looking for trouble. He does not belong there.","commenter_a":"Sick of All of this!","post_message":"Geraldo Rivera reacts to the current atmosphere in Baltimore as police make arrests: 'The cops are swarming over the demonstrators that have defied the curfew.'  Tune in to 'Hannity' for continuing LIVE coverage."},{"comment_id":"10154397036584205","commenter_b":"Way to stop women success!","commenter_a":"I work for Overstock and voted to pull all Trump, both he and his spawn, off our website. Proud of our CEO for putting it to his employees to make the final cut. I can't wait for the results!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"616279121877054","commenter_b":"'@username not all people who are unemployed are 'deadbeats'.","commenter_a":"Get ready, republicans. You will find yourself with no health coverage. Keep praying to your god that you don't get sick.😂😂😂 I will personally take pleasure in watching you suffer.","post_message":"#BREAKING: Majority Leader Mitch McConnell signaled the Senate would move swiftly to repeal Obamacare now that the GOP Congress will have a Republican president."},{"comment_id":"1199514790068549","commenter_b":"'Tear Down This Wall!!'","commenter_a":"Reagan might but Eisenhower would not as he was too far left for todays GOP.","post_message":"When you compare self-identified Republicans today to those of 1990, you have to wonder how well Reagan would do in the 2016 race."},{"comment_id":"10154082239191545","commenter_b":"No, I hope she goes to CNN that's where she belongs!","commenter_a":"I love strong women. She's one to not let anyone run all over her. I like her more and more as time passes.","post_message":"Are you a Megyn Kelly fan?"},{"comment_id":"1529798700659483","commenter_b":"Compensate us all for the injuries we suffered because of what our ancestors did. We had no part I f it. Then compensate the Irish remember, 'Irish and dogs, need not apply' Chinese, italians, 'WOPS'. And then we women, are expecting big checks for years of abuse. Finally, when you finish paying everyone off, well all go to work to pay the huge federal debt you ran up, and will have reached 'slave'status. I want my check too, otherwise I'm going on wekfare. Get over it. Get real.","commenter_a":"I'm excited. I had an ancestor who fought with Sherman's army....so I certainly will not be required to contribute, and maybe even receive compensation for the hardship he endured.","post_message":"BREAKING: Obama Just Announced That He Will Be Forcing You To Compensate Blacks For Slavery.  The slave trade was hundreds of years ago, get over it.  Will you pay up?"},{"comment_id":"10152691528182293","commenter_b":"Shocking","commenter_a":"The poor isn't merely poor in finance & chance; more problematically, they are poor in thinking & vision making them poor all in their life.","post_message":"There is little empathy at the top."}]
