[{"comment_id":"10153352043126756","commenter_b":"Not a chance until the millions of illegal parasites are returned and hospitals offer them nothing.","commenter_a":"America is for real fucked up. You pride yourself on being a democracy yet you tolerate this kind of crap. Why aren't you all in the streets raising hell? No other first world country would allow a system like this.","post_message":"At the end of her life, MaryLou's family owed $100,000 for her medical bills, after insurance. This is how they struggled to manage both the care and the cost of cancer."},{"comment_id":"983083455063224","commenter_b":"Don't apologize, you have a right to feel the way you do, you are a woman","commenter_a":"GEEZE","post_message":""},{"comment_id":"935661276474731","commenter_b":"Entitled because men who sit that way feel entitled to the space they take up. If they take up 3 spaces those are two people who are standing that could have been seated. Not only are they denying people access to a seat, these men are making whoever is sitting next to them very uncomfortable. These men have no idea they are doing this, therefore their taking up of incredibly more space than others is more important than others feelings, never mind they feel they are more entitled to take up 3 spaces than 2 more people are entitled to a seat. Did you see the picture from Seattle? Two men were encroaching on this poor girls space! Yes there are other issues in the world but do you see that feminists ALSO pay attention to them as well? We are capable of multiple thoughts you know. And keep in ...","commenter_a":"..... why is this seriously an \"entitlement\" issues? Do you not see how pathetic it is to be upset because of \"spreading \"? For fuck sake, you're criticizing posture, might add well discuss \"man shaving\" why can't a woman shave get fave without feeling ostracized? Or \"man shoing\" why can't shoes be unisex, why are they discriminating against what gender you have to be to wear a pair of shoes? Or my personal favorite \"man shirting\", why are men's buttons put on one side and women's buttons on they other side. Dear god, these misogynistic assholes have gone to far with their shirts... give me a fucking break. This is, by far, the most unflattering and pathetic issue discussed in the feminist movement. Take on real issues and matters that actually affect these everyday women, the glass ceiling, wage differences, rape offenses. Giving time and thought into little things like ...","post_message":"They both spread their legs on the subway, but only one raised eyebrows. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"10153215419029726","commenter_b":"She is a much bigger problem than wild Willy","commenter_a":"possibly the only reason she wants to be president is so that she avoids prison time.","post_message":"Are YOU Ready for Hillary? Which is her bigger problem... Benghazi, missing emails, Wall Street? @webpagelink"},{"comment_id":"10154784802599575","commenter_b":"arrest her before she flees the country!","commenter_a":"If she had any tact, or respect for the people who voted for her she would of made a speech last night.","post_message":"Hillary Clinton is expected to speak very soon from New York after losing the election to Donald Trump. We will live stream her concession speech on our Facebook page and in this post."},{"comment_id":"10153291115837411","commenter_b":"@username, he pleaded guilty to 4 counts of manslaughter.","commenter_a":"He killed four ppl, But Bobby shmurder still locked up for a gun smh..White supremacy system for ya.","post_message":"Ethan Couch, the so-called \"affluenza\" teen convicted in a fatal 2013 drunken-driving accident who was taken into custody in Mexico, is back in America."},{"comment_id":"762776387211747","commenter_b":"Eu vir isso acho que quinta feira, incrível né❤","commenter_a":"Helton Carlos","post_message":"You can now turn your drawings into real clothing."}]
