[{"comment_id":"10153563758934607","commenter_b":"Are you a democrat? Yes you are. No thanks","commenter_a":"NO.. Cummings supports Clinton.. Anyone connected to her is a NO VOTE..","post_message":"Congressman Elijah Cummings, who announced Tuesday morning that he was backing Pugh, said she has a proven record of passing meaningful legislation not just in Annapolis but during her time on the Baltimore City Council."},{"comment_id":"424924557632585","commenter_b":"Yup she is a liar ,n scandals n bullshit ,just like he cheating filthy fall down husband","commenter_a":"Yossarian Lives Akhil Babel Vinayak Sharma","post_message":"Here's the #HillaryClinton scandal you aren't being told about that actually matters."},{"comment_id":"10153272764696045","commenter_b":"Steals from children and drives drunk to possibly kill someone. She needs to be in jail.","commenter_a":"Mandatory Rehab and therapy","post_message":"Amy McArthur Balch is currently being held in Morgan County Jail with no bail."},{"comment_id":"849951858441198","commenter_b":"This guy is a freakin joke.","commenter_a":"Thank you, much respect to you for not being one of the okie dokie.","post_message":"This one says it ALL!   Video by Occupy Democrats, LIKE our page for more."},{"comment_id":"10154278123559497","commenter_b":"so sorry, I hate seeing girls do this to gay guys","commenter_a":"As a gay man, this was the majority of high school. Being dragged along by my female best friend. Apparently as a gay guy I was supposed to Enjoy whole foods, Bloomingdales, frozen yogurt and Mac lol. Also always being asked for advice by every girl on guy issues.","post_message":"\"You just never know where the day is going to go with Paul.\""},{"comment_id":"10153244569769087","commenter_b":"Youare a fucking ignorant whore.","commenter_a":"Benjamin Netanyahu - is protecting the Free World while Hussein Obama wants the Deadly Suicide Pact with Iran. Wait until Iran hits America with their ICBM's, Iran can already Hit Israel.","post_message":"Israeli Prime Minister Benjamin Netanyahu - בנימין נתניהו delivered an intense silent protest of the Iran nuclear deal by staring down members of the United Nations General Assembly for nearly a minute without saying a word. WATCH:"},{"comment_id":"897196563636468","commenter_b":"Nailed it! Being as, I saw this last night and asked, who is this woman!","commenter_a":"Funny how Kelly Clarkson's known over a couple of continents, yet what's her face has never been heard of over here.","post_message":"Some people wait a lifetime for a comeback like this  well done, Kelly Clarkson."}]
