[{"comment_id":"1598639267107557","commenter_b":"#2ChroniclesChapter7V14 #DrainTheSwamp #OneNationUnderGod #InGodWeTrust #TrumpPence2016 #UCMJ4President #UCMJ4Congress #UMCJ4Senate #USConstitution #BillOfRightsNonNegotiable #Paperballotsonly w/ID #NoAmnesty #AmericaFirst #PledgeOfAllegiance #NationalAnthem #ProNRA #ProLife #Pro2A #NoUN #MAGA #Election2016","commenter_a":"Why are tax dollars being spent on our so called president campaigning for her. ..should be illegal","post_message":"Donald J. Trump finally did it. After taking a lot of punches from the first lady, he unloaded on Michelle Obama, dropping an epic truth bomb on the president's wife.  What do you think about what Trump said?"},{"comment_id":"1131317030222640","commenter_b":"Nice trolling bitch.","commenter_a":"If I want my kids taught fairy tales I will send them to church. As a Louisiana resident this does not come as a surprise.","post_message":"This is appalling."},{"comment_id":"1089895574436829","commenter_b":"Instead of running for president she should be running from prison","commenter_a":"If you're under 50 you really need to read this. If you’re over 50, you lived through it, so share it with those under 50. Amazing to me how much I had forgotten! When Bill Clinton was president, he allowed Hillary to assume authority over a health care reform. Even after threats and intimidation, she couldn’t even get a vote in a democratic controlled congress. This fiasco cost the American taxpayers about $13 million in cost for studies, promotion, and other efforts. Then President Clinton gave Hillary authority over selecting a female attorney general. Her first two selections were Zoe Baird and Kimba Wood – both were forced to withdraw their names from consideration. Next she chose Janet Reno – husband Bill described her selection as “my worst mistake.” Some may not remember that Reno made the decision to gas David Koresh and the Branch Davidian religious sect in Waco, ...","post_message":"The numbers don't lie... but Republicans definitely do.  Thanks to Armed Democrats."},{"comment_id":"974481335922540","commenter_b":"She's a brat","commenter_a":"She was never hired for the movie... Therefore cannot be fired...","post_message":"Do you agree?"},{"comment_id":"10153474188676350","commenter_b":"But they can't make babies it takes a man and a woman to have s baby","commenter_a":"So wrong","post_message":"#BREAKING: Supreme Court makes same-sex marriage legal nationwide in landmark decision."},{"comment_id":"10154593663574342","commenter_b":"Okay, she looks stupid with that dress, you ain't royalty Girl... that's something Kate would wear smh...or the Kennedy","commenter_a":"just hate the way he acts , cant even wait for his wife","post_message":"First Lady Melania Trump is wearing a sky blue, mock turtleneck Ralph Lauren dress as she walks into St. John's Church with President-elect Donald J. Trump.  Watch #Inauguration Day live-->@webpagelink"},{"comment_id":"620966654718777","commenter_b":"She is the most horrible stupid idiot that has ever lived. Look at all the destruction she has caused even after her death.","commenter_a":"Neither did Karl Marx.","post_message":"Two attempts -- one small, one large; one entirely private, one government-backed -- have both come to the same conclusion: Ayn Rand didn't understand squat about real-world capitalism."}]
