[{"comment_id":"10152874600638598","commenter_b":"The men in China are becoming desperate for wives and there is none to be had. Men are now kidnapping small girls to keep for wives.","commenter_a":"I don't see any of you adopting the millions of unwanted children from china. The thrown away ones because they were girls, or the second child. The unwanted and given up for adoption, living in an orphanage or on the streets ones.","post_message":"China Has No Plans to Suspend Its One-Child Policy Resulting in Forced and Sex-Selection Abortions"},{"comment_id":"10153924246056800","commenter_b":"Bye Felicia","commenter_a":"I can't! Im done with this show....this used to be one of my favorite shows that would tell it more or less like it was. But now its just a one sided political agenda. Goodbye daily show may you rest in peace","post_message":"Activist DeRay Mckesson talks about the tenets of the Black Lives Matter movement."},{"comment_id":"10152713641640496","commenter_b":"Amen, Laura ! AMEN.","commenter_a":"Sorry. I disagree. He sounds like a spoiled brat who realized that marriage takes work. Both people have to be willing to work at it. A real marriage is good. Hard sometimes. But good.","post_message":"How many of these do you agree with? @webpagelink"},{"comment_id":"10153648380297293","commenter_b":"so that justifies a breach in privacy, Richard?","commenter_a":"Why keep nude images of yourself either on your device or your email inbox especially when you're a person of public interest. Stupidity warrants punishment.","post_message":"Jennifer Lawrence, Kate Upton, and Lea Michele were among the celebrities whose photos were said to be in the Celebgate dump."},{"comment_id":"10154679365898797","commenter_b":"Let him alone","commenter_a":"Let him go! He did what any man would do for his wife! If that happened to me I'd have shot him! Either way the man would have died! Let him go!","post_message":"HUSBAND PROTECTS WIFE: A man has been arrested after beating and killing another man who had broken into his home and sexually assaulted his wife."},{"comment_id":"10153216569907550","commenter_b":"@username, lol you all claim its part of your heritage... First and foremost did you READ my post carefully? Because if you did you would know that I was referring to the past southerners who DID do all that. Your heritage is ALL THAT.... Your southern heritage is a hateful one and that's what you all are holding on too... You Keep saying that flag is our heritage. Name one good thing the south did for the slaves that wasn't hateful and name one good thing that flag represents. And FYI Lisa, you can't enlighten me because just like your counter part, you can't explain what your southern heritage is.","commenter_a":"It is not a symbol of hate, only in your dumb minds...its a symbol of our Heritage......maybe if you learned something in school you wouldnt worry about that flag........","post_message":"\"The time has come to remove this symbol of hate....\" Local religious and political leaders joined forces today to call for the South Carolina state general assembly to remove the Confederate battle flag still flying at the state capitol. More here ---> @webpagelink"},{"comment_id":"10153933427867235","commenter_b":"Shouldn't she be looking for baby daddy #3 instead of being an idiot?","commenter_a":"Barstool--shut up and go try to figure out who your latest baby daddy is.","post_message":"She said, ‘Not everyone gets a trophy.’"}]
