[{"comment_id":"875517669161528","commenter_b":"Well here's the problem because of women like you these little Angel can't even make to birth how disgusting!","commenter_a":"The American dictionary says it's a human embryo, human fetus, human unborn baby. Common sense says it deserves human rights.","post_message":"Tell Congress to protect the unborn! Sign your Life at Conception Act petition today!  CLICK HERE to sign! @webpagelink"},{"comment_id":"10153220185391336","commenter_b":"I bet you that pussy Obama couldn't ride a bike","commenter_a":"How racist of him to ride a bike it's all his fault","post_message":"Former President George W. Bush hosted his fifth annual Warrior 100K bike ride in Crawford, Texas. This year's theme was healing the invisible wounds of war. @webpagelink"},{"comment_id":"10153034727835667","commenter_b":"Wtf she's ugly and weird","commenter_a":"Linzee Kay @username","post_message":"Miss Piggy will not be pleased."},{"comment_id":"10154566603193645","commenter_b":"Most murders in US is commited by non Immigrant. Sandy Hook was by a mentally unstable person. Charleston commited by a Rasist unrepentant kkk inspite of the grace afforded him by the people he killed and their families. Florida commited by mentally unstable guy. The guns remain a major problem . Why is there no Presidential order banning guns. No NRA sponsored their election. Why ban muslims but allow christians. A a Christian myself I see this as very wrong. Saudi Arabia had 15 of the 19 killers of 911. Why is Saudi Arabia not included. Something is not right . I am Proud of the brilliant Judges. No one is above the Law.","commenter_a":"They should be thrown out and replaced. They can run for a political office if they want to push a political agenda","post_message":"BREAKING: A 3-judge panel just unanimously ruled against reinstating Trump's Muslim travel order. Do you support or oppose the court's ruling?"},{"comment_id":"1605375073100237","commenter_b":"Fuck him and his family. Good job lady and sorry you had to as nobody wants to kill someone. But they will kill, torture, and rape you. Good you were armed. God bless you.","commenter_a":"Why do we allow people like this to contribute to the GENE POOL? His whole family should be spaded and or neutered. Why because of IDIOTIC lines like \"he needed money for clothes\" what happen to all the government hand outs this family was getting, cause sure as shit they all were on welfare and not one ever held a job. As to whether or not it was the home owners fault is by far the most asinine thing ever spoken.","post_message":"This teen punk broke into a woman's home and tried to rob her. But she defended herself, and left him dead.  Now the punk's family is asking an absolutely sickening question, that left the woman and her friends shocked.  Only in Obama's America..."},{"comment_id":"880910168618891","commenter_b":"Martial Law.... never heard of her. Lol. 2nd revolution needs to take off","commenter_a":"Rising up with guns will only give them what they want or need to bring down the hammer of martial law","post_message":"In case you missed it, here's our top story from Monday: It’s clear that if the U.S. is to restore human liberty and return to the Federalist system created by the Founders and since destroyed by Abraham Lincoln, the Federal Reserve Act, the 16th and 17th Amendments and an activist Supreme Court that abused the 14th Amendment, one step — and probably the first step — must be to repeal the 17th Amendment. Repealing the 17th Amendment would take the money out of Senate elections on the federal level. Senators would be beholden to their state legislatures again rather than the corporatist class that lines their pockets, finances their re-election campaigns and ensures them seven-figure lobbying gigs once their time in “public service” ends. Senators would not act against their states, as 12 senators from 10 states are currently doing in regard to President Barack Obama’s executive action on amnesty for illegals. @webpagelink"},{"comment_id":"10154082976562464","commenter_b":"Build that wall!","commenter_a":"(yawn) No, thanks. I'm voting for Trump, like everybody else.","post_message":"ICYMI: This Amazing Ted Cruz Ad That Came Out A Few Days Ago Is MUST-SEE -->"}]
