[{"comment_id":"10153844066851770","commenter_b":"******* PENCE WHIPPED WITH A KAINE *******","commenter_a":"Not too much for me to say, I hope they both lose. God bless the U.S., amen.","post_message":"The #VPDebate is over, but there's still a lot to talk about. Like that rumor that Trump is mad about Mike Pence doing so well, or all those times Tim Kaine interrupted him. Keep watching for a special round of trivia, starring a giant tub of Nutella. Your hosts: Christopher Bedford, Christian Datoc and Katie Frates."},{"comment_id":"1126542647424270","commenter_b":"@username oh I wouldnt doubt that, that witch needs to go down!!!!","commenter_a":"Not the first time this reporter has accused someone of the same type of assult, just another reporter looking for the spotlight!!!!","post_message":"The Secret Service just dropped a massive bombshell about the charges against Donald J. Trump's campaign manager, Corey Lewandowski... this is huge. What this agent says about the \"assault\" will completely change the case..."},{"comment_id":"1382661791756865","commenter_b":"Somebody pleass shut this fatass up.","commenter_a":"some day little fat man someone is going to shut your mouth when you talk about things u don't know anything about.u are just mouthing off cause u want to be a big ass --- hum you already have a big ass --- so get off President Trumps back. he is only do what he needs to do to keep America safe","post_message":"Michael Moore always finds a way to be even more classless than he was minutes before! That seems to be his only real talent."},{"comment_id":"1642335606053552","commenter_b":"It's a shame what Obama has done...","commenter_a":"We'll See If You Mock Jesus When He Returns For All Us CHRISTIANS! CHRISTIANS Are Praying for You Obama.......","post_message":"Wow. Thank you for defending Christians David Cameron."},{"comment_id":"484149281775652","commenter_b":"Get rid of him and his fat AZZ wife!","commenter_a":"Yes","post_message":"VIDEO: Kanye West cries racism after Beyonce loses... Kanye is a fool and a cancer, let's ban him from America. Do you agree Kanye should be banned from America?"},{"comment_id":"10153179690136523","commenter_b":"So that one example involving you makes you come to the idea that lots of females lie..? And the proper way to handle that situation would be to go to the authorities and let them deal with it.","commenter_a":"Lots of girls lie about that stuff it happened to one of me old friends the bitch said he raped her be he really didn't there's lots of girls out there that's are like that","post_message":"19-year-old Owen Labrie, a former student at the elite St. Paul's School, appeared shaken as the verdict was read, at one point nodding his head and reaching for a tissue to wipe tears. At the time of the assault, the accuser was 15 and Labrie was an 18-year-old senior."},{"comment_id":"10155104954104411","commenter_b":"Smoking is very bad but rapefugees are not. Damn wtf happened to Sweden..","commenter_a":"what about the vehicle emissions?","post_message":""}]
