[{"comment_id":"1609547186014156","commenter_b":"#BELIEVELAND","commenter_a":"Believeland! Cleveland! Go Cavs!","post_message":"A BIG day for your Cleveland Cavaliers ! They were honored at the White House:"},{"comment_id":"1278673865484657","commenter_b":"I understand that Hillary has a criminal mind, and I never want someone like her in any office of our government. Her evil intentions are based upon her greedy lust for power and money. But with all due respect, Mr. Trump, what I find so incredibly \"shocking\" is that NO ONE CARES ENOUGH TO DO ANYTHING ABOUT HER!!! Everyone is pissing and moaning ALL THE TIME about Hillary and Obama, saying she done this, and Obama done that. BUT WHAT IS BEING DONE ABOUT THEIR REIGN OF TERROR? NOTHING. ZERO. ZILCH. NADA. To me that says that Americans are a bunch of APATHETIC ENABLERS. We the people deserve the lot we've been given because we, as a nation, have ALLOWED IT!!! #stoptheenabling #stopthetyranny #votetrump","commenter_a":"\"Because one wrong move can mean the difference between life and death.\" -Hillary Clinton, 8-25-16 We know that's true, Hillary. We know that's true. Signed: Ambassador Stevens Sean Smith Glen Doherty Tyrone Woods","post_message":"Hillary Clinton’s actions constitute all of the elements of a major criminal enterprise - she created a private illegal email server in order to hide her corrupt dealings. She did so knowing full well it would put American lives at risk by making classified information highly vulnerable to foreign hacking. But, she didn’t care – as long as it helped her get away with her crime, no risk to America was too great. Then, to further cover-up her crime, she deleted 33,000 emails to keep them out of the hands of authorities and the American public. As a further element of the criminal cover-up, she claimed under penalty of perjury that she turned over all of her work related emails. We now know this to be one more massive Clinton lie. The FBI found thousands of work-related emails she failed to turn over, including the new discovery this week of ..."},{"comment_id":"586488074867632","commenter_b":"There needs to be at a 10 yr moratorium on any immigration!! From 1920-1965 there was no immigration whatsoever. The reason was: from around 1889-1920 there were 14 million immigrated allowed into the USA & the Govt said they needed to get acclimated & learn English, to become Americans. This needs to start again!!","commenter_a":"None we are full up","post_message":"Currently, the U.S. allows 1 Million legal immigrants every year. New poll of voters found most want the number cut at least by half. What do you think?"},{"comment_id":"1419424701411870","commenter_b":"Um no","commenter_a":"Peter Di Benedetto","post_message":":O"},{"comment_id":"903353419700080","commenter_b":"She is so nasty looking all the time I bet she stinks","commenter_a":"What is Always wrong with her tongue? Personal hygiene is a must. Can someone tell her to brush it .","post_message":"Awesome!"},{"comment_id":"10154062692302439","commenter_b":"How will all the \"empowered\" women of America take this? I say there will be a revolt.","commenter_a":"Has the U S stooped so low. No gentlemen, no ladies, no gender. Just human bodies. Numb, mindless zombies.","post_message":"Another gift we can thank the feminists for. Let's see; the epidemic of single motherhood, the breakdown of the American family, the street vernacular of \"bitches and hos,\" the emasculation of men, defense of Islamic misogyny, suppression and oppression, silence on sharia, and the bone-crushing responsibility of one woman being mother, father, breadwinner, chief cook and bottle washer we owe to the feminists. And now this - one can only imagine what the likes of the Islamic State will do to our female soldiers."},{"comment_id":"10153743824977093","commenter_b":"Ain't no snake ever hurt no one. My niece Becky got bit by a dog","commenter_a":"Am glad y'all found this snake","post_message":"UPDATE: The missing king cobra has been found. That time your deadly pet snake escaped the house.. bit.ly/2bPTSGW"}]
