[{"comment_id":"1073790629380657","commenter_b":"'@username. Just fn Stop it with the Fox 'news' total BS talking points. Insurance is about LIABILITY, not necessarily self protection..and it's Democratic Socialism at it's core such as our tax code: Put $$$ into the pot to benefit/secure your society's quality of living. The phrase 'free market capitalism' is nothing but corporate fascist propaganda for dumb asses.","commenter_a":"I like to ask people that hate socialism why they buy insurance? You can almost see them stroke out as they start to think really hard about the question.","post_message":"Brilliantly done."},{"comment_id":"10153503601036770","commenter_b":"BLM? not at all! worthless savage racists. if they think that their worthless lives matter then go into the dangerous crime ridden ghettos created by blacks and convince them to stop killing each other. I would rather give black thugs target practice so that they don't hit innocent bystanders when trying to shoot each other.","commenter_a":"SCREW BLM...","post_message":"A controversy has erupted at Dartmouth College after a pro-police display was torn down by Black Lives Matter activists, who denounced it for memorializing the 'perpetrators' of 'state violence.'"},{"comment_id":"1815605405326385","commenter_b":"CSI!!! That bitch bit me... great episode.","commenter_a":"Is no one concerned that she is really a giant lizard? #reptilian","post_message":"Is this an indicator that we really should be concerned with her health?"},{"comment_id":"1012961912156618","commenter_b":"I would give my share to put there asses on a boat and send the ass holes somewhere else","commenter_a":"Big mouth and no brains. This is what Obama has done for this country. What a disappointment.","post_message":"'Pay me consistently, provide me safe housing, offer me a job with benefits, run me those Beyonce tickets' She must have lost her mind, if she thinks we are going to pay her anything. Will you pay for this entitled BLM organizer to go to a Beyonce concert?"},{"comment_id":"10153644969898812","commenter_b":"Those flags do not represent the United States that I love.","commenter_a":"The church did not request it. The church is private property. Why does anyone think that TRASH should be placed on church property? If it is so much 'Southern heritage,' why was it placed on a predominantly black church? Is that like burning a cross on someone's lawn?","post_message":"Four Confederate flags were discovered this morning by the Ebenezer Baptist Church and the Martin Luther King, Jr. Center: @webpagelink"},{"comment_id":"1270088773057875","commenter_b":"'@username cocain bottles and bitches *","commenter_a":"Let me get a 300$ tip in Christmas I'll spend that shit on cocaine and bitches","post_message":"Faith in humanity restored!  #WSHH"},{"comment_id":"1796926360545603","commenter_b":"I well tell you some thing... The isis was made by usa","commenter_a":"Vote Trump. .... what's the matter killary fans u guys worried. ... U should be","post_message":"We are going to get rid of ISIS! America needs real leadership. #MakeAmericaSafeAgain"}]
