[{"comment_id":"10154026224212869","commenter_b":"I agree! There are plenty of legitimate issues that should convince anyone paying attention that Clinton does not belong in the White House. I feel like spinning 100 different (and in many cases overwhelmingly mean spirited) conspiracy theories makes the relevant confirmed issues on either side carry a lot less weight. I'm not saying that I don't think her health may be an issue, or even that it shouldn't even be written about, but there are 100 different reasons for a vehicle like that to include a wheelchair lift.","commenter_a":"Is anyone else tired of these feeding frenzies, I for one am.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153662758062894","commenter_b":"Naw mama had let that warning out that she addresses her child my bad young lady again she gon catch that fade","commenter_a":"But skai read her so no need for mama to even say anything","post_message":"Not My Child! Skai Jackson’s Mother Has Words for Azealia Banks: ‘I Don’t Play Those Games’ [Photo]"},{"comment_id":"10153694890631323","commenter_b":"What are black women always the ones who show so much ignorance","commenter_a":"If they aren't defined by it than why change your sex medically? Come on","post_message":"They could have made something positive, but the new Channel 4 series Girls to Men is demeaning to trans people on so many levels: 'Greater visibility for trans people should not mean even more close-up shots of genitalia and 'Ooh, don’t they look different – almost like real men' montages. It should be about taking the focus off surgery, suffering and sensation, because a transgender man is not defined by those things any more than the next person'"},{"comment_id":"10154230150699411","commenter_b":"Bastard british dog ottoman sunnis was wrost enemy of wahhabi saudis.check your history motherfucker.your resourceless England speard wahhabism all over world by supporting saudis.check your own history!muslim world is uniting when we unite your britain have large number of street beggars.your Uk have only tourism!end of Uk signs apeared yesterday when English team beat by West Indies!haha","commenter_a":"At least it's not as bad as the destruction of the Giant Buddhas of Bamiyan, or the mass destruction of priceless World treasures like the Hindu, Buddhist & Sikh Temples in India or the destruction at Palmyra!! Sunnism is the World's problem!!","post_message":"vandalism"},{"comment_id":"870560229647985","commenter_b":"Not bad for Teddy... only two outright lies in 4 sentences lol","commenter_a":"Love Ted Cruz","post_message":"Listen to how this Obamacare question from CBS News correspondent is phrased -- and then Ted Cruz's answer:"},{"comment_id":"1589593461282497","commenter_b":"What a dork...........","commenter_a":"This guy is putting himself in the same catagory as Trump when he talks this way about anyone. He could have made his point without all the cursing.","post_message":"The very end is the best part.  Thanks to The Liberal Redneck. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153053821551051","commenter_b":"Nazi bitch. Do that in front of me. Evil","commenter_a":"Again school employees who think they have the answers this is awful and someone should take her food away from her","post_message":"A school official walked up to this little girl, picked up her lunch and threw it in the trash in front of everyone. The girl immediately began to cry."}]
