[{"comment_id":"10156197191420354","commenter_b":"A CULT that needs to be extinguished!","commenter_a":"Islam is NOT a religion of peace!!!!!","post_message":"The full statement is SCORCHING..."},{"comment_id":"10153666146819099","commenter_b":"Shut up you dumb broad","commenter_a":"Get guns off the street. It's time for stricter gun laws.","post_message":"A 30-year-old wanted criminal with 12 prior incarcerations allegedly shot a 33-year-old NYPD officer in the head in East Harlem, authorities say ----> @webpagelink"},{"comment_id":"992191140821358","commenter_b":"Why? I think she is best in the senate. I also think an all female ticket is unrealistic.","commenter_a":"Clinton/O'Malley would be a good ticket.","post_message":"Hillary Clinton absolutely crushed every single Republican candidate in a recent CNN/ORC poll."},{"comment_id":"1009017532480603","commenter_b":"Has this vile woman ever told the truth?","commenter_a":"Hillary For Prison 2016","post_message":"\"What difference does it make?\""},{"comment_id":"1000268296676215","commenter_b":"Bitch she's a nothing","commenter_a":"Must you keep posting that mug? We are offended just looking at her and her husband ( POOR EXCUSE FOR A PRESIDENT! )","post_message":"Michelle Running Campaign To Ban ‘Offensive’ Word From English Language. She has completely lost it. Do you find Michelle Obama offensive?"},{"comment_id":"10155028895888010","commenter_b":"@username this isn't a Democracy. It's a Constitutional Republic. BIG difference.","commenter_a":"I think the LA Times is confused. There is a difference between an attack and a response to an attack. I'm not saying Trump never attacks people...I know he does. But several times now I've seen Trump's responses described as attacks (ie Meryl Streep).","post_message":"The president-elect was responding to criticism."},{"comment_id":"10155033056251350","commenter_b":"you alice are the lame one.... bet u r fun at parties....not!","commenter_a":"how can americans put the flynn event in context. flinn's entry into the trump power structure was vigorously opposed from the beginning: one might even consider his a marked man. part 2: media has propogated trump's comments on intelligence agencies extensively. so one could ask the question how does the leak on flynn occur in the first place: NSA surveillance or other. it would appear a US intelligence agency leaked to the anti trump news media:))) could one consider that a direct attack on this nation to influence American government: yes. trump must drain the swamp in the intelligence community now. the entire establishment apparatus that supported the status quo is now actively working against change middle class voted for: start the purge. there is an outlier that must be considered: Israel. trump is surrounded by Israel firsters. was flynn one of those or was he an American firster. did ...","post_message":"On this Valentine Day, watch George H.W. and Barbara Bush share their touching love letters on TODAY in 2011 (and try not to cry!) @webpagelink"}]
