[{"comment_id":"598181650332929","commenter_b":"If this is a representation of the caliber of people America is attracting we're in trouble. It's obvious that we seem to attract a large criminal element, and what does that say about America??? It says we're soft on immigration and soft on criminals, it also says that our Social Services are out of control and way too generous. Trust me these illegals KNOW that they well be given everything for free !!!! and that they can yell Police brutality and that they can do anything they want and get anything they want...welcome to liberal socialism..","commenter_a":"Pigs go to market","post_message":"I agree!"},{"comment_id":"687880108038609","commenter_b":"of course they arn't all murders and gang members that's why the wall will have a door or did you miss that part in the cnn chopped up version of that speech? the ones who want to be Americans can stay the rest can f off.","commenter_a":"These comments are disturbing. These are parents, children, families...not murders, drug dealers or rapists. Instead of \"building a wall\" or treating them like shit we should be coming together with Mexico so that they don't need to come here. They need help, we have a problem, so why are the two countries not putting their heads together to figure out a way to HELP","post_message":"Thousands of Central American children and families are arriving in Texas."},{"comment_id":"1020212581369220","commenter_b":"Ahahahah shut up bitch! :-*","commenter_a":"S ja ta td percebido ;)","post_message":""},{"comment_id":"10157972017965093","commenter_b":"@username Hey moron why couldn't those 3 legged blind goats beat trump.","commenter_a":"They couldn't beat Trump, what makes you think they could beat Clinton. Just asking the question tells me that you still haven't figured out exactly how fed up people are with the Republican leadership. They, and their democratic counterparts are the reason people are crying for term limits.","post_message":"You decide..."},{"comment_id":"1209490769090378","commenter_b":"Hillary is no lady she is more of a whore.","commenter_a":"We've already learned that this lady is a huge liar. What she says, and what she can do, are 2 different things. Obama just got blocked, so, hopefully this we won't have to worry about it and Trump will just be elected. Fingers crossed.","post_message":"DON'T let this woman be elected!!! @webpagelink"},{"comment_id":"1242224722465203","commenter_b":"\"because they make decisions based on gut feeling and emotions\" - And here come the Facebook comments that'll prove just that. *sigh*","commenter_a":"I'm sure some don't, same with men.","post_message":"This person is also a board member of Women in Science and Engineering. -_-"},{"comment_id":"10153492061886337","commenter_b":"Probation and a fine is all she may get. Prison you can't be that ignorant!","commenter_a":"This lady is an idiot, commited at least 3 different Federal Felonies... lol dumb broad. Well there's no Rebel flag in prison so she will be happy.","post_message":"GET TO KNOW Bree Newsome, the woman who climbed the flagpole at South Carolina's capitol building and took down the confederate flag..."}]
