[{"comment_id":"10155456219056509","commenter_b":"Both are adulterous stalkers.","commenter_a":"Trump is lying about his own words he says he didn't do what these women say but on tape he brags he did. What a liar, lying Trump calls himself a liar. LOL","post_message":"For some women, Donald J. Trump's denial of wrongdoing has made them feel compelled to speak out"},{"comment_id":"1543012149092242","commenter_b":"Awww you pathetic little slut... Let me guess, yo baby daddy is black....","commenter_a":"Its funny because in the 5th grade i refused to stand for the flag, 5th grade and i already knew this country was crap and lacked concern for its citizens. My friends grandfather was a vet from vietnam and she refused to stand for the flag out of how this country treated its troops. And she had every right and justification. You guys are missing the meaning behind the flag, you cannot just take the good of a country and claim thats all the country is. There is injustice that is constantly being negated by people like you, and those in these comments, simply because you haven't experienced it. Get over yourself and your terrible nationalistic views about a country that couldnt care less about you. Reality is reality, that flag represents a government that openly allows racism to grow and continue in our judicial and enforcement systems.","post_message":"This store owner planned a signing event with Brandon Marshall but when Marshall protested the national anthem, the owner cancelled the event immediately... but what the owner did next is going viral. Good for this owner... he's a true patriot."},{"comment_id":"10153931613802093","commenter_b":"I hope they carve him really good in TDC.","commenter_a":"What a motherf**king piece of s**t thug. Die, a**hole! Yeah, I'm pissed.","post_message":"BREAKING: Gustavo Zavala-Garcia has officially been charged with capital murder in the death of 10-year-old Kayla Gomez-Orozco. His bond has been set at $10 million. bit.ly/2fwFjd0"},{"comment_id":"1002116393141873","commenter_b":"I wonder if Muslim women can cover their faces at protests with the new anti-mask protest law?","commenter_a":"Does this mean people can wear the banned Anonymous mask to the citizenship oath ceremony?","post_message":"Developing"},{"comment_id":"10153546186781162","commenter_b":"The disturbing replies to this is that people actually think just because she is a woman, she can hit whoever she wants and continue to escalate a fight. Doesn't matter who or what she is. You don't hit people period. Had she not come back in, hit him and continued this, there would have never been a problem.","commenter_a":"I'm all for not putting hands on a woman. But where's this equal opportunity draw the line at? She smacked the taste out dudes mouth. Don't start what you can't finish","post_message":"PANERA ATTACK: A Panera bread manager is fired after he was filmed punching a female employee in the head and knocking her to the ground. WATCH: @webpagelink (Warning: Graphic video)"},{"comment_id":"1022176817805108","commenter_b":"It really doesn't look like the kind of skirt that could be worn any higher either.","commenter_a":"That skirt is hardly short... Cheerleaders' skirts are much shorter.","post_message":"When this student body president was shamed for a \"too short\" skirt, she wasn't having any of it and her response is epic."},{"comment_id":"10153178614619342","commenter_b":"This dude doesn't even capitalize TEXAS or GOD and y'all comment on this???Surely the fear of God sounds so Christian???? LOVE IS LOVE END OF STORY!!!","commenter_a":"texas is a god fearing state.we will not compromise on our faith","post_message":"JUST IN: Texas Attorney General Ken Paxton calls the Supreme Court decision giving same-sex couples the right to marry a \"lawless ruling\" and says state workers can cite their religious objections in denying marriage licenses. STORY --> @webpagelink"}]
