[{"comment_id":"10153390451923837","commenter_b":"She should have done what the officer said and THEN tried to negotiate. I'm sure he would have let her return or pay for the shoes, but she insisted on pulling away from the officer, flailing and kicking. Officer was in the right.","commenter_a":"Oh well she got her prize for stealing","post_message":"DO THEY GO TOO FAR? Check out the body cam video of a Fla. woman accused of shoplifting being taken down and bloodied by a sheriff's deputy. Was the officer too aggressive? THOUGHTS - HANDLED FINE or WENT TOO FAR?"},{"comment_id":"10152523937956135","commenter_b":"Only issue is the sand doesn't wash down the drain as easily as salt when winter is over","commenter_a":"Sand is better. We use a salt and sand combo (more sand than salt) in the UP.","post_message":"Ever slide through a cold Interstate at night and wonder how exactly is salt supposed to melt ice?"},{"comment_id":"1115305561859305","commenter_b":"And this so called wall would cost Americans billions of dollars. We can't afford that. No one can force Mexico to pay for it. And what about the water ways and the mountians? How will you put the wall on those?","commenter_a":"The WALL will seriously squelch the drug cartels, crime will decrease and the land value will increase, - It's called tough love, if we continue with open borders California will collapse, we flat-out can't afford it anymore, we're broke. Mexico has the best land in the world.","post_message":"\"Es una amiga nuestra de mucho antes y de siempre\". —Congresista Luis Gutiérrez sobre Hillary Clinton"},{"comment_id":"10153400709859474","commenter_b":"she will not tell the truth...","commenter_a":"What difference does it make","post_message":"Breaking: Hillary Clinton to testify before Trey Gowdy and the Benghazi Select Committee. Share to demand the truth!"},{"comment_id":"516541241803803","commenter_b":"@username then you should stfu!!","commenter_a":"If he violated a voting law, he should go to jail! Oh, wait! He was a drug dealer, had people killed, is a rapist, lied under oath, sold military information to China,.... STILL WALKING FREE!","post_message":"Do you think Bill Clinton should go to jail for this?"},{"comment_id":"10153750780819062","commenter_b":"Why would you trust two gals that looked like that for anything cosmetic?","commenter_a":"Hope they catch them","post_message":"Police have issued arrest warrants for two people in connection to the death of a woman who police say received injections of a substance in her buttocks in a botched cosmetic procedure."},{"comment_id":"1585670881742175","commenter_b":"DRAIN THE SWAMP","commenter_a":"END THE CORRUPTION!","post_message":"WATCH LIVE: Donald Trump campaigns in Golden, Colorado before he comes to Phoenix."}]
