[{"comment_id":"10152521923501135","commenter_b":"The automakers would like to sell you a new vehicle sooner rather than later.","commenter_a":"Jennifer A. Thompson","post_message":"Do you really need to idle your car on days like today? We separate the facts from the myth. WHAT WE FOUND: @webpagelink"},{"comment_id":"1251904504850405","commenter_b":"scum. I hope someone cuts your dick off. Then you can really be a women. Until then stay in your own damn bathroom and leave us women alone. One of these days yours is coming.!!!!!!!!!!!!!!!!","commenter_a":"single occupancy facilities is the only sensible answer. But that ain't good enough for the terminally aggrieved.","post_message":"👏 👏 👏 (via The Huffington Post)"},{"comment_id":"983083455063224","commenter_b":"Don't apologize, you have a right to feel the way you do, you are a woman","commenter_a":"GEEZE","post_message":""},{"comment_id":"10153982167589203","commenter_b":"What a pussy cant go against his witch of a wife!!!!","commenter_a":"@username Lorenzo Antonino","post_message":"\"If we're not a part of the solution, we're a part of the problem.\""},{"comment_id":"109818942877901","commenter_b":"Pussy ass crackas","commenter_a":"Whatever you need","post_message":"Name it! #WSHH"},{"comment_id":"857720034363387","commenter_b":"This crap has to stop!!!!We do NOT need hillary and another 4 years of obozo and their evil ways-they have destroyed this country--we can not afford all these immigrants---we have to take care of our own first!!!!!","commenter_a":"They'll vote for Gary before Hillary.","post_message":"Exclusive: Federal immigration officials may be working overtime to swear in as many new \"citizen voters\" as possible before the presidential election, according to an internal Obama administration email disclosed to FoxNews.com by Republican Sen. Ron Johnson of Wisconsin."},{"comment_id":"431677547020539","commenter_b":"Filthy muslims ,deport or tag &bag'em .","commenter_a":"That is disgusting.","post_message":"This is disgusting — would YOU want to use a sink someone had washed their feet in?"}]
