[{"comment_id":"10152948975362434","commenter_b":"SHUT UP BITCH","commenter_a":"Oh I think I don't need to post my thoughts as just the last two comments from Shoshana and Kelly do it for me. But - who the hell does she think she is anyway?","post_message":"Of course she is."},{"comment_id":"10152676390231519","commenter_b":"I always come across people who like to talk shit while hiding their face. Typical","commenter_a":"Mentioning Faux News isn't a \"liberal\" thing. The ones who mention it are humane, educated, not ignorant and are not racist. That's not \"liberal.\" People that watch Faux News other than for the laughs are both ignorant and racist. Period. They also hate democracy, hate poor people and hate minorities - I.e., they are thuggish punks. Wear your badges proud, you cowardly fascist creeps!","post_message":"This could end Brian Williams' career..."},{"comment_id":"10153850039752452","commenter_b":"Samantha Keller me","commenter_a":"Esdras Diaz","post_message":"After being a dad for five months, this father decided to share a funny review on his “2016 model” baby. @webpagelink"},{"comment_id":"948371528584407","commenter_b":"They will never be Americans .. They are all murders and need to go home..","commenter_a":"His typical BS. Lie Muslims. Don't belong here !!!","post_message":"Do you think there was anything wrong in saying this?"},{"comment_id":"10153443298156051","commenter_b":"Go to hell","commenter_a":"She a moron. You hate kids then don't work at a day care idiot.","post_message":"A few hours before she began her new job, this mom posted something on her Facebook account. Before she could even get to work, her employers called her and told her not to come in. Decide for yourselves whether she should've been fired."},{"comment_id":"1006112072821407","commenter_b":"Demand Justice..Hillary doesn't deserve a Free ride.....","commenter_a":"Clinton Mafia is on the Move #NeverHillary #NeverAgainBill!!!","post_message":"FBI Director James Comey detailed Hillary Clinton massive destruction of government records and grossly negligent handling of classified information. Frankly, there a disconnect between Comey devastating findings and his weak recommendation not to prosecute Hillary Clinton. Federal prosecutors, independent of politics, need to consider whether to pursue the potential violations of law confirmed by the FBI."},{"comment_id":"10153652749211336","commenter_b":"You better find a different church.","commenter_a":"Joe's Sunday Sermon - 09-06-2015 I guess I am compelled to address the elephant in the room. No, I am not making fun of her weight, it is just an expression. I am of course talking about Kim Davis, the misguided Kentucky Clerk of the Court that was recently jailed due to her contempt for the court and in my humble opinion, for humanity as well. This is NOT an issue of religious freedom. You can twist it, bend it and run it through a press and it will still not come out as a religious freedom issue. Does her issuing those licenses force her to change her religion or her religious views? No. No, it does not. She may still practice her religion as she chooses. She took an oath and that oath was to uphold the law. Does her religion condone being dishonest and deceitful? Well, again, in ...","post_message":"As Kim Davis began her third day behind bars yesterday, having chosen indefinite imprisonment over licensing gay marriage, around 300 people gathered on the lawn outside."}]
