[{"comment_id":"1891157881114099","commenter_b":"that's something you would need to record lol","commenter_a":"@username this would be something you would do lol","post_message":"Now that's a f.d up prank. #WSHH"},{"comment_id":"10153336853341518","commenter_b":"Remember these two Stones Tablets were made to represent apart from commandments written on them. The first Stone Tablet represented the sin bearin Messiah who was to be born in the Holy Land in Canaan and the second Stone Tablet was to represent Messiah the KING who who was to be born in the Holy Land hidden in Africa. These Stone Tablets are buried in different places in Africa and they are Two Shrines of my God.","commenter_a":"Who cares? This is the problem with Judaism today; the discussion is over minutiae and not substance. People are ignorant regarding the mitzvot and the Chief Rabbinate is concerning themselves with this?","post_message":"The Israeli Chief Rabbinate has cut the arches off the 10 Commandments. (We want your comments, but please first read the actual and complete article and not just the Facebook excerpt. See link below...) ------------ Shalom Bear has published \"Squaring the Circle\" on JewishPress.com. @webpagelink"},{"comment_id":"930922740261239","commenter_b":"This will be great and a good female leader not like the arrogant bitchthat we have in BC.","commenter_a":"Albertans are the dummies of politics, what happened the last time a female was in power in that province","post_message":"A ray of hope for Alberta's NDP MPs? via The Huffington Post Alberta"},{"comment_id":"10153478346566955","commenter_b":"Nancy Reagan has more class in her little finger than Michelle Obama has in her entire \"hulkish\" body!!!!!!!","commenter_a":"As always, a lady of class! Hoping this next debate, we get a chance to hear from ALL the candidates more than the moderators.","post_message":"Nancy Reagan invites 16 candidates to next debate..."},{"comment_id":"10153099040499726","commenter_b":"I'd like to get rid of your ass.","commenter_a":"Just another lie.","post_message":"WATCH: Democratic Representative: 'Tea Party People' Want To Bring Back Segregation, Get Rid Of Women's Rights."},{"comment_id":"638229933016362","commenter_b":"Yeah. There just has to be some reason why hitliery didn't win other than the fact that she is a worthless lier.","commenter_a":"no they did not more lies","post_message":"The CIA says Russia intervened in the election in order to help Trump win. How do you feel about this?"},{"comment_id":"564066700424981","commenter_b":"She's a cunt.","commenter_a":"Please, it's time to serve her!","post_message":"It's about time!"}]
