[{"comment_id":"743858605712748","commenter_b":"I know another PENNY ,and she is worth much more that as a friend !","commenter_a":"Good grief!! And people say pennies are worthless.","post_message":"Are they nuts?"},{"comment_id":"10154320609521636","commenter_b":"SohailAnwer wow what an example.. pakistan ha?? Wow","commenter_a":"Islam gives rights to many and that can be seen if we open our eyes. In all Muslim countries that have stable governments, even minorities enjoy their rights. Look at Pakistan, its having a Santa Themed train that is traveling nationwide for Christmas. How many western governments give so much to their minorities?","post_message":"Fantastic"},{"comment_id":"516585565198690","commenter_b":"Leave America, why are you here? Go back where you belong, we don't want you.","commenter_a":"Ship them all back to the hell hole they came from. We don't need or want them.","post_message":"This state just voted to ban Islamic laws… Good.  We won't stand for Shariah in America and neither should you.  Do you support banning Islamic laws in all 50 states?"},{"comment_id":"697111387146106","commenter_b":"Go get them","commenter_a":"Unleash the Donald","post_message":"Donald Trump says he would bomb the sh*t out of ISIS during speech.  You have to watch this. He is absolutely right.  Do you support Donald Trump?"},{"comment_id":"10154099189924071","commenter_b":"Killary is an Embarrassment ,she evidently has no idea how to run an office Legally or with Class. What she poured into this election was ill gotten money. She sure didn't use her own. I Honestly feel her major Dissapointment is her self absorbed issues that would have only added more money to the Clintons Fraudulent Foundation . Being a Great Nation is now much more attainable without corrupt Killary and the rest of her lackeys.","commenter_a":"Wow. So much hate on these posts. I hear a lot of people upset about the protests going after she lost but it seems like there are just as many sore winners out there. Whether you like her or not, people need to learn some respect. I guarantee 99.9% of the people on here haven't the foggiest idea what it takes to hold a high ranking position in our government or run for president. She poured a lot of time and effort into her campaign and to still come up short must be a major disappointment. I'm sure a lot of people have done less and been more hurt by their own failures. I thought this was a country of conscience and good will. This election has proved we are much further from being a great nation than we claim.","post_message":"“I know that over the past week a lot of people have asked themselves if America is the country we thought it was.'"},{"comment_id":"731521210341165","commenter_b":"You mean the Wars the Bush started and Obama ended? Also James now that you've mentioned hospitals, in Syria we as a country have never bombed a hospital, it was Russian and Syrian Regime bombs that caused those explosions. Banning or restricting the immigration from certain countries has been happening for as long as the United States had borders. But this is the first time we have banned people of a certain religion from entering the country. Even though these Muslim men, women and children are suffering just as much as their next door neighbors who are Christian or Jewish.","commenter_a":"Where were these people when Obama was bombing the countries the refugees are fleeing from?","post_message":"Americans across the country protested against Trump's travel ban."},{"comment_id":"1724899471110412","commenter_b":"And what did she sound like a complete or just partial idiot","commenter_a":"Scared Bitch? Sure sounds like you are!!","post_message":"If Democrats REALLY believed Trump's speech was ineffective, they'd want him to give MORE speeches like that, not fewer."}]
