[{"comment_id":"455564827957330","commenter_b":"So then maybe, when girls get pregnant and don't want to keep it, @username, you will take them?","commenter_a":"I wish it wasn't legal. There is nothing whatsoever \"OK\" about killing an unborn baby and justifying it as \"a woman's choice\". Women's rights and women's health issues have nothing to do with killing a baby. Albeit legal, it's a complete disgrace. But you're right - no tax monies should support it!","post_message":"Abortion is legal, but taxpayers shouldn’t have to pay for it. @webpagelink"},{"comment_id":"472553692939711","commenter_b":"No.. She's Stupid.","commenter_a":"There is no way she is that stupid... I don't believe anyone can be that stupid! Her motive is to make ISIS sound misunderstood, to make you hesitate, and allow ISIS to grow. She is like Obama, is helping their brothers is arms, ISIS.","post_message":"I honestly don't even know where to start with this. It is absurd beyond belief."},{"comment_id":"10153619643270329","commenter_b":"Jordan Selph","commenter_a":"Jackie Hollander","post_message":"Bastille Day, As Told By Sloths"},{"comment_id":"955398181243627","commenter_b":"And we will ship them out idiots","commenter_a":"BIGGEST WANKER MUSLIM OF ALL TIME","post_message":"This is only the beginning..."},{"comment_id":"10153393648949228","commenter_b":"Actually, it's not normal for any woman to expose herself in public... feeding or not. It's quite self-centered.","commenter_a":"We all have to have something to complain about. It's like the news gives us one good story and the rest has to be bad. Give it a rest people. It's a normal mother instinct. LEAVE IT ALONE","post_message":"\"The mall told me it's perfectly fine, perfectly legal to breast-feed."},{"comment_id":"923763564345713","commenter_b":"Blacks don't have a race card too play too our advantage only white ppl. Have a race its called white privilege. We have no damn race card nor ace card too use too our advantage since our culture controls nothing.whites have the race card too play since they control the system.","commenter_a":"Where are those white commenters now. Aren't these people \"race baiting\" or pulling the race card I dont hear their clown asses now! When its things like this they have nothing to say Because they are sitting back applauding this. They are the racist!","post_message":"This is happening. Residents of a predominantly black suburb in Detroit are up in arms after discovering racist political flyers sprinkled on their lawns that depict a cop in Ku Klux Klan gear pointing a gun at a black child. The flyers urge residents to “get the blacks out” and vote for white candidates, including mayoral contender Kenson Siver. MORE ---> @webpagelink"},{"comment_id":"1583439795280427","commenter_b":"Disgusting, stupid woman.","commenter_a":"This woman and Palin and others like her are enemies of the state in my opinion! Shame on them for spewing their damage.","post_message":"WOW."}]
