[{"comment_id":"1819541594934723","commenter_b":"Why caught, why is that bitch alive.","commenter_a":"Oh well","post_message":"At least they got the scum bag! @webpagelink"},{"comment_id":"10155073600242235","commenter_b":"Quit covering the bitch. Your continued coverage is not news, it is for personal gain. How long can one beat a dog?","commenter_a":"NO THANKS!","post_message":"There's only one reason why she wouldn't be reprimanded..."},{"comment_id":"1014897985199658","commenter_b":"A FUCKING MEN!!!","commenter_a":"#ALLLIVESMATTER","post_message":"A new low. #BlackLivesMatter"},{"comment_id":"696169153898296","commenter_b":"@username, a new time of patients unable to afford treatment are being kicked out of hospital , letting them stay in the parking lot. Or putting them in a cab, just stranding them anywhere! Has happened many times.","commenter_a":"I had hoped that they would at least do the right thing and replace before they left millions without coverage....plus I read that it's going to cost a huge amount of $$$ to dismantle the Affordable Care Act....I want to know where this is being fiscally responsible????","post_message":"Awful!"},{"comment_id":"1504784736221446","commenter_b":"U sound like a bitch","commenter_a":"And the award for the most useless attempt at contribution to society goes to.... The author of this article. Wonder if that student debt you got from studying journalism at university was worth it. Merry Christmas","post_message":"As you can imagine, it did not go well."},{"comment_id":"10154492827869497","commenter_b":"Who can believe this story?? After all the woman ?????","commenter_a":"hahaha","post_message":"Highlights Of President Bill Clinton's 2016 DNC Speech"},{"comment_id":"1107644279295319","commenter_b":"I don't agree and what she did is wrong. But Trump can suggesting banning all Muslims from the USA and get away with it?","commenter_a":"Strange but when these muslims say and do the same things..Nothing happens....WHY...","post_message":"The devout Christian has been ordered to do community service"}]
