[{"comment_id":"10152788051453445","commenter_b":"Aussie bastard cannibas its called! Sydney university are offering $10,000 if any1 can find another plant!!","commenter_a":"'@username Steven Bains","post_message":"WHAT?!? A new strain of #marijuana has been discovered!"},{"comment_id":"660818097425993","commenter_b":"She needs to get Raped to change her opinion. stupid bitch.","commenter_a":"She is a disgusting, lying hag! If she can lie to children, she's a special kind of 'she-demon!'","post_message":"This is just disgraceful."},{"comment_id":"10154240769776438","commenter_b":"'@username No. You're being dishonest. The 'second amendment solution' is to use the guns to kill people, and he was talking about his followers killing Secretary Clinton, and he was talking about his followers killing the judges she will appoint as President. You can try to say that he didn't actually think they would follow his advice, but you can't say that isn't what the words mean.","commenter_a":"Hmm I wonder if he's talking about the NRA? Taking things out of context, as usual","post_message":"'Nothing you can do folk—although, the Second Amendment people, maybe there is, I don't know.”"},{"comment_id":"1034762863247926","commenter_b":"She is a super predator","commenter_a":"'@username is a strong leader, she is qualified, she is experienced, she is compassionate, has a lot of accomplishments, has been fighting for the equality and human rights her entire career, UNDERSTANDS foreign policy and the EFFECT and OUTCOME of her message domestically and abroad! #IAmWithHillary","post_message":"This country belongs to all of us, not just those at the top—not just the people who look one way, worship one way, or even think one way."},{"comment_id":"908022272624161","commenter_b":"How dare they,women please make your votes count!","commenter_a":"I don't understand how any woman can be a republican!","post_message":"Another day, another Republican attack on women. Shame on them.  Read more here: @webpagelink  Image by Occupy Democrats, LIKE out page for more!"},{"comment_id":"1563692830591111","commenter_b":"'@username We don't need to build a wall... we need to make all employers use E2Verify, get our Congress to quit allowing corporations to import H1b and H2b workers... Then move military bases from sanctuary cities and put them along the border...use the open spaces for war practice and bombing ranges to collapse the tunnels.","commenter_a":"Trump wants to build a wall on the border and make Mexico pay for it, deport illegals, cut taxes on the middle class and corporations, destroy Isis, take care of our veterans, strengthen our military, build the keystone pipeline, repeal Common Core, repeal Obamacare and replace it with a market based system, stop SS and welfare fraud, fight Mexico and China unfair trade and currency practices, preserve the sanctity of the unborn life, preserve the sanctity of the 2nd amendment ... that's conservatism ... that's patriotism ... that's what it will take to bring America back to greatness","post_message":"We cannot pretend the problem does does not exist. We need to build the wall- in order to make America safe now-- and for future generations!"},{"comment_id":"605402049616235","commenter_b":"'@username AMEN! She's just a stupid troll!!!","commenter_a":"He was probably drunk while being on the snowmobile. It will take more than duct tape to shut his wife's mouth.","post_message":"'Knowing Todd, once he's cognizant, he'll probably ask docs to duct tape him up and he'll call it good. He's tough,' Sarah Palin said."}]
