[{"comment_id":"1358800054143336","commenter_b":"Are you for real???","commenter_a":"Yes @username, they are so utterly disgusting!! But remember, \"when they go low, we go high!'\". And they're just pissed knowing that Every penny Donald J. Trump has had or will ever have, can't buy him the class, dignity, and humanity of Barack Obama. #FarewellObama","post_message":"But wait -- where was Sasha?"},{"comment_id":"10154138002220671","commenter_b":"If they dont catch her already","commenter_a":"#NewAge","post_message":"Police pursuing possible homicide suspect in Southern California"},{"comment_id":"10150772965449999","commenter_b":"She's going to wear the same shoes every day forever? What if her feet keep changing?","commenter_a":"If you paid $1000 for shoes you will have the rest of your life, you got a bargain. If you hadn't you would have spent more on shoes that didn't fit, hurt, were too high, and you wouldn't wear them. Not extravagant at all; I would say it was smart shopping.","post_message":"\"I know I am going to take a lot of heat for what I am about to tell you, but I just spent almost $1,000 for a pair of custom shoes.\""},{"comment_id":"10154460389668445","commenter_b":"If this were on a normal sized girl, those panties would be muffin top city.","commenter_a":"What happened to the girl in the black suit her waist is half missing. Photoshop fail. Hahaha","post_message":"#Getstoned, caption this photo and tag two friends. These tees and more on sale shop.hightimes.com/collections/sale-items"},{"comment_id":"493286290862389","commenter_b":"Now if we could just get her to STAY in Africa. ..and her little pea brained spouse. .","commenter_a":"I believe Hillary and Bill did something similar before they left office, milked the system for all they could and stole hundreds of thousands of dollars worth of White House furniture and art work.","post_message":"First lady Michelle Obama's family trip to Africa, Spain and Morocco to promote her \"Let Girls Learn\" initiative, and cut a CNN documentary on the effort, has already crossed the $1 million mark with many more expenses still to be tabulated. According to the bills that have already come in, Obama, accompanied by an entourage that includes her mom and daughters, has spent about $1.06 million: $512,737 for hotels and $252,471 for limos and transportation. - via Washington Examiner"},{"comment_id":"10155189089842439","commenter_b":"Please believe...that they are AT WAR with the rest of the non-islamic planet!!! The rest of the world will have to join together and obliterate them!!","commenter_a":"Why this evil group, can still perpetuate these senseless brutal killings of people, is difficult to fathom! This is one legacy!, Obama will be remembered for!....under him, the killings of human beings in the middle east became a sport! Obama, thank you very much!","post_message":"ISIS has released a new video showing a brutal execution of an Iraqi man. ISIS drowned the man in liquid detergent."},{"comment_id":"10154729754221729","commenter_b":"She's a cunt.","commenter_a":"It does matter what you call it Killary , our young people in the United States were once again attacked .","post_message":"Whoa. About damn time."}]
