[{"comment_id":"10154215455576770","commenter_b":"Lock her up","commenter_a":"As a retired military wife she Makes me sick!!! Like she ever cared about America!! She cares only for herself and if you support her I feel sorry for you!!!","post_message":"Hillary Clinton responded within minutes."},{"comment_id":"957019640987493","commenter_b":"It's normally women who wear high heels that shame women who don't if we are going to be honest. As a woman you can't get into many clubs if you're not in heels.","commenter_a":"On the other hand, I don't think it's right to \"shame\" women who likes to wear heels either.","post_message":"Looks like somebody learned his lesson."},{"comment_id":"10152692514188299","commenter_b":"All this talk...............start calling your congressmen, bombard them with calls until they DO something....................","commenter_a":"What the hell is wrong with this guy? Most Americans are against this.","post_message":"Five More Terrorists Transferred Out of Gitmo … @webpagelink"},{"comment_id":"10153721851426178","commenter_b":"People are waking up. They don't need TV or papers anymore,until the net is more strangulation than it is now, serious voters make up their own minds and look at all sides of issues important to them. They are no candidates that one can agree 100% with but at least there are many out there there one can reconcile most of their views with and throw support that way.","commenter_a":"I have no use for the networks...","post_message":"Despite being the biggest story in the pro-life movement since Roe v. Wade, the networks couldn't care less."},{"comment_id":"10152958959170927","commenter_b":"she can give up citizenship which is just fine with me, at least in this country she can say this stupid remark, want to try to do so say in Hungry","commenter_a":"Leave","post_message":""},{"comment_id":"10153847766591336","commenter_b":"That's Air Craft Carriers in english.","commenter_a":"So let's tell everybody what our Navy is doing!! Stupid media.","post_message":"On Monday, the aircraft carrier USS Harry S. Truman departed Naval Station Norfolk to head to the Middle East to combat ISIS. (Credit: U.S. Navy)"},{"comment_id":"1389565734436504","commenter_b":"Wow this kind of women u dot want mess with super power","commenter_a":"OMG!!!! I am bereft for words!","post_message":"He started to beat her, so she squeezed his testicles in response"}]
