[{"comment_id":"10153430683108812","commenter_b":"@username Bryant Carchi","commenter_a":"Clarette Gaviola COLOMBIA!!! :)","post_message":"WATCH: Dramatic moments as members of Colombia's national police run along the rushing Liboriana River near Salgar after this dog fell in the river: @webpagelink A landslide May 18 devastated the area, killing at least 83 people -- (click video for audio)"},{"comment_id":"10153431961096130","commenter_b":"Look what she made him do!","commenter_a":"I was NEVER a fan of Johnny Fraud!","post_message":"Johnny told police that his girlfriend was both “a little mad” at him and “a little bit intoxicated.”"},{"comment_id":"10153019604880399","commenter_b":"Yes we do!","commenter_a":"We NEED to get rid of THE TYRANTS","post_message":"Dr. Ben Carson wants a country that \"puts our Constitution on the top shelf — and for those who have any doubt, that includes the Second Amendment.\""},{"comment_id":"10156788909185354","commenter_b":"She's a dick!","commenter_a":"A good start. Now take back the universities, colleges and America from these thugs!","post_message":"BOOM."},{"comment_id":"1250106475030208","commenter_b":"There actually is a move to get women to sign up for the draft right now (though it won't matter because there will likely never be another draft) But you wouldn know about that because the draft is one of the only things meninists have to bitch about. But","commenter_a":"Why arent feminists fight for equal representation in sanitation? Or equal representation is crab fishing? Or equal representation in the draft. Women should sign up for the draft #genderequality","post_message":"\"But in order to help, those of us who do understand have to know what women are up against.\""},{"comment_id":"10153321750847439","commenter_b":"LMAO love it! She is a low life who feeds on hatred","commenter_a":"It takes a lot for an atheist such as myself to be bothered enough to come on this page and attack a low life like Geller who has zero intelligence and is followed by a bunch of losers who are the love children of their mothers and uncles, but hey, we all gotta do what we gotta do.","post_message":"Amazing heroes providing security for free speech conference #motoons #AFDI"},{"comment_id":"1591380840922039","commenter_b":"Legal Mexicans will stay,illegals will get deported..as it should be!!!","commenter_a":"Mexicans broke the fence at the border to come here illeagally, breaking the American immigration laws, so they should pay for the new repaired version (aka the wall) Copy & paste and share this comment if you agree, that way we can support Trump by making him look good.","post_message":"Wow, Mexico sounds like they're literally in the Apprentice boardroom with @Donald J. Trump pleading for him not to fire them. THIS is what it looks like when you've got a president who refuses to back down. It's a new day for America!"}]
