[{"comment_id":"10153587762999087","commenter_b":"She's above the law.","commenter_a":"Bloody Hell , Hillar-ious Hellary should have been an evil stand up comedian..","post_message":"Hillary Clinton on dropping out of the race if indicted: \"Oh for goodness, that is not going to happen. I'm not even answering that question.\" #DemDebate"},{"comment_id":"219022051835576","commenter_b":"Legal Immigration isn't a Problem! Melania Trump is a legal Immigrant!","commenter_a":"YES","post_message":"Senator Tom Cotton just introduced Trump's immigration proposal through the Senate! Sign the petition SUPPORTING the bill HERE: @webpagelink"},{"comment_id":"1113965658660810","commenter_b":"Arrest them sum bitches","commenter_a":"I don't know who wrote this, but it is fantastic! This is WHY Trump has such a following. Many have asked me if I support the republican party? Here is a letter someone sent to the RNC. You be the judge. Dear Representative, From the time I was able to vote I voted republican. I am 80 and have a great deal of respect and influence with hundreds of senior ball players who also network with thousands of others around the country. I received your questionnaire and request for money and strongly agree with every question as I have since Obama was elected. Unfortunately the one question that was missing is “What has the republicans done for the American people?” We gave you a majority in the house and senate and you never listened to us. Now you want our money. You should be more concerned about our votes not ...","post_message":"About 20 protesters were arrested on Thursday night outside a Donald Trump rally in southern California, where the Republican presidential front-runner was vowing to get tough on illegal immigration. Will this hurt Trump's campaign?"},{"comment_id":"455564827957330","commenter_b":"So then maybe, when girls get pregnant and don't want to keep it, @username, you will take them?","commenter_a":"I wish it wasn't legal. There is nothing whatsoever \"OK\" about killing an unborn baby and justifying it as \"a woman's choice\". Women's rights and women's health issues have nothing to do with killing a baby. Albeit legal, it's a complete disgrace. But you're right - no tax monies should support it!","post_message":"Abortion is legal, but taxpayers shouldn’t have to pay for it. @webpagelink"},{"comment_id":"853169931483995","commenter_b":"The article isnt dissing Melania, it's reflecting on a direct quote where Trump said giving Ivanna control of a business property was the end of his marriage, and he learned he didn't want a wife who was ambitious, who worked, because that meant she didn't focus 100% on him. Which is sexist af. But he wants his daughter to be an Ivanna, so ... also hypocritical. Should women be successful in business or not, according to Trump? Are successful woman attractive to men like Trump. Read the article, it's not made up.","commenter_a":"Such an interesting article Christine Johnson!!! I find it all fascinating, will be so interesting to be around in Nov - when the country decides! Hope to see u tomorrow? Ax","post_message":"The Trump family embodies a very old sexist hypocrisy: men who want one thing for their wives and another for their children. Read in The New York Times Opinion Section."},{"comment_id":"1263330063738211","commenter_b":"WE ARE STRONGER TO-GET-HER AWAY FROM POTUS! #NeverHillary #DrainTheSwamp","commenter_a":"Seeing you, Obama, your husband and the rest of the democrat crooks, liars and thieves in prison for life or the hanging post!!!!!","post_message":""},{"comment_id":"10155218538748690","commenter_b":"Hahahaha hahahaha hahahaha hahahaha UAE seeks to kick out all Pakistani expatriates and destroy CPEC by 2018 but inshallah we Pakistani will not succeed them in thier nefarious purposes. No voice for Manmyar, Kashmir, Palistine, Syria, Iraq, Libya, Afghanistan, and Chachniya etc. Make your own home first then think about mars.","commenter_a":"He who controls the Spice controls the universe!","post_message":"\"The landing of people on other planets has been a longtime dream for humans. Our aim is that the UAE will spearhead international efforts to make this dream a reality.\" @webpagelink"}]
