[{"comment_id":"10156577141610603","commenter_b":"Now we have another whack job in Washington today. Something is in the air, like desperation.","commenter_a":"According to public records, Ford has an extensive criminal history, including charges for burglary, fleeing police officers, grand theft and an unspecified felony. Most of the incidents occurred in Broward County, Fla., and date back to 1996. His girlfriend said: He is an alcoholic, violent, depressed. It’s my belief he is in desperate need of medical & psychological help!”","post_message":"Cedric Ford was at work when he was given a 'protection from abuse' order roughly 90 minutes before he went on Thursday's deadly shooting spree, according to police."},{"comment_id":"1823139327950230","commenter_b":"As long as these people want to be citizens. No illegals allowed. Why are we babysitting other countries people?","commenter_a":"IMPEACH TRUMP Call and write your representative @webpagelink/ talking points 1 wants to lift sanctions on Russia so Tillerson and Exxon can drill big conflict of interest maybe even treason 2 where are his tax returns 2 unconstitutional act re immigration, the 3 Muslim countries NOT banned are those where he has business dealings conflict of interest 4 every president has had a White House medical exam, not Trump is he mentally ill 5 we can't wait for Painter and Eisen (Bush and Clinton ethics lawyers) law suit for disclosure Find Your Representative · House.gov Not sure of your congressional district or who your member is? This service will assist you by matching your ZIP code to your congressional district, with links to your member's website and contact page. HOUSE.GOV Find Your Representative · House.gov Not sure of your congressional district or who your member is? This service will assist ...","post_message":"Americans are making it clear: Trump's unconstitutional Muslim ban isn't going to fly.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153926157556337","commenter_b":"Ronda is the only person to go and ask patricks wife for permission to do the role and movie.","commenter_a":"Companies are trying to cash in on Patrick Swayze's death.. Since his Death they've remade Red Dawn Point Break And now they are remaking Dirty Dancing. I'm sure a Road House remake will be coming soon..","post_message":"SHOULD YOU SEE the Point Break remake?  Only if you like to have fun..."},{"comment_id":"10153293008086350","commenter_b":"Ugh totally agree! I would love a competent and brilliant female to become president! Just not Hillary..","commenter_a":"We need a woman president..just not Hilly! My opinion!","post_message":"'I think women can do anything and be anything, but the president, I feel, is for a man...That does not mean we cannot be successful  run businesses, be doctors, be lawyers  I was only speaking of one specific position...and again, it's just my opinion.'"},{"comment_id":"10152713060892623","commenter_b":"Those disgusting guys would not have made it off the beach if I was there. I know I'm just a women but I would hv done everything I could to hurt them","commenter_a":"I don't understand why they did nothing? ! I think I would have screamed, throw things at them, run for help, SOMETHING!","post_message":"'There’s hundreds, hundreds of people standing there. Watching, looking, seeing, hearing what’s going on.'  Police say spring break in Panama City Beach will change big-time after video of an alleged gang rape went viral:"},{"comment_id":"1717265371820481","commenter_b":"Calling for a border restored and a return to LEGAL immigration IS NOT RACIST. We will not give our country to you - but you may join our country if you ask! VOTE TRUMP!","commenter_a":"Go trump","post_message":"BREAKING: Anti-Trump protesters rally at Columbus Circle and are heading to Trump Tower. Are you there? @webpagelink"},{"comment_id":"10154200313034411","commenter_b":"'@username do explain which nation was exterminated, and you're a unwelcome imigrant in south africa, you will also get what you sow, dickhead","commenter_a":"England never apologized for any war crimes during Imperialism era ...bcoz they are too fucking arrogant and Egoistic goons !!!","post_message":"During the Second World War, Ireland remained neutral and successive Irish governments were openly belligerent to British interests (Op-Edge by Bryan MacDonald)"}]
