[{"comment_id":"898217656867757","commenter_b":"That dress >>>>>","commenter_a":"She looks absolutely stunning~","post_message":"And finally Miss Viola Davis! #HTGAWM #Oscars"},{"comment_id":"10154517298243132","commenter_b":"@username It has already been released that the arresting officer was a open lesbian in a relationship. Also that according to court documents, that her ex was terrified of Amber after the \"assault\" took place and that there was property that belonged to the ex that was damaged. Funny how records show one thing and now the ex is stating something different.","commenter_a":"Why isn't @username publishing the story Daily Mail and TMZ did about Amber Heard's domestic violence charge from her ex \"wife\". She obviously has a violent past and I'm not say that \"if\" she was abused that what happened to her was justified. The fact maybe they had a volatile relationship. She could have also beat on him as well as he her, again abuse is abuse. But for all the victims out there, if she is lying for the money that's basically a slap to the face for those who were actually abused.","post_message":"iO Wright says Amber Heard suffered at the hands of Johnny Depp."},{"comment_id":"10154082657224497","commenter_b":"The Hillary machine has infected ClickHole too? Thanks a lot, Obama!","commenter_a":"Only 7?","post_message":"Via ClickHole:"},{"comment_id":"10155455804716729","commenter_b":"Not to mention the innocent lives that will be saved.","commenter_a":"I don't care who pays for it, just build it. Ultimately it will pay for itself","post_message":"Ain't that something?"},{"comment_id":"1692899604103495","commenter_b":"She is a skank","commenter_a":"Chelsea Clinton is the poster child for white privilege.","post_message":"She CANNOT be serious."},{"comment_id":"1064358433623633","commenter_b":"TRUMP GO back TO Hell","commenter_a":"Can these idiots be any more reprehensible?! The Repugs care only about the top 1%.","post_message":"The right's hostility toward the working poor is now front and center."},{"comment_id":"10153137248455329","commenter_b":"Marc Benedict Meine Lieblingsgeburtstags-Torte :)","commenter_a":"Niall Cooke your birthday cake sorted.... :-)","post_message":"The only kind of birthday cake worth having  via @webpagelink"}]
