[{"comment_id":"1181257421894286","commenter_b":"Lmao. Wouldn't that be frowned upon?/ wouldn't we be illegal immigrants?","commenter_a":"#getyourasstomars","post_message":"Aldrin wants us on Mars by 2040."},{"comment_id":"1028264733936445","commenter_b":"It's it funny how liberals say they can get guns from other place but amazing thing is that these people can't make it down to get a ID to vote. Guns we can get cross states lines a ID nope can't do it.","commenter_a":"Cant be. They have banned guns in Chicago. Every one of those murders had guns? Doubt it, cuz guns are Illegal. Hey murderers, stop breaking gun laws and start stabbing people the legal way! #Sarcasm","post_message":"2,326 people were shot in Chicago in 2015."},{"comment_id":"824468191027094","commenter_b":"she's so ignorant. Bet she doesn't even know where her clit is","commenter_a":"I Am probably going to make a lot of women mad over this. And yes. I happily voted Trump! My personal beliefs is that our home, church, and country should be the concerns of a MAN. Yes. There are not as many MEN around as there used to be. But my beliefs are that a woman is to further see that the teachings of the man, the guidance of the man, the protections of the man are done. And done correctly. I was very impressed with her work! She done exactly as she should! A very strong willed educated intelligent woman! He obviously has a lot of faith in her! Smart doing so also! Yet as we are saying, those on the left won't say a bit of praise to her. Smh","post_message":""},{"comment_id":"10153074240773067","commenter_b":"Lol no, A stockholder though, and everything that i put on here were statements from Ford in response to Donald Trump.. Just summarized","commenter_a":"Trump had nothing to do with this. This was because Ford, and the UAW were able to work an agreement, Ford is committed to keeping and creating jobs in the U.S. They have created 25,000 new jobs in the U.S. In the past four years. Over 80% of their manufacturing is done in the U.S. And 97% of their engineering is in the U.S. As they stated. No i dont like seeing jobs being outsourced, but Trumps statement had no effect on the outcome of this. Im happy for all the people who kept their jobs. Ford is a great company! And will do what they can to keep bringing new jobs to the U.S.","post_message":"This comes after Ford Motor Company came under fire for creating thousands of jobs in Mexico. @webpagelink"},{"comment_id":"987118551371296","commenter_b":"These women did it LEGALLY.","commenter_a":"There's a difference between illegal immigrants and legal immigrants.","post_message":"Trump's ex-wife agrees with his immigration policies... even though she's an immigrant."},{"comment_id":"952645251457544","commenter_b":"I would kick they asses!!!","commenter_a":"Somebody goin down tuh-dey d'ere boy! This is a sign that everybody is not equipped to run a daycare. Idiots!!!","post_message":"Cornelius Jones went to pick up his one-year-old daughter, Journee, from daycare... only to find the facility closed. After hearing his daughter’s cries, he flagged down police who found the young one crying & crawling in the dark.   Employees said they thought Journee was a doll. DETAILS ----> @webpagelink"},{"comment_id":"10153394561766336","commenter_b":"Only one I see judging is you","commenter_a":"Her Christian mother must be so proud. This is why you don't preach and judge. Once you put yourself out there, you are now the target to being judged.","post_message":"Bristol Palin, daughter of 2008 GOP VP candidate Sarah Palin, has announced on her blog that she is pregnant with her second child.  “I know this has been, and will be, a huge disappointment to my family, to my close friends, and to many of you,” Palin said. @webpagelink"}]
