[{"comment_id":"10153006205351051","commenter_b":"I would have shot him.","commenter_a":"I am glad he did what he did. This is what you do instead of standing around recording.","post_message":"This dad was driving his daughter to school when he saw a police officer on the ground with a guy on top of her. The guy was reaching for her gun. The dad didn't hesitate."},{"comment_id":"998307626859113","commenter_b":"Sorry pussy","commenter_a":"Not Donald we like Donald we don't like pushy billionaires","post_message":"A billionaire Saudi Prince makes an offensive demand of Trump, then Trump FIRED BACK!!"},{"comment_id":"10153445603501051","commenter_b":"If I was the Dad I would be the one in jail...I would had killed that bitch over and over again","commenter_a":"Sorry if I was dad he wouldn't be in Jail he would be in the ground dead!","post_message":"When the boy's 11-year-old sister saw what was happening, she threw herself at the attacker and screamed for her father. But at that point it was too late."},{"comment_id":"891291447630577","commenter_b":"Turn the channel from Fox and get educated","commenter_a":"How anyone can back him after everything going on is beyond ignorant!!!! There r reasons he's the worst president ever!!!","post_message":"This one is HILARIOUS.   Thanks to Being Liberal."},{"comment_id":"10154973344274166","commenter_b":"@username my daddy would never. Then again he's only had one wife and never talked about groping his children.","commenter_a":"They about to get cozy. He is so in lust with her.","post_message":"Here's a look at Pres. Trump and daughter Ivanka as they departed Washington unannounced to honor slain Navy SEAL Chief Petty Officer William \"Ryan\" Owens. Read more: @webpagelink"},{"comment_id":"10153522197479255","commenter_b":"Fuck you, lady.","commenter_a":"This people have been drinking the Kool-Aid!!!","post_message":"Obama is officially the best president the U.S. has had in a long, looong time.  By Daily Kos user PCalith"},{"comment_id":"1450281048346082","commenter_b":"@username why don't you then? Rather than complaining? You are angry because women are doing exactly that for themselves but they aren't doing it for you?","commenter_a":"Machism means feminism...no extreme is good...Breast cancer has 10x more funding and support than prostate cancer (for equal mortality), there are more men incarcerated than women, men spend more time in jail then women for the same sentences...Men also suffer from inequality and starts from birth: life expectancy is lower than females and seems to be genetically driven (extra Chr X seems to provide some protection)","post_message":"Do you know what machista means? The hashtag #EsMachismo started trending, and these 21 tweets explain a lot. - Alicia E. Barrón"}]
