[{"comment_id":"1094512657300125","commenter_b":"@username you know what they say, a slap in the face puts a bitch in her place","commenter_a":"No shit. I don't understand why people have been going nuts that someone was taking their guns away in the first place. That's not the goal. No one's changing 2nd amendment.","post_message":"EVERY American needs to understand this!"},{"comment_id":"1401080203318363","commenter_b":"Well eventually there will come a day of reckoning.","commenter_a":"Notice how these people claim to be Christian meanwhile they do the opposite of what Christians do & they dislike true Christians as much ad they do people of other faiths, they quote the bible to support their homophobia but they don't except & love people who are different, like God says that they should","post_message":"This is absolutely deplorable."},{"comment_id":"10153643322467434","commenter_b":"@username, I am an actress...I can rip you apart in iambic pentameter. Words do matter and so do definitions. In order for RAPE to occur, SEX has to happen...or it is considered MOLESTATION...","commenter_a":"Wow...semantics. Yes, Brock Turner DID have sexual relations...or else he couldn't have RAPED her. Sex is kind of a requirement...the headline does NOT say \"consensual\". #GoodGrief","post_message":"Just because the law smiled upon a man who had sex with an unconscious woman behind a dumpster doesn’t mean this group of angry, armed protesters will do the same."},{"comment_id":"10153460362791336","commenter_b":"Trump has Americans interest for once , not what can Americans do for illegals .","commenter_a":"The Silent Majority is COMING OUT FOR Donald J Trump. The PC ERA IS OVER. THE TRUTH ERA IS HERE. Donald J Trump 21st Century Patriot.","post_message":"\"The silent majority is back, and we’re going to take the country back.\" On Saturday, Republican presidential hopeful Donald J. Trump spoke to thousands of cheering supporters in Arizona."},{"comment_id":"376409252547369","commenter_b":"She is a looser","commenter_a":"THUMBS DOWN!! Pitiful excuse for a human being. Hard-working Americans don't get $112,000 in benefits. THIS IS SO WRONG. Stop the money and see what she does.","post_message":"One more Welfare Moocher..."},{"comment_id":"10153934644331336","commenter_b":"Immoral women?","commenter_a":"I wonder what would happen if sexes were reversed. Point is, the guy will be wrong no matter which side he is on.","post_message":"He pinched her, so she punched him... hard."},{"comment_id":"944616275579231","commenter_b":"I don't see why modesty should be offensive to anyone but I do understand why nudity can be offensive or uncomfortable. I think in a respectful, civilized environment you find compromise. which I think we did for a very long time. Now everyone wants to right to be offensive while retaining the right not to be offended.","commenter_a":"I've never understood why people are offended by nudity. It's just a human body ffs everyone has one!","post_message":"Not sure I'd have the nerve, but it looks kinda freeing. - Maz Ali"}]
