[{"comment_id":"543491929108734","commenter_b":"Good, send her to prison then send her to Isis!","commenter_a":"She should be jailed for life.","post_message":"For weeks, this Muslim woman sat behind her computer spreading hate and threatening the 'infidels'. She thought she was going to get away with it, then she heard a knock at the door."},{"comment_id":"1829686510610987","commenter_b":"Just go away Jill. You are as bad as Crooked Hillary. No one believes you.","commenter_a":"So Sad, wasting more taxpayers hard earned money. I hope Trump puts that piece of shit Hillary in jail. I'll never vote for a Democrat again.","post_message":"FUBAR!"},{"comment_id":"1763050483964389","commenter_b":"@username it's sad that you believe this corrupt liar, she panders to do nothing but destroy American interests. You will have a hard life since you choose to ignore the research that many gave to you on this post. You rather remain blind then actually see the POS that you're defending.","commenter_a":"Here's an idea, everyone who DOESNT like Hillary, don't comment. Go comment on how much you love Donald Trump and how you hate everyone except white people. And how you hate refugees fleeing their countries that are being bombed by USA and how you hate everyone. And if you like Hillary and/or voting for her... Then you comment.","post_message":"Even before his hateful speech this week, Trump has never been vague about his feelings toward immigrants."},{"comment_id":"10156214197580725","commenter_b":"Right!!...She belong in JAIL, PERIOD!! PERIOD!!!!","commenter_a":"You're all ignorant","post_message":"Check out OAN and compare to what you are watching now! #DemDebate"},{"comment_id":"10153066092873445","commenter_b":"I bet the strippers were forced to strip and what not","commenter_a":"Okay... Retracting previous statement, these fucks need to be jailed... Illegal immigrants being forced into prostitution... Nope! Pigs","post_message":"More DEA Scandal!  DEA Agents Arrested for Lying About Owning a Strip Club"},{"comment_id":"1554819554825337","commenter_b":"i dont have to even listen , i can tell by how stupid she looks","commenter_a":"Lunatic left.","post_message":"This is downright shameful."},{"comment_id":"10153980841689062","commenter_b":"Good glad yall didn't. One thing you can't replace is a life/lives. Hopefully everyone understands","commenter_a":"@username did u still go to Houston","post_message":"Hail is coming down with heavy rainfall off Beltway 8 and Antoine as heavy storms begin to move into the area. Stay safe out there!  Radars: @webpagelink Share your pics/videos: photos@khou.com."}]
