[{"comment_id":"1053645448090460","commenter_b":"Jihad Malik ..get off this post ..your mama was stupid for making you","commenter_a":"Why don't you post a story of the anti Semites throwing people off of buildings in the countries surrounding Israel....they are the people you should be fearing and writing about ...The JP has joined the Shrillary camp","post_message":"Schmitz has called the accusations defamatory, but reports of anti-Semitic tendencies at the top of the Trump team reinforce the narrative."},{"comment_id":"424515887751925","commenter_b":"Kick her out if she won't wear the uniform","commenter_a":"Sorry sweetheart, you cannot honestly believe we who are proud of our Marines are going to consider your sensibilities against our men. Grow up.","post_message":"Liberal Chick has really lost it. Marines in uniform are now offensive? This is cuckoo for cocoa puffs."},{"comment_id":"10153264300638433","commenter_b":"Ladies, please, you're both pretty.","commenter_a":"Hillary would say: what difference does it make!!","post_message":"We look at what readers have to say about our fact-checks of Hillary Rodham Clinton. What do you think? @webpagelink"},{"comment_id":"10153366613454712","commenter_b":"She's a joke","commenter_a":"So how is she suppose to be courageous when she hides reports that was commonly issued? She hide knife? How is she courageous? How courageous to point a muder finger at innocent driver","post_message":"Memo to Marilyn Mosby: Baltimore wants transparency, not sealed documents and gag orders."},{"comment_id":"1003201996389936","commenter_b":"Melissa Missael","commenter_a":"Merly Vivanco Albert Perez what a joke Ben Carson is. Lol.","post_message":"This one is for those who ever doubted Trevor Noah's ability to fill Jon Stewart's shoes."},{"comment_id":"970690569690664","commenter_b":"Good luck... Whomever the bitch was that reported my post. Truth hurts don't it troglodyte?","commenter_a":"Am I the only one to realize that all of these mass shootings are done by men?","post_message":"America's easy access to guns almost led to another devastating tragedy..."},{"comment_id":"786188861571691","commenter_b":"That is stupid why can't the welfare people get a job and beside who going to pay for their car insurance and car payment get real","commenter_a":"This is not true.if so think about the timing of it Killary is losing against Donald Trump and she is going to try and bye your votes but we are all to smart for that","post_message":"Congress Approves Bill Offering Free Cars To Welfare Recipients. Your tax dollars hard at work. Does this disgust you?"}]
