[{"comment_id":"927400923975122","commenter_b":"Lol. Kinda harder for a white person to flee the country. Try again. If your illegal then you are ILLEGAL. Their is no right about it.","commenter_a":"For all of you saying if the man who caused this accident was an \"illegal\" or \"undocumented\" man, what if the victims were illegal? Is that going to change how tragic and sad this is? Jeez, you would think the older the wiser but it seems to be the older the dumber and ignorant","post_message":"MCSO: \"ONE OF THE WORST DUI CRASHES WE'VE EVER INVESTIGATED.\" 5 A-M Sunday morning, Sheriff's deputies say 23 year old Cesar Villanueva, driving a white truck, slammed into the back of a Honda waiting at a stoplight in Avondale. The impact virtually destroyed the car. The young man and woman in the Honda were pronounced dead at the scene near Avondale Blvd. & MC 85. Detectives say Villanueva was speeding and was impaired. He is in custody. Details at 5."},{"comment_id":"10153830861505695","commenter_b":"It is much safer at sea then it is to remain in port.","commenter_a":"Praying they're found. Since the owners and the captain of the ship knew the path of the hurricane, why was it allowed to leave the port or at the very least why wasn't it rerouted?","post_message":"Loved ones aren't giving up hope, despite a life ring being found."},{"comment_id":"10153263550734205","commenter_b":"Sure @username","commenter_a":"Not every Muslim is a terrorist, but most terrorist are Muslim. It's science.","post_message":"Man Bullies Muslim At Town Hall"},{"comment_id":"10156149703965294","commenter_b":"I'd take her dang license and make her walk because she is so dang stupid!!","commenter_a":"He was doing his job,she was in the wrong ,51 in a 20 school zone.she should have been arrested.feel sorry for the safety of the kids.","post_message":"At first, she pleads for mercy: \"Can you give me a warning please?.... I have so much frozen food in the car.\" But, when the deputy walks to his car and comes back, her attitude changes completely:"},{"comment_id":"10153140451210950","commenter_b":"He is waiting for Jade Helm. Ha ha ha ha what an idiot.","commenter_a":"@username the \"President\" is not Protestant. You my friend are the dumb ass. He is a Muslim,educated in Jakarta,Indonesia at several Mosques. Born in Kenya and outer by several family members as being a \"Kenyan\" your support of this foreign born usurper of the presidency is ridiculous. Not to mention Pope Francis is evil and lacks the backing of a large number of Catholics. Pull your head out of you're ass and realize that it I simply a meeting of 2 monsters,playing pretend for the media to feed it to idiots lil you. Retard!","post_message":"For the first time ever, President Barack Obama and Pope Francis sit in the Oval Office — together: @webpagelink"},{"comment_id":"1060970767293401","commenter_b":"Diana Serrano those hard headed girls just don't listen!!!","commenter_a":"Hahaha.... Acha hai acha hai","post_message":""},{"comment_id":"10153914495466491","commenter_b":"How is a white woman being racist unbelievable?","commenter_a":"Unbelievable that people would accuse Ellen being a racist","post_message":"Ellen DeGeneres took to social media to respond to the backlash."}]
