[{"comment_id":"10154760040172293","commenter_b":"Shes an indenity thief. I think Alyssa was referring to actual criminals","commenter_a":"Hopefully every single one who has blatantly broken Federal laws and made a joke of our Justice system. They are all criminals by definition. Round them all up and return them to their homes in Mexico and Central America.","post_message":"This scenario is one that President Trump opponents imagined becoming far more common were he elected."},{"comment_id":"768694459925723","commenter_b":"With alll the evil this Bitch has done. She should be disqualified from living!","commenter_a":"Since Hillary is under investigation she should be disqualified to run for President .","post_message":"Can America survive more of the same?"},{"comment_id":"495256197331627","commenter_b":"She can't ban nothing she is just a picture hanging on the wall so tell her to stay out of Americans business","commenter_a":"So sad","post_message":"What Michelle Obama is banning now is just plain unacceptable.  The American people are tired and finally fighting back.  Do you agree Michelle Obama should mind her own business?"},{"comment_id":"1222382617796158","commenter_b":"Idiot please don't reproduce","commenter_a":"End of the circus... was a main attraction.... They do away with the side shows...then the tent... now the elephants.... Why would one even want to attend.... another bit of America down the toilet...","post_message":"Elephants performed for the last time in the Ringling Bros. and Barnum & Bailey Circus on Sunday, putting an end to the controversial practice. The animals will live at the 200-acre Ringling Bros. and Barnum & Bailey Center for Elephant Conservation in Florida."},{"comment_id":"685699241620654","commenter_b":"How can 'she' be a woman with male genitalia!","commenter_a":"I believe that by giving Jenner this award merely shows base ignorance. Women should not be offended, but rather look at the monster joke. A man that has not completed his surgery is woman of the year. What a joke. Gentleman the majority of us would never want to be a man. We are happy with ourselves. I feel sorry for this mockery of a woman and an insult to men in general.","post_message":"Female Marine goes off on Bruce Jenner for winning 'Woman Of The Year' Award. She's right. This is getting so ridiculous its not even funny. Can we get 75,000 'LIKES' for this female Marine?"},{"comment_id":"10152987583472014","commenter_b":"If you don't want the responsibility of a baby, get yourself fixed or some type of contraceptive","commenter_a":"Punch her in the face","post_message":"A teen mother says she didn't know she was pregnant before delivering a baby girl, but court documents detail chilling details of her searching the Internet for ways to induce a miscarriage while 38 weeks pregnant."},{"comment_id":"884938878291056","commenter_b":"I'll fuck her up","commenter_a":"'@username let matce do this she won't ever have that boy again!!!!!! I'll do everything in my power to get him from her","post_message":"Woman Checks A Mother Abusing Her Autistic Son At A Wafflehouse!"}]
