[{"comment_id":"10152817661912623","commenter_b":"like I say the only good snake is a DEAD ONE, since they ate my baby turkeys-I HATE THEM MORE","commenter_a":"Time to move. Fr.","post_message":"WATCH: What one North Carolina couple found in their spice cabinet will shock you.   Warning: There is some language in the video."},{"comment_id":"591748790988611","commenter_b":"She is such a lying two-faced b**** and anybody that believes anything that she says is a moron! That woman has more money and more houses and more luxury than anyone. Everytime she opens her mouth she's lying","commenter_a":"Pot calling the kettle? Except for Trump never having killed anyone","post_message":"Is this hypocritical?  WATCH: Hillary Clinton called out Donald J. Trump for his lavish lifestyle, despite living in luxury herself."},{"comment_id":"10155875894235354","commenter_b":"No one wants to see people in need suffer. But the time has come to stop illegal immigration and deal appropriately with those already here. ENOUGH! Impeach the whole lot of them for putting politics and \"special\" interests before the legitimate interests of the US citizen. COME TOGETHER PEOPLE!!","commenter_a":"dump her now,out of touch with the people,","post_message":"And We Support the Legal U.S. Citizens.   Bring it On, Nancy."},{"comment_id":"10153850035618445","commenter_b":"Your post smells like it was done by a pussy with a badge.baaaacooonn!!","commenter_a":"Text/call us at @username We got good Quality medical marijuana strains for you with optimal potency and of absolute highest quality, I believe that marijuana is a good medicine and should be freely available to everyone regardless of unjust laws. We provide prescriptions for your health issues including: Many more just hit us @username","post_message":"Opponents of Florida's Medical Marijuana Initiative Slam Legalization.   @webpagelink"},{"comment_id":"450075515174329","commenter_b":"Jamal Mercer you realize that Plymouth Rock was landed in 1620 and that formal America wasn't til 1776. So your way off on \"over 500 years\" more like 200 years. And the majority of this country was built by Irish and Chinese labor not black. How come for hundreds of years Irish were slaves, yet Irish people don't use it as a crutch and a complaint of why they can't do something. 6 million Jews killed in the holocaust, that was from 1933-1945 that was roughly 1350 a day for 12 years. Yet Jewish people don't use it as a crutch and a complaint why they can't do something. Neither one of these groups were given nearly as much entitlement as the black community.... Yet the black community still complains that it's not enough that they can't get ahead. And yes most people look at black on black crime and ...","commenter_a":"What pisses me off is people that deflect this issue with Black on Black violence. Like y'all don't know that we just got rights in this country 50 years ago and the subsequent aftermath of white supremacy for over 500 years is the reason we live in impoverished areas with the shittiest schools. Y'all DO know that those circumstances breed violence right? Don't act like White men have not committed the most violent atrocities in this country since it's inception. Don't act like your \"discovery\" of America wasn't simply genocide. Don't act like multiple billion dollar industries that people still reap the benefits of today and in the future weren't built on free labor that black people don't see a penny of. Read sometimes. You will know why the black community has violence. Still to this day the most heinous crimes and serial murders are committed by white men. Sandy ...","post_message":"This story keeps evolving."},{"comment_id":"10153184134613984","commenter_b":"she is a drama queen & idiot.","commenter_a":"What a crock of crap!","post_message":"People are NOT happy about this, and they're calling her out for it big time.  Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"1824366427776560","commenter_b":"Build that wall starting January 20, 2017.","commenter_a":"Build that wall !!!!","post_message":"URGENT: Please vote now.  Do you support building a wall with Mexico?  A new national poll released today says 53% of Americans DO NOT want a wall along our southern border.  The question is, do you?"}]
