[{"comment_id":"10153362565997093","commenter_b":"Chale","commenter_a":"Como estuvo en la manana @username","post_message":"CAUGHT ON CAM ~ Tuesday morning's severe storms blow through a Far North Fort Worth neighborhood... @webpagelink"},{"comment_id":"10156340374100354","commenter_b":"You my dear are a moron who is helping to destroy your people.","commenter_a":"Scumbag.","post_message":"\"Safe negro\"?!  Can you IMAGINE the FIRESTORM liberal media would have generated had a conservative said this?!"},{"comment_id":"1062574083799120","commenter_b":"Yay! Maybe your daughters can grow up to be war criminals! #progress","commenter_a":"I am joyfully and unabashedly with you Hillary! My two little girls are so excited. It means the world to watch them see the new possibilities in the US with you!","post_message":"The New York Times: Hillary offers \"a vision in which middle-class Americans have a real shot at prosperity, women’s rights are enhanced, undocumented immigrants are given a chance at legitimacy, international alliances are nurtured and the country is kept safe.\""},{"comment_id":"10152947380749099","commenter_b":"Yes, because women never get pregnant on birth control....","commenter_a":"If women would practice birth control then these horrible things wouldn't happen. Bless their little souls. May God have them in his embrace.","post_message":"A man found two dead fetuses wrapped in a blanket on the street @webpagelink"},{"comment_id":"10153256753408445","commenter_b":"All I know is I'm gonna smoke so yea u can lick my ass crack","commenter_a":"yea lets kill all those smokin weed dumb fkin pigs lay em all down permanently","post_message":"#NEW - Hundreds of Local Cops Are Requesting Armored Trucks To Fight War on Weed"},{"comment_id":"10153095720526051","commenter_b":"You poor sick woman, you must have never gone to school ever.","commenter_a":"Not saying what he did by any means was right.... But blacks are openly threatening to kill us everyday... The Black panthers said they were going to bomb white nurseries and how they need to rape and kill all white women and children. All this can be looked up. There are numerous hate crimes committed by blacks against whites everyday yet finally a white boy snaps and it's everywhere on fb and everyone wants him publicly hung. Obama is now pushing his gun control bs again over this but why doesn't he do that over the thousands of shootings everyday pointed towards the black on black crimes? Open your eyes people... I think you're all missing the much larger picture here.....","post_message":"Dylann Roof just confessed to the #CharlestonShooting. He says he had just one goal in mind when he opened fire."},{"comment_id":"1027338487301572","commenter_b":"I agree with you , Carol. But, Illinois law forbids us from asking for ID at this point in time.","commenter_a":"Going back many years to JFK's election to the presidency. He won by a very slim margin. Cook county Illinois (Chicago's county) had many votes cast by people who were dead. It is still happening but in many more states. Everybody should have to show a legal picture ID before voting.","post_message":"Voter Fraud is REAL!"}]
