[{"comment_id":"640946546065952","commenter_b":"So support Hillary who takes millions of dollars from countries that practice Sharia law that kill women and kill gays for no reason! Also who's husband is a known sexual abuser and a rapist and she persecuted the sexually abused victims of her husband. Yet Hillary said she supports women's rights, what a joke. Wake up ladies!!! I'm wondering if Hillary hired these people to go there and start riots. Hillary Clinton is a evil corrupt woman who is mentally, physically and morally unfit to be our commander in chief!","commenter_a":"Go Trump.","post_message":"We're LIVE from Trump Tower New York, where the National Organization for Women (NOW) is leading an anti- Donald J. Trump protest."},{"comment_id":"10153528994604641","commenter_b":"What's up with her fingers?!!!","commenter_a":"Karolynn Cevidanes","post_message":"Taiwan puts porn star on metro cards. They sell out."},{"comment_id":"1325251154159559","commenter_b":"A new report by NBC just released today says that Chelsea Manning maybe subjected to permanent solitary confinement charges coming from her recent suicide attempt. Is the Obama administration trying to strong arm Wikileaks? I can't imagine that being a coincidence. We must stand up for Chelsea Manning! Whatever happened to no cruel or unusual punishment?","commenter_a":"AS empty a bunch of words as when Republicans claimed them. Easy to be optimistic when you are rich, less so for the masses.","post_message":"With his last convention speech, the president forced pundits to acknowledge that Democrats are taking back an optimistic worldview, writes Neal Gabler of USC Annenberg Norman Lear Center."},{"comment_id":"10154080042346336","commenter_b":"I care what anyone says obama was a good president.","commenter_a":"Yep, detention without trial , without legal representation ,without charge has no place in America .","post_message":"“We can try [terrorists] and put them in our maximum security prisons and it works just fine.” – President Barack Obama on closing Guantanamo Bay facility @webpagelink"},{"comment_id":"888687604591297","commenter_b":"'@username freedom of speach bitchhhh","commenter_a":"Yo man if you really care about the U.S.A and everyone in it there is something you should do... \\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b$18,152,809,942,589 is our current debt... Donate all your money except a mil to our debt... A mil is a lot more than most of us will ever see... Your money wouldn`t even really touch our debt but still would help... If you really care help us out... It wasn`t the average Joe`s fault... It was the all politician`s fault\\b\\b\\b\\b\\b\\b\\b\\b... Help us out bro and you`ll earn my vote...","post_message":"I've created tens of thousands of jobs and I'm really good at it. As President, I WILL get America back to work! #MakeAmericaWorkAgain"},{"comment_id":"938657176211868","commenter_b":"Who is she ?","commenter_a":"DAN, Dumb A N","post_message":"'While MSNBC may believe that I am worthless, I know better.'"},{"comment_id":"1034829756528494","commenter_b":"Yeah women!!!","commenter_a":"What about the father that wants to keep the baby? He has no rights...","post_message":"A win for choice"}]
