[{"comment_id":"10156665343745725","commenter_b":"Build the Wall!","commenter_a":"Thank you Donald Trump, I know all of this campaigning is a lot of work and tiresome. I sure hope you can find all of the strength and energy you need to keep up with negative stuff, because I know you are fighting for us the people. And we sure want you to go all the way to the Presidency. There has been no one will to fight for common sense and for the normal and real people of the great country. We all just need a chance to do and be great! Thank you again","post_message":"GOOD MORNING SOUTH CAROLINA! Do not forget to get out and vote today! The poll numbers are outstanding. They mean nothing, if we don't ALL get out to the polls & VOTE! Together, we will MAKE AMERICA SAFE & GREAT AGAIN! Thank you!"},{"comment_id":"10154556133417235","commenter_b":"Good bye you old hag","commenter_a":"It could only have happened more quickly. Thank God for small miracles. Goodby. God Bless, where ever \"He\" .Kisses.","post_message":""},{"comment_id":"10152736026831051","commenter_b":"Liberal logic - Ban guns because you can call the police but the Police are Militant racists that can't be trusted so who are we supposed to call again? Ban all guns in the U.S. it will make us safer but keep the borders open so when the black market opens the guns can flow in like water. On an ending note; Police are in no way obligated to protect you from any threat per the Supreme Court so I guess when they do show up they can draw that chalk outline around your fresh corpse.","commenter_a":"Blah blah blah bullshit bullshit bullshit out of all the diehard ammosexual blowhards who love their guns. Europe doesn't have the problems we have in the country with guns. Neither does Canada or Australia. You want to believe what you want to believe. Follow the money. It's the NRA who wants you to keep your guns and fills your head with nonsense that you're just too willing to believe because you have no balls and tiny dicks. Try thinking about things instead of just buying into the rhetoric. The USA is safer now than at any other time in history. Why do you need them? Why focus on fairy tales like imagined revolutions against the government instead of focusing on things that are ACTUALLY happening like kids being killed in schools by LEGALLY OWNED GUNS.","post_message":"A company that worked on ‘Taken 3’ with Liam Neeson didn’t take kindly to his comments about the U.S."},{"comment_id":"1150014791717682","commenter_b":"Can we class-action sue her for discrimination, like the gays do when you won't bake them a cake? And why not? What's the difference?","commenter_a":"Another idiot committing corporate suicide!","post_message":"Maine Restaurant Owner Bans Owners and Supporters of AR-15 From Restaurant"},{"comment_id":"10153404039272293","commenter_b":"@username police kill blacks at a rate disproportionate to their total percentage of the population an assertion supported by The Guardian statistics. Police killed almost five black people per every million black residents of the U.S., compared with about 2 per million for both white and hispanic victims. @webpagelink","commenter_a":"Tamir was a 12 year old boy. TWELVE!!!","post_message":"\"I saw the weapon in his hand coming out of his waistband,\" one officer wrote in his statement. \"The threat to my partner and myself was real and active.\""},{"comment_id":"10154452763505575","commenter_b":"That is bullshit...Rasmussen has Trump ahead of that bitch!","commenter_a":"FOX News just reported that Hillary Clinton leads Trump 48 to 41. Basically, they say Trump has lost 3 more points since the debate. Sorry FOX, but I don't believe your bullshit poll and you can take it and shove it up your #NeverTrump asses.","post_message":"It's Happening! Black Vote SURGES for Trump in last two weeks!"},{"comment_id":"10153254582474877","commenter_b":"I think that was a reply to the poster.","commenter_a":"Atheists are the first ones to cry Jesus as soon as they get hurt!","post_message":"NFL star Arian Foster reveals he's an atheist: 'Faith isn't enough for me.' Read more on his perspective below.   Grio fam, what's your reaction to Foster's remarks? Sound off..."}]
