[{"comment_id":"10156258730695725","commenter_b":"Come to grand junction","commenter_a":"medias are crooks ...liars liars and liars gooooo trump you still got my vote and my whole family","post_message":"After a great evening and packed auditorium in Iowa, I am now in Colorado looking forward to what I am sure will be a very unfair #GOPdebate!"},{"comment_id":"860171507364731","commenter_b":"Wow... really? So sad.. moms please be very careful who u leave ur kids with..","commenter_a":"she looks like she is a... \"few bricks short of a load\"","post_message":"This 18-year-old girl is accused of leaving her little sister in a hot car while her and her friend went shopping for swimsuits. Investigators say the 2-year-old's temperature was already at 100 degrees when she was rescued:"},{"comment_id":"10152793900772452","commenter_b":"Bad women drivers! ;)","commenter_a":"Who the hell runs over a motorcyclist and does not have a clue that they hit someone????! Thank god the other drivers made her stop FINALLY!!!","post_message":"The dramatic rescue of a motorcyclist who had been dragged underneath a truck on the eastbound 91 Freeway was caught on video. abc7.la/1EK2HcY The video was submitted to Eyewitness News by viewer Byron Holeman who used the #ABC7Eyewitness."},{"comment_id":"864266033622421","commenter_b":"Guaranteed Chris Matthews is paid off. GUARANTEE IT!!!!!!","commenter_a":"Oh boy...Jorge","post_message":"Watch the DNC chair squirm when asked about the difference between Democrats and socialists: @webpagelink"},{"comment_id":"900759883386314","commenter_b":"Hillary's supporters don't care that she's a sold-out Wall Street neocon. It's weird.","commenter_a":"She is the ONLY person on earth to know how it felt to take that place in history........glad she was the one who knew how to really cherish it for all of us... thanks Hillary... Girl, you rock!","post_message":"When history's in the making, sleep can wait."},{"comment_id":"1128844340487134","commenter_b":"I believe in planned parenthood, but I believe it starts before you get pregnant, not after. Grab a couple condoms, take the pill or shot. Get your tubes tied. Life starts at the time of conception. Murder is murder, I don't care how old the person is.","commenter_a":"Can Hillary tell us on what date she considered Chelsea a human being?","post_message":"Sadly, true."},{"comment_id":"933475353412186","commenter_b":"Somebody needs to fuck her ass up","commenter_a":"Elisabeth Hasselbeck is a no talent bimbo. She is a racist a bigot and just an unpleasant pain is n the ... Neck! Her claim to fame is that she was on Survivor and clung to an older gentleman who did everything for her and protected her. How is she qualified to open her ignorant mouth about anything political??? Typical Fox bleached blonde snotty witch! Yuck! She was fired from The View because she was so nasty and bigoted.","post_message":"This is superbly offensive."}]
