[{"comment_id":"876682692378359","commenter_b":"These two women obviously don't know the plan and purpose of marriage.","commenter_a":"STOP have n sex if u dont want children. Once the child is made its alive. Not when it takes the first breath. Ppl are so selfish these days","post_message":"Do you?"},{"comment_id":"1622307121406726","commenter_b":"Jeff the Killer","commenter_a":"Kevin Mccaston this is another reason I won't move to Florida lol","post_message":"'I now have an alligator in my sewer.' #FloridaProblems  @webpagelink"},{"comment_id":"10157848946740389","commenter_b":"The People Must Protect the Republic, since DOJ and FBI are MIA! Trump wins in a landslide; however, the polls are a lie, and her rigging election must prove the lie! It's up to us to stop it, or America becomes just another Brazil. Infowars.com","commenter_a":"By hook or crook, ain't nothing on the books that we can't cook!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153554179988984","commenter_b":"This twat is too dumb to breathe on her own","commenter_a":"Ignorant. I wonder what rock they found her under.","post_message":"I've heard a lot of crazy things from liberals, but this has to be right up there at the top of the list...  Has this woman's PC 'outrage' gone too far?"},{"comment_id":"10152657458940047","commenter_b":"First get your children out of that muslim so called college. Stop paying tuition. Shut it down. It is now a muslim training camp. Congress must shut off funding. Senate and House must stop acting like they dont work for us and get all Muslims out of this country. Enough is enough!","commenter_a":"Operation Paperclip: 69 Years Later: @webpagelink","post_message":"ISIS militants and Hamas jihadists conducting training camps on American college campuses is no different than a training session for student athletes?    According to the Assistant Dean of Students at Cornell University they are.  Astounding."},{"comment_id":"10154003941470950","commenter_b":"Elizabeth Lilly what a ignorant women you are","commenter_a":"His first 100 days will be tremendous. So tremendous and full of catering to Russia. Bigly. He will keep us in suspense as he plans to steal back the money he spent for the campaign. So many plans. Big plans. And we're gonna pay for it. Bigly.","post_message":"Trump is about to speak to a crowd about what his first 100 days in office will look like: @webpagelink"},{"comment_id":"10153562591278487","commenter_b":"It's disturbing that someone who presents as a cop on Facebook would be one of the few people to say 'this was a good shoot.' But #notallcops or #bluelivesmatter or some other inaccurate bullshit to keep people hero worshipping, right? Please.","commenter_a":"I hope you all understand that because the prosecutor went for a murder charge, this officer will be found not guilty. One, due to the fact that the prosecution will have to prove that an on duty officer was out there to kill someone, which won't happen. Two, for the fact that a vehicle is a deadly weapon and shooting a suspect using a vehicle in a manner that puts an officers life in danger is standard procedure and is taught in every academy in the U.S. This was a good shoot and the officer will be exonerated. But get ready to torch your local cvs for justice.","post_message":"is without question a murder, the prosecutor said about Sam Dubose's death.  didn do anything violent toward the officer. He wasn dragging him. And [the officer] pulled out his gun and shot him in the head."}]
