[{"comment_id":"1093462474008096","commenter_b":"Yeah, please do?^","commenter_a":"They are more worried about bringing extinct animals but not help animals that are close to extinction. (rhino, tigers, wolf's, ect)","post_message":"Woolly mammoth genome has been decoded."},{"comment_id":"1186097424786988","commenter_b":"Hillary you're a smart women have faith and be strong you is next President Trump dangerous","commenter_a":"Hillary, you will be a great President.","post_message":"Here’s the sad truth: There is no other Donald Trump. This is it."},{"comment_id":"466299333581093","commenter_b":"You sound like a true liberal","commenter_a":"Philip Sjostrom","post_message":""},{"comment_id":"1060233254031678","commenter_b":"I have a question, I received an email from the bernie sanders.com saying i did not have a party preference but to request a democratic ballot. i did get a democratic ballot. this is my first time voting and was wonder if that's what it actually meant?","commenter_a":"I like how honest Bernie is. The Democrats sold that clean coal fantasy for years, and Clinton is still trying to sell it. Heck, she said natural gas is a \"bridge fuel\" when, renewable can replace most energy needs. When a candidate who sold fracking to the world, and supports \"clean coal\" gets environmental group endorcements. That candidate is the establishment. Because nothing else makes any damn sense.","post_message":"Safe fracking is like clean coal, pure fiction. Fracking pollutes water, degrades air quality and worsens climate change. No amount of regulation can make it safe."},{"comment_id":"928965170496565","commenter_b":"They where good and did what they meant to do make us laugh, well done ladys","commenter_a":"As a woman seeing women strip down does not make me proud to be a woman. Keeping their clothes on and becoming doctors, lawyers, or a different type of role model would.","post_message":"'You make us proud to be women'"},{"comment_id":"10153520610884705","commenter_b":"this is a joke , seriously , he would probably kill her. That would be sad.","commenter_a":"I like her she's a hell of a fighter but Mayweather would make mincemeat of her quite quickly","post_message":"Ronda Rousey says she'd beat Floyd Mayweather (and anyone else) in a no rules fight."},{"comment_id":"10153581173261337","commenter_b":"Get fucking jobs you fucking losers ass faggots !!!!!","commenter_a":"I'm pretty sure these people have more money than God! Please don't help them in there time of wrong doings!!","post_message":"DUGGAR DISASTER: After TLC cancelled 19 Kids and Counting, the Duggar family is asking for donations..."}]
