[{"comment_id":"10152627290331636","commenter_b":"should be run over by a merkava driven by a female israeli lieutenant. thirty times.","commenter_a":"To all the comments... No one support banding women from driving in saudi expect the foreign policy of UK, USA and france which insisted to aid every decision that made or will be made by barbaric and dictator royal family in saudi since 1940s,.... lets stop taking and read history... \"Knowledge-is-power\"","post_message":"The totally logical justification for a ban on women driving in Saudi..."},{"comment_id":"10153035493893822","commenter_b":"Gross. She needs to go back.","commenter_a":"Why isn't she in jail?","post_message":"Connellsville woman charged for having sex with a 14 year old boy. The boy actually dated the woman's late daughter, who died back in June of 2014."},{"comment_id":"10153808852885950","commenter_b":"She Looks Like A Damn Meth Whore!","commenter_a":"The doctor should have never inseminated an old hag like this, i am 40 and have suffered two losses and it's so hard to adopt and this psycho bitch was allowed to keep these kids...will her doctor keep doing this and letting her have more innocent babies... Poor baby May She RIP","post_message":"The 13-day-old died inside the van where her mother had left the children for 38 minutes while she visited a cellphone store, police say."},{"comment_id":"10154096879120329","commenter_b":"Girl buy a shirt that will fit","commenter_a":"Jenny","post_message":"Anyone who says they made it into adulthood unscathed is either lucky AF or a liar."},{"comment_id":"10153670788291320","commenter_b":"This post just made my morning. You hit the nail on the head !!!!","commenter_a":"That family just needs to rent a van, pile into it, pick up the Kardashians and drive away!","post_message":"Disgraced reality TV star Josh Duggar was reportedly among the 32 million users of the adultery website, AshleyMadison.com. According to Gawker, Duggar, a married father of four, paid nearly $1,000 during his two-year subscription. His name, address and sexual preferences, and that of millions others, were posted online Tuesday night by a group of hackers. More: @webpagelink (AP photo)"},{"comment_id":"10153187015096051","commenter_b":"Carolyn, have some respect. He is our President after all. President Obama has made America great. We don't need Trump to mess it up.","commenter_a":"Agree. Obama is a joke and think the world knows it. He's like a bad kid. Just had to say something because he's mad. And the rest....thought he was talking about himself. The US does deserve better than him","post_message":"President Obama had some harsh words for Donald Trump today."},{"comment_id":"1004626696250624","commenter_b":"Boy is she getting old!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"They show this picture to men who have had an erection for more that 4 hours, works every time!","post_message":"Make sure you let our politicians know that we will not support their abortion friendly policies! Click below to sign your petition to end Roe v. Wade today! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH15&pid=fb122"}]
