[{"comment_id":"10154075360053797","commenter_b":"You know her personal","commenter_a":"Wow look at all these people who would vote for a liar to run this country. What an uneducated bunch.go clear back to Watergate with hillary she is a liar.","post_message":"WOW! Rest in Peace Elaine. She was a registered Democrat and not 'a political person.' However, her obituary says: 'Elaine requests, in lieu of flowers, please do not vote for Hillary Clinton.' Her reason is getting a lot of attention. See here:"},{"comment_id":"10153221748849087","commenter_b":"'@username,where are you from?? You pig!! Photoshop your KKK outfit on your daddy...hahahahahaha","commenter_a":"IT WAS YOU, OBAMA who spoke these words at an Islamic dinner - 'I am one of you.' IT WAS YOU, OBAMA who on ABC News referenced - 'My Muslim faith.' IT WAS YOU, OBAMA who gave $100 million in U.S. taxpayer funds to re-build foreign mosques. IT WAS YOU, OBAMA who wrote that in the event of a conflict -'I will stand with the Muslims.' IT WAS YOU, OBAMA who assured the Egyptian Foreign Minister that - 'I am a Muslim.' IT WAS YOU, OBAMA who bowed in submission before the Saudi King. IT WAS YOU, OBAMA who sat for 20 years in a Liberation Theology Church condemning Christianity and professing Marxism. IT WAS YOU, OBAMA who exempted Muslims from penalties under Obamacare that the rest of us have to pay. IT WAS YOU, OBAMA who purposefully omitted - 'endowed by our Creator' - from your recitation of The ...","post_message":"“I do not believe Sharia is consistent with the Constitution of this country,” Dr. Ben Carson told The Hill. “Muslims feel that their religion is very much a part of your public life and what you do as a public official, and that’s inconsistent with our principles and our Constitution.”"},{"comment_id":"803115886455778","commenter_b":"Shoot that mother f***** in the head","commenter_a":"Courtney Surprenant my fear at dollar tree or anywhere really","post_message":"Video captured a Florida mother wrestling her own daughter from the arms of a would-be kidnapper inside a store. The suspect ran out of the store but was quickly stopped by an off-duty police officer at gunpoint. @webpagelink"},{"comment_id":"10153486509166320","commenter_b":"Stupid woman. Don't vote for her just because she is a woman. You voted for a color. Remember...","commenter_a":"And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course ‘lest we forget’ what has happened to many “friends” of the Clintons. 1- James McDougal – Clinton’s convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr’s investigation. 2 – Mary Mahoney – A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown.. The murder happened just after she was to go public w:th her story of sexual harassment in the White House. 3 – Vince Foster – Former White House councilor, and colleague of Hillary Clinton at Little Rock’s Rose Law firm. Died of a gunshot wound to the head, ruled a suicide. 4 – Ron Brown – Secretary of Commerce and former DNC Chairman. Reported to have died by impact ...","post_message":"Hillary Clinton held her first major rally of her 2016 presidential campaign on Roosevelt Island today. She called for a new era of shared prosperity in America and told supporters that workers can trust her to fight for them."},{"comment_id":"10153860953039614","commenter_b":"Total fool.......actually wore than Hitler. Hitler is dead. Trump is still with us. For now.","commenter_a":"Clown","post_message":"A heckler interrupted Donald J. Trump at a rally in South Carolina, as the billionaire presidential candidate called for a 'total and complete shutdown of Muslims entering the United States until our country's representatives can figure out what the hell is going on.'  'They have no respect for human life,' Trump said, referring to 'people that believe only in Jihad.'  He has previously called for surveillance against mosques and said he was open to establishing a database for all Muslims living in the U.S.  Read KTLA's story here: @webpagelink"},{"comment_id":"10153180223152522","commenter_b":"Really? F... off! I rather vote for Clinton. (As much as I despise her)","commenter_a":"Hell no!","post_message":"Ryan was the man to unite the party in Congress. Could he do it again for the White House?"},{"comment_id":"1626970717590041","commenter_b":"Just another dumb ass girl.","commenter_a":"Great job to a fellow veteran to set her straight. As a veteran we all lay our lives on the line and people like this little girl has no concept of what that means. It seems to me her family hasn't taught her or the school's she has gone to they need to wake up","post_message":"What an epic response by this Veteran!"}]
