[{"comment_id":"972807806163282","commenter_b":"shes a Savage","commenter_a":"@username her","post_message":"The former Stanford University student who sexually assaulted a woman behind a dumpster was released from prison on Sept. 2, 2016. That a full three months early from his original six month sentence."},{"comment_id":"10153677449116336","commenter_b":"Have you ever noticed it's always pretty women getting killed? Eat more cheeseburgers.","commenter_a":"Yolanda Mejia","post_message":"A body found on a rural property in northwest Spain is most likely that of Denise Thiem, an American woman who went missing while walking along a pilgrimage route, Spanish officials said."},{"comment_id":"10153348176116336","commenter_b":"I agree, some women go buy the biggest bag purse in addition to the over stuffed carry on.","commenter_a":"What they need to do is ENFORCE their rules now! I've seen people get on with HUGE carry ons! Just saying!!","post_message":"Will you buy new luggage if the world's airlines change their carry-on requirements? (via Fox Business)"},{"comment_id":"932144616915891","commenter_b":"Kill em thier lives don't matter they are scum","commenter_a":"I'm with @username not about race but individuals robbing with guns . Really is that anyone can see? Not criminal activity. Because this is a crime.","post_message":"He's got a package and a uniform, but he's no delivery guy. Once you open the door, his gun-toting crew moves in for the robbery. Now police are warning about the slick new holiday scam. The dangerous delivery - @webpagelink"},{"comment_id":"10153535338020779","commenter_b":"@username Britney is better","commenter_a":"For anybody who has been to shows like Springsteen , Pearl Jam, Metallica, Pink Floyd, it's mind numbing watching Popular music in 2016.","post_message":"Britney Spears opened the #BBMAs with a career-spanning medley of her hits. Watch below."},{"comment_id":"10154038089667293","commenter_b":"Unlikely? Really?","commenter_a":"I live abroad, and there is no escaping questions about Donald Trump on an almost daily basis. I'm often asked directly, \"He's not actually going to be President, though, is he? Can he be? Why are people supporting him?\" They think Americans have lost their minds, and there's tangible concern about what his presidency could mean for the world. Fortunately, I keep FiveThirtyEight handy and can show them how unlikely (currently) his election is, but American democracy has taken a huge (yuge?) credibility hit regardless.","post_message":"When your vacation turns into a lesson in \"Trump-splaining.\""},{"comment_id":"1221745097868321","commenter_b":"Send her out to pasture","commenter_a":"The dumbest women in the world","post_message":"Pelosi says Clinton only lost because of Comey and the FBI investigation. Do you think Democrats are being sore losers?"}]
