[{"comment_id":"10152984234114726","commenter_b":"Deport all Muslims!","commenter_a":"Muslims can live in their Muslim lands in the Middle East. Europe must expel these terrorists. Unlike the Nazis, these Islamists will NOT be sent to concentration or death camps. They will be sent to their homes to stop their invasion of other lands. But we must say things that are NOT politically correct and follow those with actions if we are to survive these Islamic horde. Once they have enough power to resist, then it would be too late. Now is the time to deport, expel or arrest them. Now not later.","post_message":"VIDEO: RAW footage from the terrorist attack in Paris!"},{"comment_id":"10153575411863132","commenter_b":"I don't think she did either...","commenter_a":"I Don't believe she killed him...he was negligible to wearing proper gear... he took a big chance and lost his life... just plain STUPID! Shame :(","post_message":"\"I certainly would not be out on the Hudson River in 47-degree water without a dry suit on, that's asking for trouble.\""},{"comment_id":"10153438772266051","commenter_b":"Ignorant bitch.","commenter_a":"Grow up you spoiled brat.","post_message":"It's easy to see why this encounter between a woman going through the McDonald's drive-thru and an employee has gone viral."},{"comment_id":"10153061886448188","commenter_b":"Show this to Omuslim in the White House, and remind him how EVIL his Muslim Terrorist pals are!","commenter_a":"The Quran says for them to kill all non believers of Allah......the ones that do not are called hypocrites .....why would anyone say this is not Islam? Quran (9:73) - \"O Prophet! strive hard against the unbelievers and the hypocrites and be unyielding to them; and their abode is hell, and evil is the destination.\" Dehumanizing those who reject Islam, by reminding Muslims that unbelievers are merely firewood for Hell, makes it easier to justify slaughter. It also explains why today's devout Muslims have little regard for those outside the faith.","post_message":"We as a company have aired or released many horrible images in our short tenure as a media outlet, none of which have risen to the level of depravity of the images of Lt. Muath Al-Kaseasbeh’s death. We had chosen not to release these images out of respect for the victim, his family and his countrymen, but also because we do not wish to spread fear and the message of psychopathic killers. This morning, I, as the owner and operator of TheBlaze, have changed my mind. After looking at the images again, I believe it is important for the world to see them. We have been lured into a poppy field where we have fallen fast asleep as grave danger quickly approaches. It is time to wake up. This is the enemy of all mankind. Make no mistake, this is a global jihad and it has everything to do with ..."},{"comment_id":"965007433534716","commenter_b":"2 pussy's","commenter_a":"Freya Mistry Rayan Mistry","post_message":"Donald Trump and Jeb Bush are fighting over who is tougher. What do you think?"},{"comment_id":"10153902888094726","commenter_b":"Shut up you dopey ass bitch.","commenter_a":"Palin has lost her class. She is foolish supporting Trump and a lady doesn't swear!!! She must think he will choose her for V.P. Not a good idea for Trump!!!","post_message":"WATCH: Sarah Palin: Donald Trump Will Kick ISIS Ass"},{"comment_id":"1542337212473798","commenter_b":"Anyway, porn is evil and consent can never be bought!","commenter_a":"Fact is, some women enjoy sex, some women enjoy porn, and by saying a woman cannot or should not participate, and that they are all manipulated, you are taking away their right to choose. Thats antifeminist. Further, you are aaying women, by nature, are easily manipulated and dont know whats good for them, and thats also antifeminist. I ssy, as long as a woman is freely chosing the career, and is informed of what it entails, then have at it.","post_message":"How do we make pornography better for actors and the people who consume it?"}]
