[{"comment_id":"10153885880700667","commenter_b":"His wife is an idiot","commenter_a":"He is still body shaming this woman? Really Trump?","post_message":"\"I saved her job because they wanted to fire her for putting on so much weight.\""},{"comment_id":"610785519070224","commenter_b":"Check that woman's mouth for raw....","commenter_a":"Keep in mind, these people are not working real jobs.","post_message":"Has anyone seen this Fox host's soul? It appears to be missing.   -Conover"},{"comment_id":"10153662758062894","commenter_b":"Naw mama had let that warning out that she addresses her child my bad young lady again she gon catch that fade","commenter_a":"But skai read her so no need for mama to even say anything","post_message":"Not My Child! Skai Jackson’s Mother Has Words for Azealia Banks: ‘I Don’t Play Those Games’ [Photo]"},{"comment_id":"674600329361440","commenter_b":"rep need to get a life","commenter_a":"Look at that! I bet there are at least 100 people there! Maybe unpaid to boot!","post_message":"WATCH LIVE: Hillary Clinton and Elizabeth Warren campaign together in New Hampshire."},{"comment_id":"10153180567873690","commenter_b":"its for this reason lisa muslims want to have it all they fight amongst each other blame the west and on top of it want sympathy from westerners as you said americans fought to be where america is today we still struggle with our own issues but theres a constant progression all be it slow .. why is it that muslims are dying to come here ? why cant they look around at the state of their people and see its something wrong with their way of life ? why is the rest of the world capable of governing their own but arab leaders oppress and steal from their citizens speak to arabs off record they all say they hate arabs and wish they werent arab .. very telling .","commenter_a":"my favorite is when muslims say 1400 years ago christians did this or that f off! the world has moved on everyone except muslims. ha and ohh in the time of muhammed this or that again f off that was 3500 years ago not relevant .","post_message":"Opinion: The religious identity of violent perpetrators is only highlighted when they're Muslim. @webpagelink"},{"comment_id":"10154879190478812","commenter_b":"Shoot back you spineless worms","commenter_a":"That's a lie. Yemenies love USA soooooooooooo much","post_message":"Two missiles fired at U.S. Navy guided missile destroyer USS Mason in international waters off the coast of Yemen on Sunday, according to the Pentagon."},{"comment_id":"10156388253550389","commenter_b":"isis thinks if you get killed by a woman you go to hell.. lmao go get them girls!","commenter_a":"Just remember one thing, ladies. If you are in a position of fighting the enemy first hand like men do, the enemy will be just as fierce against YOU as they are against any man. Your feminism will not be a factor. And, if you become a POW, they will then treat you differently, but not In a way you will like.","post_message":"Defense Secretary Ash Carter announces plan to open all combat jobs to women, the Associated Press reports."}]
