[{"comment_id":"1739139336348305","commenter_b":"My thoughts are she need to shut up! She belongs being bars!!","commenter_a":"She is a disgrace.","post_message":"\"It's essential that we stop terrorists from getting the tools they need to carry out the attacks and that is especially true when it comes to assault weapons like those used in Orlando and San Bernardino.\" -Hillary Clinton  Weigh in with your thoughts. @webpagelink"},{"comment_id":"10154038010859205","commenter_b":"That's because it turns out she actually is a nasty woman. With a lot to hide.","commenter_a":"Robbie Mook is a terrible liar. Look at that body language!","post_message":"A blog called “True Pundit” said there were reports of Hillary Clinton asking why the government couldn’t just assassinate Julian Assange via drone strike. Hillary Clinton’s denial is less than convincing."},{"comment_id":"1021126491243474","commenter_b":"And yet a student did intervene verbally and is still alive.","commenter_a":"Shame on that teacher for not standing up for that student. Even if she was being disruptive in class she still deserves to be protected and treated with decency.","post_message":"When a white Spring Valley cop brutally assaulted her classmate, Niya Kenny sprung to her defense.  How could she have known what would happen to her next  just for speaking up? #AssaultAtSpringValleyHigh"},{"comment_id":"883279651765090","commenter_b":"No I read the whole thing, when article says believing Lincoln would restrict their rights to own slaves southerners decided secession was a better choice then to give up their economic system and their way of life. I translate that into, we will not get rid of our free labor (slaves) so secession was the choice, I can see where economics played into it, but to say slavery was not part of those same economics would be terribly ignorant. Lincoln maintained that secession was illegal thus unless south gave in war was inevitable.","commenter_a":"Here is an explanation of the civil war directly from the FEDERAL Government which proves without doubt that the War was NOT about slavery. Learn to research for yourselves people and stop being sheep. @webpagelink","post_message":"This is a VERY dangerous lie. Spread the TRUTH!  Read more here: @webpagelink Image by Occupy Democrats."},{"comment_id":"10152914795481336","commenter_b":"Women, in particular, need to be observant, especially at night! Plus, they would be well-served to get their CCW and learn how to use their weapon---proficiently...!!!","commenter_a":"One of us would not have left there.","post_message":"Police in Texas are searching for a man seen on surveillance video forcing a woman into the trunk of her car at an ATM."},{"comment_id":"1717609118507402","commenter_b":"She can move her wretched ass OUT!","commenter_a":"Please","post_message":"Michelle Obama: Every single day, \"I wake up in a house that was built by slaves.\""},{"comment_id":"871781506248238","commenter_b":"one of the dumbest bitchs on TV","commenter_a":"VERY SIMPLE : The Nazi Swastika, was not invented by Hitler or the Germans. It was a Pre Egyptian and Egyptian emblem...It can also be found in Native American symbols. But Hitler and Nazi horror's exploited The Symbol ! The Confederate Flag, has much History and status. But, The KKK in the early 20 th century, hijacked this Flag, (Symbol) and carried out Murder, Lynching and Devastation to many in the South, and all over America ! Unfortunately, but accurately, these two SYMBOLS represent, Horror & Evil beyond most comprehension. Many perceive the Swastika as Evil, (When related to The Nazi Party, they're correct) & Many perceive the Confederate Flag as Evil, (When related to Racism, they're correct). What you perceive is how you believe.... Perception is Reality. Removal is just...Now what will Mississippi do ?","post_message":"They really destroy the argument for keeping the racist flag around."}]
