[{"comment_id":"10152873861987434","commenter_b":"Shit for brains","commenter_a":"Since when did weed start smelling like fish?","post_message":"After pulling Charnesia Corley over for running a stop sign, two Houston deputies held her legs apart and forcibly administered a body cavity search in public—all because her arresting officer suspected she had weed."},{"comment_id":"10154615218080530","commenter_b":"@username-Fequiere Wait, so now black on black violence is due to INEQUALITY????","commenter_a":"When are people going to start protesting the deaths of 9 year old girls executed in Gang warfare in Chicago? It's like we're protesting something that happens 1 time out of 1,000,000. And nobody cares about something that happens like everyday. The media has got the people riled up about a very small issue while ignoring major problems. That's why I don't understand this movement. It's like if the government was repossessing everyone's home and moving them to refugee camps for no reason, but I was protesting the governments estate tax while ignoring people's homes being taken.","post_message":"Does the Michigan Football players' silent protest make you uncomfortable? Does that interrupt your Saturday afternoon of escapism? Sorry. That’s the point. @webpagelink"},{"comment_id":"590301711160408","commenter_b":"She looks to be about 100 years old in this photo, Ban her ugly mug from FB","commenter_a":"When she becomes a licensed nutritionist then maybe somebody might listen to her. Her plan not only sucks but it is no where near the enough food. A child needs more than 200 calories for lunch.","post_message":"What Michelle Obama is banning now is just plain unacceptable. The American people are tired and finally fighting back. Do you agree Michelle Obama should mind her own business?"},{"comment_id":"10154917565918690","commenter_b":"how about stop raping women and build some toilets?","commenter_a":"Great job ....we feel proud of our national anthem..haters ...f****k offf","post_message":"\"The time has come, the citizens of the country realise that they live in a nation and are duty bound to show respect to the national anthem. @webpagelink"},{"comment_id":"10153326829869170","commenter_b":"then let her and the mayor protect the city, see how good they do against the thugs.","commenter_a":"This whole deal is just so sad, on so many levels. Lots of fault to go around. Lots of blame to be shared.","post_message":"BREAKING NEWS: Baltimore's chief prosecutor says the death of Freddie Gray is a homicide. Six officers are being charged."},{"comment_id":"10154388349554657","commenter_b":"Put the witch on a stick and burn her.","commenter_a":"Should be incarserating her.","post_message":"It is the political story that just won’t go away for Hillary Rodham Clinton:"},{"comment_id":"10153553147025927","commenter_b":"Send her into orbit!","commenter_a":"Racist","post_message":"Apparently Whoopi doesn't care if the DNC rigged the system. Why? Because it's against a white guy. #DNC2016"}]
