[{"comment_id":"10153090141861680","commenter_b":"So what? Nothing should be said about mass shootings? Thugs and criminals are not mass shooters. There is crime everywhere. In every state and city. Our second amendment has been a shield for evil doers. Most criminals and thugs or gangs are trying to survive a life of under privilege and zero opportunities...jmo","commenter_a":"I live in the Atlanta area and every day, I say again, every day there are 3, 5 and some days more murders, carjackings, home invasions, bank robberies all committed by thugs, gangs and criminals. Yet, you don't hear one word, not one word of anger or control to get the guns out of the hands of these criminals. There are more murders in one week in the Atlanta area than the 10 souls that were lost in Oregon. If politicians really cared about every life, there would be more done to dismantle the gangs and thugs in our country. But instead all they care about is how they can take advantage and politicize a senseless crime to advance their agenda to take guns away from US citizens. They know that CRIMINALS DON\"T CARE ABOUT THEIR F'n LAWS!!!! So their true intentions must be to disarm the people.","post_message":"POLITICO takes a look back at some of his stronger words on the issue."},{"comment_id":"1133219213367232","commenter_b":"Brian spot on brother our country is sick you hit nail on the head God bless you.","commenter_a":"AGREE, 100%. AMEN,","post_message":"YES!"},{"comment_id":"10152475655222434","commenter_b":"This has never happened at a Steel Panther concert, little disappointed. I'm an actress and I've had people fall asleep in the front row... That was pretty funny. Also Erica, if the band were that bothered by it, they would have got security to remove them from the venue","commenter_a":"Matthew Naughton","post_message":"This woman is what the kids would call \"punk rock.\""},{"comment_id":"915633041826559","commenter_b":"Nah she just pays for herself. Greedy money grabbing witch.","commenter_a":"And so............she pays her female staff less thrn her male staff. GOOD job hillary","post_message":"Equal pay isn't a women’s issue. It's a family issue. It's an American economic issue."},{"comment_id":"10153099040499726","commenter_b":"I'd like to get rid of your ass.","commenter_a":"Just another lie.","post_message":"WATCH: Democratic Representative: 'Tea Party People' Want To Bring Back Segregation, Get Rid Of Women's Rights."},{"comment_id":"473987716059156","commenter_b":"If MUSLIMS want kids to learn about Islam they should move back to the HELL HOLE they came from. In America we believe in separation of religion and state.","commenter_a":"all our schools should ask God back in to their teachings","post_message":"Muslims are up in arms about this new bill affecting religion in schools in Tennessee. I wonder how far they'll challenge it."},{"comment_id":"931005183682927","commenter_b":"Send that black bitch back to the jungle baby.. Yeeaaahhh","commenter_a":"Fire her. if she were white, she would already be gone.","post_message":"Sam's Club CEO made some serious anit-white racist comments. She thought it would slide under the radar because it was directed at white people. She was very wrong. Payback that is happening has been brutal and swift and she deserves it. Can we get 5,000 'LIKES' to fire this CEO for racism?"}]
