[{"comment_id":"1469983173042150","commenter_b":"#Youcantdefendit #grabthembythepussy #anybodybutTrump","commenter_a":"Folks we should be talking about this Obama care collapse and how our premiums are going up in 2017 by 26% scary . My family can't afford this !!!","post_message":"The story just keeps getting worse, and worse."},{"comment_id":"712988442225067","commenter_b":"aint she pretty..i would rather kiss the south end of a north bound mule...","commenter_a":"My God that's one ugly broad she has more rinkles than a road map","post_message":"Like if you agree."},{"comment_id":"10153535750495667","commenter_b":"@username she is a horse","commenter_a":"She's still ugly and that will never change!","post_message":"Michelle Obama turned Friday the 13th into a fashionable affair."},{"comment_id":"10157751782920500","commenter_b":"BUILD THE WALL!","commenter_a":"I don't get how everyone assumes all those people are unemployed, on government assistance and have no education... who the fck are you.","post_message":"This is live footage from Oakland where people are protesting Donald Trump's election."},{"comment_id":"874881595880596","commenter_b":"Doesnt matter what they get The blacks or most of them would whine and complain about something!","commenter_a":"Lets just go back to the old days of segregation if that's what they want and they all can ride in the back of the bus","post_message":"“Whites Not Allowed” This is the public education system in Obama’s America."},{"comment_id":"1025668424151460","commenter_b":"Again son, go fuck yourself, you're nothing but a useless troll :) you understand that, right?","commenter_a":"Hum... hopefully the US and Russia will agree in sharing intels, would be a shame if US troops got bombed by Russia because the US didn't want to tell them where they troops were...","post_message":"Just remember, folks… this is all about ISIS, the big bad boogeyman in the black pajamas, and has nothing to do with Assad's rebound or the influx of Russian special forces troops into Syria. ~Will"},{"comment_id":"1494215257285326","commenter_b":"If ur here illegally you got to go. 100%.","commenter_a":"If you're here legally and ICE knocks at your door: Answer and say hello, you haven't broken the law so you have nothing to fear.","post_message":"ICE raids have resumed in several cities under the Trump administration, continuing to tear immigrant families apart and put whole communities in the target hairs. Thankfully, more and more people are getting aware and awake, and are hitting the streets to protect undocumented communities and protest raids, mass detentions, and deportations. Activists in many cities are holding \"know your rights\" trainings over the next several days - get involved in your city, and join the movement to protect immigrants and their families!"}]
