[{"comment_id":"10153924016401130","commenter_b":"Oh grow up all of you. Why should she need to put a cover over her breasts. You put a cover over your mind and give thanks that mothers can feed portably whilst not being excluded. I'm sure you can train your mind to manage to view a pair of breasts as a feeding devise and look at how your own mind processes this function. Women relinquish enough do to our biology - can't we at least feed and belong at the same time?","commenter_a":"She should have stayed home. Not her day.","post_message":"Now THIS is a cool mom. 😎"},{"comment_id":"1156100184429437","commenter_b":"This woman is for Trump","commenter_a":"It was really disgusting watching how Fox News joined the rest of the \"Left-stream\" media last night in savoring Ted Cruz's Wisconsin win. Megyn Kelly & co. continually dissected the voters by pointing out that \"Trump was losing the appeal of woman voters.\" \"That Wisconsin voters were educated and paid very close attention to details!\" How sad. Never in my life have I witnessed how the GOP could deliberately try & take down one of their own while leading the attacks against Mr. Trump in their on-going crusade \"to stop Trump!\" This is very disturbing. Cruz and that nasally annoying voice of his was carrying on as though he transformed this presidential race when in fact it was Mr. Trump who initiated the anti-establishment hostility from the moment he threw his hat in the presidential ring. Cruz is a GOP plant as is Kasich.","post_message":"THE EXPANSION OF TERROR is so much worse than what we'd like to admit, a new report out of the EU confirms: @webpagelink"},{"comment_id":"494998494021091","commenter_b":"Probably because nobody wants to get that shit all over their car. I know I wouldn't.","commenter_a":"Diane Abramson, seriously, how has nobody \"accidentally\" run over Cruz in a crosswalk yet?","post_message":"The man behind Donald J. Trump's Muslim ban is on Ted Cruz's list of trusted experts."},{"comment_id":"594130970711496","commenter_b":"She a commie in bad clothing","commenter_a":"I'm just wonderin......Does she feel \"tyred\" these days??","post_message":"Hillary Clinton says people are \"concerned\" by Trump's \"divisive rhetoric\" and he needs to be stopped \"conclusively.\" Is she right?"},{"comment_id":"818332488251250","commenter_b":"American exceptionalism...we can be batshit crazy and justify it with religious idiocy. We're special :)","commenter_a":"Have we gone completely nuts or completely American/Christian Taliban?","post_message":"Six states currently permit pharmacists to refuse prescribed contraception medication to a woman based on personal and/or religious beliefs."},{"comment_id":"10156267037025354","commenter_b":"Why are illegals allowed to have a drivers license? Utter insanity!","commenter_a":"Jerry Brown is a putz! He should have been out of politics decades ago. Look at California. It's a disaster.","post_message":"It's starting."},{"comment_id":"10154708467139575","commenter_b":"@username -AMEN!!!","commenter_a":"There are many people that work on major holidays. I don't know why every year retailers being open on Thanksgiving is a huge deal. First responders, hospitals, airports etc never ever close. Instead of the media always focusing on the negative maybe they should focus on the positive and the people that work these Essential jobs and miss many holidays with there family's.","post_message":"Macy's is staying committed to Thanksgiving Day shopping, saying it will open at 5 p.m. this year. What do you think about this? Will you visit Macy's on Thanksgiving?"}]
