[{"comment_id":"10152677348991523","commenter_b":"I wasnt there but innocent until proven guilty and its always a bunch of white women","commenter_a":"They are liars. Every time these women have a press conference, I've noticed while they're speaking they have to keep looking down at their notes. Their statements should freely flow out of their mouths if it was true.","post_message":"Phylicia Rashad says she was misquoted on Bill Cosby, and sets the record straight."},{"comment_id":"1263844570323065","commenter_b":"yep. Sobbing now.","commenter_a":"Started crying before I even opened the article","post_message":"These Holocaust survivors just regained a lost part of their childhood. - Jon Comulada"},{"comment_id":"10153941418821167","commenter_b":"Nope! He's going to insist that the debate was rigged.","commenter_a":"I haven't seen a whooping that bad since my cousin said the F word in front of Grandma. #KillaryKilled #TrumpTucksTinyTail #debates","post_message":"'Overwhelmingly Hillary Clinton'"},{"comment_id":"10156358709930725","commenter_b":"She's deserves to rot in hell.","commenter_a":"Allie Stoltenberg @username","post_message":"Police are investigating a pet owner after a Facebook post of her dog muzzled with duct tape went viral ----> @webpagelink"},{"comment_id":"10153344624090326","commenter_b":"Sit down and shut up!","commenter_a":"He has hearing problems nothing is free","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154284155303908","commenter_b":"Alexandria Lindquist Larry bought the lease for 14 million, Bumped up his policies just prior and netted a 4.5 bn dollar payout. Funny that!","commenter_a":"Tallest structure in the world. Located in the middle of one of the largest and most populated cities. And you're telling me that the developers didn't take into account the possibility of the structures collapsing? I think they did. And in the midst of a terrorist attack, the split second decision had to be made; whether or not to take down the Structures in a controlled explosion ( which was probably designed during conception ) How would they have known whether or not any more explosives were going to go off? Tough call","post_message":"Were the twin towers, and more specifically, building 7 blown up by bombs on 9/11? Researchers at the University of Alaska are about to find out."},{"comment_id":"10153715295681336","commenter_b":"Nancy Pelosi ? What are you smoking?","commenter_a":"As a GOP Tea Party, it's the best news I have heard this whole year! This RINO had to go, he's dishonest, he campaign as a Tea Party Patriot and then became a Liberal hack as many of them usually do! When I saw Nancy Pelosi defending this clown, I knew we were betrayed.","post_message":"“It’s become clear to me that this prolonged leadership turmoil would do irreparable harm to the institution… This morning, I woke up and I said my prayers...and I decided, you know, today is the day I’m going to do this.”  Moments ago,  Speaker John Boehner announced why he has decided to resign this year."}]
