[{"comment_id":"1221745097868321","commenter_b":"Send her out to pasture","commenter_a":"The dumbest women in the world","post_message":"Pelosi says Clinton only lost because of Comey and the FBI investigation. Do you think Democrats are being sore losers?"},{"comment_id":"479435838921955","commenter_b":"@username not very lady like !","commenter_a":"President trump all the way people power God bless Donald trump","post_message":"For many, the look on Chris Christie's face said it all during Donald J. Trump's #SuperTuesday event."},{"comment_id":"1115117555187217","commenter_b":"Jette de Vries","commenter_a":"Nathalie Baranke","post_message":"If you have a cat you should do this immediately. (Via JukinVideo )"},{"comment_id":"517364508436536","commenter_b":"The other candidates are disappointed because they need Trump's ideas","commenter_a":"I wander if I can have my cable provider remove FOX channel from airing in our home period...ha..oh, I can do that. #TRUMP !!","post_message":"The Trump campaign is saying that Donald J. Trump will skip Thursday’s Fox News-Google #GOPDebate. @webpagelink"},{"comment_id":"10153963007189160","commenter_b":"@username: Michelle Obama is not an entitled wife she is just an ordinary male in women's clothing. GO TRUMP GO!!!!! America is the land that I love.","commenter_a":"Finally now the truth starts to come out. Hopefully Obama cannot put the spin on this now. Hillary for jail with the rest of her crooked family and Obama and his family also. Especially his entitled wife.","post_message":"Wikileaks is out with more than 1,200 emails from Hillary Clinton's private inbox."},{"comment_id":"1678937325726713","commenter_b":"Prayer is on the way","commenter_a":"Prayers for Ava. Willie Nelson is GREAT!!","post_message":"Please spread this and send your prayers."},{"comment_id":"1298794080158825","commenter_b":"OK. Sacrifice your two daughters first....and we will all follow suit (he is a big asshole)","commenter_a":"Obama's a damn clown","post_message":"More evidence that this president believes in sacrificing military readiness on the altar of social engineering."}]
