[{"comment_id":"877412165685172","commenter_b":"As long as you're legal. Either way, hard work or not your family broke the law so you're criminals. It's the truth. The country is better off without illegals.","commenter_a":"Please please all illegals and Mexicans and Mexican-Americans keep posting your stories. We need to show Trump and his ignorant followers the truth!!! Post your stories. Post your families stories. Flood the Internet and Facebook with the truth of why people of every nationality and every nation come to America!!! Make it known and state the facts and truth!!!!!! Bring ignorance to its knees.","post_message":"She really nailed 'The Donald!'"},{"comment_id":"558362490993134","commenter_b":"Why is it we are so intent to run our country into the ground?? Follow Trump, and mark my words, there will be a WWIII, and everyone will be pointing their guns here. We will have no allies as he will insult them all. Wake up, America.","commenter_a":"'I will not forget.' What in the hell do that suppose to mean?","post_message":"Do you agree with Donald J. Trump's tweet?"},{"comment_id":"10155005314954062","commenter_b":"'@username Gale Adams @username @username Christina Marie 👀😒😔","commenter_a":"Justin Irwin","post_message":"Please be careful to all of our friends in the Conroe area. This was shared by Heather Dungan from Conroe 105 and I45 near Home Depot.  If you encounter high water, turn around. @webpagelink"},{"comment_id":"706537696174664","commenter_b":"White trash! Take a bath!","commenter_a":"Omg. Thought we only had one clown in the white house then she showed up. Glad its only for a few days left thank god","post_message":"Happy 53rd birthday to First Lady Michelle Obama! Join us in wishing her well!"},{"comment_id":"999541756747912","commenter_b":"Wake up American, Those people re Terrorists not Refugees.","commenter_a":"New York! !!","post_message":"WOW!"},{"comment_id":"10153321686504091","commenter_b":"They was trying to rob him","commenter_a":"Did anyone notice she looks around twelve?","post_message":"WANTED FOR TWERKING? Two women are being sought for sexual assault after twerking on an innocent man, police say.  WATCH --> @webpagelink"},{"comment_id":"10153255561596350","commenter_b":"She did do it her way.....special lady","commenter_a":"Tomi McCutchen Parrish should write her own obit, one day.","post_message":"pains me to admit it, but apparently, I have passed away. Everyone told me it would happen one day but that's simply not something I wanted to hear, much less experience. Once again I didn't get things my way!"}]
