[{"comment_id":"858528920935448","commenter_b":"Sarah Dingle, how do you (or any Arabs or Muslims) have the courage to speak of apartheid when ISLAMIC COUNTRIES ARE WELL-KNOWN FOR THEIR GENDER-SEGREGATED SOCIEITES? That really laughable!","commenter_a":"If any Country refuses to compete in a friendly or qualifying tournament or bans others for racial reasons. They should be banned from all worldwide competitions! This is 2015!! Time to stop the hate against Israel!!","post_message":"Israel judokas were not allowed to compete in Abu Dhabi with the Israel flag on their judo uniform."},{"comment_id":"1836845559870004","commenter_b":"She doesn't deserve to be nominated.. What a laugh..","commenter_a":"Her expressions are the worst.... From her constant head nodding to her wide eyed expressions. And what's worse is when she opens that mouth of hers to spew out a constant stream of lies...","post_message":"Balloons are released to celebrate the official nomination of Hillary Clinton & Tim Kaine."},{"comment_id":"1190103767694524","commenter_b":"SOROS supposedly promised her the election so that is why she thinks she has it. THEY WERENT COUNTING ON TRUMP TO TAKE OVER!!! LOL GO TO HELL BITCH> WE NEED TRUMP NOT SOME GANGSTER BITCH AND HER CULT!!!","commenter_a":"Nobody bothers to mention that the last time the Clintons were in the white house they stole furniture and silverware and were forced to pay or return it.","post_message":"Hillary thinks she's already won. This kind of sick behavior is UNACCEPTABLE in a constitutional republic!"},{"comment_id":"1132111446809033","commenter_b":"Anyone who thinks this monster deserves peace to live her life free is more fucked up than she is!","commenter_a":"You people are sad! Leave her alone already, she deserves the right to be rehabilitated. Still watch her closely, but leave her alone.","post_message":"The convicted killer has changed her name several times since her 2005 release."},{"comment_id":"1028860963867355","commenter_b":"The bitch needs to shut up all she knows how to do is ly","commenter_a":"Lying again","post_message":"Senator Elizabeth Warren went after Donald Trump, slamming him as a \"thin-skinned, racist bully\" and \"proven failure\" who is only \"qualified to be fraudster-in-chief.\" What do you think about her comments?"},{"comment_id":"10153520680806077","commenter_b":"Marine's can be so cocky ugh","commenter_a":"Some people are so trigger happy, its ridiculous and disturbing.","post_message":"Jesse Nelson's 32-year-old brother Christopher was killed after he tried to break into a house in Denver. \"Dying like this, it's not worth it,\" Nelson said."},{"comment_id":"1324204954284728","commenter_b":"This is the future of the Democratic Party. She's sick .","commenter_a":"Thank goodness she got what she deserved.","post_message":"While out preaching on the sidewalk, a man was shocked to see a woman quickly approaching. Unfortunately, things would take a horrifying turn as the vile woman pulled something from between her legs and decided to gift him with it – but she wouldn’t be laughing just a few short days later. @webpagelink"}]
