[{"comment_id":"10154082657224497","commenter_b":"The Hillary machine has infected ClickHole too? Thanks a lot, Obama!","commenter_a":"Only 7?","post_message":"Via ClickHole:"},{"comment_id":"10153650644833812","commenter_b":"Feminism at its finest.","commenter_a":"Hillary Clinton has a beautiful spirit God bless","post_message":"Hillary Clinton's mom, family life at center of $2,000,000 TV ad buys directed at Iowa and New Hampshire: @webpagelink"},{"comment_id":"1704424399796624","commenter_b":"Just shows how retarded womens issues are. realsexism.com","commenter_a":"We're all getting a little over-sensitive about these non-issues, no? Politicians need to smile for likability. Likability is crucial in a candidate. It's why a sweating Nixon went down to JFK. It's why the trope of \"kissing babies\" became a thing for politicians of any level. When I think of male pols who didn't smile, they didn't do so hot. Your Bob Doles, your Ralph Naders, your Jim Webbs. All pols need to be likable, and I can remember accounts of the \"dourness\" of the above males mentioned in the news, but when it's mentioned about a woman, it's not okay? She's running for President, this is fair commentary.","post_message":"Were other (male) candidates called out the same way?"},{"comment_id":"10153823736048128","commenter_b":"Gee Rickie: thanks for clarifying this And, I know my geography idiot; I was referring to Europe in a cultural sense. Did you forget to take your Autism meds Rain Man? By the way, we thick Yanks haven't allowed an invasion of Muslims into our Country on a scale no where near proportional to your own Country. Your Nation is finished you morons! So, go choke on a hookah you snarly toothed Lime!","commenter_a":"Why bother at this point when they are allowing millions of Islamists to openly invade Europe?!?! Seems like an exercise in futility or just some good media PR to appease scared & irate native Europeans.","post_message":"Authorities in Italy, Germany, Switzerland, the U.K. and Scandinavia searched 26 premises and seized electronic devices and documents."},{"comment_id":"10153880713234753","commenter_b":"Do better job then Hillary","commenter_a":"Vote trump","post_message":"A Latino Trump supporter in California claims it’s a lot more difficult to publicly support Donald Trump than to come out as gay. Juan Hernandez, who is a member of the Log Cab Republicans, a gay conservative group, indicated that he was leaving the Trump rally in San Jose, California, on June 2, when a mob of violent Trump protesters attacked him, breaking his nose in the process. A friend was similarly set upon by the assailants, some of whom carried the Mexican flag and were burning the... @webpagelink"},{"comment_id":"10153509361000796","commenter_b":"GO GTFOH get GONE. WE don't want you !!!!","commenter_a":"A lot of \"thinking\" republicans are going to switch to hillary to keep him out of office... they feel she will be far less dangerous and damaging...","post_message":"Across the country, Republicans are coming to terms with presumptive presidential nominee Donald Trump, and prominent Maine party members began to rally around him yesterday after his last two challengers, Texas Sen. Ted Cruz and Ohio Gov. John Kasich, dropped out."},{"comment_id":"10153224178386336","commenter_b":"You cannot deport american citizens out of america, it makes no sense. lol","commenter_a":"Gather them up and ship them out of the country. Anyone who doesn't respect America should leave. No one is asking them to stay.","post_message":"A new social media \"challenge\" is encouraging people across the country to disrespect and stomp on the American flag."}]
