[{"comment_id":"10155066009203493","commenter_b":"Yes that's correct and he's taking out costs that we don't own and can start getting our capital to be spent on a structure that works for AMERICA. As opposed to all of these illegal aliens. No matter what the color of the skin is. I am a dual resident to California and Texas. California is beautiful to look at. The government and legislation there is literally nauseating. Whomever hasn't the ability to actually see the the chaos and the self destruction that the literalistic mentality creates is beyond a stupidity that I can even fathom. I got pulled over for tint on my windows. It cost me over $800 after it was said and done. And the levies are less than desirable. The roads are along the same avenue. However you can get on welfare there with ease and pay for nothing. Citizen or not. And the politicians and ...","commenter_a":"Jerry Springer, I mean Jerry Brown is wasting 3.5 BILLION of our money on a bullet train to nowhere , wake up people ! We are sinking ! Our next fight : MAKE CALIFORNIA GREAT AGAIN!!!!!!","post_message":"BREAKING NEWS: It's a storm so fierce, rescuers need rescuing as a firetruck falls into a massive crater. @webpagelink The frightening scene captured by our cameras on I-15 at the Cajon Pass as the freeway crumbles beneath the engine."},{"comment_id":"10154306922931943","commenter_b":"Can I demand answers to what laws ye dupes say she broke?","commenter_a":"Criminal","post_message":"Hillary Clinton must be held responsible for using \"private\" email accounts and a hidden email server as Secretary of State to conduct government business in violation of the law! Judicial Watch is the one organization with a proven 20-year track record of investigating, exposing, and prosecuting Hillary Rodham Clinton and company. Please SHARE!"},{"comment_id":"10154427228206162","commenter_b":"Clearly the women in this case is at fault she bought the cheaper tickets and tried to pull a fast one.","commenter_a":"Leave it to ABC news to make a bigger deal out of a story than what it should be.","post_message":"A mother was devastated after she and her five children were forced off an Amtrak train in the middle of the night. READ MORE: @webpagelink"},{"comment_id":"914583611910394","commenter_b":"Trump is right about illegal immigrants. Our government has committed treason by leaving the borders open.","commenter_a":"Give em a right and then a left upper cut ,don't quit,you have em on the ropes...","post_message":"Hot off the press!"},{"comment_id":"10155092552983797","commenter_b":"I'd rather have all those than Depression :D Wait, you said, \"CORRECTion\"... how do we even know the Bible is correct? Bible stated Jesus is white.. we know that's false. He's Black. The Bible is a contradiction to other verses and such.","commenter_a":"Really??? Lol! Side effects for birth control for women- Intermenstrual spotting. ... Nausea. ... Breast tenderness. ... Headaches. ... Weight gain. ... Mood changes. ... Missed periods. ... Decreased libido. And thats just the 10 common side effects.","post_message":"The shot seemed to be as effective as other forms of contraception, but the men complained of side effects like acne and mood swings..."},{"comment_id":"10152729165306051","commenter_b":"Why , is a pig smarter?","commenter_a":"I am offended that they are catered to. I love pork and will continue to eat it unless my doctor says not to... then I may eat it any way. No religious cult will tell me what to or what not to eat, wear, pray, etc.","post_message":"This publishing house just banned all references to sausages or pigs because they offend certain religious groups."},{"comment_id":"1273048739421267","commenter_b":"I don't believe very many Republicans are \"in to\" the arts except at fundraisers. lol","commenter_a":"They are Trumps uneducated.Gotta love STUPID!","post_message":""}]
