[{"comment_id":"10155847652065354","commenter_b":"Susan Sarandon can go lick a monkey's butt....friggin dingbat.","commenter_a":"Susan Saradon should lick the bottom of a seagull!","post_message":"Susan calls her a \"true American.\" But another celebrity has the guts to call out this pop diva's antics..."},{"comment_id":"10153218753159270","commenter_b":"God will deal with this! He did it once.","commenter_a":"But your only going to enforce Christians to marry gays, but muslims can do whatever they want?","post_message":""},{"comment_id":"10155026342853147","commenter_b":"She is a slob","commenter_a":"Clueless no talent idiot.","post_message":"Pop star Pink attacked President Donald Trump for “stripping our humanity away”"},{"comment_id":"1150560135003462","commenter_b":"Pathetic Kardashian whore.","commenter_a":"you go it right she is pathetic","post_message":"Caitlyn Jenner joined the festivities in Cleveland where she explained her reasons for being a Republican."},{"comment_id":"1063405993707262","commenter_b":"@username by sitting this election out, you will be voting for Hillary!","commenter_a":"The Donald has his whole family there. Oh, and his favorite adviser - himself, his biggest fan - himself, his biggest fan - himself. Who else does he need? He's been saying all along that he will win without support. The truth is that, as much as I dislike these guys, they are basing this on principles. Laura, I used to have much more trust in you, but you've gone over too the dark side it seems. Trump is the worst candidate in my lifetime. And when you consider that includes Dole, McCain, Romney and the Bushes, that's saying a lot.","post_message":"Jeb Bush, John Kasich and company reveal they value their egos more than the GOP's success."},{"comment_id":"10153465147033812","commenter_b":"Don't worry about turning white in the White House, your dumbass isn't even gonna make it in there you dumb twit!","commenter_a":"No your a has been go home","post_message":""},{"comment_id":"1313680338710499","commenter_b":"Dam so the bitch anit leaving","commenter_a":"I thought she said she was leaving the United States and my subconscious was hoping it was for good Her support threw the election for Obama she's lost all credibility with me","post_message":"Oprah Winfrey just STUNNED her fans with this massive announcement about Donald Trump's victory. Nobody saw this coming..."}]
