[{"comment_id":"10154001365909497","commenter_b":"There are plenty of nice average looking women that \"nice\" average looking guys ignore because they chase hot chicks. It works both ways.","commenter_a":"Local man who would be good provider for area woman`s kid friendzoned while area woman dates unemployed band members. Area woman complains about lack of good men.","post_message":"\"If they find a cure for Zika tomorrow, it not like I can afford to get pregnant under my current insurance plan.\""},{"comment_id":"10153095720526051","commenter_b":"You poor sick woman, you must have never gone to school ever.","commenter_a":"Not saying what he did by any means was right.... But blacks are openly threatening to kill us everyday... The Black panthers said they were going to bomb white nurseries and how they need to rape and kill all white women and children. All this can be looked up. There are numerous hate crimes committed by blacks against whites everyday yet finally a white boy snaps and it's everywhere on fb and everyone wants him publicly hung. Obama is now pushing his gun control bs again over this but why doesn't he do that over the thousands of shootings everyday pointed towards the black on black crimes? Open your eyes people... I think you're all missing the much larger picture here.....","post_message":"Dylann Roof just confessed to the #CharlestonShooting. He says he had just one goal in mind when he opened fire."},{"comment_id":"10158098604455192","commenter_b":"Awww look at the snowflake. Upset because she can't find the safe room.","commenter_a":"Who really cares what these celebrities think.","post_message":"Streep noted that \"Hollywood\" is a reviled place. But in reviewing the backgrounds of several of her colleagues surrounding her at the Globes, she said that it's really a community filled with people from other places united in the mission to show different people and make audiences feel what they feel."},{"comment_id":"10153580364618797","commenter_b":"Lol @username she's definitely stupid and disgusting. ..","commenter_a":"Nothing racist about my comment! i simply wouldn't have called anyone to help. Now be mad if you like so what because","post_message":"WOW! A police officer collapsed on the job. The teen in handcuffs whom he arrested was sitting right there.   What the teen did next saved the officer’s life. See here:"},{"comment_id":"10155088338670615","commenter_b":"The fact he did beaky at Buckingham Palace means he has risen in my expectations.","commenter_a":"Jamie Taylor","post_message":"We ♡ Stephen Fry! Congratulations to the happy couple!  @webpagelink"},{"comment_id":"10152634683050779","commenter_b":"Could be great, i hope so.","commenter_a":"Woohoo!!","post_message":"In a stunning announcement today, Blur have revealed plans to release their first new album in over a dozen years, titled 'The Magic Whip.' UPDATE: Click through to listen to the new song \"Go Out\" and see the track list for the album."},{"comment_id":"1094342837275269","commenter_b":"She ain't coming back","commenter_a":"I love Jessica Lange","post_message":"Jessica Lange announced that four seasons of 'American Horror Story' was enough and she will not return.   The star of the first four seasons of 'American Horror Story', Jessica Lange, announced that she has no desire to return to the show. Lange will however return to FX in the show 'Feud'   One actress entering her fourth season of the show that announced she will be returning is Angela Bassett. Watch Angela Bassett talk season 6 of 'American Horror Story'."}]
