[{"comment_id":"10154986550662767","commenter_b":"@username DO SOME RESEARCH, BITCH!","commenter_a":"I hope he meets a terrible demise. Like I am talking, Isis style, execution. In high definition, with fabulous audio. Now, I would read THAT book, for sure. I wish nothing but the worst, to this radical islamic Kenyon born, Isis daddy! I wonder what chapter of the book describes Michelle, peeling off sweaty duct tape, and revealing the SCHLONG, that MADE THE FREAK BATHROOM BILL? Trump is wiping any, and everything, this TERRORIST has done. #HeDontMatter #GhostPresident","post_message":"Obama is widely expected to get the most lucrative contract ever for a post-presidential memoir."},{"comment_id":"1149773515076812","commenter_b":"Hillary should be in prison.","commenter_a":"Intelligent much??? I heard she said he was like an octopus...with six arms...omg","post_message":"OOPS! HILLARY'S HIT WOMAN LIED About Trump Groping Her…Eye-Witness Comes Forward: \"It was she that was the one being flirtatious”"},{"comment_id":"10153553147025927","commenter_b":"Send her into orbit!","commenter_a":"Racist","post_message":"Apparently Whoopi doesn't care if the DNC rigged the system. Why? Because it's against a white guy. #DNC2016"},{"comment_id":"1746288005610861","commenter_b":"Women do not get kicked out of restaurants because their children cry. What world do you live in ?","commenter_a":"Whatever. If that kid was crying in the middle of some restaurant & the owner told the mother to leave for the sake of the rest of the patrons he'd be applauded. Taking a baby to a political rally is as foolish as taking a baby to a Slayer concert. The exception being Slayer fans are far more courteous than the average politcal junky.","post_message":"\"I think she really believed me that I love having a baby crying while I'm speaking. People don't understand.\""},{"comment_id":"1241740062517749","commenter_b":"Keep Hillary & Bernie OUT OF MY STATE!","commenter_a":"Sauce","post_message":"Donald Trump speaking in Denver at Western Conservative Summit"},{"comment_id":"10154151078661002","commenter_b":"Oh please just remember who killed the most Americans on American soil they were not Black or White that's what's wrong with this country if we banned together we would never worry about muslim terrorist! They wouldn't stand a chance against the blacks and whites of America","commenter_a":"Because he's a pale person his information is not even released yet","post_message":"3 dead in Lafayette theater shooting WATCH: @webpagelink #Local4Today"},{"comment_id":"10153291330611770","commenter_b":"Sorry to hear this!","commenter_a":"when we have a women president this is the gal I would vote for she is smart and very much better looking then Hillary. Really!!!!!!!!","post_message":""}]
