[{"comment_id":"10157252417295354","commenter_b":"TRUMP...Build that wall!","commenter_a":"Ten accused, 3 convicted, 2 still not apprehended. One was going to use his \"Federal Education Aid\" money. Didn't see their citizenship status though. Planned to show ISIS how easily they can cross through our Southern Border. What say critics of a wall or temporary ban of refugees now?","post_message":"They're here."},{"comment_id":"1563946600332130","commenter_b":"she says she all for kids but she can not hide the truth","commenter_a":"If a woman walks around spewing F!#K the way she does you damn sure don't want her to be president, hell I don't even want her as a friend","post_message":"This is the REAL Hillary Clinton, folks!"},{"comment_id":"856883727746819","commenter_b":"She's a lame person...disgusting!","commenter_a":"c'mon and drink the kool-aid already!","post_message":"\"They are not a basket of anything. They are Americans and they deserve your respect.\" Today, Mike Pence slammed Hillary Clinton's \"basket of deplorables\" remark, stating that \"no one with that low opinion of the American people should ever be elected president of the United States of America.” @webpagelink"},{"comment_id":"470527006471213","commenter_b":"This lady thinks she is the president,this too shall pass just like her food for the kids at lunch time.","commenter_a":"I still want to know who elected the bitch","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10154017510261336","commenter_b":"I NEVER SEE THIS KIND OF PLANNED HATE TO DONALD TRUMP OR DOCTOR CARSON AND NOT TO OBAMA OR SOCIALIST ILL SANDERS OR HYENA CLINTON... NOBODY IN CNN OR ISLAM PAY MEDIAS NEVER ASK DEMOCRATS... WHAT SOCIALIST COUNTRY IS DOING BETTER THE U.S.A. ....WE DON`T NEED SOCIALISM OR ISLAM LAWS ,,SOCIALISM LEECHES SUCK CAPITALISM LIKE CUBA FOR 65 YEARS SUCKING FLORIDA MONEY TO CUBAN GOVERNMENT AND PEOPLE ...WHAT A ZOMBIES IGNORANT DEMOCRATS ARE ....NOW EVERYBODY CAN SEE THE FUTURE IF TRUMP WIN THE WHITE HOUSE... BUT NOBODY CAN IMAGINE OR SUGGEST THE DESTRUCTION THAT MUSLIM LEADER OBAMA ALREADY DONE IT ..OBAMA`S ACTION ALWAYS BENEFITS HIS RACE ISLAM ,SOCIALISM ,BLACK CRIMINALS ,OUR MONEY SEND TO HELP ALL PLANET BUT NOT THE TAX PAYERS....OUR CONSTITUTION IS BY FAR THE BEST GIFT TO HUMANS FREEDOM ....AND CAN YOU BELIEVE ME I`M NOT GETTING PAY FOR DOING THIS I CALL THIS THE POWER OF ...","commenter_a":"And the lobbyists and special interest groups Bush, Trump 2016","post_message":"Jeb Bush said to defeat radical Islam, we \"shouldn't have the warfighters have their arms tied behind their backs.\" Do you agree? #GOPDebate"},{"comment_id":"679630052167782","commenter_b":"She needs to be deported.","commenter_a":"i think you belong over there","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"},{"comment_id":"485272544994977","commenter_b":"I'm so sick of her","commenter_a":"So says the compulsive liar.","post_message":"The video shows Hillary Clinton snapping at an activist and calling out the Bernie Sanders' campaign for lying."}]
