[{"comment_id":"10153278538947293","commenter_b":"Mark no I meant auto, you just need a permit which is easy to get in Oregon","commenter_a":"For most of you who have never heard of Roseburg and are assuming that ucc and \"Umpqua\" are gun free areas...1: You are ignorant.. 2: Umpqua isn't a city it's a forrest that spans way farther than Roseburg and 3: Off the top of my head, I can think of at least 10 public places (that are NOT shooting ranges) in a 5 mile radius of ucc that people normally goto to discharge their automatic weapons.","post_message":"A U.S. official has identified the gunman in the Oregon community college mass shooting as Chris Harper Mercer."},{"comment_id":"10153464063176509","commenter_b":"Don't correct what I wrote, Gail Mac! Mind your own business. Sarah Palin has no intelligence at all!","commenter_a":"Why her, can you not find someone better with no baggage and have a mother who has no brain.","post_message":"Bristol Palin and Medal of Honor recipient Dakota Meyer are engaged. Meyer, a Marine who received the nation's highest military honor, announced the news on his Instagram account. @webpagelink"},{"comment_id":"10155182405833984","commenter_b":"The only sane thing this woman has said in years","commenter_a":"YES !!","post_message":"Nancy Pelosi just dropped a lot of jaws with what she had to say about impeachment. Donald Trump will definitely want to hear about this..."},{"comment_id":"1745160079101455","commenter_b":"No, I am convinced she has a serious mental health issue. She lies and lies about lying. She questions your temperament to lead? She is the psycho, literally, staying with her husband solely for political purposes while constantly defending her indefensible record of blatant corruption. And for what? Her relentless pursuit of more power to abuse. Hillary is not mentally fit to lead","commenter_a":"she looks sedated","post_message":"Bad performance with foreign policy \"speech\" yesterday, by Crooked Hillary Clinton! Reading poorly from the telepromter! She doesn't even look presidential!"},{"comment_id":"537911889728124","commenter_b":"Public service would be great; picking up road trash; working in the parks; finding real jobs and repaying money bilked from you and me. OR, whatever; probably don't need to put them in already over-crowded prisons; make them work, not get free room and board in jail.","commenter_a":"Yes indeed","post_message":"It's about time! Do you think all welfare abusers should be arrested?"},{"comment_id":"1009448912521620","commenter_b":"I'm sick of seeing her scrunched up \"end of her world\" face. She and the others like her are the problem. Sorry cupcake, grow up and accept it.","commenter_a":"I dont see how any employer would want to hire these idiot mellinials.they dont think for themselves.they dont research for the trueth basicly you dont want morons working and running your buisiness.","post_message":"Ummm... WHAT?"},{"comment_id":"1049253181797877","commenter_b":"So HRC YOU WILL NEVER WIN CALIFORNIA @webpagelink","commenter_a":"Hillary,we want you back at the White House!!","post_message":""}]
