[{"comment_id":"10155131143925389","commenter_b":"Can't deport an American born stupid","commenter_a":"In a Court of law your reporting would be \" hear say \" Sean","post_message":"One of the two brothers suspected of gunning down 12 people in Wednesday’s attack in Paris traveled to Yemen in 2011, where he was in touch with Al Qaeda training camp leaders, U.S. officials told Fox News."},{"comment_id":"10154638798186336","commenter_b":"Neil Cavuto ...per this morning's discussion: people killed on the highway not same as being murdered by immigrants...who over stay, are not vetted or are illegal!! How many of the 15 9/11 killers fit these descriptions...and we sacrificed the lives of many in order to accommodate immigration. Immigration is not in the Constitution...we need strong laws, enforcement and a wall!!","commenter_a":"dead people make it a war.","post_message":"On \"FOX & Friends Weekend,\" Dr. Sebastian Gorka commented on Donald J. Trump's approach to radical Islamic terrorism."},{"comment_id":"675938265864099","commenter_b":"@username you wish your wife could be a go go dancer.","commenter_a":"Melania is an absolutely classic beauty. Proud of our new President and First Lady. May this country start healing and become whole again.","post_message":"Donald J. Trump was just sworn in as the 45th President of the United States.   How does this make you feel?"},{"comment_id":"10152813313326523","commenter_b":"Glad everyone shared that video and got this no good nasty tramp bitch arrested!","commenter_a":"Black lives matter","post_message":"“It’s almost like they plan these fights, they want these fights to be on tape where they can put it on social media. This is horrible.”"},{"comment_id":"10153085333861336","commenter_b":"Go back in the basement and smoke another duby.. This is an adult conversation sight.","commenter_a":"If Israel has nukes Iran should be able to as well. However, in a perfect world neither country would have them, as Israel has threatened to use them and Iran is a loose cannon.","post_message":"CIA Director John Brennan discusses ISIS, Iran’s nuclear program and Putin’s global ambitions, this week in a 'Fox News Sunday' EXCLUSIVE!  Check your local listings and tune in to Fox News Channel at 2p and 6p ET."},{"comment_id":"666187176847797","commenter_b":"Too much butt kissing being done. The pilot and his white privilege remark, the seat mate's skin color even being mentioned, the flight attendant feeling compelled to apologize...oh, brother! This chick needs to put her big girl panties on and if she's a peace loving/seeking person, she'd drop the whole issue.","commenter_a":"So let all muslims boycott United, I will feel much safer with them not being there. Muslims are lower than whale shit.","post_message":"Look what happens when a flight attendant refuses to give a Muslim woman a Diet Coke..."},{"comment_id":"10152869817141130","commenter_b":"Sounds like you're a bitch who can't take a compliment.","commenter_a":"Maybe because when men try to pick me up it goes like this: Them: \"Hi, gorgeous.\" Me: \"F*ck off.\"","post_message":"\"It's not that I'm opposed to meeting someone. I just don't feel it's necessary.\""}]
