[{"comment_id":"1788613674701059","commenter_b":"Shut up hoe","commenter_a":"It amazes me how rude some of you people can be . They're having a fucking child! Like come on now , stop being so immature talking about ' he's carrying the baby , ' or ' his girlfriend looks like a man'. Smh people 😒😑. Congratulations Dj Khaled & Nicole Turk ❤️","post_message":"Baby Alert!"},{"comment_id":"1113541475361229","commenter_b":"Killary is a delusional lying bitch","commenter_a":"No Trump was right on","post_message":"Clinton: 'Donald Trump spent his time attacking when he should have been apologizing' at the debate. Agree or disagree?"},{"comment_id":"10153138744168487","commenter_b":"Criminals will find anything, they're criminals after all. If they could kill you with love they would do! More guns will never make any situation safer; regardless of the victim feels they would have been safer with a gun. Chances are a criminal will know how to use one and you won't. Guns should be outlawed on a whole not made readily available to whoever wants one.","commenter_a":"so does higher rates of car ownership.","post_message":"A reminder from 2014 that higher rates of gun availability correlate with higher rates of female homicide."},{"comment_id":"10154394358144062","commenter_b":"I don't trust these hoes","commenter_a":"'According to the police report, Crowley was intoxicated and made inconsistent statements about Manziel's actions. ' Dem hoes!","post_message":"Johnny Manziel could face NFL discipline for Ohio incident..."},{"comment_id":"1701440090108890","commenter_b":"They jeer at Cruz. Call him 'politician.' What they surely remember is the way Cruz sucked up to Trump in the early part of the campaign. 'Lyin' Ted' sticks because Cruz seems two-faced.","commenter_a":"All Cruz did was bash Trump. What a looser.","post_message":"'He's gonna put a liberal on the Supreme Court. He's going to take away your Second Amendment rights. This man is lying to you and he's taking advantage of you.' -- Ted Cruz to Donald J. Trump supporters in Indiana today"},{"comment_id":"699563113502060","commenter_b":"I don't like killing of animals or anything what soo ever..... but.... i don't mind hunting to Feed your family.. its just hunting for sport that i hate with a passion","commenter_a":"It doesn't matter how I feel about this! They are free to do as the law allows. My opinion is: this is awesome!","post_message":"How do you feel about this?"},{"comment_id":"1181219778640173","commenter_b":"She's crazy!","commenter_a":"she needs to fall on the other side of her face","post_message":"Typical Hollywood liberal elite, who compares everything she doesn't like with the Nazi regime."}]
