[{"comment_id":"10153427375089726","commenter_b":"this brain dead old witch needs to be in a mental ward","commenter_a":"Congress can deny funding and they better. Premiums are going through the roof . Supreme are bunch of liberals out of touch with the average folks.","post_message":"According to Pelosi, Scalia ... joined the majority?  @webpagelink"},{"comment_id":"905141892877096","commenter_b":"You are a gruberized voter.","commenter_a":"Based on the polling from this thread Roy should keep his money and not bother to get re-elected. @webpagelink","post_message":"Missouri was one of the first states in the nation to reject President Obama’s fundamentally flawed health care law. For the past five years, I’ve heard from countless Missouri workers, seniors, and families who are facing higher costs and fewer choices due to the president’s health care take-over. As we mark the 5th anniversary of #ObamaCare becoming law today, I’m still fighting to repeal this flawed law and replace it with common-sense health care solutions."},{"comment_id":"545668025630703","commenter_b":"Lock her up...","commenter_a":"Mrs @username President 2016 Women had no rights to vote. Just see how far women has come. Pervert Donald Trump discriminate women and abuse them sexually and when they dont give in. he trash talk them what sick beast he is. If this pervert wins you women becomes his slaves Vote for Freedom Mrs @username President 2016","post_message":"A note on Director Comey's letter, from Hillary for America Chair John Podesta. Chip in now to say you're standing with Hillary: hrc.io/donatenow  \"By now, you've probably heard some news about a bewildering letter sent to Congressional leaders by the Director of the FBI. This is all a bit confusing, and much of the reporting has been misleading or downright inaccurate, so I want to take a minute to walk through this.   Here's the quick backstory: In July, FBI Director Jim Comey concluded a year-long investigation by deciding not to go forward with any case about Hillary's emails. It wasn't even a close call, he said. In his words, 'no reasonable prosecutor' would have brought charges.  Yesterday, in a surprise to us all, Comey wrote a very strange letter to Congress that was long on innuendo and short on facts. He said that in a completely separate investigation, the FBI had found some emails that may or may not be related to Hillary, and indeed may or may not be significant at all.  It's being reported that Comey sent this letter over the objections of Department of Justice officials who told him that it was inconsistent with longstanding policy of both Democratic and Republican administrations not to take action that might impact an election. It's an unprecedented intrusion into a close presidential election with less than 11 days until Election Day.   Voters deserve answers.  Comey needs to come clean with the American people about what he found and answer all the questions about why he took this unprecedented step less than weeks before the election.  Here's what this changes for you and this campaign: Absolutely nothing.  The facts be damned—Trump's always shown a complete disregard for the truth. In spite of there being no new information, he's already raising money off the bizarre letter (he literally sent a text message asking for money within an hour of the story breaking!) and he's more fired up than ever on the trail today.  These are the actions of a desperate man. Trump knows he can't win on his character, temperament, or his policies. He's behind, so he'll cling to whatever he can. We can't let him get away with this.  Our organizers and volunteers on the ground are rallying behind Hillary in what will be the biggest volunteer weekend of the campaign so far. You need to have her back, too. You need to say you're not willing to let Trump bully or buy his way into the presidency, and you're not going to let anything stop us from making history.  There are ten days to go. Let's buckle down, stay focused, and win this. Chip in here: hrc.io/donatenow\""},{"comment_id":"10153486509166320","commenter_b":"Stupid woman. Don't vote for her just because she is a woman. You voted for a color. Remember...","commenter_a":"And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course ‘lest we forget’ what has happened to many “friends” of the Clintons. 1- James McDougal – Clinton’s convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr’s investigation. 2 – Mary Mahoney – A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown.. The murder happened just after she was to go public w:th her story of sexual harassment in the White House. 3 – Vince Foster – Former White House councilor, and colleague of Hillary Clinton at Little Rock’s Rose Law firm. Died of a gunshot wound to the head, ruled a suicide. 4 – Ron Brown – Secretary of Commerce and former DNC Chairman. Reported to have died by impact ...","post_message":"Hillary Clinton held her first major rally of her 2016 presidential campaign on Roosevelt Island today. She called for a new era of shared prosperity in America and told supporters that workers can trust her to fight for them."},{"comment_id":"10153830910205695","commenter_b":"Unfortunately he's correct. Totes second ship found some things in the ocean that they believe belong to el faro","commenter_a":"It's obviously on the bottom of the ocean.","post_message":"Loved ones aren't giving up hope, despite a life ring being found."},{"comment_id":"597841083739804","commenter_b":"OBAMA IS THE SAME ALL ARE THE SAME CORRUPTS AND CRIMINALS WHAT HAPPEN IS PEOPLE WANT'S TO BE CORRUPTS AND HAVE POWER AND ABUSE OF POWER THAT IS WHY THEY LIKE THEM CONGRATULATION LOOK AT THE WORLD HOW IT LOOKS AND THINK A LITLE NOT TO MUCH AND SEE WHAT IS GOING ON","commenter_a":"Damn right!","post_message":"George W. Bush was right, there were weapons of mass destruction.  We always had his back. He is a great man, and a true patriot.  Do you support George W. Bush?"},{"comment_id":"883919521667797","commenter_b":"newsflash, genius. there's a bunch of dumb females already in ISIS.","commenter_a":"no female should be deployed where isis are, you are just asking for trouble.","post_message":"Kayla Jean Mueller, 26, traveled the globe fighting genocide, AIDS and domestic abuse."}]
