[{"comment_id":"10155061741852491","commenter_b":"Drain the swamp!!","commenter_a":"He needs to just let all former Obama people go. He tried not to cause a stir by dismissing everyone from the get go because the media and liberals would have had a hay day as they do with everything else. But now, it's obviously a huge issue. Let them all go asap!","post_message":"A former Pentagon official says 'nothing short of prison is enough' for the culpable officials."},{"comment_id":"10154322380197217","commenter_b":"I'm just surprised he didn't grab her in the pussy","commenter_a":"Anyone else shudder when he leaned in to kiss Michelle Obama?","post_message":"Hugs and a gift. The Trumps meet the Obamas at the White House   #InaugurationDay   bbc.co.uk/inauguration"},{"comment_id":"10153605944168984","commenter_b":"No more abortions no more planparnthood","commenter_a":"My niece had a baby at four months completely formed , she is still so sad about it death , they held and took pictures. I don't know how this is not murder in the womb ? Cause a abortion is! !!","post_message":"Even with all evidence going against them, Planned Parenthood keeps on coming out with one unbelievable excuse after another.  Do you think it's time to defund and get rid of Planned Parenthood?"},{"comment_id":"10153103857862377","commenter_b":"I think a woman who has been victimized should be allowed to regain control of her life. She should not be required to Continue a pregnancy she doesn't want","commenter_a":"But what about the women in those cases! Shouldn't they be in control of their bodies after being violated so inhumanly? Of course they should! I just lost lots of respect for you! You can't make judgements on those women or decisions for them! Someone has to stand up for them!","post_message":"\"Rape and incest, I would not be in favor of killing a baby because the baby came about in that way. And all you have to do is go and look up the many stories of people who have led very useful lives who were the result of rape or incest,\" Carson said."},{"comment_id":"604736083067982","commenter_b":"Duuude, no he doesnt. He definitely and truly does not mean that. From the bottom of his good heart he really doesn't want people to support her fracking, wall Street, lying ass.","commenter_a":"Love ya Bernie but, not a chance in hell I will give that pos garbage my vote! Not like it matters anyway I have lost all faith in the US government and any honesty within.","post_message":""},{"comment_id":"1192124507480431","commenter_b":"I will!","commenter_a":"Call Congresswoman Cheri Bustos' DC Office at (202) 225-5905 and tell her to vote NO! on the TPP... The house of representatives will be voting on the measure tomorrow (Thursday).","post_message":"It was a pleasure to meet with the talented young people who are in town with the Illinois Electric Cooperatives' Youth to Washington Tour today!"},{"comment_id":"10153999668791756","commenter_b":"Rapists and murderers... Yeah, idgaf about them. Kill them right away and stop wasting tax payer money.","commenter_a":"Not only 27. 27 too many. How many people were proven innocent after decades of being in jail?","post_message":"\"We get it wrong sometimes, and in the death penalty, we just can't get it wrong.\""}]
