[{"comment_id":"1226487637389708","commenter_b":"Just remember when your ass gets beat up coming to my town... U started this shit. I bet your wife's dick is bigger than yours","commenter_a":"Hillary gonna win.....trump will be doomed....after his rape case and so many other Court appearances he will be in jail along with the other republicans...","post_message":"CAN'T WAIT!"},{"comment_id":"10154459591051320","commenter_b":"A Man hungry woman will sale their children's soul to keep a man at whatever price...Sad to say ...but true.","commenter_a":"I don't get how the mother didn't know. I'm sure this poor little girl had to be showing signs of withdrawing from people, especially him. She had to be acting different. Jesus this was going on for 5 years under this woman's nose. It's so sad that this child had no one to go to and kept this secret up to this point. I pray they don't let her have this baby. And for all you right to lifers, I'm sorry, this is a 13 year old child who shouldn't be expected to keep a baby resulting from a rape, when she's a baby herself. I pray that she doesn't have severe emotional scarring and other issues. Poor child... Smh. As for the POS, I hope they split him in half in prison and he bleeds to death.","post_message":"Disgusting: Police say Mark Sutton had been raping his girlfriend's daughter since she was 8-years-old. The mother found out when she took her 13-year-old daughter to the hospital and discovered she was four months pregnant."},{"comment_id":"817253511741162","commenter_b":"@username she isn't running. Stupid! Trump's wife is a ditzy bimbo... Not relevant.","commenter_a":"Hello!!! The Liberals are the ones voting for him. He is a danger to our country. I know many Conservatives who feel the same way about this democrat posing as a republican. Don't be stupid with your vote. The Liberals will still want to leave over Cruz being elected. Why not go that route? Or change your page to the Comical Former Conservative.","post_message":"Rosie and Whoopi too......one can dream..."},{"comment_id":"1000268296676215","commenter_b":"Bitch she's a nothing","commenter_a":"Must you keep posting that mug? We are offended just looking at her and her husband ( POOR EXCUSE FOR A PRESIDENT! )","post_message":"Michelle Running Campaign To Ban ‘Offensive’ Word From English Language. She has completely lost it. Do you find Michelle Obama offensive?"},{"comment_id":"1150301004990909","commenter_b":"Awww don't be jealous little bitch","commenter_a":"Hahaha typical chicken shit Americans","post_message":"For the first time in twelve years the United States has experienced a death from measles."},{"comment_id":"10152952940506336","commenter_b":"Atheist uses god to make money, praise the atheist!","commenter_a":"God uses atheists to spread his Word! Praise the Lord!","post_message":"Atheist Trevor McKendrick is capitalizing on a religion that he doesn't believe in."},{"comment_id":"10153464911441438","commenter_b":"And What was the point of that weak made up story? if a girl offers a blow job for a ride and decides not to give it, you're still not allowed to rape her. You can tell her to get the fuck out of your car, but no absolutely nothing in her behavior made her deserving of rape. Even if she got in the car ass naked.","commenter_a":"Sexual consent: latent sexism, in the flesh. Hey, bitches, I heard there is a drunk girl on the corner who doesn't want to walk home. Because she is an entitled whore, you taught her that it was ok because whatever she feels is more important than fact, she decides to solicit a random passerby in a car. \"I'll give you a blowjob for a ride,\" are her words. Yet, that interaction, with all of its attendant suggestions & latent sexism & the very fact that it would not have happened without HER initiative, is somehow NOT her responsibility. That's the latently sexist, bullshit truth of femifucktardism & all of you self raping bleeding gashes. 90% of the time, anyway. Protect me because I'm a whore with a bleeding gash and I have to have protection because of the biologically driven imperative, but don't hold me responsible for ANY of my ...","post_message":"Owen Labrie is guilty of sexual assault, but not rape. What?"}]
