[{"comment_id":"10154663245784657","commenter_b":"Who wants to watch a liar. He is so delusional, he should have been removed from office years ago. Except Congress has no spine !","commenter_a":"Heard one from this 'fella, you've heard them all !!! Only said \"I\" 84 times in this one, --- he's gettin' better ???","post_message":"Obama, the celebrity president, may not be as popular as he thinks he is."},{"comment_id":"10153119692871130","commenter_b":"ughhh these bitches Emily Lee","commenter_a":"Can't wait!","post_message":"See how far women's rights have come in the first trailer for one of the year's top Oscar contenders: Suffragette, starring Carey Mulligan, Helena Bonham Carter and Meryl Streep."},{"comment_id":"915235905266169","commenter_b":"Womanizer","commenter_a":"The hundreds of thousands of people, millions voting for Trump are not going to vote for any other GOP candidate. If this chick succeeds in unseating Trump, she might as well work for Hillary Clinton. When American voters votes no longer count, it's no longer America","post_message":"Kendal Unruh is trying to do what 16 Republican presidential candidates and at least three super PACs spending more than $20 million could not do: take down Trump."},{"comment_id":"954260038007303","commenter_b":"Shut up pain your wife's ugly","commenter_a":"@username 1254149964595086mond DeBusschere @username @username reminds me of the good ol days at the barracks","post_message":"Friends like this #WSHH"},{"comment_id":"10153348176116336","commenter_b":"I agree, some women go buy the biggest bag purse in addition to the over stuffed carry on.","commenter_a":"What they need to do is ENFORCE their rules now! I've seen people get on with HUGE carry ons! Just saying!!","post_message":"Will you buy new luggage if the world's airlines change their carry-on requirements? (via Fox Business)"},{"comment_id":"10153323281663854","commenter_b":"Only if she wants to end up 6 ft under, so he can be president again","commenter_a":"They can run together in the yard at Gitmo.","post_message":"NO JOKE: Democrats Are Now Calling for Hillary Clinton to Name Barack Obama as Her Running Mate…"},{"comment_id":"1342964245730921","commenter_b":"Yes, Hillary ALL THE WAY!! Andrea, go away!!","commenter_a":"She asked the tough questions and Hillary was very professional and gave very informative answers. All together I think it's helped her giving this interview. Trump could never have been so poised with his answers. I think she has been doing great with her campaign. Hillary 2016","post_message":"This is not journalism by any measure."}]
