[{"comment_id":"569159163208677","commenter_b":"Ohhhh....the irony. An 'upgraded' fence around the WhiteHouse to keep 'intruders' (i.e., we the legal citizens of the U.S.) out, but Obama and Hitlery refuse to support fencing our borders to keep illegals out. SMH","commenter_a":"Voting Trump a real American","post_message":"President Obama just unveiled the new White House fence and a lot of people are upset. This new design feature has Americans demanding it be torn down."},{"comment_id":"10153831793476438","commenter_b":"Celine O'Hara maybe you are the one biggest fucking idiot !!!","commenter_a":"After he was done introducing Trump, I fully expected Trump to say to him, \"Now shut up and go home.\"","post_message":"Will somebody please help Chris Christie? Seriously: Is this a hostage situation? @webpagelink Christie does not seem to enjoy serving as Donald Trump’s hype man. Like, not at all. Do you see any hint of joy as he introduces Trump at his press conference in Palm Beach tonight? This is a hostage who is reading a statement with a gun pressed to his back."},{"comment_id":"513241782197365","commenter_b":"Drop dead bitch","commenter_a":"Hillary just wants to be HBIC (Head Bitch in Charge)... and she will do anything to achieve her goal... including murder!","post_message":"I don't think we can take a risk on a ________ like Hillary Clinton."},{"comment_id":"10154865700468256","commenter_b":"Aaaaaaannnnndddd just fortifying my position even more!! Lmfao!","commenter_a":"I sit back, a giggle my butt off at all these liberals grasping at straws to stop Donald Trump. Such hypocrites, because just 8 years ago when Obama was elected, they were so critical of the \"birther\" cries from conservatives...... I guess when your horse loses the race, you go chasing unicorns!!","post_message":"Pressure on members of the electoral college to select someone other than Donald Trump has grown dramatically - and noisily - in recent weeks, causing some to waver ahead of the Monday vote."},{"comment_id":"10153794621104726","commenter_b":"Thats the REAL ISSUE here..PRAYER and FAITH ..these guys are so far remoived from G-d its pathetic..This all has to do with the men in POWER.....has been since the beginning....even satan wanted to be above our creator..these followers of satan are no different","commenter_a":"Still another reason I'm a pub!","post_message":"Democrats come out against God"},{"comment_id":"10153989923308854","commenter_b":"I hope the refugees stay with Obama... His wife and girls should get what they have planned for woman al over..","commenter_a":"ObamaNation only a socialist democratic liberal would create this program. Bernie Sanders love's this unconditional illegal ruling. $9.000 a year NOT to committ illegal crime. Who says crime doesn't pay. After WIC EBT HUD cash aid free ObamaCare medi medi welfare and food stamps total cost to the taxpayer's is over $50.000 a year. What's the incentive to work.!!!!!!! @webpagelink","post_message":"ISIS Promises to BEHEAD OBAMA and Transform America Into Muslim Province"},{"comment_id":"875483499177795","commenter_b":"It doesn't fit their \"outrage\"","commenter_a":"Where's the GoFundMe link? Her business is a non-profit, they feed the hungry, her organization deserves a lot more than a pizza parlor in Indiana. FoxNews, where is your outrage over this?","post_message":"Republicans don't want government to feed poor people. They want charities to do it. So, what happens when a chef who runs a charity steps up to the plate?"}]
