[{"comment_id":"10153993909761491","commenter_b":"A women should be happy she has big tits-men will ne ef stop looking at her","commenter_a":"I got chastised by a femminest about 3 months ago for saying that it was a crime against man","post_message":"\"I chose surgery because of how I felt, not because of what anyone else thought.\""},{"comment_id":"10154005970128967","commenter_b":"I was just about to tag you in this haha","commenter_a":"Jack explains why he wanted out of Star wars :(","post_message":"It's no myth, Harrison Ford and Steven Spielberg are bringing Indiana Jones back."},{"comment_id":"10154077939321636","commenter_b":"Oh and they found no drugs in her system. She was just another drunken slapper who thought she could get rich quick with this story. Oh well it's backfired. Good on him for fighting!","commenter_a":"Might have been found not guilty of rape but his actions on the night highlight that he is a the very least a sexual predator of women and his partner is a disgrace for standing by him, but hay ho she might be into that sort of thing!!!","post_message":"The judge gave the jury a 'route to verdict'"},{"comment_id":"10156237879600594","commenter_b":"Her posture? She's not modeling, she's out on a boat with her nieces. I doubt they would have been in the picture if the intent was to be \"sexy\". She wearing a bathing suit. So what?","commenter_a":"The body is fine, the bikini is ugly and her posture is horrible.","post_message":"Ariel Winter takes the online hate and spins it into a message for all the bullied girls out there: \"YOU ARE BEAUTIFUL\""},{"comment_id":"10154155058901770","commenter_b":"Yep just what I thought!! Gets her hair color from a bottle! And still stupid","commenter_a":"I think melania trump should be taking clothing tips from a real Material Girl","post_message":"Madonna slammed Trump supporters, calling them “lazy and “un-unified.\""},{"comment_id":"10154689577603812","commenter_b":"He also has many lawsuits in the 80's and 90's for discrimination against blacks and people of color.","commenter_a":"TRUMP STOOD UP FOR BLACKS AND JEWS: About 20 years ago the rich elites ran Palm Beach and wouldn allow Jews and blacks to use the golf and country club facilities. When he bought Mar-a-lago, MR. TRUMP WENT TO COURT TO END THAT DISCRIMINATION, won in court and forever changed how minorities are treated in Palm Beach. That THE REAL Donald Trump. What has Hillary or ANY politician done? @webpagelink","post_message":"A potentially record-breaking gap between two groups marks one of the most striking elements of preferences in the 2016 presidential race: college-educated white women for Hillary Clinton vs. non-college white men for Donald J. Trump."},{"comment_id":"981141605287036","commenter_b":"She belongs in a freak show. Why do people do that to their self.","commenter_a":"How disgusting I wouldn't hire you","post_message":"Americas Freedom Fighters"}]
