[{"comment_id":"883127565153756","commenter_b":"We have aspects of both a Republic, and a Democracy","commenter_a":"We will never know the truth.","post_message":"I really hope everyone on Facebook reads this."},{"comment_id":"10153404609274170","commenter_b":"I use roaches. She is like a roach, nasty.","commenter_a":"Good news here .. 57% *of* 47% only comes to 26.69% overall. This places me among the 73.31 who think she's a lying skunk (and those are her good points).","post_message":"53% of voters say Hillary is not trustworthy. ...But 57% of Dems still support her.  Why?"},{"comment_id":"1082800578422029","commenter_b":"She can squat but that don't put bread on the table!","commenter_a":"who makes up these polls for you ?","post_message":"BREAKING"},{"comment_id":"10153908601902629","commenter_b":"Bye bye, bitch!","commenter_a":"Hope Cliven doesn't have any horse shit on those fancy kickers","post_message":"Cliven Bundy, the Nevada cattle rancher who birthed the Oregon militia movement in more ways than one, was arrested last night on felony conspiracy charges after he tried to join the standoff."},{"comment_id":"915165211871817","commenter_b":"'@username guns don't kill. Stupid demonRATs with guns kill.","commenter_a":"You're doing great, Bernie!","post_message":"“This may not be great politics, but I think the Secretary is right. And that is that the American people are sick of hearing about your damn emails.' -Bernie #DebateWithBernie"},{"comment_id":"1155155194501829","commenter_b":"Get over it. There are two different justice systems, if not more; operating within one....","commenter_a":"white privilege","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1675805602436783","commenter_b":"Wicked prick!","commenter_a":"That is what happens when you try to work 'across the aisle' with a group of people that have no desire to work with you.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
