[{"comment_id":"10153888700337464","commenter_b":"You gotta get all the brainless and illegals to stop voting democrats, its the democrats that arm criminals but prevent legal law abiding people to legaly arm themselves","commenter_a":"What happened to carson?","post_message":"Justice Scalia’s passing tonight underscores the stakes of this election. Voters must determine who on this stage has the judgement to nominate and confirm principled constitutionalists to the court."},{"comment_id":"10154065483921770","commenter_b":"Welfare mothers make better lovers","commenter_a":"So does America. America doesn't revolve around the Clintons as they think it does . America is sick of them","post_message":"Even MSNBC is sick of hearing the Clintons' excuses: \"Seriously. Nobody cares. The game’s over. They lost.\""},{"comment_id":"544174485780052","commenter_b":"Go to hell. She won. Petulance Is ugly.","commenter_a":"Bernie supporters had been saying for at least the last year prior to the election that if we get $hillary as the Dem nominee, we get Trump as the next president. We fucking told you so, America. We said this, and it happened. For the record it doesn't feel good, and the vast majority of us wish harder than anything that we could have been wrong about this. No one is gloating; we're pissed.","post_message":"Supporters of Bernie Sanders never got their chance to prove if their candidate could have defeated now President-elect Donald J. Trump."},{"comment_id":"1211860118868990","commenter_b":"Hopefully Bernie can take control of congress, and we can keep moving this country forward! #DontPushAmericaBackwardsAgain","commenter_a":"It's gonna be ... Huge ...!","post_message":"I hope today we defeat Donald Trump, and we defeat him badly. iwillvote.com"},{"comment_id":"662013840614058","commenter_b":"Give Texas back to Mexico!","commenter_a":"How ignorant. It is against the law. I would hope that the sane people in Texas vote these idiots out of office as soon as they can.","post_message":"This time they may actually do it...."},{"comment_id":"434228700035058","commenter_b":"Why so illegal immigrants can collect our money??? I think u should have to prove that you' have worked for 20 yrs or more to collect","commenter_a":"Also give thanks to Bill Clinton who signed the bill making it legal to outsource jobs here.","post_message":"Jeb Bush wants people to work until this age. I'm sure this will raise some eyebrows."},{"comment_id":"1033927403316825","commenter_b":"Good! Hopefully this will deter those damn anti-vaxxers from using Facebook and spreading their total stupidity. One can dream.","commenter_a":"Hip hip hor ehhhh","post_message":"Three cheers for Mark."}]
