[{"comment_id":"389381401250154","commenter_b":"Well go home and get oyt of AMERICA ,no one made you come here and no one wants you here !!!!!","commenter_a":"Is Obama seeing this! Maybe He's the Antichrist.","post_message":"Muslim Leaders Show How ALL Muslims really think...."},{"comment_id":"10152796011681130","commenter_b":"That's right. You. Cant Your not a football fan. Just some bitch with a uneducated opinion. Sad...","commenter_a":"So they should be disqualfied and the Colts should get in.","post_message":"So it wasn't just some weird conspiracy theory."},{"comment_id":"538555889666037","commenter_b":"SHE IS NOT A SMART WOMAN","commenter_a":"She fails at everything'. We need #Trump2016","post_message":"She NEVER learns..."},{"comment_id":"712201488878460","commenter_b":"Just can't stand that a black woman dresses better than you eh? Jealousy is a sin ya know.","commenter_a":"funny how ms obamas wardrobe has gotten mote expensive over the years. guess jcrew too cheap for her now. oh well, shes outta here soon anyways ;)","post_message":"Michelle Obama wore a familiar outfit last night ..."},{"comment_id":"787563944661438","commenter_b":"No more shrubs!","commenter_a":"What do you expect from him, he is a Bush.","post_message":"Democrats have a field day mocking Jeb Bush for pretending to be \"his own man\" despite the fact his policy advisors list reads like a Who's Who from the Reagan administration and those of his father, George H.W. Bush, and his brother, George W. Bush #ItDoesntFallFarFromTheTree"},{"comment_id":"1244441208928501","commenter_b":"@username, women can't do anything they want to men. Are you saying that because you can't get laid, you should be allowed to kick a woman down the stairs?","commenter_a":"There's no excuse for this. No, none whatsoever. #MisogynySucks #EndViolenceTowardsWomen #TreatHerKindly #TreatHerWithDignity #TreatHerWithRespect Only a #Caveman would do that.","post_message":"A man in Berlin kicked an unsuspecting woman from behind, sending her flying down the stairs."},{"comment_id":"1099534980113254","commenter_b":"Anderson cooper is a killery bitch","commenter_a":"The country will be dancing in the streets if that happens. If anyone can get the job done, it's Donald J. Trump!!","post_message":"Donald Trump says he will prosecute Hillary Clinton if he becomes President of the United States."}]
