[{"comment_id":"10154088028351159","commenter_b":"I wouldn't trust her to clean my toilets !","commenter_a":"The same thing she did with Benghazi!","post_message":"In case you missed it..."},{"comment_id":"1125703734163047","commenter_b":"@@username, The same amount as your kind that got arrested for having sex with goats and dogs. Bitch ass.","commenter_a":"George Zimmerman and Dylan Roof both caught beat downs in the same day. Today was a good day.....","post_message":"George Zimmerman was punched in the face for bragging about Trayvon Martin's death! After the well deserved sock to the face he called 911 in a panic #WSHH #GeorgeZimmerman #TrayvonMartin #RIP"},{"comment_id":"10154425900258366","commenter_b":"There is no wall","commenter_a":"Who f****** cares. Now it will be a party. They're gonna roast him like never before.","post_message":"BREAKING: President Trump has officially announced that he will not attend this year's White House Correspondents' Dinner."},{"comment_id":"10153677360299641","commenter_b":"She is worth more than all of Isis put together.","commenter_a":"Mary Knoll","post_message":"This is Diesel. She is a 7-year-old police dog French police say was killed in the raid today.  Here's what we know about the raid so far: @webpagelink"},{"comment_id":"10153070035530399","commenter_b":"I thought I saw this woman at Hooters the other night. That's always been a good source of Broadcast talent for Faux.","commenter_a":"Just a new way for the Dummycrats to steal more votes!!!!!!!!!!!!!!!!!","post_message":"It's always Andrea Tantaros."},{"comment_id":"1493733267320483","commenter_b":"Please go to Danney Williams-Clinton FB page he posted a video called Banished. We need to help this young man by spreading his message far and wide. He may or may not be Bill's son.","commenter_a":"Donald Trump continually tries to deflect his inappropriate behavior towards women by turning it back onto Bill's indiscretions. One issue that everyone seems to be missing is that Bill is NOT running for President. Donald is.","post_message":"Thank you, Michelle Obama."},{"comment_id":"705783696236172","commenter_b":"No ovaries. Only clitoris.","commenter_a":"The clit and ovaries.","post_message":"Most of you are, or will be, very familiar with it. But it looks very different than you might imagine."}]
