[{"comment_id":"10153443636529087","commenter_b":"She is another racist B*t*&","commenter_a":"Influential? I think her 15 minutes were up some time ago.","post_message":"Influential conservative commentator Ann Coulter called claims that Ted Cruz was a natural born US citizen \"absolutely false,\" joining Donald Trump in questioning whether Cruz can legally run for president."},{"comment_id":"958116217578241","commenter_b":"Hillary had two terms (8) years in the White House. Hillary was involved in everything bill Clinton did!! Hillary had two terms (8) as a New York senator. Hillary had a term (4) years as Secretary of State. Yet, the old girl thought she could have her own server and NOT be held accountable for classified emails... When are Americans going to get pissed enough to hold the shrew responsible?? Hillary left four AMERICAN men to be tortured until dead in Benghazi. Could this be what she and her aids are hiding? As of Friday, as per a JUDGES order nothing has been turned over. The two aids hide behind an attorney and Hillary just never answered... Monday such be very interesting!","commenter_a":"She needs to STOP Monsanto instead of defending them. We all have a right to know what is in our food.","post_message":"Join Hillary's fight to build an America where we don't leave anyone out or anyone behind: @webpagelink"},{"comment_id":"10153904128981336","commenter_b":"@username I'd rather my money go to vets than illegals.","commenter_a":"Oh man, companies supporting a competent and able workforce with bonuses. Conservatives will not like this one bit.","post_message":"Jeffery Hildebrand, the 56-year-old billionaire owner, will pay out more than $100 million in total and reportedly uses these bonuses to motivate his workforce."},{"comment_id":"10154184705448525","commenter_b":"Yes, she meant for the child to nearly be injured. It was totally on purpose! What a horrible, horrible mother! We should prevent her from ever reproducing again! Period!!!!!!","commenter_a":"That is not considered an accident!!! That is carelessness and neglect of protecting your child. Plain and simple truth. Period!!!!","post_message":"IT ONLY TAKES A SECOND: This big brother is a hero after racing across the room and catching his baby brother as he falls from the changing table! Their mother hopes this will serve as a reminder to others to remain vigilant - always. Read more: @webpagelink"},{"comment_id":"10154099189924071","commenter_b":"Killary is an Embarrassment ,she evidently has no idea how to run an office Legally or with Class. What she poured into this election was ill gotten money. She sure didn't use her own. I Honestly feel her major Dissapointment is her self absorbed issues that would have only added more money to the Clintons Fraudulent Foundation . Being a Great Nation is now much more attainable without corrupt Killary and the rest of her lackeys.","commenter_a":"Wow. So much hate on these posts. I hear a lot of people upset about the protests going after she lost but it seems like there are just as many sore winners out there. Whether you like her or not, people need to learn some respect. I guarantee 99.9% of the people on here haven't the foggiest idea what it takes to hold a high ranking position in our government or run for president. She poured a lot of time and effort into her campaign and to still come up short must be a major disappointment. I'm sure a lot of people have done less and been more hurt by their own failures. I thought this was a country of conscience and good will. This election has proved we are much further from being a great nation than we claim.","post_message":"“I know that over the past week a lot of people have asked themselves if America is the country we thought it was.\""},{"comment_id":"911046885608046","commenter_b":"LIKE I SAID, SHE KILLED THOSE KIDS. A BEE?! Get out of here with that mess. Throw the book at her. @username,","commenter_a":"Whatever!! She killed those kids.","post_message":"Two 18-month-old twins drowned in an Arizona canal Friday after their mom briefly let go of their stroller to fend off a bee: @webpagelink"},{"comment_id":"967043476669844","commenter_b":"I heard it was originated by harem members trying to catch the attention of sheiks so fat the women had to do all the work!?.","commenter_a":"There are spiritual aspects to female sexuality, this is where belly dancing comes from...before it was a way for women to show their sexual fertility to their husbands it was a practice done by female worshipers of the snake goddess. Not sure but to me this seems like a modern take on that...in most cases such dancing is done for the benefit of men. But when it is done to express one's sexuality in a personal way, it does have an empowering effect. It suggests that a woman's sexuality belongs to her and doesn't need a male audience to be valid.","post_message":"I never thought a pole-dancing video could be such a tearjerker. Man, was I ever wrong! - Andrea Garcia-Vargas"}]
