[{"comment_id":"10154679787223751","commenter_b":"we dont want to lecture anyone on how to govern their own country, but Canadians will lead by example","commenter_a":"That's whet they need to be.","post_message":"Canada's border has seen a surge in people crossing illegally from the U.S., with a 230% increase in people crossing into Quebec in January compared to a year ago. @webpagelink"},{"comment_id":"10153511380259641","commenter_b":"I can't believe some of the comments here - So much hate {that's not justified} :/","commenter_a":"RIP the old England, lost to Islam now.","post_message":"#TBT:"},{"comment_id":"10154831195946729","commenter_b":"Well, turns out Michelle Obama herself was accused of plagiarizing part of her speech. In fact, the Democrats who are using last night’s speech as a means to cast aspersions might have done well to pause and consider the list of their own high-profile leaders who have been caught plagiarizing.","commenter_a":"Melania Trump Did NOT Plagiarize Michelle Obama’s Speech And This Is Why… The accusation is that Melania Trump “plagiarized” a speech made by Michelle Obama in 2008. Well I’m sorry liberals, she did not. Here are the comments from Michelle Obama in 2008: \"And Barack and I were raised with so many of the same values: that you work hard for what you want in life; that your word is your bond and you do what you say you’re going to do; that you treat people with dignity and respect, even if you don’t know them, and even if you don’t agree with them. And Barack and I set out to build lives guided by these values, and pass them on to the next generation. Because we want our children — and all children in this nation — to know that the only limit to the height of your achievements ...","post_message":"Wow..."},{"comment_id":"1021126491243474","commenter_b":"And yet a student did intervene verbally and is still alive.","commenter_a":"Shame on that teacher for not standing up for that student. Even if she was being disruptive in class she still deserves to be protected and treated with decency.","post_message":"When a white Spring Valley cop brutally assaulted her classmate, Niya Kenny sprung to her defense.  How could she have known what would happen to her next  just for speaking up? #AssaultAtSpringValleyHigh"},{"comment_id":"10153612601766336","commenter_b":"You know they wont. Shes gonna get a slap on the wrist.","commenter_a":"Lock er up!!!","post_message":"The DIA, the NSA, and the NGA, which oversees U.S. government spy satellites, confirmed to Catherine Herridge that the information was classified at the time and remains classified now."},{"comment_id":"988932794475475","commenter_b":"black so slap on the wrist and tell her NO NO","commenter_a":"Thanks Obama! This is how you are destroying America! I hope you and all of your kind are happy. No wonder this nation is falling apart.","post_message":"She will pay for this!"},{"comment_id":"1341354572550959","commenter_b":"Right by Tacoma General","commenter_a":"Good. That's the way it's supposed to work. You rob people, you get shot. End of story","post_message":"A man was shot and killed yesterday evening after robbing two people at gunpoint in Tacoma. Natasha Chen reports, 5 p.m.: kiro.tv/LiveNews  What we know now: kiro.tv/TacomaShot"}]
