[{"comment_id":"630794597099043","commenter_b":"Jill is Anti TPP! TPP protects corps who want to outsource american jobs!!!!!!","commenter_a":"Yay","post_message":"We’re here with Green Party candidate Jill Stein and her running mate, Ajamu Baraka to take your questions ahead of tonight’s #GreenTownHall. Please submit your questions in the comments section below. Tonight's Green Party town hall starts at 9 pm ET. @webpagelink"},{"comment_id":"10156455116700354","commenter_b":"Plenty of real women out there that they could have photographed","commenter_a":"A fucking lie from the liberal media why pretend.","post_message":"All 8 PHOTOS here..."},{"comment_id":"10153492850468984","commenter_b":"Tear them down! Burn them - just get rid of them and start a mass deportation of Muslims!!!","commenter_a":"First time I see one I am going to the ACLU and sue Islam is a dangerous cult and it offends me...","post_message":"Some of these claims seem quite bizarre. I wonder how this will be received by the American public.  What do you think?"},{"comment_id":"10153762472156337","commenter_b":"Id smash her tuppence!!!","commenter_a":"Whatev","post_message":"HOW MUCH???"},{"comment_id":"1304158649677186","commenter_b":"Pretty woman with a dirty mouth, ,, Perfect Clinton supporter","commenter_a":"Trump had this election stolen. He rigged it. He tampered with an election. That is punishable by law. Why isn't he being prosecuted? His evidence is on his computer. Why haven't they confiscated that and checked it out? This is a joke!! This whole voting system is a scam. We the people have no rights in our voting. Trump was right. It is rigged...in his favor!","post_message":"This is a must read for every disappointed Democrat."},{"comment_id":"684673561687958","commenter_b":"Your right I will vote female when it's right and it won't be Chelsea Clinton either. MAYBE IVANKA TRUMP.","commenter_a":"I would have no objection voting for a QUALIFIED female for president. However, I will not vote for anyone of any gender, color, or nationality that is a liar, is a thief, etc to run our country further into the ground. This election is not the time to vote for a female president.","post_message":"\"For all you women out there who think that electing a female president will lift us all up, just ask yourselves if electing an African American president lifted up the blacks in this country.\" – Judge Jeanine Pirro @webpagelink"},{"comment_id":"10154302766323543","commenter_b":"@username The problem in California is that now illegals have driver's licenses and with that, they were simultaneously, automatically REGISTERED to VOTE as well. Thank to Jerry Brown. We in California are also overrun with Sanctuary Cities and BROKE due to these idiotic, liberal politicians!","commenter_a":"Regardless of the number, I am strongly in favor of requiring IDs for voting. NO ONE should be allowed to vote if they don't have the legal right to do so.","post_message":"Hillary Clinton garnered more than 800,000 votes from noncitizens on Nov. 8, an approximation far short of Donald J. Trump estimate of up to 5 million illegal voters but supportive of his charges of fraud. - via The Washington Times"}]
