[{"comment_id":"594928020669934","commenter_b":"@username she said with her own mouth she wanna build a wall.","commenter_a":"@username once again dominating the night showing that she is clearly more knowledgeable, articulate and experienced to be President and commander-in-chief. Ready or not, Madame President here she comes!!!","post_message":"One candidate delivers catchy lines—the other delivers results. Add your name to say you're with Hillary. #DemDebate"},{"comment_id":"1170311373061915","commenter_b":"Bitch, YOU'VE been punked and you're too stupid to grasp that fact!!!","commenter_a":"Will has a right to do what he wants to do.!!!!!!!!!! Who the f- -k does Trump think he is?!!!!!!!!!!!! It's time he kept his trap shut.!!!!!","post_message":"Brilliantly played, George Will!"},{"comment_id":"10153101645216615","commenter_b":"Common Core teaches math comprehension. It teaches students how to comprehend math rather than just memorizing tables. It also teaches students different ways to do math in their heads. I love the \"its dumbing down students\" argument. You, as an adult, cant do it or unferstand, your child can... yet this is making THEM dumber? Sounds to me like its an ego thing. How about you sit there and learn with your child instead of just complaining about it. Take the time to try to actually understand what your child is learning. Why would any parent not want their child to be smarter than they are... why would any parent argue and complain about something that will make their child smarter simply because the parent isnt smart enough to understand it. I have a High School education, no college degree, and i can still understand common core math. Why cant ...","commenter_a":"I love how people bash Common Core without ANY understanding of it at all. I mean, zero comprehension. \"Fox News told me it was bad so it's bad.\"","post_message":"This has been trending -- one dad blasted Common Core with the check he wrote to his child's school."},{"comment_id":"10153310258470090","commenter_b":"www.thefightforjustice.com Former bank employee goes head to head in the courtroom against bank and lawfirm-10 years and counting- Many exposed and the list is growing!","commenter_a":"Hideously profane y","post_message":"All of the above. We want to know WHY you don't want another Clinton in the White House. Tell us here: @webpagelink"},{"comment_id":"703541823169729","commenter_b":"Both of the girls always look miserable !","commenter_a":"You tell a bunch of things that aren't true . Please people","post_message":"Malia Obama at the center of damning White House scandal. The whole family is a disgrace. This is ridiculous. Do you think the Obama family is the worst presidential family in history?"},{"comment_id":"10153351458636336","commenter_b":"We have laws that protect our flag,Why are they not enforced? Up to $1000.00 fine or up to 1 year in jail. It is the law people.","commenter_a":"Good!","post_message":"“I don’t care who you are, you’re not gonna disrespect the flag, and if I have to go to jail to defend our flag, I’m gonna do it.” – Richard Pierce, Vietnam War veteran"},{"comment_id":"1067324623308009","commenter_b":"Why should anyone get special benefits for being married?","commenter_a":"I am for the government getting out of the marriage business","post_message":"While we celebrated the right of same-sex marriage finally being nationally recognized, Republicans began to lose their minds."}]
