[{"comment_id":"1535691416490982","commenter_b":"Go lick some boots","commenter_a":"I don't see how the video is BS you can clearly see him drop his hands down into his waistband and wasn't following police commands again showing the total disregard to authority so The only BS I see is ignorant people trying to act like they're above the law","post_message":"The media ALMOST had everybody fooled about Crutcher, but we found the truth.  And it's going to destroy the media's narrative on the Crutcher shooting..."},{"comment_id":"10153198619131378","commenter_b":"Hell no he has lost his mind please hurry 2016 so he can take a much needed seat lol","commenter_a":"No more illegal","post_message":"\"Now we know the scale of this problem. It's significant. And there are millions of people who have been driven from their homes because of this violence,\" President Obama said."},{"comment_id":"10154225504351336","commenter_b":"Can't stand her","commenter_a":"Oh come on now, we all know she is in with Trump...She's a plant by Fox news and the Trump group to bring attention to him....It's the oldest trick in the book...but ya, I can't stand her either.","post_message":"Fox News host Megyn Kelly and Republican presidential candidate Donald J. Trump met in New York City on Wednesday morning."},{"comment_id":"10153646092561167","commenter_b":"Liberals hate women!!!","commenter_a":"If Megyn Kelly didn't have her looks and her little fued with the Donald to capitalize on she'd be a non issue.","post_message":"Can everyone finally stop pretending Megyn Kelly is any kind of “hard-hitting journalist”?"},{"comment_id":"1074912275882577","commenter_b":"Look at their faces....they're smiling. ...and we're not allowed to be angry about this. All of you bigots need to shut up! Wear your flag ....fly your flag......shove your flag.....who cares ....but you will not see it flying over that government building ever again!!!! Deal with that!","commenter_a":"Are these the same, \"It's Heritage, not Hate\" clowns?","post_message":"South Carolina voted to remove the Confederate flag, and bigots are in a frenzy: 'F*ck black people'"},{"comment_id":"10157833326000093","commenter_b":"The most hated woman in the world !","commenter_a":"Time to put the Clintons and their never-ending, gross and creepy scandals out to pasture.","post_message":"The Clintons and their minions deserve to be driven from public life."},{"comment_id":"1147448235275205","commenter_b":"Isn't it wonderful how they know everything even you personally. The caps are supposed to be gone according to gore. You can go to nasa and and other gov weather sites and look at the charts. There is nor a warming trend. But when they don't know just guess the insult. Just shows there ignorance","commenter_a":"Climate change happened with or without fossil fuel use. Isn't that interesting?! Well unless dinosaurs and such drove gas guzzling SUVs","post_message":"\"The message to society is clear: Prepare now, or be prepared to face the consequences.\""}]
