[{"comment_id":"10152976505127507","commenter_b":"Kiss my ass!!! Idiot!!!","commenter_a":"NRA go to hell. Enough is enough!!","post_message":"Far too many times. Watch the video here: @webpagelink #CharlestonShooting"},{"comment_id":"948395698606028","commenter_b":"Karma's a b**** and so is Hillary Deplorable Hillary LIES MATTER Pay for play Lining her pockets","commenter_a":"It was not a mistake...it is who she is. Angry bitter vindictive with money and power. Glad she was feeling enough pressure to be who she always was. A spiteful mean spirited person","post_message":"When you are president, you are president of all the people."},{"comment_id":"479766112213969","commenter_b":"Oh that is too funny she claims her life is harder than soldier that bitch don't have a clue","commenter_a":"and they have no vaction poor baby michelle","post_message":"Michelle Obama just made an outrageous claim... Our soldiers fight and die for our country, Michelle takes lavish vacations. Do you respect our veterans over Michelle?"},{"comment_id":"10152986560831336","commenter_b":"She belongs on SNL.....She is like a comic...! She is so stupid...!","commenter_a":"And just when you think you've send the bottom of stupid, you find there's even a lower level","post_message":"The key to defeating ISIS is... job opportunities?!"},{"comment_id":"858528920935448","commenter_b":"Sarah Dingle, how do you (or any Arabs or Muslims) have the courage to speak of apartheid when ISLAMIC COUNTRIES ARE WELL-KNOWN FOR THEIR GENDER-SEGREGATED SOCIEITES? That really laughable!","commenter_a":"If any Country refuses to compete in a friendly or qualifying tournament or bans others for racial reasons. They should be banned from all worldwide competitions! This is 2015!! Time to stop the hate against Israel!!","post_message":"Israel judokas were not allowed to compete in Abu Dhabi with the Israel flag on their judo uniform."},{"comment_id":"10153223186871336","commenter_b":"Lol @username it wouldn't be America without us it would still be Native American land Indian land you call crazy and aliens would still be over in Europe living without sign in famine","commenter_a":"Actually 52-0 if you count all the woman beatings and cheap shots outside of the ring.","post_message":"ICYMI: Floyd Mayweather piled up enough points against Manny Pacquiao to win by unanimous decision in their welterweight title bout last night. Mayweather extended his win record to 48-0, cementing his legacy as the best of his generation."},{"comment_id":"10153100903362061","commenter_b":"She's ugly!!","commenter_a":"Denise has had some work done.","post_message":"Juicy pop news - first photos of Kermit the Frog and his girlfriend Denise have hit the web: @webpagelink - The Muppets ABC"}]
