[{"comment_id":"1021881241225156","commenter_b":"'@username bildim niye chocolate sevirsen :D","commenter_a":"Turkan M. Devrijova, @username duz deyirmish :D chocolate is good","post_message":"People who love chocolate are more likely to be clever"},{"comment_id":"1673236709627945","commenter_b":"I can't stand this big eared liar!","commenter_a":"Bull crap! You say that federal background checks don't work when it relates to gun control but when it relates to checking refugees you say it does so apparently it only works when you are telling the public lies to get what you want = pitiful","post_message":"'Any refugee coming to the United States, some of them victims of terrorism themselves, will continue to get the most intensive scrutiny of any arrival.'  After meeting with his national security team, President Barack Obama said that 'our intelligence and counterterrorism professionals do not have any specific and credible information about an attack on the homeland,' but that 'we have to be vigilant.'"},{"comment_id":"10153045514858908","commenter_b":"Wrong. Anti-vaxxers allow a disease to evolve and make said vaccinations useless. If we ALL got vaccinated, the disease is wiped out and it can't evolve or spread. Science.","commenter_a":"So I go to read the article, and directly above it is a fear mongering advertisement with a link...don't catch shingles. Get your vacination now. SMH If you don't want vacinations dont get them. If you want vacinations get them. If you believe vacinations work then you are in no danger of catching the diseases from the people you are bitching at and preaching to. Mind your own business like people did in the old days before Facebook.","post_message":"Many important points made here are not to be ignored...."},{"comment_id":"933218310052361","commenter_b":"So how many snipers are needed to guard them from poachers?","commenter_a":"There's a herd in Florida too.","post_message":"Well, would ya look at that! (via TakePart.com)"},{"comment_id":"1598639267107557","commenter_b":"#2ChroniclesChapter7V14 #DrainTheSwamp #OneNationUnderGod #InGodWeTrust #TrumpPence2016 #UCMJ4President #UCMJ4Congress #UMCJ4Senate #USConstitution #BillOfRightsNonNegotiable #Paperballotsonly w/ID #NoAmnesty #AmericaFirst #PledgeOfAllegiance #NationalAnthem #ProNRA #ProLife #Pro2A #NoUN #MAGA #Election2016","commenter_a":"Why are tax dollars being spent on our so called president campaigning for her. ..should be illegal","post_message":"Donald J. Trump finally did it. After taking a lot of punches from the first lady, he unloaded on Michelle Obama, dropping an epic truth bomb on the president's wife.  What do you think about what Trump said?"},{"comment_id":"10154774162911323","commenter_b":"'@username, since you agree with @username, how does one load a machine with votes?","commenter_a":"'The people have spoken' is such an unfortunate choice of words when they gave your opponent in excess of 2M votes more than you.","post_message":"'We believe we have an obligation to the more than 64 million Americans who cast ballots for Hillary Clinton.'"},{"comment_id":"10153230993584342","commenter_b":"No. Lol. I would have done that too.","commenter_a":"The restaurant manager obviously handled the situation poorly. She waited too long to intervene and then did it in anger. That is unprofessional. BUT.... The parent who allows their child to disturb all the people around them trying to enjoy a meal is inconsiderate and selfish! The excuse that the child is waiting too long for food is poor at best. You as a parent and should come prepared to entertain your child... That includes providing them snacks and toys. The parents should have removed that child from the table within 5 minutes of the unresolved tantrum. Yes... I am a parent and never allowed that to happen. Remember that you are not the only person in that establishment spending hard earned money to enjoy a simple meal!","post_message":"DINER OWNER YELLS AT CRYING CHILD: 'I turned around, slammed both hands on the counter and then pointed at the child and said, 'This has got to stop!'' said Darla Neugebauer, after she says a toddler cried for more than 40 minutes. The child's mother is furious. Did the diner owner go too far?"}]
