[{"comment_id":"947825155333866","commenter_b":"..i got 99 problems but a bitch ain't one","commenter_a":"Wax off wax on Daniel son !!!!","post_message":"This can't be real"},{"comment_id":"10152935286327426","commenter_b":"Medical \"miracle.\" Plus, you're not dead yet, so you're dreaming of what you expect to see. If you were convinced you were going to an eternal punishment, you'd have a very different dream outcome. Also, funny how this doesn't work trans-culturally, don't you think?","commenter_a":"Amen","post_message":"His family is convinced it was a miracle."},{"comment_id":"1562827943734753","commenter_b":"That woman on the right is a moron!!! (Red top).","commenter_a":"Fuck you lieing democrats your nominee is trash n war with Russia will happen if she's elected even Russia's president believes so","post_message":"EPIC! Oh, and the woman in red is a REPUBLICAN! This happened tonight on CNN. Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"723019874555257","commenter_b":"Should have turned on this evil muslim way before this get him out","commenter_a":"Shariah women slavery FACTS NOT phobia... TRUTH NOT misguided HATE... Example: Mohamidians mistreat WOMEN soooo badly ends shariah court to determine who can repeatedly RAPE women SLAVED by islam... WASHINGTON - Islamic State theologians have issued an extremely detailed ruling on when \"owners\" of women enslaved by the extremist group can have sex with them, in an apparent bid to curb what they called violations in the treatment of captured females. The ruling or fatwa has the force of law and appears to go beyond the Islamic State's previous known utterances on the subject, a leading Islamic State scholar said. It sheds new light on how the group is trying to reinterpret centuries-old teachings to justify the sexual slavery of women in the swaths of Syria and Iraq it controls. Above from article... @webpagelink","post_message":"BREAKING: Liberals Turn On Obama After He Is Caught In THIS Massive Lie About Bin Laden [VIDEO]. He can't hide any longer. His presidency should be terminated. Do you think Obama should be impeached?"},{"comment_id":"1139554482745590","commenter_b":"@username our military is nothing aftef these last 8 years and you are truly misinformed and your misunderstanding what is goin on..he wants open boarders to legal immigrants..he doesn't want to stop legal immigration he wants to stop the illegals so we know who is coming into our country...you are the problem..the Lord gave you a brain..please go exercise it..","commenter_a":"It's my first time voting and I'll be voting for Trump today in Arizona!","post_message":"I have proven to be far more correct about terrorism than anybody--- and it’s not even close. Hopefully Arizona and Utah will be voting for me today!"},{"comment_id":"10152670445845927","commenter_b":"Give that money to the Border Patrol, and arm them to convince aids-ridden latinos to stay on their side of the fence !","commenter_a":"Sick! No matter how sinful humans try to avoid the consequences of this horrible sin, God's word (Romans 1:26,27) assures that they will receive in their bodies the automatic payment for their wrong. God doesn't lie and He never fails.","post_message":"The study is to find the best ways to convince gay Latino men to wear condoms and get tested for HIV."},{"comment_id":"1270356769653367","commenter_b":"She is so gross, just sickening!","commenter_a":"Whatever That idiot should move to Mexico","post_message":""}]
