[{"comment_id":"10153150337159607","commenter_b":"He didn't live there 6 years. Stop believing everything you read, or make up in your head. Respect his family and friends right now and stop thinking this was a conspiracy","commenter_a":"Police did it he was going to expose the police for the dirty","post_message":"A Baltimore City police officer was found facedown in the water in South Baltimore Tuesday night. Officer Prashanth Davis, 34, was pronounced deceased at the scene."},{"comment_id":"10153682330001037","commenter_b":"She's nuts.","commenter_a":"Just sad","post_message":"“I honestly regret what I have done and take responsibility for it,\" wrote Petra Laszlo in a letter to a Hungarian newspaper."},{"comment_id":"1150426991676729","commenter_b":"We could put all Muslims on Atlantis and let them fight it out! Yes, I know it is a fantasy that Atlantis existed but believing Islam can coexist with the rest of the world is a fantasy, too. Best hope the idiots get there and drown vforevthey realize they have been had. Obama can lead them with Hilary behind. My fantasy! Sorry, but I have problems.","commenter_a":"Way to go Angola","post_message":"Muslims have been asked to tear down their own mosques under threat of paying for the demolition fees...."},{"comment_id":"10154079684393812","commenter_b":"A bitter old lady move on. About as important as blm.... Next","commenter_a":"And I care what the stepsister of Ann Frank thinks????","post_message":"Anne Frank's stepsister: \"If Donald J. Trump became the next president of the U.S. it would be a complete disaster...I think [Trump] is acting like another Hitler by inciting racism.\""},{"comment_id":"1286858341353620","commenter_b":"who cares !!! no one !!! let that bitch fall !!!!","commenter_a":"She is sick. She was having a seizure. She is lying about her health. She was the only one wearing sun glasses and I thought it strange. She is a basket case.","post_message":"BREAKING:  HILLARY HAS MEDICAL EPISODE AT 9/11 CEREMONY in NYC.  Swept away by security detail.  VIDEO  @webpagelink"},{"comment_id":"10153150465564255","commenter_b":"Because man created god in his image and saw that it was good.","commenter_a":"well one thing it never said JESUS was ethiopian and he was born in bethleham so Jesus 90% chance was not black but i do not see why it makes a difference","post_message":"Why do churches use a historically inaccurate image?"},{"comment_id":"1017002171709344","commenter_b":"I would feel equally disgusted voting for either one.","commenter_a":"That's a Question ?","post_message":"Multiple Choice Quiz time, Republican kiddies! Which answer did you choose? A or B?"}]
