[{"comment_id":"903935252988832","commenter_b":"That strategy has never once worked. In fact, we created ISIS by doing exactly that to Iraq.","commenter_a":"Just another reason to bomb them into little pieces. If done correctly, these vermin could be wiped out in a matter of weeks.","post_message":"\"Since ISIL declared a caliphate in Iraq and Syria in July 2014, the group has become one of the world’s most well-financed terrorist organizations.\""},{"comment_id":"10153161460796051","commenter_b":"You're stupid","commenter_a":"He's promoting this cause he knows him and his racist wife will end up in a cell very soon.","post_message":"Here's why President Obama says it's time to end mass incarceration in America. Do you agree or disagree with his message?"},{"comment_id":"10154686033581336","commenter_b":"Yeah...nothing says 'witch hunt' like having your underlings whack up 13 mobile devices with a hammer...then giving those underlings immunity...then they all plead the 5th except for one who doesn't show up under subpoena.","commenter_a":"Trumps lewd comments must be getting old or too obvious, I woke up today hearing how No presidential candidate has ever threaten to put their opponent in jail, That is because the previous 44 elections there wasn't a candidate with a 30 year crime sheet. God I hate our media.","post_message":"WATCH: \"Mini-Trump\" joins Donald J. Trump on stage at a rally. @webpagelink"},{"comment_id":"10152564458982623","commenter_b":"Pure trash . Should have ran over her .","commenter_a":"Idiot.","post_message":"It's the video everyone is talking about.  The woman recorded in a terrifying road rage incident in Randleman has been charged."},{"comment_id":"612030692317870","commenter_b":"HAHA Austria also has an entire budget that is smaller than America's military budget is alone. I'll keep my 19% tax rate thank you. You all had your damn kids, pay for their college yourself. I'm not paying it just so they can go out and buy a new BMW when they graduate.","commenter_a":"Those poor bastards...they will be stuck in an Obama like environment.","post_message":"Austria's election gives hope that the far-right wave sweeping the West can be stopped."},{"comment_id":"981038348622309","commenter_b":"All the prostitutes brainless Repugnicans were born from a cow. Have no brains no soul no dignity full of hate and hipocersy and a aberration against women . Why ? Their mothers are cows.","commenter_a":"Why do Ryan's wife and daughters stay with a man who has nothing but loathing for their gender? Can they not exert any influence over him? If THEY cannot, will he listen to anyone that opposes his point of view? I seriously hope his daughters are never raped, never need the assistance of Panned the Parenthood. He can evoke \"Family Leave\" and I am sure he will still receive full pay - pay that is provided by taxpayers who he wants to deny \"paid family leave\". He will also work against Social Security and Medicare, but when he retires I believe he will gladly accept it. Can his man be any further from someone we want to represent our interests in Congress? He has no interest in representing us. He has NO integrity.","post_message":"Examine his voting record and you’ll find Ryan to be anything but a representative of the American people. Especially when it comes to female Americans."},{"comment_id":"10154221226031509","commenter_b":"Its not a stare down, lol! Whe one talks the other listens & thinks, then vise versa.","commenter_a":"Obama is intimidated by Putin he can't even look at him in the eyes.","post_message":"Heads slightly bowed, looking extremely serious: What were Obama and Putin discussing?"}]
