[{"comment_id":"10153146090320667","commenter_b":"Watch out she's going to report u lmao","commenter_a":"Go get a life,","post_message":"In about three days, the group has collected 30,000 signatures."},{"comment_id":"10152834207221130","commenter_b":"Suzie Mills when all the GB is gone xx","commenter_a":"Mark O'Halloran","post_message":"Practice makes perfect, little buddy."},{"comment_id":"10155404890705354","commenter_b":"HHHAAAAAA just when you think these morons can't get any more stupid then they already are..HHHHAAAAAA......how about a lying bitch? is this phrase \"Off Limits\" personally I think it's really very descriptive of this...well...lying bitch....","commenter_a":"Bullshit!","post_message":"Hillary Clinton's digital thugs warn the media: using the word \"secretive\" is \"coded sexism.\" Take a gander at the rest of Hillary's laughable list of \"sexist\" words..."},{"comment_id":"896989227005981","commenter_b":"How much longer are we going to let this jackass destroy OUR country","commenter_a":"Will they cover whitr slaves also...or will they remain color blind???? NEVER HAPPEN ON AMERICAN SOIL WOTHOUT ANOTHER CIVIL WAR........JUST WHAT OBAMA WANTS...DIVIDE AND CONQUER","post_message":"Wait. WHAT?!"},{"comment_id":"1027700850605035","commenter_b":"Russia does not need turkey; Turkey are the back stabbers lying pigs!","commenter_a":"But Russia will miss alot if they cut relations wz Turkia","post_message":"Russia's Foreign Minister Sergei Lavrov has rejected the possibility of normalizing relations with Ankara after Turkey downed a Russian warplane inside Syria."},{"comment_id":"10152778407223445","commenter_b":"No argument, no facts, just a loud mouth bitch thinking she's right bc of some stupid ass parents. She keeps saying free access, bitch it's already accessible, just gotta know who to call. 2chainz wins this conversation piece every time.","commenter_a":"Idiot-ass","post_message":"UPDATED: Nancy Grace admits defeat in #pot debate with 2 Chainz?: @webpagelink"},{"comment_id":"10154086609949270","commenter_b":"@username I wouldn't scream foul if a woman was captured simply because she's a woman. Don't ASSume that, thanks darling! They take the risk just like any other man serving. You assume that a lot of women would want to jump in to combat roles over the 'safer' ones. Some might, yes. Not all. Just like having the Ranger tab it does not mean you will be in a Ranger regiment. Women are not afforded all paths in leadership like men are. I never said the standards should be lowered, did I? Nope. I VERY CLEARLY said \"If these women could not pass at the lower standards, then they have no business being part of it. So, they didn't make the cut, and yet you're still pissed off? \". Read it again, and again, and again until you understand what I wrote. Should I spell it out in simpler terms? ...","commenter_a":"There goes the military! Fools! They already lowered the standards for SEALs because of their little 5 year project that ended in 2015! They had to lower the standards and give them \"step boxes\" to complete the courses! What a crock of crap! Even at lowering the standards NO FEMALE PASSED! Certain \"jobs\" in the military should be left to the men! Females will put soldiers lives at risk when they get shot, twist an ankle, break a nail or just have a bad case of PMS! This government is ruining everything!","post_message":"The women are the first female soldiers to be accepted into the Special Forces Assessment and Selection and could report to Fort Bragg as early as October."}]
