[{"comment_id":"10153133093676491","commenter_b":"OMG IK WIL DIT NU AHH NERD FEELS OVERLOAD","commenter_a":"'@username Bram Van der Maat","post_message":"Attention, fans of The Lord of the Rings Trilogy."},{"comment_id":"1187762051262009","commenter_b":"Build a defense wall also protects from evil ducks.","commenter_a":"President Trump will think of something.","post_message":"China have finally confirmed that they have lost control of their space station."},{"comment_id":"10153876150456680","commenter_b":"Libs can't ubderstand acting in legal ways. No wonder they so adore ILLEGAL aliens.","commenter_a":"About the taxes. Trump did nothing outside the law. So he really is a genius. He employed tens of thousands of people and according the the law, he paid the required taxes. Now the democrats are mad that Trump complied with business laws set by Democratic governments and utilized these laws properly? A bunch of hypocrites. #TrumpPence2016","post_message":"“Almost everybody else is getting poorer.  And yet billionaires like Donald Trump are able to manipulate the tax system so that they avoid paying federal income tax,” Bernie Sanders said."},{"comment_id":"1297864100266083","commenter_b":"She is yuck. Big mistake!","commenter_a":"Lmao!!","post_message":"Well.   OK."},{"comment_id":"10153247740094411","commenter_b":"Suck it up mother fucker","commenter_a":"När Israel skrotat alla sina atomvapen, har dom först då, rätt att ha trovärdiga synpunkter.","post_message":"BREAKING"},{"comment_id":"10153629866881336","commenter_b":"She is pathetic and out of control.","commenter_a":"Miley is a marginally talented girl with very little respect for herself. Billy Ray should be ashamed.","post_message":"What did you think of Miley Cyrus' barely-there ensemble?"},{"comment_id":"10154379049296028","commenter_b":"The tourist started it. There are reasons they had to close up. Their computers weren't working and they were forced to close maybe for an hour. Stupid tourist wanted to fight. She assaulted the employee first (yes, throwing water at someone is considered assault) causing the employee to be in defensive mode. Maybe that employee should be suspended for 2 days and hopefully she's not fired.","commenter_a":"What? You are not going to stack the coupons and price match??","post_message":"A woman's desire for a post-Christmas bargain took a violent turn. The confrontation caught on camera shows a store manager and a customer get into a scuffle in front of awaiting shoppers at a Florida mall. @webpagelink"}]
