[{"comment_id":"10153256663916770","commenter_b":"Another huge waste of tax payer money. There are so many departments in the WH, that do nothing, except, pad their pockets & suck America dry! A big majority of them need to be kicked out!","commenter_a":"Same accountant Obama has. It's just like dropping a billon here and here(like dirty socks).","post_message":"Department of Energy officials might want to take a few more accounting classes after they miscalculated their budgets by a few billion dollars."},{"comment_id":"1071940456151087","commenter_b":"the medias role should be to challenge state lies... now their main role is to amplify it","commenter_a":"this is not good.","post_message":"Barry Grey: Addressing the United Nations General Assembly on Monday, President Barack Obama portrayed himself and the US government as the preeminent defenders of international law and diplomacy. He did so even as the catastrophic consequences of the illegal wars of aggression he has overseen continued to send waves of refugees fleeing the ruins of entire countries—including Afghanistan, Iraq, Libya, Syria and Yemen—and as Washington took new steps to turn Eastern Europe into a militarized zone for eventual war against Russia."},{"comment_id":"966234590136262","commenter_b":"Love this, her & Ann Coulter make me sick. Both need to go away","commenter_a":"She is like Ann coulter. Such people must be sentenced for a lifetime. Her intolerance is making me angry.She must be imprisoned.","post_message":"Pope Francis is furious."},{"comment_id":"10153387072137869","commenter_b":"Agree, illegal must not be here in American Soil to live and receive any government aide at the first place.Gosh, our Social Security money and taxes we are paying will be given to these illegal people who enter here in our country. BTW, before you No Brain people forget, we have more American Citizens who are diasable, and have low income but working who needs help from our government and now, who gets more benefits, these illegal. Enough is enough.","commenter_a":"STOP THE REFUGEE PLAN! Obama you are shameful sir, putting Americans in harms way! At least France understands what we are up against! You are not a King! We need to cleanup DC and his cartel and vote them all out 2016. Implement term limits and background checks to stop the corrupt career politicians. We want leaders who will enforce our CONSTITUTION the SUPREME law of the land. Enough is enough! Vote Donald trump 2016","post_message":""},{"comment_id":"10153132008994497","commenter_b":"Conceded bitch... this shit practically writes itself. Lol","commenter_a":"This sick beat. Oh no!! Now what? Gimme a break. Never heard something so idiotic. A phrase? Boooooo!! :)","post_message":"From our sister publication:  The A.V. Club: \"From this day forward, any and all sick beats belong to Taylor Swift, under penalty of law.\""},{"comment_id":"10153428324682293","commenter_b":"Yes but she identify as female sexually fluid","commenter_a":"My daughter is sexually fluid, she identified herself as a lesbian during high school years and she wasn't allowed to have girls sleep over ( unless they were childhood friends), my other two daughters were not allowed to have teenager males sleeping over.","post_message":"\"I wouldn’t have dared bring a boy into my room while I was in high school. Do the same house rules apply to same-sex relationships?\""},{"comment_id":"1076528565795194","commenter_b":"Let's see ... when he said, \"yes she broke the law, but we don't think it rises to the level of prosecution... \" everyone was happy. Now something changed that ... something explosive enough to convince someone who supported and did everything to protect Hillary ... that \"something\" is enough for me to say I CAN'T TRUST HER! WHERE THERE'S SMOKE... THERE'S A FLIPIN' INFERNO!","commenter_a":"www.mostdamagingwikileaks.com","post_message":""}]
