[{"comment_id":"10154141552967426","commenter_b":"Those who are always accusing others of hate don't seem to have enough self awareness,intelligence or what ever to know how obvious it is who they hate.","commenter_a":"Welcome to Hillary's America RVA.....","post_message":"\"Your vote was a hate crime,\" was sprayed painted on statues that honor Civil War icons along Monument Avenue in Richmond.  The graffiti was discovered as hundreds protested the election of  Donald Trump as president.  Updates: @webpagelink"},{"comment_id":"1371649186228159","commenter_b":"There's a Q now, what does that stand for?","commenter_a":"They absolutely deserved it. As a proud member of the LGBTQ+ community I am shocked at half of these comments. You show that crown off with pride honey because you really deserved it.","post_message":"Hateful backlash from jealous female classmates angry at being beaten by a 'boy'"},{"comment_id":"520938298031470","commenter_b":"This woman isn't on benefits","commenter_a":"It does make you think!!! As I pay out per week for my sons bass guitar lesson, each Saturday for my daughter to spend the day at the stables....school trips etc. ....and still moan about having no money, whilst running two cars and paying for three seats at Bath rugby...plus drinks!! This has put my \"poverty\" into a proper perspective...and changed my opinion of ALL people on benefits being the same. Good luck to her and her family.","post_message":"Kathleen Kerridge’s family food budget is £40 per week – to feed five people. She says there is a big gap between the public perception of poverty and what it means for people like her. We should stop talking about poverty, she argues, until we know what being poor in this country really means."},{"comment_id":"1057489254266735","commenter_b":"Deport all illegals ..............","commenter_a":"The funny thing is that it's NOT about amnesty. It's about getting control of a situation that's currently OUT of control. If we don't move forward with the current plan, than what? Yes folks we are not in the same situation, but a much worse one. SIMPLE! Think about it, they are already currently living here and paying NO taxes. Unless we can beam these people up bye my calculations, YEP, there still here. Let's look back at what was actually said, the President NEVER said he was going to legalize any body's current status, just give them a chance to apply while working on there current status. Is it such a bad idea to have these people come out of the dark?","post_message":"I've been telling people for I don't know how many years, you know it as well as I do that's what this is all about.  But no Democrat's ever admitted it."},{"comment_id":"10153189105981336","commenter_b":"The pansies out there today would be a total embarrassment to this country. They would all turn tail and run. No backbone, no moral compass, no strength and no sense of reality. I blame the coddling society and the progressive liberal media.","commenter_a":"start the draft back up ...let these boys do a few years in the service","post_message":"Frat boys from the University of Florida and Emory University have been accused of urinating on an American flag, spitting on a vet and a service dog, and making derogatory comments toward veterans’ wives.  And that was just the beginning…"},{"comment_id":"10152748268571491","commenter_b":"No","commenter_a":"Ok ill tryit..... When will the coffee maddness end????","post_message":"If you’re still hungry after your meal."},{"comment_id":"10154894938720295","commenter_b":"Victoria bc watching","commenter_a":"I see it","post_message":"We're on baby watch again! Will today be the day that April the giraffe gives birth? Thousands of people have been glued to this video for days, waiting for any sign of her calf!  (Video courtesy: Animal Adventure Park)"}]
