[{"comment_id":"782996508468592","commenter_b":"'@username You know nothing fool.","commenter_a":"U.S. Attorney General Loretta Lynch is an idiot. Her and the Obama Gang are clearly violating the US Constitution and disregarding the rights and safety concerns of women and children. She should be hauled into congress for questioning.","post_message":"Just in: U.S. Attorney General Loretta Lynch announces that the Justice Department is suing North Carolina over bathroom law. 'This action is about a great deal more than bathrooms.' @webpagelink"},{"comment_id":"1368961776496629","commenter_b":"Obviously yours is up ur boyfriends ass you homo!","commenter_a":"IF YOU ONLY REPORTED REAL NEWS! ! ! !","post_message":"This scandal is only getting worse."},{"comment_id":"10154093101217452","commenter_b":"OMG. You must be a plant. No one could be that ridiculous.","commenter_a":"We are no longer fighting soviets obama. Russia is a friend in the war against ISIS.","post_message":"'Ronald Reagan would roll over in his grave.'"},{"comment_id":"1594945114129629","commenter_b":"This woman is a freaken joke. Go Trump","commenter_a":"Demonrats-deliver Detroit, Flint, Toledo, Baltimore, Newark and ghetto's !!! aLL THE TIME 100% OF THE TIME, every time suckers !!!!","post_message":"Democratic presidential candidate Hillary Clinton took aim at Republican rivals saying she is looking forward to debating with them about the economy if she becomes the Democratic nominee."},{"comment_id":"1547661255293998","commenter_b":"Bitch you out your rabbit ass mind","commenter_a":"Coo coo!!!!! One flew over the coo coo's nest, and there she is!!!!","post_message":"The classics NEVER cease to amaze..."},{"comment_id":"947408295386760","commenter_b":"Jill has sexy legs","commenter_a":"Commies","post_message":"'For my brothers and sisters that supported Dear Brother Bernie Sanders - this is the next step. This is the Green step. It is the progressive step. It is to stay on the love train. Justice is what love looks like.' -Dr. Cornel West"},{"comment_id":"10152955099256336","commenter_b":"They sound like a bunch of babies saying the same thing over and over again. Do it don't just say words.that mean nothing. You are not scaring these animals do something.","commenter_a":"Lt. Col. Peters ,just another fool on FOX, Susan Rice.... heads the NSA.","post_message":"“Secure, expand, defend, leverage – her four points. Bill, that’s not a strategy, that’s a bumper sticker. The yogurt I had for breakfast had more intellectual structure.'   Lt. Col. Ralph Peters slammed National Security Advisor Susan Rice’s speech on the United States’ national security agenda."}]
