[{"comment_id":"10153638108452894","commenter_b":"Exactly STFU Girl","commenter_a":"........\"my neck,my back,lick my 9ussy and my crack\" is her claim to fame, from like the 90s or something, why is she even doing a interview ?","post_message":"Khia BLASTS Beyoncé & Serena Williams for Making ‘Black People Look Bad’ & The Game Claps BACK: ‘Don’t Yo Neck and Yo Back Hurt?’ [Video]"},{"comment_id":"10152744570508822","commenter_b":"so hard to even win a buck!","commenter_a":"$1 straight Is 50. $1 box is 25","post_message":"The Pennsylvania Lottery is getting a makeover and adding a new game. Check out the changes here: @webpagelink"},{"comment_id":"10153977079018717","commenter_b":"@username i agree there certainly is an issue which needs to be on a high priority list.","commenter_a":"Come on everyone!! Cut the crap!! Humans lives matter!! Nuff said.","post_message":"The owners thought it was a good idea at the time, but a slogan for a restuarant menu item has turned into a controversy!"},{"comment_id":"1033268563393975","commenter_b":"Build the wall already and gas up the coaches to take the illegals home!","commenter_a":"Scumbag democrats and other illegal scumbags.","post_message":"PROTEST TURNS VIOLENT OUTSIDE TRUMP RALLY: \"There won't be no United States without Mexicans.\" [Video]"},{"comment_id":"10155063304006350","commenter_b":"She's 100% right. She's a true narcissist, there would be no room for a child.","commenter_a":"not everyone is and that's totally fine. I hate when people keep asking childless women and insisting. LEAVE THEM ALONE!","post_message":"One role Oprah Winfrey insists she wasn't suited for: motherhood."},{"comment_id":"10154011395049778","commenter_b":"Women get less pay than men so I guess the bill won't be worth the face value","commenter_a":"I really couldn't careless as long as the bill still spends the same.","post_message":"A woman will appear on the $10 bill beginning in 2020, the Treasury Department said Wednesday."},{"comment_id":"10155489129664657","commenter_b":"Not with a Republican Senate she isn't!","commenter_a":"as soon as these two women are no longer useful they will be out, they are pawns.","post_message":"Uh oh."}]
