[{"comment_id":"10154332643707686","commenter_b":"According to a new Congressional Research Service report entitled Executive Authority to Exclude Aliens, the last 5 presidents have used executive authority to limit or restrict the entry of immigrants and non-immigrants into the U.S. a total of 43 times. Ironically, it appears that President Barack Obama used this authority more frequently than any of his predecessors, exercising it a total of 19 times during his two terms in office. Here's the breakdown of how many times each of the past five presidents issued such orders: Ronald Reagan - Five times George H. W Bush - One time Bill Clinton - 12 times George W. Bush - Six times Barack Obama - 19 times","commenter_a":"Waters, Polosi, Shummer, Warren and a whole bunch of other libtards need to be slapped up side thier heads.","post_message":"Rep. Maxine Waters:  'I have not called for the impeachment (of President Donald Trump) yet. ...'"},{"comment_id":"1307228812630479","commenter_b":"Yes! !!","commenter_a":"'@username take Alice","post_message":"Thousands of purebred dogs from more than a dozen countries are competing at the annual Westminster Kennel Club Dog Show in New York.  See more photos here: @webpagelink"},{"comment_id":"1391871914162547","commenter_b":"U r an Angela,go take every Muslims come back ur home","commenter_a":"You guys are all so worried about making jokes about Obama. How about we worry about the children who lost their lives and the parents that have to adjust to a life without their babies? My goodness!!!","post_message":"Witness describes seeing the gunman at Munich, Germany, McDonald's, killing children. @webpagelink"},{"comment_id":"10153717565963812","commenter_b":"Your stupid azz obviously don't have kids... More in like you don't need them you ignorant jerk","commenter_a":"Still a criminal","post_message":"Man accused of robbing a credit union told police he needed the money to help pay for his 1-year-old daughter's chemotherapy treatments. 'I guess it was desperation.'"},{"comment_id":"10153721123493132","commenter_b":"Just another hoe looking for her five minutes of fame smh","commenter_a":"Remember when it was shameful and embarrassing to be the other woman.","post_message":"She is no longer an employee of the family."},{"comment_id":"10152955044437293","commenter_b":"The evangelical pastors insist that only God can change the climate and that is an affront to God to claim that Man can do so. The ideologues constantly scream that the scientists, left-wing and Al Gore are in a conspiracy to 'steal our liberty.' using climate change to bring about global government. --- BTW. I am GOP and have been for decades. I also listen to Rush Limbaugh and Mark Levin, but unlike --- what is the word? sheeple? --- I don't check my brain at the door and believe everything I am told, like someon who listens to that 'lamestream media.' --- As for today's GOP, it is nothing like the one that Reagan led. He would not have tried to squash any talk about climate change, prevent any reference to it in schools, or cut funding for research into what is happening in our climate. But that is ...","commenter_a":"The deniers have wax in their ears and a blindfold over their eyes--because they prefer to think that their ideology or religion is under attack by all of this (and are encouraged by the oil and coal companies to believe just that).","post_message":"And scientists are concerned."},{"comment_id":"10154373142406509","commenter_b":"It's bc she's white and rich.","commenter_a":"When you have money the law work for you and when you're poor it don't","post_message":"Tonya Couch, the mother of so-called 'affluenza' teen Ethan Couch, had her bond lowered from $1 million to $75,000 at a hearing on Monday."}]
