[{"comment_id":"10154394638207042","commenter_b":"Christianity in mind? But what Christianity type of Christianity was happening through the genocides..? Lol never been to prison or even arrested but thanks for the weak statements 😁","commenter_a":"Crosses don't belong in public spaces much less public institutions. If you truly believe in your faith, symbols and manmade objects shouldn't matter. Actions and kindness to your neighbors should be more than enough of a display.","post_message":"CROSS COVER-UP: After one family's complaint about a cross displayed on a public school in Staten Island, it was covered up. Now, a community is outraged.   Do you think it should have been covered?"},{"comment_id":"550201625175196","commenter_b":"Totally agree","commenter_a":"Lisa you need these!","post_message":"Laboratory beaker wine glasses 😍  From @webpagelink"},{"comment_id":"10154724995284197","commenter_b":"Good dog. Take a bite out of crime!","commenter_a":"Another morning of bumper to bumper. And another police chase. Thank goodness no innocent people involved.","post_message":"JUST IN: #Milford police said they were pursuing shed burglary suspects down I-95 when it resulted in a crash with one of their own cruisers: @webpagelink"},{"comment_id":"1023389334348744","commenter_b":"freaking australia","commenter_a":"How so they come up with 95 millions years?","post_message":"This bizarre species of shark is thought to date back at least 95 million years."},{"comment_id":"10155339234553132","commenter_b":"Why have this girl on TV really it is ridiculous !","commenter_a":"Take all her electronics away....and Danielle's too!","post_message":"Danielle Bregoli is back, and she not mincing words."},{"comment_id":"10152991778321336","commenter_b":"Illegal aliens beau","commenter_a":"scary stuff","post_message":"More than 100 patients may have been exposed to a potentially deadly 'superbug' at the Ronald Reagan UCLA Medical Center."},{"comment_id":"10154166607743352","commenter_b":"Jail needed for sex scum","commenter_a":"Troubled ladies-counseling needed.","post_message":"What sort of school IS this?! Geography teacher is now accused of lesbian affair with teenager after two colleagues 'had threesome with boy'"}]
