[{"comment_id":"10154077939321636","commenter_b":"Oh and they found no drugs in her system. She was just another drunken slapper who thought she could get rich quick with this story. Oh well it's backfired. Good on him for fighting!","commenter_a":"Might have been found not guilty of rape but his actions on the night highlight that he is a the very least a sexual predator of women and his partner is a disgrace for standing by him, but hay ho she might be into that sort of thing!!!","post_message":"The judge gave the jury a 'route to verdict'"},{"comment_id":"10156822812815725","commenter_b":"your wife is hot","commenter_a":"You alone? Really? No help from anyone? Hmmmm","post_message":"Europe and the U.S. must immediately stop taking in people from Syria. This will be the destruction of civilization as we know it! So sad! It was just announced that as many as 5000 ISIS fighters have infiltrated Europe. Also, many in U.S. I TOLD YOU SO! I alone can fix this problem!"},{"comment_id":"1043060679149891","commenter_b":"The hell with Muslims! If you don't like our national anthem, you are free to leave.","commenter_a":"Immigration without assimilation is invasion. Get out!","post_message":"Claiming they are being oppressed..."},{"comment_id":"1419671894761590","commenter_b":"Serves the liberal illegal lovers right.","commenter_a":"Moron","post_message":"Liberal Governor Just Caught Stealing $115 Million, Who He Gave It To That Will Piss You Off!"},{"comment_id":"10154047129019749","commenter_b":"then they wanna face Russians? :D :P","commenter_a":"Victoria","post_message":"Graduates from Norway's Royal Naval School in Stavanger have shown the Internet they can do more than just march in formation."},{"comment_id":"649171271940118","commenter_b":"So how many times would we pay for the same illegals to be deported again and again and again","commenter_a":"Yes deport all the illegals that are in Our Country, if they can't come in our Country legally then they don't belong here, the illegals are nothing but a drain on our economy, with welfare, food stamps, medical housing and transportation which Obummer is giving them all, and Bankrupting our Country, all at the tax payers expense. I feel that they should have been deported long ago and not allowed to come back into the US since they came in illegally in the first place and those that have done this they should never also be allowed to try for Citizenship to The United States...","post_message":"Donald Trump just showed everyone how much illegals really cost. Enough is enough. Send them all back! Do you agree all illegals should be deported?"},{"comment_id":"10153002038827894","commenter_b":"She has a disrespectful spirit lol","commenter_a":"@username I am still laughing 😂","post_message":"Coko of SWV Throws Shade at K. Michelle & Tamar Braxton's BET Awards Performance, K. Michelle Claps Back 'You're at Home!'"}]
