[{"comment_id":"10153467191368132","commenter_b":"She is definitely showing side boob. I wouldn't let my daughters wear that when they're old enough for prom","commenter_a":"I like the dress! Maybe we should teach our boys to control themselves instead of teach our girls they should feel ashamed of their bodies.","post_message":"What do you think of the open-back design?"},{"comment_id":"10154392573271491","commenter_b":"It's only a temporary ban, you guys make it seem like it's a ban forever and second why is it that USA always has to help the world, we have our own problems to take care of... Maybe once things are clear here and we are able to eradicate a huge chunk of terrorism, because it's honestly never gonna go away completely, then the ban can be lifted... What does it matter where the terrorist attacks that were here came from, people just want to open the borders like its nothing, let's spend some of that money here for once and help American citizens instead of foreigners for once or for now at least...","commenter_a":"She fails to understand we are trying to make sure those same radical Islamists, like the same ones who tried to kill her, stay out of our country. I'm saddened to see a survivor of radical Islamic terrorism can't sympathize with the U.S. trying to prevent terrorists from sneaking in as refugees!","post_message":"Malala Yousafzai: \"I am heartbroken that today President Trump is closing the door on children, mothers and fathers fleeing violence and war.\""},{"comment_id":"467726553428449","commenter_b":"racist ignorant rebooblican whore","commenter_a":"Both parties need to stop!!! Make America Great!!! Both parties are annoying.","post_message":"Obama wants her head, but Ann Coulter is standing her ground. This is bold. She needs our support. Can we get 50,000 'LIKES' for Ann Coulter?"},{"comment_id":"10155094693558628","commenter_b":"Yes! Illegal is illegal. He is enforcing laws that have been ignored far too long! If they want to be here then do it the right way and not look to us to support them!!!","commenter_a":"No","post_message":"Like Opposing Views for more!"},{"comment_id":"660919517348095","commenter_b":"People who live in glass houses shouldn't throw rocks !","commenter_a":"Shame on this evil woman, in my opinion....Netanyahu is a friend, and what he has to say matters...If they, meaning the President, White House and Senators are worried about his visit, then WHAT ARE THEY COVERING UP? That is the question.....Bibi is an honorable man, and Americans trust him, more than someone like Feinstein.....Sit down, and let Bibi speak, Americans want to hear him.","post_message":"Senator Dianne Feinstein says Bibi is ‘arrogant’ when he claims to speak for all Jews. But, she still plans to attend the controversial speech."},{"comment_id":"10150722411999999","commenter_b":"That trains never late Go home Carrie you're drunk! Take your pseudo intellectual rhetoric with you. Of course she'd be singing a different tune if she was raped by a refugee. You're a pig!","commenter_a":"And you don't think they'll do that here?! Able bodied men who cowardly seek refuge instead of fighting for their country tells me everything I need to know about those people. Muslims are known for treating their women as property. They have no rights other than being breed sows. But we should be tolerant of a race of people who worship a sexual deviant that doesn't tolerate any other religion. Where are all these \"peaceful\" Muslims fighting back at these radical Muslims? First person to call me a racist for calling it like it is can open their doors and put their family in danger.","post_message":"The mayor of Cologne suggested that women protect themselves from men by keeping more than an arm’s length away."},{"comment_id":"1174271395944428","commenter_b":"The real Hillary afraid that the porn industry wont donate money to her or maybe they have some film!","commenter_a":"Perhaps under the advice from Bubba, he's planning ahead! Lol","post_message":"Hillary Clinton refused to sign a pledge Monday that would protect children from exploitation by the porn industry."}]
