[{"comment_id":"2026860724207699","commenter_b":"Dumb bitch","commenter_a":"leftist hypocrite","post_message":"Racist blacks cried foul when Republicans wouldn't support the policies of Barack Obama. But what are you if you don't support Trump? For Leftists, a hero."},{"comment_id":"814799585299285","commenter_b":"Yes me to!! We better not be dumb enough to let another one get in like Hillary Clinton! We can't afford to have her ruin our country and drive it farther into the ground than Obama already has!!","commenter_a":"Can't wait for Obama to leave office","post_message":"President Obama will address the nation tonight. He needs to acknowledge RADICAL ISLAMIC TERRORISM! On Friday night in North Carolina, I was asked what I would say to Obama - at this point:"},{"comment_id":"10153661436973352","commenter_b":"She just ain't shit","commenter_a":"I dont get it.. She was turning herself in to be locked up?!? And left the kids in the car......","post_message":"Mother caught leaving 1- and 6-year-old children in a hot car…while she was turning herself into police for doing the SAME thing last month. SHOULD THEY TAKE HER KIDS AWAY FROM HER?"},{"comment_id":"10153333951429575","commenter_b":"We do.","commenter_a":"It's called intuition. But I'm glad it happened.","post_message":"\"I just said I need to go check on him working on the car. I just believe a spirit told me.\" She felt something was wrong with her husband--and she was right."},{"comment_id":"10155896308790354","commenter_b":"I don't know about you folks but I'm sure getting tired of these niggers.","commenter_a":"Buy them a fucken air conditioner, get the money from Jackson's Toyota ripoff !","post_message":"***THIS JUST IN*** The environment is racist!"},{"comment_id":"10153611791381509","commenter_b":"These MEN stand out from the rest. These MEN want there city back. Notice how I capitalize MEN because that's exactly what they are. Black or white it doesn't matter they are sticking up for what they believe in and not backing down no matter what others think of them. These MEN are making a much more powerful statement then all the little thugs running around the street pretending to be billy bad a** that disobey laws and creating acts of domestic terrorism and getting nothing out of it in return. This is a great representation of American pride and power....Stay strong. Respect","commenter_a":"Ijs.... Sounds about right","post_message":"Charred cars and buildings. Hospitalized police officers. Looted and damaged businesses. No school, because it might not be safe for children. That's the stark reality today after a night of riots in Baltimore: @webpagelink"},{"comment_id":"754556321401612","commenter_b":"Tie them by their ankles to a fast moving train!!","commenter_a":"This is the mine set of Muslims. That it's ok . Send their asses back","post_message":"Group Of Muslim Migrants That Gang Raped 16 Year Old White Girl Get Devastating News They deserve much worse than this. What do you their punishment should be?"}]
