[{"comment_id":"10153882907494024","commenter_b":"The monkey bitch and her brood can't be gone soon enough for my taste.","commenter_a":"She complains about the \"house\" she lives in. Is she chained to the wall-?? Just move, bitch-!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"537543736410961","commenter_b":"Elizabeth Warrren for VP on a Sanders/Warren ticket!","commenter_a":"Another socialist","post_message":"“I think that what the Democrats are doing is terrific,” Sen. Elizabeth Warren said. \"We’re out talking about the issues. I look at the Republican debates and the difference between what they’re doing and what the Democrats are doing that really shows who’s on whose side.”"},{"comment_id":"10153714584104087","commenter_b":"She's a pure Red in disguise.","commenter_a":"The PEOPLE are speaking. She's winning by a lot of votes.. doesn't matter what the internet thinks. Real people are voting, and real people are voting for her.","post_message":"Fresh off a commanding win in New York, Hillary Clinton has a 13-point edge in the biggest state up for grabs in next week's primaries."},{"comment_id":"10154837209509657","commenter_b":"Gowdy did you just find out that democraps cant be trusted? I could have told that to you years ago.","commenter_a":"The only thing that will cause changes is to put Hillary Clinton in jail. Make an example of her. Set an example that shows that politicians cannot go around lying and mishandling classified information without dire consequences happening to them. You have got to get that train back up on its tracks.","post_message":"Desperate times call for desperate measures."},{"comment_id":"390922764595794","commenter_b":"Amen","commenter_a":"Amen","post_message":""},{"comment_id":"10153613777506323","commenter_b":"Women shave too.","commenter_a":"Shaving is no fun","post_message":"Periods aren't a luxury. Full stop."},{"comment_id":"10154569293118132","commenter_b":"Her eyes are evil!!","commenter_a":"I think she was beautiful. This story has haunted me since it broke. Her and her daughters seemingly had a lot of love for each other. This is so tragic and so sad.","post_message":"5 things you need to know about Christy Byrd Sheats, the Texas mother who shot and killed her two daughters. (Via People True Crime)"}]
