[{"comment_id":"10153340865359087","commenter_b":"MONEY KEEPS U OUT OF JAIL QUILTY OR NOT u can make bail u are out","commenter_a":"Don't want to go to prison, don't break the law. It's that simple!","post_message":"“It is wrong for corporations to be making profits from the incarcerations of their fellow Americans,” Bernie Sanders said. “I want to see incentives to get people out of jail or prevent people from going into jail.”"},{"comment_id":"936073656538031","commenter_b":"She is the one for the job. Let's go forward not backward.","commenter_a":"HILLARY will be a GREAT PRESIDENT.. #PRESIDENTHILLARYCLINTON2016","post_message":"Matt Lauer asks Hillary Clinton about the qualities that make her qualified to become Commander-in-Chief. More coverage on @webpagelink"},{"comment_id":"1279876618745757","commenter_b":"Why tho. She's the one that slept with em. She's a dirty ass hoe and she got caught. If you were the dude and she wanted to bang you you'd probably do the fuckin same","commenter_a":"All you guys are saying he shouldn't whip his ass if you listen to the video he is calling dude out by his name so he obviously knows him which means he probably knows them I'm not gunna lie call me what you want but I'd whip dudes ass too","post_message":"He had rage behind each blow! #WSHH"},{"comment_id":"10153356332992169","commenter_b":"Going to watch all the seasons leading up to it. I'm so excited, but already sad it's the last season.","commenter_a":"I CAN'T WAIT!!!!!","post_message":"NEW Downton Abbey video: Seeing is believing! The Final Season premieres Sunday, January 3 at 9/8c on MASTERPIECE | PBS (Masterpiece Theatre)."},{"comment_id":"891579364198188","commenter_b":"You're right. It just seems women are more selective.","commenter_a":"How about guys? It is not just all women!","post_message":"Well this is horrifying. (via The Huffington Post)"},{"comment_id":"867742276749682","commenter_b":"You are a liar and a piece of shit!","commenter_a":"Yes","post_message":"Obama just gave Trump hell for complaining about the voter fraud but look what just happened. This goes to show you the sickening corruption that's happening in our country. Do you think the election is rigged?"},{"comment_id":"878303132360263","commenter_b":"Just like your whore mother.","commenter_a":"That's no lady. It's a MAN !!","post_message":"Here's the ugly truth about MOOCHELLE. This is disgusting. Do you think Michelle is the worst first lady in history? Comment 'yes' or 'no'!"}]
