[{"comment_id":"10153283210126770","commenter_b":"Stupid people","commenter_a":"Go back to sleep.","post_message":"MSNBC host Melissa Harris-Perry criticizes the Democratic presidential field for being anemic, old, and “whiter than the Oscars.” Read more: @webpagelink"},{"comment_id":"10153707515144778","commenter_b":"Laura, by all means move to Georgia and so you can all the naked men you want.","commenter_a":"A Georgia police officer shot and killed a naked, unarmed man at an apartment complex Monday and this is local news because?","post_message":"A Georgia police officer shot and killed a naked, unarmed man at an apartment complex Monday. What exactly happened is now being debated."},{"comment_id":"10155694737870294","commenter_b":"Why not?! Criminals can do it like gun-free zones didn't exist!","commenter_a":"Doesn't matter they'll do it anyway.","post_message":"Even if it passes, each university would still be able to decide if they wanted to allow guns on their campus."},{"comment_id":"524989287704578","commenter_b":"Build the wall","commenter_a":"Hillary has been in the lime light for 30 years first lady, senator of New York, Secretary of state, and i can not think of one good thing she has done, nothing prolific, nothing of any worth, and i see a successful business man. Oh the choices","post_message":"WATCH: Donald J. Trump hosts campaign rally at the Fox Theatre in Atlanta. @webpagelink"},{"comment_id":"10153622833731519","commenter_b":"She says what her market wants to hear. She, and all the ilk like her, are just media whores who spout filthy hate and get PAID big bucks for it.","commenter_a":"At least she didn't say that we need to keep the tradition of having only presidents on our currency.","post_message":"Greta Van Susteren nearly gave herself a rage stroke last night..."},{"comment_id":"10153551995732217","commenter_b":"Darn foreigners, coming over here putting mosaics under our gardens....","commenter_a":"Claire O'Regan","post_message":"This farmhouse owner was renovating his barn in Wiltshire when he uncovered... a Roman villa built around 200AD 😮 Full story: @webpagelink"},{"comment_id":"10153321594333812","commenter_b":"Hahahahahaha","commenter_a":"what strong messages? I thought she deleted all her messages. lol","post_message":"President Obama says Hillary Clinton will have \"some strong messages to deliver\" if she runs for president. @webpagelink"}]
