[{"comment_id":"10156846569325354","commenter_b":"Get a life lady.","commenter_a":"Freedom of speech is the culprit! Quick! Stop that first amendment drivel!!!","post_message":"It's starting..."},{"comment_id":"1667152256905944","commenter_b":"Why do we have this question. If they are illegal the only right is to be fed on their plane ride back home. On the other hand I have the right to protect my family, land and myself from these criminals. If they have kids then they have a choice, leave with the kid or leave without the kid and never see him or her again. All connections to the child will be erased from our records so you can't track them.","commenter_a":"They are NOT U.S. Citizens, so they shouldn't be allowed to vote.","post_message":"I agree!"},{"comment_id":"10153551321648984","commenter_b":"A coal burning slut","commenter_a":"Kardashian is nothing more than a SLUT! Don't watch anything to do with her, PERIOD!","post_message":"Look out, Kim Kardashian. I don't think you realize who you're messing with...  Do you side with Megyn Kelly on this one?"},{"comment_id":"10157695745225354","commenter_b":"Kanye and his fat ass bitch are 2 POSs.","commenter_a":"Yezzy? I think he probably meant sleezy.","post_message":"FIRESTORM as Twitter backlash grows.   Read the TWEETS:"},{"comment_id":"762861520482540","commenter_b":"Your lady isnt going to win lol thats a joke","commenter_a":"Hmmm but notice how all places she wins have issues with the polls.. Shes a cheat and a fraud whos bought out..","post_message":"Bernie Sanders went just one for five on Tuesday, bagging only Rhode Island."},{"comment_id":"893350990721431","commenter_b":"She's not getting my vote","commenter_a":"Go Hillary!!! :)","post_message":"All across the country, people are working hard and making plans for their futures. Hillary is getting started too. Be a part of her campaign from the very beginning:"},{"comment_id":"1219889091393445","commenter_b":"Is it racist to say pot calling kettle black ?","commenter_a":"Cummings is a walking violation of ethics. Pot call.","post_message":"Whoops."}]
