[{"comment_id":"10153216973363855","commenter_b":"Good let the idiots divorce","commenter_a":"overinflated sense of their own importance much? idiots","post_message":"Here's to a speedy divorce!"},{"comment_id":"10153155479946051","commenter_b":"I take it, SHE is a woman who likes to dress as a man.","commenter_a":"Disgusting","post_message":"This soldier has been told point blank: You must wear a female uniform if you want to participate."},{"comment_id":"654971807960745","commenter_b":"Fake fugly whore.","commenter_a":"can she get her face redone?","post_message":"This woman wears a corset for 23 hours a day. She has also had 4 breast enhancements, a gastric bypass, and two nose jobs. She says she finally has the most perfect body in the world.   Do you think she has a perfect body?"},{"comment_id":"10154089965446336","commenter_b":"Yeah, lice likes very clean hair. If you put products in their hair it's likely they won't get it. Oily hair care products are","commenter_a":"It's not super lice it's called...ignorance. Schools inform by sending a note that lice has been found in the classroom. The person is not identified at all..not even to the parent. Infested child goes untreated. Why? The same reason some are abused and some are not, the same reason some parents care about their children and others don't. Children are going untreated and/or not treated properly. This has been going on for years.","post_message":"What can you do if your child is affected?"},{"comment_id":"10153087486466162","commenter_b":"She is hot","commenter_a":"Sicko","post_message":"STUDENT SAYS THEY HAD SEX AGAIN: A high school teacher charged with having sex with several students is back in jail after one student claimed that they continued to have sex while she was free on bail @webpagelink"},{"comment_id":"10153179280538690","commenter_b":"Learn to convey your thoughts properly before getting all nationalistic. It makes you look even more ignorant than you already are for making such a bigoted comment.","commenter_a":"I think some American got fid up angry because some Muslim in America lived there got passport got education and freedom, then they turn back against Americans burning their flag and terrorizing people.","post_message":"Police have not yet given any possible motive for the attack. The hashtag #ChapelHillShooting  has gone viral, many of the tweets criticising the US and other Western media for not covering the shooting.   @webpagelink"},{"comment_id":"717976815002166","commenter_b":"Did you read what I said? Or did I lose you after ESPN? By law, you cannot force someone to give up their body, body parts, body tissue to ANYONE, regardless of their life being in danger. So you can't force a woman to give up her body and blood and essence to someone who you've notably identified as a completely other person. And ps, bananas also have their own DNA. Oh shit looks like we can't eat fruit.","commenter_a":"I read Planned Parenthood does 30% of all abortions. Who is doing the rest of them?","post_message":"Appalling on every level. THEY MUST BE STOPPED!"}]
