[{"comment_id":"10153456187686615","commenter_b":"That chick must be high","commenter_a":"Please everyone lets leave her in an empty room. I seriously don't understand how anyone could like her!!","post_message":"JUST IN: Hillary Clinton's campaign says the Democratic presidential candidate will be making a stop in Pittsburgh next week."},{"comment_id":"10154047857863855","commenter_b":"Fake, phony and fraudster. Being a lesbian gave her no special privilege to ripoff people","commenter_a":"Bet she didn't see that coming!?","post_message":"RIP Youree Harris."},{"comment_id":"1056318254456150","commenter_b":"It's not an illusion. It's fact. Nothing like this has happened in 38 yr. Life comes with no guarantees. Accidents happen!","commenter_a":"Yeah, but I'm sorry . . . Disney has created this illusion of fantasy and safety. The illusion that one can experience fear and threat in a safe environment. In fact, they have made millions (billions) of dollars designed on that premise!","post_message":"\"This is Florida, and it's not uncommon for alligators to be in bodies of water.\""},{"comment_id":"10154936291493088","commenter_b":"> I don't know why it's impossible to believe it will happen again. Shane Those that are better informed than you are agreeing on this, big time, using measurements, not belief. You can't use your logic&belief on things that have happened over millions of years with this, that has happened over a range of 50 years. Keep reading up on this because you're getting very close.","commenter_a":"While I won't support any of Donald's nominations, I think climate change has always been around, long long before humans. And much longer still before the industrial era. The earth has been a waste land before, and it's also been a water world. I don't know why it's impossible to believe it will happen again.","post_message":"I will vote NO on the nominations of Scott Pruitt to be EPA Administrator and Rick Perry to be Secretary of Energy. The scientific community is virtually unanimous. Climate change is real, it is caused by human activity and it is already causing devastating problems in this country and around the world. We need an EPA Administrator and a Secretary of Energy who are prepared to stand up to the fossil fuel industry and their short term profits, and lead the fight to transform our energy system away from fossil fuels to energy efficiency and sustainable energies. In discussing these issues with Mr. Pruitt and Mr. Perry I found no evidence to believe that they are prepared to do that."},{"comment_id":"10152962778127411","commenter_b":"Not in Texas! It's illegal!","commenter_a":"So the f what....... it's not illegal to smoke marijuana. The question is, how'd she get it while in custody? Aren't all the jails covered in cctv cameras? Where is the footage? WHO gave her the weed? is that also the same person who murdered her?","post_message":"SANDRA BLAND: A toxicology report has been released showing the levels of THC in Sandra Bland's system were so high, some experts believe she either smoked marijuana in jail or was a chronic pot smoker."},{"comment_id":"10153055349059170","commenter_b":"Nah he's not Indian. Fake birth certificate. He wants his muslim army to overtake America.","commenter_a":"Bobby has it right. He's a great Patriot. Would make a great president.","post_message":"To those who want to silence talk of God - because they're afraid of how it will affect election outcomes - reconsider your priorities. Looks like Bobby Jindal has this right. (And in no way did he mean what is critic here thinks he meant.)"},{"comment_id":"965586620162170","commenter_b":"Scumbag","commenter_a":"....too many \"GUNS\" on the street....and who is holding these guns????? The criminals, thugs, refugees, muslims, and other monsters that are given free reign and encouragement to commit these crimes against innocent citizens! Another elected official with his head up the governments butt!","post_message":"BREAKING…CAUGHT ON TAPE: 30 Yr Old MUSLIM MAN Ambushes, Shoots Philadelphia Cop Several Times “I’m shot. I’m bleeding heavily!” Muslim shooter says he did it \"In the name of Islam\" When Obama's War On Cops and Islamic Terror collide...."}]
