[{"comment_id":"1334326533266897","commenter_b":"For the first time in American history a foreign hoe for first lady","commenter_a":"I wouldn't be Melania - even for a billion dollars!! I lived with a narcissist. She has my pity! I'm sure she is paid well to stay with him, and her frozen Botox face and designer wardrobe says it all.","post_message":"Politics aside, Melania Trump's modeled some winning looks on the campaign trail."},{"comment_id":"10153815674903299","commenter_b":"Funny how y'all are judging but if you think you're perfect you're wrong. Trump may not be perfect but at least he's not selling out to the ones trying to take away our Christian beliefs.he wants Christian morals back in our schools and families and I don't care about the rest. God will handle the rest. If Hillary gets in you better learn Sharia law because shes already sold out. At least we have a chance with trump.","commenter_a":"1168434116541793maybe you should research Hillary 100% lies","post_message":"\"What you really have to do is you have to pray to get everybody out to vote for one specific person.\""},{"comment_id":"748895108560603","commenter_b":"Wonder where she got those mouth sores?","commenter_a":"from people that scream to be treated fairly the gay community and its supporters sure spew a drastic amount of hate.","post_message":"It's good for thee but not for me. -1000pts. @webpagelink"},{"comment_id":"10154278216444138","commenter_b":"Ridiculous. Killing all of these gators will not accomplish anything","commenter_a":"Let this had been a black family in a gorilla cage. The media would have been outraged about these alligators lives being snuffed out because of these negligent parents! If is says restricted or no swimming, then they should have checked with the lifeguard before putting their child in harms way!!! Not fair to those alligators and MOST DEFINITELY a tragedy for that child. There are terrible parenting skills on both sides. Black and white. Animal rights should have been on this just like Harambe. But then again, it was never about the animal. These parents should have been charged with the endangerment of their baby. Period.","post_message":"A total of six alligators were removed."},{"comment_id":"10153561186861323","commenter_b":"Unfortunately that's just not true. Gangs control the production in the UK just like they do everywhere else. @webpagelink","commenter_a":"80% of cannabis consumed in the UK has been grown here. Your argument on that level is invalid.","post_message":"Jay Rayner: \"We are, it seems, living in the age of the wonky moral compass: of middle-class couples who swear by their weekly organic veg box, and yet relax after dinner with a line of something produced by impoverished, subjugated Bolivian peasants.\""},{"comment_id":"10153161345041336","commenter_b":"Good for the wife!!!","commenter_a":"Hooray!!!!! McDonald is hiring!","post_message":"Donald Sterling gave his mistress V. Stiviano a Ferrari, Bentley, and Range Rover and also covered the majority of her $1.8 million duplex.  But his wife, Shelly Sterling, just got it all back."},{"comment_id":"958116217578241","commenter_b":"Hillary had two terms (8) years in the White House. Hillary was involved in everything bill Clinton did!! Hillary had two terms (8) as a New York senator. Hillary had a term (4) years as Secretary of State. Yet, the old girl thought she could have her own server and NOT be held accountable for classified emails... When are Americans going to get pissed enough to hold the shrew responsible?? Hillary left four AMERICAN men to be tortured until dead in Benghazi. Could this be what she and her aids are hiding? As of Friday, as per a JUDGES order nothing has been turned over. The two aids hide behind an attorney and Hillary just never answered... Monday such be very interesting!","commenter_a":"She needs to STOP Monsanto instead of defending them. We all have a right to know what is in our food.","post_message":"Join Hillary's fight to build an America where we don't leave anyone out or anyone behind: @webpagelink"}]
