[{"comment_id":"10153542667459087","commenter_b":"Liberal democrats won't be happy until every city in this country looks like this..","commenter_a":"Trump could tell a Muslims being shot with bullets dipped in pigs blood story and his support will continue to grow.","post_message":"“He took 50 bullets and he dipped them in pig’s blood,” Donald J. Trump said. “And he had his men load his rifles and he lined up the fifty people, and they shot 49 of those people. And the 50th person, he said, ‘You go back to your people and you tell them what happened.’ And for 25 years there wasn’t a problem.” WATCH:"},{"comment_id":"10153346238078690","commenter_b":"Still as barbaric as before, that was why it was difficult for Mandela to organized them and fight for free. That is why he has to do it on his own. Animals never changes.","commenter_a":"Free from the ravages of inteligence and absolutely racist !","post_message":"Thousands expected to march in South Africa against attacks on foreigners @webpagelink"},{"comment_id":"10152980958545399","commenter_b":"This may help. My feelings as a Christian points me to my Lord and Savior as a fighter. It points me to the man who once in loneliness, surrounded only by a few followers, recognized these Jews for what they were and summoned men to fight against them and who, God's truth! was greatest not as a sufferer but as a fighter. In boundless love as a Christian and as a man I read through the passage which tells us how the Lord at last rose in His might and seized the scourge to drive out of the Temple the brood of vipers and adders. How terrific was His fight for the world against the Jewish poison. To-day, after two thousand years, with deepest emotion I recognize more profoundly than ever before in the fact that it was for this that He had to shed His blood upon the Cross. ...","commenter_a":"Just what was the religion of the people loading Jews into ovens in Europe?","post_message":"\"When you take Christianity, Judaism, Hinduism, Buddhism, whatever, their combined killings in the name of religion -- well that number would be zero.\""},{"comment_id":"10154392573271491","commenter_b":"It's only a temporary ban, you guys make it seem like it's a ban forever and second why is it that USA always has to help the world, we have our own problems to take care of... Maybe once things are clear here and we are able to eradicate a huge chunk of terrorism, because it's honestly never gonna go away completely, then the ban can be lifted... What does it matter where the terrorist attacks that were here came from, people just want to open the borders like its nothing, let's spend some of that money here for once and help American citizens instead of foreigners for once or for now at least...","commenter_a":"She fails to understand we are trying to make sure those same radical Islamists, like the same ones who tried to kill her, stay out of our country. I'm saddened to see a survivor of radical Islamic terrorism can't sympathize with the U.S. trying to prevent terrorists from sneaking in as refugees!","post_message":"Malala Yousafzai: \"I am heartbroken that today President Trump is closing the door on children, mothers and fathers fleeing violence and war.\""},{"comment_id":"1016709065044307","commenter_b":"Camille Valdez I don't think nothing would of happened if she was there unless she a trouble maker","commenter_a":"Cesar Chavez beginning down 9 days and not going to that school and it's Mexicans vs. blacks that's what it is there's going to be War","post_message":"#ALERT Police are at the scene of Cesar Chavez HS where several fights have broken out."},{"comment_id":"1162973243743146","commenter_b":"@username haha why does she always look psychotic?","commenter_a":"Bristol Is Pregnant Again Because...","post_message":"Hypocrisy at its finest."},{"comment_id":"1178752805478081","commenter_b":"Sick the American get off this privacy","commenter_a":"If someone comes to my door wearing that outfit,I will personally egg them.......","post_message":"It's nowhere near October, but one ensemble is already on track to be named the most controversial Halloween costume of 2015."}]
