[{"comment_id":"511047909019803","commenter_b":"Throw that racist bitch out the door!","commenter_a":"BLM, Black Panthers, Farrakhan -- any of those available? Why would you not use them since you hold them in high esteem?","post_message":"Beyonce bashed cops at the Super Bowl but is now asking for their help. They want her to find a way to protect herself."},{"comment_id":"10153722267976509","commenter_b":"The Duggars are not Christians. They are members of a sex cult","commenter_a":"Your son molested four of your children and you tried to keep it secret? Disgusting! I'm going to pray for you when I take my birth control.","post_message":"Four of the five girls #JoshDuggar molested were his sisters, their parents said in an interview with Fox News anchor Megyn Kelly. @webpagelink via CNNMoney"},{"comment_id":"10154318850908010","commenter_b":"Round them up & deport them!","commenter_a":"You darn California bed wetting liberals are scared, #Trumps going to take your benefits and make you get a job.","post_message":"Some Trump hats were set on fire."},{"comment_id":"10153947614518855","commenter_b":"They have tiny dicks lol","commenter_a":"@username @username she was a grindho","post_message":"Surprised?"},{"comment_id":"10155429913146509","commenter_b":"But his enabler wife is","commenter_a":"Supporting a blatant sexual predator. Nice. And btw bill is not running for office","post_message":"House Speaker Paul Ryan said he will no longer defend Donald J. Trump, but he did not say whether he'd reverse his endorsement of the GOP candidate."},{"comment_id":"10153873855796037","commenter_b":"He was perhaps just as bad but we will all suffer the negative consequences of their actions.","commenter_a":"Obama's abuse the executive privilege and failure to uphold the constitution has set a dangerous precedent for all those who follow, whatever political party they may belong to...","post_message":"Here’s why President Barack Obama’s actions could empower Donald J. Trump’s Muslim ban in the future."},{"comment_id":"1786899774881601","commenter_b":"All you liberal women should really read this. You don't know who Hillary is. @webpagelink","commenter_a":"Don't continue to fall into Hillary's trap; she's laughing and the Press loves it....forget the Bimbo beauty queen of years past; we have urgent needs in this country that must be addressed and fixed, not to mention Christians being slaughtered by ISIS.","post_message":"'Donald Trump is ready to lead.' Gov. Mike Pence"}]
