[{"comment_id":"10153920476909614","commenter_b":"Silly girl!","commenter_a":"@username - this is the women I was referring too.","post_message":"It was just two years ago today that iconic singer Natalie Cole performed \"This Will Be (An Everlasting Love)\" during the 125th Rose Parade. Following news of her death, this clip from the KTLA archive seemed like an appropriate tribute to the nine-time Grammy winner. Cole died Thursday evening at L.A.'s Cedars-Sinai Medical Center due to complications from ongoing health issues, according to a family statement provided to the AP. Read KTLA's story here: @webpagelink"},{"comment_id":"1169592283127367","commenter_b":"She wears a 12.700.00 oven mitt! And Bulaps sacks look good on her too!! #TRUMP2016","commenter_a":"Ever notice how the Sign for Trump and Pence sound like Trumpets? Could be echoing the arrival of the Four Horsemen.","post_message":"Donald J. Trump, Sen. Joni Ernst, and others campaign in Iowa at the Iowa senator's second annual Roast and Ride."},{"comment_id":"1169723563063063","commenter_b":"SHES ONE HELL OF ALOT BETTER THAN THE TRANNY AMERICA HAS PARADING AROUND AS A WOMAN NOW! THE TRANNYS NAME IS MICHAEL! ODUMBASS LOVES HIS GAYS! DAMN THAT IS ONE BUTT UGLY GORILLA FAVED TRANNY! MELANIA HAS MORE CLASS IN HER CRAP THAN THE TRANNY HAS IN HIS WHOLE BODY! P.S. TUCK THAT SCHLONG TRANNY!","commenter_a":"Agree","post_message":"I agree!"},{"comment_id":"10153703275114384","commenter_b":"Whine, whine, whine. All the illegals will vote for hand outs, what more do you corrupt fools need? Lying POS!","commenter_a":"BLUE ALL THE WAY!!!","post_message":"It is inexcusable for Republicans to have left town without acting to restore the Voting Rights Act. Click LIKE if you agree: Nothing should stand between American citizens and their most sacred right to vote."},{"comment_id":"1890349187852006","commenter_b":"One does not have to TRY to cast america in a bad light..... The racists & Nazis here do a good enough job by themselves. America is NOT great, & will never be great again until the cancer which arrived here In 1492 is removed. Swim back to Europe racist beast","commenter_a":"Stupid, stupid, stupid. I only still like this site cuz i wanna read what propoganda u spew next. Has anybody else thought that this site is communist run, or pro russian. They always try to find ways to cast the US in a very bad light","post_message":"OMG, did you hear? $$ Dump: @webpagelink DAPL Raid: @webpagelink Drone Bomb: @webpagelink Join Us: The Free Thought Project"},{"comment_id":"587659781407559","commenter_b":"I bet those predestinarians didn't know anything about her past !","commenter_a":"Please just drop out Hillary! Give Bernie a shot!","post_message":"A special moment with a (new!) supporter and his mother in Henniker, New Hampshire."},{"comment_id":"10157702092900354","commenter_b":"And yet she's still allowed to run for POTUS... And there are still fools who will vote for her","commenter_a":"They thought no one would ever notice .","post_message":"The Clinton Cash Foundation is a $2 Billion Corruption Racket."}]
