[{"comment_id":"10153167804586770","commenter_b":"What size cupp is she?","commenter_a":"can't be any worse than Obama.","post_message":"S.E. Cupp: \"I don't know how Trump's surrogates can sleep at night peddling this unconstitutional, un-conservative, and un-American garbage that is, frankly, from a guy that is never going to be president.\""},{"comment_id":"10152746450450326","commenter_b":"They are the real terrorists. They need to be stopped.","commenter_a":"Why should they have anything to say about what we do... We don't tell these evil men what to do.","post_message":""},{"comment_id":"10153127710904726","commenter_b":"This woman is as stupid as she is ugly!","commenter_a":"Brilliant question.","post_message":"WATCH: State Department is called out: Why Have Russian Hackers Seen More Emails Than American Public?"},{"comment_id":"10153283124151316","commenter_b":"Blackie Chan where does a gorilla get his protein? The gorilla does not eat any meat, This beast can throw a 200lb man across the street with one arm....maybe dark greens.....","commenter_a":"What's your protein source?","post_message":"Man says raw food diet has made him 'almost superhuman'... @webpagelink"},{"comment_id":"10153133870041350","commenter_b":"Girl, u r so crazy. LOL!!","commenter_a":"I'm from the old school. My house, my rules. If a child misbehaves, I don't wait for the parents to take action; ESPECIALLY if the little brat hits me. I'll tear that ass up. I wish my daughter would have acted up at someone else's house to the point that they would even have to consider disciplining her. They wouldn't have time because I'd been on her ass. Don't like it, keep the little untrained savage home.","post_message":"Do you think it's OK to discipline someone else's child? Share your opinion in the comment section below. #OrangeRoom"},{"comment_id":"10154789481757235","commenter_b":"@username Pls don't compare Trump to pigs. Pigs are wonderful.","commenter_a":"Fantastic job, Trump Team. Scare the crap out of everyone, then disavow. Keystone Kops got nothing on you.","post_message":"AWKWARD!"},{"comment_id":"10150734990144999","commenter_b":"Now it's time to loathe Coldplay, then in ten years, we can appreciate them again.","commenter_a":"Never heard of anyone hating him I think this is a media thing thought up by some little intern that thinks he was being smart","post_message":"After decades spent as the target of jokes and sneers, Phil Collins is getting a fresh look."}]
