[{"comment_id":"895683467194573","commenter_b":"He's not crazy, his mother had him tested!","commenter_a":"I know he's an idiot","post_message":"President Paul?"},{"comment_id":"10153209724819575","commenter_b":"You guys do understand that chickenpox is much worse and more dangerous to adults than children, right? And what about those babies who are too young to be immunized? The point is to vaccinate your children so that diseases like \"only chickenpox\" can be eradicated!","commenter_a":"OH MY GOD ITS THE END OF THE WORLD! Fear porn at it's finest.","post_message":"Carmel Clay Schools sent a letter to parents explaining that cases of chickenpox had been confirmed. The school system has not revealed the amount of confirmed cases."},{"comment_id":"10152746450450326","commenter_b":"They are the real terrorists. They need to be stopped.","commenter_a":"Why should they have anything to say about what we do... We don't tell these evil men what to do.","post_message":""},{"comment_id":"10154724312199486","commenter_b":"Yes come here and get shot!!! That will have them flooring in!","commenter_a":"Chicago will soon see that President is higher than Mayor...Fucktards!","post_message":"NAILED IT."},{"comment_id":"10155112416861729","commenter_b":"Just ignore the cockroach she will leave.","commenter_a":"Whoever voted already needs to go and vote again in November 8th! We have learned (thanks to Hillary ) that we can vote multiple times! That way the democrats won't be able to control all the votes!!","post_message":"Your feel-good story of the day, folks!"},{"comment_id":"904059146360453","commenter_b":"She is earning her check! hahahahha WTF! I just can't with this crazy woman!","commenter_a":"Maybe she's trying to help Hilary??","post_message":"Donald J. Trump campaign manager Kellyanne Conway said she wished her candidate had more opportunities to debate and would \"be willing to do another one if somehow they can squeeze it in.\""},{"comment_id":"690460261111351","commenter_b":"spelling lady...... come on now.","commenter_a":"I think I will get off here and work. Better than listening to his lioes","post_message":"Watch LIVE as President Obama speaks at a town hall at Fort Lee. Do you know someone taking part in the event?"}]
