[{"comment_id":"10153862948491523","commenter_b":"You think women put these objects in themselves? This was a product recommended and approved by from their doctors. STFU","commenter_a":"Stop putting foreign objects in your body!","post_message":"Some of the women experiencing adverse affects from Essure are relieved to get hysterectomies to get the coils out."},{"comment_id":"10154028349033812","commenter_b":"@username because I CAN and honestly sick of hearing about that dn women people KILL THERE SELF everyday she's no damn different","commenter_a":"I always knew something was wrong with the story could not understand why","post_message":"Texas trooper who arrested Sandra Bland surrendered to police after being charged with perjury."},{"comment_id":"714217398680845","commenter_b":"Kill all the bad muslims!!","commenter_a":"Muslim POS","post_message":"And he's wasting no time launching his attack..."},{"comment_id":"10153258824720329","commenter_b":"You know me too well","commenter_a":"Renda Rachel Sabrina","post_message":"WIN"},{"comment_id":"10153237461976367","commenter_b":"You ladies make a youngen proud :))","commenter_a":"As an older feminist, I have looked forward to the chance to vote for a woman for president for many years. I will be voting for Senator Sanders instead because his willingness to look at everything and proposed changes would improve the lives of millions of Americans. Women and men. A rising tide floats all boats.","post_message":"Would Sanders or Clinton do more to improve the lives of women in the United States?"},{"comment_id":"10153899395243701","commenter_b":"Please take time to familiarize yourself with actual case law on this subject. Anyone under the influence of drugs or alcohol cannot legally consent to any sexual act. It makes no difference if she got that way voluntarily or involuntarily. YOU CANNONT CONSENT IF YOU ARE IMPAIRED. This is called rape","commenter_a":"I question this case also .... According to the accuser, Cosby urged her to take pills and to drink wine...... Urged her to do so??!!! So she did it to herself! I highly doubt an educated woman would take pills and drink in a room with one man without knowing the out come!! Personal responsibility is what all these people are not understanding! Read more: @webpagelink","post_message":"JUST IN: Bill Cosby has now officially been charged with sexual assault more than a decade after a woman told police the comedian drugged and violated her at his home near Philadelphia."},{"comment_id":"879835912051831","commenter_b":"I wish her big mouth would go away ; what a disgusting woman","commenter_a":"A message for Rosie. It is one thing for people to think you ignorant and it is another for you to open your mouth and prove it.","post_message":"Tom Selleck is awesome!"}]
