[{"comment_id":"1091887850889750","commenter_b":"She is a POS racist cluck bum bitch and NFL you Scumbag should give all the ticket holders half their money back","commenter_a":"What about the planners of NFL Super Bowl did they not know what her performance was about there's a little bit more to blame then just solely on Beyonce. The Super Bowl planners NFL new what hurts halftime show was about was not announced or advertised of being such as low blow off base nutcase to let it going on so take that NFL maybe you should pay attention what's going on around you to","post_message":"Last weekend Beyonce got to have her racist fun at the Super Bowl. But now she's gotten some massive bad news. Looks like you can't go off and support cop killers without having to pay a big price later on. Boom!"},{"comment_id":"10153070826933701","commenter_b":"hes a fag it","commenter_a":"Nope!","post_message":"Heisman winner Marcus Mariota on the loss of wide receiver Darren Carrington to a failed drug test: \"We'll get another guy that's ready to go.\""},{"comment_id":"1050080195049016","commenter_b":"another dumb btch","commenter_a":"So Donald Trump you are not the savior we need for this country, I do not think you will bring jobs or prosperity when you do not even pay great wages for people that work for you. I think you are a disaster waiting to happen, you really belong in a reality series not president, I hope the people wake up before you end up our dictator","post_message":"ICYMI: Ivanka Trump took the stage in South Carolina and said, “My father is an incredibly hard worker and he’ll be working for each and every one of you.” (CC: Donald J. Trump, Sean Hannity)"},{"comment_id":"1663183500635910","commenter_b":"That sumbitch looks like death warmed over.","commenter_a":"Soros is a subversive ShitBag and should be brought up on charges.","post_message":"George Soros is a _____________."},{"comment_id":"10153810770121336","commenter_b":"A woman who associates with a child abuser (most especially her own child's abuser) should not be allowed on television ! Creepy woman !","commenter_a":"Nope - why? She broke?","post_message":"Will you watch?"},{"comment_id":"1188696831170787","commenter_b":"Because they're redneck, uneducated, bible thumping, gun grabbing Trump supporters who own arsenals, and the desire to kill a living being just eats at them so they kill innocent animals. Because that's what republican Jesus would do!","commenter_a":"They must have been upset that their sisters wouldn't fuck them... #NationalTrailerPark #YallQaeda","post_message":"Gun violence also affects those who have no voice to speak against it."},{"comment_id":"1304157179622515","commenter_b":"Is there any difference at all in Trump utilizing Twitter and Chinese Commie rulers using a a newspaper as their mouthpieces? What does China have that we don't have besides lots of bodies? The best thing they know how to produce is garbage.","commenter_a":"China, wallstreet, and our own government have been pissing down our collective backs for years, and telling us it's good for us because it's just rain.","post_message":"That's quite a bark, but do they have the bite to back it up?"}]
