[{"comment_id":"10154403319313812","commenter_b":"On their engines a 100,000 is a lot, only had to do my head gaskets or have a burned out valve. Meanwhile my duratec engine in the Mazda hit 300,000 with little power loss. We do love or did I should say our new 2016 Outback for the whole 600 miles we had it till yesterday it was the 85th car at the single dealership to be towed away to some lot in the middle of slc airport till god knows when Subaru can pull their head out and get entire steering colums to replace.","commenter_a":"I have 4 Subaru's in the family 2005, 2008, 2010, 2012. Three foresters one Tribeca. They all have been great. never had an issue with any of them. Two of them are over 100,000 miles. Love my Subie!","post_message":"RECALL ALERT: Subaru of America, Inc. recalls 52,000 cars and SUVs over potential steering failure and warns owners not to drive them."},{"comment_id":"10153986689364916","commenter_b":"\"Ever sinned bitch?\" Christ would be so proud @username","commenter_a":"Umm...which value first? Cheating on your wives (plural). Coveting your daughter? Bigotry? Hate? Self- love? Love of money? The commandment \"Love your neighbor (does not say except Muslim, Black and/or Hispanic) as yourself\"","post_message":""},{"comment_id":"10153545736202014","commenter_b":"You are obviously ignorant to what really goes on behind bars. I hope you have the opportunity to find out one day. You are only one mistake away.","commenter_a":"He is the best thing for Maricopa County in so many ways - everyone needs to experience what it is like when you do not have a Sheriff Joe - it is shear chaos - the prisoners have the power and control - Bless Sheriff Joe and i wish we had more like him . So yes yes yes from me","post_message":"YES or NO: Do you approve of Joe Arpaio's job performance?"},{"comment_id":"10154085649949203","commenter_b":"almost half of your stupid bitch ass country was from Mexico. We should take it back since ya'll going to hell with trump.","commenter_a":"My grandfather served in the punitive expedition. A forgotten incident in our history.","post_message":"It has been 100 years since the first act of terror on U.S. soil."},{"comment_id":"10153559818581519","commenter_b":"I guess you Hillary Shills were just waiting for me to log back in to kick your asses right?","commenter_a":"The West Coast was MADE for Bernie Sanders... If Washington State has gone for him overwhelmingly you can expect California and certainly Oregon to follow suit. We need this man as President! The greed of the 1% cannot continue!","post_message":"3 reasons why Bernie Sanders won’t give up"},{"comment_id":"1786796021584513","commenter_b":"Pathetic human being","commenter_a":"You are wasting your time.","post_message":"Madonna said she \"will not back down.\""},{"comment_id":"1060173974080560","commenter_b":"You always do a fantastic job so thank you!","commenter_a":"Thank you for covering","post_message":"Christopher Heath WFTV has a look at the crowds waiting in Orlando for the Donald Trump rally, which is set to start at 4pm. More details here: @webpagelink"}]
