[{"comment_id":"10152522846320163","commenter_b":"She look real old","commenter_a":"I understand you wanna be different usher but pleases you should've stayed with Chili at least she's older but don't look it.","post_message":"It’s Official: Usher is engaged to longtime girlfriend Grace Miguel... check out her gorgeous ring here @webpagelink"},{"comment_id":"10153417298067434","commenter_b":"Yeah everyone needs this guy in the women's bathroom","commenter_a":"This is how we protect our women... not guarding bathrooms for trans \"predators\".","post_message":"\"I was going on about something and saw Monica staring behind and making a funny face. I stopped. 'What’s going on?' After a few second she said 'That guy just put something in her drink.'”"},{"comment_id":"996230513733330","commenter_b":"Hillary would then round up JEWS if she could ... Thats been done by HITLER","commenter_a":"How big of a f-----n idiot can some one that is running for office be she is going way to for","post_message":"BREAKING: Hillary Clinton accuses GOP of wanting to implement Nazi tactics."},{"comment_id":"1300544240024109","commenter_b":"She'll be kissing a whole lot of ass in jail","commenter_a":"The bitch lost - America knows she is a lying bitch now she has to kiss his ass to try to keep her out of jail","post_message":"It's over."},{"comment_id":"10153083977090950","commenter_b":"The costume? Stupid. Offensive? A man who think he's a woman when NUTURE decided MALE for him and no amount of procedures will change his MALE DNA. That's offensive. What is he a salmon? Science needs to come up with some kind of rehabilitation approach or program to try and fix this social diseases, including homosexuality.","commenter_a":"Why not it's holloween nway haha","post_message":"The \"Call Me Caitlyn\" costume faced Internet backlash, with some calling it \"transphobic.\" Stores, however, think the outfit \"celebrates her.\""},{"comment_id":"256901098085552","commenter_b":"So don't f with me I am from Louisiana I'll give u he'll and make ur ass cry like a baby are u still running don't say shot to me pat I won't say shot to u u ever meet a woman that hunt a allerigator I don't think so I can't hunt any thing we woman from Louisiana that hunt and fish are strong woman we don't take shot for nothing .","commenter_a":"Same could be said of Obama and his executive pen, but I didn't hear you snowflakes complaining then.....so why now? Because your criminal didn't win?.....boohoo! Get on with life.....you didn't see us doing the crap that is going on now when Obama was president......God help us......for 8 years. Quit crying and get on with it. I think Trump is going to do some great things for this country. Things that should have been done a long time ago......even before Obama came to be. I am looking forward to a better America....go get em Trump!!","post_message":"AMEN! This one is a MUST READ."},{"comment_id":"569159163208677","commenter_b":"Ohhhh....the irony. An 'upgraded' fence around the WhiteHouse to keep 'intruders' (i.e., we the legal citizens of the U.S.) out, but Obama and Hitlery refuse to support fencing our borders to keep illegals out. SMH","commenter_a":"Voting Trump a real American","post_message":"President Obama just unveiled the new White House fence and a lot of people are upset. This new design feature has Americans demanding it be torn down."}]
