[{"comment_id":"10153050855917452","commenter_b":"Sound like she listening to Future lol","commenter_a":"Lmao wtf","post_message":"A suspected car thief got out of the vehicle and started dancing in the middle of the street after leading police in a wild chase through downtown Los Angeles. @webpagelink"},{"comment_id":"10154482749054423","commenter_b":"@username doesn't watch this!!!! LEAVE HER OUT OF IT!","commenter_a":"Caitlin Leonard @username","post_message":"PSA: The cast of This Is Us is very sorry for making you cry every episode."},{"comment_id":"10154105407999166","commenter_b":"We are getting sick of black crap. Whites will start an uprising. Just wait","commenter_a":"If it was any other student you would be in an uproar...relax! He was wrong and you know it. We don't need this in schools. If they don't protect the safety of students, can you imagine what they would be up against. You don't wait til something happens then act. Let's think like adults here. This is 2016 not the 50s.","post_message":"JUST IN: Police say they have charged this Clemson student after he admitted to posting comments on a popular social media app, comments like \"let's do the Clemson protesters what Ohio did to the Kent State student protesters 40 years ago.\" He said he did it to \"make people mad\"."},{"comment_id":"1076817779005244","commenter_b":"We'd have a beautiful First Lady!","commenter_a":"Don't want her or him","post_message":"If Melania Trump succeeds Michelle Obama as First Lady, she may trace her road to the White House back to 1987 and a chance encounter in the capital of her native Slovenia. Find out more about Melania: @webpagelink"},{"comment_id":"10153678565299062","commenter_b":"*** Important","commenter_a":"Support tradition marriage","post_message":"SHOWDOWN: Officials and lawmakers continue to clash over same-sex marriage debate in Austin."},{"comment_id":"10153822220001162","commenter_b":"She needs to die a horrible death","commenter_a":"Her parents must be very proud of how their daughter turned out.","post_message":"BUSTED: The \"Baby Doll\" drug lord, Ana Marie Hernandez, is arrested in Mexico for allegedly running a cocaine pipeline to Chicago --> @webpagelink"},{"comment_id":"10152861814749753","commenter_b":"Same little bitch.","commenter_a":"How utterly sad and horrifying for the bird and it's owners. It is a proven fact that people who will torture and kill animals have no qualms in \"upgrading\" to humans. These kids need deep and immense counseling while sitting behind bars for about 6 to 10 years","post_message":"Police say this 18-year-old high school football player stole the pet emu from a neighbor's pen, tortured the animal, gouged out its eyes and then beat it to death. How should he be punished?"}]
