[{"comment_id":"1354102041270105","commenter_b":"BUILD THAT WALL!!!!!!!","commenter_a":"The racist bigots Trump supporters would love as many Mexican families as possible to die. Pretty sad! That's why I'm with her!!","post_message":"A son migrated to the U.S. from Mexico, to help his parents survive by sending back money. But part of Donald J. Trump's immigration policy could threaten that support, and the lifeline of an entire town. (In a statement to CNN, the Trump campaign maintains building a wall is the right solution, but did not address money transfers directly.)"},{"comment_id":"1571850159771728","commenter_b":"Wish you would replace Pelosi!!!! Sick of her!","commenter_a":"Hopefully she'll endorse the only true Constitutionalist Conservative, Ted Cruz.","post_message":"This campaign was always about citizenship—taking back our country from a political class that only serves the big, the powerful, the wealthy, and the well connected. Election after election, the same empty promises are made and the same poll-tested stump speeches are given, but nothing changes. I've said throughout this campaign that I will not sit down and be quiet. I'm not going to start now. While I suspend my candidacy today, I will continue to travel this country and fight for those Americans who refuse to settle for the way things are and a status quo that no longer works for them. Our Republican Party must fight alongside these Americans as well. We must end crony capitalism by fighting the policies that allow it to flourish. We must fix our festering problems by holding our bloated, inept government bureaucracy accountable. Republicans must stand for conservative principles that lift people ..."},{"comment_id":"1738890906325401","commenter_b":"Why no handcuffs? If i break the law and admit to it I'm no longer culpable? This should be challenged in every courtroom.","commenter_a":"California's Latino population is out of control. There are more Hispanics in California than there are people in 46 other states. 30% of all LEGAL immigrants come from Mexico. It's not \"diversity\" taking over, its misogynistic Hispanic rape culture being dumped on this country, and the democrats don't care how many little girls are raped & murdured and beaten & beheaded and sold into slavery & prostitution as long as they get millions of new voters. The age of consent for sex in Mexico is 12. In their culture it's ok to have sex with children. Not only that, these people are putting themselves in enormous risk, dying in the desert, and then we pay for them when they get here. It's madness! The majority of legal(51%)and illegal(72%) immigrants are on welfare according to the center for immigration studies. The number of immigrants on welfare should be 0! New report ...","post_message":"Note the swipe she took at Donald Trump..."},{"comment_id":"10156351239605093","commenter_b":"I just wish humans leave wild life alone.","commenter_a":"Signed ✔️","post_message":"Hanako lives alone in a barren, concrete enclosure without grass, trees, or a pool. Elephants are well-known for having complex social bonds, but it's unclear when Hanako has last seen another elephant."},{"comment_id":"1062577053802042","commenter_b":"She looks like the kind of woman who would beat up a man alright. Man, that face is the stuff of nightmares!","commenter_a":"Domestic violence in the Clinton home?","post_message":"Does Hillary beat up Bill?"},{"comment_id":"1778254899059301","commenter_b":"Someone take care of Bernie so Lizzi shuts her piehole, please.","commenter_a":"Lester Holt seems to be giving Hillary longer time to speak than Donald!!","post_message":"TheDC presents the first debate between Hillary Clinton and Donald Trump. Starting at 9:00PM ET."},{"comment_id":"1432027056824713","commenter_b":"PUSSY","commenter_a":"Canada doesn't want these idiots any more than we do.","post_message":"Progressives always break their promises."}]
