[{"comment_id":"10155032769051757","commenter_b":"Great","commenter_a":"Excellent! I hope to see you do many more of Fox's interviews with President Trump. You deserve it. Thank you for always reporting the truth when others didn't.","post_message":"Question of the Day: What did you think of my interview with President Donald J. Trump?"},{"comment_id":"1563946600332130","commenter_b":"she says she all for kids but she can not hide the truth","commenter_a":"If a woman walks around spewing F!#K the way she does you damn sure don't want her to be president, hell I don't even want her as a friend","post_message":"This is the REAL Hillary Clinton, folks!"},{"comment_id":"990765034279620","commenter_b":"Not empowering ,because ur shity woman","commenter_a":"I love them","post_message":"Photoshop this."},{"comment_id":"10153649045287994","commenter_b":"People are so dumb... That's all...","commenter_a":"Is a phone really worth your life","post_message":"A man was killed at Cedar Point when he entered a restricted area to look for his cell phone."},{"comment_id":"10154725073385935","commenter_b":"So many silent racist ppl out there that voted for him. It's so sad","commenter_a":"That's what you think you orange buffoon!!! #FuckTrump #Resist","post_message":"President Donald J. Trump says his executive order banning immigrants from seven Muslim-majority countries is 'working out very nicely.' @webpagelink"},{"comment_id":"10154773205966037","commenter_b":"Hillary is the liar and murderer deserves to be in prison right now!","commenter_a":"SHUT UP TRUMP","post_message":"WATCH LIVE: Donald J. Trump holds a rally following last night's debate and says he will totally accept results 'if I win.'"},{"comment_id":"10153952322157994","commenter_b":"Stupid young mfs","commenter_a":"#LifeinaPotHole #VOTE #GUNSENSE #VOTE #Hillary2016 #WitchHunt #BroomsUp #BlackLivesMatter #LATINOS #LGBT #WOMANCARD","post_message":"Three teenagers have been charged in the fatal shooting of an 18-year-old at Eastland Mall the day after Christmas."}]
