[{"comment_id":"581788285320289","commenter_b":"Great bitches pun","commenter_a":"@username future job","post_message":"All aboard! These rescued puppies are seeing the entire town on this custom \"dog train.\" (via NowThis)"},{"comment_id":"10154975691779859","commenter_b":"Not only NO but hell NO!","commenter_a":"No","post_message":"Should Betsy DeVos be confirmed by the Senate. Although Roy Blunt supports her, local educators and politicians have expressed concerns about her nomination. Vote and then tells us why you support or do not support her in the comments."},{"comment_id":"10155357191987439","commenter_b":"No thanks in representing the USA. Just another Linda Sarsour.","commenter_a":"Pretty sure this was found to be another muslim playing the victim","post_message":"Muhammad, a lifelong American citizen, claimed in an interview last week that she was detained \"just a few weeks ago\" by U.S. Customs and Border Protection agents. She said she was held for two hours without explanation."},{"comment_id":"10150565402804999","commenter_b":"Please don't vote for her just because she's a woman.There are plenty of good women out there to vote for.","commenter_a":"Anyone who votes for her is showing support for terrorism and the killing of US personnel","post_message":"“I’m running for president,” Hillary Clinton said with a smile near the end of a two-minute video."},{"comment_id":"10152682791936167","commenter_b":"The thing that pisses me off is he gets paid for his bullshit!","commenter_a":"That rules him out.","post_message":"How Rush Limbaugh talks about female politicians:"},{"comment_id":"10154480756700399","commenter_b":"I really thought republicans were smart enough to see that Trump was a racist with a corrupt moron compass, and a rapist.... I was wrong the Republican Party just embarrassed the world","commenter_a":"No, there won't be a gap; there'll be a canyon.","post_message":"\"It’ll be just fine. That’s what I do. I do a good job,\" Trump said while discussing his plan to replace Obamacare. \"I know how to do this stuff.\""},{"comment_id":"10154130696774087","commenter_b":"PRAYING JUSTICE PREVAILS...After hearing about Obama using a fake name to communicate with Hillary on her unsecured personal server, it explains why Hillary was given a pass and never indicted. Their corruption is as thick as sewage all the way to the top of the White House. This is unacceptable. \"Deplorable\" is Hillary and Obama. Hillary and Obama for prison... Donald Trump for President!! Hillary is not an option... ##TrumpPence'16","commenter_a":"The GOP spent millions of our taxpayer money, and they proved that Hillary was blameless for the response to Benghazi. Just wait, the GOP might just open up yet another wasteful investigation. :D","post_message":"“What Hillary tried to set up and what they apparently spent months preparing is an ambush as false as Benghazi,” Newt Gingrich said."}]
