[{"comment_id":"860171507364731","commenter_b":"Wow... really? So sad.. moms please be very careful who u leave ur kids with..","commenter_a":"she looks like she is a... \"few bricks short of a load\"","post_message":"This 18-year-old girl is accused of leaving her little sister in a hot car while her and her friend went shopping for swimsuits. Investigators say the 2-year-old's temperature was already at 100 degrees when she was rescued:"},{"comment_id":"10153072205104614","commenter_b":"Let us hope this woman wasn't aware of the situation. Because otherwise they're both sick horrible people.","commenter_a":"I hope this pig gets sodomized repeatedly. ......human garbage.","post_message":"BREAKING: A 30-year-old man Newhall man has been charged with sexual assault and murder in the death of his 19-day-old infant daughter. Matthew Brendan Warner led investigators to the baby body less than 12 hours after the infant had been reported missing over the weekend. He was arrested on suspicion of murder. On Tuesday, prosecutors announced he had been charged with aggravated sexual assault, torture and other alleged crimes. Read KTLA's story here: @webpagelink"},{"comment_id":"1702706209988180","commenter_b":"Stupid Question! Why should illegals be allowed to vote here? Do we vote in their country??????? NO!!!!!!","commenter_a":"YES","post_message":""},{"comment_id":"10154823227721162","commenter_b":"Africa still enslaves it's own people, but ok white people are the problem hahaha","commenter_a":"The kicker of the team is a black female this is clearly raciest read the article people ...you would be offened to if you where made fun of in such a manner comparing you to a gorilla but its funny and people are too sensitive because its not directed to you or your race #facebookBigots","post_message":"RACIST POST? The photo shows a white young woman hugging someone in a gorilla suit."},{"comment_id":"10153107987369205","commenter_b":"When an illegal alien is here and gives birth to a child the child is still illegal.","commenter_a":"Matt Ely this who you want you dont know shit if this who u want","post_message":"Things get heated between Bill O'Reilly and Donald J. Trump"},{"comment_id":"757206074401067","commenter_b":"Go suck off another jihadi, Dilosh asshoIe.","commenter_a":"How can you go into someone else's land. Occupy it, then claim self defence when a 16 year old kid attacks. Isn't he the one doing self defence since its you that on his land?","post_message":""},{"comment_id":"1520981961255162","commenter_b":"And this coming from someone that used an \"excuse\" to avoid draft?","commenter_a":"This man is pitiful.","post_message":"Donald J. Trump suggested veterans suffering from PTSD are not \"strong.\""}]
