[{"comment_id":"620543131446096","commenter_b":"She's a LIAR!!!!!","commenter_a":"So, she's going to declare bankruptcy and drop out of the presidential race???","post_message":"Wow. I don't think she thought this one through... Do you think a Hillary Clinton presidency would be terrible for America?"},{"comment_id":"1503738089934482","commenter_b":"Get the employers to stop hiring illegals, problem solved.","commenter_a":"no, and unless u r an open borders leftist, you probably don't either. sick and tired of illegals. period. build the wall, e-verify, zero benefits for illegals = mass migration back where they came from. problem solved :)","post_message":"Joe Biden went to Mexico on Friday and delivered a clear message: The views of Trump absolutely do not represent the views of most Americans. Do you agree with the VP?"},{"comment_id":"10154045189272169","commenter_b":"Farmers are already having trouble finding people to work. A lot of illegals have left this country and Americans won't do the work, so there are places that crops are just sitting and going to waste.","commenter_a":"Illegal workers should go back to their own country.","post_message":"Farmers markets are everywhere. But do laborers see benefits? (From PBS NewsHour)"},{"comment_id":"932489970229038","commenter_b":"Nothing compares to what Bill Clinton did as Gov of Ark, and in the White House with Monika Lewinsky and other women..same with John F Kennedy, with Marilyn Monroe, and mistress of a Gang boss, and nude swimming parties. They both dis honored our White House...where was the media..and why were they voted in twice...","commenter_a":"I agree! Mr. Trump has changed in the past 11 years but Hillary Clinton has not except for the worst!!","post_message":"Dr. Robert Jeffress, Senior Pastor of the First Baptist Church in Dallas, Texas, stated that he still supports Donald J. Trump, despite the GOP nominee's controversial 2005 comments."},{"comment_id":"1141174309285545","commenter_b":"PUT THESE RAGHEADS OUT IF THEY CAN'T COMPLY!!!","commenter_a":"No","post_message":"The military doesn't bend their rules for their soldiers. If you want to serve, then fall in line. Do you think our society has become too sensitive?"},{"comment_id":"551488165033429","commenter_b":"Wendy is my bitch","commenter_a":"@username wendy is the most annoying motherfucker. Bitch always has something to say, never intelligently or well spoken, and always speak out of her ass. SHHHHHHHHHHHHHHHHHH.","post_message":"This is how you shut down breastfeeding shamers. Read more about Alyssa Milano's activism here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"588476011355911","commenter_b":"I've actually flushed stuff better looking than this retarded skank!","commenter_a":"Why don't you leave like you said you would?","post_message":"Loud mouth Whoopi and her co-hosts are making serious unfounded accusations and demanding Trump step down. Let's get 5,000 'SHARES' & 'LIKES' to show that Whoopi is the one that America wants to see \"STEP DOWN!!!\""}]
