[{"comment_id":"10153706263011336","commenter_b":"Who cares.. She's an old dried up prune!","commenter_a":"Oh dear... Am I surprised or what? NOT!!! :)","post_message":"BREAKING NEWS: After declining to state her position for years, Democratic presidential candidate Hillary Clinton says she opposes the Keystone XL oil pipeline."},{"comment_id":"10153427555429087","commenter_b":"How the hell do you not get 1000 signatures? Hahahahahaha","commenter_a":"Fail @username","post_message":"A spokesman for the Ohio secretary of state has confirmed to The Hill that Martin O'Malley failed to get the necessary 1,000 signatures to appear on the March 15 ballot."},{"comment_id":"10152719503449117","commenter_b":"Don't these pigs have any REAL criminals to hunt down???","commenter_a":"Boy that's a basket of snarls","post_message":"Why the sex lives of teens should be subject to school discipline is suspect enough, but it's extra perplexing what interest the government has in such matters."},{"comment_id":"10153186263669411","commenter_b":"And what happens when two monsters get together? another monster!!","commenter_a":"ha ha ha America is a father England is a mother isis is a child isreal is a nanny","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154225504351336","commenter_b":"Can't stand her","commenter_a":"Oh come on now, we all know she is in with Trump...She's a plant by Fox news and the Trump group to bring attention to him....It's the oldest trick in the book...but ya, I can't stand her either.","post_message":"Fox News host Megyn Kelly and Republican presidential candidate Donald J. Trump met in New York City on Wednesday morning."},{"comment_id":"1021126491243474","commenter_b":"And yet a student did intervene verbally and is still alive.","commenter_a":"Shame on that teacher for not standing up for that student. Even if she was being disruptive in class she still deserves to be protected and treated with decency.","post_message":"When a white Spring Valley cop brutally assaulted her classmate, Niya Kenny sprung to her defense.  How could she have known what would happen to her next  just for speaking up? #AssaultAtSpringValleyHigh"},{"comment_id":"1311803105524589","commenter_b":"Bryan Gogg Citation? I didn't think so. The SS never comments on such things.","commenter_a":"I will not shed one tear for any faithless elector that ends up suffering grave consequences.","post_message":"This is about to be all over the news, folks."}]
