[{"comment_id":"10156148528265725","commenter_b":"Trump has the mentality of an 8 year old class bully","commenter_a":"Suzanna Mikolajczak Trump is a Beast","post_message":"I think Megyn Kelly should take another eleven day \"unscheduled\" vacation."},{"comment_id":"1625836147707451","commenter_b":"That would be very hard for her to do.","commenter_a":"Why wait, just blow your brains out. Wait, that's why you said that, you don't have a brain","post_message":"Typical Hollywood liberal with an overreaction to everything."},{"comment_id":"10154338817664411","commenter_b":"Arabic jews were never persecuted. This crap comes from your corrupted zionist controlled medias. Actually the white European jews were always persecuted by europea christians and Hitler etc. Can't you see the difference between a white European non-semitic jew with blonde hairs and blue eyes and a semitic middle eastern jew? Obviously you can't. You're a trash.","commenter_a":"There are calls by scientists and engineers, presidents etc etc etc etc etc to re - open the 911 case for new investigation. Suddenly the Saudi propaganda is out just at a time when the world is waking up to the 911 israeli zionist connection. Truth will prevail 😂","post_message":"Man wants to buy a plane & an abandoned building to 'prove it once and for all: Was 9/11 a hoax or was it real?'"},{"comment_id":"10153039923756037","commenter_b":"^ pathetic.","commenter_a":"Tranny.","post_message":"#MichelleObama relished watching children ride their bikes and walk their dogs inside the White House as she pushed her \"Let's Move\" campaign forward."},{"comment_id":"761877867244155","commenter_b":"STFU Shannon....stop raising a queer!","commenter_a":"A lot of folks are making \"wink wink\" comments but she is a sexual predator and you might feel differently if it were your son who was involved. I hope she gets treatment and does not teach again. Find another profession--I can think of one.","post_message":"The running joke was allegedly: \"Who is Ms. Altice sleeping with now?\""},{"comment_id":"10153656357399726","commenter_b":"Gray is a puss !","commenter_a":"Not just NO but Hell No! Graham cracker thinks alot like Obummer!","post_message":"Should Ben Carson apologize?"},{"comment_id":"10154409316811336","commenter_b":"I think like all of us Trump thought no this can't be and thus he thought it was a joke! Then reality of course set in and the man thought as we all do who would expect anything different from the Clintons? My question what is next to come it is something every single day?","commenter_a":"Why would Trump think that such a meeting would be just a joke? All of these democrats are capable of any despicable act imaginable! They have proven it over and over again, but all we ever do about it is whine like little punks! obama should be in prison, hillary should be on trial and lynch should be removed and arrested as well! ENOUGH with the beating around the bush! We need to hit them on the head! They need to be punished severely NOW!!!","post_message":"“I'm flabbergasted by it.”  Donald J. Trump reacted to the news that Attorney General Loretta Lynch met privately with former President Bill Clinton amid the DOJ’s investigation into Hillary Clinton’s emails. Full interview tonight at 10p ET."}]
