[{"comment_id":"10154044912016756","commenter_b":"Heterosexual couples also have anal sex.","commenter_a":"Anal sex greatly increases your chances of catching aids.","post_message":"A Christmas Eve first date. A Christmas proposal, three years later. And now, a first Christmas with their son."},{"comment_id":"10153039923756037","commenter_b":"^ pathetic.","commenter_a":"Tranny.","post_message":"#MichelleObama relished watching children ride their bikes and walk their dogs inside the White House as she pushed her \"Let's Move\" campaign forward."},{"comment_id":"1111328388897763","commenter_b":"Grow a set you whinny little pussy!","commenter_a":"In America we all have the right to support which ever candidate we choose! Why be afraid God is on your side! I choose Trump! We have that right in America! I do think the present government in America is creating all this fear and I will vote Republican. If you don't want to abide by our Constitution and Congress Approved Amendments maybe you don't belong in America. IN GOD WE TRUST. WE WANT OUR AMERICA GREAT AGAIN","post_message":"\"I don’t deserve to feel afraid at my school,” said another student."},{"comment_id":"895076240539004","commenter_b":"Angela and Sheira close your fucking legs, Whores!!!!!!!!","commenter_a":"Unborn Baby's are Human at the time of conception.....Duh.....that's not hard to figure out. When you abort AKA MURDER a Baby at any time after conception it is very simple.....IT'S MURDER.....just watch our Court system when a drunk kills a pregnant woman they will be charged with the MURDER of the child as well. There are just some people that will argue against the facts to try to justify MURDER but make NO MISTAKE it's MURDER. Just because you get pregnant and it's inconvenient and you call it abortion, does not change the fact everyone knows in their heart IT'S MURDER.","post_message":"How cool is this?"},{"comment_id":"10153115054444091","commenter_b":"You are 100% right about Starbucks.","commenter_a":"I blame Dunkin' Donuts....if they had a drive thru, this wouldn't have happened. If he drove through a Starbucks, I would have bought him coffee!","post_message":"A 16-year-old who was practicing driving for his learner's permit with his mother, crashed into a Dunkin' Donuts in Glen Rock Sunday morning. MORE: @webpagelink"},{"comment_id":"10154062407918812","commenter_b":"The kids in low income areas would just grow up as failures and,we'd support them as inmates. Abortion is cheaper in the long run, and saves people from being victims of their future crimes.","commenter_a":"$500,000 doesn't compare to the $500 Million taxpayer dollars that go to the organization that is (Un)Planned Parenthood, strategically placed in low income areas across America and helps thousands of new mothers kill their own children in their own wombs. Can the Fed do something about that??","post_message":"Oregon governor says armed group’s continued occupation of federal land has cost taxpayers nearly $500,000."},{"comment_id":"10154295602821037","commenter_b":"Claude, women who use the term \"Feminist libtard\" are sexy.","commenter_a":"Good lord! If men couldn't get a job because they hit on a woman at one time or another throughout the years, there wouldn't be any in the workplace! Women like this give us all a bad name. She must me a feminist Libtard! I'm sorry....some people will do anything to get attention and they are coming out of the woodwork! She acts like he raped her! I'm guessing she's trying to make a name for herself through Trump since she couldn't with her writing skills.","post_message":"Our reporter attended a Donald J. Trump event in 1987: \"Trump said there would be an even better afterparty and I was welcome to join him, but only if I came alone.\""}]
