[{"comment_id":"1811292265824545","commenter_b":"Lack off question mark ? Get a life lefty. It's Facebook , not a GCSE","commenter_a":"When I was the age they look,,,,,I'd got my apprenticeship done, bought my first house and was engaged!! How very strange,,,,,,,","post_message":"'Things are moving quickly now.'"},{"comment_id":"635093840035049","commenter_b":"The only duty this bitch understands is money and do what frump trump Hitler wants !!","commenter_a":"Hopefully she will realize that she is in way over her head and resign.","post_message":"Betsy DeVos has demonstrated she has a rudimentary understanding of the issues facing our students, teachers, and schools, which should have disqualified her from serving as Secretary of Education. She possesses no experience with the public education system as either a student, parent of a student, educator, or professional working on education policy. Now that Ms. DeVos is confirmed, she is charged with the responsibility of advocating for and protecting ALL students regardless of their background. I hope that she will fully embrace this duty."},{"comment_id":"953797061420139","commenter_b":"'@username hahaha","commenter_a":"And this witness is just as big a piece of shit, like the article ends with. Haha you cats are seriously not right. Good luck in the big scary liberal future. It's called progress get on board or get left behind.","post_message":"HERE WE GO.............."},{"comment_id":"1288485644498385","commenter_b":"she was going to get nailed for perjury and they KNEW IT","commenter_a":"Well.... Bye!","post_message":"In case you missed the bombshell late last night, Ben Shapiro resigned from his post as Breitbart News’ editor-at-large over the management’s “disgusting” treatment of Michelle Fields."},{"comment_id":"1163050380483299","commenter_b":"'@username, I'm quite happy with my wife of 33 years, but thanks for the suggestion.","commenter_a":"Honestly, I don't know anyone who wears Ivanka trump's clothing. This is the risk you run when you become part of the political process.","post_message":"A recent survey found that 57% of women refuse to buy Ivanka Trump branded merchandise following her father's controversial campaign."},{"comment_id":"10153429543136491","commenter_b":"Not that it matters. A white woman would probably been cast anyway.","commenter_a":"WHY?! Are there no LATIN/HISPANIC actresses that can fill this role?","post_message":"Jennifer Lawrence will soon add another splashy biopic to her resume."},{"comment_id":"10153074507087908","commenter_b":"Only Decent Republican President lol !!! @webpagelink","commenter_a":"Today, Ike would be a center-right Democrat.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
