[{"comment_id":"10153142102307144","commenter_b":"DUMB ASS!","commenter_a":"What about soldiers lost in Iraq?","post_message":"Holy crap."},{"comment_id":"10153082513017169","commenter_b":"Another sold out POS that wants another war. Shoot the c**ksucker.","commenter_a":"Poor outcomes across the board.","post_message":"What does Scott Walker believe? Where the candidate stands on 10 issues (From PBS NewsHour)"},{"comment_id":"10152809314113645","commenter_b":"It SHOULDN'T MATTER SHE IS A MURDERER !!!!!'","commenter_a":"murder charge now!!!","post_message":"Sad update to pass along, family tells FOX 4 that a teenage girl who was critically injured last Friday after being hit by a car was taken off of life support today."},{"comment_id":"758262410976191","commenter_b":"What a f--king liar!","commenter_a":"Chris is wrong Trump is right. Trump is the right man for the presidency. Get it and stop fighting a good thing for our country.","post_message":"Wow...Donald J. Trump and Chris Matthews agree that many Republican leaders and corporations don't want to stop illegal-alien hiring because they want the cheap labor."},{"comment_id":"10153055472862293","commenter_b":"Shut Up..get outta here!!!! Lol...forgive blacks..?? psscvhh","commenter_a":"Should \"White America\" forgive racist blacks?","post_message":"\"If we really believe that black lives matter, we won’t devalue our reality and cheapen our forgiveness by giving it away so quickly and easily.\" via Washington Post Opinions, Outlook, and PostEverything"},{"comment_id":"10153058205158984","commenter_b":"Good job, give the woman a raise.","commenter_a":"Would her employer be happier if she was the one who was shot??? I commend her for having the courage to stand up for herself","post_message":"I don't think this robber thought that holding a woman on the ground at gunpoint would land him a bullet to the face, but this gal delivers more than just pizzas! Do you think this woman should be afraid of getting fired for defending her life?"},{"comment_id":"10154387073057894","commenter_b":"Bitch she would get demoted hard !","commenter_a":"Good! Let Honda go, she has no relevance on the show! @username","post_message":"NeNe Leakes and Kim Zolciak-Biermann in Talks for a FULL-TIME Return to 'The Real Housewives of Atlanta' for Season 10"}]
