[{"comment_id":"10154299169246051","commenter_b":"@username u would suck D. Chump dick if u had a chance. What a brain dead sheep u are.","commenter_a":"He's being practical. People were thinking it would be like the Great Wall of China, not realistic. He's still going to protect the country and secure the borders.","post_message":"Donald Trump just announced his giant wall isn't happening after all - and the reason has people outraged."},{"comment_id":"895447730553834","commenter_b":"You can both GFYS , typical ignorant trash","commenter_a":"Fuck the Oneida nation","post_message":"Mayor Patrick O'Connor said the long-time village seal shows a historic wrestling match between village founder Hugh White and an Oneida Indian that figured into good relations between early settlers and the Oneidas."},{"comment_id":"1262054097174477","commenter_b":"Ann coulter is a real bitch period","commenter_a":"You are one Bitter woman and no one in your life to love or who loves you. I know being 52 is hard but please dont take out your bitterness on other people. They are passionate in their believes. Let them be and go find yourself a man. it will help I promise.","post_message":"Controversial conservative figure Ann Coulter took to Twitter on Thursday, attacking protesters who continue to reject president-elect Donald J. Trump ."},{"comment_id":"10153818538521519","commenter_b":"She's ok with a total asshole who may blow up the world though apparently","commenter_a":"Her son did NOT even work for the State Department, he worked for the the CIA. Her comments and opinions about Hillary are completely irrelevant.","post_message":"Pat Smith at RNC: Hillary Clinton \"deserves to be in stripes\"..."},{"comment_id":"10153749072149411","commenter_b":"This is why aliens don't want to talk to us","commenter_a":"There are no aliens from other planets riding around in spaceships people. If you really want truth read the Bible.","post_message":"An alien invasion unlikely at all?"},{"comment_id":"494539450746362","commenter_b":"one ugly woman","commenter_a":"Cruz started this slanderous crap and it backfired on him. But he is still trying to blame Trump for a rags publication. But he's right about one thing, we don't give a shit so he can shut the hell up about it. Trump has already moved on.","post_message":"Carly Fiorina accused Donald Trump of being a serial philanderer. Do you think there's any truth to it?"},{"comment_id":"10152960759722377","commenter_b":"this traitor could add votes from the foreign countries that paid her bribe money to her and bills family charity, like she will add the illegals vote here in the US when the election rolls around","commenter_a":"#ClintonResign","post_message":"The former secretary of state is looking for a more aggressive way to increase her poll numbers."}]
