[{"comment_id":"10153105302477144","commenter_b":"Funny. I thought she sounded a lot like Hillary Clinton","commenter_a":"She is my number 2 choice. I am all about Bernie, but hif he doesn't get the nomination, I will give it all to get this woman in office bcause the alternative side is terrifying.","post_message":"\"The defining economic challenge of our time is clear. We must raise incomes for hard-working Americans so they can afford a middle-class life.\" — Hillary Clinton"},{"comment_id":"844826018983911","commenter_b":"Not even close Alex... Talk about a swing and miss.","commenter_a":"Unconstitutional. Pass it all you want. Taxing something that's a Constitutional right represents an undue burden (exactly what the tax is intended to do).","post_message":"It all makes sense now....THIS is how they're going to stop people from getting guns. They don't need a ban at all..."},{"comment_id":"10153047880386130","commenter_b":"Oh Florence, you dirty gal!","commenter_a":"Failed attempt at humor...","post_message":"You’ve seen the headlines.   Now it’s time to finally hear from the Brady at the center of the controversy…"},{"comment_id":"10152892067227144","commenter_b":"Far more competent and capable than anyone out there on either side!","commenter_a":"If she is the best we dems can do, we are in bad shape.","post_message":"The time has come."},{"comment_id":"10153147861257060","commenter_b":"That's her dumb ass then.","commenter_a":"She fell for the Kenyan Prince trick, lol","post_message":"A Metairie woman was duped into sending more than $195,000 to man she knew only through Facebook, according to the Jefferson Parish Sheriff's Office."},{"comment_id":"1044742995559452","commenter_b":"Na lock her up n throw away the key, dont need her back in society","commenter_a":"Thanks for posting 3 separate mug shots of a clearly mentally ill person to parade her in front of your audience. Maybe you can sensationalize more Halloween hoarder homes while you're at it. I am glad Nickcole Dykema didn't actually hurt any Deputies (and she most likely could have, ambushing them in her own home like that), and glad the Deputies didn't kill her. This is a lesson for Police dealing w/ the mentally ill everywhere. I do hope this woman gets access to proper mental healthcare, and that through treatment she can find her way back into the world with peace and dignity.","post_message":"Multiple deputies received injuries at the \"house of horrors\"   From removing weapons from the \"booby trapped\" home"},{"comment_id":"10153876150456680","commenter_b":"Libs can't ubderstand acting in legal ways. No wonder they so adore ILLEGAL aliens.","commenter_a":"About the taxes. Trump did nothing outside the law. So he really is a genius. He employed tens of thousands of people and according the the law, he paid the required taxes. Now the democrats are mad that Trump complied with business laws set by Democratic governments and utilized these laws properly? A bunch of hypocrites. #TrumpPence2016","post_message":"“Almost everybody else is getting poorer.  And yet billionaires like Donald Trump are able to manipulate the tax system so that they avoid paying federal income tax,” Bernie Sanders said."}]
