[{"comment_id":"10153445196113984","commenter_b":"She has no right to control any thing!","commenter_a":"Not only does she not have any class, she is ugly and gross! I do not care if she is republican or democrat she is just nasty!","post_message":"This has to be very embarrassing for the First Lady. Hopefully this doesn't make her try even harder to control Americans...  Do you think Michelle Obama as First Lady is bad for America?"},{"comment_id":"10153594324081336","commenter_b":"These animals should be disposed of! Don't waste the tax-payers money on public defenders, trials and a life in prison!","commenter_a":"This animals need to be caught and put away for life!","post_message":"The Lash family had just returned home from vacation when a group of teens came to the door and asked to borrow a jack for their car, then tried to force their way into the home."},{"comment_id":"572406196218003","commenter_b":"@username bigotry people?!? First learn to compose a literate sentence, then read your comic book.","commenter_a":"Unfortunately, anti-gay bigots never seem to go away since we're still dealing with them 40 years later. When will we, as a people, learn to stop hating people who are different than us?","post_message":"TV's \"All in the Family\" was way ahead of its time.   Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10156568887000725","commenter_b":"@username STOP dreaming about Hillary, she's bad news, and will never get elected...thief, lier, does NOT care about the American people, WAKE UP !! TRUMP, 2016...","commenter_a":"Today - One Year from Today - Donald Trump will be in his second day in the White House as POTUS and the Obamacare bill will be burning in a barrel on the south lawn.","post_message":"Donald Trump 1st Republican Presidential Candidate to Beat the Iowa Bureaucracy and Figure Out How to Easily Access Caucus Locations. #Trump2016"},{"comment_id":"470490783141502","commenter_b":"Jail her useless ass dude. Fucking A","commenter_a":"@username Ha wow.","post_message":"Should All Welfare Abusers Be Arrested?  Comment 'yes' or 'no'."},{"comment_id":"10152771532479342","commenter_b":"His other girlfriend","commenter_a":"Who do you think he's talking to on the phone.... his wife....","post_message":"The game is tied in the fourth quarter and you're not even paying enough attention to realize you and your girlfriend are on the kiss cam?   There are many things wrong with this sports \"fan,\" and he gets what's coming to him.    SEE VIDEO --> @webpagelink/  What do you think -- real or staged?"},{"comment_id":"10153684606323487","commenter_b":"There is no part of any of the Planned Parenthood video footage of a fully-formed aborted fetus on the table, with its heart beating, its legs kicking, IT IS A LIE!!!!!! The damned bitch lied!!!!!","commenter_a":"In the sense that she lied louder and slower than the others, Carly owned the night.","post_message":"Carly Fiorina owned the night."}]
