[{"comment_id":"982153291907152","commenter_b":"The wall wont be anywhere as effective as you think. All it will do is provide more cover for traffickers.","commenter_a":"Texas here! We NEED THAT WALL!! 1 million dollars worth of drugs just confiscated last week that came from Mexico! Happens ALL the time! It must stop!","post_message":"Watch: Donald J. Trump addresses the American Legion National Convention in Cincinnati, Ohio"},{"comment_id":"10154282562893797","commenter_b":"Get rid of her dumb A S S","commenter_a":"Have her arrested and charged her for treason!","post_message":"BAN OVERTURNED: A school principal banned Santa, Thanksgiving and the Pledge of Allegiance at her school. However, the Department of Education wasn't having any of that. And now, some have started an online petition to remove Eujin Jaela Kim as principal."},{"comment_id":"1040475262630610","commenter_b":"Many women who can't do hormonal, do the copper IUD. 10 years in, less of a fail rate than a tubal!","commenter_a":"If only BC didn't have so many side effects tho. I had to get off, I almost had a stroke at 30. Not to mention I gained 40 lbs😟","post_message":"Today is the fifty year anniversary of a court case that changed everything"},{"comment_id":"1083559065045639","commenter_b":"She would have to pay me to go listen to her garbage.","commenter_a":"Are you listening Mom and Dad?","post_message":"What an incredible waste of both time and money. Blow it on beer, or burn it for warmth. Both better ways to spend your cash. Y'know, since college kids always have an extra three grand lying around."},{"comment_id":"1432544963425545","commenter_b":"As Usual Asian people don't respect anything. They are doomed!","commenter_a":"Typical Asian - they'll eat anything that moves","post_message":"Their cries will make you question everything you put on your plate. How can anyone treat animals this way?"},{"comment_id":"10153312839004203","commenter_b":"No way she's a stupid bitch","commenter_a":"You'd rather have Rand Paul , Jeb Bush or Ted Effing Cruz? Really? GO HILL!","post_message":"This is it."},{"comment_id":"1099416270154624","commenter_b":"Raged old skank","commenter_a":"Does she really? Or is she lying again...?? Hmm. Lol","post_message":"\"I think that’s fabulous!\" - Hillary Clinton"}]
