[{"comment_id":"1115407108512795","commenter_b":"Jay Z is trash just like his skank wife!","commenter_a":"Can't stand Jay-Z, or his mop! Sad she has to pull the hypocrite card but in office she never did anything that's credible anyway!","post_message":"“He used every word in the book. Can you imagine if I said that?” asked Donald J. Trump."},{"comment_id":"10153148405249753","commenter_b":"Fuck you again bitch and fuck your manner too. Don't come to teach about manner. My mama only said \" baby, respect everyone before get that respect back.\" My mama is better than yours.","commenter_a":"Everyone shall be respected the American's rules because we are living in America, not your or mines, so lady get that into your head.","post_message":"The Dearborn Police Department has been slapped with a lawsuit after a Muslim woman says that she was ordered to remove her hijab, or headscarf, for her booking photo after she was arrested."},{"comment_id":"10153664452407183","commenter_b":"Very good comment !!!","commenter_a":"Mr. Robertson you do know that the Bible is a compilation of 66 books and letters written by more than 40 authors during a period of approximately 1,500 years. Its original text was communicated in just three languages. The Bible's authors were very human and may have been inspired by what they understood to be God's words, thoughts, actions. These 40 individuals came from various walks of life. Moses was probably the most educated, while the others were shepherds who became the King of Israel (David), farmers, fisherman and warriors. These earliest accounts were handed on from generation to generation in songs, narratives, and poetry. In those early societies there was no writing as yet and people passed on these oral accounts and with that the stories are exaggerated, changed, misrepresented, and contradictions, so we admit the humans creating the bible were not infallible or God is bi-polar. The creation ...","post_message":"Who knew that being kind to gays was a death sentence?"},{"comment_id":"984015725050561","commenter_b":"Carla. Go back to school honey. You are so stupid.","commenter_a":"Compare this: Melania Trump became a US citizen and said it was \"The greatest privilege on the face of this earth.\" Michele Obama said in a speech, \"For the first time in my adult life I am really proud of my country.\"","post_message":"Donald J. Trump’s campaign chairman denies allegations Melania Trump lifted her convention speech from Michelle Obama’s in 2008, claiming such an act would be \"absurd.\""},{"comment_id":"410802195930600","commenter_b":"Stupid.. Beyonce has enough awards, no way in hell I would have broken it to give half to Beyonce.. Adele is so much more talented..","commenter_a":"It was ADELE'S moment - and BTW, that narcissistic fur hag is NOT a queen - except maybe of BAD TASTE","post_message":"Adele may have broken her Grammy award in half for Beyonce."},{"comment_id":"719757218174186","commenter_b":"So, @username. Please give me a source of information you've taken part of that doesn't promote the hoax. How many articles have you red? How many books? How many documentaries? You know how in a trial both parts are allowed to talk? The jury then have to consider which story makes the most sense and who has the most solid proof. So I take it you've studied both sides thoroughly before you decided it's a crazy tin foil hat theory? I mean, only a huge fool would believe they understood something without reading both sides. And you're not a huge fool now are you?","commenter_a":"Of course not, it's a Globalist hoax to control the world population even more and finance the World Government which is an essential part of the New World Order. The Chinese are in on it of course but don't know why he thought it was their idea specifically","post_message":"-_-"},{"comment_id":"10153468718801130","commenter_b":"Classy women.","commenter_a":"Gorgeous young women!","post_message":"\"They're not trying to look older than they are.\""}]
