[{"comment_id":"1462621683757857","commenter_b":"Facts !!! What a joke, just like her supporters...zombies","commenter_a":"CLINTON IS THE WORST THING FOR OUR COUNTRY.... LYING HILLARY","post_message":"They haven't voted for a Democratic president in two decades or more."},{"comment_id":"1069048556481240","commenter_b":"Really, how is this possible!!! Illegal immigrants are cover in the Constitution???","commenter_a":"NO they do NOT","post_message":"Incredible!"},{"comment_id":"10153608753847452","commenter_b":"its not up to us, it's the law. Our ancestors are no longer the subject for this. Hell I have family members that came here undocumented, but then did what they had to do to become citizens as fast as they could. I'm talking about the ones that come here and don't try.","commenter_a":"Smart or not, she needs to be deported, if she has not already applied for citizenship. Nobody ever said all undocumented immigrants were dumb, she's obviously not dumb by getting into Yale. Very sensitive subject. I feel like she's making herself the mascot for this whole subject.","post_message":"A valedictorian dropped a bombshell in front of thousands at her graduation in Texas - she revealed she's an undocumented immigrant. @webpagelink"},{"comment_id":"1331072000266602","commenter_b":"I guess it's just disappointing to think of anyone being THAT stupid . Smdh .","commenter_a":"Why make a video of this ? It has to be trolling .","post_message":"The teens said they will make Black people slaves, burn them, brand them and make them swim the Atlantic Ocean."},{"comment_id":"10154800367722293","commenter_b":"@username Human rights should always supersede law otherwise we are no better than the Muslim extremists we criticize so much (for good reason). Yes, we need to have strict immigration laws but due to our decades of non-existence of it due to the fact that we can profit from it, people shouldn't be punished and exceptions to the rule would exist. There are undocumented people who have been here all their lives, kids who know no other home than here and good tax paying people. Criminals - yes get them out. Instead of a wall use technology and more man power at the border. Create temporary work visa give. By employer, families who are working and are not a burden to the system can stay. There are better ways.","commenter_a":"\"let us all unite. Let us fight for a new world - a decent world that will give men a chance to work - that will give youth a future and old age a security. By the promise of these things, brutes have risen to power. But they lie! They do not fulfill that promise. They never will! Dictators free themselves but they enslave the people! Now let us fight to fulfill that promise! Let us fight to free the world - to do away with national barriers - to do away with greed, with hate and intolerance. Let us fight for a world of reason, a world where science and progress will lead to all men happiness. Soldiers! in the name of democracy, let us all unite!\" - Charlie Chaplin, \"The Great Dictator\" (1940).","post_message":"Trump vow of mass deportations could soon become a reality."},{"comment_id":"10156562504755354","commenter_b":"Just make sure you have plenty of their special food and make your women cover up head to toe.","commenter_a":"Nope. I wont be where terrorist refugees gather","post_message":"So his plan is to have businesses display his \"Refugees Welcome\" stickers in their windows to attract customers.   Question: If you saw a \"Refugees Welcome\" sticker in a business window, would you reward them with your business?"},{"comment_id":"1017838814918244","commenter_b":"Feminazis everywhere","commenter_a":"@username Fucking Feminazis...","post_message":"It's time to rethink sexism in toys."}]
