[{"comment_id":"10154754813479369","commenter_b":"She is ALL Talk!!! A PERFECT Politician!","commenter_a":"I can't wait until he is prosecuted for all of the crimes he has committed. Will that happen? With a just justice system it will.","post_message":"Trump to Clinton: 'You'd be in jail' if I was in charge."},{"comment_id":"923411781030392","commenter_b":"You can see intelligence in many statements and never know the color of the person saying it. If you are suprised when you find out, you need to examine what you find in yourself. Common sense ignores color.","commenter_a":"Why when I read this do I keep seeing the statement \"Black mother\" or \"Black woman\" this is the problem with racism in our country. Let's stop using the color of our skins in small comments like these. I feel like this 1 small step would be a huge step in a direction and future with less focus on skin color and more on humanity.","post_message":"Do you agree with Mom?"},{"comment_id":"542034032653843","commenter_b":"Dumb ass","commenter_a":"Right....looks who is racist Obama... You! Who is BSing Whom?","post_message":"Obama just told the entire world that we have racist cops. He has absolutely no respect for the hardworking people that make this country work. Do you agree is a complete embarrassment to our country?"},{"comment_id":"1020621978034054","commenter_b":"Queen of England? LOL... She's such a jokester, a desperate one.","commenter_a":"Why should anyone stand with him? No reason to","post_message":"Sarah Palin doesn't stand with Ahmed."},{"comment_id":"588513781327245","commenter_b":"Trump is not pro amnesty, he's a negotiator and looking at the best way to deal with families who have lived here for 10 or more years. Even if he does half of what he said he'd do it will be HUGE!! Id be happy with getting rid of illegal criminals, upholding the laws we have and securing the border and building the wall! That is HUGE!! Trump 2016!!","commenter_a":"I @username will not be voting for you Mr. @username because you are starting to sound like a main stream republican when it comes to ILLEGAL IMMIGRATION . I was with you from the beginning but not now. NO AMNESTY !!!","post_message":"The Clinton's are the real predators..."},{"comment_id":"10154859585584726","commenter_b":"Unfortunately in the eyes of progressives the answer is no. Meanwhile a slutty whore like Madonna can sell anything and everything she wants.","commenter_a":"Boy what hypocrites we have in show business. The left is losing it and it is getting really old!","post_message":"Can't a guy sell what he wants to sell?"},{"comment_id":"1237783792909359","commenter_b":"Now the Muslims are going to come here and outbread us? ....is that their big 1000 yr plan? ....lol","commenter_a":"Tell that to my neighbors in Roanoke,VA that got stabbed this weekend . The terrorist is being investigated by the FBI for terrorism....Only when the national news reported the terrorist attempted to behead not stab the man did the local liberal rag paper update their reporting.","post_message":"The United States faces many threats, but terrorism is not chief among them, according to VP Joe Biden. @webpagelink"}]
