[{"comment_id":"10156239205725354","commenter_b":"Let America become a car and truck free nation! and make it against the law to have any types of butter knives, butcher knives, and no hatchets, swords or knives of any shape or form, no sharp spears or sticks of any kind, pointed objects, needles including knitting, or sewing needles and absolutly NO clubs or bats or rocks of any shape or kind!! No ropes or twine or chains or braided objects! If they break the law and have any of these weapons in posession they will be put in prison untill they rot! Now tell me how is the government going to house and feeed all these lawbreakers????????............................................?","commenter_a":"You guys have no frigin idea what your talking about.","post_message":"No word yet on when they will call for a car-free America..."},{"comment_id":"10155098283689411","commenter_b":"Bitch","commenter_a":"Politics and sex don't belong together. Also, what a dirty whore.","post_message":"'Everything is ok'"},{"comment_id":"10153373038333855","commenter_b":"Kill this witch","commenter_a":"She wants every legal consequence possible so she can be a Christian Martyr!","post_message":"BREAKING: Kentucky clerk defies Supreme Court."},{"comment_id":"1726976590895675","commenter_b":"@username Drama queen.","commenter_a":". LETTERMAN'S TOP 10 REASONS TO VOTE DEMOCRAT 10. I vote Democrat because I love the fact that I can now marry whatever I want. I've decided to marry my German Shepherd. 9. I vote Democrat because I believe oil companies profits of 4% on a gallon of gas are obscene, but the government taxing the same gallon at 15% isn't. 8. I vote Democrat because I believe the government will do a better job of spending the money I earn than I would. 7. I vote Democrat because Freedom of Speech is fine as long as nobody is offended by it. 6. I vote Democrat because I'm way too irresponsible to own a gun, and I know that my local police are all I need to protect me from murderers and thieves. I am also thankful that we have a 911 service that gets police to your home in ...","post_message":"Good morning America! Big day ahead! Join me at 11amE - as I officially announce my Vice Presidential choice- Governor Mike Pence! Watch here: @webpagelink"},{"comment_id":"10157007192550354","commenter_b":"But illegal aliens have Constitutional rights..yeah,she can go fk herself right about now","commenter_a":"tell that to chelsea you a hole","post_message":"\"...the Left is very energetic about inventing myriad rights for people who weren’t born in the United States or naturalized as citizens. How can the absolute denial of rights for unborn persons, whose parents are indisputably U.S. citizens, be logically squared with the Left’s zeal for handing out rights to foreign persons who just happen to be standing on U.S. soil?\""},{"comment_id":"10153708234594199","commenter_b":"Then go. If they let you in. Otherwise.... You might end up an illegal alien. Ironic, eh?","commenter_a":"Canada looks better everyday.","post_message":""},{"comment_id":"955482931153795","commenter_b":"I think everyone should mind their own business,it's between God,her and gays. Don't you think ? Stop throwing stones. So much going on in this world.","commenter_a":"Amen Rev. Franklin Graham","post_message":"Every American must see what Rev. Franklin Graham just said about the arrest of Kim Davis!"}]
