[{"comment_id":"10157942641385354","commenter_b":"Horseshit. Grow a set wussie. You give me a bad name.","commenter_a":"Danika Pearson","post_message":"Wake Up, Gun Owners. This is No Joke."},{"comment_id":"10153563435706162","commenter_b":"This is some shady bull. Why was she even in jail in the first place? That I'm not understanding she was pulled over for not signaling a lane change? How did she even manage to be asked to get out of the car or get out of the car to assault an officer? I wouldn't have gotten out for that violation right me my ticket or let me go period point blank. I would be respectful but i wouldn't let them take advantage. She should have not been in jail in the first.","commenter_a":"Abc won't let this go. Must be a good day to hate on the police. Even though there is only evidence she killed her self.","post_message":"Her primary cause of death was \"hanging.\" Family and friends want to know what happened to a Naperville woman found dead in a jail cell, after she was pulled over for a traffic stop while on a road trip with her mom: @webpagelink"},{"comment_id":"10153110921541378","commenter_b":"Very glad the child's okay and I hope that scare woke up that woman to f****** reality","commenter_a":"How do you forget your CHILD in the car.","post_message":"DRAMATIC VIDEO: After allegedly leaving her 1-year-old alone in a hot car, a woman is confronted and a bystander incorrectly tells her that the child has died. That moment was caught on video:"},{"comment_id":"10153469031994705","commenter_b":"Everything is wrong with McDonald's.","commenter_a":"Well I love mc donalds There's nothing wrong with mc donalds","post_message":"McDonald's big secret isn't so secret anymore."},{"comment_id":"10154145520606770","commenter_b":"Never, they're pigs. Tell them to oink off.","commenter_a":"When did they stop calling women like Kim who have no decency or moral compass pigs?","post_message":"The outfits that Kim Kardashian and Kendall Jenner wore were absolutely stunning."},{"comment_id":"10154649448359369","commenter_b":"She's a disaster with poor judgement to boot","commenter_a":"I trust her judgement in situations like this! She has a better understanding how things work internationally than Trump!","post_message":"She says Donald Trump created a \"diplomatic incident.\""},{"comment_id":"10156293544295354","commenter_b":"@username why don't you move to the UK where you will be safer after all criminals don't have guns because they are illegal there and everyone know criminals obey gun laws .","commenter_a":"I'm a huge 2nd amendment advocate and there are 1000 reasons why the gun control crowd is wrong, but I really don't care for this particular argument. Public people are at more risk than private people to become victims of crime. Any of us can become victims of random crime, stalkers, etc., but overall, the public officials and celebrities draw more risk in that regard. Hillary is so loathesome and widely despised, she probably would have been gone long ago if not for that armed security. I, OTOH, just recently bought my first gun and didn't piss off anyone enough to want to kill me. I like to use that famous Japanese quote in WWII as to why they didn't even consider invading the U.S. - \"Invade the U.S.? Impossible, there's a gun behind every blade of grass\". Our guns keep our nation safer and serve as, I hope, some ...","post_message":"Hillary Clinton: If you truly believe guns don't save lives, why do YOU have armed security protecting YOUR life with guns? We regular folk can't afford to live in million dollar mansions like you and Bill do. Why don't you want us to protect OUR families and children with guns when you use them to protect yours? Signed, AMERICA"}]
