[{"comment_id":"426081280913499","commenter_b":"Kiss my ass!!","commenter_a":"Not Surprised, a fight to fight, no reason just out of control. Using excuses for what is being done. If you were really protesting over the treatment of the men and women injured and or killed, you would be ranting about this, not burning up a city, and hurting people.","post_message":"Such a racist sign..."},{"comment_id":"10152884015311336","commenter_b":"No that would be michelle Obama. That thing has an Adam's apple.","commenter_a":"Maybe they could use the canned food to prepare REAL meals for the kids and throw the Michelle Obama school lunches at the attacker.","post_message":"A principal in Alabama wants to stockpile cans of food in classrooms so that students can “stun an intruder \"or even knock him out\" until police arrive.  What do you think? Is this a good or bad idea?"},{"comment_id":"10154467991806162","commenter_b":"Put down the pipe lady.","commenter_a":"And I am so tired of the argument that white America doesn't understand the history of slavery, or they are so \"ignorant\" about the contemporary machinations of racism. The claim of ignorance is part of the diabolical ruse but this mess is all cooly calculated and designed to preserve the racial hierarchy, which these days is often called \"racial disparities.\" Which I say is a bureaucratic term used to obscure the genocidal potential of white supremacy. How could a culture of people who have so meticulously sought to prove their superiority in all things, be so intellectually dense about how racism works? Slavery is well understood by white America because for the past 150 years it has ingeniously recreated it over and over again and called it by another name while playing dumb. FOH!","post_message":"The store owner, Abdullah Muflahi, released a video that he said he shot from a slightly different angle. He said Sterling was not holding a gun during the shooting but that he saw officers remove one from his pocket afterward. His video shows an officer reaching into Sterling's pocket to grab an object."},{"comment_id":"505124579675835","commenter_b":"Kiss my ass!!","commenter_a":"You have no rights!","post_message":"The most chilling and honest interview about Islam you’ll ever watch…"},{"comment_id":"10153464024014087","commenter_b":"Nothing will convince me that illegals not being here would not mean more money in the pockets of people in my nation who are living in poverty today and because my fellow countrymen are the only thing important when it comes to my nation.....my political support will only be for candidates who will remove illegals from my nation as my Constitution requires","commenter_a":"If illegals were back outside our nation....jobs would be much easier to get for our citizens","post_message":"President Barack Obama's three-pronged plan includes wage insurance of up to $10,000 over two years, expanded unemployment insurance coverage and more opportunities for laid off workers to retrain and reenter the workforce. WATCH:"},{"comment_id":"859646614169357","commenter_b":"Even the stupid people are starting to figure out that @username is a scumbag. It's not that tough to connect the dots that she's a liar, who's willing to sell our children's safety to the highest bidder. by #AnthonyRamirez #ImAgainstHer #LockHerUp #HillarySucks #NeverHillary","commenter_a":"No mention of Michael Phelps? O yeah, he's a white male and the most successful Olympian in history who also happens to be American. Stupid me...doesn't fit your crooked script.","post_message":"Well said, Coach Auriemma. Keep winning, USA Basketball."},{"comment_id":"10153159766848701","commenter_b":"Pigs... Sterilize them both!!!","commenter_a":"Slam thier ASS in jail till they both get the hell beat out of them or killed by inmates.. Thier parents are proud of them now ...","post_message":"A man and woman charged with murder are accused of starving their 7-week-old baby to death in Douglas County."}]
