[{"comment_id":"616770258526486","commenter_b":"Feminists and think is a oxymoron","commenter_a":"I swear liberal women are just craving the fashion culture and using \"civil rights\" as a defense for it. They just want to wear a pretty head scarf because they crave culture.","post_message":"www.EagleRising.com"},{"comment_id":"1289811051085647","commenter_b":"Nothing prepares your for a move a bitch ass pussy makes smh","commenter_a":"Always gotta be ready. I definitely think it was a pussy move though","post_message":"What a cheap shot! #mma #cheapshot #wshh www.worldstarhiphop.com/videos/video.php?v=wshhfsWHNoydsw8M0AY7"},{"comment_id":"10153123905806800","commenter_b":"What??!!! A telling point, if in jest, that she made her own rules!","commenter_a":"Sorry, John. I usually love your stuff, but you missed the point on this one. As someone who used to have a government email account, this is a big deal. Every government employee must have one, and to access most government systems, you need to use it. This allows those emails to be captured as part of the public record. This is significant enough that it's caused me to reevaluate my support for her. I see two major issues: 1. I can't imagine the hurdles and hoops her staffers had to jump through to make this happen. And it wasn't like it made things easier for Hillary. Several high-ranking people I worked for had a government email account and hardly ever read it. Their staff checked their emails and passed on the ones they needed to know about (like just about any high-ranking person in a company). This just put ...","post_message":"\"Is that against the law not to have an email account? It seems less of a scandal and more of like a nerd snap. 'Oh, she so old she doesn't even have an official email account!'\" -- Jon Stewart ►Watch the episode: @webpagelink"},{"comment_id":"10154742008716130","commenter_b":"And I would brain-smash you if it were legal. So what now, Bitch?","commenter_a":"Looks like someone forgot to tell this douchebag that Democrats don't run s*** anymore.","post_message":"Time's running out..."},{"comment_id":"10154553975279753","commenter_b":"Aaliyah Johnson","commenter_a":"Gina Anna","post_message":"uh this is amazing Foxes & Friends"},{"comment_id":"10154161281331636","commenter_b":"But if you are in line at the time of closing they have to stay open to allow you to vote. This orange plague on our Country needs to GO!","commenter_a":"Seriously he doesn't like democracy you elect him you'll have a dictator who you will have to overthrow","post_message":"BREAKING"},{"comment_id":"10154400820486051","commenter_b":"@username Suck it up Buttercup, it's the middle class that pays the taxes that all you losers live on. President Trump has done more, so far than Obama has done in 8 years. Oh I forgot he (BHO) has flooded America with illegals that are: murderers, rapist and child molestersl. The best thing that can happen for the USA is the Big One hit and take California with it.","commenter_a":"Rock on Rosie! Trump is scum! All these despicable people supporting him would make america great again by leaving. They are what is wrong with our country.","post_message":"Rosie O'Donnell just made a very controversial accusation against Donald Trump."}]
