[{"comment_id":"10152867381576130","commenter_b":"The fact he's sharing this photo makes it people's business lol","commenter_a":"So what does he have down there?","post_message":"\"We've had comments saying 'he doesn't look trans' which brings up a great point on what does trans even look like?\""},{"comment_id":"10153647988748145","commenter_b":"She should have hit their dumb a$$es with it. Now run tell that","commenter_a":"WTH?","post_message":"After 40 minutes of trying to convince the security team that removing the prosthetic wasn't necessary, the woman was led to a private room where she was asked to remove her pants and take off her leg."},{"comment_id":"10153104489209726","commenter_b":"Bring it bitch","commenter_a":"Think again ! Governors and sheriffs need to lead the people and fight federal corruption and over reach !","post_message":"WATCH: Eric Holder On ISIS: 'I Think We're Winning'"},{"comment_id":"1197123797007048","commenter_b":"we dont have to suit anyone, the LORD gave us free will, why dont the VATICAN set up a special place for these illegals.","commenter_a":"you like mr pope you take them all including obama kerry h clinton no need to thank america for giving you these winners you are welcome o mexico will send all their winners too you are welcome ok","post_message":"I wonder how many spare rooms the Vatican has..."},{"comment_id":"10153499829950329","commenter_b":"Whooooah Michelle Esquibel Gena Esquibel","commenter_a":"Jenna Benham","post_message":"For a \"kids\" party, yes. Definitely not for adults. *coughs*"},{"comment_id":"968475119944707","commenter_b":"Man this website is So So So Biased, how can you take a political stance all day long to put down trump(4 to 5 articles a day) trump is this, trump is that, can we even call you a news website anymore??? How much money did the hill team fill your coffers with??? Do you not care about the world?? It's bleeding out in the middleeast :( you completely put out the best prospective candidates bernie, Jill, Gary. You leave trump cuz he doesn't say too many intelligent things but he is more human than any of the Warhawks that's been running the murica for a decade now!!!! Please people we need to spread the truth and love not put people down and dish out hate all day!!! Here's my finger to you Huffington","commenter_a":"put a toothbrush moustache on hillary and then it would be appropriate to yell 'heil hillary!' What is going on in 2016, appears to match severial elements to the 1934 German presidental election. For example: 2016 Democrate liberials ruthlessly beating up on Republican voters. Local Police (Fresno Ca) allowing violence as a policital objective at a Trump event. Propaganda; political acuity against conservative thought and the deceptiveness of 90% the media to sway voters towards hillary. Can anyone define all the promises from this great fuhrer hillary to buy their votes? HEIL HILLARY! Even the Universities and High Schools are exercising power over speech they disagree with. This is a time of struggle 'Kampfjahre.'","post_message":"They really got riled up about his birther-announcement fiasco."},{"comment_id":"10152867173405667","commenter_b":"Can't stand her","commenter_a":"Start with the thugs then will talk","post_message":"\"How is it possible that we as a nation allow guns to fall into the hands of people whose hearts are filled with hate?\" Hillary Clintonsaid."}]
