[{"comment_id":"10153334990238132","commenter_b":"There will always be someone looking for the controversy in something as simple as a picture is a baby in a flag. Move on! Be proud of our flag and the POSITIVE way is being displayed. AMERICANS have done worse to our flag!!!","commenter_a":"Any true American can not dislike this photo. This photo is what patriotism is all about! Anyone that has an issue with this photo must not have been born here, because this is what patriotism is all about. Thank you sir for fighting for our freedom.","post_message":"What do you think of the controversy that this photo is creating?"},{"comment_id":"10154263187613984","commenter_b":"If Hillary were to win, she and Bill would never let Megan Kelly out of the White House!","commenter_a":"I think the Hildabeast has an eye for Megyn Kelly. Watch out Megyn, being too close to this one may lead to stupid. Be careful.","post_message":"During a recent interview, Hillary Clinton revealed her true thoughts about Megyn Kelly. No one expected what she was about to say..."},{"comment_id":"1653212978299148","commenter_b":"You two bitches are so very stupid","commenter_a":"John. I agree with you.","post_message":"It's about time...  I'm tired of these two."},{"comment_id":"10152943603067217","commenter_b":"Mosks should be destroyed first","commenter_a":"The earthquakes should destroy only churches.","post_message":"New Zealand's Christchurch was struck by a devastating earthquake in 2011"},{"comment_id":"10153697360054091","commenter_b":"Relax...pretty sure she won't get a welcoming party in jail...LOL","commenter_a":"Really? So now taxpayers get to pay to house her, feed her, clothe her, get her medical attention when needed. Who wins? This woman should just be drawn and quartered after a long term of suffering torture. A mind like hers should never be able to influence others in prison. Maybe they will put her in a dark place alone and forget about her.","post_message":"A Colorado judge sentenced the woman who cut a baby from a stranger womb to a century behind bars."},{"comment_id":"1541783172796541","commenter_b":"#__ #__ #StopYazidiGenocide #StandforYazidiWomen","commenter_a":"Hire them!! If they can do the job, HIRE THEM !!","post_message":"If your business or organization is hiring and needs someone to get the job done, hire a veteran."},{"comment_id":"979662915464481","commenter_b":"Shut up bitch","commenter_a":"there is no cure for stupid!","post_message":"Jesse Jackass rides again. Check out THIS crap. UNREAL. @webpagelink"}]
