[{"comment_id":"10154258976231770","commenter_b":"'@username and for the record we did do something about, we went after the people responsible for it! It just took 10 years because these animals lives in caves, and theses lots of caves over there!","commenter_a":"Trump said he will take care of America first and he is he said he will deport Illegal aliens and he is he said he will bring back jobs to America and he is and he said he will build a wall on our southern boarder and he will !!! AMERICA FIRST !!!","post_message":"'There are lots of constitutional questions that reasonable people can disagree about. Whether the president can exclude foreigners from seven terror-prone countries is not one of them,' writes Ann Coulter."},{"comment_id":"1063081163723447","commenter_b":"Get em outta here!","commenter_a":"With all the hate in this country should the media be publicizing this to stir it up. Give those people a chance... They have had enough conflict.","post_message":"Eighty-two Syrian refugees have resettled in Ohio.   >>SEE what cities they have moved to: @webpagelink"},{"comment_id":"714422425388653","commenter_b":"Get out of this country!!! The USA was great until you damn Devils Muslims started to come here!!!","commenter_a":"I don't care. Take that shit off. What do you have to hide. You want to wear it , wear it at home.","post_message":"She filmed it.   WATCH the video very closely..."},{"comment_id":"1049118838444933","commenter_b":"Ross I'm quiet familiar with what you and others want, but that's not the way it is,especially me. I served this country for my beliefs and I'll be damned whether people like you like my opinions or not. One day when the liberals get their way and all the refugees and ILLEGALS are let in this country then maybe you may see what I'm talking about. Either way its not my problem, I've served my time and paid a life time of taxes and still paying. No I think Ross today's society are out of touch with reality is the problem.","commenter_a":"As an older person I've come to the conclusion you can't blame these young snot nose, entitled brats. This is the environment that's been created by the liberals, so everybody can feel hunky dory.","post_message":"She probably won't be too pleased..."},{"comment_id":"10154433105394087","commenter_b":"I'm an independent, but republicans are completely full of shit. And they don't mind the smell. Their platform is based on racial deportation.","commenter_a":"100% TRUTH","post_message":"'Unless more leaders in the black church recognize that blindly supporting one party, which has done nothing to earn that support, is not benefiting those that they serve, the church will continue to lose its political influence.'"},{"comment_id":"1038233369545417","commenter_b":"Can't stand her!","commenter_a":"I stop to watch her program Always bashing on the same person all the time ! I did think that during the first debate the question was legitimated after all he has to respond because the question was going to be asked from her or somebody else But after all the bashing my trust in what they call fair and balance news under her reports was gone and I was certain that She did have an agenda by starting by this type of question Also what is making me mad is all the spin around her the queen She giggles all the time even when her guests are vulgar in her program It made me laugh when I ear that she is a respectable journalist and fox stands for her Did they listen when she was giggling from her heart when somebody said that during one of the debate ' ...","post_message":"Megyn Kelly didn't hold back! (WATCH)"},{"comment_id":"10153662067420950","commenter_b":"Teresa you need a big fat,one stuck in your mouth so you can't talk but choke","commenter_a":"Trump's mouth is actually helping to elect Democrats in November. I wonder how many Republican leaders were meeting this morning and asking one another 'How in the hell can we shut this guy up?'","post_message":"'I'll say one thing about the Democratic Party,' Trump observed. 'At least they stick together.'"}]
