[{"comment_id":"602611366596109","commenter_b":"She needs to shave her pits.....ugh, she's so nasty!!!","commenter_a":"remember...she is a singer, she is a singer, she is a singer,.....","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'. This is unacceptable, we stand against Miley 100%. Do you agree Miley should be kicked out of the country?"},{"comment_id":"648235325326484","commenter_b":"She has! Wake up!","commenter_a":"Killary should release her tax papers too! She is a liar and a murderer!","post_message":"Yesterday, Hillary Clinton blasted Donald J. Trump in a heated speech on the economy. So now, Trump is firing back... hard: @webpagelink"},{"comment_id":"10153436202258855","commenter_b":"No a chick with a dick Courtney Danielle Banks","commenter_a":"That one ugly dude","post_message":"Go get 'em, Vanessa!"},{"comment_id":"10153679866377217","commenter_b":"She was vile","commenter_a":"She was rude!","post_message":"\"I'm in favour of migration, I simply want to control the numbers\" - Vote Leave's Michael Gove tells BBC Question Time audience. @webpagelink #bbcqt #EUref"},{"comment_id":"10153488869101636","commenter_b":"I am nothing close to a conspiracy theorist, but doing what I did in the military, I seen how cut throat people could be. Especially if they are scared that information will get out there that will harm them. I'm not saying that anybody did tamper with his breaks, all I am saying is that it is possible. Nobody cut his break line obviously because he would of known, but had some drilled a pin hole in a brake line or reservoir, then sealed it to make sure it didn't leak out while sitting stationary. Then as he leaves the drive way he is still able to brake because there is fluid there to press the caliper in, but it breaks the seal and starts to leak out and he could use the brakes so long that the hydraulic fluid is still able to pressure the system. By the time ...","commenter_a":"I am just throwing it out there but Im pretty sure if his brakes had been tampered with he would have known it after the first stop sign or stop light after he started his car.... They dont pick and choose when to work and when not to work when tampered with","post_message":"Police say the data box from Aubrey McClendon's vehicle registered what was happening just seconds before the crash."},{"comment_id":"1275439085806772","commenter_b":"Hopefully they'll rule it what it is, UNCONSTITUTIONAL and they can send all of the ILLEGALS back to where they came from. I don't know what it is about Liberals not understanding the concept of the word ILLEGAL! Maybe some of these Bleeding Heart Liberals that want these ILLEGALS here so badly will open up their checkbooks and homes to feed house and clothe these illegals. Oh wait, that's just wishful thinking...Liberals can't do anything without other peoples money.","commenter_a":"Sick of his abuse of the executive order. Be gone loser !!","post_message":""},{"comment_id":"745823678941543","commenter_b":"get her out","commenter_a":"Bye dumbass!","post_message":"Whoopi Goldberg To Leave The Country For THIS Awesome Reason It's about time. We don't want you here anyway. Can we get 30,000 'LIKES' to have Whoopi leave the country?"}]
