[{"comment_id":"10153608579386509","commenter_b":"Girl bye","commenter_a":"a young man's throat was crushed and spine severed in police custody BUT detached politicians who left their grand wizard costume at home are blaming Obama. unsure emoticon #smokescreens #distractions","post_message":"Some 2,000 National Guard troops and more than 1,000 law enforcement officers will be on duty tonight in Baltimore, Gov. Larry Hogan says. @webpagelink"},{"comment_id":"1023543291017240","commenter_b":"Nappy fake hair bitches.","commenter_a":"Black women aren't hot ! You can't do a fucking thing to me ! White lives matter !","post_message":"Do you think what this college student said is racist?"},{"comment_id":"10154818711864586","commenter_b":"BASTARDS","commenter_a":"these idiots should beSHOT!! \"COWARDS\"","post_message":"[GRAPHIC] If you drive a Toyota USA, General Motors, or Volkswagen car, you need to see this."},{"comment_id":"10157692463425389","commenter_b":"Hillary will win due to the corruption within the establishment, and the votes of illegals and dead people!!","commenter_a":"Never permit the Federal government to pass into the traitorous hands of Hillary Clinton","post_message":"Keep in mind-he actually did these things."},{"comment_id":"10153917800769087","commenter_b":"Suck Ass Fox (lol)","commenter_a":"the people who think trump is a joke need to get smart....in a hurry. the only vote that will count in november is the one cast to defeat, no, destroy trump. i don't think jill stein will do that. hillary will. hold your noses people and do the right thing. for the wrong reasons perhaps, but do it. after the dust settles and trump, god forbid, wins, it will be too late to hear you whining.","post_message":"Dozens of the most prominent people in Silicon Valley signed an open letter on Thursday warning that Donald J. Trump \"would be a disaster for innovation.\""},{"comment_id":"1317863694976546","commenter_b":"She is not his type","commenter_a":"Hillary paid them","post_message":"BREAKING Trump campaign adviser A.J. Delgado tells Brian Williams the allegations of inappropriate touching against Donald J. Trump aren't credible."},{"comment_id":"10154058052466336","commenter_b":"the muzroach must not remain on the face of the earth no more","commenter_a":"He probably wouldn't have been caught coming across Obama's border.","post_message":"Police say they seized four air rifles, eight scopes and 200,000 .22-caliber bullets."}]
