[{"comment_id":"1012231985511331","commenter_b":"She has NO BRAIN CELLS!!!!!","commenter_a":"Nuts for sure","post_message":"Americas Freedom Fighters"},{"comment_id":"10153717076186680","commenter_b":"Hillary Clinton is unfit!","commenter_a":"Odummy you aren't fit to tie Trumps shoe laces sorry doesn't even begin to describe you.You are just a halfbreed SOB that got elected for your skin color nothing more.","post_message":"President Obama on Donald J. Trump : \"The Republican nominee is unfit to serve as president.\""},{"comment_id":"10155662877255354","commenter_b":"She is f#$%&@+ stupid.","commenter_a":"Fucking stupid liberal fuckers","post_message":"And look how much the fine would be if you didn't."},{"comment_id":"10154235366227060","commenter_b":"Yea and Mardi Gras day they'll be showing their breasts for beads!!!","commenter_a":"Yall be safe.....show them","post_message":"The Women's March New Orleans begins now from Washington Square Park."},{"comment_id":"10157208654565294","commenter_b":"Preach!","commenter_a":"God I wish we could stop talking about this guy. Who cares he's a waste and obviously doesn't want to try and help himself in anyway. Glad he's at least not on the Browns any more.","post_message":"\"I hate to say it but I hope he goes to jail. I mean, that would be the best place for him.\""},{"comment_id":"986428001390952","commenter_b":"If she doesn't like it let her go back to where she can ask for what she wants and expect to get it because she's Muslim. If one doesn't like our rules go somewhere else.","commenter_a":"Simple solution open and pour content of can into cup in front of customers","post_message":"Your thoughts?  STORY: @webpagelink"},{"comment_id":"10153093946344205","commenter_b":"Illegals idiot","commenter_a":"He realizes that Mexicans aren't the only immigrants in America, right? Over half of Americas population would be kicked out if he tried to do that, and that's only recent immigrants. If you wanna get technical, the only people that aren't immigrants are Mexicans and Native 741915279236631s. They were here first.","post_message":"Donald J. Trump's detailed and foolish immigration plan explained."}]
