[{"comment_id":"1007362382702564","commenter_b":"That's uncle Ernie sitting on the eggs","commenter_a":"@username get off of here!","post_message":"ONE EGG IS HATCHING! Eaglet Watch 2016 continues as Harriet and her mate M15 wait for their two eaglets to hatch. One egg began to crack yesterday! Fingers crossed we get an eaglet today!   Once an eagle egg begins to crack, it can take 12 to 48 hours for the eaglet to fully hatch.   Live video: Southwest Florida Eagle Cam MORE: @webpagelink"},{"comment_id":"1080661608696757","commenter_b":"Stfu!","commenter_a":"Way to go Lebron!! Millionaire rappers should do rap outs in support of someone who pointed an EXACT replica of a Colt 1911 at police. Yes it was a pellet gun, but if the child was educated at home on gun safety and how to never point anything that resembles a gun at police officers he would be ALIVE today.","post_message":"\"This issue is bigger than me; it’s about everyone. And gun violence and tragedies and kids losing lives at a young age, some way, somehow we need to understand that that matters more than just an individual.\"  - LeBron James"},{"comment_id":"509824199177535","commenter_b":"^ Then stop posting your shit on our news, we honestly couldn't give a fuck about you dumb cunt Americans. Continue shooting each other, I need more wanking material.","commenter_a":"\"More guns!\" -Americans","post_message":"DEVELOPING: The search for the suspected gunman continues this morning."},{"comment_id":"10155111807156162","commenter_b":"It's her white male privilege.","commenter_a":"Wtf probation !","post_message":"The 46-year-old mother avoided jail after pleading guilty to raping her daughter's 13-year-old boyfriend."},{"comment_id":"1686607741593351","commenter_b":"Morris @username For President Independent....Thompson say's \"I don't care about the F _ _ _ _ _ _ Wall\"! Under my plan I am going to enforce existing law that requires all employers document its employees right to work. There is an $11,000 penalty per illegal that will be used to pay for the deportation. Former Mexico President Vincente Fox I intend on overwhelming Mexico with illegals","commenter_a":"As they say in Espanol....p..... tu madre.","post_message":"EX MEX PREX: 'NOT PAYING FOR FUC*ING WALL'"},{"comment_id":"1226980343992420","commenter_b":"Ugh man females I hate em in high school and yes we can have a button up and cleavage will show lol","commenter_a":"Jessica Elizabeth😂😂😂","post_message":"Boob deodorant? Oh yes, I've got that."},{"comment_id":"1703427863256710","commenter_b":"Like Hillary thinking people should vote for her just because she's a woman.","commenter_a":"Race is not what matters. It is what is in your cranium! Dr. Ben Carson said this and he is correct. How stupid is this woman and those who think race and gender are the most important things in this life!","post_message":"Too much skin in the game?"}]
