[{"comment_id":"10153566886509614","commenter_b":"Stupid girls!","commenter_a":"Looks like the liberated those caged pups. :)","post_message":"Two teen girls were caught on surveillance footage stealing two puppies who were still nursing and not yet ready to leave their mother, workers at a pet store in Compton allege. In the video, one girl can be seen leaning over a gate and grabbing a puppy while the other stands by. The alleged theft happened Thursday at Jazmin Pet Supply. this post to alert others. Watch KTLA video here: @webpagelink"},{"comment_id":"1252586078101378","commenter_b":"close the borders is THAT step you @$$hole","commenter_a":"Yeah he may need to stop staging them, its transparent that since hes been in office we have had the highest amoumt of mass shootings ever, and seems it happens around the time he wants to push for more gun control. Is it me or am i going nuts.","post_message":"Knowing nothing about the causes of the #SanBernardinoShooting, Obama issues his mindless chant for more gun control. cnn.it/1Xzyg5u"},{"comment_id":"10158461091345206","commenter_b":"I wouldn't put it past that liar!!","commenter_a":"Dan Elsa","post_message":"“Early in Clinton’s tenure as secretary of state, she and her staff were observed removing lamps and furniture from the State Department which were transported to her residence in Washington, DC.\""},{"comment_id":"10153386535509099","commenter_b":"What shame. Thought most grown women are maternal. I was right \"MOST\" not all.","commenter_a":"Maybe we should stay home with our babies.","post_message":"A hidden nanny cam captured more alleged abuse against the 3-year-old girl and 1-year-old twins @webpagelink"},{"comment_id":"10156459147080354","commenter_b":"if you went to stop all this killing then we have to get all the dam muslims out of America they don't care about living they been killing each other for years and now they are doing it here I hope America will open there eyes and make this move","commenter_a":"Don't worry everyone the government is screening all of these Syrian refugees.","post_message":"***BREAKING*** Muslim Killer Tashfeen Malik was in America on a K-1 (fiancée) visa and held a Pakistani passport. DEVELOPING..."},{"comment_id":"10154125153407169","commenter_b":"STOP Election Fraud: Do NOT use Soros voting machines. Please vote to put Billery/Killery on trial for TREASON. She broke the law and belongs in jail. She risked our country and put our people in harm's way, and had Democratic whistleblowers murdered. Not only Billery is very dangerous, she will bring this country to a security collapse with cutting our military and a financial collapse by choosing a fight with Russia and ruining small businesses while sending all jobs overseas. Please don't vote for the DEVIL. This country needs to be free and strong, where people have a real chance at the American Dream. Billery should have never been the Democratic candidate to start with and stole the nomination from Bernie Sanders. She is the most corrupt candidate ever and works for the elite new world order who wants to make people obsolete with new robotic technology. She brings with ...","commenter_a":"It will make money for the drug companies!!!","post_message":"Primary care doctors and nurses are well-positioned to treat addiction and champion care for those struggling with the use of opioid pills or heroin (From PBS NewsHour)"},{"comment_id":"10153423522201636","commenter_b":",,,keep yer head down and leave the building!!!","commenter_a":"I KNOW WHY,,, never ever ever ever talk about PERIODS when a woman has her period!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! :O","post_message":"The answer is simple"}]
