[{"comment_id":"841833905948136","commenter_b":"What utter rubbish, it's the same beautiful country i have loved all my life & watched change under EU dictatorship & when my 88yr old father says \" this isn't what we fought for \" i know we've done the right thing , please don't panic people after a bumpy ride calm & Great Britain will be restored","commenter_a":"Spengler predicted this.","post_message":"\"This is not the country it was yesterday. That place has gone forever.\""},{"comment_id":"838910662903525","commenter_b":"@username Take your temper tantrum elsewhere! Hillary's got this! #HillYes","commenter_a":"LOL JK BUILD THE WALL DEPORT THEM ALL TRUMP 2016","post_message":"I was so moved to receive this honor from Puyallup Tribal leaders."},{"comment_id":"10153367837094714","commenter_b":"You just don't understand feminism, boys are free to do what they want to do women should be just as free, to have sex, get drunk and behave carelessly just like boys do.","commenter_a":"Why would they take offense? Because they want to protect the image and dignity of young women? Seriously?","post_message":"Wow, we didn't see it until we looked closely"},{"comment_id":"1153132958040066","commenter_b":"All 3 should be skinned and decapitated!","commenter_a":"And everyone \"outraged\" are all Vegen, right?!! Where is the outrage for the 100's of 1000's of innocent babies murdered every year???!!!","post_message":"The U.S. tourist who who killed Zimbabwe's beloved lion, Cecil, received global condemnation as news spread. Read more here: @webpagelink"},{"comment_id":"10150565402804999","commenter_b":"Please don't vote for her just because she's a woman.There are plenty of good women out there to vote for.","commenter_a":"Anyone who votes for her is showing support for terrorism and the killing of US personnel","post_message":"“I’m running for president,” Hillary Clinton said with a smile near the end of a two-minute video."},{"comment_id":"884256465098263","commenter_b":"Illegals.","commenter_a":"You dumbo s Hillary won the popular vote by 2. Million","post_message":"Liberal media is forcing this down, they really don't want anyone to get a hold of this information. Let's spread it. America deserves to know the truth. Are you happy with the results?"},{"comment_id":"1901231699975547","commenter_b":"That don't count, She is a pig and certainly is Fat. Its not her fault it was the spoons fault.","commenter_a":"Wasserman hates men","post_message":""}]
