[{"comment_id":"10153580246221636","commenter_b":"Where we going? X","commenter_a":"@username when that degrees done, emigrate xx","post_message":"It's getting more and more expensive being a student"},{"comment_id":"10153221460464087","commenter_b":"I don't get why liberals are being such cry babies? Don't get so upset about losing votes. Illegal is illegal. Period. Come back to the country Legally!","commenter_a":"You have my vote MR Trump!!","post_message":"\"The first thing I'd do in my first day as president is close up our borders so that illegal immigrants cannot come into our country,\" Donald J. Trump vowed."},{"comment_id":"1387016887980986","commenter_b":"Oh yeah. AMERICANS have to folllow all the rules, but illegals can do just as they damn please. Right? Poppycock.","commenter_a":"Fuck u Cicala !!!","post_message":"Sportscaster on Female Attacked by Democrat Mob: She Was Asking for It by Wearing Trump Jersey!"},{"comment_id":"10155048968076037","commenter_b":"I would be behind him Mr. Knowing it all","commenter_a":"Wikileaks said the emails were a \"leak,\" not a hack. i would like to see some evidence of wrongdoing, before Obama starts WWIII on his way out the door. Why is he effecting ANY major policy changes so close to being out?!?","post_message":"The US will kick out 35 Russian intelligence operatives & shutter 2 Russian compounds."},{"comment_id":"10153907733031002","commenter_b":"I don't believe she \"deserved\" it at all. I also agree that a man that size obviously has other options to restrain someone. These girls need to realize these men aren't their daddy, brother, uncle.. They don't know how they are going to react, so they need to keep their hand to themselves. Neither party was right here.","commenter_a":"She Wasn't out of pocket. Just Because she was waiting for her brother that gave him the right to grab her up like she was an issue. This is a grown man, you don't punch a teenager on the face like she a man. He had no right to ever touch her, her brother was just trying to protect his sister, as he should.. PEOPLE are out of control.","post_message":"A mother is demanding answers after her daughter was punched during a heated exchange at a skating rink."},{"comment_id":"972010302845037","commenter_b":"Sick evil hag","commenter_a":"Someone should MOUNT HER, OR STUFF HER","post_message":"Why one big game hunter is NOT backing down: @webpagelink #CecilTheLion"},{"comment_id":"10153390451923837","commenter_b":"She should have done what the officer said and THEN tried to negotiate. I'm sure he would have let her return or pay for the shoes, but she insisted on pulling away from the officer, flailing and kicking. Officer was in the right.","commenter_a":"Oh well she got her prize for stealing","post_message":"DO THEY GO TOO FAR? Check out the body cam video of a Fla. woman accused of shoplifting being taken down and bloodied by a sheriff's deputy. Was the officer too aggressive? THOUGHTS - HANDLED FINE or WENT TOO FAR?"}]
