[{"comment_id":"10155146081185725","commenter_b":"I would never allow a nun within a telephone poles reach of me! Hahahah","commenter_a":"At least the club is consenting adults! Not a priest on scared little boy! Protest that instead you concrete vagina bitches!","post_message":"A group of suburban nuns is suing a neighboring strip club for the second time. What their complaint is this time --> @webpagelink"},{"comment_id":"10152813313326523","commenter_b":"Glad everyone shared that video and got this no good nasty tramp bitch arrested!","commenter_a":"Black lives matter","post_message":"“It’s almost like they plan these fights, they want these fights to be on tape where they can put it on social media. This is horrible.”"},{"comment_id":"10154976880629614","commenter_b":"Ok","commenter_a":"The car man was driving was a stolen car ?","post_message":"El Monte police are heard firing multiple shots at a suspect tonight in a video provided by a witness.   One man was shot and injured after a slow speed pursuit. His current condition is unknown.   Read KTLA's story here: @webpagelink"},{"comment_id":"10154834976184885","commenter_b":"Laws change and some should including this one. At one time I could own a person and woman couldnt even vote 100 years ago. This flag represents the ultimate sacrifice made by millions of Americans including my family. I can guarantee that if I see it I will gladly go to prison to make sure they will never be able to burn another flag.","commenter_a":"It's OK to not pay your taxes, just don't burn the flag.","post_message":"The Supreme Court ruled in 1969 that burning the flag was protected by the First Amendment"},{"comment_id":"10153521099233010","commenter_b":"save your water for your illegal aliens...smfh","commenter_a":"Typical republican: \"entitled\".","post_message":"More than a dozen times, a white truck filled up at a Thousand Oaks hydrant and hauled the water to Selleck’s 60-acre ranch in Westlake Village -- court documents allege."},{"comment_id":"10152706974886717","commenter_b":"As an Australian, observing from afar, ALL your possible candidates are hypocrites and troubling. In a perfect world, Bernie Sanders would be President and the GOP and the Tea Party would have melted into oblivion. However, it's NOT a perfect world, and I'm a realist. Even the darling of the left, Elizabeth Warren, is an avid supporter of Israel, whilst allowing the continued persecution of the Palestinian people. Politics isn't about the best possible person: it's about the least worst. Hillary Clinton is the least worst by a country mile. We know where she stands. We know how she thinks. We know how she works. We know she's a fierce supporter of women's rights. We know she's learnt a lot of painful lessons from her time as first lady, Senator for NY, and as Secretary of State. I also believe that she's learnt from these mistakes to make herself a ...","commenter_a":"Doesn't mean she should be president. we need to stop being single issue voters and look at the whole picture.","post_message":""},{"comment_id":"10153318936789087","commenter_b":"He sure is blowing minds. LOL @webpagelink","commenter_a":"Cruz has no idea what he is talking about.","post_message":"“Why would you then bail out rich Wall Street banks and not Mom and Pop?” Ted Cruz  asked John Kasich as they sparred over bank bailouts at the #GOPdebate."}]
