[{"comment_id":"1077284305661431","commenter_b":"Hillary for POTUS! Hillary 2016! THE MOST QUALIFIED CANDIDATE! #imwithher","commenter_a":"You will never be our president, and I cannot wait to see what you do when the FBI files against you! I think your failing political career is dead!","post_message":"“To me, that’s the best of America and it keeps me going. That sense we are all in this together. We all have vital contributions to make. And that when come together, all of us, with a sense of shared purpose and shared humanity, we can solve any problem we face. We can heal any divide. We can build a future that is far, far better than our past.” –Hillary during her speech on breaking down barriers in the African American community"},{"comment_id":"1198334626915656","commenter_b":"Bitch","commenter_a":"@username u need this","post_message":"'Bout time."},{"comment_id":"1329355063770614","commenter_b":"And yet, billions of US tax dollars are given to foreign governments each year without the consent of tax payers. It's disgusting and so sad that we have Americans living like this and Obama and the entire Democratic party wants to bring hundreds of thousands more refugees into this country to live on the taxpayer dole! How stupid are we to keep putting these people into positions of power this way?!!","commenter_a":"There are many homeless in the Seattle area that live in tents because they don't want to have the restrictions that comes with living in a homeless shelter. Restrictions with when they come and go and what goes on there.","post_message":"OBAMA PUSHES AMERICANS INTO TENT CITIES.  Hillary will keep them there.  VIDEO  @webpagelink"},{"comment_id":"1647670705273781","commenter_b":"This dude is in trouble. He better start working for the people who elected him, or his ass is grass","commenter_a":"Government that works? Republicans are out to prove to us that government is bad by giving us spectacularly bad government.","post_message":"Jason Chaffetz's contentious town hall in deep-red Utah proves Americans care more about a government that works than partisan politics."},{"comment_id":"10152720000536051","commenter_b":"I've always been told a white woman will do things that will make a black woman puke they were right.","commenter_a":"Yuk!","post_message":"Officials took one look at this couple’s video and arrested them immediately."},{"comment_id":"831331320235298","commenter_b":"Go back to Italy ya wop","commenter_a":"Reveal his name.","post_message":"A soon-to-be police officer just posted this comment publicly to our page. Is this a thinly disguised threat of violence against citizens? Doesn't sound like this guy should be allowed to roam the streets with a loaded gun in the near future."},{"comment_id":"682882035184939","commenter_b":"Until the war against christians ends. All countries should carefully screen all imigrants. Period","commenter_a":"Yes absolutely!","post_message":"Our children's future is at stake! YOU DECIDE!"}]
