[{"comment_id":"10153644066921337","commenter_b":"Oooooh damn. That sucks man. That bitch took the easy way out. Piece of shit lunatic","commenter_a":"A piece of shit ....is a piece of shit. No need to bring up RACE.","post_message":"GUNMAN IDENTIFIED: Former WDBJ7 reporter Vester Flanagan is behind the horrific on-air shooting of two news team members."},{"comment_id":"1551736915123020","commenter_b":"Pssssh please.....ive worked in an immigration office and let me tell you. The GOVERNMENT is taking advantage of illegals and will NEVER get rid of them lmfao. People such as yourself must educate yourselves on the topic. In which, may i add, you know nothing about. Furthermore, illegals PAY taxes which INCLUDE medicare and social security. The government KNOWS that they are working under Americans social security numbers and even submit them ALONG with their real name and address to apply for an ITIN number. This allows them to PAY taxes even though they are in fact illegal. And guess what??? They will NEVER alert the American that their social is being used, these \"illegals\" will NEVER see a dime of social security benefits Nor will YOU!! And oh ya....they CANT apply for medicare / welfare either. And WHY would the government not tell you your social is being used?? ...","commenter_a":"The question is why are illegals getting benefits instead of being deported. No longer should illegals receive benefits from our tax dollars. I read earlier our social security funds have been used for illegals benefits. I for one sure didn't pay into social security so a non citizen could receive these benefits.","post_message":"\"The American taxpayers have reached a boiling point. We are tired of illegals taking American jobs. We are tired of illegals living off our tax dollars. We are tired of illegals causing mayhem in our streets,\" says Todd Starnes. Do you agree?"},{"comment_id":"10154784802599575","commenter_b":"arrest her before she flees the country!","commenter_a":"If she had any tact, or respect for the people who voted for her she would of made a speech last night.","post_message":"Hillary Clinton is expected to speak very soon from New York after losing the election to Donald Trump. We will live stream her concession speech on our Facebook page and in this post."},{"comment_id":"10153983597909726","commenter_b":"ugliest face on the planet,put the bitch in shackles","commenter_a":"It puts them under oath and on the record and if any take the 5th it'll hurt Hillary even more, especially with Independents and Undecideds.","post_message":"Hillary Clinton's aides will be questioned on emails by the U.S. State Department. Will this make any difference?"},{"comment_id":"1270891722952389","commenter_b":"@username says the woman whose profile pic says \" Make America Kind Again\"","commenter_a":"You know being born in this country is a requirement to be president.. There is no requirement to provide tax returns just in case you were wondering. If the dems win and Hillary is president you liberals better be ready to open your homes to refugees because they will be stuffing them into this country and fast as they can. The dems only care about one thing.. Power.. Staying in power and keeping others from having any including the citizens which is who should have the power. Take a look at what's happening in Europe right now it's not long before its happening here.. But the media won't report it because the dems will try to keep it from you. That's right the media is biased.. All media one way or the other.. So drink your flavor of koolaid and get ready because the liberals in this country are coming ...","post_message":"Great question, Mr. President. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153149176726636","commenter_b":"Shocking. She should be able to speak openly about her experiences with hardline muslims. Censorship at a students union is about as bad as it gets, but it does not surprise me given the 'right on' nature of some idealistic fools in the student world.","commenter_a":"And the pandering to the nasty ideology goes on, unfortunately!","post_message":"'They’re basically labelling me a racist'"},{"comment_id":"10153060673305329","commenter_b":"Sharon Needles bitch!","commenter_a":"Oh my gosh @username and Tavian Broderick you got to take this shit- i got Bianca","post_message":"Good luck, and DON'T f**k it up."}]
