[{"comment_id":"10152984157398598","commenter_b":"If she didn't want to get pregnant and ruin her career she should have kept her legs closed!! Selfish pos","commenter_a":"All u negative people will never understand...a baby can dampen your career...or just job if u have one...just think that if the mother is single...she will be out of work for six weeks...how do u pay rent..carnote..bills..ect..then when its time to go back to work how are u going to pay for daycare after being out of work..oh not to mention in todays society how many sick perverted people there are in the world and to know u may possibly give ur child up to one of those...SMH. shame on all of u who judge this woman....A REAL woman knows whats best for her and a child...and is certainly no ones place to judge...y dont all u negative people become a social worker and go find the real children who need help from a parent who decided to have them for their own sick pleasure! Thousands of children being born ...","post_message":"She Aborted Her Baby Twice and Both Abortions Failed, So She Aborted Her Baby Again"},{"comment_id":"10153082513017169","commenter_b":"Another sold out POS that wants another war. Shoot the c**ksucker.","commenter_a":"Poor outcomes across the board.","post_message":"What does Scott Walker believe? Where the candidate stands on 10 issues (From PBS NewsHour)"},{"comment_id":"916372545089161","commenter_b":"She is beautiful. But ugly women and men with little dicks see the opposite! :-)","commenter_a":"She is still pretty","post_message":"Where HAS Michelle Obama's hair gone?"},{"comment_id":"10153112075801051","commenter_b":"I love this chick!!","commenter_a":"Really? You guys are jerks. Don't like her or this post, keep scrolling.","post_message":"This mom was complimented on her \"perfect\" body recently. She appreciated it, but she also felt the need to show everyone the difference between what's real and what's in magazines."},{"comment_id":"10154083377471433","commenter_b":"Good keep your foreign diseases in your own countries","commenter_a":"Oh you mean the country that out right said ....\"Death to America\"??? WHO CARES!!!!","post_message":"BREAKING NEWS: Iran suggests it will limit issuing visas to American tourists in retaliation for President Donald Trump's ban on refugees from Muslim-majority countries."},{"comment_id":"10153960643118984","commenter_b":"Just take ur stinking ass and ir ugly ass women with u","commenter_a":"You all need to vote ... get rid of this crap ....","post_message":"I can't imagine what this woman must have felt when this Muslim cab driver did this... Do you support this judge's decision?"},{"comment_id":"10153674546377293","commenter_b":"Belief structure is the exact same thing. Splitting hairs to rationalize your views.","commenter_a":"They got a point. It's not a religion by definition, but it's a belief system. Praying affects the individual doing it; only those offended are the people that can't stand the sight of it. They hate, if you will. Equality means just that, though. Can't restrict one group only.","post_message":"“This is very scary,\" a parent wrote."}]
