[{"comment_id":"10157959432550354","commenter_b":"She belongs in prison. Trump for all Americans","commenter_a":"Poor behavior is poor behavior, no matter who does it! Teachers are now reporting a sharp rise in bullying and rude talking out and racist comments directed at other children after Trump began his campaign. If you are acting like an idiotic, alt-right Trump supporter at home, your children are seeing and hearing this and thinking this is how people should act. Stop it now! You are creating a whole new generation of haters.","post_message":"\"I believe they were paid to come attack Trump supporters.”"},{"comment_id":"10156594295450354","commenter_b":"She is a mental pig.","commenter_a":"Because you are a dog","post_message":"Feminism 2016 Style...  “It’s policy. Teddy Kennedy, remember Chappaquiddick?… I mean, a girl drowns and he abandons her, and [s]he drowned, and women still voted for Teddy Kennedy. Why? Because he voted for women’s rights. That’s why. That’s the bottom line of it in my opinion. I mean, I don’t like either one of them, to tell you the truth, Teddy or Bill. They’re both dogs, as far as I’m concerned. But I still will vote for Bill Clinton, because he votes in my favor.”"},{"comment_id":"1001780713207758","commenter_b":"Like we weren't already?","commenter_a":"So how many of his baby-mamas and illegitimate kids do we now have to support? Any more than usual?","post_message":"Protesters Said this Cop Shot an Unarmed Teen for No Reason. Here's the Video."},{"comment_id":"1165479466892468","commenter_b":"Bitch please","commenter_a":"@username HAHAHAHAHAHA","post_message":" #WSHH"},{"comment_id":"631371687022892","commenter_b":"What a chump","commenter_a":"Doesn't it make you wonder what Trump is holding over these guys?? I'm so dang curious but it will be years before it seeps out.","post_message":"\"After months of careful consideration, of prayer and searching my own conscience, I have decided that on Election Day, I will vote for the Republican nominee, Donald J. Trump.\""},{"comment_id":"1783100141966543","commenter_b":"We should build a wall at the California line and put all the liberals in it...","commenter_a":"Wutttt ?????","post_message":"Game of Thrones actress Sophie Turner (Sansa Stark) attacked Trump saying that if she could fix the world, she would kick him \"out of the country. And we’d create a wall around him so he couldn’t escape.”"},{"comment_id":"10153854482548854","commenter_b":"She's shrewish","commenter_a":"I do not know why? But I do not like Fiorina...She looked like a teacher who is lecturing a student. She sound defensive as if she is always under attack.","post_message":"Carly Fiorina Calls Out Clinton And Obama For Politicizing San Bernardino Shooting"}]
