[{"comment_id":"10152730591461545","commenter_b":"^^Is there some kind of cream for that you think? LOL","commenter_a":"Just because it's on paper doesn't mean it is acceptable to God. Period.","post_message":"Sarah Goodfriend and Suzanne Bryant became Texas' first same-sex couple to receive a marriage license this morning. This is them speaking at a press conference in Austin.  MORE: @webpagelink"},{"comment_id":"10153524909826130","commenter_b":"If Trump had his way Muslims wouldn't be aloud to return if they left the states either.","commenter_a":"Muslim terrorist kills Americans again and liberals continue to make excuses for Muslim terrorist. Over 3,000 killed on 9/11, more than at Pearl Harbor , Fort Hood Muslim terrorist killed many, Muslim Boston pressure cooker bomber mangled several, Muslim husband and wife kills several in Ca. Liberals seems to love Muslim terrorist. Muslim terrorist cuts heads off reporters and airs the videos, Muslim terrorist throws homosexuals off roof tops, Muslim terrorist drown people in a cage, Muslim terrorist burns people alive.","post_message":"Donald J. Trump says he doesn't know any Muslim athletes, but these photos say otherwise."},{"comment_id":"335857396538054","commenter_b":"There is no climate change that is your agenda","commenter_a":"Does this arrogant, smug, condescending community organizer and failed President REALLY want to compare resumes with the Donald? More evidence of how delusional he is and how stupid he thinks we all are.","post_message":"“I think foreign observers are troubled by some of the rhetoric that’s been taking place in these Republican primaries and Republican debates. I don’t think it’s restricted, by the way, to Mr. Trump.”  During a press conference earlier today, President Barack Obama slammed Donald J. Trump and other GOP presidential candidates while continuing to tout climate change. @webpagelink"},{"comment_id":"10157445323790093","commenter_b":"Because they wanna control things...U know the hands on your mind effect","commenter_a":"REMEMBER THE REPUBLICANS WARN US ABOUT AFFORDABLE HEALTH PLAN.","post_message":"Thanks Obamacare."},{"comment_id":"10153016776944117","commenter_b":"Cause she was terrible. @webpagelink","commenter_a":"Because they are willing to sell out.","post_message":"From RUSH drummer Neal Peart to Rep. Paul Ryan to Uber CEO Travis Kalanick. Why do famous people deny that they admire Ayn Rand?"},{"comment_id":"1275227535851049","commenter_b":"she can go back to sleeping with cruz! lol","commenter_a":"When he loses, I hope this woman just disappears into obscurity, and gets to feel what it's like to be left behind by Trump. She's an ignorant tool.","post_message":"She had a meltdown after the host repeated Trump’s words verbatim."},{"comment_id":"10152882681411028","commenter_b":"Man ..... She Can Eat LOL","commenter_a":"I just are a bagel this morning and had a great cupe of Coffey.","post_message":"Molly Schuyler ate three 72-ounce steaks, three baked potatoes, three shrimp cocktails, three salads and three rolls in way less time than it'd take for someone to cook all that food at home.  And the reason she turned down a fourth steak? She was sick of the taste -- not full. @webpagelink"}]
