[{"comment_id":"892853017418706","commenter_b":"This my friends is a true leader","commenter_a":"We'll never see Obama supporting our wounded Vets like Bush. Bush was a true patriot","post_message":"George W. Bush said the ride will highlight the 'bravery' of America's veterans:  'It’s a ride to herald people who were dealt a severe blow and said, ‘I’m not going to let it tear me down.’”"},{"comment_id":"10152932852611378","commenter_b":"Give her a better intersection ! I'll take the intersection. ! This intersection should be for a young person , a person that's quick on their feet! Firing her doesn't solve nothing ! Crazy intersection","commenter_a":"Her attitude is disgusting; it's like I'm entitled to get paid just for showing up!","post_message":"A lot of people were talking about this 6abc Action News HIDDEN CAMERA Investigation before it even aired! Now here's the whole story. A crossing guard, who is paid to walk kids across a busy intersection, stood by as groups of children bolted across traffic, but she didn't help walk them across to safety. Plus, hear this public servant's interesting response, when we ask why she isn't doing her job to keep students safe!"},{"comment_id":"1817386261807116","commenter_b":"I agree! She is pure evil!!","commenter_a":"Totally agree with Newt Gingrich! She has no scruples! She belongs in prison! Cannot stand this heartless woman! She just won't disappear!","post_message":"Newt Gingrich says Hillary Clinton is without a doubt one of the most corrupt politicians in American history. Do you agree or disagree?"},{"comment_id":"10153537278823984","commenter_b":"Women in that cult are beaten and stoned and daughters married off at nine. Honor this way of life????","commenter_a":"Emperor PINOCCHIO is trying to make his MUSLIM brothers happy!","post_message":"News of this has been met with sharp criticism by many.   Do you believe the military is enforcing policies hypocritically?"},{"comment_id":"1165741570143303","commenter_b":"Why so serious... The whole world just needs to lighten up.. even if it's for 5 minutes.. colour is talked about so much it's actually part of the problem now.. just let it be...","commenter_a":"How the hell is this pic racist!!","post_message":"Opinion is divided ... (via BBC Trending)"},{"comment_id":"1614898715485754","commenter_b":"No need to worry, Just Drink a Coffee ☕","commenter_a":"Brad Sherman","post_message":"Two days ago, an enormous asteroid flew past Earth. It was half as close as the moon. And we barely saw it coming."},{"comment_id":"1044864242277400","commenter_b":"'@username Of course you haven't ever heard a group of 59 year old women bragging about 'popping a Tic-Tac' so they could forcibly kiss a handsome man. And never have I heard this same age group say, 'grab'em by the d*ck', nope, it doesn't happen...","commenter_a":"I am still trying to figure out how this man became a surgeon. Are you sure that his license and everything or legit cuz he is a total nut","post_message":"Ridiculous!  Video by Occupy Democrats, LIKE our page for more!"}]
