[{"comment_id":"466981083492472","commenter_b":"Fuck them get out if our country Fucking terrorists","commenter_a":"No,","post_message":"Should Christianity Be Banned To Please Muslims?  Comment 'yes' or 'no'."},{"comment_id":"1699015597030344","commenter_b":"A no vote IS a vote - for the candidate you least want.","commenter_a":"Adding or not adding the next Scalia to the Court seems like something that will have pretty wide implications for the next couple decades.","post_message":"'I'm not interested anymore. I don't see any immediate, significant changes happening. I don't see voting as a means to an end.'"},{"comment_id":"10153551321648984","commenter_b":"A coal burning slut","commenter_a":"Kardashian is nothing more than a SLUT! Don't watch anything to do with her, PERIOD!","post_message":"Look out, Kim Kardashian. I don't think you realize who you're messing with...  Do you side with Megyn Kelly on this one?"},{"comment_id":"383422335172981","commenter_b":"There are laws and then there is right and wrong. When you factor out people from the laws, you create an inequity that needs to be handled as Solomon did --- One case at a time. Many years of productive residency DOES erase the fruit of the poisoned tree --- that she came here against a statuary law. Laws were made to cope with inequity. We have immigration laws because we feared overpopulation by the poorest people in the world who would want to come to the 'land of opportunity.' But, when someone comes and contributes to our fabric, we need to weigh that against a rule made to prevent, in her case, something that doesn't exist.","commenter_a":"The first step in holding conservative views on immigration is that they can't view anyone who might be affected by bad immigration policy as fully human. That's the problem. They've successfully dehumanized Hispanic people so they simply don't care.","post_message":"Now she has the opportunity to apply to stay here legally."},{"comment_id":"10154586781928598","commenter_b":"Good for them, proud of you both, goes to show you how much they really respect themselves","commenter_a":"Blessings for your marriage!!","post_message":"#6 most-read LifeNews story of 2016: After Abstaining Until Marriage, NFL Star Russell Wilson and Ciara Get Married: “We Did It Jesus’ Way”"},{"comment_id":"10152918122661336","commenter_b":"we cant have a female for president ever, do u know wtf is gonna happen when they hit there monthly period, there gonna be droppping bombs everywhere for no reason","commenter_a":"Omg pls no","post_message":"Former Alaska Gov. Sarah Palin says she is 'seriously interested' in running for president in 2016."},{"comment_id":"10153656979036130","commenter_b":"I go, 'You know I had pulled a gun on a white girl...' She goes, 'I knooooow!' She got her white privilege isn't real wake up call! You know white girls LOVE to call the cops. When the cop didn't do anything and believed the guy she lost it! Long ass Facebook post! Lmao!","commenter_a":"You never hear Asian, Hispanic, African American, or any other race of men crying over the second amendment. One group only.","post_message":"The legislation mostly targets specific kinds of semi-automatic firearms -- such as AR-15s and AK-47s -- and large-capacity magazines, and adds certain registration and licensing requirements."}]
