[{"comment_id":"10152960734572014","commenter_b":"They need to leave them alone! Stay out of our business in az this is our state Feds!!!","commenter_a":"These horses must be left alone! They cause zero harm, and countless amounts of pleasure to all who see them! Using the logic of \"public safety\" then why haven't all the bears in our National Parks been removed???? I had an uncle when I was very young who worked for the Forest Service. I'm sure this would shocked by this action.","post_message":"Arizona Governor Doug Ducey has voiced his support for leaving the wild horses where they are."},{"comment_id":"10154285827248701","commenter_b":"Trump build that wall!","commenter_a":"Trump will take care of these ghetto rats . They will be leaving the ghettos to find work so they can eat. Instead of waiting for his kids mothers welfare check .","post_message":"He is the second officer to go on trial for the killing of 25-year-old Gray, who died one week after suffering spinal injuries in a police van last year."},{"comment_id":"10154350204712994","commenter_b":"Have mercy. We need the capital punishment you kill you should be killed","commenter_a":"Carl. , I feel the same way .","post_message":"She was with a friend, and they got in an argument with some people at a liquor store. They left -- but the group followed them for a few blocks and then started shooting."},{"comment_id":"501298436725116","commenter_b":"Need more Americans like him . Hope he can beat all the charges . Muslims need to go back home !","commenter_a":"Not a hate crime","post_message":"A lesson he'll NEVER forget..."},{"comment_id":"1874033892840716","commenter_b":"REALLY,Jim !#!#!!!","commenter_a":"We are concerned about you Al and the other nuts who wouldn't recognize the great things Trump will n is doing for the USA. Pray God continue blessing Trump doing good work for us.","post_message":"\"We all have this suspicion that — he lies a lot. He says thing that aren't true.\""},{"comment_id":"1615889428471180","commenter_b":"That'll put some die in her ass","commenter_a":"Oh,stfu. Take your crybaby ass to your favorite proctologylist and get a soothing ointment to rub on your buthurt","post_message":"This young woman was deeply offended by a sweater Target is selling. Should Target keep selling it anyway?"},{"comment_id":"10155070129079445","commenter_b":"Massachusettes as a state is no kill. They'd only euthanize if the dog was extremely sick or aggressive.","commenter_a":"I dunno with all these people saying take the dog to a shelter... Shelters euthanize dogs... I'd be afraid to leave one there. Maybe they thought this would be better it certainly got media attention.","post_message":"The pooch was found on the side of the road... but had food, clothing and blankets with him. @webpagelink"}]
