[{"comment_id":"10154317818991336","commenter_b":"F*** Donald Trump's daughter she a hoe and she look like sid from the ice age BOIIIIIIIIIIIIIIIIII","commenter_a":"The one Trump said he'd sleep with if she wasn't his daughter . What a sick disgusting man","post_message":"Ivanka Trump is a natural!"},{"comment_id":"10156660915665354","commenter_b":"The woman should thank Ms Palin for keeping her employed. If she didn't resemble Sarah she wouldn't be working. Since there isn't much talent there.","commenter_a":"Sure, Sarah made Tina famous and rich. But Tina helped do the same for Sarah. I believe Sarah is laughing all the way to the bank....just as much as Tina is. Sarah did look a bit disjointed at the endorsement and Tina jumped on the opportunity to mock her. But Tina....sorry. You failed miserably. Didn't laugh at all. SNL is just sad. Don't watch any longer. The constant right bashing is boring and predictable.","post_message":"You saw this, right?"},{"comment_id":"559309340924025","commenter_b":"Get her fellow","commenter_a":"Lying is her number one forte","post_message":"SHARE to STAND with this NAVY SEAL!"},{"comment_id":"1194670093899735","commenter_b":"Hillary? Really the woman should be in prison.","commenter_a":"The judge is a son of illegal immigrant. @username do your freaking job investigate this judge. I gurantee you he's Hillary Clinton's supporter.","post_message":"U.S. District Judge Gonzalo Curiel in San Diego called for the documents to be released."},{"comment_id":"746525202204724","commenter_b":"how stupid is she in the first place.","commenter_a":"Yes","post_message":"Clinton's Panic After Mistress Does THIS In Public [VIDEO] They never ever wanted this to happen. Do you think Hillary will lose?"},{"comment_id":"1007076626015699","commenter_b":"Yes they need to hire them back and get rid of the illegals that took there place ...what needs to be done is the illegals need to be shipped out of this country we don't need them not do we want them","commenter_a":"they need to hire them back","post_message":"Trump also criticized Marco Rubio for sponsoring the \"I-Squared\" bill that would TRIPLE the number of H-1B foreign visa holders in the U.S."},{"comment_id":"760141017451798","commenter_b":"he also spoke at her rallies against Obama Care!! he should be thrown out for being publicly biased BC he knows he had to make decisions on it so it is illegal for him to do that!! his teaturd wife is insane too!!! apparently if your rich, you are above the law! time for a big change here!!!","commenter_a":"And what about Thomas \"inadvertently\" forgetting to report 1.6 million in income his wife earned lobbying and speaking against healthcare? How is he still on the Supreme Court?","post_message":"Very interesting."}]
