[{"comment_id":"10153495487996770","commenter_b":"It's never a joke untill they come for you, then you want to cry, I'm just joking. So is that prison cell dumbass.","commenter_a":"This is just another instance, where Obama should be stepping up to this kind of talk!","post_message":"A #BLM sympathizer posted \"Death to all White Cops\" on Facebook but was completely unprepared for what immediately happened next. Then she did something even dumber!"},{"comment_id":"10153231031836051","commenter_b":"Yes, Hillary should have lost her security clearance a long time ago when they first discovered she had breached security with her emails...she should also lose her freedom...she belongs in jail for her crimes. And she will get out lucky if we don't ask for her life as well.","commenter_a":"Hell yess","post_message":"Do you agree or disagree with these intelligence officials?"},{"comment_id":"10152999257859342","commenter_b":"I dont think its the color of our skin or were and how we ALL got here. But you do see more black people on the news for killing and stealing than any other race . Hispanics are usually the drunk drivers causing accidents, and whites usually go killing their own kids or parents!!","commenter_a":"It's always the black ppl fault.... Mexican are in the same boat but I see some on here don't see it that way. @username you black and don't know it.... Lol","post_message":"A man pulled a gun while stealing a TV at a Spring Walmart store this morning, authorities say."},{"comment_id":"477777845756672","commenter_b":"Bull Crap, Hillary.","commenter_a":"Please take a good look at Chicago !!!","post_message":"Hillary Clinton's answer to crime is always to just crack down on law-abiding gun owners - not law breakers. But the American public is seeing through her gun control lies for what they really are: meaningless rhetoric."},{"comment_id":"1891157881114099","commenter_b":"that's something you would need to record lol","commenter_a":"@username this would be something you would do lol","post_message":"Now that's a f.d up prank. #WSHH"},{"comment_id":"10152783223285667","commenter_b":"I wondered what happened to the bikes. Bike sale soon????","commenter_a":"Yes and they have confiscated over 150 bikes..Bikers are pissed off","post_message":"Some of the dead and wounded may have been shot by officers responding to the bedlam, a Waco police spokesman said."},{"comment_id":"1170528036314405","commenter_b":"She knows she can't do it. She has to bring her husband in to do it for her. I guess we are not ready for a woman President.","commenter_a":"Hillary says she will appoint Bill to run the economy. We've seen the Clintons in action together before in the Whiter House. We call that getting two crooks for the price of one.","post_message":"The Clinton Foundation's business relationship with 20 foreign governments raises real questions about her judgment. Simply put, Crooked Hillary is in no position to be President of the United States of America."}]
