[{"comment_id":"10153608158096336","commenter_b":"Takes all kinds of a--holes to make up this world and he/she is certainly the biggest one!!!","commenter_a":"Why is this getting news? It's not mandatory to tip. If you don't get good service you don't tip. Shut up, stop whining and do right by the next customer.","post_message":"A Rutgers University student who is waiting tables at a Jersey Shore restaurant this summer to help put herself through school was given no tip on a $112.03 bill and instead a taunting message."},{"comment_id":"1134738373236015","commenter_b":"Actually female secretions do have some nutritional value. And ok, and maybe you should suck some more dick.","commenter_a":"Ha! Says a study funded by the patriarchy and trying to get women to scientifically be cool with swallowing men's Semen. If you're gonna be anti media, don't be pro patriarchy. It's all a part of the same machine. It's all part of the same manipulation. Fuck the patriarchy.","post_message":"And now you know..."},{"comment_id":"10154130033413797","commenter_b":"so she should keep her legs together","commenter_a":"you have a brain tumor and you are suing bc you want your tubes. out.. are you sure you are just not brain dead?","post_message":"A woman suffering from a brain tumor is threatening legal action against a Catholic health system because the hospital is allegedly refusing to tie her fallopian tubes based on religious belief. The procedure could be life saving for the woman..."},{"comment_id":"600616960147229","commenter_b":"@username It was $200,000; and I cannot stand that vile woman.","commenter_a":"This man is broke. He is a fraud.he knows if he loses he will go bankrupt. He cant even carry a sentence. His wife is an ex escort, and hes on his third marriage.","post_message":"WATCH #LIVE: Donald Trump speaks at Polish-American Alliance in #Chicago."},{"comment_id":"10152892067227144","commenter_b":"Far more competent and capable than anyone out there on either side!","commenter_a":"If she is the best we dems can do, we are in bad shape.","post_message":"The time has come."},{"comment_id":"10155119419651320","commenter_b":"Looks pumping","commenter_a":"THE ISSUE IS NOOOOTTTTT MUSLIM!!!!!","post_message":"Democrats hold an anti-Trump protest in Washington D.C."},{"comment_id":"10153361867349726","commenter_b":"He has no womb case closed Obummer has no morals or common sense","commenter_a":"The country is damn near in chaos and he takes the time to talk about this BS...","post_message":"WATCH: Obama: Caitlyn Jenner Showed 'Tremendous Courage'"}]
