[{"comment_id":"1227897690610317","commenter_b":"She racis af","commenter_a":"Line your Ass up and get on the Trump 🚌 bus get your no 🚿 showering Ass out the U.S. take your stank mama with you.💩💩💩💩💩💩😄","post_message":"He went in with no shame!  #WSHH"},{"comment_id":"1701440090108890","commenter_b":"They jeer at Cruz. Call him \"politician.\" What they surely remember is the way Cruz sucked up to Trump in the early part of the campaign. \"Lyin' Ted\" sticks because Cruz seems two-faced.","commenter_a":"All Cruz did was bash Trump. What a looser.","post_message":"\"He's gonna put a liberal on the Supreme Court. He's going to take away your Second Amendment rights. This man is lying to you and he's taking advantage of you.\" -- Ted Cruz to Donald J. Trump supporters in Indiana today"},{"comment_id":"1050627531700165","commenter_b":"Go Hillary!","commenter_a":"I don't think Republicans even talk a good game. Nothing but LIES and the people who vote for them are too stupid to see it.","post_message":"\"We cannot – and I will not – put our vets at the mercy of private insurance companies without any care coordination or leave them to fend for themselves with healthcare providers who have no expertise in the unique challenges that are facing our veterans.\"   --Hillary Clinton"},{"comment_id":"10154160437056943","commenter_b":"Of course she did !","commenter_a":"Yes","post_message":"Share if you agree!"},{"comment_id":"10153630257512235","commenter_b":"She's a dumb bitch.","commenter_a":"Aaaaaaaaaaaaaaaaaaaand let the Martyring begin! Yea totally did not see that one coming..nope, wow I am so surprised! *rolls eyes*","post_message":"Oh, c'mon ..."},{"comment_id":"1114298202002104","commenter_b":"What do you mean? It's a horrible thing to say. But we have freedom of speech in this country. Her speech is protected by the constitution. She shouldn't get fired for it.","commenter_a":"So its only freedom of speech if it's against Republicans? If the Democrats played on a level field they would get destroyed even more!","post_message":"The director of a nonprofit agency who called Michelle Obama \"an ape in heels\" has been fired."},{"comment_id":"1172821626098535","commenter_b":"She needed to be shut down 20 years ago!!!!","commenter_a":"What kind of a statement would you expect from somebody as stupid as she is. Her brain is lacking in intelligence","post_message":"Whoopi Goldberg got shut down."}]
