[{"comment_id":"10153429543136491","commenter_b":"Not that it matters. A white woman would probably been cast anyway.","commenter_a":"WHY?! Are there no LATIN/HISPANIC actresses that can fill this role?","post_message":"Jennifer Lawrence will soon add another splashy biopic to her resume."},{"comment_id":"367721800082095","commenter_b":"Lol \"rape culture\" sweetie go live in the Congo where the war lords use rape as a tool and come back and tell me this label is \"rape culture\" rape is a serious and horrible crime that doesn't need to be trivialized with your suburban feminist mindset.","commenter_a":"Rape culture nonsense again. The world gone mad. Get a life feminists. A slogan on the beer isnt going to encourage rape for fuck sake.","post_message":"\"The perfect beer for removing 'no' from your vocabulary for the night.\"   What?!?!"},{"comment_id":"10153926157556337","commenter_b":"Ronda is the only person to go and ask patricks wife for permission to do the role and movie.","commenter_a":"Companies are trying to cash in on Patrick Swayze's death.. Since his Death they've remade Red Dawn Point Break And now they are remaking Dirty Dancing. I'm sure a Road House remake will be coming soon..","post_message":"SHOULD YOU SEE the Point Break remake?  Only if you like to have fun..."},{"comment_id":"10154623133343812","commenter_b":"maybe you cheat a wife","commenter_a":"Bill stated how wonderful a wife Hillary is...question...why did you have all those affairs then Bill???","post_message":"JUST IN: Tim Kaine officially wins the Democratic vice presidential nomination. @webpagelink"},{"comment_id":"682877985236113","commenter_b":"Carrie is a rich beeeatch!","commenter_a":"Liberals need to keep their views to themselves....Carrie, is a sweet mother and wife, and can teach her son what she wants to teach him, regardless what others might say: Because, He is HER child not the Liberal idiots, out there...!!!!!!","post_message":"Liberals are going after Carrie Underwood for her faith, she needs your support.  She is a true Christian. Let's get her back.  Can we get 85,000 'LIKES' for Carrie Underwood's faith?"},{"comment_id":"10153001992671770","commenter_b":"discusting","commenter_a":"Who cares ?? I DO NOT CARE !!","post_message":"Lather, rinse, repeat. Kim Kardashian's posting cleavage shots again."},{"comment_id":"1035959943168617","commenter_b":"@username Trumper Humpers have elected her through their ignorance.","commenter_a":"We will never forget scum like u Vote TRUMP","post_message":"Did Obamacare deliver lower premiums & more choices? No. Our office has done the research. Read our full report here: @webpagelink"}]
