[{"comment_id":"976609702473803","commenter_b":"Most black people i know WANT self segregation. They want a unified black country within the country and that is completely ok. White people make up 70 percent of this country so by proxy their is going to be areas without minorites. That's completely ok too. What we need to admit is that as a main rule forced integration doesn't work. In areas which are more racially undiverse there are fewer racially based crimes. It doesnt mean we all can't be friends it means we aren't all the same culture. And that is fine!","commenter_a":"what's the points of hate we all go to die one day, so enjoy the trip we call LIFE","post_message":"Top 10 Most Segregated Cities in the US"},{"comment_id":"1267539270005791","commenter_b":"@username , is it all intelligent, competent and strong women that intimidate you, or just Hillary? Hillary 2016","commenter_a":"He can only intimidate weak people... She's the exact opposite of that! #VoteBlue","post_message":"BOOM."},{"comment_id":"10153617049593984","commenter_b":"Hillary's a woman chaser to.","commenter_a":"Bill has Always been a Woman chaser... Hillary Must been doing something Wrong... Or she's to busy Scamming People out of their Money.....","post_message":"This woman has struck fear into the hearts of the Clintons for a long time. Now she may have just landed a knockout blow on Hillary... This could be what takes Hillary down. Do your part to make sure that happens by spreading this article to your friends and family."},{"comment_id":"497839773741528","commenter_b":"SO TIRED OF THE MUSLIM'S THINKING THEY CAN TELL US HOW TO LIVE IN OUR COUNTRY,,,,,,,THIS IS AMERICA NOT THE MIDDLE EAST......LEAVE AND TAKE YOUR MUSLIM BROTHER OBAMA WITH YOU...........","commenter_a":"@webpagelink I am a proud American, but this is a false story that is meant to instill false patriotism, and sadly by these comments it has worked.","post_message":"Muslim picks fight with patriotic cashier, and then this happened. If you don't like our country's flag, you don't have to live here. Can we get 35,000 'LIKES' for this patriot?"},{"comment_id":"1421316697902078","commenter_b":"Then go away Monica!","commenter_a":"I think both ladies look great. Love the pink dress and wish I had the shape to wear the red one.","post_message":"LIVE VIDEO: Watch as various entertainers perform at the Inaugural Ball before the arrival of President Donald Trump. @webpagelink"},{"comment_id":"10153141733752293","commenter_b":"I think you all forget that even if abortion was illegal, it would still happen. Illegal abortions were horrible, many women died. And if you think that only poor women had them or only uneducated women had them, you are badly mistaken. They happened in every economic group. Abortion needs to be legal, safe and rare!!!","commenter_a":"Yay for more fake videos. Planned Parenthood is a great organization. These people trying to create fake and misleading videos are the real enemy.","post_message":"In the video, the group discusses a potential contract for fetal parts."},{"comment_id":"10153043180073984","commenter_b":"Finally someone with a backbone. Why is the rest of the media supporting this evil by not showing the world their true nature?","commenter_a":"Close this guy and his mosque DOWN...","post_message":"Wow, what this guy tells Hannity about the awful Paris terror attack - how he defends the killers' actions...well, see for yourself.. Do you believe radical Islam is the enemy of civilization?"}]
