[{"comment_id":"10154566967589369","commenter_b":"She should have got the 11 yrs!","commenter_a":"5 years? That's it? Someone please give her real sentence when she gets to prison.","post_message":"Lethal doses of heroin and fentanyl were found in the body of 14-month-old Annabella Sagstetter last May."},{"comment_id":"559222970918198","commenter_b":"#WomenForTrump","commenter_a":"Wow, I worked for two presidential campaigns, also as a journalist covering campaigns and in the White House. If I had a dollar for every time I was pushed, grabbed or shoved. Campaign events are feeding frenzies, if you're a reporter covering a campaign event and you don't get pushed around a lot, literally, then you're not cut out for the job. It's par for the course! Thousands of people show up at campaign events and everyone is pushing and shoving to get a piece of the candidate and their staff has a duty to protect the candidate. I was in the White House in the Oval Office with the press pool one time and an aide or SS agent pushed me after I got too close to then Vice President Dick Cheney. It never even crossed my mind to file assault charges. If you watch the video, you can ...","post_message":"\"The culture of this campaign is – as Mr. Trump mentioned from the very beginning – it's not politically correct, and sometimes telling the truth inherently is belligerent.\" Trump campaign spokesperson Katrina Pierson defended campaign manager Corey Lewandowski, saying the incident \"is a '#NeverTrump' idea.\""},{"comment_id":"10153200218821636","commenter_b":"Not even a single Scottish one who wrote this article....","commenter_a":"@username waaaay yours didn't get a mention","post_message":"Warning: reading this will make you hungry"},{"comment_id":"10155333457725354","commenter_b":"Besides all this...Clinton looks like she needs a facelift! She definitely has not aged well. With all the worries she's had I can see why she looks like this...","commenter_a":"No integrity","post_message":"MELTDOWN: Hillary's Disastrous Press Conference..."},{"comment_id":"10153534802752217","commenter_b":"It's knowledge obviously. Go look up the definition of Asylum if you are that uneducated @username","commenter_a":"They are all migrants, NOT refugees if they didn't claim asylum in Greece or Turkey for that matter. Your reporter needs educating.","post_message":"More than 11,000 refugees and migrants are camped on the Greek side."},{"comment_id":"10154403443803338","commenter_b":"Stupid bitch , be serious","commenter_a":"Let me guess....they were ALL shot by white police officers.....","post_message":"Eight kids under age 10 shot in past 28 days, according to CPD."},{"comment_id":"10153210442256336","commenter_b":"Good!! Put that b!tch in jail....","commenter_a":"Were they on Hillary Clinton's server?","post_message":"A Treasury Department watchdog has recovered roughly 6,400 emails from Lois Lerner and turned them over to Congress – reviving the investigation into the IRS targeting of conservative groups."}]
