[{"comment_id":"10154138263431323","commenter_b":"It's about what you want to do. Maybe a younger person follows what is 'the done thing' but with age and life experience, I think women just do what they want!","commenter_a":"It's just like the shaved pubes issue - all the same arguments. 'I do it for myself' etc etc. Look, virtually no young women shaved their pubes before porn videos made men expect it. And virtually no older women dyed their hair before looking our age became unacceptable. I've had enough of all this 'I do it for me' nonsense - look a bit deeper for god's sake and let's be a bit more honest about our motives and the forces that drive us.","post_message":"“We’ve been groomed – by the media, by advertisers, and now by ourselves – to understand that our gender has to try harder, to consume more, when it comes to our appearance. We’ve been taught to fear growing old.”"},{"comment_id":"891950114161178","commenter_b":"That's her claim to fame, now and forever! Smh!","commenter_a":"Uh...that's a lie because I had never heard of her prior to the tape shenanigans! !!","post_message":"Kim Kardashian Says Her Biggest Regret Is Sex Tape With Ray J, But Shuts Down Claims That It Made Her Famous @webpagelink"},{"comment_id":"384727298550424","commenter_b":"So twisted. Islam has been illegal here since 1952","commenter_a":"Not my pOtus not my kkk","post_message":"LIVE VIDEO: 'Not My Presidents Day' anti-Donald J. Trump protests are happening across the country.  WARNING: Viewer discretion is advised"},{"comment_id":"10153835568288128","commenter_b":"@username what have china done unto the hongkongers?","commenter_a":"Really disgusting actions by these locals. Edit: Not saying I don't understand why this is being done, but a better way to express their discontent than this is still something to be desired for.","post_message":"Fans defied warnings from the Hong Kong Football Association against booing the Chinese national anthem at Tuesday night’s match."},{"comment_id":"10155050570035329","commenter_b":"I'm the biggest pussy out","commenter_a":"@username you have to read these!! Ouch","post_message":"Exposed nerves, unexpected orgasms, and a whole lot of blood."},{"comment_id":"10153641389062994","commenter_b":"I still don't understand all the female supporters on here. He hates you.","commenter_a":"He did a great job!!!","post_message":"Donald J. Trump is in Birch Run and will take the stage in just moments. Watch what the GOP contender has to say about Michigan, this country, his campaign, and who knows what else."},{"comment_id":"10153307893053352","commenter_b":"They both should quit. There should be a black woman on the panel discussion.","commenter_a":"Kelly your the best always classy","post_message":"Kelly Osbourne Threatens to Quit ‘Fashion Police’ Over Rancic’s Racist Remark on Friend Zendaya"}]
