[{"comment_id":"941382172583454","commenter_b":"Done","commenter_a":"Hey everyone! This is great, and welcome news for the campaign. I wanted to point out that there's another organization we can influence with our votes: Democracy for America is a MAJOR progressive group and they're putting their endorsement up to a vote like a real democracy. All you need to do is put your Name, Email, and Zip Code and once you press enter, go to your email to confirm your vote. It's that easy. Bernie can easily win this endorsement! Spread this message! Voting ends 15 December! @webpagelink","post_message":"\"Bernie has devoted his career to helping working families and is gratified by the support of the Working Families Party. Together they will work to take on the billionaire class and change the the rigged economy that is being held up by a corrupt political system.\" - Jeff Weaver, Campaign Manager"},{"comment_id":"10154442761894094","commenter_b":"Hopefully the other morons follow his wise protesting technique on Friday. Idiot.","commenter_a":"cool..or should i say hot...lol","post_message":"Two days before the inauguration, one man has started his crusade against President-elect Donald Trump, and it nearly cost him his life."},{"comment_id":"10153415680402293","commenter_b":"How about we stop immigration all together, butt out of everywhere and take care of our own problems!","commenter_a":"He wants to ban Muslims from entering the USA but why he doesnt ban the US from stealing Muslim's oil and lands","post_message":"“How can a country that always talks about human rights and freedom do this or even consider this?”"},{"comment_id":"10153180250311051","commenter_b":"Bitch","commenter_a":"matt bac she couldnt control her husband, the whole usa wtf","post_message":"Here's what Hillary Clinton had to say about her State Department e-mail scandal. Simple question: Do you think she'll be the next President of the United States?"},{"comment_id":"10153903187059218","commenter_b":"Criminals don't need a registration.","commenter_a":"California has registrations, tests, waiting periods, magazine limits and \"Assault Weapons\" ban how is this possible?","post_message":"Police confirm fatalities in the shootings at a San Bernardino, California, social services center. Follow updates on 11 News at 5:00 and online here >> @webpagelink"},{"comment_id":"510871105704596","commenter_b":"great man spreading peace, love, and equality.","commenter_a":"Evil wolf in sheeps clothing","post_message":"What are your thoughts on Pope Francis?"},{"comment_id":"1766381716934834","commenter_b":"How many drunk, stoned, high on drugs?","commenter_a":"If YOU DONT LIKE THE DECISION THEN GET THE HELL OUT OF AMERICA!!!!!","post_message":"Trump protest continues in Portland. Story: @webpagelink"}]
