[{"comment_id":"1115675945183452","commenter_b":"Your the one that is shaming Donald @username, you have found him guilty in public opinion.","commenter_a":"I don't believe her! She said it went on for 15mims, could have done something to stop it in that amount of time, and in a plane at that.","post_message":"Jessica Leeds said Donald J. Trump kissed her \"wherever he could find a landing spot\"  @webpagelink"},{"comment_id":"10154641793644614","commenter_b":"She's a freaking pig!","commenter_a":"Hope she rots in hell!","post_message":"The mother of Victoria Martens, the 10-year-old girl who police say was drugged, raped and killed, had allegedly used an online dating website to arrange for men to sexually assault her daughter in the past, according to a search warrant.   After her daughter was brutally killed, Martens told police that she watched her boyfriend, Fabian Gonzales, assault the little girl \"for sexual gratification,\" according to the criminal complaint.  (Warning: The below story contains graphic and disturbing content)"},{"comment_id":"1267659423273512","commenter_b":"JUST SHOOT THIS BITCH==PLEASE.","commenter_a":"SOMETHING TO THINK ABOUT -- do you know that Hillary will be bringing into the USA thousand of Refugees and Illegals just within the first year. ISIS has told the US that they will be sending in ISIS men and Rascal Islamic's in with them. Do you want to keep your family safe from the Radical Islamic's and the Illegals along with the threat of Sharia Law . Also the threats that the BLM has made to all Americans and Hillary is behind them also. Then you need to put your family first and vote for TRUMP . Because if you vote for Hillary you might just as well kiss your ass and the USA goodbye. We need to take our Country back Hillary has already proven that she is trying to destroy us. Don't forget our men in Benghazi and all the Email scandal and the Clinton Foundation . ...","post_message":"It's even WORSE than you thought!! @webpagelink"},{"comment_id":"10153717565963812","commenter_b":"Your stupid azz obviously don't have kids... More in like you don't need them you ignorant jerk","commenter_a":"Still a criminal","post_message":"Man accused of robbing a credit union told police he needed the money to help pay for his 1-year-old daughter's chemotherapy treatments. \"I guess it was desperation.\""},{"comment_id":"10156058811190594","commenter_b":"Well maybe he tried to grab on one of their chicks or tried to take some out of pocket cheap swing prior to the film rolling. What does your sister's job have to do with the surrounding facts?","commenter_a":"I'd like to know the surrounding circumstances before passing judgment. Who knows maybe the Vikings fan said or did something to provoke the attack.","post_message":"Brutal fan brawl horrifies onlookers after 49ers game"},{"comment_id":"1168807776489304","commenter_b":"Mexico has a closed southern border. I'm sick of all those Mexican bigots! I love their food though.","commenter_a":"They learned it from their Parents. They're in middle school, they learned this hatred and bigotry long before Trump. The floodgates are just opening more now. 😑","post_message":"Middle school students in suburban Detroit chanted \"build the wall\" during lunch on Wednesday, hours after Donald J. Trump became president-elect, according to school officials."},{"comment_id":"10154427590982577","commenter_b":"Shes just a lil woman thang. Ughk. Hillary should be in prison.","commenter_a":"Isn't it funny how she plays dumb to this stuff too? On her 60 minute interview she said she had no knowledge of these emails even though it's all over the news. She plays dumb to every scandal and people still blindly follow this idiot","post_message":"Wikileaks Crashes The DNC   The Clinton campaign is pointing its crooked finger at the Russians as the culprits responsible for hacking the emails of the Democratic National Committee going all the way back to last summer. John Podesta, the chairman of the 2016 Hillary Presidential campaign claims Russian President Vladimir Putin is aiding Donald Trump’s campaign because there is as AP reports  “a kind of bromance going on”.  As if one more fabrication of reality could sway the narrative back to the Democrat's camp. And whether the Russians hacked the DNC emails or if it was the Romanian hacker claiming responsibility known as Guccifer 2.0 really doesn’t matter.  What matters is that now the American people know how riddled with deception the DNC truly is. The political machinery propping up Hillary's campaign is quickly coming apart at the moment she should be dominating. The released 19,252 wiki leaks internal emails that were hacked from seven officials at the DNC have served as a battering ram, exposing a organization laden with deceptive practices on a monumental scale.  Aside from the DNC's obvious favorability of Clinton over Sanders because of her gender and the jabs taken at Sanders religion. The emails detail a manipulation of the media of grotesque proportions. Relegating mainstream media to nothing less than a propaganda machine.  In this email the DNC’s National Press Secretary Mark Paustenbach says of a Politico reporter Ken Vogel “ Vogel gave me his story ahead of time/before it goes to his editors as long as I didn't share it. Let me know if you see anything that's missing and I'll push back.\""}]
