[{"comment_id":"10153222909878132","commenter_b":"Why do women ALWAYS havevto comment on other women's hair..ugh","commenter_a":"sienna looks better as a brunette.","post_message":"\"She just understood. We just connected. It's been a tremendous blessing.\""},{"comment_id":"404568359667759","commenter_b":"They all need to go somewhere else!","commenter_a":"what is wrong with the United States flag this is United States we have the right to fly our flag just like any other country","post_message":"Why do some people want to ban our flag?"},{"comment_id":"484149281775652","commenter_b":"Get rid of him and his fat AZZ wife!","commenter_a":"Yes","post_message":"VIDEO: Kanye West cries racism after Beyonce loses... Kanye is a fool and a cancer, let's ban him from America. Do you agree Kanye should be banned from America?"},{"comment_id":"10154830070756337","commenter_b":"I feel good Hillary is going to win","commenter_a":"I'm with her!","post_message":"We're counting down to Tuesday's election. Tell us how you feel..."},{"comment_id":"10152849250926770","commenter_b":"Saul Alinsky a communist socialist died about 43 years ago, but his writings influenced those in political control of our nation today. Recall that Hillary Clinton did her college thesis on his writings and Barack Hussein Obama writes about him in his books. Died: June 12, 1972, Carmel-by-the-Sea, Ca Education: University of Chicago Spouse: Irene Alinsky. Books: Rules for Liberal Radicals Reveille for Radicals Anyone out there think that this stuff isn't happening today in the U.S. ? All eight rules are currently in play How to create a social state by Saul Alinsky There are eight levels of control that must be obtained before you are able to create a Liberal Socialist state. The first is the most important. 1) Healthcare : Control healthcare and you control the people. 2) Poverty : Increase the Poverty level as high as possible, poor people are easier to control and will not ...","commenter_a":"Maybe he was the main cause. Left himself out, didn't he.","post_message":"Excuse me?"},{"comment_id":"10154272601268525","commenter_b":"How stupid are those girls...their on camera now...lol","commenter_a":"Shane Ornelas","post_message":"HULK HOGAN ROBBED: Not even the iconic wrestler's home is safe from holiday package thieves! STORY: fox10phoenix.com/entertainment/@username-story"},{"comment_id":"10155456952478797","commenter_b":"His mom was white you racist white hater!","commenter_a":"African american? He's interacial! His mother is white, let's not forget her!","post_message":"Honoring Barack Obama, the 44th President of the United States and the first African American to serve as president. bit.ly/2mfD3IE"}]
