[{"comment_id":"949545821752943","commenter_b":"All. Very. Sexy. Women. Man...","commenter_a":"Who chose white print???? I couldn't read most of this .","post_message":"Have you seen this?"},{"comment_id":"1577140392594063","commenter_b":"She is not human, I look at her and see lie lie lie lie lie","commenter_a":"She has NO. SHAME. Once again, it's ALL about HER.","post_message":"Hillary Clinton slammed Republicans while talking about her health during a speech today."},{"comment_id":"10152867504581336","commenter_b":"What a ugly woman she is","commenter_a":"This is what Islam is all about........ @webpagelink","post_message":"Ayaan Hirsi Ali has something in common with the #CharlieHebdo editor murdered by terrorists in Paris: She is also on al Qaeda’s death list. She spoke to Megyn Kelly tonight on 'The Kelly File.'"},{"comment_id":"10153019604880399","commenter_b":"Yes we do!","commenter_a":"We NEED to get rid of THE TYRANTS","post_message":"Dr. Ben Carson wants a country that \"puts our Constitution on the top shelf — and for those who have any doubt, that includes the Second Amendment.\""},{"comment_id":"1192108440886151","commenter_b":"He is going to be a great president","commenter_a":"He is the uneducated and ignorants president which apparently there is a lot of!","post_message":"WATCH LIVE: President-elect Donald J. Trump makes a statement from Mar-A-Lago estate"},{"comment_id":"10153690611426756","commenter_b":"The woman is the patient.","commenter_a":"It's interesting the idea that the woman is the \"patient\" so her health is all that matters. I've always pictured prenatal care as for both the mom and baby together.","post_message":"Over the years, residents have come to Janet Singer, a nurse midwife, with tricky questions about performing abortions: Where does life actually begin? How do doctors’ personal beliefs play out in their clinical care? And what’s really best for mothers? She thought the public would benefit from hearing their experiences, so she asked four residents to write about them."},{"comment_id":"1137251062961589","commenter_b":"Hillary Clinton for President!","commenter_a":"Hillary 2016... and trolls in 3.2.1..","post_message":"The 2016 Democratic candidate said that incomes have stalled even as corporate profits have skyrocketed, creating inequality that is \"a drag on our entire economy.\""}]
