[{"comment_id":"1369207093090488","commenter_b":"The woman is pure evil","commenter_a":"It's time for women to shine, it's Been over due. I'm so proud a women is going to be the next President of the United States 2016 for the 20th century","post_message":"LIVE: Democratic Presidential nominee Hillary Clinton speaks at Democratic National Convention."},{"comment_id":"10153850798269614","commenter_b":"we definitely need to build this wall and make Mexicans pay for it","commenter_a":"donald trump is right we need to get this people out of this country","post_message":"U.S.-born Syed Rizwan Farook, 28, was one of two suspects identified in the fatal shooting rampage at the Inland Regional Center, police said. He and a female suspect, 27-year-old Tashfeen Malik, later died in a shootout with authorities."},{"comment_id":"779312755503344","commenter_b":"How about in the best interest of the Muslims, they don't belong here.","commenter_a":"why do we need them here??? what benefit are they to America??? wtf....","post_message":"Is Paul Ryan in our country's interests?"},{"comment_id":"1324289204299860","commenter_b":"LOCK HER UP!!!...LOCK HER UP!!!!...HILLARY FOR PRISON NOW!!!!...IT MUST BE PROVEN TO ALL THAT NO ONE IS ABOVE THE LAW IN OUR AMERICA!!!....HILLARY'S CORRUPTION WILL NEVER STOP TILL SHE IS BEHIND BARS!!!!!.........TRUMP IS THE PRESIDENT AMERICA DESERVES!!!....GOD BLESS OUR NEW PRESIDENT!!!!.","commenter_a":"Tried to listen to Jill's reason for the recount but she made no sense. She is the reason Hillary lost and she's nuts. Wouldn't vote for either of one, both are evil.","post_message":"Uh-Oh, Hillary! Trump Just SMASHED Down The Hammer On Crazy Vote Recount Scam! THROW THEM BOTH IN JAIL!"},{"comment_id":"543880552475480","commenter_b":"Let a family move in with you. We The People are tired of paying high taxes for to pave a way for illegal aliens from any country while our veterans are living in the streets and receiving poor healthcare.","commenter_a":"These people shouldn't be here anyways. I am all for the people that are here illegally staying and becoming residents. Most of these people just want a better life for their kids and they are productive, hard working members of society","post_message":"THIS JUST IN: Donald J. Trump in his first post-election interview said he's willing to deport or incarcerate 2-3 million people in the country illegally who \"are criminal and have criminal records...\""},{"comment_id":"1827830767485738","commenter_b":"No","commenter_a":"NFW","post_message":"Daily Live Poll: Do You Think Russian Backed Hackers Helped Donald J. Trump Win The Election?"},{"comment_id":"10154103517111178","commenter_b":"Tell the truth its because you give all illegal aliens full medical care.","commenter_a":"They say 17 million people are enrolled so if it cost that much then scrap it","post_message":"Truer words have never been spoken by the president."}]
