[{"comment_id":"924082021021384","commenter_b":"and hate smart women.","commenter_a":"What happened with the great Sara Palin she not running lol","post_message":"They might need a bigger stage..."},{"comment_id":"10156229104235354","commenter_b":"Kim more is nothing but a troll. But she needs to shut up and mind her on business. Dumb Limey.","commenter_a":"Piers shut up and stay in England, count all the people been kill in your own country....................................................","post_message":"See his 5 tweets."},{"comment_id":"10153312130831051","commenter_b":"its a MUTE SUBJECT!!! THERES NOT ONE RUNNING FOR PRESIDENT ... AMERICANS ARE SICK OF THIS CRAP !!!!!!!!!!!","commenter_a":"I would beleive Mr Carson anyday over Obama or any of his men......","post_message":"The Obama administration just slammed Ben Carson for saying America shouldn’t elect a Muslim president. Who do you think is right here: Carson or the Obama administration?"},{"comment_id":"522564217947920","commenter_b":"Lmao 😂😂😂","commenter_a":"Sanders is turning into John Kasich, showing up to places and losing.","post_message":"\"We're in it until the convention,\" she said."},{"comment_id":"10153603488066680","commenter_b":"The only law that need making is that ONE that makes it illegal for people to break the law!!","commenter_a":"The Boston bomber used a pressure cooker, Oklahoma was fertilizer. Killers will find a way. Let's blame the perpetrators, the ideology,not inanimate objects. Law abiding citizens should not have there rights tampered w. Let's enforce the laws we have.","post_message":"\"We need to have the hard discussion and talk about gun laws that allow an individual to legally purchase weapons that facilitate mass killing. We have to have those hard discussions,\" Lynch said Tuesday."},{"comment_id":"1007448135988608","commenter_b":"Lmao ik ik fr","commenter_a":"Me back in my days with the chancla 😂😂 @username","post_message":"Escape plan master"},{"comment_id":"10153196939420047","commenter_b":"Remove yourself from The United States of America. You Don'T America's Ways. LEAVE!!!","commenter_a":"It probably should be removed. Does a nation that promotes the murder of the unborn and celebrates a counterfeit\"marriage\" trust in the one, true God who has revealed Himself in Scripture? Nope. Meaningless words that don't impress the God of all creation at all. Repent and believe the Gospel.","post_message":"Avowed atheist Michael Newdow is at it again. He's just filed a federal lawsuit demanding that \"In God We Trust\" be removed from U.S. currency. We must remain vigilant in defending the Constitution from yet another assault on our religious heritage."}]
