[{"comment_id":"10154403628496336","commenter_b":"Ban all bombs - Obama","commenter_a":"Obama will call for more gun Control in Istanbul!!! It's not a terrorist attack in his eyes. Because of him these cowards are killing innocent people.","post_message":"Breaking News Update: At least 10 people were killed in the two blasts at the Ataturk Airport in Istanbul, according to the Turkish Justice Minister. @webpagelink"},{"comment_id":"1807363586202385","commenter_b":"Yes WE NEED TO LOCK HILLARY AND HER FRIENDS UP!","commenter_a":"Hell yes !!!!!!!","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"},{"comment_id":"10154191212073132","commenter_b":"Some girls eat and eat and not gain a pound, I'm not talking about girls with eating disorders. That's a different topic. Some girls are skin and bones regardless of how hard they try and gain.","commenter_a":"Far better looking then the skin and bones models they normally show. But she isn't 'Plus size', she's fit and healthly size.","post_message":"thought Sports Illustrated was taking a risk by putting a girl my size in the pages. But putting me on the cover? They aren just breaking barriers; they are the standard now. This is beyond epic."},{"comment_id":"10154262927371519","commenter_b":"What a faggot","commenter_a":"She was just on Rachel Maddow. I was in tears. This has to stop.","post_message":"He also threatened to rip off her hijab."},{"comment_id":"10152948923481336","commenter_b":"Generale brazilian lord me brazilian","commenter_a":"Angel Diaz Stacey Diaz @username Tom Tom Sheppard","post_message":"A breathtaking photo from the U.S. Navy shows a rainbow over the bow of the Nimitz-class aircraft carrier USS John C. Stennis (CVN 74)."},{"comment_id":"1759120751072019","commenter_b":"I don't want refugees coming in and I want Muslims out","commenter_a":"Wear a Make America Great Again hat! Fuckem!","post_message":"This was powerful!"},{"comment_id":"10152653302261167","commenter_b":"Females can't pass Marine tests. In other words, they can't get out of a foxhole with loaded backpack on. What harm could that cause?","commenter_a":"Those women go through the same training as the men, do they not? Are you going to insult all of our enlisted women by telling them they aren't combat capable?","post_message":"The man who the U.S. military kicked out of Iraq for divulging  sensitive information about troop locations has some thoughts on women in combat."}]
