[{"comment_id":"10155175769803984","commenter_b":"and we are not giveing up our freedom just stoping people entering oir country...our constitution does not apply to immigrates","commenter_a":"*\"B4 you blame Trump read this\"* ******************** *I still DO NOT understand why there's so much noise about Trump's decision to ban refugees from Muslim countries?? There are '100,000 empty fully air conditioned tents' in Mina- Saudi Arabia capable of housing 3 million people yet Saudi Arabia refuses to take the refugees, who speaks same language, same culture, same tradition, same religion, yet Saudi Arabia feels it's 'a security risks to accept the refugees' but wants the Christian world to do so? I'm trying to understand this thing called 'common sense', how it's been used. Is Saudi Arabia not too wicked for turning it's back against its own? Why blaming the US? Remember it is part of Trump's election promises, yet the Americans voted for him, meaning dats what they want.* *Germany took over 1 million refugees and Saudi Arabia came up with a proposal of spending billions to build ...","post_message":"Donald J. Trump gave Iran 1 chance to straighten up, and they defied him.  So now he's made a massive move to teach them we're the ones in charge.  Thank the Lord for a president with an actual backbone!"},{"comment_id":"960942283946630","commenter_b":"and the worse thing is, women are doing the cutting. sick sick sick","commenter_a":"horrible","post_message":"Female genital mutilation is a human rights violation. And it happens way too often. - Laura Willard"},{"comment_id":"547425292114717","commenter_b":"She needs to be exposed for every crime she has committed and she needs to leave her campaign so she can face charges for every one of those crimes!","commenter_a":"Oh! Bet me!","post_message":"Hillary is officially paying the price for all the crimes she has committed.  Awesome. She is a criminal.  Can we get 10,000 'LIKES' for Hillary getting arrested?"},{"comment_id":"10156393794945725","commenter_b":"Bitch","commenter_a":"The law is broken as in Chicago for the murder of Laquan McDonald who was shot 16 times in god dam animals because was In Africa American","post_message":"This is a look at the scene on the streets of downtown Chicago right now. LIVE COVERAGE -----> @webpagelink"},{"comment_id":"10153950585516491","commenter_b":"I really wish it had been 'Let the bodies hit the floor\" by Drowning Pool","commenter_a":"What this guy have to do with music? This show is a joke nothing to do with real music talent onlyma bunch of show offs","post_message":"Michael Phelps:  \"I might have a lot of gold but this guy’s got all the platinum.\""},{"comment_id":"1080901341949487","commenter_b":"She let them die","commenter_a":"Donald Trump for President 2016! Make America great again and will work for FREE!","post_message":" Obama administration and Clinton officials hid this compelling Benghazi email for years, said Judicial Watch President Tom Fitton.   The email makes readily apparent that the military was prepared to launch immediate assistance. The fact that the Obama administration withheld this email for so long only worsens the scandal of Benghazi. Please SHARE!"},{"comment_id":"536487383205696","commenter_b":"Here's some facts for you Gerry - I NEVER want to be someone's \"arm candy\", I will NEVER marry for money and I don't have relationships with people because of the way they look. I do agree with you when you say we are our worst enemies, but that doesn't give you the right to generalise all women. Unless you're happy to be lumped with the guys that are shallow and only date women with big breasts","commenter_a":"Who the hell cares if she is pregnant? unfortunately women are their own worst enemies, happy to be arm candy of some of the most groteste males alive,providing they are millionaires, fact!","post_message":"Jennifer Anniston has said we’ll be the first to know if she's pregnant. Writing for The Huffington Post, the actor blasted the “sport-like scrutiny” she lives under, saying it’s indicative of society’s warped view of women which sets a dangerous example for girls."}]
