[{"comment_id":"10154492827869497","commenter_b":"Who can believe this story?? After all the woman ?????","commenter_a":"hahaha","post_message":"Highlights Of President Bill Clinton's 2016 DNC Speech"},{"comment_id":"10153967226386756","commenter_b":"Don't they have strict gun control laws? The criminals don't follow these laws? Shocking!","commenter_a":"Here are the huge protests over this? Why is the black community not absolutely outraged by this?","post_message":"These stones are a handful of those youths killed in Chicago. Diane Latiker of Kids Off The Block, Inc. (KOB) is trying to keep more names of children off the wall."},{"comment_id":"10154113028645329","commenter_b":"Does this mean we all just became best friends?","commenter_a":"Wow. Completely true. Very accurate quiz.","post_message":"It really will. (via BuzzFeed Quiz)"},{"comment_id":"10153227271719228","commenter_b":"If she didn't go to the hospital another couple hours she would have been gone cuz it would have went to her heart it was that close to her heart they caught it in time","commenter_a":"The exact same thing happened to my daughter they went in a Lana ectomy scraped her spinal cord put her in a coma for 2 weeks it took her 2 months to learn how to walk again but she is walking again","post_message":"Her body started to go numb and she lost feeling in her legs."},{"comment_id":"10153024489644614","commenter_b":"Good question Michael, I'm gun illiterate, I though ALL guns had a safety :/. I was trying NOT to be cynical, but was wondering, if you hust had dinner with your wife, and you're entering an elevator, what possible reason do you have to unholster your weapon? Makes you go hmmmmmmmm","commenter_a":"Poor guy ..... perfect example of ALWAYS following safety procedures. If he was off duty, why didn't he have the safety on? But hey, nobody's perfect, and he is paying dearly for this mistake, physically, and I'm SURE! at his job with the ribbing he's getting frim his fellow officers.","post_message":"A Kentucky police officer accidentally shot himself while standing next to his wife in a Cincinnati elevator, and the entire incident was captured by surveillance video. Officer Darryl Jouett removed his gun from its holster and was apparently trying to put it in his pocket when it went off. A bullet ricocheted off the elevator door and hit him in the stomach. Jouett on Monday told WCPO - 9 On Your Side he was at home and on the mend. Read KTLA's story here: @webpagelink"},{"comment_id":"10153761760496179","commenter_b":"Olivia Gregg 😅😭😂","commenter_a":"Anna Margaret","post_message":""},{"comment_id":"741928785958028","commenter_b":"Stop calling it \"OBAMACARE\"! It's the AFFORDABLE CARE ACT!!!","commenter_a":"The people that voted for Trump knew that this repeal was part of his plan. You voted for him, don't cry now. Suck it up. Unfortunately the ones that didn't vote for him have to suffer too.","post_message":"The American people know that this is a matter of life-or-death, and they're letting Republicans know it."}]
