[{"comment_id":"1594945114129629","commenter_b":"This woman is a freaken joke. Go Trump","commenter_a":"Demonrats-deliver Detroit, Flint, Toledo, Baltimore, Newark and ghetto's !!! aLL THE TIME 100% OF THE TIME, every time suckers !!!!","post_message":"Democratic presidential candidate Hillary Clinton took aim at Republican rivals saying she is looking forward to debating with them about the economy if she becomes the Democratic nominee."},{"comment_id":"10154462042369062","commenter_b":"Lmao... Con el nopal en la frente y encontra de illegales.... Everyone with a hispanic latino last names shall research theyre ancestry our families come from illegal immigrants","commenter_a":"We are not \"united\" and Trump is not racist. I am against illegal immigration and support Trump!","post_message":"It translates to, \"United Latinos: Don't vote for racists.\""},{"comment_id":"10153787170708338","commenter_b":"@username would you like an A for English ? You got the picture right? That's all that matters, just for you I'll make it politically correct Lose!!!! Here you go","commenter_a":"Round the gangbangers up, they need to see what it looks like to lose an innocent child!!! Round them up and have them put in detainee prisons and ship they butts off to a open area so they can be at war with each other so that Chicago can live in peace!!! No need for burials and insurance just leave them right where they lay!!!! This is truly sad , this baby won't see thanksgiving or look forward to the surprise of his favorite gift on Christmas","post_message":"Visitation for 9-year-old Tyshawn Lee is being held today at Haven of Rest Missionary Baptist Church. CBS2's Mai Martinez will have a live report at 5:00 PM."},{"comment_id":"650574988427913","commenter_b":"Marco Judilla bwahahahahaha","commenter_a":"Michelle Balisado","post_message":"Ewwwww."},{"comment_id":"10154526253322464","commenter_b":"Want to bring some refugees? Bring the Yazidi!!!","commenter_a":"We want to live in peace I Yazidi from Iraq There's no one feels Us #StopYazidiGenocide #StandforYazidiWomen #StopYazidiGenocide #StandforYazidiWomen Nadia Murad","post_message":"Washington Examiner: Oklahoma Obamacare plans face 76 percent hike.  #FullRepeal: @webpagelink"},{"comment_id":"1129299917126536","commenter_b":"Hillary is the real war on women.","commenter_a":"Together we Move Forwards Vote to President @username 2016.","post_message":"In ten years, we can generate enough renewable energy to power every home in America. #EarthDay"},{"comment_id":"10155175983529749","commenter_b":"Not fair to use term feminist for these people...might be better to go on \"feminazzi\" :) . It's kinda offensive for the real feminism movement which is still something some part of the world really need no? :)","commenter_a":"Why are they always fat? I have never received a satisfactory explanation.","post_message":"Presenters and staff frantically scrambled to cover the woman's breasts."}]
