[{"comment_id":"10154430644149411","commenter_b":"Wow and the racism starts. Why am illegal cause I have a latino last name? That's exactly the type of ignorance Trump types bring to the table. Also white pride has far deeper roots tied to hatred in this country. If anything you just proved my point. When KKK have rallies it's freedom and of speech. But if latino or black communities have groups such as black panters it an extremist hate group. You people are really stupid because your racism.is exactly what is creating the modern resistance. So keep on hating and bring more peope to my side..what you think after centuries of white dominance we wouldn't eventually get tired of that shit and start fighting back?","commenter_a":"Look here's what it is. The same people that like Trump ate the same people that make Obama watermelon jokes. It's all about white privilege for you guys. What's really behind Trump's popularity is the fear that white people's dominance is being threatened. \"But Ray,\" you'll say, \" there are plenty of minorities that support Trump. \" to which I say, that the US has done an excellent job of scrubbing away people's culture and heritage and whos propaganda has thoroughly brainwashed people into extremely nationalism. Cause guess what there are plenty of white people that are against Trump as well. Face it. Trump's entire campaign is based on xenophobia and white pride may ad well be his slogan.","post_message":"'It's also to show solidarity with all the people he has tried to harass and point out we are still here and not going anywhere'"},{"comment_id":"1133219213367232","commenter_b":"Brian spot on brother our country is sick you hit nail on the head God bless you.","commenter_a":"AGREE, 100%. AMEN,","post_message":"YES!"},{"comment_id":"1692723517682991","commenter_b":"One of you crazy ladies is from Texas.","commenter_a":"Realism is not what I see coming from most of HRC's supporters. There are some extremely hard to admit, and in fact, frightening facts that I think we have all tried to glaze over for years. In Bernie Sanders we have got a candidate that is addressing those facts. Climate Change is real, most democrats are no longer climate change deniers, but I feel like the real threats are being overlooked. For example, droughts are happening all over the United States. We are quickly depleting our fresh water aquifers. When one factors Fracking into this, we are willfully allowing our government to destroy more of our fresh water systems. HRC cannot denounce Fracking. Now, before you think that article that spells out how much HRC is taking in campaign contributions from the fossil fuel industry is another Republican smear tactic, note that it is by Greenpeace. She has to go. ...","post_message":"\"We can open the door to every person in this country again.\" —President Bill Clinton"},{"comment_id":"676882525784251","commenter_b":"STOP IT !","commenter_a":"When did this actually happen? Yikes...............","post_message":"An oil spill the size of Manhattan is devastating the Gulf of Mexico, and nobody's talking about it. #MicBrights"},{"comment_id":"10155013190899726","commenter_b":"Yup she's a nobody!","commenter_a":"Yes precious snowflake because you won't be happy until abortion is a Live pay per view celebration #sick","post_message":"'This isn't working, this two-party system'"},{"comment_id":"10154200201311636","commenter_b":"I don't understand how she can even show her face in public after what she's done to Germany. Which in turn has had a negative impact on the rest of Europe. They should ship her out of the country along with all her precious illegal migrants.","commenter_a":"Thats good news for the AFD party..... No German wants to see this puppet!","post_message":"More follows"},{"comment_id":"10154275464344024","commenter_b":"@username You stfu!","commenter_a":"It's so nice to see that Black Lives Matter to Black People!","post_message":"Two people were killed early this morning, and several others were wounded, in a shooting at a Halloween party in Newburgh, Orange County. Details: @webpagelink"}]
