[{"comment_id":"1231187963602033","commenter_b":"Hell yed","commenter_a":"I was told that these people that get these free cell phones, they get not 1 cell phone but 4 phones each. I asked how can that be? He told me that they have all these different programs and they apply for them all. It's insane. I say stop the cell phones!!!!!! Cannot wait. Such waste of our, the taxpayers money.","post_message":"Boom! PLEASE LIKE and SHARE The President Donald J. Trump page for all the latest Trump related news! 100percentfedup.com"},{"comment_id":"10153306552824087","commenter_b":"Good question Eli Richardson Why do straight liberal females have a problem with men using their facilities?","commenter_a":"Even though that has never happened in the couple hundred cities that already have such protections. My city (also in Texas) has had it for 6 years, never a single issue. It's pure hate of trans people. It's transphobia that drives countless people to suicide. It's unacceptable.","post_message":"The Houston Equal Rights Ordinance became better known by detractors as the “bathroom ordinance,” after opponents warned that some protections related to the use of public bathrooms would allow sexual predators to go into women’s bathrooms."},{"comment_id":"10156964298475557","commenter_b":"Unbelievable that she is allowed to be running for president if I did what she did they would have found me guilty and thrown the key away!! To think she could be our president, omg!!","commenter_a":"Political game playing and media bias. This woman should be in prison. Not on a pedestal. She is as corrupt as they come. Why are people so stupid?","post_message":"Hillary Clinton will become the first woman to top a presidential ticket after securing enough commitments Monday from delegates to become the presumptive Democratic nominee, The Associated Press reported."},{"comment_id":"10153366308391336","commenter_b":"Ewww! What a scanky hoe!","commenter_a":"I bet they didn't even use condoms... - Don't they care about STD's on DEATH ROW or in Maximum Security?","post_message":"Shepard Smith reported that Joyce Mitchell, the prison worker accused of helping two convicted murders escape from Clinton Correctional Facility, reportedly had sexual relationships with both killers."},{"comment_id":"10156995809880354","commenter_b":"Someone needs to tell that ugly old bitch to put some fucking clothes on.","commenter_a":"I have respect for this woman. She isn't funny and she is without class.","post_message":"Chelsea Handler's thirst for attention is seemingly unquenchable..."},{"comment_id":"10154352675806336","commenter_b":"Lets hope they nail her butt to the wall!!","commenter_a":"video of her saying she was shot at and then video that she was not shot still cannot convince these people she is a liar.","post_message":"Bret Baier: \"The State Department IG, though, wanted to talk to you and you didn’t want to do that.\" Hillary Clinton doubled down on claims that her personal email scandal will not hurt her presidential bid or result in an indictment. @webpagelink"},{"comment_id":"10154131291436756","commenter_b":"Dinosaurs eat man. Woman inherits the Earth.","commenter_a":"God creates Dinosaurs. God destroys Dinosaurs. God creates Man. Man destroys God. Man creates Dinosaurs.","post_message":"\"God made man, man rejected God, and God won't stop chasing man until he wins him back. And that's the simple story of God\" — the very story Franklin aims to tell with his music, without all the rules of religion."}]
