[{"comment_id":"591336634387962","commenter_b":"Build the wall!!","commenter_a":"That's California for ya. I find nothing wrong with what he said in 1971. Things were different then. I said things in 1971. Does that mean I'm a racist today? I am military where everyone's color is either desert camo or woodland camo. I find affirmative action quite racist. Employers should be able to hire people because of their skills not because of the color of their skin. Absolutely ridiculous.","post_message":"California lawmakers refuse to honor John Wayne! and here's why..."},{"comment_id":"478375502350743","commenter_b":"Ridiculous. Stop this nonsense","commenter_a":"Pay the fine..it's a small price to pay for all God has given us.","post_message":"Obama's America hating Christianity..."},{"comment_id":"541066452731681","commenter_b":"Melania Trump speaks 5 languages and has a degree in architecture and design!!! That sets a new HIGH STANDARD FOR THE FIRST LADIES!!! I LOVE Donald Trump","commenter_a":"If we really get to vote and they really count them correctly, Trump will WIN..... but that remains to be seen. Trump one great American for President ! Go Trump !!!","post_message":"Join us at a TRUMP 2016 Presidential Rally near you! Daily updates at www.donaldjtrump.com/schedule - we look forward to welcoming you! Thank you for your continued support!"},{"comment_id":"10153356889206162","commenter_b":"But according to @username, only BLACKS are doing this foolishness...So I guess the Latin Kings, & the Sinoloa drug cartel, are peace-loving church groups...","commenter_a":"Im sorry but blacks enjoy killing their own over drug money gangs personal problems and ignorance. I do feel as sorry for those innocent people that have lost their lives due to the violence of this crappie city and ignorant people.","post_message":"DEVELOPING: 2 men are dead and a woman is injured after a shooting in North Lawndale: @webpagelink"},{"comment_id":"10153262230564255","commenter_b":"Evil like this should be flogged. He's a monster like the rest of the TeaParty Jerks.","commenter_a":"I truly believe this man, Ted Cruz and their followers have very warped brains that will only bring greater harm to the world than Dubya/Cheney created and we are still trying to repair! They whole group needs to be tried and sentenced to jail for 3 years for TREASON!","post_message":"Losing his grip on reality, or lying shamelessly?"},{"comment_id":"10153871273143984","commenter_b":"go home and take obama with you !","commenter_a":"OMG. They need to take this list to Iraq and make their demands. Not here.","post_message":"Illegals just issued their new 'Bill of Rights' to the American people, and I definitely don't see many being too happy about it...  Do you think the U.S. needs a president who has a tough immigration stance?"},{"comment_id":"10153579142479170","commenter_b":"she's never right !","commenter_a":"Sorry the American voters frustrated you. You can just stay home and learn to deal.","post_message":"According to Hillary, we're all just too stupid to understand how brilliant she is. She gets frustrated by that, and admits that her frustration is her 'greatest weakness.'"}]
