[{"comment_id":"10153663594614160","commenter_b":"You've Been Blamed because you brought us down to our Knees but we'll fix it all under Trump and wipe away ALL traces of your rotten deeds against our Beloved America--now go kiss some more Muslim butt and bring in more Illegals you only have 7months left ---","commenter_a":"Of course he is trying to deflect blame.","post_message":"'I have been blamed by Republicans for a lot of things'"},{"comment_id":"10153991285739091","commenter_b":"How is he disrespecting the vets? I'm confused","commenter_a":"Think of all the people fighting for our country show a little respect 🇺🇸","post_message":"San Francisco 49ers quarterback Colin Kaepernick plans to take his peaceful protest against racial injustice and police brutality 'a step further.' He says he will donate $1 million to help in the effort."},{"comment_id":"10152591855036636","commenter_b":"An attractive white girl dies. Everyone loses their minds.","commenter_a":"Oh dear . Was going to say . Oh my God . Hmmm. There are many people out there that need help . Just look around and you will be amazed . Some think that is the only way out . Look deep before before you criticise .","post_message":"Tragic."},{"comment_id":"1557919144505066","commenter_b":"Absolutely! The party comes first to Republicans.....the people and the country are not important until they can be used to the advantage of THE PARTY. Sad","commenter_a":"Honestly, I'm worried about 'merica if trump is such an overwhelming decision for them to make. Consider the members of the Republican party, they're going to vote trump because he's not a Democrat. That means, party alliance is more important to them then things like racism and ignorance. Give me a break.","post_message":"President Obama slow jammed the news and also talked about Donald J. Trump, Hillary Clinton and Bernie Sanders."},{"comment_id":"10153544166434024","commenter_b":"NY is the capital of THE WORLD! If you don't want to spend money LIVE SOMEWHERE ELSE! As far as Cruz goes I thought Republicans want smaller government. ??? Good get out of our marriages and get out of our doctors offices. (Women's Drs offices)","commenter_a":"Freedom of speech... He's right about the liberals in NY. Who cares. NY is insanely wrong when it comes to taxes and wages... The truth hurts.","post_message":"WATCH: Ted Cruz slams Gov. Cuomo and Mayor de Blasio when asked about calls for an apology for his remarks on 'New York values.'  Your reaction to Cruz's latest comments?"},{"comment_id":"10156449945205354","commenter_b":"NOOOOOO! Stay there!","commenter_a":"Haha nah Texas is is good on that","post_message":"Obama's Hero, Ahmed 'Clock Boy' Mohamed, Now Misses Texas!  “I want to go back to a place where everyone knows me.”"},{"comment_id":"924477534340446","commenter_b":"'@username your mother should have swallowed","commenter_a":"If she really wants to make America whole again, she should do the right thing, and GTFO of politics altogether. It's a start at least.","post_message":"Do you agree with Hillary Clinton? #SCPrimary"}]
