[{"comment_id":"10154673400449062","commenter_b":"Nope","commenter_a":"Not only are we erasing our history, but this change will cost a lot of money to redo signs, get new uniforms etc. The district has $107 MILLION shortfall because of the Robin Hood Plan. I won't have a job next year, and campuses will be forced to do more with less in many areas. So many reasons that this is NOT a good decision. If we ignore our history we are doomed to repeat it!","post_message":"JUST IN: HISD votes to rename 3 schools named after Confederate leaders. Details: @webpagelink"},{"comment_id":"1183766191643735","commenter_b":"Hatred is strong in those with finacial short-comings, within their own community, makes you judges their contibution to their local enviroment, and their judgment in communal affairs.","commenter_a":"This will be resolved once and forever when President Trump builds the 12 foot high electrified fence between Canada and USA. Then future youths will be electrified. US Customs and Border Patrol's workload will be greatly diminished.","post_message":"Two youths unaware of their surroundings when they were playing Pokemon GO on their cell phones made an illegal border crossing this week from Canada into the United States in a remote part of Montana, U.S. Customs and Border Patrol said."},{"comment_id":"542727622584484","commenter_b":"she need to go home back where she came from","commenter_a":"They all look like robbers and murderers with that shit on there head.","post_message":"This Muslim woman was just kicked out of the mall because of this. If you can't follow the rules, you can't shop here. Do you think Muslims should obey the rules or leave?"},{"comment_id":"10155201801124170","commenter_b":"And the are letting this teach our children!!!!!!!!!!!!!!!","commenter_a":"I was talking with someone who told me they way he sees what's happening is most of these rioters are youths and college students that aren't even from HERE!!!Don't care about America, don't even know about America our home sweet home. So they need to STFU.","post_message":"Public education at its finest."},{"comment_id":"1052630838137004","commenter_b":"This bitch know all the new snacks before they hit the streets bitch be snoring and dont even sleep","commenter_a":"@username thug life overload","post_message":"Oh No: Big Girl Back At It Again & This Time She Has Lil Terrio Rapping!"},{"comment_id":"10153203713812894","commenter_b":"She's a damn lie! Ain't nobody stupid! That's what's wrong with her lying ass all them babies and surgeries!","commenter_a":"What did she do to her face? She looks weird","post_message":"Kim Zolciak Reveals Doctors Discovered a Hole in Her Heart While She Was Hospitalized After Her Stroke"},{"comment_id":"1284242998285633","commenter_b":"Proving they are not protesting anything really. They are just out to murder anyone they can for fun! Thugs paid for by Soros, Clinton's, Obama and others wanting one world government. Just like the Nazi regime but it will be 10 times worse. Liberals are too stupid to realize that. Until something they voted for creates a bad situation for them. Then they blame everyone else.","commenter_a":"That is really beneath everyone.","post_message":"So basically, this is incitement to murder and cops should treat them accordingly...what should they do?"}]
