[{"comment_id":"642371742620071","commenter_b":"Her fat ass needs to get a job and off the government tit. She is a disgrace to the white race.","commenter_a":"Th dems way of welfare hz put many ppl out of th mindset of personal responsiDAMNbility!!!?","post_message":"This woman claims she deserves more welfare than others.  This is unbelievable. Let's kick this woman off welfare immediately.  Should she be forced to pay us back?"},{"comment_id":"10154339020461729","commenter_b":"Can that woman ever give a straight answer?","commenter_a":"She sucks! Just not Bubba...","post_message":"This woman...SMH"},{"comment_id":"10153185628051615","commenter_b":"Dude we should just start bombing them f*** that worry about the details later","commenter_a":"Come on. Can we stop leaving out important facts like that the passport was likely planted AND fake? World and even French news is properly reporting that. @webpagelink","post_message":"LATEST: A French official says the suspected mastermind of the Paris attacks was also linked to thwarted train and church attacks. Channel 11 Morning News will have updates all morning long."},{"comment_id":"10154655361619170","commenter_b":"She looks like calling us Deplorables. She should look in the mirror..","commenter_a":"And she belongs in a mental hospital.","post_message":"Here's what Hillary thinks about you. Now click to join us in a little experiment concerning this."},{"comment_id":"908896759158872","commenter_b":"Us is what I recorded","commenter_a":"@username let's go to Vegas and stop off here!","post_message":"It one of the strangest motels you will ever visit  the Clown Motel, next to a grave yard in Tonopah, Nevada.  And if you don like clowns, or are afraid of ghosts, you may want to stop somewhere else.  Story: @webpagelink"},{"comment_id":"10152685223867894","commenter_b":"That Bitch Messy Asl !!","commenter_a":"Tameka Lovinglife Mccraney These Celebrity Couples And Exes Are So Messy Lol","post_message":"Naya Rivera Announces Her Pregnancy on the Same Day as Big Sean's Album Release [Photos]"},{"comment_id":"1273278439392985","commenter_b":"This is what the feminist want for women in America","commenter_a":"Very sad! But the good part is that she is a martyr and spends eternity with our God of pure Love!","post_message":"GRUESOME VIDEO: Muslim Mob Tears 27 Year Old Woman Apart Before Killing Her Over False Accusation Of Burning Quran  This horrific \"honor killing\" was caught on video and published by the New York Times. It took place in Afghanistan…These are NOT terrorists. They are just a mob of local Muslim men administering \"justice\" to a woman who was unjustly accused of burning a Quran. ***WARNING***Video is very graphic!"}]
