[{"comment_id":"569782366553109","commenter_b":"Christ. Any more soft lobs? Take off the freakin kid gloves already","commenter_a":"falling asleep?","post_message":"Tom Price, Donald Trump's pick for secretary of Health and Human Services, is expected to face tough questions on Obamacare, his financial disclosures, drug prices and more in his appearance before the Senate Committee on Health, Education, Labor and Pensions."},{"comment_id":"1036949889659355","commenter_b":"Mother fucker that shot him should be shot","commenter_a":":(","post_message":"The first wolf spotted in the Grand Canyon for 70 years has been confirmed to have been shot dead."},{"comment_id":"10156237879600594","commenter_b":"Her posture? She's not modeling, she's out on a boat with her nieces. I doubt they would have been in the picture if the intent was to be \"sexy\". She wearing a bathing suit. So what?","commenter_a":"The body is fine, the bikini is ugly and her posture is horrible.","post_message":"Ariel Winter takes the online hate and spins it into a message for all the bullied girls out there: \"YOU ARE BEAUTIFUL\""},{"comment_id":"1037656442936422","commenter_b":"@username , I agree .","commenter_a":"Absolutely! This is the first campaign I have been able to follow totally since I retired, and I am sickened by how words that I have heard myself are mis-quoted and lied about, mostly by the Democrats. The lies are really incredible to me. Do they think nobody is paying attention?","post_message":"Huckabee says the mainstream media is making sure Clinton is \"presented in the best light,\" and goes out of their way to make Trump look bad. Is he right?"},{"comment_id":"10153226407581770","commenter_b":"Evil scum bags. Send them back!","commenter_a":"Strategically this suicide!","post_message":"When the politicians said \"Refugees Welcome,\" did they know they'd be welcoming a rape culture as well?"},{"comment_id":"10154373849503299","commenter_b":"Said all of us in January of 2009!","commenter_a":"Very good Mr. Claar!","post_message":"\"Had we understood just how clueless they were, the election result might not have been so shocking.\""},{"comment_id":"10153216569907550","commenter_b":"@username, lol you all claim its part of your heritage... First and foremost did you READ my post carefully? Because if you did you would know that I was referring to the past southerners who DID do all that. Your heritage is ALL THAT.... Your southern heritage is a hateful one and that's what you all are holding on too... You Keep saying that flag is our heritage. Name one good thing the south did for the slaves that wasn't hateful and name one good thing that flag represents. And FYI Lisa, you can't enlighten me because just like your counter part, you can't explain what your southern heritage is.","commenter_a":"It is not a symbol of hate, only in your dumb minds...its a symbol of our Heritage......maybe if you learned something in school you wouldnt worry about that flag........","post_message":"\"The time has come to remove this symbol of hate....\" Local religious and political leaders joined forces today to call for the South Carolina state general assembly to remove the Confederate battle flag still flying at the state capitol. More here ---> @webpagelink"}]
