[{"comment_id":"1131999030168888","commenter_b":"Heroin is effecting all colors all races from all backgrounds!!!","commenter_a":"I like how heroin is effecting white people the way crack effected the black community but the way the media and police are dealing with it is completely different. Instead of calling them junkies or addicts it's an epidemic and now it's a family issue. Just lock them up like you did to black people in the 80's.","post_message":"Police want you to see these viral images of what heroin is doing to families."},{"comment_id":"840419212729882","commenter_b":"Noone else to vote for... #Cruz #Ca #DudesDontPeeInTheGirlsRoom #NeverTrump #NeverHillary","commenter_a":"More republicans don't want Trump than support him. I will be voting Ted Cruz and will say for those who have not yet voted, especially in California, please vote Cruz (assuming he’ll still be on the ballot.) In the meantime, it’s time for the Republican Party comes to its senses and throws Trump out of its ranks and exclude him from eligibility for its presidential nomination.","post_message":"So many people are using what happens now as a springboard for the future."},{"comment_id":"10153527468435399","commenter_b":"Now,that's got to be a bunch of crock,they don't even know that hag.","commenter_a":"Why is a rally in Peru for a clerk in Kentucky hard to fathom? Does Rob Schneider work for this firm?","post_message":"According to a report by ThinkProgress, the rally never actually happened."},{"comment_id":"10153337726654726","commenter_b":"IF she had ANY self respect, she would NOT be making a fool of herself and making up LIES for obaloser and the rest of the liars!!!","commenter_a":"It disappeared. Hmmm...","post_message":"WATCH: State Department spokeswoman is laughed at while trying to give Obama credit!"},{"comment_id":"1225587407484516","commenter_b":"@username @username ca vaut aussi pour les chats bande de cingle !","commenter_a":"Krushank Shah","post_message":"This is why you should stop letting your dog lick your face."},{"comment_id":"1554742308153991","commenter_b":"IM A WOMAN...A STRONG WOMAN...AND I SAY TRUMP 2016!!!!!!!!!!!!!!!!!","commenter_a":"Classless joker","post_message":"What do you think about President Barack Obama's statements regarding Republican women and Donald J. Trump?"},{"comment_id":"811711869019390","commenter_b":"I wouldnt trust that asshole with my worst enemies life","commenter_a":"He should have never been trusted in the first place.","post_message":"Obama Scrambles And Goes Into Hiding After This Investigation Leaks.  He's doing whatever he can to keep this quiet.  Do you think Obama should not be trusted?"}]
