[{"comment_id":"10152906075606336","commenter_b":"@webpagelink In case you wanted to read the rest of what Seth Rogen had to say, not just the original tweet that was blown WAY bigger than it needed to be.","commenter_a":"Well said craig","post_message":"Country music singer and military veteran Craig Morgan fired back at Seth Rogen for his American Sniper comments. @webpagelink"},{"comment_id":"1891107191121894","commenter_b":"America America God shed His grace on thee!!!!","commenter_a":"seems like a funeral more than a parade","post_message":"We're live from President Donald J. Trump's Inaugural Parade:"},{"comment_id":"1219986431394436","commenter_b":"Why are women today so violent?","commenter_a":"No wonder kids are so screwed up today in America...just look at their mothers.","post_message":"Boom box brawl erupts in the sky"},{"comment_id":"886400474789539","commenter_b":"so many thugs trying to kill cops what do you expect?","commenter_a":"Crooked cops what would you expect?","post_message":"\"I just tried to cover my face from all the beating that the officer was giving me.\"  -Floyd Dent"},{"comment_id":"968795919903853","commenter_b":"The woman is so stupid, only reason she is in because of her color.","commenter_a":"Punta","post_message":"VIDEO: Congresswoman Stands Up For Sharia Law And Actually Gets This Disgusting Response.  'LIKE' if you think Rep. Maxine Waters should be kicked out of office for showing such strong support of ShariaLaw."},{"comment_id":"10153231132726336","commenter_b":"they should leave and not allowed back","commenter_a":"Look all black","post_message":"\"If you don't like what that flag stands for... leave!\"  On 'Fox & Friends,' Medal of Honor recipient Dakota Meyer called for a social media campaign to counter a movement encouraging Americans to stomp on the flag."},{"comment_id":"10153065488357217","commenter_b":"Because you are another dependent brain-washed puppet and the worst part of you think you're on the right side! Praying for you!","commenter_a":"Well done Kentucky clerk! And you masonBBC don't try to make real Christians look like some bunch of homophobes! Shame on you @username! You should apologies!","post_message":"UPDATE: AP reports Kim Davis, the Kentucky clerk who won't issue marriage licences, and all her deputy clerks have been called to appear at a federal court hearing on Thursday morning.   County Clerk Kim Davis eventually came out of her office, but she said she would not issue any marriage licences.  \"Under whose authority?\" she was asked. \"Under God's authority,\" she said."}]
