[{"comment_id":"854169234726517","commenter_b":"How about rapist?","commenter_a":"If trump is despicable, what does that make Hillary ?","post_message":"\"He’s just despicable,\" Letterman said, adding that Donald J. Trump may very well prove the saying that \"anyone can grow up to be president.\""},{"comment_id":"10153669770570950","commenter_b":"My thought exactly. If you see the pictures and videos, there are lounge chairs and tables just feet away from the water. People can read the \"no swimming\" sign, but an alligator is not going to think twice about coming on land. I think Disney needs to close off areas where there are gators. I lived in Tampa for four years, and gators were everywhere near water. You just knew where they were, and if you didn't, there were signs. I doubt people did not know about the alligators; you can always spot them especially if there are more than three. This could have been prevented.","commenter_a":"Why were alligators allowed to be so close to where human activity is? Especially DISNEY WORLD where 1000's of children are on a daily basis??","post_message":"Officials are pulling alligators from the nearby lagoon and putting them down to check for the boy's body; so far, they haven't found him."},{"comment_id":"10154188943324255","commenter_b":"How is it that these backwoods fucktards are so hopped up about the rights of fetuses, but when that fetus grows up and needs public assistance, they think it's a loser and a piece of shit? Idiots. I guess this is what happens when you fuck your sister.","commenter_a":"yeah lets legislate morality. Like that ever works. Like some others have said, forget getting any of my tourist dollars.","post_message":"All these new restrictions will not make abortions go away. But they will kill women."},{"comment_id":"1008179699229421","commenter_b":"Amen","commenter_a":"Amen","post_message":""},{"comment_id":"10154302113081509","commenter_b":"She had them surgically removed. She also doesn't have a brain or even a modicum of decency. And THAT is why she's running for office! Hellary 2016!","commenter_a":"Hillary would you like to have your husband also in prison ? Or else a dildo is enough ?","post_message":"Hillary Clinton had a message for a supporter's father who is backing Donald J. Trump"},{"comment_id":"10153475865743645","commenter_b":"Yes and she is a real b:tch","commenter_a":"Was the gator named karma ?","post_message":"He jumped into a pond to hide from authorities and an alligator attacked him."},{"comment_id":"10153982489146438","commenter_b":"talentless racist bitch","commenter_a":"talentless bitch","post_message":"It's an incredible visual album, but how is it as an aural album?"}]
