[{"comment_id":"10152823501296130","commenter_b":"They're some weird people ..these should not reproduce so good for her weird ass","commenter_a":"I would rather marry for love than for desperations.......","post_message":"Taking matters into her own hands!"},{"comment_id":"1016566111717194","commenter_b":"What a fucking hypocritic Bitch.","commenter_a":"Please don't accuse her for stealing a flag. She needed one to wear for a photo shoot to feel nostalgic about a time when she was a playmate.","post_message":"An enraged conservative attempted to steal an American flag from African-American protesters and fought with police, but was not arrested...at a demonstration regarding white privilege."},{"comment_id":"10153058619121051","commenter_b":"She should go to prison for years and starved on a day bases! She is disgusting!!","commenter_a":"Poor little baby","post_message":"Even the police were stunned that someone would treat a dog like this for no reason."},{"comment_id":"850216208416603","commenter_b":"More BS coming out of this corrupted Liar.","commenter_a":"'Crooked' Hillary will say anything and do nothing, she is an establishment politician, just like Obama, and will continue down the same path as Obama has taken America for eight years now. Don't be fooled by this fool, America has been fooled enough with these lying politicians. Vote Donald Trump For President, for real change in America.","post_message":"Hillary Clinton responds to the #Istanbul attack."},{"comment_id":"812160358905862","commenter_b":"Please make sure you are registered REPUBLICAN to vote for TRUMP. He's our only hope. Corrupt Washington DC will continue as usual with the rest who are beholden to big donors/super pacs. This corruption has been going on for 35 plus years. Vote TRUMP to take back our country. If Trump don't win our children and grandchildren will have a miserable life with Muslims and illegals taking over our country and to top it off we have no jobs.","commenter_a":"Question: If #BillClinton is campaigning for #HillaryClinton, does this mean he can charge any fee he sees fit? In other words, no matter the outcome, the #Clintons are making bank! Also, is this true? HIGH Treason Traitor Hillary Rodham Clinton UNITED States of America - As Wanta-Reagan-Mitterrand Protocols implementation remains imminent with an April 1st U.S. Supreme Court ordered deadline, it can now be reported that former U.S. Secretary of State Hillary Rodham Clinton has been placed under house arrest by the U.S. military on charges of financial treason. On week ago Friday, the same day Jack Lew was sworn in as U.S. Treasury Secretary, sociopath Hillary attempted to illegally divert $1.7 TRILLION of U.S. Treasury funds to a secret CIA proprietary account in the People Republic of China. Both Chelsea Clinton (Hillary daughter) and former Citibank CEO and Clinton era Treasury Secretary Robert Rubin have power of attorney over ...","post_message":"Good morning America! Thank you for your support in the latest national Reuters poll. TOGETHER, we will #MakeAmericaGreatAgain!"},{"comment_id":"1005311662842639","commenter_b":"I would have kicked her in her taco real good!","commenter_a":"Damn what a sicko.","post_message":"This nun decided that students needed a hardcore lesson in Jesus' suffering -- so she stabbed a kid in the forearm."},{"comment_id":"1426892224004095","commenter_b":"It is an eye opener!! The horror will be if Hillary is actually elecyrd. Then the real horrors will begin.","commenter_a":"Excellent movie! A must see!","post_message":"Hillary's America might just be the scariest movie you see all year...  hillarysamericathemovie.com/#tickets"}]
