[{"comment_id":"10152923499612217","commenter_b":"Are you tired of that excess fat in your body,having serious menstrual pain, weak erection, stretch mark,insomnia, stroke,fertility problem,pimples or any rough skin? We have the best and most affordable products for you.To get any of our products contact @username, BBM -2BDA0E2A.","commenter_a":"deepest sympathies to the families of all of the victims.......","post_message":"What we know about some of those who died #RememberTunisia"},{"comment_id":"10157713910895354","commenter_b":"@username Palestine did exist until the state of Israel was founded in 1948.","commenter_a":"Come on haters, start shit talking a kid that was brought up right by patriotic parents. You would applaud him for waving a rainbow flag.","post_message":"LOVE THIS. How about a hand for this young man respecting the Pledge of Allegiance?"},{"comment_id":"1338680576172411","commenter_b":"Omg pathetic!","commenter_a":"@username, a good laugh.","post_message":"This is hilarious and sad."},{"comment_id":"10152925277511336","commenter_b":"Let it go, let it go!","commenter_a":"WELL YOU FORGOT TO MENTION THE SNOW THAT WE HAD IN wc/PA.","post_message":"JUST IN: Travel bans in New York and New Jersey have been lifted. Blizzard predictions that kept millions of people home are now being downgraded. @webpagelink Time-lapse video taken Tuesday morning shows a deserted Times Square:"},{"comment_id":"1130182300405839","commenter_b":"Sorry about the lies aren't going to work she won the debate she will be our president get over it","commenter_a":"He is a tax cheat. What makes him think he is ok not paying taxes. I truly believes he hates our country. He is scum","post_message":"Absolutely deplorable."},{"comment_id":"1183766191643735","commenter_b":"Hatred is strong in those with finacial short-comings, within their own community, makes you judges their contibution to their local enviroment, and their judgment in communal affairs.","commenter_a":"This will be resolved once and forever when President Trump builds the 12 foot high electrified fence between Canada and USA. Then future youths will be electrified. US Customs and Border Patrol's workload will be greatly diminished.","post_message":"Two youths unaware of their surroundings when they were playing Pokemon GO on their cell phones made an illegal border crossing this week from Canada into the United States in a remote part of Montana, U.S. Customs and Border Patrol said."},{"comment_id":"10157371932040500","commenter_b":"Build that wall!","commenter_a":"Lithia FL","post_message":"WFLA Ian Oliver talking about Sunday weather and the latest on the tropics including Invest 99L."}]
