[{"comment_id":"10154464695802994","commenter_b":"If it is against her religion for birth control, she shouldn't be having sex out of wedlock either then","commenter_a":"Babies are blessings and I'm sure she loves them. But it's probably time for some birth control. 3 kids at 20 is quite a bit, but 6 is a lot (seeing as if they weren't twins someone would have to start around 13 and have a baby every year so I'm sure it hasn't happened much)","post_message":"\"My regrets would be timing, but I'm really happy that I can even create babies or have life because some women can't do that,\" 20-year-old Danesha Couch said."},{"comment_id":"10153425632179342","commenter_b":"Getting awfully tired of MEN telling WOMEN not to get pregnant. We can not without your sperm.","commenter_a":"This is a disgusting decision. Planned parenthood has done so much for women's health and to cut off funding will kill so many women. Short-sighted idiots. You are not pro life, you are pro birth, to hell with the before or after.","post_message":"Planned Parenthood affiliates statewide were told in a letter why they were being cut off"},{"comment_id":"10153487443061336","commenter_b":"Lawrence and Ruthanne Dolezal parents, both white as snow. Only time she is black is when the lights go out.","commenter_a":"OMG how proud her folks must be. Shes as black as Obama is white.","post_message":"“I wouldn’t say I’m African American, but I would say I’m black.”   Former NAACP leader Rachel Dolezal said in a new interview that she didn’t deceive anyone about her race."},{"comment_id":"10154039785538010","commenter_b":"Johnny Vega They saw an opportunity created by Democrats in the first place....who let all the illegals in? Democrats...why? So they could sick their KKK members on the Republicans and stage stabbings in Anaheim one day before David Duke ran his fat mouth. You don't know a setup when you see one?","commenter_a":"Interesting not once in the article do they mention the Political Party of the KKK. Democrat on Democrat violence...oh when will it end?!?","post_message":"In light of today's violent KKK rally in Anaheim."},{"comment_id":"1505789769441048","commenter_b":"Boycott NBC","commenter_a":"When has NBC ever put a spot light on Trump in a positive way? Lol.","post_message":"The 2016 election has been quite the seesaw ride."},{"comment_id":"10152578653426636","commenter_b":"Crazy moms be crazin","commenter_a":"Jeremy Blackwater Lopez","post_message":"A mother is now facing charges after she allegedly forced her children to drink poisoned apple juice.  According to authorities, she came up with the plan because she was mad at their father."},{"comment_id":"10152829771848271","commenter_b":"But she's a good girl out to hurt no one. I call BS!","commenter_a":"For all you saying \"She didn't deserve to die.\" So it would have been better if the police office was killed!? Where are your morals people. But when that thug comes knocking on your door who are you calling?","post_message":"The Denver medical examiner's office said Jessica Hernandez also had marijuana and a small amount of alcohol in her system during the Jan. 26 shooting that sparked protests and calls for an outside investigation. DETAILS:"}]
