[{"comment_id":"10152941725546051","commenter_b":"I feel for him. The cops and courts don't help. He stopped him once and for all.","commenter_a":"I would have done the same ~ if our laws were CORRECT pedophiles wouldn't be as big a problem! He should NOT be the one in jail !","post_message":"“I just want you to know, I ridded one less (expletive) child molester from the (expletive) earth that (expletive) with my little brother,” he said. “Alright? That's all I got to say. I don’t give a (expletive) how much time they give me. Doing time is the easy (expletive) part.\""},{"comment_id":"10154385949804087","commenter_b":"@username I think he ran away like a little bitch","commenter_a":"If all you ding-bat liberals would have acted like mature adults, all the EXTRA security wouldn't be needed and costs would have been much less. But no, you all ad to act like psychotic juveniles so this is what you get.","post_message":"The New York Police Department is blasting Republicans in Congress for refusing to cover costs to protect Trump."},{"comment_id":"10153202645506350","commenter_b":"This women should go talk to parents.","commenter_a":"Everyone saying \"she could have dealt with this privately, how embarrassing for the kid\". She never even mentioned his name... She is just addressing him along with all the other boys out there who do this. Something similar happened to me when I was in grade school and instead of having my back, all my friends labeled me as a bitch for not giving this guy a chance. He WAS harassing me but it was seen as \"cute\" because women are taught to appreciate male attention no matter the circumstances. We are taught it is the best thing that could ever happen to us. Just bear in mind that if a teenage daughter willingly comes to her mother for help, during a time when most teens seek distance from their parents, there is clearly a huge problem. This is video that can help a lot of other parents and teens ...","post_message":"This mom has a message for the boy repeatedly being rejected by her 14-year-old daughter: No means no."},{"comment_id":"10153318704229614","commenter_b":"This is why women live longer than men..","commenter_a":"The stupidity is strong with this one","post_message":"A shirtless man got himself into quite a predicament after climbing up a basketball hoop in Seattle and somehow managing to get stuck upside down.   Hanging by a foot, the man flailed and thrashed about while officers tried to figure out how to get him down.    Eventually, a couple of firefighters came in with a ladder, cut the net down and rescued him.   \"He may be arrested for property destruction, or at least goal-tending,\" the Seattle Police Department tweeted on Friday.   Read KTLA's story here: @webpagelink"},{"comment_id":"1026595164030198","commenter_b":"what was this brain dead bitch watching????","commenter_a":"A dues paying member of the old hag society.","post_message":"When did Andrea Mitchell become an official spokesperson for Hillary Clinton?"},{"comment_id":"10154831309643984","commenter_b":"She is SCUM","commenter_a":"She is pure unadulterated bullsh**.","post_message":"Of Hillary's hundreds of scandals, this is by far the worst. And most people have no idea she was even involved, let alone behind it.  This makes her scandals (and the ones she's made up about Donald J. Trump, look like nothing."},{"comment_id":"10154177327588984","commenter_b":"Don't want her anywhere near the White House.","commenter_a":"Lies more lies everytime she opens her corrupted mouth","post_message":"Hillary's campaign is once again doing damage control...  Is Hillary Clinton one of the last people you'd want to become president?"}]
