[{"comment_id":"10153170586384255","commenter_b":"Yay!! We already have enough leaking pipelines crisscrossing America...","commenter_a":"Eight treacherous Democrats. They should have to fight for their seat sin primaries.","post_message":"As expected."},{"comment_id":"1346838938665097","commenter_b":"@username the fact is that a male will never transform himself into a female. FACT!!","commenter_a":"For people who don't understand, it is not just restrooms, but women's locker rooms and showers and dressing rooms. This is not right. This is not just a trans thing, but will allow men to go into confined areas where women are very vulnerable. So, how would you feel if your grandmother, mom, daughter, sister, aunt, etc. to shower with a man next to you with only a flimsy curtain? We here in NC will stand strong. I hope our governor will continue to fight for women's safety.","post_message":"The solution here might be that the North Carolina governor could say that we don't identify as North Carolina anymore, and therefore your lawsuit against us is irrelevant."},{"comment_id":"663875460469699","commenter_b":"American news you suck! This story in all of their stories are not real! I cannot believe how many people fall for this b*******! Laughing my f****** ass off! Get a life people go spend some time with your families and try to figure out what you can do to help the country! Unbelievable! American news you suck!","commenter_a":"If they don't like our traditions don't come here...That was easy...","post_message":"The Obama administration is trying to ruin your thanksgiving. This is absurd. We can't let him get away with this. Will you still call it Thanksgiving no matter what?"},{"comment_id":"10154181766797093","commenter_b":"It's non violent offenses .","commenter_a":"What about victims? Can you erase their memory?","post_message":"If you have a criminal record, a group of Dallas county judges will help people with criminal records get their lives back on track. bit.ly/2li0sJ9"},{"comment_id":"10152911365806336","commenter_b":"That's NOT truth.....","commenter_a":"Open carry does not apply to black men.. No one wants to admit it, but it's the truth..","post_message":"A Florida man thought he was acting heroically for tackling a man with a gun at Walmart. Instead, the vigilante ended up in handcuffs."},{"comment_id":"1748645152080208","commenter_b":"heck ya we need a woman in the white house","commenter_a":"That's what I'm talking about Clinton 2016","post_message":"BREAKING: NBC News projects Hillary Clinton as the Democratic presumptive nominee. Read more: @webpagelink"},{"comment_id":"1862646097306537","commenter_b":"Now that is what real Democracy looks like. You go GIRLS with you in spirit.","commenter_a":"Beautiful","post_message":"What a successful march! Can we get 300,000 likes for these brave ladies? Read more HERE: @webpagelink Image by Occupy Democrats, LIKE our page for more!"}]
