[{"comment_id":"10154439835324203","commenter_b":"It takes brain power to watch a documentary? Lol","commenter_a":"not many of Trump's supporters read these guys, nor watch PBS documentaries, too much brainpower needed.","post_message":"David McCullough, Robert A. Caro, Ken Burns (PBS), and more have stepped up."},{"comment_id":"10152737995296519","commenter_b":"Whore's goal. A quick happy ending, get the john outta there.","commenter_a":"Yep and when you have it down real well, men cum in one minute instead of two.....grrreeeaaaatt.","post_message":"'Those who master it walk away armed with strong sexual skillsets, and even stronger vaginas'"},{"comment_id":"1620111051603386","commenter_b":"She is the problem. She is not the solution.","commenter_a":"Why would ya go through all that trouble goin through background check to legally obtain firearms when you can buy plenty of illegal stolen or undocumented firearms anywhere at any time any type sky is the limit . People make a living doin this everywhere !GUN CONTROL IS A FAIRYTALE ! A JOKE ! WASTE OF TAXPAYER S $ so don't buy into Obummers. And Hillary BS ! Think for yourself folks those talking heads are also very empty.","post_message":"“You shouldn’t be able to exploit loopholes and evade criminal background checks by buying online or at a gun show…We have to make it harder for people who should not have those weapons of war.”  – Hillary Clinton reacts to the #OrlandoShooting @webpagelink"},{"comment_id":"10154117149131491","commenter_b":"'@username let me see your nudes.","commenter_a":"18 months is not enough, in my eyes what he did was a form of sexual assault","post_message":"It all comes after private photographs from celebrities like Jennifer Lawrence and Kate Upton were leaked online."},{"comment_id":"10154259788063797","commenter_b":"Omg lol","commenter_a":"'@username looollllllll whaaatttt","post_message":"ATTN NEW PARENTS: The perfect solution to a crying infant is every parents dream. One doctor claims he has a technique that can quiet any baby.  WATCH THE FULL VIDEO: @webpagelink"},{"comment_id":"10154233484170496","commenter_b":"She's a smart woman","commenter_a":"At least she kept her yap shut","post_message":"What do you think of Lady Gaga's Super Bowl halftime performance?  PHOTOS: @webpagelink  (Photo by Patrick Smith/Getty Images)"},{"comment_id":"10154403628496336","commenter_b":"Ban all bombs - Obama","commenter_a":"Obama will call for more gun Control in Istanbul!!! It's not a terrorist attack in his eyes. Because of him these cowards are killing innocent people.","post_message":"Breaking News Update: At least 10 people were killed in the two blasts at the Ataturk Airport in Istanbul, according to the Turkish Justice Minister. @webpagelink"}]
