[{"comment_id":"10153111787816051","commenter_b":"I think girls are more likely to want to fight for what they feel at the moment and most of the time it's about nothing. Hopefully when they grow up they will become ladies","commenter_a":"Awwww. Look at that gentle giant trying to help that girl up off that park bench","post_message":"This girl was holding a baby when they surrounded her. She didn't want any trouble, but it didn't matter."},{"comment_id":"10153132008994497","commenter_b":"Conceded bitch... this shit practically writes itself. Lol","commenter_a":"This sick beat. Oh no!! Now what? Gimme a break. Never heard something so idiotic. A phrase? Boooooo!! :)","post_message":"From our sister publication:  The A.V. Club: 'From this day forward, any and all sick beats belong to Taylor Swift, under penalty of law.'"},{"comment_id":"820665888078295","commenter_b":"Silly woman","commenter_a":"Wtf? Isn't non schooling illegal (and 5... That's stupid... once they are on solids why breastfeed?)","post_message":"Neither of her kids can read as she refuses to let them go to a mainstream school."},{"comment_id":"1131957863541988","commenter_b":"Anti-Gun people are ALWAYS the least EDUCATED when it comes to firearms. The AR is light, easy to aim, and in a situation when multiple armed people are invading your home, it's the ideal tool of choice for protection. About 3 Million home invasions happen each year. How do you Anti-Gun sheep suggest people defend themselves from MULTIPLE ARMED criminals? A handgun with 5 or 6 round won't help much with 3 guys breaking into your house","commenter_a":"A killing machine? Some people really do think that if a person has a gun they are going to use it for killing people. That they are and the weapons are evil. Stupid and clueless","post_message":"It only took us 38 minutes to walk out of an Orlando gun shop with a killing machine. See for yourself."},{"comment_id":"10154683704293984","commenter_b":"Lil pussy","commenter_a":"Go Trump!!!","post_message":"Actor Brad Pitt just shook things up with a very public Donald J. Trump rant that caught everyone by surprise..."},{"comment_id":"781142075321254","commenter_b":"She should be in prison for what she's done","commenter_a":"She just needs to ask","post_message":"Would you be upset if a nurse did this to you? @webpagelink"},{"comment_id":"10153129217297377","commenter_b":"There are a couple of million people in prisons and jail right now (Google it). I'm pretty sure they were taken there and didn't voluntarily have themselves incarcerated. Don't say it's impossible. That said, I think it's improbable and impractical to plan on finding 12 million illegal immigrants as a whole and deport them. Just let them remain illegal and deport them as you find them. Let them stand in line with everybody else who is attempting to immigrate LEGALLY.","commenter_a":"I think lots of them will self deport. Especially those who are gang members and have been deported and came back illegally. Cut off benefits and the free loaders will leave. States can deport.","post_message":"'You're going to have a deportation force, and you're going to do it humanely,' Trump says."}]
