[{"comment_id":"943090809073276","commenter_b":"Why do women need to vote anyway?","commenter_a":"I would say that's higher than 44%","post_message":"Yep..."},{"comment_id":"10153393698278606","commenter_b":"The statement would they would have been fired if it was a white man is stupid,they should have been either way and the point is it wasn't, if this is the kind of judgement they you I wouldn't trust them to protect and serve","commenter_a":"It looks like two hunters with a deer...what's racist about it?","post_message":"One of the two police officers who was fired after posting this photo wants his job back: @webpagelink"},{"comment_id":"10153950585516491","commenter_b":"I really wish it had been 'Let the bodies hit the floor' by Drowning Pool","commenter_a":"What this guy have to do with music? This show is a joke nothing to do with real music talent onlyma bunch of show offs","post_message":"Michael Phelps:  'I might have a lot of gold but this guy’s got all the platinum.'"},{"comment_id":"532019336988646","commenter_b":"I'm not catching that disease from her","commenter_a":"Fuck that bitch","post_message":"Michelle Obama thinks you should do this instead of going to church.  She is a disgrace. Get her out of the White House please.  Do you agree Michelle is an embarrassment?"},{"comment_id":"10156388002150389","commenter_b":"Muslims are the problem!","commenter_a":"He was a Muslim. What else is there to know?","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"550509575137335","commenter_b":"So do it already arrest her corrupt ass because she is dangerous to our society.","commenter_a":"yeah...won't hold my breath !! 'smh'","post_message":"FINALLY..."},{"comment_id":"1720797558169853","commenter_b":"LOL.... The immigrants steal our jobs.... even our speeches!","commenter_a":"She did a great job last night!","post_message":"Join me behind the scenes at the 2016 GOP Convention -- as I introduce our next First Lady of the United States of America, Melania Trump! #MakeAmericaSafeAgain"}]
