[{"comment_id":"1296209600419509","commenter_b":"She's a evil bitch, liar, corrupt and criminal, she's in the pockets of the big business and lobbying, a warmonger. Vote anyone else but her.","commenter_a":"No shit...the rein malicious and bone headed Republican governance is hurting Business!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153619308152235","commenter_b":"'@username a racist comment about baking!?? Okay, surely you jest. You don't know what you're talking about so you're automatically excluded. @username I agree it could be seen as sexist except I am a female and bake all the time, but MORE IMPORTANTLY Men are known to be the best chefs😉. @username she didn't make any valid point when she stated 'nothing new, threats made against students daily' She's out of touch with the article and with reality if she is trying to compare unspecified kids being threatened to a RACIST threatening to kill only BLACK KIDS posing with ak47 on the school grounds!! ARE YOU FREAKING KIDDING ME!??? The generalization she attached to this comment is uncanny, disturbing, and I'm sorry RACIST in an of itself. Because the DENIAL of racism IS racism also.","commenter_a":"This is nothing new. Threats are made against students daily! We went through this last year and most kids were kept at home until the instagram poster was identified.","post_message":"Another effing beautiful day in post-racial America."},{"comment_id":"863999693637372","commenter_b":"first lady has no class what so ever id be embarrased sitting next to them","commenter_a":"michelle has the class of fergusson protesters","post_message":"“Michelle Obama looks like she’s part of the cast of...'"},{"comment_id":"1505305382822543","commenter_b":"Well i guess that's better than a illegal immigrant..","commenter_a":"Don't judge maybe that's his girl","post_message":"At least both the driver and the 'passenger' were wearing seat belts."},{"comment_id":"10153372817373812","commenter_b":"Sign me the ef up!","commenter_a":"'@username thank gawwwwd","post_message":"FDA approves new drug that claims to eliminate double chins: @webpagelink"},{"comment_id":"1338478099545268","commenter_b":"I really hate that women","commenter_a":"Like that's a surprise. ..Not at all..","post_message":"Is this how Casey Anthony paid for her defence?"},{"comment_id":"903785579812018","commenter_b":"OH BUT HE'S BLACK HE DON'T KNOW NO BETTER.SHIT HANG HIS ASS","commenter_a":"So sad","post_message":"She was shot down in cold blood and there were never any riots. This was a tragedy, and she will never be forgotten. Can we get 10,000 'LIKES' in her memory?"}]
