[{"comment_id":"1695206677435751","commenter_b":"@username totally agree! She's a waste of good breath!","commenter_a":"Bye bye!!","post_message":"ClashDaily.com"},{"comment_id":"1407318236234112","commenter_b":"@username seek help and do it quickly!","commenter_a":"@username is under investigation by the FBI, she should not be allowed to run for President or own a gun or have people hired by her having guns there are laws against organized crime and she should be put on a no fly list, but because the Government is corrupted and is allowing Hillary to sell favors to Americas enemies which is Treason she'll get away with it.","post_message":"A great day to hit the campaign trail in Ohio with Elizabeth Warren."},{"comment_id":"985183654870370","commenter_b":"She's tripping.......","commenter_a":"She got a low i.q. and a low self esteem. Your kids should come before any man. They always say a fool and their money will soon part. And soon, it will all be gone and so will he.","post_message":"The N.C. woman who won a $188 million Powerball last February is facing an onslaught of criticism after she posted a $12 million bond for her boyfriend…for the fourth time. Lamarr (Hot Sauce) McDow was arrested Tuesday for violating the terms of his pre-trial release. As NewsOne reported last year, Marie Holmes, 26, posted bond for McDow three times — once just weeks after she collected her winnings ($3 million), once in August ($6 million) and again in October after he was arrested for possession of a firearm by a felon. Is the public being too hard on Holmes? Is it any of our business what she does with her money? Let us know ----> @webpagelink"},{"comment_id":"933293176705778","commenter_b":"@username have a shitty day bitch","commenter_a":"COPS ARE MURDERERS AND MANIPULATORS","post_message":"It's been called the most gruesome case of police brutality in US history. We will never forget you, Kelly. The civil trial for the cops is about to begin. Latest update here: @webpagelink/ Video by Truth Be Known."},{"comment_id":"1837165426513406","commenter_b":"Kiss my white ass","commenter_a":"and let me tell you something about being poor we were poor when i grew up i was very lucky we had food on the table there were times we didn't have ckristmas cuz we didn't have the money so when the democraps say we dont know how it feels to be poor they are so fucking full of shit minimum wage was less was about 3.00 an hour so you people today dont know how it is to be really poor","post_message":"Black Lives Matter Co-Founder Makes SICKENING Demand For Whites To Do THIS [VIDEO]. She is a bigot, her demands are creating racial tension. Do you think she is the racist?"},{"comment_id":"931007510269923","commenter_b":"You Don't Hit a Woman,You Turn and Walk Away !!","commenter_a":"Will someone please beat this woman beater up and take away his nfl career.","post_message":"Florida State University quarterback De’Andre Johnson is charged with misdemeanor battery."},{"comment_id":"10152969053772293","commenter_b":"Well scumbags cat got your tongue","commenter_a":"It is not racism.It is about illegal bangladeshis entering every bordering country. Half of Bangladesh is in India. Burma or Malaysia are not like India.These Bangladeshis create all sorts problems from drug peddling, to prostitution, thievery, robberies, kidnapping & rapes. Recently bangladeshis raped a 70 year old nun at a church.","post_message":"A tragedy no one wants to own."}]
