[{"comment_id":"1800107736923413","commenter_b":"FALSELY MY ASS... CNN ( CLINTON NEWS NETWORK) HAS BEEN LYING TO US (WE THE PEOPLE) FOR EIGHT YEARS! ENOUGH WITH POLITICAL PROPAGANDA, ENOUGH WITH PROPAGANDA. BRING BACK JOURNALISTIC INTEGRITY OR GET THE HELL OUT OF THE BUSINESS, WE WILL NOT GO DOWN THE ROAD TO SOCIALISM. WE WILL FIGHT, WE WILL WIN.","commenter_a":"Sieg heil!!! ;-)","post_message":"A free press is a pillar of democracy. So when Trump called CNN \"fake news,\" this Fox News anchor chose to stand by his fellow journalists."},{"comment_id":"1686879181550201","commenter_b":"It had to be a woman. Why couldn't have just come up with a $3 bill. Leave well enough alone.","commenter_a":"Of all the really great black statesman the US has ever produced, wonder why they didn't pick Frederick Douglas, MLK? Oh yeah, they were republicans and Douglas said any black that would vote democratic was an idiot. Of course people are so ignorant now I have read where people have stated the democrats drew up the legislation for the civil rights act, in reality passed by a republican congress with a reluctant Democrat, Johnson signing it. Ignorance abounds","post_message":"BREAKING: OBAMA SUCCESSFULLY WHITEWASHES AMERICAN HISTORY…”Racist” President Andrew Jackson To Be Replaced With Harriet Tubman On $20 Bill"},{"comment_id":"683458785174693","commenter_b":"No Whoopie it's the exact OPPOSITE!!!! We did our homework on Corrupt Lying Criminal Killary Clinton and her open border policies and that's exactly why we voted TRUMP!!! Dumbass Racist!","commenter_a":"You didn't do yours.","post_message":"Whoopi Goldberg just scolded millions of Americans on The View. Apparently if you voted for Trump, it's because you \"didn't do your homework\" on Hillary."},{"comment_id":"422994894562852","commenter_b":"All but trump need to drop out and quit wasting money! Hell give it to the vets and homeless! Trump!!!!!!!!","commenter_a":"Mitt Romney will hurt Marco Rubio campain, please do let him","post_message":"Help or hurt?"},{"comment_id":"10153607710971336","commenter_b":"Stfu pussy","commenter_a":"How stupid do you have to be to do something like this?? Idiots!","post_message":"One student “thought seriously about going back home” after seeing the signs."},{"comment_id":"1876818559213436","commenter_b":"If NFL can't support National Anthem, then we can't support NFL or anyone else that can't support the Anthem.","commenter_a":"Back to Africa with him!","post_message":"NFL National Anthem Protests Sink TV Ratings To Five-Year Low Week Six!!! They had the chance to make things better but are allowing thugs to dictate their business.... KEEP BOYCOTTING!!! MAKE THEM PAY!"},{"comment_id":"618929588274862","commenter_b":"No one is now or ever has been against immigrants. It is ILLEGAL immigrants who are the issue.","commenter_a":"Republicans so easily forget that we are a nation of immigrants.","post_message":"WOW. Presidents Reagan and Bush Sr. sound an awful lot like Democrats in this 1980 debate... Video by Occupy Democrats, LIKE our page for more!"}]
