[{"comment_id":"10153885822754087","commenter_b":"Lmao.. She's a moron","commenter_a":"@username hysterical","post_message":"Hillary Clinton took things a bit too literally during a recent campaign stop when she read the word “sigh” off her TelePrompTer instead of actually doing one. WATCH:"},{"comment_id":"10152924363976130","commenter_b":"I picture the admin of this page, a fat whiney crazy feminist that hates life because the wine ran out, and because a man opened a door for her.","commenter_a":"How many women believe everything that men tell them?","post_message":"\"Generally speaking, we (men) do not believe things when they're told to us by women.\""},{"comment_id":"1022890011112195","commenter_b":"well people you all know by now that the illegals are who and what is at the top of being cared for first and they receive what our own Military should be getting as well as the American people our men and women who risk their lives are just a # and after thought and these actions begins with THE PRESIDENT OF THE UNITED STATES who has no respect for any Military or the American people , prayers for all who serve and have served and and fought for this great Country and our freedom and what we stand for we need to clean out the Government offices starting with the WH oval office we need a real man put in that position one that will help America not destroy it","commenter_a":"its in my tat","post_message":"NEVER FORGOTTEN! The voice of the people"},{"comment_id":"515071932006619","commenter_b":"you make a good argument eugene. historically the philistines controlled the coast of israel. the jews the interior. but after the romans any historian would agree the jews were not a player in the region. after 2000 years i think the claim of europeans to the region is moot. its like me saying i should have land in ireland taken from my ancestors by the english,or land in france taken by the catholics. its not valid and if the united states funded a military machine to take back those places i think it might be wrong.. prior to world war 2 the jewish population in palestine was a distinct minority. the subjugation of the place by european jews was rubber stamped by the west but never ok with the people of that place or any country near it. israel currently recieves billions from the american taxpayer to operate their apartheid ...","commenter_a":"that mosque was in palestine. europeans invaded the country,committed genocide to steal it and now you sit on a high horse and judge the indigenous people it was stolen from because you are ignorant of history or a hypocritical shill.","post_message":"Such extremism isn’t limited to out-of-the-way mosques where radical clerics operate in the shadows. It is occurring in mainstream and leading mosques world-wide, including at one of the most important religious institutions in Islam, the Al Aqsa mosque in Jerusalem."},{"comment_id":"908657265920023","commenter_b":"I remember when NASCAR used to be a great sport. You screwed it up Brian. You should've a politician. You took a gold mine and destroyed it. Take a look at the last Bristol race.","commenter_a":"Stopped watching Nascar when Dale died, not surprised at all.","post_message":"Will NASCAR fans support NASCAR chief Brian France's \"behind the scenes\" political efforts on behalf of the transgender bathroom movement?"},{"comment_id":"1065530533487804","commenter_b":"And yet she's still nasty as hell.","commenter_a":"I am a fair-skinned caucasian with vitiligo. I have always been grateful that my light skin color kept it from being as apparent as it is on a person with dark skin. I applaud the openness, but I find it interesting that the earlier pictures had the vitiligo spread on her face much more widely and less symmetrically.","post_message":"Here's a story for anyone who's ever hated feeling different — aka a story for everyone. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"398269070297688","commenter_b":"Deport them back to their country. They donot deserve being here in USA. NO BENEFTS TO THEIR FAMILIES.","commenter_a":"This is fucking hilarious I fucking hate the prison system, just a cash grab for our taxes anyway I want to see more of this plz illegals do your worst I am laughing so hard right now","post_message":"This is not a good image for those who are trying to support the rights of illegal aliens."}]
