[{"comment_id":"10153242088138132","commenter_b":"Pretty sure you have to have virgin hair","commenter_a":"Well I just got my hair colored and cut. I'm sure it will be on the front page by Monday. Hehe","post_message":"Love it or leave it?"},{"comment_id":"10153563435706162","commenter_b":"This is some shady bull. Why was she even in jail in the first place? That I'm not understanding she was pulled over for not signaling a lane change? How did she even manage to be asked to get out of the car or get out of the car to assault an officer? I wouldn't have gotten out for that violation right me my ticket or let me go period point blank. I would be respectful but i wouldn't let them take advantage. She should have not been in jail in the first.","commenter_a":"Abc won't let this go. Must be a good day to hate on the police. Even though there is only evidence she killed her self.","post_message":"Her primary cause of death was \"hanging.\" Family and friends want to know what happened to a Naperville woman found dead in a jail cell, after she was pulled over for a traffic stop while on a road trip with her mom: @webpagelink"},{"comment_id":"1782119588705977","commenter_b":"@username Dumbocraps can't read. They need pictures.","commenter_a":"never once have I cared or wondered \"What would Eric Trump think?\" about... anything.","post_message":"Donald J. Trump's son thinks that his tax returns should stay private."},{"comment_id":"471958379619606","commenter_b":"People like carl can't help themselves... He is a result of stupid people having children.... they raise more stupid people... in turn that have more children.....which sadly are unleashed on the rest of us..... It's and incredible and sadly unstoppable event...... OR its that he has to call his mommy Aunt Mommy and his daddy Uncle Daddy... Showing us why incest is illegal... . either way they unleash these morons on the rest of us to deal with....","commenter_a":"Wow talk about prostituting your site @username. Look what I found as an advertisement on your story.","post_message":"Unbelievable."},{"comment_id":"1244441208928501","commenter_b":"@username, women can't do anything they want to men. Are you saying that because you can't get laid, you should be allowed to kick a woman down the stairs?","commenter_a":"There's no excuse for this. No, none whatsoever. #MisogynySucks #EndViolenceTowardsWomen #TreatHerKindly #TreatHerWithDignity #TreatHerWithRespect Only a #Caveman would do that.","post_message":"A man in Berlin kicked an unsuspecting woman from behind, sending her flying down the stairs."},{"comment_id":"928764863812971","commenter_b":"She would be a nightmare! She can't even run a business.","commenter_a":"No.","post_message":"It's official."},{"comment_id":"10153250521056509","commenter_b":"It's not just FL, horrible people live everywhere...","commenter_a":"Why does so much f*d up sh*t happen in Florida!?!?","post_message":"A 5-year-old Florida girl was killed after her father tossed her off a bridge from his car, police said Thursday. @webpagelink"}]
