[{"comment_id":"10153728692094117","commenter_b":"Lol pussy","commenter_a":"Reason can go fuck itself. If you are a pro-Trump libertarian, like my page.","post_message":"\"You know−the Constitution−there's nothing like it. But it doesn't necessarily give us the right to commit suicide, as a country, OK?\""},{"comment_id":"1261193330568342","commenter_b":"George Papasotiriou","commenter_a":"Bruce Cada","post_message":"Here's what it could mean about your brain."},{"comment_id":"10153410521706336","commenter_b":"She is so dirty.","commenter_a":"Wonder why .. lol","post_message":"New documents released by a federal court show President Barack Obama called then-Secretary of State Hillary Clinton on the night of the 2012 Benghazi attack – but the contents are being withheld by the U.S. Department of State."},{"comment_id":"1099239800197691","commenter_b":"Brave Women! I hope they don't beat you with a shoe!","commenter_a":"Yet, elsewhere they are romanticizing misogyny.","post_message":"Women in Iran risk prosecution if caught contravening the ban, which was issued by Supreme leader Ayatollah Ali Khamenei."},{"comment_id":"10153412861986167","commenter_b":"A bunch of false prophets and their followers, sickening.","commenter_a":"First of all, for those who wish to criticize my typos complain to google translate. I'm dictating this and I don't have time to go back and correct typos. When it comes to SOCIAL ISSUES, topics like gun control, abortion, gay marriage etc voters who latch on to these things miss the big picture. The big picture involves having a viable economy in which to have debate about social issues. An economy cannot survive on social issue focus. It is a fact that 70% of all entitlement Dollar goes to bureaucrats not to the poor. @webpagelink To this day paychecks from the government are being dispersed to illegal immigrants, prisoners and dead people. There are perhaps hundreds to thousands of programs that have been budgeted by the government which always end up taking longer to implement and always cost more than expected. Under Hillary Clinton and Obama, six billion dollars ...","post_message":"He also thanked the star of Duck Dynasty."},{"comment_id":"10152863643681990","commenter_b":"Illegal immigrants should not be here to commit any crime. U. S. Citizens do not need the extra concern.","commenter_a":"Yes look at Dyllan Roof he looks Latino... He shoot 9 black people last month in church.","post_message":"IMMIGRANTS AND CRIME: Despite rhetoric in the Pier 14 shooting Francisco Sanchez case, immigrants do not commit more crimes that U.S. citizens. That's according to 100 years of research according to the American Immigration Council. @webpagelink"},{"comment_id":"10153912123821409","commenter_b":"Wow she should be kicked out for that!!","commenter_a":"You signed on the dotted line !! Hate to break it to you . Your job is to protect the freedom of this great nation. To bad you will be in the brig CHILE !!","post_message":""}]
