[{"comment_id":"456730087850905","commenter_b":"This is a no-Brainerd! Of course it should be banned!","commenter_a":"Yes","post_message":"Should Shariah Law Be Banned In The US?  Comment 'yes' or 'no'."},{"comment_id":"10154184705448525","commenter_b":"Yes, she meant for the child to nearly be injured. It was totally on purpose! What a horrible, horrible mother! We should prevent her from ever reproducing again! Period!!!!!!","commenter_a":"That is not considered an accident!!! That is carelessness and neglect of protecting your child. Plain and simple truth. Period!!!!","post_message":"IT ONLY TAKES A SECOND: This big brother is a hero after racing across the room and catching his baby brother as he falls from the changing table! Their mother hopes this will serve as a reminder to others to remain vigilant - always. Read more: @webpagelink"},{"comment_id":"10153918680501116","commenter_b":"Mexico take Texas, we will throw in the theocrats for free!","commenter_a":"So much for Hamilton and Madison's half baked notions about \"representative\" government. How I wish California would secede from this corrupt Union...","post_message":"But Republicans are sticking with him."},{"comment_id":"10156543098270354","commenter_b":"So he opens the gates to let them in and then starts deporting them. I smell a RAT.","commenter_a":"Great but post it on obama and hillarys pg","post_message":"Obama Photo-Op Head Fake.  Don't Believe the Hype..."},{"comment_id":"572406196218003","commenter_b":"@username bigotry people?!? First learn to compose a literate sentence, then read your comic book.","commenter_a":"Unfortunately, anti-gay bigots never seem to go away since we're still dealing with them 40 years later. When will we, as a people, learn to stop hating people who are different than us?","post_message":"TV's \"All in the Family\" was way ahead of its time.   Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152974175586130","commenter_b":"So much prettier than the trashy thong suits of today.","commenter_a":"Courtney Kelley Michler","post_message":"Gorgeous!"},{"comment_id":"1382876735088925","commenter_b":"This bitch is evil","commenter_a":"I bet bin laden isn't dead. !","post_message":"THIS IS ABSOLUTELY HORRIFYING!"}]
