[{"comment_id":"1272162789512502","commenter_b":"She couldn't pay me enough, so I know Trump never tried. What a wrinkled up hag.","commenter_a":"They were all paid of course","post_message":"BREAKING! Newly leaked information shows Jessica Leads, who's accused Trump of raping her, has VERY CLOSE ties to Clinton Foundation.  This is NO COINCIDENCE! The timing of these accusations with these new facts about Leeds are TOO HARD TO IGNORE!!!!  Let's get 3,000 SHARES to spread the TRUTH about these rape accusations against Trump!"},{"comment_id":"10154414118997042","commenter_b":"Exactly, she's just a trophy Wife to Donald anyway.","commenter_a":"Mealania Trump's If she only had a brain","post_message":"Melania Trump is being accused of plagiarizing from Michelle Obama's 2008 Democratic National Convention speech.   Judge it for yourself:"},{"comment_id":"10153866679791002","commenter_b":"This is what happens when the majority of nursing moms thinks it's ok to expose their breasts while nursing. No, use a cover please. Yes, it's natural and better for your baby, but that's still a nipple being shown to the public...","commenter_a":"I don't think John was saying that children should be denied a family fun day. But, he is right, when the children are hot and fussy, they are no longer enjoying the event. They are miserable and they are making the person next to them miserable and you too. That's not fair to your child or the patron sitting next to you. I know parents want to see the rest of the game but, that's one of the sacrifices we make for our young children. Changing a soiled diaper in such close proximity is rude and plain nasty!","post_message":"The Cincinnati Reds are opening a nursing suite at their stadium for nursing moms who want to feed their little ones during the game.  Do you think the Detroit Tigers should have something like this?"},{"comment_id":"10153843965931336","commenter_b":"Great va is screwed bc dc is so close no refugees should be allowed period","commenter_a":"Wow, it was 24 a few hours back. Looks like a rebellion.","post_message":"LATEST: 30 U.S. governors are now opposing or refusing to allow Syrian refugees into their states. @webpagelink"},{"comment_id":"10154207452564916","commenter_b":"Ever hear of Independents? You know, 45% of the voters.","commenter_a":"And just where are all you threatening to leave the Dem party going to go? Good luck with that one.","post_message":""},{"comment_id":"10152534767705047","commenter_b":"Revoke their passports and citizenship! Traitors should not be allowed to live here !","commenter_a":"Amen","post_message":"American citizens must not be allowed to fight alongside jihadists, only to then return to the U.S. to spread jihad here.   Sign & Share our petition to protect our homeland:  @webpagelink"},{"comment_id":"1747479275473588","commenter_b":"Fawwwwwk no cuz that proves a bih can't cook fr😩😩😂😂😂","commenter_a":"@username some shit you'd do😂😂😂","post_message":""}]
