[{"comment_id":"1110994785663439","commenter_b":"All Hillary does is pander and shift her views to what's convenient for her.","commenter_a":"Democrats should Support Democrats , Bernie isn't a Democrat only in convenience, Playing basketball doesn't and shouldn't mean you support Minorities, where you live is who you are and in Vermont Bernie is 91% White?","post_message":"JUST IN: The Congressional Black Caucus PAC endorses Hillary Clinton for president."},{"comment_id":"10153442947898908","commenter_b":"This is wrong. I can just tell you it is wrong because of decay and expansion. We know that the universe was something different even if that was just a tiny speck. The way the article reads as if the universe has always been the way it is now and that is not the case. All these bible thumpers who don't understand basic science or astrophysics will use this to try to say God is real.","commenter_a":"the end is the beginning.... the beginning is the end...","post_message":"This is a tough thing to wrap your head around."},{"comment_id":"10154376259328797","commenter_b":"Trust and believe it's lot more white women chasing black men. Even the ones that fool you into thinking they don't. What I see in the backroom of my job is hilarious! Then they go home and kiss their racist white husbands and little bundles of joy. lol","commenter_a":"A group of disgusting tramps that will suck a black man dry.","post_message":"OFFENSIVE PHOTO: A school district is taking disciplinary action after a photo of students spelling out a racial slur with T-shirts showed up on social media."},{"comment_id":"369671676554460","commenter_b":"Of course we pay for her boobs because we pay for all the boos in Washington","commenter_a":"This is disgusting and she should be kicked out in the cold! Taxpayers pay for this fraud nd sh should be removd from all social welfare programs! He doctor should never be able to bill this type of fraud.","post_message":"This Parasite... Unbelievable."},{"comment_id":"10157706187460354","commenter_b":"She was a joke","commenter_a":"Thud... Rolling stumble... Face plant. \"Humph, that pit of lies I just tripped on was not clearly marked.\"","post_message":"Did you HEAR what Hillary said at the Commander-in-Chief Forum?!"},{"comment_id":"10153308437364877","commenter_b":"In the words of Redd Foxx \" you big dummy \"","commenter_a":"DF really??? And Ya'll all over Kanye this morning???? BEAHAHAHAAAA","post_message":"NEW ORLEANS (AP) — Former President George W. Bush returned Friday to New Orleans — the scene of one of his presidency's lowest points — to tout the region's recovery from the nation's costliest natural disaster on the 10th anniversary of Hurricane Katrina."},{"comment_id":"769122743278303","commenter_b":"Your right just little bitches","commenter_a":"Three armed thugs couldn't handle one 67yr. old man. Punk ass b!tches, take note; One responsible, LEGALLY armed American Citizen is better than three worthless, no job pussies with mothers on welfare with multiple kids from multiple donors. And they wonder why they get shot.","post_message":"Thugs Attack Little Girl, Grandpa Immediately Blows Them Away With Shotgun. Thank god for the 2nd amendment. Let's show him our support. Can we get 75,000 'LIKES' for this grandpa?"}]
