[{"comment_id":"10154186390606336","commenter_b":"Just stop. Women are not physically equal to men.","commenter_a":"They should open up the navy seals to women","post_message":"✓ 36-mile race ✓ 8-kilometer swim ✓ 25 obstacles   Her reason for completing the race? She was bullied in school. (CC: U.S. Navy)"},{"comment_id":"10153184020474726","commenter_b":"What a disgusting a hole.","commenter_a":"what a piece of dog feces","post_message":"\"He didn't win, did he?\"    Harry Reid confronted on his lies, with no regrets."},{"comment_id":"530887710369602","commenter_b":"fuck that cunt","commenter_a":"@username explain this","post_message":"Thoughts?"},{"comment_id":"994048267321588","commenter_b":"Yes. And paid for by private donations","commenter_a":"Gorgeous yet not gaudy. Most important: Everything was Made in the USA . Wasn't it?","post_message":"Michelle Obama blows $600k on ‘modest’ dining room makeover"},{"comment_id":"1017808354978885","commenter_b":"This is bullshit lady","commenter_a":"Trump is no different than isis and we need to recognize the radical christians in america trying to take our country.","post_message":"After today, when Trump said he would ban ALL Muslims from entering America (even Muslim-Americans who just happen to be traveling overseas) it's easier than ever to see the frightening similarities.  Image shared by Occupy Democrats, like our page for more."},{"comment_id":"819559654746124","commenter_b":"PS I certainly hope he doesn't think he's in the same league as Martin Luther King he's not fit to carry his shoes","commenter_a":"MLK Jr. Yes, Al Hell No !!!","post_message":"Martin Luther King, Jr. was a principled Christian who stood for his morals and convictions when fighting the Jim Crow in the Democrat-controlled South. For his courageous efforts, he paid the ultimate price.   Do you support MLK, Jr. and oppose Al Sharpton?"},{"comment_id":"10155930528244657","commenter_b":"Little brat!","commenter_a":"Disgusting beyond words!","post_message":"Even kids are joining in on the protesting."}]
