[{"comment_id":"10153534802752217","commenter_b":"It's knowledge obviously. Go look up the definition of Asylum if you are that uneducated @username","commenter_a":"They are all migrants, NOT refugees if they didn't claim asylum in Greece or Turkey for that matter. Your reporter needs educating.","post_message":"More than 11,000 refugees and migrants are camped on the Greek side."},{"comment_id":"10153808334131337","commenter_b":"Y should people have to log out of FB cause they don't like her?","commenter_a":"If you don't like her and don't like hearing about her then I don't know keep scrolling, log out of Facebook, go on about your life!","post_message":"Oh, sure, Kim Kardashian West..."},{"comment_id":"1158796597473702","commenter_b":"She was having a PRIVATE conversation with her son! It is no one else's business!!!! She quite clearly stated she speaks English!!! Read the article people!!! So stating that immigrants should learn the native language in this situation is redundant!","commenter_a":"We speak many different languages in America.","post_message":"The woman was speaking with her son in Spanish while celebrating his birthday when a stranger interrupted to tell them, \"We speak English in America.\""},{"comment_id":"712691792254732","commenter_b":"Nothing going to happen to the bitch, cannot wait for her and Mr Muslim to be out of White House....","commenter_a":"The American people were fools to ever put them in the White House . Now we have to find a way to get them the hell out","post_message":"Michelle Obama facing hug charges after being enveloped in lawsuit. Good it's about time. She couldn't get away with this. Do you think Michelle Obama is a criminal?"},{"comment_id":"10153321594333812","commenter_b":"Hahahahahaha","commenter_a":"what strong messages? I thought she deleted all her messages. lol","post_message":"President Obama says Hillary Clinton will have \"some strong messages to deliver\" if she runs for president. @webpagelink"},{"comment_id":"468340716665733","commenter_b":"I suppose those of you refusing to vote for him because of vaccinations would rather live in a socialist regime under Hillary.","commenter_a":"Yes!!!","post_message":"Will you stand with me. Together we can take our country back! @webpagelink"},{"comment_id":"10157177074000354","commenter_b":"And she will continue where he leaves off","commenter_a":"We've had more terrorist attacks on our soil during the Obama administration than on GW Bush's watch. I think Obama is doing a fine job of recruiting terrorists.","post_message":"So the basis of Hillary Clinton's corrupt candidacy is that she is more popular with terrorists? WATCH:"}]
