[{"comment_id":"10156321873895725","commenter_b":"Global warming is responsible for baby dick","commenter_a":"iIN United States there plenty terrorist as illegal immigrants driving yellow taxi in the cities of United States taking the jobs from American people and ready to do bad things to us here that's why we need DONALD TRUMP to deport all of them","post_message":"As President of the United States, my top priority would be to keep America safe & strong! Thank you for your support."},{"comment_id":"1583527538618276","commenter_b":"Muslims please go back to your hell hole, you only make demands, cause problems , and bring terror","commenter_a":"You have freedom of religion in this country not freedom to shove your beliefs on others.","post_message":"They're not afraid of offending anyone, they stand behind their beliefs.  Do you agree with Lowes?"},{"comment_id":"1093795067333572","commenter_b":"Suck it.","commenter_a":"He means defying the will of the people is what the campaign is about. Hillary has the popular vote and delegate lead. #dropoutberniesanders","post_message":"TONIGHT: Bernie Sanders on continuing his fight for the Democratic nomination: \"Defying history is what this campaign has been about.\"  @webpagelink"},{"comment_id":"1590050817948698","commenter_b":"Hey, Justine. Did you know that the Quran teaches Muslims to kill you and I? If you think that's religious freedom that Christians should be tolerant of when they come to kill you I'll be happy to tolerate it, but when it's my turn I'll handle it the old American way.","commenter_a":"No America was founded on Christian values","post_message":"Barack Obama continues to show his Muslim roots..."},{"comment_id":"10153288097452629","commenter_b":"Hmmm. But I'm mixed so do I only get 5% off?","commenter_a":"Ariel help the world is blind","post_message":"If you love BBQ (and you're white), June 11th is your lucky day."},{"comment_id":"10155599498156002","commenter_b":"@username illegal aliens can't collect welfare...good God, woman....read....","commenter_a":"If they are illegal they need to go ! Immigrants are welcome legally!! NOT Illegally ! Why is this so hard for people to understand this!","post_message":"BREAKING: Trump administration considers mobilizing as many as 100,000 National Guard troops to round up unauthorized immigrants.  UPDATE: White House and Dept. of Homeland Security deny AP report on draft memo for Nat'l Guard deployment for immigration round-ups."},{"comment_id":"1334326533266897","commenter_b":"For the first time in American history a foreign hoe for first lady","commenter_a":"I wouldn't be Melania - even for a billion dollars!! I lived with a narcissist. She has my pity! I'm sure she is paid well to stay with him, and her frozen Botox face and designer wardrobe says it all.","post_message":"Politics aside, Melania Trump's modeled some winning looks on the campaign trail."}]
