[{"comment_id":"10153446320724087","commenter_b":"I want a woman too, but not a liar, cheap, and a phony","commenter_a":"Fuck no to Hillary. Hell yeah to Feel the Bern!!","post_message":"“It’s imperative that you vote. I want you to vote for [Hillary Clinton]. It’s time for women to be seen as real equals,” soccer hero Abby Wambach said at an event for the Democratic front-runner. “That is one hell of a badass woman in my opinion.”"},{"comment_id":"10153462530999255","commenter_b":"The Chinese will be happy to take its place!","commenter_a":"Is that dog shittin in the flag. Thats just wrong just wrong.lol","post_message":"You don't see Nazi memorabilia on the Antiques Roadshow for a reason."},{"comment_id":"775573792575801","commenter_b":"@username bitch","commenter_a":"Nope. It was an error. The correct winner was announced. I disagree with Donald on this one. Life isn't always perfect and mistakes happen... The girl that was first announced should be proud that she came in second and briefly got to feel what it was like to be first. #stuffhappens","post_message":"Well........."},{"comment_id":"10153003248257383","commenter_b":"And boot bitches like you.","commenter_a":"I wonder how many of you bitching about Audie Murphy are going to do something about getting him a day. He did a good job, told a good story, and Texas is proud of him. Get your panties out of a bunch and carry on.","post_message":"There is now an official 'Chris Kyle Day' in Texas."},{"comment_id":"10152660058432452","commenter_b":"Why should your taxes pray double to kill her","commenter_a":"Forgive her. Two wrongs will never make a right...","post_message":"The execution of the first female in Georgia in 70 years was on hold as the U.S. Supreme Court reviewed last-minute arguments by her lawyers that they hoped would persuade the nation's top justices to grant a stay. abc7.la/1M2tBxU"},{"comment_id":"401855663336061","commenter_b":"She is an idiot like Obama","commenter_a":"They are both TRAITORS and need to be dealt with.","post_message":"Watch - Mrs. Obama said that a celebration like the one marking the Iranian New Year is part of the “traditions that make us who we are as a country.”"},{"comment_id":"1390819424294656","commenter_b":"Esta es la barbaridad de el aborto La Nina nacio viva, y la dejaron morir.Dios va a traer juicio , sobre todos los que derraman sangre inocente.","commenter_a":"That's not an abortion,that's disgraceful","post_message":""}]
