[{"comment_id":"10156234250125192","commenter_b":"Nope she belongs to a group.","commenter_a":"I think a gofundme acct should be set up for HER bravery for standing up for our children. (In my case grandchildren). This testing bs in today's teaching in beyond rediculous. The \"common core\" math is crazy. My 12 yr old grandson just got a low grade in math and son in law said he doesn't understand it. There are mire letters than numbers in his math class. He is getting what we had in advanced 12th grade and it is just too difficult for that age to understand and too busy testing for tests to see what he doesn't understand. I pitty Florida kids in public school. Something needs to change before we lose more teachers like this. Please start teaching our kids to love learning and let our kids learn to love learning.","post_message":"A Polk County teacher recently resigned, citing what she calls 'educational malpractice,' resulting from too much standardized testing:"},{"comment_id":"1039384902787653","commenter_b":"Wow! Just listen to some of the crazy sh*t that this woman is saying! Talk about freakin' scary! Someone needs to go get her, put her in a straight jacket and lock her up! She is dangerous to herself and others around her! Saying Obama is the antichrist?? Have no clue where this kind of idiot gets off saying the things she does but if I were the CIA, I would be kicking her door down and taking her to GITMO...where she clearly belongs.","commenter_a":"REALLY?? Look I'm half German and spend a lot of time there. Yes it's difficult times there and a clash of civilizations so to speak.but to package this as a massive multicountry deliberate planned invasion of extremists is ludicrous. What is true is that Western Europe in its liberalism has forgotten it's Christian faith and there is a faith vacuum. Alberi wieder des Infoax viel dies Michael Lenz","post_message":"This woman is BUCKETS full of crazy!"},{"comment_id":"931527210240361","commenter_b":"and why do women wear make-up? Hmmmm . . . .","commenter_a":"What a gent.... NOT!!","post_message":"Look on the face of woman as Lewis Hamilton sprays champagne in her face says it all."},{"comment_id":"10153166814916770","commenter_b":"Crook!","commenter_a":"Keeping it in the family.","post_message":"As secretary of state, Hillary Clinton sought to help a friend of her wealthy hedge fund son-in-law who was seeking a meeting with the State Department and Clinton herself to discuss a deep sea mining he had invested in."},{"comment_id":"849277451776263","commenter_b":"im glad he was never my minister...and oprah needs to get the heck off television and go to another country and spread her crap","commenter_a":"The Bible does Not Change over Time. God put forth his Word to his People. He is the Same today as he was Yesterday. She should Read the Bible and see what Gods says.","post_message":"Oprah asked former megachurch pastor when Christianity will embrace gay relationships.  His answer seemed to take her by surprise."},{"comment_id":"10152826928132061","commenter_b":"Happy Mother's day!!!! Smart women.","commenter_a":"I'm so glad that the person taking the order was ALERT!","post_message":"Woman held hostage with her children alerts police of hostage situation through Pizza Hut app. abcn.ws/1F5PzSV"},{"comment_id":"10152871964481491","commenter_b":"Says the woman whose profile pic looks as if she is in drag!!!! You should never talk about anyone's looks!!!","commenter_a":"Quit posting this, she isn't even a woman, so stop it","post_message":"“You’re too young for a 51-year-old!”"}]
