[{"comment_id":"524518094380814","commenter_b":"Planned parenthood another way of saying murderous selfish bitch, or greed doctor. I think both. Revoke the doctors licences, and any woman getting an abortion gets a hysterectomy too. If you're willing to murder your own child once you don't deserve the privilege to have any at all.","commenter_a":"Hillary’s claiming credit for Planned Parenthood’s selling of fetal body parts. She says it’s a real money maker, and the only way she’s able to afford Starbucks....","post_message":"The top Planned Parenthood doctor whose face is all over the Internet because of an undercover video otherwise has left little mark on social media or elsewhere on the Web."},{"comment_id":"10154394638207042","commenter_b":"Christianity in mind? But what Christianity type of Christianity was happening through the genocides..? Lol never been to prison or even arrested but thanks for the weak statements 😁","commenter_a":"Crosses don't belong in public spaces much less public institutions. If you truly believe in your faith, symbols and manmade objects shouldn't matter. Actions and kindness to your neighbors should be more than enough of a display.","post_message":"CROSS COVER-UP: After one family's complaint about a cross displayed on a public school in Staten Island, it was covered up. Now, a community is outraged.   Do you think it should have been covered?"},{"comment_id":"536114256579154","commenter_b":"the only thing she needs to do is run straight out of this country.....begone.","commenter_a":"I thought Its name was Michael","post_message":"Michelle Obama could be running for president.  This is a joke. She needs to keep her mouth shut.  Do you agree Michelle Obama is a joke?"},{"comment_id":"1164591366914667","commenter_b":"Texas, enough said.","commenter_a":"Try to keep your vagina in your pants \"Ladies\"","post_message":"The closing of safe, clean clinics across the state has brought the back alley abortion back to Texas."},{"comment_id":"10156788493850389","commenter_b":"My family and friends in Utah are behind Trump!","commenter_a":"Please Utah vote Trump!! He cares about We the People.","post_message":""},{"comment_id":"10153902236123812","commenter_b":"The native Americans should have stopped accepting immigrants. They wouldn't have lost millions of life's by those terrorist immigrants!!!","commenter_a":"ISIS doesn't need to be in America. Has everyone forgotten about the mass shootings that happen almost every day now? They can easily recruit here and never step foot on American soil. Blind hatred is still hatred.","post_message":"LATEST: Mississippi joins Ohio, Florida, Illinois, Indiana, Louisiana, Arkansas, Michigan, Alabama and Texas in refusing to accept Syrian refugees in wake of #ParisAttacks."},{"comment_id":"10154093101217452","commenter_b":"OMG. You must be a plant. No one could be that ridiculous.","commenter_a":"We are no longer fighting soviets obama. Russia is a friend in the war against ISIS.","post_message":"\"Ronald Reagan would roll over in his grave.\""}]
