[{"comment_id":"494998494021091","commenter_b":"Probably because nobody wants to get that shit all over their car. I know I wouldn't.","commenter_a":"Diane Abramson, seriously, how has nobody \"accidentally\" run over Cruz in a crosswalk yet?","post_message":"The man behind Donald J. Trump's Muslim ban is on Ted Cruz's list of trusted experts."},{"comment_id":"10153438703061130","commenter_b":"A FEMINIST is for EVERYONE.","commenter_a":"this woman is a complete poser. she does not stand with all women. just ask conservative women orgs","post_message":"\"Saying something is almost always better than swallowing it and then thinking about it for two days.\""},{"comment_id":"614554242047139","commenter_b":"And Bill's a natural player , what a fraud the Clintons are .","commenter_a":"ring a ding, a ding ding, blow it out his smarmy lying blowhole!","post_message":"\"She's a natural leader, she's a good organizer, and she's the best darn change-maker I ever met in my entire life.\" President Bill Clinton said Hillary Clinton is \"worth every single year she's put into making people's lives better.\""},{"comment_id":"1825166017710828","commenter_b":"BUILD THE WALL!!! Go Trump","commenter_a":"Trump now has my vote. This lawlessness has to stop. There is nothing racist about wanting to enforce laws that apply to everyone. I do hope he can be talked out of the wall though. We need improved cooperation and relations with Mexico. Not a big wall dividing us. Both countries need to crack down on crime and make sure people moving between the two countries do it legally. Only way to have a civilized society is to enforce the laws. If laws are unfair, let's change them. But let's do it legally and civilly. Trump is not the racist monster that the liberal propaganda machine makes him out to be.","post_message":"\"Hundreds of cars were forced to make a U-turn less than three miles from a Donald Trump rally today after protesters parked in the highway to block Trump supporters from reaching the event.\""},{"comment_id":"899984393370316","commenter_b":"Muslims offend me so throw them out","commenter_a":"Perhaps if the Muslims are so unhappy w/ their environment they might want to go home where they won't have to deal w/ such inconveniences. Furthermore, I hope the Smith family doesn't give up their spare lot. I'm so sick of the non-Muslim world walking on egg shells for these folks. I doubt their mother country would give on one issue to accommodate my American, Christian values if I had the misfortune to relocate to their country. Why are we constantly caving to these folks!?","post_message":"Pathetic! (MUST READ)"},{"comment_id":"10153277427691756","commenter_b":"Bitch","commenter_a":"@username: 28 years too late","post_message":"They can reshape within weeks."},{"comment_id":"10154403030526523","commenter_b":"@username your a pussy.","commenter_a":"TRUMP IS A FLAMING HOMO","post_message":"President-elect Donald Trump responds to a new poll from CNN/ORC which found that he has an approval rating of just 40% ahead of his Friday inauguration. @webpagelink"}]
