[{"comment_id":"978935178808244","commenter_b":"Good. She looks like a menace.","commenter_a":"hey asshats...it was a 12 year old..not 2 year old....daddy put her in harms way......","post_message":"BREAKING NEWS! Police just SHOT AND KILLED a 12-year-old girl while evicting her family from their home!   Help us SPREAD THE WORD because the #MainstreamMedia is not TOUCHING this!  From >> Counter Current News for the latest!"},{"comment_id":"10153018136071130","commenter_b":"I think ikea is a great test to the relationship for sure. I've gone with many friends who argue with their SO the whole time, who later break up... Whereas me and my bf of almost 10 years have gone together many times and have a blast","commenter_a":"Jacob opppsss","post_message":"Attention couples: this store will make you want to kill each other."},{"comment_id":"10154282807343984","commenter_b":"You need to think about the children you putting in danger ,it would be taking advantage of !!!!!!! NC don't back off","commenter_a":"@username my head hurts over all the rucus about this law. My suggestion was to make it ALL about bathrooms and leave the employment issues out of it. I was happy to see he is still standing by his decision to keep bathrooms limited to the actual sex you are physically. I have been amazed by the number of employers threatening to leave and all the other boycotts. At least I still don't have to worry about a man walking into the friggin ladies room. Urghhhhhh","post_message":"North Carolina has come under INTENSE criticism lately for its stance on the LGBT community. After weeks of outrage, the state's governor has just come out with a stunning announcement that ANGER many Americans.  Do you support North Carolina's governor?"},{"comment_id":"10154357788051509","commenter_b":"Escape to Germany or Sweden for safety?! Really?! Do not keep up with the news? Germany and Sweden have been taken over by the same Isis loving Muslims that killed this woman! There is no safe place for Arabic women to go to as long as Arabic men are around.","commenter_a":"There goes a girl who did not leave her country to reach Germany or Sweden for safety and fought as best as she could...she got executed for her tweets about life in Raqqa... Now you know what refugees who are labelled as \"cowards\" \"parasites\" \"are escaping from.","post_message":"She wrote about life under ISIS rule with humor, sadness and a glint of hope."},{"comment_id":"1786899774881601","commenter_b":"All you liberal women should really read this. You don't know who Hillary is. @webpagelink","commenter_a":"Don't continue to fall into Hillary's trap; she's laughing and the Press loves it....forget the Bimbo beauty queen of years past; we have urgent needs in this country that must be addressed and fixed, not to mention Christians being slaughtered by ISIS.","post_message":"'Donald Trump is ready to lead.' Gov. Mike Pence"},{"comment_id":"10156260216170725","commenter_b":"Michele the only thing dirty here is your pussy","commenter_a":"The media is always unfair to you @username but we are supporting you and what you will do for this country!!! Make Amerca Great Again in 2016!!!","post_message":"After a great evening and packed auditorium in Iowa, I am now in Colorado looking forward to what I am sure will be a very unfair #GOPdebate!"},{"comment_id":"10153413861058352","commenter_b":"Keep raping her for the rest of her life like she did to her grands","commenter_a":"Sick piece of shit","post_message":"Woman sent to jail for the rest of her life after raping her four grandchildren is described as the ‘most evil person’ the judge has ever seen. #STILLTRENDING"}]
