[{"comment_id":"1363879910298702","commenter_b":"Yeah! Stupid Sheep","commenter_a":"Love Bernie Sanders! #feelthebern","post_message":"Bernie Sanders was cheered for like a rock star during his surprise visit to a Verizon picket line in Brooklyn today. Read full story: @webpagelink"},{"comment_id":"10154529341826178","commenter_b":"This may be fun! Hillary won't be debating a politician! I see a house falling on her and watching her toes curl!","commenter_a":"Illegals and dead people voting","post_message":"Mika seems so sure of this...#RNCINCLE"},{"comment_id":"1734664193415362","commenter_b":"Don't Worry Bernie supporters.. !! Hillary will never win, well never let her ! #FeelTheBern #NotMeUs #HesWithUs","commenter_a":"Hillary is the clear choice for the White House!","post_message":"What a week."},{"comment_id":"1782119588705977","commenter_b":"@username Dumbocraps can't read. They need pictures.","commenter_a":"never once have I cared or wondered \"What would Eric Trump think?\" about... anything.","post_message":"Donald J. Trump's son thinks that his tax returns should stay private."},{"comment_id":"10152739817385047","commenter_b":"Signed! Stop abortions!!!!!","commenter_a":"Lord I pray that Congress will do the right thing here & save these babies. In Jesus' name I pray amen","post_message":"Late-term abortion is being put to a vote this Wednesday in Congress—potentially putting a stop to abortion at and after 20-weeks gestation. Sign & Share this critical petition to tell Congress to defend life: @webpagelink"},{"comment_id":"10156623129805389","commenter_b":"He wrote an entire book about it. Would you like copy?","commenter_a":"Great. How? How exactly is he going to create jobs? This guy just says he's going to make things great without details. He is making hollow promises. You know who else did that? Obama. He did the same thing. Actually, he did it without insulting people and sounding like the middle linebacker of a high school running for class president on the platform of beating up nerds and gym class all day long.","post_message":"“I am going to be the greatest jobs president that God ever created.” WATCH the highlights from Donald J. Trump’s New Hampshire primary victory speech. #Hannity"},{"comment_id":"1193853800707672","commenter_b":"Cause she's a lesbian LMAO","commenter_a":"i blam obam lol","post_message":"She has the most pro-LGBT platform ever. Here's why."}]
