[{"comment_id":"10153170547614170","commenter_b":"She will find a way to get out of it!!","commenter_a":"The Clintons are just like Obama, Lerner & Holder who all believe they are above the law.","post_message":"I don't know if people realize how big this is. It's such a serious violation of the law, even the New York Times is calling her on it And it's all because this woman is an obsessive control freak."},{"comment_id":"970914179695452","commenter_b":"Shut up!","commenter_a":"Proof that even when your dad is the ex-President and your mom is the future president, family pictures are still a disaster P.S. It is a joke. You all need to chillax!","post_message":"Happy Father's Day, Bill!"},{"comment_id":"1650724908525555","commenter_b":"Let's see, she and Obama, on one hand, want to take our guns, and on the other hand, want open borders of illegal aliens and possible terrorists to enter the Country. They are aiming to make all of America a soft target. Whose side are they on, anyway? Never mind, I think we know. Vote out all liberal, progressive, Democrats. Obviously, they are mentally ill.","commenter_a":"Gun control my a$$ - We ALL need to be armed!","post_message":"Wasting no time..."},{"comment_id":"10156223165790354","commenter_b":"Hell no they wouldn't. I'm still waiting on them to post the story about the white guy in South Dakota, that accidently shot his penis, while purchasing a gun illegally and tried to blame it on a black guy. They didn't even post the story about the white people in TX, that vandalized their vehicles and tried to put the blame on BLM. This page is a joke.","commenter_a":"I wonder if @username would have featured this news item if the chick was white ? Somehow I doubt it.","post_message":"And look what ELSE she did..."},{"comment_id":"10153382120572293","commenter_b":"They are not the same at all","commenter_a":"Deidri","post_message":"Why the analogy is important."},{"comment_id":"10154773205966037","commenter_b":"Hillary is the liar and murderer deserves to be in prison right now!","commenter_a":"SHUT UP TRUMP","post_message":"WATCH LIVE: Donald J. Trump holds a rally following last night's debate and says he will totally accept results \"if I win.\""},{"comment_id":"10153545151956336","commenter_b":"Megyn deserved the beating from Trump. She's an uppity bleach blonde.","commenter_a":"Tonight Fox sucks","post_message":"“I think the big problem this country has is being politically correct. I don’t, frankly, have time for total political correctness.”    Donald J. Trump responds to Megyn Kelly after she asked him, “How will you answer the charge from Hillary Clinton…that you are part of the war on women?”"}]
