[{"comment_id":"507285912795322","commenter_b":"God will show his hand and these creatures will be taken away to their doom.","commenter_a":"Take off the masks ladies!","post_message":"ISIS just made a huge move against America. This is unacceptable. Spread this post, we need to fight back. Do you agree ISIS should be wiped off the Earth?"},{"comment_id":"10154074583926159","commenter_b":"However Cruz is a natural born citizen always has been always will","commenter_a":"Absolutely....Cruz is the true conservative and is a constitutional scholar. Trump is all BS and bluster.","post_message":"Would you watch?"},{"comment_id":"1746288005610861","commenter_b":"Women do not get kicked out of restaurants because their children cry. What world do you live in ?","commenter_a":"Whatever. If that kid was crying in the middle of some restaurant & the owner told the mother to leave for the sake of the rest of the patrons he'd be applauded. Taking a baby to a political rally is as foolish as taking a baby to a Slayer concert. The exception being Slayer fans are far more courteous than the average politcal junky.","post_message":"\"I think she really believed me that I love having a baby crying while I'm speaking. People don't understand.\""},{"comment_id":"906670476046247","commenter_b":"And you just said you are not for choice. You care less for the hungry And homeless. You want them killed. You want them to have no choice. Giving money to kill the child of someone who really wants to keep their child but can't because you gave money to have it murdered instead of giving money to her to help her with her choice to keep her child. Yeah. Pro abort!!!! Force abort!!!! Force te 11 year old against her will. Give money to murder mills to force a helpless woman have no other option because people like you pay to kill her child and not help support it.","commenter_a":"Stop Death Camps For The Unborn!!! Abortionists Are No Better Then Murderers!!!!!","post_message":""},{"comment_id":"537543736410961","commenter_b":"Elizabeth Warrren for VP on a Sanders/Warren ticket!","commenter_a":"Another socialist","post_message":"“I think that what the Democrats are doing is terrific,” Sen. Elizabeth Warren said. \"We’re out talking about the issues. I look at the Republican debates and the difference between what they’re doing and what the Democrats are doing that really shows who’s on whose side.”"},{"comment_id":"10154536510048279","commenter_b":"nonsense. keeping Donald Trump out of the white house is the only thing that matters right now in this historical moment. Now if Jill Stein were Gertrude Stein, I'd vote for her. She'd have a chance. But for now, we should take a clue from no one less than Angela Davis and vote for Hillary. There are a lot of right wing trolls out there disguised as purist lefties. Don't fall for it.","commenter_a":"There really needs to be an eye roll reaction option on ef book","post_message":"A leaked audio recording reveals Hillary Clinton told a group of donors she’s the center-left to center-right alternative to Bernie Sanders and Donald Trump."},{"comment_id":"534767963372316","commenter_b":"HILLARY WILL TAKE OUR COUNRTY TO THE GROUND,ALL SHE CARE ABOUT IS POWOR","commenter_a":"In 1997, Donald Trump, who showed his personal courage by dodging the draft in 1960, had the gall to compare his heroism by sleeping with multiple women to the heroism shown by the brave men and women who served the United States in Vietnam. Interviewed by Howard Stern in 1997, Trump had the audacity to make the incredible claim that by risking his schlong to venereal disease from his sexual peccadilloes, his courage matched those who gave their lives facing mortar fire and bullets across the sea. Speaking of his sexual exploits, Trump bragged, been so lucky in terms of that whole world. It is a dangerous world out there. It scary, like Vietnam. Sort of like the Vietnam-era. It is my personal Vietnam. I feel like a great and very brave soldier.","post_message":"Crooked Hillary Clinton has lied from the beginning regarding her emails, and server. President Obama recently defended Crooked Hillary - saying she did not endanger national security. He also said ISIS was contained last year! Crooked Hillary will NEVER make America great again!"}]
