[{"comment_id":"10153137881829342","commenter_b":"And is Charlize Theron the president of the NAACP claiming to be white? I think we got there can be white africans","commenter_a":"she is white as white can be. she is born and raised African. @webpagelink","post_message":"When asked if she was African-American, she responded that she didn understand the question. When asked,  your parents white? Dolezal removed her microphone and walked away from the interview."},{"comment_id":"620315121449719","commenter_b":"Would make a great couple . Two freaks .","commenter_a":"HE likes. HE likes. HE aint a SHE!!!","post_message":"Caitlyn Jenner says she likes Ted Cruz because “he's very conservative, and a great constitutionalist.” @webpagelink"},{"comment_id":"10153148829377235","commenter_b":"Sure she doesn't work for FOX? Oh same difference, WSJ/FOX. I got confused there for minute her hair is yellow instead of blond. I guess that's why Murdoch doesn't have her on FOX, put some peroxide on that hair and Murdoch will make you a star! You too can be another FOX bimbo, if your legs are nice enough along with your cleavage.","commenter_a":"Oh my gosh ... it is so shocking to listen time and time to this rampant, severe stupidity.","post_message":"How dare Barack Obama talk about the suppression of minorities at an event showcasing the suppression of minorities!"},{"comment_id":"10153008527037894","commenter_b":"Women can preach, but I don't feel like doing bible study to prove it.","commenter_a":"I thought the bible said that women weren't allowed to preach...","post_message":"Watch: Distraught ‘Christian’ Lady Loses Her Everlasting Mind Over Marriage Equality [Video]"},{"comment_id":"1355437474524022","commenter_b":"Open season. Was Michelle off limits for you? No? Then neither should this ex porn model.","commenter_a":"Funny, not funny.... Who's paying for the wall? Mexico Mexic Mexi Mex Me.","post_message":"Today we celebrate one week since making history with the swearing-in of President Donald J. Trump and Vice President Pence! Watch the unforgettable inauguration:  @webpagelink"},{"comment_id":"10153971160946320","commenter_b":"@username - LOL. That's ok. Some people need a little help to find their funny in the morning.","commenter_a":"The moment you realize the Jon Stewart photobomb.","post_message":"Retired firefighter Ray Pfeifer was honored at City Hall for his work in persuading Congress to extend Zadroga Act benefits for thousands of 9/11 first responders suffering from 9/11 related illnesses.  Thank you for caring and fighting for what was right. Read: @webpagelink"},{"comment_id":"633195336830149","commenter_b":"Illegal invaders","commenter_a":"Feed them, clothe them. Try to teach them in our schools. Send them back where their parents came from.","post_message":"Where are their parents?"}]
