[{"comment_id":"10153475591131051","commenter_b":"What a real sick bitch needs to go down for good she dont need her other kids go down bitch","commenter_a":"Prayers for that baby girl","post_message":"When residents here stumbled across an alcoholic mother trying to eat her own daughter alive, they decided to handle the situation personally."},{"comment_id":"1277987642251583","commenter_b":"When I say technology, I'm talking about millenia of advancements. Even our simplest tools at one point put someone out of work, probably starting with the wheel. If you want to walk away from technology (or just some technology) that's your choice, just don't try and force others to pay for your choice.","commenter_a":"Low skill workers have been making this argument for generations since the first automation came about and it still doesn't work. Someone still has to design, manufacture, install and service the machine. Someone has to stock supplies for it to use. Still plenty of jobs, just not the job you were doing yesterday. They are also overlooking the other basic problem that the Government doesn't create wealth. If you get a freebie from Uncle Sam, that came out of someone else's hard earned money via taxes. If we're all sitting at home due to this miracle automation, then there's nobody around to pay the taxes to fund the government. It simply doesn't work. Worse, we've seen countless times around the world how it doesn't work and people still don't get it.","post_message":"Simply put, the idea is that Uncle Sam will cut citizens a regular paycheck whether they work or not."},{"comment_id":"1058315940902294","commenter_b":"Stupid white girl","commenter_a":"Dr. Cornel West is as arrogant and blind as Bernie. Blaming good Democrats for not getting things done and ignoring Republican majorities blocking them. They don't help. They just 'manage' from the side lines. Bernie at least has worked some in legislation, but not as hard or as successfully as Hillary. Dr. West has done nothing put complain that people who are doing the heavy lifting are not working hard enough.","post_message":"What do you think about his choices?"},{"comment_id":"1279009012178004","commenter_b":"Fuck that girlfriend","commenter_a":"I woulda just gave her the pipe since the gf it a dumb bitch anyways","post_message":"Dude passed the test!  #WSHH"},{"comment_id":"1371941172817349","commenter_b":"TRUMP AMERICAS WELFARE QUEEN!","commenter_a":"Bahaha, looks like your corrupt Hildabeast hasn't paid em either. Oh and why don't you ask the Haitians how much of that Clinton Foundation windfall made it to the Haitians. You liberals are absolute blind sheep. Don't you think if Trump broke any tax laws that Obozo's IRS henchman Koskinen would have taken him down already? Can't you leftist idiots run a campaign on pressing issues of the day rather than ad hominem attack and character assassination? Oh, I forgot you can't cause you fools have nothing other than soap opera drama. Hey, did ya hear Kardashian got jacked in France today? Bwahaha, such useless idiots, the lot of you!","post_message":"Contrary to Trump's claims, undocumented immigrants contribute roughly $11.64 billion in taxes every year."},{"comment_id":"1576560615982395","commenter_b":"Bitch needs to go away!","commenter_a":"The woman has been going way too much. She needs to rest. It's not exactly uncommon to get pneumonia when your constantly traveling doing events, and meeting with people on very little sleep.","post_message":"Democratic candidate abruptly left New York's 9/11 ceremony Sunday, raising questions about her health and campaign transparency."},{"comment_id":"10152908271969753","commenter_b":"You are absolutely right! She's disgusting","commenter_a":"if a man did this he would get prison time she needs this also..she is a guilty..","post_message":"The married mother-of-two admitted to having sex with the student on seven separate occasions both in her vehicle and at her home."}]
