[{"comment_id":"10153450529443352","commenter_b":"Livid??????? I would shut that MF down. ...Bastards","commenter_a":"Omg some one is responsible for this ok.who","post_message":"Mom Livid When Her 3-Month-Old Baby Girl Has Bruises on Her Face After Daycare"},{"comment_id":"10153287032506770","commenter_b":"Ugliest drag queen","commenter_a":"She sucked big time!!","post_message":"Did you see her performance?"},{"comment_id":"10156112188370354","commenter_b":"this woman is an idoit drinking kool aid","commenter_a":"This woman looks exactly as Bruce Jenner, do we care what she says??? Nooooo.","post_message":"Enforcing the law fairly and equally is not \"beating up\" on poor illegal aliens. Rather, it is honoring the Constitution and respecting those who have respected America enough to LEGALLY apply for citizenship and LAWFULLY wait in line. Face it, Leftists: you're losing--and you know it."},{"comment_id":"1798905343724193","commenter_b":"\"She doesn't want guns, take their let's see what happens to her,\" Trump said. \"Take their guns away, okay? It'll be very dangerous.\"","commenter_a":"How can this extremely ignorant, sorry excuse for a human, still be in office? and in Texas???","post_message":"What say you, Texas?"},{"comment_id":"10154730532542042","commenter_b":"yetanother photo u tag me in with the rachetness 😂😂😂 are we sure this one is also a she?","commenter_a":"@username wah do she eye 😂😂😂😂😂😂😑😑😑😑😑","post_message":"The New Jersey hairstylist said her client was unhappy with her services -- so she pepper sprayed the woman in the face."},{"comment_id":"1390094244343935","commenter_b":"I hope she does. Even easier for Trump to win","commenter_a":"No I don't. There are other qualified people.","post_message":"Want to see Elizabeth Warren on Hillary Clinton's White House ticket? It might not be so easy."},{"comment_id":"932721720195935","commenter_b":"who is wiping out Africans?","commenter_a":"They need to do something before brazil becomes the next africa or Australia....white people taking over while the indigenous people get wiped out.","post_message":"EXCLUSIVE: Brazil, the World Second-Largest Black Nation, Has Been Taken Over by an All White Male Cabinet #ABSArchives"}]
