[{"comment_id":"486035008253746","commenter_b":"Cover her ugly ass back up. Been eating too many Chitterlings","commenter_a":"Cover her face??","post_message":"A woman is suing the police department... over a hijab?  This woman broke the law, the police are completely in the right.  Do you support our police?"},{"comment_id":"10153400594587994","commenter_b":"those that wanna look like a female do!","commenter_a":"Just put a weave on it everybody else does....","post_message":"We've all had them -- but this bad hair cut even brought the hairdresser to tears."},{"comment_id":"10154242038366323","commenter_b":"If someone voluntarily choses this classless 'job', they deserve anything and everything that might come their way. I have no sympathy with whores and sluts, be they male or female. Why should I?","commenter_a":"Are you kidding me? Political correctness has come to THIS? The authors ersatz rationalization is nothing more than a peurile legitimization of prostitution. Call it whatever you like and for whatever reason, prostitution is prostitution, period. The whole point of the world's oldest profession is to exchange sexual favors for money. That prostitutes, no matter the reason, willingly engage in the services they offer is no reason to create bogus excuses for the consequences. If the sex worker - and make no mistake, that's what they are, regardless of their sex - comes away psychologically damaged, well, that rather goes with the territory of the profession. That is their problem, not anyone elses. In case they hadn't heard, prostitution is illegal. Why should taxpayers be burdened with caring for their psychological ills? As it is, sex workers already reap the benefits of medical attention at emergency rooms or through state ...","post_message":"'If, while having sex with someone, you feel repulsed by them touching you, afraid of what they might do, degraded and humiliated by the sexual acts – the fact that you’ll get a bit of cash at the end does not change anything. There is no invisible hand in the prostitution market that magically disappears the lived experience of sexual abuse.'"},{"comment_id":"10153765573361336","commenter_b":"ISRAEL WAKE UP FOR EVER Israel must wake up, get up, 90% Arab are Terrorists !! ISRAEL Must Destroy your enemies, terrorists and traitors in your country and out, do not sleep, do not sleep !! Palestinians & Obama are the Biggest Lie in History ! Jerusalem Never mentioned in the Muslim Koran !! Jerusalem is written thousands of times in the Torah, Jewish Bible !!! No loyalty = no citizenship !!!! Israel You are Lucky !I the Arab leadership Started today to murder Jews.!! in 2020, then the Jews would have found sleeper, wake up ! Never were Palestinians ! tribals killers today call themselves Palestinians ! Different tribes of killers arrived in Israel since 85 years and they want a country !? Please Supreme Power Main, Creator of All the worlds & Souls, please GOD Bless the IDF and ISRAEL for Good. Destroy all the enemies of Israel ...","commenter_a":"It's absolutely BS that I had to go to Afghanistan twice in order to afford college. Making public higher education institutions tuition free isn't a bad idea at all. If we can pay for a war in Iraq then we can definitely pay for college. It's an investment in America. That's the first step on how you make America great again. #feelthebern #bernie2016","post_message":"President Barack Obama's message to U.S. troops in Afghanistan: 'I do not send you into harm’s way lightly… but as your commander in chief, I believe this mission is vital to our national security interests.' @webpagelink"},{"comment_id":"10154275931541509","commenter_b":"Do all the chicks look like you?? Pass....","commenter_a":"Welcome to the best dating agencies believed Malaysia We have a wonderful effect RICH SUGAR MUMMY / DADDY / IN MALAYSIA be among the people to get our exclusive link We are reliable and efficient in our work get a chance to meet with them we have a sugar mummy throughout Malaysia who are willing to lavish money on your car and home a contract extension.. To help get the job started., start calling right now to get in touch within 24 hours and make more money noted., applicants must be 18 years or older and must have a significant personality dinner with mummies , and wealthy Daddies .. Each of the night you spend with her or your daddy , will pay you RM5,000 .. This is a bonus for every interested applicant available . Every interested applicant for a hook up meeting appointment, must contact our Agency Mrs ...","post_message":"'They were robbed of their stage. ... Tonight, we give them ours,' Bono told the crowd.  For the first time since  #ParisAttacks, Eagles Of Death Metal make an emotional return to the stage alongside U2 @webpagelink"},{"comment_id":"1867582453468544","commenter_b":"Stupid bitch","commenter_a":"you make it like i did , hard work bitch , no hand outs","post_message":"One of the co-founders of Black Lives Matter just said that 'white folks' need to 'sacrifice' THIS for her movement... this is an outrage.  America needs to know the goals of this movement... they're not going to like this."},{"comment_id":"10154993397619254","commenter_b":"Hello from erie pa my is he getting big","commenter_a":"His fur is waterproof.","post_message":"HAPPY FRI-YAY! Eaglet E9 is relaxing in the nest this morning. We can't believe how big E9 is! The eaglet will look more like an eagle as soon as white feathers start coming in :) Where are you watching from? @webpagelink"}]
