[{"comment_id":"1171664359552992","commenter_b":"Idiots...they should be training Americans how to protect themselves from Muslims","commenter_a":"Hahahahahahahah very funny","post_message":"'@webpagelink"},{"comment_id":"1652238444998373","commenter_b":"White girl runs around in black face and its fine, yet if I were to do it the liberals would lynch my saltine american hindquarters.","commenter_a":"She went full retard","post_message":"Wait,... what?  @webpagelink"},{"comment_id":"10155429913146509","commenter_b":"But his enabler wife is","commenter_a":"Supporting a blatant sexual predator. Nice. And btw bill is not running for office","post_message":"House Speaker Paul Ryan said he will no longer defend Donald J. Trump, but he did not say whether he'd reverse his endorsement of the GOP candidate."},{"comment_id":"10153264907976336","commenter_b":"The illegals are bleeding the system dry, plain and simple and then there's the government that doesn't give a crap about the poor because they largely do not see a reason to vote and therefore don't","commenter_a":"Yea and that will never happen. Illegal immigration will never completely stop as long as we have open borders and waterways","post_message":"In a Fox News Sunday exclusive, presidential candidate Marco Rubio says he still believes the U.S. needs immigration reform but it can’t be done “in one big piece of legislation.”  WATCH: @webpagelink"},{"comment_id":"1772923492974110","commenter_b":"'@username .. Tippu tip, one of the greatest slave traders known to man that had over 10,000 slaves in Zanzibar, grandmother was a muslim slave. The problem with islam is the contradictions. You inherit the greatness of your lineage as well as all of the ills. The first step for Muslims to get passed this & be accepted in the international community is to accept the past for what it is & stop lying, deflecting, & manipulating it. It only creates more RAGE! Everything in this video is FACT and supported with 100's of years of abundant evidence. This video is actually a low ball. The actual number of victims of islamic genocide s 100 - 150 million deaths. Please stop telling me about 'bilal' that was a slave in the first place by an arab. Abu bakr freed 3 personal pagan slaves for bilal's emancipation. Am I suppose to ...","commenter_a":"This is the blind teaching the blind. A ratings based media hub focusing on the impulses of the ignorant. This is not accurate about Muslims and therefore makes it inaccurate of Arabs. All Arabs aren't white. There was a black Arab named TIPPU TIP, he was one of the biggest contributers to slavery. He was very black. Look him up. Also, a Arab can't teach islam. Because Islam isn't synonymous with Arabs, it's more wide spread with Asians. Indonesia is the largest population of Muslims. All Arabs aren't muslim. And there were many Arabs who rejected Prophet Muhammed. I love history but I hate when people try to each topics of sensitive topics but pose a biased view. Black people must realize we are not all the same. Americans aren't the same a all Africans. We know why we're African, but most don't know we're more American than the white ...","post_message":"10 Facts About The Arab Enslavement Of Black People Not Taught In Schools"},{"comment_id":"10156869276120725","commenter_b":"Thank you Wisconsin! #TRUMPTRAIN #makeamericagreatagain","commenter_a":"The era of appeasement is coming to an end! They are only making the majority stronger and more galvanized than ever! All are welcome on the Trump Train - GO TRUMP!!! #Trump2016 #TrumpTrain","post_message":"THANK YOU, AMERICA! I love you!"},{"comment_id":"10153647894113854","commenter_b":"Leave her alone","commenter_a":"You call this piece journalism? Now that's a long stretch.","post_message":"FLASHBACK: 'Megyn Kelly F**ks Brit Hume to Get a Job at Fox News'"}]
