[{"comment_id":"10153507892259203","commenter_b":"Figure out how to get guns from criminals. They won't follow the law and they the criminals are the problems. Use a little common sense. Let's fix places like Chicago were control is not working. Or do no lives matter.","commenter_a":"If you go by empirical data from countries with gun restriction laws to those that don't. ...it's a no brainer decision. ...gun control and restrictions DO work. The data shows less of these types of crimes. Does it completely stop gun related violence (where a gun was used to commit a crime)....NO. Does it lessen the chances of these crimes from happening. ..YES! Its been proven that there are less crimes where guns are used within countries with solid gun control laws...period. Every country that has gun restrictive laws and gun control is a prosperous nation whose avid hunters and gun clubs (shooting ranges) also prosper. Now if your argument and reason for no gun control is because you have the right to defend yourself...THEN you must also believe that the world would be a safer place if every country in the world had nuclear weapons to defend themselves... the ...","post_message":"Bill Maher blames right-wing media and Fox News for Charleston: \"They present a really twisted view.\""},{"comment_id":"10153514086261955","commenter_b":"Still trying to jump that fence huh? @username ...better hurry before that Trump wall gets built.","commenter_a":"It's not that hard to figure out why Trump is doing so well. People are so tired of politically correct politicians.","post_message":"Pollsters dumbfounded by Trump..."},{"comment_id":"10153662620879877","commenter_b":"So that make it cool huh ? Betta keep close eye on ya little one bro ^^^^","commenter_a":"So you found people unconscious, didnt call an ambulance or anything you shot them . That's murder.","post_message":"Black Couple Killed by Police Were ‘Unconscious’ Inside Their Car When Officers Arrived. Watch what happened next below.   Grio fam, what's going on here? Seven children are now without parents..."},{"comment_id":"1211132575573437","commenter_b":"In the end, no ones opinion will matter; only God's word... Read it... One God, One way to heaven and One way of marriage- Man and woman... not two men, or two women or two women and a man or one man and 10 women.... Marriage is between a man and a woman...The bible says be fruitful and multiply so if you want to convince bible believers, let two men physically produce an offspring from their body or two women or one woman without the help of a male sperm .... that alone should convince you it's not natural or right...","commenter_a":"Gov needs to step in and force her out!! Call for that emergency meeting and have her step down!! Why are we entertaining this woman...","post_message":"\"Davis is simply wrong,\" lawyers for Kentucky Gov. Steven Beshear said."},{"comment_id":"10153216177713984","commenter_b":"I have 3 sons--never once did I pack their lunch---for a reason---I wanted them to experience other foods and if they got hungry they would eat what was in front of them---My guys are not picky eaters and like most everything--mission accomplished.","commenter_a":"So people don't want their kids to eat healthy OK LOL!!","post_message":"This unhappy 2nd grader just served up a giant helping of truth about Michelle's school lunch agenda. I bet she had a tough time swallowing this one.  Do you support this kid for confronting Michelle Obama?"},{"comment_id":"10153372677575950","commenter_b":"And Kaye Townsend you are an example of an ignorant Bitch","commenter_a":"Screw going to the hospital to better anymore. Lets post getting shot and see how many likes i get","post_message":"Shortly after being shot in her car, a woman turned to Facebook to send a video message to loved ones: \"Mama I'm bleeding. I know they shot me but it's good. It's good.\""},{"comment_id":"556591217846893","commenter_b":"America needs alot less hate as well as banning corrupt career politicians, NWO,Open borders to fill there own greedy pockets Clinton the lieing witch with soldiers blood on her hands","commenter_a":"To all the hateful mean trolls, seriously and you call yourself an American. Maybe you skipped the part in school that teaches you to be human and love humanity. You can disagree with political views but when you just get mean spirited about a person...thats just wrong!! I think Americans need more love and a lot less hate!!!! Next time you call someone something, look into the mirror and see if you ever sinned yourself. \"Those without sin...cast the first stone\"!!","post_message":"A smiling Hillary Clinton just arrived on Capitol Hill for meetings with Democratic lawmakers. @webpagelink"}]
