[{"comment_id":"1349098891770012","commenter_b":"She butchers infants, rapes ad sells and children for the sex trade and you wounder she is breaking a promise? I find it hard to understand how people still defend or are associating with her name. No amount of fluoride can explain this type of behavior.","commenter_a":"once a hi-LIAR-y always a liar.","post_message":"Breaking yet another promise: What a way to fade into obscurity and irrelevance..."},{"comment_id":"10154994136091800","commenter_b":"He probably knee jerked so hard he got a bloody nose and blames it on picking it too much!","commenter_a":"Trevor Noah is a puppet... Go back to south Africa where division is welcome stop trying to divide my country with your shitty humor... #Bringbackstewart","post_message":"The Daily Show recaps President Trump’s flurry of executive orders."},{"comment_id":"10153678796416491","commenter_b":"If its a libby female like killary, she'll be fine on the side of the road ;-)","commenter_a":"Dude. You left a lady on the side of the road. I don't know how you were raised, but someone needs to kick your teeth in.","post_message":"The driver said the woman was “obviously a socialist”"},{"comment_id":"408767239311570","commenter_b":"@username, you are an idiot, we DON'T live in a democracy, our founding fathers set up a constitutional republic to keep \"mob rule\" from ever ruling. What do you suppose will happen when 51% of voters all vote for free stuff??? What needs to happen is we need stricter voting laws. No felons can vote, nbody that recieves public governmenet assitance can vote. Rules lile this would EXTEND the life of our country. People who think like you ARE what's wrong with AMerica","commenter_a":"None of them can be trusted but seem to get elected anyway!","post_message":""},{"comment_id":"10154880669523614","commenter_b":"Let them go there and put up another wall.","commenter_a":"Now there's an idea, send them all there not here. Works for me.","post_message":"Canadian Prime Minister Justin Trudeau's immigration minister has declared an open door policy for immigrants and refugees."},{"comment_id":"10153798223993132","commenter_b":"All white women fear intelligent black women!","commenter_a":"Im not at all surprised that a group of loud, obnoxious, self-important women threw a fit. Don't be disrespectful to other passengers, and then demand respect. You're not above others.","post_message":"But it may be too little, too late."},{"comment_id":"10153213873086051","commenter_b":"Go to he'll bitch","commenter_a":"It's a lion it is legal to poach lions but legal for canned hunting everyone is having a cow because someone killed a famous Lion If you care so much about animals stop going to the zoo and the circus Stop buying products that test on animals donate to animal charitys Bitching on facebook solves nothing this man made a mistake leave him alone you self righteous idiots","post_message":"The hits just keep coming for Cecil The Lion's pride."}]
