[{"comment_id":"10153057363191028","commenter_b":"Bhahaha!!! A ccw in San Fran ? Does a unicorn issue those?","commenter_a":"I am sure that the thugs guns were a registered and they all had concealed carry permits with proper background checks done.","post_message":"The brazen attack occurred just before 6 a.m. at Pier 14 in San Francisco, where the reporter and photographer – along with several other news stations – were covering a story.   'I thought I was going to hear a click,' the photographer said afterward, meaning that he thought he was going to die. @webpagelink"},{"comment_id":"938657176211868","commenter_b":"Who is she ?","commenter_a":"DAN, Dumb A N","post_message":"'While MSNBC may believe that I am worthless, I know better.'"},{"comment_id":"941193142664131","commenter_b":"Hope it blind the liberal bitch! LOL","commenter_a":"Get more of them","post_message":"Mace to the face = ouch. Did she deserve it? Did the old man deserve getting punched by her? And for a bonus for being nice I've added a video of a high protester doing a backflip and landing on his head. #theplacewecallthezoo @webpagelink"},{"comment_id":"1184948411561852","commenter_b":"FOREIGN WORKERS MEANS TAX BREAKS FOR THE COMPANIES AND LOWER WAGES..... ALSO MEANS NO JOBS FOR USA CITIZENS!!!!! TRUMP FOR POTUS - DEPORT THE ILLEGALS AND STOP WORK VISAS !!!!","commenter_a":"In my lifetime, I have been through 3 amnesties. Each was promised to be the last. Does anyone in the Congress, who made this promise to the American people, have enough backbone to honor their word? Seems not. Why believe anything they tell us?","post_message":"Not good."},{"comment_id":"10154282422068128","commenter_b":"'So Veli, I saw an article about you in the WSJ today...' Haha, but my only interactions with him were over email, so as far as I know...","commenter_a":"'@username veli?","post_message":"“Just when I wanted to nominate Jill Watson as an outstanding TA,' it turned out she was computer."},{"comment_id":"1759075771038433","commenter_b":"'@username...No evidence??? HOW ABOUT 4 DEAD AMERICANS.... HOW ABOUT ERASING YOUR EMAIL TO HIDE IT, WHEN ASKED...HOW ABOUT MISHANDLING TOP SECRET INTELLIGENCE... THAT'S ALL BEEN PROVEN. .. YOU CAN'T PICK AND CHOOSE....YOU CAN LEAD A HORSE TO WATER, THEN HOLD HIS DAMN HEAD UNDER, UNTIL IT QUITS KICKING...THAT'S WHAT IT TAKES, WITH PEOPLE LIKE YOU, IT SEEMS.","commenter_a":"So would we all. As a matter of fact, orange jump suits would look good on all Socialist-Democrats.","post_message":"“Hillary, I’m waiting for what you promised me. All I heard was you getting on TV, calling me a liar. That’s not true, Hillary. I am not the liar. You are the liar.”"},{"comment_id":"976551429087752","commenter_b":"She is a pathetic little girl who wants to be relevant. Too bad that will never happen.","commenter_a":"Who cares what she says????","post_message":"'Pop-star' Calls Christians 'F*****g Insane' and 'Conservative-A** MotherF****rs'!"}]
