[{"comment_id":"10153063364393188","commenter_b":"Idiot and hypocrite. So he says he was a solider.","commenter_a":"He's a traitor and needs to be deported immediately","post_message":"Really?"},{"comment_id":"10154065307955329","commenter_b":"I leave my sweat for the next guy/gal so they can draw strength from my juices. Welcome.","commenter_a":"And how long are you supposed to wait before you wipe it down after you use it? Dear people that leave sweat stains on the machines and don't wipe it down after they're done, screw you.","post_message":"Pump some iron or nap? Nap."},{"comment_id":"1023389334348744","commenter_b":"freaking australia","commenter_a":"How so they come up with 95 millions years?","post_message":"This bizarre species of shark is thought to date back at least 95 million years."},{"comment_id":"10153922572740950","commenter_b":"No she was saying don't do it Keith.","commenter_a":"Dummies... she was telling the cops, 'Don't do it'. Did you not hear her NUMEROUS TIMES say, you better not shoot him. Don't do it. HE DOESN'T HAVE A GUN. I suppose she changed her mind halfway through. Smh","post_message":"Warning - Graphic Content: The Charlotte-Mecklenburg police department just released the officers' body cam footage taken during the shooting of Keith Scott: @webpagelink"},{"comment_id":"216170728787107","commenter_b":"She is a dried up piece of human flesh!","commenter_a":"This is a crazy idiot sue her but her out of business","post_message":"The heck!"},{"comment_id":"1280546775319125","commenter_b":"Is it not a shame that such is good looking woman can make herself look so bad when she open her mouth.","commenter_a":"sick of seeing this woman in the news.. why doesn't she go back to Alaska?","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10152883949732507","commenter_b":"John, it's entirely secret to protect children and families. Social workers are ethically obligated to not share more than they have to, and why should they when sharing information can often cause more harm than good?","commenter_a":"Home schooling wasn't the reason. You can home school, live in a tent, even be homeless. There were other reasons. Living in filth, broken glass, all stated in a copy of the letter the mom posted to her Facebook. I read it earlier in another article. I work for children's services, nothing is as clear as it seems.","post_message":"This should spark a lot of debate."}]
