[{"comment_id":"825373110931702","commenter_b":"It's ok. Can't hurt anybody. He's irrelevant. Just laugh at him and move on.","commenter_a":"And this is why Trump won. Republicans are always told they must apologize, even by other Republicans.","post_message":"He's baaaaaack... WATCH:"},{"comment_id":"10156406876695354","commenter_b":"lies as much as Obama, anyone votes for this lady is a total idiot, we already have confirmed Muslims coming in with the wave of them as terrorist, needs to shut her mouth with all these lies, you think our economy is bad now vote her in and she will double the debt, no place for this lady in politics.","commenter_a":"Jack ass","post_message":"\"Muslims are peaceful and tolerant people and have nothing whatsoever to do with terrorism.\" Hillary Clinton is a _________________."},{"comment_id":"10154356306731545","commenter_b":"Nude models are not the same as porn. If so no young person would be allowed in the best art galleries in the world. However I agree, I would not show my child porn.","commenter_a":"If our First Lady can be a print \"porn\" star, you can be a teacher! Don't let anyone tell you different!!!! :)","post_message":"A teacher at an all-girls academy in Dallas ISD says she lost her job after word got out that she appeared in pornographic films over a decade ago."},{"comment_id":"544829205708653","commenter_b":"Free so the they can bomb and kill Israelis like their surrounding neighbours. No thanks","commenter_a":"I'm sure this will give the Zionists more reasons to steal land in Palestine I hope the poor people of Palestine will be free some day","post_message":"Wildfires are also threatening homes near Jerusalem and in the West Bank."},{"comment_id":"1793905347490203","commenter_b":"Plus she is nasty and disgusting","commenter_a":"This young lady is very talented, but she has no clue what this country is all about. It happens when you grow up with the world revolving around you. She has no idea what she supports! Or Who!","post_message":"Miley Cyrus is begging people to vote for Hillary Clinton"},{"comment_id":"680360518742918","commenter_b":"Yeah ted😄,, me and my uncle Malcolm Fisher love ya!!!","commenter_a":"I refused to watch his garage band act but I'll take your word on it!","post_message":"Tonight America saw a powerful demonstration that it is time to move on beyond President Barack Obama. #SOTU2015"},{"comment_id":"10152851523876680","commenter_b":"Exactly. Just because he is being observed by being a dad doesnt mean anything negative. Bush wasnt...why? Because his daughters were already grown no reason to be.","commenter_a":"Still have no clue why all of the media treat the Obamas like some sort of Kardashian reality tv celebrities. Sick!","post_message":"Barack Obama drives a bumper car with Sasha Obama, who turned 14 today, at the Iowa State Fair in August 2007."}]
