[{"comment_id":"10156450025520551","commenter_b":"She is as dangerous as Hillary","commenter_a":"both---jail time","post_message":"Issa: FBI director would like to indict Clinton and Abedin [VIDEO]"},{"comment_id":"10153667196560090","commenter_b":"She should be in Jail period!!!","commenter_a":"No. Send her to Prison","post_message":"Keep Hillary Clinton out of the White House!"},{"comment_id":"10155308331690354","commenter_b":"If these 400 men are really that stupid...do we really want them populating the world anyway?!","commenter_a":"I wasn't aware obama was a follower","post_message":"Other than charisma, how does one convince 400 men this is a good idea?"},{"comment_id":"550730825100820","commenter_b":"Smash these racist fucks with the same pipe, then hit them in the throat with it.","commenter_a":"Public beating","post_message":"Black Thugs Smash White Girl's Face With Metal Pipe For This Unbelievable Reason  This is horrifying. Imagine if this was your daughter.  What punishment would you want for them?"},{"comment_id":"10153030490451800","commenter_b":"Pageants are Insults to women and we should be past these DOG and PONY shows by now.","commenter_a":"Evidence That Beauty Pageants are Epic failures \" SARAH PALIN\". VAPID AS ANY CANDIDATE FOR ANY OFFICE ANYWHERE ANYTIME THE ONLY BIGGER IDIOTS ARE HER DONORS AND PERSONS STUPID ENOUGH TO BUY HER BOOKS. When I find one of her books for 15 cents at a Thrift store I will shred it and use it to Line my cats Litter BOX. ( If i don't find a Donald trump book first)","post_message":"\"Good for Miss Lebanon and Israel for rising above your countries' political squabbles to say to the world that on the inside, we're the same. And also on the outside, apparently they're the same. They're almost completely identical, it's really inspiring.\" -- Jon Stewart @webpagelink"},{"comment_id":"958348850875022","commenter_b":"She is a frickin IDIOT","commenter_a":"Don't screw with my free speech !!! It won't go well for you !!!","post_message":"The Constitution’s 1st Amendment protections for free speech apply only to “institutions of faith” and not individual Americans, according to Sen. Tammy Baldwin (D-Wis.). Baldwin, the nation’s first openly lesbian member of the U.S. Senate, offered that bit of liberal logic during a recent discussion on MSNBC. Asked by the MSNBC host whether a bakery whose owners have religious objections to the ruling should be compelled by the government to bake gay wedding cakes, Baldwin insisted that religious free speech has no place outside churches, synagogues or mosques.  @webpagelink"},{"comment_id":"10153567844472434","commenter_b":"Carol Adams you're mentioned here and might enjoy, grrrl!","commenter_a":"Unfollowing. I'm tired of your anti-vegan rhetoric. The fact is that eating meat is the largest contributor to climate change. It is an industry that is notorious for violating human and animal rights and destroying the global environment.","post_message":"Anything mass produced is shitty for the environment, including almond milk."}]
