[{"comment_id":"10153003498236051","commenter_b":"He can be somebodys bitch in jail!","commenter_a":"Hang the SOB!","post_message":"This guy picked up a big concrete block and threw it. It landed right on a 7-month-old girl's head."},{"comment_id":"10153671794761770","commenter_b":"Gross ! She's too fat ! Lol","commenter_a":"'- Someone whisper in Dereks ear, ALL beauty is fleeting","post_message":"Derek Jeter clearly hit the jackpot."},{"comment_id":"10152972266751051","commenter_b":"No, phuck you, Eric! Get out of my country if you can't respect it. And that stupid bitch is just another moron who probably thinks we have a black president, too. Can't have a white momma and be black........DUH!","commenter_a":"Go to a country who has a flag you like, BITCH.","post_message":"This American flag social media challenge has become increasingly popular over the past week."},{"comment_id":"1247431258610235","commenter_b":"Shut Up!","commenter_a":"Black guy shoots a white guy who was trying to help a female. Sad. When do the riots start?","post_message":"SHOOTING CAUGHT ON CAMERA: New Orleans police are searching for the man shown in this video shooting a med student who was trying to stop the suspect from allegedly attacking a woman. The suspect can be seen shooting the student in the stomach after a verbal confrontation, and then attempting to shoot him again when his gun appears to jam. Read full story: @webpagelink"},{"comment_id":"509489615909884","commenter_b":"No She is a pig.","commenter_a":"She is also a jackass","post_message":"Canada: Muslim Conservative who decried party's Islamophobia is really a Liberal"},{"comment_id":"10153358341224726","commenter_b":"She need to get out of there","commenter_a":"the mayor of Baltimore is what you have a news conference but she cant handle a news reporter how did she get the job ,WE ALL KNOW ????????????dumb. .","post_message":"WATCH: Baltimore Mayor Snaps At Fox News Reporter for Asking Questions"},{"comment_id":"1325251154159559","commenter_b":"A new report by NBC just released today says that Chelsea Manning maybe subjected to permanent solitary confinement charges coming from her recent suicide attempt. Is the Obama administration trying to strong arm Wikileaks? I can't imagine that being a coincidence. We must stand up for Chelsea Manning! Whatever happened to no cruel or unusual punishment?","commenter_a":"AS empty a bunch of words as when Republicans claimed them. Easy to be optimistic when you are rich, less so for the masses.","post_message":"With his last convention speech, the president forced pundits to acknowledge that Democrats are taking back an optimistic worldview, writes Neal Gabler of USC Annenberg Norman Lear Center."}]
