[{"comment_id":"903840716398977","commenter_b":"Nestle can suck my balls","commenter_a":"Rick Rule","post_message":""},{"comment_id":"10157601256035594","commenter_b":"I don't know who you are hanging out with but you should protect your pussy...","commenter_a":"Hillary calls Trump supporters deplorable... yet a Hillary supporter does this, this disgusting attempt at a 'protest'. This is more foul than the WORDS Trump spoke.","post_message":"“Dear Mr. Trump, I’m not able to mail you my actual p----, so I’ve included the next best thing. Cheers, Emily.”"},{"comment_id":"10153367741477411","commenter_b":"Good. Disgusting woman","commenter_a":"I say she probably didn't know anything about it! My sisters ex husband was a cop and she knew nothing about the \"dirty deeds done dirt cheap\"!","post_message":"Fox Lake lieutenant Joe Gliniewicz's widow Melodie faces several conspiracy charges as well as charges on money laundering and the misuse of charitable funds."},{"comment_id":"1108096825935519","commenter_b":"Lol...dumbass","commenter_a":"Funny.","post_message":"Anybody who holds up a cop car at gunpoint isn't the brightest person in the world. This thug, however, was especially dumb... he didn't see what was behind him. This ended REALLY badly... and it was all caught on video."},{"comment_id":"10152718223821051","commenter_b":"Shut up cunt","commenter_a":"this can not be","post_message":"Darren Wilson is about to get sucked back into the Michael Brown shooting case."},{"comment_id":"953345841476863","commenter_b":"that same lie every fuckin time. let me guess. Cherokee. fuck that shit. bitch is lying. and she's just another white racist tryna curve us from the truth. you're nice shit don't fly around me. I'm gonna bring out the racist in you for everyone to see if you keep on. let's play","commenter_a":"I rarely hear a white person say either of these things, and if anything I hear blacks alday long say go back to Mexico to Spanish Americans","post_message":"We're waiting..."},{"comment_id":"10154463724150329","commenter_b":"@username because I don't keep people around who are ignorant and misogynistic pigs, such as yourself. Get a grip and show some fucking respect. Sitting in your parents house being a troll isn't gonna get you anywhere. Also, alot more women are feminists than you would think, @username.","commenter_a":"Wear whatever the fuck you want. Just dont expect everyone to compliment you.","post_message":"\"Bikinis just don't look nice on plus-size women.\""}]
