[{"comment_id":"924673837566701","commenter_b":"I meant divided we fall","commenter_a":"At least learn how to spell 'Missile' Then you can be an educated bigot!","post_message":"I have joined with a bipartisan group of 16 senators to introduce legislation that would impose economic pressure on Iran if international negotiations do not yield a final nuclear deal by June 30, 2015. This is the most important foreign policy issue facing our country. A nuclear Iran will threaten the security and safety of the United States and send a message of weakness to our allies and partners in the Middle East. This legislation is an important signal to Iran and the entire international community that the current negotiations are not endless and the Iranians cannot continue their dangerous nuclear activities."},{"comment_id":"1131999030168888","commenter_b":"Heroin is effecting all colors all races from all backgrounds!!!","commenter_a":"I like how heroin is effecting white people the way crack effected the black community but the way the media and police are dealing with it is completely different. Instead of calling them junkies or addicts it's an epidemic and now it's a family issue. Just lock them up like you did to black people in the 80's.","post_message":"Police want you to see these viral images of what heroin is doing to families."},{"comment_id":"1160205933989715","commenter_b":"You must want Hillary as president....","commenter_a":"I have to say I am ashamed to call myself a Republican...they need to stop crying and support the leader and stop this!!!! If they do this they would elect the Democrat and then away goes all our freedoms!!!!","post_message":"Gingrich: Trump is a natural ally of conservativism"},{"comment_id":"10153526527726770","commenter_b":"What a buch of sissys can't block it","commenter_a":"It is this lack of backbone to do the right thing that is causing people to be so angry at the establishment! Stand up and be counted! You might be surprised at the response!","post_message":"A former Delta Force commander,says President Obama is letting terrorists flow across the U.S.-Mexico border --- and that Republicans are too 'paranoid' to stop it."},{"comment_id":"1018381961551666","commenter_b":"Monthly periids dont count woman. Come up with another strategy","commenter_a":"Yeah.... you've got such a stellar record from Benghazi, who wouldn't want to go into battle at your direction?","post_message":"We can defeat global terrorism—but only if we don’t let fear drive our response."},{"comment_id":"10153256753408445","commenter_b":"All I know is I'm gonna smoke so yea u can lick my ass crack","commenter_a":"yea lets kill all those smokin weed dumb fkin pigs lay em all down permanently","post_message":"#NEW - Hundreds of Local Cops Are Requesting Armored Trucks To Fight War on Weed"},{"comment_id":"380130102360204","commenter_b":"And how much are we spending on the illegals and the refugees?? Probably a lot more than the wall and the homeless combined. Let's take care of Americans and America's needs FIRST!! After we take care of our Veterans, our homeless, our children and build the wall we can consider helping those that want to come here legally!! Resources should not be going to illegals until all Americans are taken care of.","commenter_a":"I can buy a candy bar for a dollar or give the dollar to a homeless person. Wait! I can do both!!!","post_message":"We could Build a Wall, or End Homelessness... I know which one I'd Choose, Do You?  Join Us: The Free Thought Project"}]
