[{"comment_id":"853540474702649","commenter_b":"By the way I don't agree with this either. But just think if people do not hire illegals they couldn't survive here. That is the root problem maybe we should start there.","commenter_a":"States did this not Obama. Do you blame him for everything? If the Cardinals don't win the World Series I'm asking congress to impeached him because it would have to be his fault","post_message":"10 states now offer driver's licenses to illegal aliens. Don't you think this is WRONG?"},{"comment_id":"752331831534238","commenter_b":"This guy is DANGEROUS!!! USA will not be a safe place if this ass hole wins. countries like RUSSIA! Will declared WAR on USA. He is thinking to pressure MEXICO to pay for a wall base in WAR!!! Mexico has many ALLIES! WWIII Don't make a bad decision people!","commenter_a":"He is the devil","post_message":"Watch Trump directly contradict himself — watch more here: @webpagelink"},{"comment_id":"10153850610670575","commenter_b":"We will see...won't we? Vote Trump and Mexico will pay for the wall. All the others will not put up a wall. All the other candidates don't care about how many drugs are coming across the borders to ruin America and her children. Trump 2016.","commenter_a":"If he doesn't check his tone, he'll be out there with shovel in hand building the well.","post_message":"Maybe not you sir, but Mexico is paying for it!"},{"comment_id":"1849595058601808","commenter_b":"That's one hypothesis...","commenter_a":"Jamie Steward","post_message":"Believe it or not, this has been a complete mystery for a long time. But there IS an evolutionary reason for it."},{"comment_id":"1279026295523755","commenter_b":"Translation: \"such a nasty woman\"/\"Bitch\"","commenter_a":"I just have to laugh about this because he represents himself so horribly and it just scores points for Hillary. She is tough and takes it like a woman because women are strong and tough!","post_message":"Absolutely deplorable."},{"comment_id":"10153200627856130","commenter_b":"She is to good for him","commenter_a":"Hence the \"quiet moment\" part of that headline. Gotta be all up in everyone else's business.","post_message":"The estranged couple were photographed sitting on a beach step outside their Baker's Bay private resort on July 3."},{"comment_id":"10154370005056162","commenter_b":"She should be CHARGED with TERRIBLE TASTE in clothing!","commenter_a":"The legs are a lot longer than a lot of the short shorts that teenage girls get away with wearing all the time everywhere.","post_message":"TOO SHORT? A burlesque dancer says an airline stripped away her dignity when they told her to change her clothes if she wanted to board her flight... @webpagelink"}]
