[{"comment_id":"537545743072047","commenter_b":"Fuck you you damn racist nut!","commenter_a":"Sounds like she just smoked a fat rock. Good job Vice... Keep throwing the crackheads on the top of my news feed. Not sure what I want more this or cat videos...","post_message":"On the Sea Islands along the coasts of South Carolina and Georgia, a painful chapter of American history is playing out again.  Watch our investigation into why Gullah culture is being replaced by waterfront mansions: @webpagelink"},{"comment_id":"1653212978299148","commenter_b":"You two bitches are so very stupid","commenter_a":"John. I agree with you.","post_message":"It's about time...  I'm tired of these two."},{"comment_id":"1739336132953313","commenter_b":"Stupid bitch lmfao","commenter_a":"Obummer has been rode so hard by his tranny boyfriend that he has lost his mind and should be hung for treason.","post_message":"Q: What 4 words would you say to Barack Obama?  The Free Thought Project.com (y)"},{"comment_id":"1421191604574730","commenter_b":"Go to hell","commenter_a":"He's perfect for the job and he's american","post_message":"EXPLOSIVE! CNN Columnist Says Michael Phelps Should Not Have Been The Team USA Flag Bearer Purely Because He is WHITE! Liberals are going CRAZY, injecting skin color and religion into the the olympics!   Lets GET 5,000 SHARES For Phelps! He's White and a BADASS! So what!"},{"comment_id":"511818058979535","commenter_b":"Good they dont belong there. Its for shoppers and family time keep your zoo off all streets and malls! If black lives mattered so much to them why are they not stationed in the community?? #enoughalready","commenter_a":"They are a nuisance.","post_message":"The Mall of America is seeking a temporary restraining order that would bar the group from protesting. It also wants the group to post a message on social media saying the protest is cancelled."},{"comment_id":"10154459292584138","commenter_b":"Right!!!","commenter_a":"What about bengizi, emails, her picks for judges, say goodbye to our Constitution, and gun rights, i could go on and on. Can anyone name 1 thing she has done positive for this country.....","post_message":"At CHS Field, people are casting their votes - with bobbleheads! People can \"vote\" and get a bobblehead of Donald Trump or Hillary Clinton at the door. The first bobblehead to run out wins the \"Bobblection.\""},{"comment_id":"10153054297358984","commenter_b":"Obama has always chosen the side of the terrorists from the very beginning. I can't help wondering if he was in on the planning and carrying out of the 1st 9/11 attack and just what his roll has been in other events like the shooting at Fort Hood, etc.","commenter_a":"If 3.7 million protestors and marchers didn't get Obama off his ass then nothing will. Not just any but those that support freedom and liberty.","post_message":"This man does not have a problem telling us how he really feels. And boy, does he have some harsh words for Obama...  Do you agree with what this Lt. Colonel just said about Obama?"}]
