[{"comment_id":"10153952322157994","commenter_b":"Stupid young mfs","commenter_a":"#LifeinaPotHole #VOTE #GUNSENSE #VOTE #Hillary2016 #WitchHunt #BroomsUp #BlackLivesMatter #LATINOS #LGBT #WOMANCARD","post_message":"Three teenagers have been charged in the fatal shooting of an 18-year-old at Eastland Mall the day after Christmas."},{"comment_id":"755872544562858","commenter_b":"Hes a special kind of stupid isn't he!!!","commenter_a":"I think I read Obama sent his people to Israel to interfear in their election. This is like the pot calling the kettle black. Put that is what Bullies do.","post_message":"President Barack Obama says the U.S. must and will take action against Russia in response to cyber interference with the election."},{"comment_id":"633540503462936","commenter_b":"Whoooo so what. It's not like he left guys to die in Benghazi.","commenter_a":"Jesus who cares. How many years ago was it? Too many! I don't care what crap they find out about him, I will still vote TRUMP!","post_message":"Did he or didn't he? Listen to the recordings here and weigh in below: @webpagelink  (CC: Donald J. Trump)"},{"comment_id":"1168212589885878","commenter_b":"Yikes!","commenter_a":"Ben may be a fair to middling Doctor but he needs a major lesson in history and about 20 years political experience.","post_message":"America deserves better."},{"comment_id":"1171128359565299","commenter_b":"How's he going to pay for the bloody wall????","commenter_a":"Showing a total and complete ignorance of understanding of the root of the problem.","post_message":"A big wall is the Swiss Army Knife of Republican politics."},{"comment_id":"10153167392250090","commenter_b":"Take out the trash... She is trash...!!!","commenter_a":"She should not be a president of anything","post_message":"We've seen what happens when our president ignores the American people—we WON'T let it happen again.  It's time for the truth about Benghazi. Demand answers from Hillary Clinton: @webpagelink"},{"comment_id":"863998766982005","commenter_b":"Women. Are. Psycho.","commenter_a":"not worth it.","post_message":"A woman has died in a car crash after chasing down her husband who was with another woman. What do you think? Crazy details here:"}]
