[{"comment_id":"10153889343021770","commenter_b":"i bet she tried to touch trump with her boobs..","commenter_a":"Lmao liberals","post_message":"BREAKING: Karena Virginia, a yoga instructor and life coach, appeared at a press conference Thursday morning accusing Donald Trump of touching the inside of her right breast in 1998."},{"comment_id":"1533770763589743","commenter_b":"Stupid!!!","commenter_a":"Idiots. I don't watch or care about that crap.","post_message":"Tonight at the Oscars, celebrities will be wearing gun control bracelets (paid for by the anti-gun group Brady Campaign), while being surrounded by massive amounts of armed security. Think any of them will note the irony?"},{"comment_id":"364748327062015","commenter_b":"get rid of her","commenter_a":"You just can't fix STUPID !","post_message":"Nancy Pelosi says Math is Hard  Can Understand the Difference Between a Funding Hike and a Funding Cut"},{"comment_id":"10152865753567014","commenter_b":"another embarrassing moment for Arizona media :/","commenter_a":"Yunuhen Tinoco Alfred Hernandez Monique Martinez Holst @username I'm ready to catch a big boy like this!","post_message":"We're going to need a bigger boat."},{"comment_id":"999642010128853","commenter_b":"Close the border! People that come to this country should not try to change it to suit their needs / religion. When they come here they should accept our customs and laws. If they don't like them.STAY THE HELL OUT! simple!","commenter_a":"Bullshit","post_message":"EVERYONE needs to keep this in mind tonight."},{"comment_id":"10156981805725725","commenter_b":"Someone should exterminate these lowlifes","commenter_a":"You sorry protesters making violence! Mr. Trump paid for that rally in Cali you only making yourself look bad @username will even make America great for you guys. Stop making yourselves look like fools!! Thanks Bernie for the awesome soundbite!! I think that is personally the best campaign slogan to help @username. \"Hillary Clinton had bad judgement.\" @username 2016!! MAGA! Get out and vote Indiana and California!!! We are behind you 100% Mr. Trump in Mississippi!! My in laws in California are voting for @username!! Across the nation Trump 2016!! Your vote matters love America and vote Trump!","post_message":"Thank you Costa Mesa, California! 31,000 people tonight with thousands turned away. I will be back! #Trump2016"},{"comment_id":"10153055939596051","commenter_b":"Prayers for the puppy and the staff taking care of her.","commenter_a":"Jail the creep, with his mouth treated the same.","post_message":"Remember the dog they found with her mouth taped shut? Well, good news."}]
