[{"comment_id":"1252390358183610","commenter_b":"He needs to be removed from office before he does something to endanger us all He is mentally unstable","commenter_a":"Why can't trump voters see this? The guy is mentally ill big time. All I ever hear is, he said he would create jobs! So let's put us all in harms way for the \"possibility of a few jobs.\" Just plain nuts! He's not going to create any jobs and if he does it's by being unlawful. 😡","post_message":"This explains a lot..."},{"comment_id":"10154655361619170","commenter_b":"She looks like calling us Deplorables. She should look in the mirror..","commenter_a":"And she belongs in a mental hospital.","post_message":"Here's what Hillary thinks about you. Now click to join us in a little experiment concerning this."},{"comment_id":"10153141332863984","commenter_b":"She's a complete idiot. Take care of your own bratty girls and leave Americans alone","commenter_a":"Hell yeah it is!!!our kids cant eat that crap","post_message":"Really, Michelle?  Do you think that Michelle's lunch program has been a colossal failure?"},{"comment_id":"1048428675208939","commenter_b":"@username What are you reading? How did the US government start this war? The Syrians and everyone else out in North Africa and the Middle East have access to the internet and make their own decisions. When people have access to information freely they act accordingly. People have free will to think and make decisions. No one forced the Syrians to fight or oust Assad. He cracked down on protests violently and this is the result.","commenter_a":"How can Assad sleep at night knowing he is responsible for the deaths of 300,000+ of his own people. It's disgusting","post_message":"What chance is there for peace in Syria? Join our Q&A"},{"comment_id":"10153230993584342","commenter_b":"No. Lol. I would have done that too.","commenter_a":"The restaurant manager obviously handled the situation poorly. She waited too long to intervene and then did it in anger. That is unprofessional. BUT.... The parent who allows their child to disturb all the people around them trying to enjoy a meal is inconsiderate and selfish! The excuse that the child is waiting too long for food is poor at best. You as a parent and should come prepared to entertain your child... That includes providing them snacks and toys. The parents should have removed that child from the table within 5 minutes of the unresolved tantrum. Yes... I am a parent and never allowed that to happen. Remember that you are not the only person in that establishment spending hard earned money to enjoy a simple meal!","post_message":"DINER OWNER YELLS AT CRYING CHILD: \"I turned around, slammed both hands on the counter and then pointed at the child and said, 'This has got to stop!'\" said Darla Neugebauer, after she says a toddler cried for more than 40 minutes. The child's mother is furious. Did the diner owner go too far?"},{"comment_id":"1770447173221488","commenter_b":"She's bitching because Trump will make her put on clothes lol","commenter_a":"She hasn't enough brains to have that much feeling for a cause","post_message":"Miley Cyrus has a clear message about Donald Trump becoming President."},{"comment_id":"10153991958186509","commenter_b":"Remember We are talking about illegal immigrants ILLEGALS","commenter_a":"Ricky Martin, go back to singing and dancing. Trump was referring to illegals....illegal is a status not a race. BTW, I'm not a Donald Trump supporter, but I can see the difference.","post_message":"Ricky Martin blasts Donald J. Trump for making \"racist, absurd, incoherent, and ignorant\" comments about Latinos. @webpagelink"}]
