[{"comment_id":"791067471028294","commenter_b":"1. Leviticus 25:44 states that I may possess slaves, both male and female, provided they are purchased from neighboring nations. A friend of mine claims that this applies to Mexicans, but not Canadians. Can you clarify? Why can't I own Canadians? fair price for her? 3. I know that I am allowed no contact with a woman while she is in her period of menstrual uncleanliness - Lev.15: 19-24. The problem is, how do I tell? I have tried asking, but most women take offense. 4. When I burn a bull on the altar as a sacrifice, I know it creates a pleasing odor for the Lord - Lev.1:9. The problem is my neighbors. They claim the odor is not pleasing to them. Should I smite them? 5. I have a neighbor who insists on working on the Sabbath. Exodus 35:2 clearly states he shuld I ask the police to ...","commenter_a":"Yes, Jesus Loves Murderers as well but this does NOT mean He condones the murderer to continue to murder. God created us ALL but the murderer was not created that way just as Homosexual was not either...a sin is a sin. The BIBLE is very clear in this. Sin is delighful & addictive & we tend to consume ourself in our sins hence why it's hard to detour ourself from sin...that's why we NEED Jesus Christ in our hearts. Jesus Christ was tempted in the dessert with everything you can think of yet he continued to tell Satan no & to flee. When Jesus was thirsty & hungry in the dessert & Satan tempted him with food & water He still said no. We have to do the same with temptation/sin. There is ALWAYS a way out of sin if we put ALL our faith/hope/strenth in Jesus Christ He will ...","post_message":"Trey Pearson, Christian Rock Star, Comes Out As Gay. On the other hand, we reported on Jackie Hill-Perry, ex-lesbian, on how God helped turn her life around. Her Story >> @webpagelink"},{"comment_id":"10152807087037434","commenter_b":"Sad & in no way did I consider her or her character on sex in the city a role model ! This is sad because she made a ton of $ pretending to be a woman that writes for a living- most (not all) writers know the definition of a word before the use it or wish for a movement in its name! Geesh SJP can't you pretend to be smart????","commenter_a":"I think people need to stop asking celebrities for their opinions on feminism. They are just as likely to be total ignoramuses as anyone else. Exhibit A right here.","post_message":"\"We would be so enormously powerful if it were a humanist movement.”"},{"comment_id":"10153968461605579","commenter_b":"Absurd! There are 50 muslim countries to accept muslim refugees!","commenter_a":"You know why I support the Syrian refugees coming to America? Because I'm not going to let the terrorists dictate my beliefs, ISIS doesn't scare me. What scares me is that we, Americans, are losing our sense of direction. I've thought about this refugee crisis for for quite some time now, if you don't believe me ask the Marines who I taught about the Syrian civil war in 2012. I've been aware of this conflict for quite awhile now, while the rest of the world turned a blind eye. Islamic extremists aren't going to scare me and they are not going to change my way of life or thinking. I am an American and I cower to nobody. When I see people fleeing danger I want to help, we as Americans want to help. If you turn away women and children fleeing death and destruction because of terrorist attacks then ...","post_message":"Should the U.S. accept Syrian refugees?  WATCH: U.S. House debate on #SyrianRefugees  LIVE on C-SPAN @webpagelink    WATCH: House Judiciary Committee SubCmte hearing on #SyrianRefugees,  LIVE on C-SPAN3 @webpagelink    Senate Homeland hearing on #ParisAttacks  LIVE at 2pm ET on C-SPAN3 @webpagelink"},{"comment_id":"1097784373632154","commenter_b":"He always stands up... Except for when it's time to bend over for Trump.","commenter_a":"I have never stopped liking Cruz...He always stands up for what he believe in...Sometimes that puts him at odds with other Republicans.","post_message":"Excellent question..."},{"comment_id":"793004177467954","commenter_b":"cuck","commenter_a":"Go take some selfies Obama you fucking disgrace","post_message":"Obama is a _______________."},{"comment_id":"175417336287166","commenter_b":"#ShesWithStupid","commenter_a":"Are so called democratic people stating that they only want decisions via a democratic process to agree with their views? Is the USA on the verge of Facism and is this coming from so called Democrats.","post_message":"Protesters gather in New York's Washington Square Park to rally against President Trump's policies. Watch on #FacebookLive."},{"comment_id":"10153744058143132","commenter_b":"She's Still A Douche!!","commenter_a":"Doughnuts? I thought she smelled like Dalmatians.","post_message":"You can finally relax, Ariana Grande's fragrance ad is here."}]
