[{"comment_id":"10153039923756037","commenter_b":"^ pathetic.","commenter_a":"Tranny.","post_message":"#MichelleObama relished watching children ride their bikes and walk their dogs inside the White House as she pushed her \"Let's Move\" campaign forward."},{"comment_id":"10153404039272293","commenter_b":"@username police kill blacks at a rate disproportionate to their total percentage of the population an assertion supported by The Guardian statistics. Police killed almost five black people per every million black residents of the U.S., compared with about 2 per million for both white and hispanic victims. @webpagelink","commenter_a":"Tamir was a 12 year old boy. TWELVE!!!","post_message":"\"I saw the weapon in his hand coming out of his waistband,\" one officer wrote in his statement. \"The threat to my partner and myself was real and active.\""},{"comment_id":"10153299711818037","commenter_b":"We'll have the latest on @username @ 5. New reports say 60 dead.","commenter_a":"Silvia, so glad yall are already back, scary 😁","post_message":"UPDATE: Paris police prefect Michel Cadot said all the attackers are believed dead, although authorities are hunting for any possible accomplices."},{"comment_id":"10154423395266800","commenter_b":"Bitch you trippin","commenter_a":"The way Trevor Noah struggles with jokes, hardest job seems to be Jon Stewart's replacement","post_message":"Think your job is a drag? Try being one of Trump's surrogates."},{"comment_id":"1949307655356344","commenter_b":"Lies alternative facts deceitfulness racism and separation was exactly what Obama and the Democrats have done way before Trump was elected....that is why he won and until democrats realize it then Trump will get 8 years. I am a registered Democrat and I realized in this election just how racist lying criminals they are I voted for Trump and will give him a chance. I will never vote Democrat again as long as they keep doing what their doing by destroying this country","commenter_a":"I am not a Trump fan but I do believe in freedom of expression be it what it may We all have a right to voice our opinion and if she chose do it the way she did we all have to respect that America has always been great and Trump did not bring that greatness he has brought lies alternative facts deceitfulness racism and separation of a great country . I only hope that he is stopped before he deletes all the greatness in which this country was founded on","post_message":"24 Hours After The Grammys \"Make America Great Again\" Singer Posts Stunning News"},{"comment_id":"938381199514967","commenter_b":"Take the bitchs baby she don't need it jus like her other ones","commenter_a":"We need to all really start to focus on the hard truth of meth and the sickening epademic that is in almost every big and small town across America . I'm tired of all of the meth head thieves , I can't even imagine how many children across America are going through the same life endangering situations becouse of the parents being hooked on meth .. don't spend the tax payers money on jail , send them to treatment for several months . I'm sure these parents were decent human beings before meth took over . Unfortunately now they have like all meth heads done sinister,and incomprehensible acts . It's good to see these kids have survived when so many others don't .","post_message":"Bond's set at $100,000 for each parent after they allegedly abandoned their three young children in a house that neighbors call a mess and fire hazard.   \"Rats that were running in and out of the garage. I mean, it was horrible.”"},{"comment_id":"10153644045081037","commenter_b":"Democrats do not want her. She can go away now.","commenter_a":"It's mean she's a Democrat, Yahoo.","post_message":"Should the candidates be concerned that a large portion of the “people” reading their tweets are fakes?"}]
