[{"comment_id":"10153676322456509","commenter_b":"Says the girl with gigantic tits and a gun in one of her photos...","commenter_a":"THUGS","post_message":"Dozens of motorcycle rallies will take place nationwide this weekend amid sky-high tensions after a biker gang shootout left nine people dead in Texas. @webpagelink"},{"comment_id":"991950690936939","commenter_b":"Looks can be deceiving. The slob has way too much power and his history is terrible.","commenter_a":"How is Bannon so canny?? He always looks like he just work up in a bus stop with a bad hangover and isn't 100 percent sure where he left his pants.","post_message":"Trump's aides also reportedly don't know how to properly turn the White House lights on and off."},{"comment_id":"10153847356156162","commenter_b":"It's sexual assault by two nasty woman....!!","commenter_a":"Working for tips...","post_message":"WANTED FOR TWERKING: Two women are being sought for sexual assault after twerking on an innocent man.  WATCH -->@webpagelink"},{"comment_id":"1644783155547189","commenter_b":"Not busted, she's been padding HER wallet for a L-O-N-G time! You guys are way late to the game..try doing some reading, I knew this, long ago!","commenter_a":"Meanwhile @ Standing Rock! Energy Transfer Partners, WHISPERS TO THE PROTECTORS YOU CANNOT WITHSTAND THE STORM.TULSI GABBARD, US VETERANS AND THE PROTECTORS WHISPER BACK \"WE ARE THE STORM!!!","post_message":"Busted!"},{"comment_id":"10154310787426130","commenter_b":"I'm very disappointed with Meg Ryan. She must be in the pocket.","commenter_a":"Actual, I think Richard Dreyfus won that one (see his tweet at the end of the article).","post_message":"Megyn Kelly set him straight."},{"comment_id":"1739336132953313","commenter_b":"Stupid bitch lmfao","commenter_a":"Obummer has been rode so hard by his tranny boyfriend that he has lost his mind and should be hung for treason.","post_message":"Q: What 4 words would you say to Barack Obama?  The Free Thought Project.com (y)"},{"comment_id":"10154054028806178","commenter_b":"Crazy woman.","commenter_a":"NYT - suck it.","post_message":"Did you see this coming?"}]
