[{"comment_id":"10155199620894411","commenter_b":"Unlike in shithole Islamic countries pedophiles actually go to jail here, instead of marry them. Get dunked on bitch.","commenter_a":"Ah yes, Islam propaganda to tell women to embrace their own slavery & destruction.","post_message":"Protesters claim that the full-face veil is an instrument of women 'self-empowerment'"},{"comment_id":"1788072574740832","commenter_b":"jesus Christ those girls look petrified","commenter_a":"@username @username 😱😱","post_message":"Parents in remote parts of Malawi are sending their daughters to be sexually initiated by local men - called \"hyenas\" - when they reach puberty. Meet Eric, he’s proud of his role as a \"hyena\". Learn more from BBC News Magazine: @webpagelink Listen to the documentary: @webpagelink"},{"comment_id":"1059297857458355","commenter_b":"bag your bags u/piece of pig shit bitch & go back or get killed soon","commenter_a":"bring this bigot home and throw her off the team.","post_message":"Seriously?"},{"comment_id":"1002708926488828","commenter_b":"Syrian refugees will be coming in legally. They will be documented and traced. If they wanted to sneak terrorists in the country they could do it through our southern border without much problem. AND they probably have. I would prefer that we only accept families and no single men.","commenter_a":"This breaks my heart","post_message":"If we don't know our history, we're doomed to repeat it.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1129640290462357","commenter_b":"My absolute joy will be when (not IF) Madame President is officially elected and we can all look back and say, once upon a time, Trump took out 15 Republican men, but 1 Democratic woman is the one who took HIM out. Music to my ears!!! I can't wait!!! All the haters NEED to get used to hearing Madame President. PERIOD, END OF DISCUSSION.","commenter_a":"I don't know what I'm more excited for- that Hillary is practically a guaranteed win or that I get to watch Trump fail miserably in front of the entire country.","post_message":"The Republican end times are here."},{"comment_id":"840275132829730","commenter_b":"It took you people 8 years to realize that,lol He is a Muslim born in Kenya and should have never been aloud to run for President!! PERIOD","commenter_a":"Like it is a suprise Not . Fools at least over half of those that voted . Voted for at the least has sympathy . Sick the same people that killed thousands . Americans voted in one that was raised Muslim . Sad","post_message":"Damning new evidence has arisen regarding Obama. There is no question now that Obama is not who he says he is. Do you agree Obama is a Muslim?"},{"comment_id":"607613792773547","commenter_b":"If this does not touch your heart nothing will amen","commenter_a":"Get that rotten PIG .","post_message":"FALLEN - NOT FORGOTTEN: The community is gathering for a vigil honoring two fallen heroes - Master Sgt. Debra Clayton of Orlando PD and Deputy Norm Lewis of the Orange County Sheriff's Office.  Meanwhile, the search for Markeith Lloyd continues: @webpagelink"}]
