[{"comment_id":"10154490644508132","commenter_b":"But she was slimer before","commenter_a":"Her body is not well balanced is too much up in the chest ... too much on her Back .... Kourtney and Kendall bodies are better","post_message":"Kim Kardashian West traded her neutrals and furs for a bold vibrant look! (via PeopleStyle)"},{"comment_id":"609328869267784","commenter_b":"Racist woman","commenter_a":"It's always been great.","post_message":"Beyoncé appeared Monday night at the Grammys and led a visual and musical performance celebrating motherhood."},{"comment_id":"10155080239376037","commenter_b":"Wow, just wow! How much tin foil DO you go through a week???","commenter_a":"Being \"sold to us\" as home Terrorist attack.... Each minute the MSM spews more misinformation pushing their Naritive. My guess , MK Ultra mind control at work...., , distraction? Agenda? To be determined. ?..","post_message":"Suspect Esteban Santiago, who was carrying a military ID, allegedly opened fire, killing at least five people before being taken into custody."},{"comment_id":"1087900891233676","commenter_b":"The country would be safer if deported the republican/Tea Party.","commenter_a":"Thats why this year to come. I invite all registered voters to hit the polls. So this son of biatch don't win.","post_message":"After seeing Trump on TV, 8-year-old Sofia was terrified that the army was coming to take her away."},{"comment_id":"10155922469974199","commenter_b":"All he's got to do is offer residency or citizenship to all of the workers who are here illegally and who are will to work on the wall for minimum wage and he could probably build that wall for 5 billion. And technically Mexico would be paying for it.","commenter_a":"This man is a joke and you guys really elected him. We are all doomed under his watch","post_message":"President Donald Trump tweeted Saturday that he is aware of the new costs estimates for the proposed wall along on the U.S. border with Mexico.   A government analysis suggests the wall could cost $15 billion, and possibly as much as $25 billion.  How much are you willing to pay for the wall?"},{"comment_id":"709751369215441","commenter_b":"Yea I support Texas and believe no Muslims belong in America","commenter_a":"Rigth on Texas","post_message":"Texas is standing up to the invasion of Muslim refugees. Don't mess with Texas. Do you support the great state of Texas?"},{"comment_id":"979819422085921","commenter_b":"@username don't curse Canada with the likes of people like her. Send them to mexico!","commenter_a":"Just because a person is an actor/actress does not mean they know their head from their a$$ ... proof right there in that statement","post_message":"Americas Freedom Fighters"}]
