[{"comment_id":"10153746096543984","commenter_b":"shut Obama down, stop paying congress until they do their jobs","commenter_a":"not a dime til this is resolved","post_message":"Obama has just announced the number of Syrian refugees the U.S. will take in, and liberals aren't too happy about it.   What do you think the U.S. should do about the Syrian refugee crisis?"},{"comment_id":"10154240737001323","commenter_b":"Too bad she is going to lose in November, she won't be able to cheat so easily then","commenter_a":"Trump a sure winner","post_message":"Hillary Clinton declared victory over Bernie Sanders Tuesday."},{"comment_id":"1439684252723748","commenter_b":"Hilary is definitely not as bad. You got complacent about gore in 2000 and inflicted gwb and eight years of mayhem on the rest of the world","commenter_a":"Lord have mercy on everyone in the world if he's elected president. Somebody keep that from happening - pleeeeeease ...","post_message":"Donald Trump is spiraling out of control."},{"comment_id":"2180394368851633","commenter_b":"I saw this same exact comment today😂","commenter_a":"I am confused why people telling me they voted for trump somehow grants them some sort of mythical powers now that they think they didn't have before. It was a vote, not a sword delivered by the lady in the lake.","post_message":"This lady clearly has deeper issues!  #WSHH"},{"comment_id":"10153567844472434","commenter_b":"Carol Adams you're mentioned here and might enjoy, grrrl!","commenter_a":"Unfollowing. I'm tired of your anti-vegan rhetoric. The fact is that eating meat is the largest contributor to climate change. It is an industry that is notorious for violating human and animal rights and destroying the global environment.","post_message":"Anything mass produced is shitty for the environment, including almond milk."},{"comment_id":"880895332040553","commenter_b":"@username Didn't you get the memo? Pussy Liberals are NOT allowed to live in Texas... GET OUT","commenter_a":"Thank you @username for picking Mike Pence as you're running mate. Thank you thank you thank you God bless you both","post_message":"Mike Pence won big. We should all be proud of Mike!"},{"comment_id":"10153061361762235","commenter_b":"Actually, she's not a Texan... she's a writer from Michigan... and she can take I-35 North and get her ass outta my state!","commenter_a":"Think this is the Wicked Witch of Texas!!!! She is mean and crazy!!!!!","post_message":"American Taliban."}]
