[{"comment_id":"10154601814298812","commenter_b":"Beaver girl you are the lowest BS, send you to middle east good luck, Israel girls know how to fight, and the Frenchie girls know how to fight, you know like the French under ground","commenter_a":"Maybe they could present plans to \"Make America Great/Safe/White/America again\" Instead of hosting the \"We hate Hillary\" show. They really do just pander do the lowest common denominator.","post_message":"So far, speakers have mentioned Hillary Clinton an average of just over six times in evening speeches at the GOP Convention."},{"comment_id":"10153382589804411","commenter_b":"shutup bastard","commenter_a":"Fuck them they are just as much terrorists as Isis","post_message":" we are facing a kind of danger that is unprecedented in history, which targets humanity itself,"},{"comment_id":"10153544587506350","commenter_b":"Real women dont need all that! They are content with the gift of life they just grew in their body for months!!!! This is a little overkill.","commenter_a":"Oh good grief...isn't the baby enough to show off? Must one be materialistic to have to have a push ring?","post_message":"Push presents (the bling or gift an expectant mom is given for, um, pushing) are getting more and more popular."},{"comment_id":"481313708745082","commenter_b":"nimby. they do not want to see oil rigs, how ever it is okay to strip mind in my back yard to get sand to build the roads to their beachfront homes. what a bunch of hypicrites.","commenter_a":"Thank you @username for your support for our coast !!","post_message":"With all the updates today, I wanted to make sure that you caught this earlier post with my statement on the Administration’s decision to protect the Atlantic from offshore drilling...so I’m sharing it again."},{"comment_id":"1242112452475449","commenter_b":"REMEMBER!! ..The Leftist Liberal News Agencies, pushed very hard for the E.U. to take in the Islamic Immigrants with Islamic Ideologies.","commenter_a":"Islam is a cancer and needs to be removed","post_message":"President Obama says the killings in Paris are \"an attack on the civilized world.\" For more coverage: @webpagelink"},{"comment_id":"1656487827976632","commenter_b":"\"a balanced choice between having a heart and having a brain.\" Really? Who wants to vote for a thyroid? ha.","commenter_a":"@username is a balanced choice between having a heart and having a brain. The two are not mutually exclusive. #JohnsonWeld2016 #Libertarian #FreedomEquality","post_message":"Sarah Silverman and Bill Maher spent a portion of Real Time with Bill Maher Friday wondering why 29 percent of millennials – many of them former Bernie Bros – have ticketed their vote to Libertarian candidate Gary Johnson instead of Hillary Clinton. \"Gary Johnson is a fucking idiot,\" Maher said."},{"comment_id":"10152979209831770","commenter_b":"Let's make her the next target. I doubt if anyone would miss her.","commenter_a":"She knows that is not true.","post_message":"Congresswoman Gwen S. Moore thinks Scott Walker's policies are \"literally\" lynching black people."}]
