[{"comment_id":"10153536976196336","commenter_b":"Talk to Moon beam aka governor Brown of California. It is in San Francisco that an illegal alien killed a beautiful person. He encourages sanctuary cities for illegal immigrants and lets them get drivers licenses and so with liberals it's take from the people who work and pay taxes and let them pay for all the illegals. I don't want to give my hard earned money to whatever the state chooses to spend it on but liberals will continue until they are ousted. And that goes for Republicans as well. No one in either party deserves to hold office if \"our\" welfare doesn't come first. And I don't mean welfare as in free stuff.","commenter_a":"what...how can any illegal alien hold a government position? Oh yeah...California the land of goofballs.","post_message":"\"This is worse than sanctuary cities. Now we're giving them sanctuary boards.\" – Neil Cavuto"},{"comment_id":"10153572357110667","commenter_b":"Penny Henderson can you imagine all the hysterical women...","commenter_a":"There are no wrongs or rights in that situation.. But... I wish everyone had gone quiet and not screamed out, if everyone was silent I wonder would the animal have behaved differently.. Just a thought.. And if the animal was not scared by the screaming, perhaps a tranquilizer shot could have been used... Perhaps we need to have some strict guidelines for us humans visiting zoos,","post_message":"If a tranquilizer dart, which takes five minutes to 10 minutes to work, had riled Harambe, the child might have been killed. Imagine the uproar then.  More from USA TODAY Opinion:"},{"comment_id":"1420510454708671","commenter_b":"i wonder if there will be a point when the majority, or at least, SOME, Republicans will grow some balls, and say ENOUGH???.....and i just sent an email to both of my state's gutless excuses for elected officials and pledged my unwavering dedication to get their sorry asses whipped come next election...","commenter_a":"Lol your funny Trump you don't have all the control like u think u do lol","post_message":"Got him!"},{"comment_id":"10153099972135329","commenter_b":"Nah, I don't think I will.","commenter_a":"Someone needs to give him his balls back.","post_message":"BuzzFeed Books editor Isaac Fitzgerlad wore makeup for a week, here is what he learned."},{"comment_id":"10154637985014614","commenter_b":"This is not ordinary little sedan, ya know, lady!","commenter_a":"if they wanted to stop him they'd of poped his tires already","post_message":"Update: California Highway Patrol officers were in pursuit of a stolen big rig on the eastbound 10 Freeway in Riverside County early Tuesday afternoon, authorities said. @webpagelink"},{"comment_id":"10153540575624411","commenter_b":"with Californias massive extreme drought, its like a match head waiting for a strike anytime any place.","commenter_a":"accidents happen anywhere why blame beautiful California. Nothing like California in this whole WORLD!!!!!!","post_message":"Watch: Huge forest fire sweeps highway in California"},{"comment_id":"10154937686570329","commenter_b":"They must belong to one sexy mother fucker","commenter_a":"Those are some sexy thighs","post_message":"END OF STORY."}]
