[{"comment_id":"1057273917621602","commenter_b":"No lol","commenter_a":"One world order ?","post_message":"You can't possibly understand America's greatness if you look at this country as nothing more than a series of grievances that need to be addressed.  You can't see greatness at the same time you see that."},{"comment_id":"10153405102629255","commenter_b":"Josh Duggar,Dennis Hastert,who's next.. Gawd let it be Ted Cruz!","commenter_a":"I think he's another Sandusky","post_message":"This scandal is getting dark—fast."},{"comment_id":"1547140315578990","commenter_b":"She a piece of crap","commenter_a":"Sheboon","post_message":"Michelle Obama proudly stands by the work she's done to get healthier lunches in public schools. Do you support or oppose the First Lady's efforts?"},{"comment_id":"10153923556708690","commenter_b":"they will unfortunately forever be in western countries, untill all western countries are taken-over by muslims, because western countries have welfare system, none of the arab countries have a social welfare system like western people... so only when social welfare is completely destroyed like in sweden, they will have to get back to survive.. (^_^) sweden has taken in so many muslims it completely destroyed the economy.. destroyed women lives, destroyed everything. welfare is completely drained","commenter_a":"Maybe Muslims should stop migrating to Australia than and instead migrate to the arab countries.. Why don't they? Why do muslims prefer to migrate to democratic Australia and the western countries rather than the sharia-ruled arab states?","post_message":"A November survey by two universities and a research centre suggests that Muslims in Australia experience racism three times the national average. @webpagelink"},{"comment_id":"1186000464791726","commenter_b":"Rest in peace sir. #endofwatch","commenter_a":"R.I.P.","post_message":"RIP OFFICER PATRICK ZAMARRIPA: Hundreds have lined the highways along the route where DPD Police Officer Patrick Zamarripa's body is being driven to its final resting place."},{"comment_id":"10157535598360389","commenter_b":"The press just like the FBI is covering for Hillary!","commenter_a":"The media are stupid and if it was not for Mr. Trump running against their Idol they would not have a paycheck. They all need to take a long vacation and never come back. There grins are annoying.","post_message":"Question of the Day: What do you think of some of the press' softball questions to Hillary Clinton? Share your thoughts below!"},{"comment_id":"10153262230564255","commenter_b":"Evil like this should be flogged. He's a monster like the rest of the TeaParty Jerks.","commenter_a":"I truly believe this man, Ted Cruz and their followers have very warped brains that will only bring greater harm to the world than Dubya/Cheney created and we are still trying to repair! They whole group needs to be tried and sentenced to jail for 3 years for TREASON!","post_message":"Losing his grip on reality, or lying shamelessly?"}]
