[{"comment_id":"960942283946630","commenter_b":"and the worse thing is, women are doing the cutting. sick sick sick","commenter_a":"horrible","post_message":"Female genital mutilation is a human rights violation. And it happens way too often. - Laura Willard"},{"comment_id":"1619461488113974","commenter_b":"Fuck Rosie!!! Stay fuck out of the U.S. no one misses u ... we promise!!!","commenter_a":"She was right about one thing. She truly is one sorry individual.","post_message":"Keep 10 year-old Barron out of politics!"},{"comment_id":"713245288832825","commenter_b":"I guess you are one of those women","commenter_a":"Yessss lets celebrate that we have a president think women can be treated like trash and women can stay at home creatimg babys. You women that voted him should celebrate for that","post_message":"Watch as President-elect Donald J. Trump and Vice President-elect Mike Pence kick off their  you tour in Cincinnati, Ohio."},{"comment_id":"10154641793644614","commenter_b":"She's a freaking pig!","commenter_a":"Hope she rots in hell!","post_message":"The mother of Victoria Martens, the 10-year-old girl who police say was drugged, raped and killed, had allegedly used an online dating website to arrange for men to sexually assault her daughter in the past, according to a search warrant.   After her daughter was brutally killed, Martens told police that she watched her boyfriend, Fabian Gonzales, assault the little girl \"for sexual gratification,\" according to the criminal complaint.  (Warning: The below story contains graphic and disturbing content)"},{"comment_id":"10152687938146813","commenter_b":"So what? Some women don't want to have kids at a particular time. Some never want to have kids. Second, most women who have abortions do so because of financial reasons. Third, contraception isn't 100% effective. Some types are only 75% or so effective. The diaphragm in a multi-para woman has a low effectiveness rate. I've been pregnant twice on oral contraception. Each woman has her own story. If she wants to tell it, she will. Otherwise, it's none of your damned business. Oh, and if my body is affected, it is my choice. I have self-autonomy over my body.","commenter_a":"Abortion is not a method to avoid pregnancy; a woman can avoid pregnancy by using birth control provided to her for free and not getting herself pregnant. Abortion is, in reality, simply a way to avoid MOTHERHOOD; it's not 'my body, my choice,' it's 'my LIFESTYLE, my choice.'","post_message":"The question matters: More people support abortion rights when the poll language focuses on women. #LetsTalk @webpagelink"},{"comment_id":"548837575304535","commenter_b":"Bill Clinton could get away with anything.....all Hillary has ever cared about is \"power\". God forbid her from being President.","commenter_a":"Butch and Billy Americas First family good replacement for the Kennedys","post_message":"They can't cover this one up!"},{"comment_id":"10153389397913352","commenter_b":"This women is a rachett ass lier! What a waste of space on my news feed, ya girl aint tellin the truth boo","commenter_a":"So weed paralyzes now sheesh isn't this story bullshit hahahah lmfao weed cures not kills or \"paralyzes\"","post_message":"Mother says her daughter, 17, has been left PARALYZED by a pot brownie she bought from a classmate at high school"}]
