[{"comment_id":"542951289163244","commenter_b":"That cunt, is one letter away from ruining my name!","commenter_a":"This whole thing just happens at the EXACT SAME TIME OBAMA ANNOUNCES ILLEGAL EXECUTIVE GUN CONTROL ORDERS! This was a set up to drum up support from the sheep for this gun control garbage that will circumvent or HIPPA privacy. I for one feel that the government shouldn't have access to anyones medical records to see if they are crazy by THEIR STANDARDS, which are pretty fucked in the first place... I do not trust the most narcissistic, psychotic, murderous people in our country to choose who gets to protect themselves and the rest of us. This whole thing is under the guise of mentally ill not being armed. People that have guns will now redusr to get treatment they may need for fewer of the government coming and taking their guns by force. anyone that has EVER had treatment will loose their guns by a man with a gun ...","post_message":"So much for taking on the tyrannical federal government, ehh?"},{"comment_id":"10153744058143132","commenter_b":"She's Still A Douche!!","commenter_a":"Doughnuts? I thought she smelled like Dalmatians.","post_message":"You can finally relax, Ariana Grande's fragrance ad is here."},{"comment_id":"10153644186381336","commenter_b":"If our courts allow Muslims who demand to be tried under Islam law, to actually be tried under Sharia law - why can't Christians demand be tried under Christian Biblical law? Courts allow it for Muslims. This raises a constitutional question - Under the 'Equal protection Clause' of the 5th and 14th Amendments, should Christians be afforded equal protection under the law - to be tried under Biblical law equal to Muslims demanding to be tried, and their case(s) adjudicated for crimes under Sharia law?","commenter_a":"Why can't another clerk do it ??? Problem solved !","post_message":"“Some people have said I should resign, but I have done my job well,” Rowan County Clerk Kim Davis said in a statement."},{"comment_id":"10154244362139411","commenter_b":"@username - Shut up bitch","commenter_a":"I can just see a flood of poor women getting pregnant so they can sell babies. What a terrible idea. Plus the fact that many which grew up in a state foster home become criminals if not adopted early","post_message":"'Chance to live'"},{"comment_id":"10153444924104312","commenter_b":"Because it would cost pharmacutical companies lots of money if they didn't have cancer and other illnesses. Basically, all it is is reducing the amount of acid you put into your body from drinking soda, etc. They even make stuff you add to your water to alkalize it. Things like soda, obviously, and even milk although it is alkali in the container, once ingested it turns acidic and wreacks havoc on your body. Lemons, albeit acidic on the outside actually turn alkaline once ingested. You can actually look up guides to acidic and alkaline type foods. If you go to a Walgreens, health store, or wherever and pick up a roll of test strips in the health aisle, you go home, pee in a cup/container, dip the test strip in and look on the chart to see how much acid is in your body, then you take the steps necessary ...","commenter_a":"Want the cure? Eat right and use alkaline test strips until you test as alkaline as possible. Cancer feeds off the acid in the body, the more acidic you are, the better chance of the cancer spreading. If you are alkalized, cancer has nothing to feed on.","post_message":"A young woman has become the first person in the world to give birth to a healthy baby using ovarian tissue that was removed and frozen when she was still a child."},{"comment_id":"10153528204119497","commenter_b":"Ha!","commenter_a":"I see the girl inviting us to like her page is already here.","post_message":"\"I could make somebody happy, I am loving, and I deserve to be happy, too.\""},{"comment_id":"10154250481564032","commenter_b":"There have been no riots in Arizona. But I absolutely agree with the voting statement.","commenter_a":"If these rioters would've spent this much effort & time and actually woke up, got out of bed and VOTED.....they wouldn't have this problem.","post_message":"There have been several \"Not My President\" demonstrations in large cities and school campuses across the country."}]
