[{"comment_id":"557140984486841","commenter_b":".....Hypocrite HILLARY SAYS DONALD DOES NO RESPECT ALL AMERICAN AS SHE HAS NO RESPECT FOR AMERICA OR AMERICANS ONLY GLOBALISM....HILLARY HAS LOST HER WAY SHE HAS FORGOTTEN THIS IS OUR HOME 'AMERICA'. WE WANT TO KEEP OUR FAMILY SAFE!, WHILE HILLARY JUST WANTS TO APPEASE THE ILLEGALS ..","commenter_a":"#NeverEverHILLARY PERIOD!! #BILLANDHILLARYCAREERLIARS","post_message":"Hillary Clinton’s actions constitute all of the elements of a major criminal enterprise - she created a private illegal email server in order to hide her corrupt dealings. She did so knowing full well it would put American lives at risk by making classified information highly vulnerable to foreign hacking. But, she didn’t care – as long as it helped her get away with her crime, no risk to America was too great.  Then, to further cover-up her crime, she deleted 33,000 emails to keep them out of the hands of authorities and the American public.  As a further element of the criminal cover-up, she claimed under penalty of perjury that she turned over all of her work related emails. We now know this to be one more massive Clinton lie. The FBI found thousands of work-related emails she failed to turn over, including the new discovery this week of 15,000 more work-related emails she failed to disclose.  What is being uncovered now is one of the most shocking scandals in American political history."},{"comment_id":"10153049947289170","commenter_b":"From the info I have seen, they have entire areas that could just be surrounded and taken out......all those \"unsafe for non-muslims to enter\" areas......","commenter_a":"At least someone in power will acknowledge these Muslim terrorists need to be taken out! The problem is they have almost completely taken over France at this point. Apparently France has over 750 No-Go zones in which only Muslims are allowed to live and travel in these territories. Sadly the govern has let them take over like this.","post_message":"I guess this was some reality check."},{"comment_id":"10153835568288128","commenter_b":"@username what have china done unto the hongkongers?","commenter_a":"Really disgusting actions by these locals. Edit: Not saying I don't understand why this is being done, but a better way to express their discontent than this is still something to be desired for.","post_message":"Fans defied warnings from the Hong Kong Football Association against booing the Chinese national anthem at Tuesday night’s match."},{"comment_id":"1333345700010236","commenter_b":"get over it Bitch","commenter_a":"Of course his idiotic supporters fall for it. He's giving himself a massive tax cut which pales in comparison to his pittance of a presidential salary. He forgos the salary and looks like hero as he robs us blind. It's not even a good con but his supporters are great marks","post_message":"Trump says he already has enough money, so he's going to work free of charge as president. Do you admire his decision?"},{"comment_id":"964951150247780","commenter_b":"Prove it!","commenter_a":"I support our troops; I support allowing them the victory over our enemies...","post_message":"BOOM!! If I were ISIS, I'd already be looking for cover. The U.S. Military isn't messing around here.   Do you support our troops?"},{"comment_id":"10153770425869153","commenter_b":"You can't possibly be that stupid Christine ....","commenter_a":"just read where radical islamic muslims will come in with Syrian refugees so yes I agree with Trump","post_message":"What are your thoughts on Donald Trump's comments?"},{"comment_id":"511047909019803","commenter_b":"Throw that racist bitch out the door!","commenter_a":"BLM, Black Panthers, Farrakhan -- any of those available? Why would you not use them since you hold them in high esteem?","post_message":"Beyonce bashed cops at the Super Bowl but is now asking for their help. They want her to find a way to protect herself."}]
