[{"comment_id":"1115505231842557","commenter_b":"Because there are so many foreigners in London working illegally, they can't keep up!!","commenter_a":"They shouldn't be allowed to operate, they're all rip off merchants on benefits, why does tfl turn a blind eye.","post_message":"'How do you charge £600 for half-an-hour?'"},{"comment_id":"1057781130958942","commenter_b":"Hmmm... say the Lil bitch talking shit on Facebook","commenter_a":"Wtf that nigga a pussy how you going to slap another man and walk away straight pussy.... I would of shot that nigga since he want to duel","post_message":"The disrespect!"},{"comment_id":"10153490575133854","commenter_b":"Can some one just shut her up for a year or two ? Talk about a bullshiter.","commenter_a":"Take the guns from her handlers!","post_message":"Hillary Clinton Denounces White Privilege, Calls for Taking Guns From ‘Those Whose Hearts Are Filled With Hate’"},{"comment_id":"10153341871609411","commenter_b":"Lady is.Europe.is ur ultimate paradise huh wow, what's ur talks pointing out? Ur a pervert who looks at European ladies as 'new lady to rape'? U think European ladies are the ultimate ones in world? U must be an ignorant fool since birth","commenter_a":"Just thinking about sex is not life, u can be happy with out thinking about sex Thinking of sex make us animal and blind and leads u to rape a new woman","post_message":""},{"comment_id":"10155922469974199","commenter_b":"All he's got to do is offer residency or citizenship to all of the workers who are here illegally and who are will to work on the wall for minimum wage and he could probably build that wall for 5 billion. And technically Mexico would be paying for it.","commenter_a":"This man is a joke and you guys really elected him. We are all doomed under his watch","post_message":"President Donald Trump tweeted Saturday that he is aware of the new costs estimates for the proposed wall along on the U.S. border with Mexico.   A government analysis suggests the wall could cost $15 billion, and possibly as much as $25 billion.  How much are you willing to pay for the wall?"},{"comment_id":"989439721086384","commenter_b":"Thank you, Senator for being on the right side of this issue.","commenter_a":"How dim do the gun owners have to be, make guns so easy to use, and easy to get and they can't figure out why there are so many shooting? Clowns.","post_message":"Our hearts go out to the families of the victims and to the community of Lafayette. Once again the scourge of gun violence has claimed the lives of innocent Americans in a place where they have every right to feel safe. This chilling crime is yet another reminder that gun violence can strike anywhere, at any time.  When will Congress act to reduce gun violence?"},{"comment_id":"1770447173221488","commenter_b":"She's bitching because Trump will make her put on clothes lol","commenter_a":"She hasn't enough brains to have that much feeling for a cause","post_message":"Miley Cyrus has a clear message about Donald Trump becoming President."}]
