[{"comment_id":"1107115119405265","commenter_b":"I've heard more sense coming from a crack head","commenter_a":"Can't these people realize somebody is going to have to pay for \"free school\"?","post_message":"ClashDaily.com"},{"comment_id":"555357001316722","commenter_b":"@username open your eyes hill right hand person Muslim female yea so Trump might not be perfect or what this country really wants but he is 100 times better then hillary","commenter_a":"Mitt I actually liked you and voted for you! Thank you for giving me even more reasons to vote for an outsider! All of you politicians disgust me and are hypocrites! #trump2016","post_message":"WATCH: Mitt Romney slammed Donald J. Trump as \"a fraud\" and called on the 2016 GOP candidate to release his tax returns.  What do you think of Romney's speech? @webpagelink"},{"comment_id":"642371742620071","commenter_b":"Her fat ass needs to get a job and off the government tit. She is a disgrace to the white race.","commenter_a":"Th dems way of welfare hz put many ppl out of th mindset of personal responsiDAMNbility!!!?","post_message":"This woman claims she deserves more welfare than others.  This is unbelievable. Let's kick this woman off welfare immediately.  Should she be forced to pay us back?"},{"comment_id":"1022904834453429","commenter_b":"@username TAKE YOU IGNORANT AGNOSTIC SELF AWAY....AND LEAVE THESE NICE PEOPLE ALONE ....TROLL!!!","commenter_a":"No. I don't think this God has anything to do with politics whatsoever. It's important to keep religion and politics seperate. Besides, this isnt even an important thing to be concerned about. There's a lot pressing matters to attend to than putting a God back into the government.","post_message":"SHARE IF YOU AGREE!"},{"comment_id":"10153663698070950","commenter_b":"I am not goin any where...I am a women of God and you need to read your bible,and as far as my gun,i carry it every where i have a permit and the right to carry it","commenter_a":"All of these peoplev are goin to hell if they dont frepnt,And im not giving my gun up for noone,im a responsable gun owner and its my right to carry a gun.....All these gay people need to repent cause he is coming back!!!","post_message":"Motorcyclists, parade-goers march on in L.A. march on during their annual gay pride parade:"},{"comment_id":"1134902403269479","commenter_b":"If they think it's so needed, why hasn't it been in place to stop rape before?","commenter_a":".","post_message":"Things just got seriously DANGEROUS for trans students in North Carolina..."},{"comment_id":"1906450522914712","commenter_b":"Also, men have their own issues. To claim that MRAs are bad people is simply a generic shaming tactic often employed by feminists. Reminds me of the White feather movement...","commenter_a":"Pretty discouraged reading many of the comments to this post. Fellow Bernie supporters, it would be great if you stopped living up to the misogynist label Clinton supporters have put on us as a group. Piling on here to deny that the wage gap exists is not helping.","post_message":""}]
