[{"comment_id":"10153035169591051","commenter_b":"Execute her how could she","commenter_a":"They are raising a bunch of animals!","post_message":"This 14-year-old killed a 2-month-old because she didn't want her mother to adopt the baby girl."},{"comment_id":"1701571813463264","commenter_b":"Carly without a doubt!","commenter_a":"No question Carly","post_message":"Poll: Who Would Be A Better President, Carly Fiorina or Hillary Clinton  (A) Carly Fiorina (B) Hillary Clinton"},{"comment_id":"10153684689187061","commenter_b":"MariaNconnor Evans","commenter_a":"I work saturdays....","post_message":"The feeling when you realize tomorrow is Friday...   -- CLICK TO PLAY GIF --"},{"comment_id":"10153661295271955","commenter_b":"You have the hots for Hillary... admit it already :)","commenter_a":"Weak weak weak.","post_message":"BEING BORING: CBS ENDS DEM DEBATE 7 MINS EARLY"},{"comment_id":"495888253922598","commenter_b":"I don't know many people that leave the doors to their homes unlocked when they leave for the day, when they go to sleep at night or just go about living with their family and friends. Also I don't know anyone that does not ask guests to leave at some point after a visit. Additionally most people use common sense to screen individuals that enter their homes. If the individual being considered as a guest is affiliated with a suspect group we error in the side of caution to protect or family and do not invite that individual or their affiliated friends into our home. In comparison to legal and illegal immigration into the USA it seems like the Democrats are telling us to unlock your doors while you sleep, don't use the locks on your doors while you watch TV, and when you leave for the day leave your ...","commenter_a":"The parallel is Jews = Christians. Not hitler to trump. Hitler killed the Jews. Not the other way around. Radical Muslims are killing Christians and Americans. Get it ?","post_message":"It would not surprise me either! What I am seeing & hearing from around the country is disturbing. Time for us all to #MakeAmericaGreatAgain. Remember! We need to energize EVERYONE to get out and VOTE!#Trump2016"},{"comment_id":"10154356048051002","commenter_b":"Women cause cancer to men with there drama lmao. Jk","commenter_a":"What doesn't cause cancer these days???","post_message":"Like your daily hot dog or bacon sandwich? You may want to think again."},{"comment_id":"10155034427609197","commenter_b":"@username you need to kno this too, @username n Dayna Bianca Haskins too. Pass the word..","commenter_a":"@username fyii","post_message":"Could finding something on your car hood mean your safety is at risk? See why one woman's Facebook post is going viral!"}]
