[{"comment_id":"10154514668258701","commenter_b":"So, she thinks it's ok for POC to be racist. I see what she did there","commenter_a":"I don't understand why anyone would be upset by this, I mean hell, give this article a few hours and there will be plenty of examples of white hate towards POC in the comments, I see some already. I don't blame her for wanting to keep her room a safe place for herself and her roommate.","post_message":"\"I do not hate white people. That's not what I screamed in that post. What I screamed in that post was I am eagerly desperate to create a safe space on this campus in order for me to return and be successful here.\""},{"comment_id":"1084559504898393","commenter_b":"It altars your natural hormomes! Explains why there are so many beta bitches running around. Wonder if the artificial hormones affect future children somehow too","commenter_a":"@username 😬","post_message":"Could the pill be altering your brain?"},{"comment_id":"10153586502256336","commenter_b":"It's about time somebody is sticking up for the ppl that are born here & paid taxes, the illegals come here & get all the benefits we can't have, plus they're here to vote so they can get all the free stuff","commenter_a":"I believe that Mr. Trump will do better for the American people. And bringing back our Jobs.","post_message":"\"Our elected leaders in Congress and The White House have chosen to stand down as the sovereignty of our great nation has been violated,\" Todd Starnes wrote."},{"comment_id":"1026880740704736","commenter_b":"Crazy runs deep in that family","commenter_a":"Still 'illegal' still a liar and still not eligible for being in Congress or running for president...","post_message":"Da'fuq?"},{"comment_id":"10155002538802178","commenter_b":"Please NO MORE ! Can't stand that woman, Muted ever time I seen her appear","commenter_a":"Well hopefully I will never have to see that white haired women doing Holdings commercials ever again now that it is over. During the evening news that same commercial ran 4 times an hour.","post_message":"BREAKING NEWS: Three-term 2nd District Congresswoman Renee Ellmers has lost the Republican primary to fellow Congressman George Holding, who ran in her district after a court-ordered revamp of North Carolina's congressional map moved his 13th Congressional District out of the Triangle, according to The Associated Press. Follow the latest developments at @webpagelink"},{"comment_id":"825435090838373","commenter_b":"Low life piece of craps lock her away and throw away the key.","commenter_a":"Sick sick sick! Just beat her senseless for this. That poor innocent little girl. Hopes she rots in hell!","post_message":"This woman allegedly faked cancer to cover up a horrific crime:"},{"comment_id":"10156446544055594","commenter_b":"That woman needs alot of things","commenter_a":"We all only have so many minutes that make up our lifetime. This is a premeditated act of terrorism for which they should all be jailed for a minimum of a year.","post_message":"LIVE video and coverage as protesters are being removed and traffic is backed up on the Bay Bridge."}]
