[{"comment_id":"10153936928466130","commenter_b":"Tell his ex wife that. She's the one plastering the photos to every tabloid she can find.","commenter_a":"This is so incredibly none of anyones business--","post_message":"Amber Heard claims she’s the victim of repeated incidences of domestic violence."},{"comment_id":"10153570672510667","commenter_b":"Are you kidding!? Heartbreak isn't legal punishment - she needs to be jailed!&","commenter_a":"This is horrific! My heart aches for the mother...I know they all should have had their seat belts on, but they were old enough to know this. I don't think the mother should be charged because she will relive this over and over and over and over again...it will haunt her for the rest of her life. God be with her.","post_message":"Three girls were killed and six others injured when an SUV carrying 11 people had a tire malfunction and crashed on I-95 in Titusville, Fla. @webpagelink"},{"comment_id":"1314229205273274","commenter_b":"Stupid, greedy women who don't respect themselves LOVE Trump. I mean, look at his wife.","commenter_a":"So they're trying to use looks to get people to vote for a man who half his party do not even like.","post_message":"People started freaking out when the hashtag #TrumpGirlsBreakTheInternet started trending Sunday night."},{"comment_id":"10154146599832541","commenter_b":"Can we deport you? Bigots not needed in America.","commenter_a":"Aren't Obama's illegal immigrant aunt and uncle still here? They should be top priority for deportation.","post_message":"Joel LaPierre will have to keep his racist thoughts to himself from now on."},{"comment_id":"10153317149514087","commenter_b":"@username Ok I demand that and also anyone who rents to an illegal be punitively fined. Good enough? Oh yeah and build that wall and shovel the illegal bastards out of the country. Ok Tommy-boy?","commenter_a":"No the majority of Americans do not want to keep the illegal bastards, but they do want immigration reform- it's called a wall! To hell with Sanders vote Trump!","post_message":"“We cannot and must not sweep up millions of men, women and children, many of whom have been here for years, and throw them out of this country,” Bernie Sanders said Monday. “As president, passing a legislative solution to our broken immigration system will be a top priority. But, let me be clear—I will not wait around for Congress to act.”"},{"comment_id":"10154024287346680","commenter_b":"Thank God we elected a Nazi instead, right?","commenter_a":"Can Obama just pardon her if she promises to stay out of the public for the next 3 decades? It's time to move on.","post_message":"State officials said earlier this year they searched for visitor logs for Hillary Clinton's office and could not find any."},{"comment_id":"10153738419359062","commenter_b":"How about we stop the meth, heroine and cocaine on the streets?","commenter_a":"There's go's the neighborhood","post_message":"Not just limes in the back of this truck!"}]
