[{"comment_id":"1671785493043668","commenter_b":"Bitch..... Get a life. Stop using racism.","commenter_a":"Tactical shit is racist... says the man who uses \"Redneck\" over and over and over and then blankets all veterans as being PTSD, drunks, llamaphobes, ect. the ignorance level is... OVER 9000!","post_message":"What he says about Red White and Ben is priceless."},{"comment_id":"10153578637147235","commenter_b":"How much you wanna bet that this nut case is a conservative?","commenter_a":"1st class white privilege on display. We'll get you and your little dog, too!","post_message":"This is insane!"},{"comment_id":"10153773357374877","commenter_b":"WTF... Where I live... White people be blasting they music so cut the crap!","commenter_a":"Ugh","post_message":"Driving While Black: Cops drag black man from his car and Taser him for playing loud music.   Grio fam, this is wild!"},{"comment_id":"10154556355598690","commenter_b":"Some women just cant understand that others wish to cover up. Brainwashed since childhood to wear hardly anything.","commenter_a":"If the burkini is a symbol of Islamic extremism, then does that make the bikini a symbol of Western extremism or rather, Western subjugation of women? Surely freedom works both ways? Why should women be forced to show skin if they choose to cover up?","post_message":"Cannes Mayor David Lisnard called the full-body, head-covering swimsuit worn by some Muslim women \"the uniform of extremist Islamism\"."},{"comment_id":"10153142074684030","commenter_b":"Apparently all the men do. Lol. I've never heard of her","commenter_a":"I love Natasha Leggero!","post_message":"The Bieber roasters get a geography lesson from Natasha Leggero. The #BieberRoast premieres Monday, March 30 at 10/9c."},{"comment_id":"1214601541965192","commenter_b":"Y don't y'all go look up great migration n u do kno all white ppl ain't rh+ either meaning not descended from monkeys smh ignorance at its finest pick n choose shit to push ur retarded ass agenda","commenter_a":"Awesome. Teach them early. I'd rather my kid learn to hunt and survive than play on a phone or tablet all day.","post_message":"How do you feel about this?"},{"comment_id":"1234200423314954","commenter_b":"Yes they are I seen it. \"All white people to the back of the line\"","commenter_a":"It is! People need to get over it. Standing on freeways and burning buildings is not the answer!","post_message":"Do you support or oppose anti-Trump protests?"}]
