[{"comment_id":"10154966388510329","commenter_b":"She tried to eat my tuna pasta wee bitch","commenter_a":"@username I hope you make nice pals like Pippa 🐶","post_message":"Good girl, Pippa."},{"comment_id":"10153100644667431","commenter_b":"This girl knows nothing she is just as dumb as her ancestors, she is going to tell us that everything our ancestors fought for was a lie, no way our ancestors fought to keep our history alive and white people just want to erase us from history, don't let her finish her ancestors mission because she knows nothing she is a sheep, she doesn't even know about the underwater city they just found off the east coast of america a city that is older then her,,,,IM a descendant of a monkey theory, We know our history and can prove it with artifacts SHE CANT","commenter_a":"@username that's not true. The Bearing Strait Theory has been disproven by DNA and language development experts. Turtle Island is our original home given by the Creator","post_message":"Native American at Anti-Immigration Protest: 'You're All Illegal'  @webpagelink"},{"comment_id":"10153743310093606","commenter_b":"Sad, if she didnt want the child I would have taken her no questions asked","commenter_a":"She needs shoot","post_message":"HORRIFIC: A 6-month-old baby girl died Thursday afternoon after police and witnesses say her naked mother dangled her from the window of an apartment building in the Bronx before throwing her to the pavement six stories below. @webpagelink"},{"comment_id":"872563469430677","commenter_b":"2 delightful trolls. Get a life, ladies.","commenter_a":"militant? Lets be honest: muzlim terrorists/murderers","post_message":"A policewoman was killed in a shootout in southern Paris, triggering searches in the area as the manhunt widened for two brothers suspected of killing 12 people at a satirical newspaper. Read more: @webpagelink"},{"comment_id":"1708394149424069","commenter_b":"@username these people spoke in opposition to Trump's Muslim ban by indicating that Muslims are not all terrorists just like all Republicans are not all terrorists. By the way you know the US will never enforce a religious test for immigration NOR will be build a big beautiful wall....that Mexico will pay for :)","commenter_a":"What a wonderfully empathetic understanding and patriotic party the GOP followers now seem to be..to actually disparage this woman is one of the worst things ever...what in the hell is the matter with ALL of these inhuman people?","post_message":"The mother of a service member asked Mike Pence why he continues to stand by Donald J. Trump after his comments about the Khan family.   Many Trump supporters at the rally did not take kindly to her question.  Coverage: @webpagelink"},{"comment_id":"10153120614663203","commenter_b":"Women have degraded themselves to unbelievable depths. How sad, how very very very sad.","commenter_a":"This movie distorts how Love is supposed to be expressed. Women deserve better than to be chained and beaten.","post_message":"Say no to porn. Boycott 50 Shades of Grey, the movie: sign the petition"},{"comment_id":"10153992973507439","commenter_b":"Ms Reker is a WHORE","commenter_a":"What is it with the majority of women...do you not get angry, do you not want to beat the crap out of men like that? Whether we like it or not ,women, you are on your own. The only way to fight this is to fight, not because you like it but because we will have to. Your governments and I mean every government is in this together, they have planned the events, they are the movers of the migrants, they are manipulating every inch of this planet..Wake the heck up people. And women you will not only have to physically fight against the men that rape, you will have to fight against the women who are in power. The world for the general population will be returning to a dark time, a time where there were tribes and clans, you will have to be in a group to survive ...","post_message":"The Mayor of the City were hundreds of women were robbed, sexually attacked, molested, even raped on New Years Eve is blaming the victims. Worse still, the Mayor is a woman.  The mayor of Köln, Henriette Reker, intends to publish a behavioral code for the forthcoming carnival in Köln. But if you think that this behavioral code is meant for the muslim mobs, you are wrong. This behavioral code is meant for the victims, the women."}]
