[{"comment_id":"10153069048676770","commenter_b":"Both are bitchs","commenter_a":"I see that Meryl has picked her poison.","post_message":"\"How can people like Meryl Streep and Hillary Clinton envision themselves as rebels when they are the establishment?\""},{"comment_id":"10154860386705470","commenter_b":"So why are you flocking to America?","commenter_a":"Of course we should. We should also stop doing drugs, selling drugs, prostitution, eating high cholesterol. What kind of a story is this. No one is advocating hate crimes and there are more hate crimes in India from Hindus and Muslims than almost anywhere else in the world.","post_message":"It’s been a long day for Srinivas Kuchibhotla’s widow, his coworkers at Garmin, those in his home country of India, members of the Olathe community, and those with Indian heritage who live in the US.  “Even though that guy was talking so discriminately about his race, he was still minding his own business... He did not deserve a death like this.\""},{"comment_id":"585038108344735","commenter_b":"@username We've heard all the BULLSHIT IDIOT.","commenter_a":"This man and his comrade, Tad Devine, are two of the most dishonest, hateful individuals ever involved in a major campaign. Bernie's toast and he knows it. Hillary is going to put them away for good by June 7th!","post_message":"Still. Attacking. Hillary."},{"comment_id":"1292836000742177","commenter_b":"Let her out permanently.She will be a bad influence to our children.","commenter_a":"Good!","post_message":""},{"comment_id":"1552075435096764","commenter_b":"She is the queen of lies! Talk about incoherence!","commenter_a":"POT CALLING THE KETTLE..........(hiding fear and jealousy)","post_message":"Hillary Clinton went after Donald Trump's ideas, calling them \"dangerously incoherent\" and a \"series of bizarre rants, personal feuds, and outright lies.\" What do you think?"},{"comment_id":"996496440403675","commenter_b":"She would take money from a baby for her own use","commenter_a":"The spineless Republican leaders arent getting the word out that Orlando was a terrorist killing in the name of Allah. The lying left has actually convinced their stupid followers the massacre is a \"gun problem\" rather than admitting this was a radical Islamic terrorist event. Our Country is in BIG trouble when we lose 49 innocent people, and the REAL problem has NOT been identified.","post_message":"CROOKED HILLARY CLINTON: FOR SALE!"},{"comment_id":"10155561062180389","commenter_b":"She should be in prison !!!!!","commenter_a":"She plays the game , professionally ! I simply am astounded at America, Congress, and all the the subterfuge !","post_message":"Question of the Day: Does Hillary Clinton owe the American people an explanation about these new allegations?"}]
