[{"comment_id":"929005763900127","commenter_b":"Not as pathetic as your lying Hillary.","commenter_a":"Trump even takes a GOOD idea like term limits at EVERY level of elected governing and ruins it with his hate, ignorance, and by being the WORST candidate for President ever his pathetic nothingness and lack of depth daily shows how weak and what a fraud this TRUMP is. Pathetic. LISTEN LEARN THINK FEEL and VOTE smart.","post_message":"Donald J. Trump has vowed to limit House members to a 6 year term and Senators to 12 as part of his broader plan to \"drain the swamp\" and reduce the amount of influence lobbyists have in Washington.  Read more: @webpagelink"},{"comment_id":"484307825084431","commenter_b":"Funny women are one of the fastest growing group of gun owners .She loses all credibility when she mentions dicks ....so pitiful and uninformed ...","commenter_a":"300 million guns in this country - not enough?","post_message":"How about not...."},{"comment_id":"10153246796329607","commenter_b":"Stop them now!!!","commenter_a":"Yes","post_message":"QUESTION OF THE DAY:   Should the U.S. stop accepting Syrian refugees? #FOX45QOD"},{"comment_id":"1307596852595922","commenter_b":"Bangkok, Thailand","commenter_a":"Seoul","post_message":"Check out this LIVE rocket launch! Shortly, a Russian rocket will launch from Kazakhstan and travel to the International Space Station, and you can watch it LIVE right here. This is an uncrewed rocket, and it will deliver food, fuel, clothes, and other supplies to the astronauts on board the ISS. Where in the world are you watching from?"},{"comment_id":"10154751454678010","commenter_b":"@username --You are a woman, but lady? Highly questionable.","commenter_a":"Aren't \"Indians\" a part of American History, whether or not their story is positive or negative? Why does every damn thing have to be racist? I think your article/argument would have been more effective if you had taken statements by full blooded Indians who are actually offended by this rather than just mention that the mascot and \"red face\" really \"do harm to actual people.\"","post_message":"Cleveland knows its mascot is racist. They removed \"Chief Wahoo\" from their caps at the beginning of the season.   And yet now he's reappeared on baseball's biggest stage.   via Los Angeles Times Opinion"},{"comment_id":"10153592234263132","commenter_b":"She got dem dreads doh!","commenter_a":"SHE DOESNT EVEN LOOK BLACK!","post_message":"\"We are her birth parents. We do not understand why she feels it's necessary to misrepresent her ethnicity.\""},{"comment_id":"10157197688465354","commenter_b":"I hope the Police Officers NEVER help her out again!!","commenter_a":"That bitch looks like she is having seizures when she dances! Prince way, way, way better","post_message":"~~UPROAR~~"}]
