[{"comment_id":"1386022938105786","commenter_b":"Build a wall all around California lol","commenter_a":"Seriously they had to conduct a study?! I think most of us true natives already knew that without conducting the study and it's been like that for years. We have way too many people coming here from other states and something must be done to control the population here; it's really just a joke now.","post_message":"It's official: California is the worst state for drivers. 🚗"},{"comment_id":"10153834511188721","commenter_b":"Suck on these nuts","commenter_a":"@username Beetje bullshit dat \"size of the earth\" Nog steeds wel zieke shit, though!","post_message":"Space, folks. (via Mic)"},{"comment_id":"1181787745189978","commenter_b":"Lock her up","commenter_a":"BULLSHIT!!!!!","post_message":"******BREAKING NEWS******  Finally!!"},{"comment_id":"10154514715036077","commenter_b":"You will be glad to know Trump is looking to hire people like you to build that wall. Jobs jobs jobs, and then he'll send you back and bum pay you. That's how he has gotten rich on the sweat of others people like you who believe his propaganda. According to him we are all here illegally. .and a bunch of low life criminals","commenter_a":"As American hispanics, we are tired of how all of these coward racist liberals that hate America like Obama, Clinton, and their supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, we're supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of our skin... disgusting. That's why we elected President Donald J. Trump. Help us reach more people by following our great pro-America page \"@username\", the only true patriotic cartoon comic strip. And let's Make America Great Again! Thank you.","post_message":"It would take 37 electors nationwide currently pledged to Donald Trump to vote for someone else to derail the election results and trigger a vote in the U.S. House of Representatives"},{"comment_id":"10153190819521602","commenter_b":"Telling you..bitches love it!!","commenter_a":"Personally i think they should have beat her like Rodney King. Broads really like that!","post_message":"The officer was placed on desk duty after video images showed him taking a 15-year-old girl to the ground during an arrest at a St. Patrick's Day parade."},{"comment_id":"849277451776263","commenter_b":"im glad he was never my minister...and oprah needs to get the heck off television and go to another country and spread her crap","commenter_a":"The Bible does Not Change over Time. God put forth his Word to his People. He is the Same today as he was Yesterday. She should Read the Bible and see what Gods says.","post_message":"Oprah asked former megachurch pastor when Christianity will embrace gay relationships.  His answer seemed to take her by surprise."},{"comment_id":"10153673371886336","commenter_b":"Exterminate them all","commenter_a":"And they wonder why their lives don't matter?","post_message":"Scott Lattin and his family painted the words “police lives matter” on the back window of their truck.  Then, someone spray-painted obscenities about the police on their car and wrote “black lives matter” in spray paint across the side of the truck.."}]
