[{"comment_id":"10152924190906336","commenter_b":"Obama, take lessons from them. Hire illegals to build the wall and when it's done, toss them on the other side","commenter_a":"And america welcomes all through mexico.","post_message":"Saudi Arabia is constructing a 600-mile \"great wall\" along its border with Iraq to keep ISIS and other extremists at bay."},{"comment_id":"10153074240773067","commenter_b":"Lol no, A stockholder though, and everything that i put on here were statements from Ford in response to Donald Trump.. Just summarized","commenter_a":"Trump had nothing to do with this. This was because Ford, and the UAW were able to work an agreement, Ford is committed to keeping and creating jobs in the U.S. They have created 25,000 new jobs in the U.S. In the past four years. Over 80% of their manufacturing is done in the U.S. And 97% of their engineering is in the U.S. As they stated. No i dont like seeing jobs being outsourced, but Trumps statement had no effect on the outcome of this. Im happy for all the people who kept their jobs. Ford is a great company! And will do what they can to keep bringing new jobs to the U.S.","post_message":"This comes after Ford Motor Company came under fire for creating thousands of jobs in Mexico. @webpagelink"},{"comment_id":"10153982598576509","commenter_b":"Burn","commenter_a":"@username Angel Castro @username Ivan Longoria noooooooohhhhhh!!!","post_message":"Some retailers are offering Caitlyn Jenner costumes for Halloween, but critics say these costumes mock the transgender community. What do you think? @webpagelink"},{"comment_id":"10157235838770231","commenter_b":"Because they are white? And black thugs will get arrested because they are black very simple?","commenter_a":"Privileged, yes. I'm not convinced about the White part. Jameis Winston was accused of a much more serious crime but because he is an athlete he was shielded from those repercussions. And let's not even get into Bill Cosby.","post_message":"It must be nice to be white and entitled."},{"comment_id":"10153138744168487","commenter_b":"Criminals will find anything, they're criminals after all. If they could kill you with love they would do! More guns will never make any situation safer; regardless of the victim feels they would have been safer with a gun. Chances are a criminal will know how to use one and you won't. Guns should be outlawed on a whole not made readily available to whoever wants one.","commenter_a":"so does higher rates of car ownership.","post_message":"A reminder from 2014 that higher rates of gun availability correlate with higher rates of female homicide."},{"comment_id":"1755557531334252","commenter_b":"I love how the racist cunt doesn't realize Africa isn't a country lol","commenter_a":"Good. GTFOut. Go to Africa where it's guaranteed you'll have a black president. This half white didn't work out so well.Alec baldwin made the same statement. Liberals whine and cry when they don't get their way. About time to unleash that Trump ttain.","post_message":"\"The View\" host Raven Symone says she's leaving America if a Republican becomes president. Will you miss her?"},{"comment_id":"868283350028908","commenter_b":"Those women are a group of sick , twisted bitches. But their outlook is the killary twist. Blame the victim . You bitches make all women look bad.","commenter_a":"Take conservative Fox with you","post_message":"This is absolutely shameful. Get this liberal trash off the air immediately. Can we get 30,000 'LIKES' to have this show shut down?"}]
