[{"comment_id":"10153314247693812","commenter_b":"She beautiful","commenter_a":"Amaxing love the smiles love technolgy","post_message":"Girl all smiles 6 months after major surgery to reshape her face with help of 3D printing: @webpagelink"},{"comment_id":"1142484579135691","commenter_b":"It will recover","commenter_a":"Guess what the pound is at a 31 year low at the moment, figure out for yourself what will happen to your economy in about an year, idiots.","post_message":"\"And we'll have done it without a single bullet being fired\" - Nigel Farage @webpagelink #EURef"},{"comment_id":"10153629371177235","commenter_b":"Gay marriage Trumps Straight Marriage, get lost Huckabee:)","commenter_a":"Down with Huckabee, as Donald would say, LOOSER..... .","post_message":"If God already 'solved' racism, he didn't do a very good job ..."},{"comment_id":"1091574534232574","commenter_b":"Why this government is all B/S! Why this government is all B/S! It left over 180,000 tailor and mobile homes in Louisiana that the people never used and this sh**hole of a government could have added to that number and moved them all over the Midwestern farms for many of this countries people living off long term benefits! Just relocate mom and her 2-3-4 or more kids out there to work the farms! I think that this would be much healthier for the kids than being raised in many respects in slum cities and neighborhoods This bullshit about Americans are unwilling to work the farms, well, maybe if they are forced to, or all subsidy will end, maybe they with their children will learn a healthier way! And other women, who may consider this lifestyle, may think twice! The only reason that this government wants the border open is to ...","commenter_a":"Yes","post_message":"\"Cuban nationals should be treated under the same immigration rules as nationals of other countries.”"},{"comment_id":"10153587241381051","commenter_b":"This bitch","commenter_a":"That is totally untrue. Several people received transplants from my daughter and nothing happened to their skin. We are all the same inside and the only difference outside is that African American people have MORE pigment genes than white people. You did get their genes transplanted into you you got their organs which are exactly like yours that obviously failed. So what difference does it make where they came from. BE GRATEFUL YOU ARE ALIVE. And since you have to take medicine for the rest of your life so your body won't reject your transplants use your pee brain which you obviously have and think about the medicine that's affecting your skin color and NOT the fact that an African American gave you his/her parts to keep your sorry butt alive.","post_message":"This man says that receiving a transplant from an African-American has turned his skin black. Here's what he looks like now. Decide for yourselves."},{"comment_id":"1074790329229886","commenter_b":"You're going to be the sad one when this country has the problems all countries that Muslims populate have, rape murder persecution. All countries that are being invaded by \" refugees \" are living in fear, there are NO success stories of peaceful Muslims coexisting","commenter_a":"These comments reflect a said piece of America that just wont die... Progress has left you behind, blind and ignorant. You worship a billionarw who says he cares about you while sending your jobs overseas, knows nothing of history, and can't answer direct questions about policy. The world mocks you, I pitty you","post_message":"A GREAT NIGHT IN IOWA! Thank you for all of your support. Get out and VOTE! TOGETHER we will MAKE AMERICA GREAT AGAIN! #IACaucus #FITN"},{"comment_id":"1266839853337023","commenter_b":"Hey Mario, stfu !","commenter_a":"You're an idiot if you think you can light a fire in the airless vacuum of space","post_message":"That classic \"teardrop\" shape only forms because of gravity. So what happens when there's no gravity?"}]
