[{"comment_id":"10158064309830354","commenter_b":"She's so ugly!","commenter_a":"she looks like a dude to me. this not a real female.","post_message":"Poisoned coffee on the day of the debate???"},{"comment_id":"10153151656451336","commenter_b":"Prayers for our Country. This woman is a tyrant!","commenter_a":"The last person on earth we need as president.","post_message":"BREAKING NEWS: Hillary Clinton announces 2016 presidential campaign. @webpagelink"},{"comment_id":"675876952588617","commenter_b":"Hillary is a lying bitch.","commenter_a":"Won't hear this at the debate.","post_message":"JUST IN!"},{"comment_id":"10153268129696782","commenter_b":"$50 charge on all transfers of money to Mexico. Wall built!","commenter_a":"Since illegals sending money back to Mexico props up the Mexican economy, I would propose a fifteen percent tax on all wire transfers and international money orders bound for Mexico. That alone would pay for the wall in a short amount of time.","post_message":"Mexico won't pay a single peso to help build the bigger border wall Republican presidential candidate Donald Trump is proposing, the country's treasury secretary said."},{"comment_id":"903279336444237","commenter_b":"Sigh","commenter_a":"Joshua William Grant told you 😂","post_message":"Misogyny is misogyny."},{"comment_id":"1784031898507079","commenter_b":"She is a heartless bitch!","commenter_a":"She still hasn't gone to Louisana like she said she would after the devastation from the recent tropical storm that passed through there . And wasn't it her and her campaign who accused Trump of making Louisana a political stunt when he went to help after? Here she is making it political when it's time to focus on evacuations, preparation and people's well being.","post_message":"As Florida residents prepare for Hurricane Matthew's impact, Clinton buys ads on the Weather Channel."},{"comment_id":"10153159608716833","commenter_b":"Took out the trash.","commenter_a":"The guy with the gun did the right thing!","post_message":"Armed Citizen: Video has been released showing a man armed with a machete kicking in a Pocatello, Idaho, apartment door last year, then getting shot by the apartment resident."}]
