[{"comment_id":"10154416632443701","commenter_b":"He already said he's voting for her lol","commenter_a":"Ugh!! Until I hear it from his mouth I don't believe it. Why should we believe ANYTHING a biased news station and a corrupt politicians say? In fact, if you read the article, it specifically says Bernie has not announced he endorsed her. Coming together in issues is NOT the same. Mis-leading headline, once again!! Sanders has not yet said he will endorse Clinton but told reporters on Saturday that the two campaigns were coming together and to stay tuned.","post_message":"Former Democratic rival Bernie Sanders will join Hillary Clinton at a New Hampshire event on Tuesday where he plans to endorse her."},{"comment_id":"1102153109844436","commenter_b":"Women need sex","commenter_a":"She should be locked up! She's sick! And just to say a massive thankyou to this brave soldier for looking after us and our country x","post_message":"How can a wife be so heartless?"},{"comment_id":"886020504921859","commenter_b":"You are right Mary the bitch owes Haiti","commenter_a":"Shut it down.. take some of the millions and help Haiti which some of it was supposed to be used for. Then rehire ALL NEW PEOPLE IN THE VA HOSPITALS AND HELP OUR VETS. some of those people are the rudest uncaring and unhelpful people around hire enough to take care of the vets so they don't have enough to wait so long for appointments etc. Help Americans for God's sake.","post_message":"Hillary devastated after finding out this about her foundation.  It's all coming crashing down.  Do you think the Clinton foundation should be shut down?"},{"comment_id":"10153549714052014","commenter_b":"She should've closed her legs.","commenter_a":"Unfortunately this POS will get an attorney who will say she is mentally ill, then she will go to some mental hospital. She will be there few years and they will say she is better, she will be back having more babies. I don't care what the reason, crazy, postpartum, bad day, whatever she deserves jail for the rest of her life!! She should have just whacked herself, sorry I have absolutely no pity for her.","post_message":"HORRIFIC UPDATE: Police are now saying the mother who killed her 3 children also partially dismembered them. Two of the kids were placed in closet & the 2-month-old baby was \"stuffed into a case.\""},{"comment_id":"10153250211681336","commenter_b":"Seems like a lot of immigrants spouting out of their pie holes when no one knows what happened yet.","commenter_a":"AM I THE ONLY ONE WHO THINKS ALL THESE DERAILMENTS IN THE LAST FEW YEARS ARE BY TERRORISTS????","post_message":"“It is an absolute disastrous mess. Never seen anything like this in my life.”  Philadelphia Mayor Michael Nutter confirms at least five people are dead and 53 have been transported to hospitals with six in critical condition after Amtrak train 188 traveling from Washington, D.C. to New York derailed Tuesday night. @webpagelink"},{"comment_id":"848788448587668","commenter_b":"@username is trying to use bully tactics to shut up anyone that doesn't agree with him. It won't work. We're fed up!! We will not call evil good and good evil, so crawl back to your safe space and stay out of the women's bathrooms!!","commenter_a":"I am NOT a bigot and i hate being told i am because i do not like what Target did.. that is crazy !! i really do not care what they do.. but not in the little girls room","post_message":"I hope this video makes the rounds....Target has completely LOST IT at this point....shame on them."},{"comment_id":"600892556733313","commenter_b":"She should put in jail with all Males and stay with them 24/7/365","commenter_a":"So not only he is a kid, he is also special needs. And on top of all of this, she is 71 among kids ????! The school should re think abt the age of teachers dealing with kids. In late 30s and a woman can hardly handle her own kids !!!! Shame","post_message":"71-year-old teacher Amelia Stripling was arrested and charged with 2nd degree cruelty to a child after knocking over a pre-K special needs student in Georgia.  @webpagelink"}]
