[{"comment_id":"10153068039414586","commenter_b":"Bitch if they could ride a Real tiger they would","commenter_a":"Uhh hello, theres elephants that are raised domestically in zoos and sanctuaries and in places where they're trained. And how would you know they're beaten? And btw horses started out as wild animals so your argument is mute. Pick a side, not just a specific animal","post_message":"PROOF that you don't need to use real animals to amaze a crowd.   CC: Ringling Bros. and Barnum & Bailey Circus #NotOurs2Use   SHARE if you're glad Katy Perry chose NOT to use live animals! #SuperBowl"},{"comment_id":"10157791995705206","commenter_b":"Rhd cars are illegal in NJ","commenter_a":"I see how they survived. The driver's side is on the right not the left. If it was an American made Car. The driver would have been dead.","post_message":"How could anyone have survived this horrific car crash? @webpagelink"},{"comment_id":"905085592863011","commenter_b":"I got 8 right","commenter_a":"Yes","post_message":"Let us know how well you do!"},{"comment_id":"860452347398311","commenter_b":"What an idiot, can she really be this stupid? If this passes for high intelligence, I must be a genius","commenter_a":"You really cannot fix stupid","post_message":""},{"comment_id":"1037877766321802","commenter_b":"THE ONLY VOTE FOR HILLARY WERE BUTTERCUPS AND ILLEGALS.","commenter_a":"Shabaz, you have a problem with Israel I see!!","post_message":"Who's meeting with the president-elect today? We're at Trump Tower watching the most famous elevators in the world"},{"comment_id":"858172280911557","commenter_b":"We'd be better served to ban the Muslims from our country period!","commenter_a":"Stick to your guns. We support you","post_message":"UPDATE: Gun Range Ban On Muslims Draws Fire  In the five months since Jan Morgan banned Muslims from her gun range in Hot Springs, Ark., business has boomed and predictions of a lawsuit brought by federal civil rights enforcers have so far proved inaccurate. Morgan, who claims keeping Muslims out of her Gun Cave... #guns #islam #shootingrange  @webpagelink"},{"comment_id":"10154314323247174","commenter_b":"Lets don't and say we did.","commenter_a":"I wonder how their wives think about all this press about women in armor , arty, and infantry?","post_message":"Meet the Marine Corps' first-ever female field artillery officers."}]
