[{"comment_id":"472703329582291","commenter_b":"How does Trump make Mexico pay for the wall, When America has no authority over Mexico ?","commenter_a":"We need the good people of Florida to Vote Trump!","post_message":"FLORIDA: Early voting is now open! Do not miss this opportunity to #MakeAmericaGreatAgain #Trump2016 Ivanka Trump  Find Florida early polling locations: @webpagelink"},{"comment_id":"10154321857710575","commenter_b":"Another loud mouth fat bitch and if you want to live se some weight cut off your head","commenter_a":"If you think this woman is a hero, go get your gun and shoot yourself with it, it is a better choice than what is coming","post_message":"Unbelievable . . ."},{"comment_id":"562921477245254","commenter_b":"I'm so sick of that self-righteous hateful woman.","commenter_a":"Are we surprised? She's just reminding us all what a thin skinned vindictive man Trump is.","post_message":"That didn't take long. Not even a week has passed, and the president elect's team is already warning Trump critics to be \"careful\" about the way they criticize Trump."},{"comment_id":"10153216973363855","commenter_b":"Good let the idiots divorce","commenter_a":"overinflated sense of their own importance much? idiots","post_message":"Here's to a speedy divorce!"},{"comment_id":"10153668595164099","commenter_b":"This woman again? The Nurse who doesn't care if she infects everyone else? Go away! Your 15 minutes are over.","commenter_a":"Why are there so many greedy people in health care.","post_message":" never had Ebola. I never had symptoms of Ebola. I tested negative for Ebola the first night I stayed in New Jersey governor Chris Christie private prison, Kaci Hickox, 34, said. -----> @webpagelink"},{"comment_id":"965413580245506","commenter_b":"Keep trying @username. Killery the lying hag will fall short.","commenter_a":"PT Barnum is running for president!!","post_message":"Donald J. Trump tried to remember #DDay with a photo that wasn't from D-Day."},{"comment_id":"889715544460386","commenter_b":"So tired of this progressive rant. If you come here illegally you need to go home. PERIOD!","commenter_a":"Are they trying to lose the election?","post_message":"She says the holiday-season roundups were \"mass deportations\" that are sowing \"division and fear.\""}]
