[{"comment_id":"1560631690895039","commenter_b":"Good for his ASS. I hope they rape him in prison nite and day. Carma is a BITCH lol","commenter_a":"the sentence is more lenient than what he deserves","post_message":"There is no punishment severe enough for these heinous crimes."},{"comment_id":"10152688677486491","commenter_b":"@username Was 9/11 an act of American terrorism? WTC and Pentagon are both on US soil, right?","commenter_a":"Not Polish camp but German!!","post_message":"Hundreds of survivors returned to the Holocaust’s most infamous concentration camp today."},{"comment_id":"620315121449719","commenter_b":"Would make a great couple . Two freaks .","commenter_a":"HE likes. HE likes. HE aint a SHE!!!","post_message":"Caitlyn Jenner says she likes Ted Cruz because “he's very conservative, and a great constitutionalist.” @webpagelink"},{"comment_id":"903279336444237","commenter_b":"Sigh","commenter_a":"Joshua William Grant told you 😂","post_message":"Misogyny is misogyny."},{"comment_id":"1018949481459396","commenter_b":"Bitch","commenter_a":"So men are the most evolved. We do it since birth. Maybe that's why women never let us forget shit because they're living in the past.","post_message":"And that's why men have nipples!  Via Curiosity."},{"comment_id":"10158014853220594","commenter_b":"Mariah Neu and @username. You both say the state of Illinois has lax gun control. In the city of Chicago, not the state of Illinois gun crime very high and so is gun control. Now to my point about Chicago and how gun control affects crime. It is stated that affectguns are imported into the city and these guns are used in the crime. If close carry by law abidi ng citizens was allowed in the city then law abiding could and would protect themselves. It should be of no surprise to anyone that a thug will not follow the gun law, but common citizens will. Gun control laws don't stop crime they just reduce the law abiding citizens ability to protect themselves. You folks use data about the state of Illinois, that has nothing to do with this discussion. Do a comparison of the city of Chicago and the ...","commenter_a":"As is often the case Oreily misses the point, the elites left are the the white spremest. The left just plain want control of all our lives. Taking all freedoms starting with gun ownership","post_message":"The Fox News anchor drew criticism after he said liberals' call to abolish the Electoral College is \"all about race.\""},{"comment_id":"650239665120653","commenter_b":"Congress does the budget not the President. Stop passing the buck","commenter_a":"Close off shore corporate tax loop holes. Oh, would that be a conflict in interest? Legalize marijuana. Tax the church!","post_message":"A new Congressional Budget Office report shows that President Obama’s latest budget would leave us with a $486 billion budget deficit for 2015 alone and a deficit of over $7.2 trillion from 2016-2025. That’s just another reason why my first bill in the Senate requires Congress to do its job, get federal spending under control, and pass a balanced budget."}]
