[{"comment_id":"10153322373749087","commenter_b":"Ladies, don't embarrass yourselves....you got your asses kicked in both elections. ;)","commenter_a":"Well vote for the Republicans so they can make you feel more comfortable by taking you back to that time.","post_message":"Sister Souljah on Hillary Clinton: “She reminds me too much of the slave plantation white wife of the white ‘master.’ She talks down to people [and] is condescending and pandering. She even talked down to the commander in chief, President Barack Obama, while she was under his command.\""},{"comment_id":"1563946600332130","commenter_b":"she says she all for kids but she can not hide the truth","commenter_a":"If a woman walks around spewing F!#K the way she does you damn sure don't want her to be president, hell I don't even want her as a friend","post_message":"This is the REAL Hillary Clinton, folks!"},{"comment_id":"10154357788051509","commenter_b":"Escape to Germany or Sweden for safety?! Really?! Do not keep up with the news? Germany and Sweden have been taken over by the same Isis loving Muslims that killed this woman! There is no safe place for Arabic women to go to as long as Arabic men are around.","commenter_a":"There goes a girl who did not leave her country to reach Germany or Sweden for safety and fought as best as she could...she got executed for her tweets about life in Raqqa... Now you know what refugees who are labelled as \"cowards\" \"parasites\" \"are escaping from.","post_message":"She wrote about life under ISIS rule with humor, sadness and a glint of hope."},{"comment_id":"1800692713478186","commenter_b":"Your first woman president wants to bring ISIS TO AMERICA. IF SHE WINS YOU BETTER START PACKING HEAT AND GET ON YOUR KNEES AND PRAY. YOU WILL NEED IT.","commenter_a":"An America that believes it's ok that Americans have lost jobs? An America that believes healthcare costs for many Americans should increase? I get that the Affordable Healthcare Act has helped millions Americans, but at the expense of millions of other Americans. Also, an America that believes it's ok to accept donations from countries that house terrorists and are suspected of funding them? An America that let's people get away with breaking certain laws? This is the reality of @username America. FYI, not supporting Trump Chris Keniston, Veteran's Party of America supporter.","post_message":"Tomorrow, we have the chance to stand up for the America we believe in. Share this if you're voting. hillaryclinton.com/makeaplan"},{"comment_id":"1207167835973058","commenter_b":"It's not true for entrepreneurs but workplace","commenter_a":"What if this statistic isn't true? Check out what John Stossel uncovered: @webpagelink","post_message":"Kristen Bell introduces Pinksourcing, where women are a bargain at the workplace, since you only have to pay them 77 cents on the dollar! It's the first episode of our new series, #CelebsHaveIssues."},{"comment_id":"10153578446431509","commenter_b":"Africa's a mess. Look what happens when the USA forces the colonials out early. If Britain has still been in control these things wouldn't be happening","commenter_a":"Let's not forget what's happening in South Africa too.","post_message":"ISIS operatives beheaded two groups of prisoners, believed to be Ethiopian Christians, in Libya, according to a video released by the terror network's media arm. @webpagelink"},{"comment_id":"10153566641994456","commenter_b":"Pure ignorance! Women should not let a man in their car that they don't know, much less 2 men!!!","commenter_a":"I don't stop at this Pilot Travel Center, even in the daytime. Lot Lizards and beggars are like running water, 24/7, even with the police watching.","post_message":"A Birmingham woman's act of kindness resulted in her car and wallet being stolen at gunpoint. @webpagelink"}]
