[{"comment_id":"10154334992691130","commenter_b":"Hillary claims to be for equal rights and pay for women and care for womens rights but she still pays men more than women. She does not care about women it`s only money she cares about .. abortions save money ,that is why she is for abortion..","commenter_a":"Note to these kids: Don't bother asking Trump. He has no answers for you that are going to give you hope. He'd probably tell the children that they need to be vetted first to see if they love American values, even though they're only children.","post_message":"Ahead of tonight's debate, the children of Aleppo ask Hillary Clinton and Donald J. Trump the questions THEY would like to see answered."},{"comment_id":"471937499632872","commenter_b":"Give it up lady. Your lies won't work with me.","commenter_a":"He's what a president should be and it's a shame the next won't try half as hard as he did.","post_message":"\"When they describe their youth and their childhood, these are young people who made mistakes that aren't that different from the mistakes I made.\""},{"comment_id":"10154279664226028","commenter_b":"@username that's because the affluent can afford to get off","commenter_a":"A lot of white people are mentality demonized, they have a lot of them that literally kill their parents and children. But they constantly say blacks are thugs.","post_message":"A 28-year-old man allegedly killed and dismembered his parents during a Thanksgiving visit. The remains were discovered in an acid-based solution, in an apparent attempt to destroy evidence. @webpagelink"},{"comment_id":"1245719035484009","commenter_b":"Is the translation is correct? If yes why he should bother. He can marry any time and breed","commenter_a":"This is why America has never nor should have open borders.","post_message":"Video captures a Syrian mother and father preparing their two daughters, ages 7 and 9, for jihad suicide missions."},{"comment_id":"1211790348838313","commenter_b":"Punk ass bitch mo fos!","commenter_a":"You people who are shooting these schools and theaters up aren't proving nothing to nobody except your a bunch of punks bitches and cowards.","post_message":""},{"comment_id":"10154130033413797","commenter_b":"so she should keep her legs together","commenter_a":"you have a brain tumor and you are suing bc you want your tubes. out.. are you sure you are just not brain dead?","post_message":"A woman suffering from a brain tumor is threatening legal action against a Catholic health system because the hospital is allegedly refusing to tie her fallopian tubes based on religious belief. The procedure could be life saving for the woman..."},{"comment_id":"10153990107026955","commenter_b":"See you at Blade Show bitch!","commenter_a":"The rights to a free press, free speech, assembly, and religion are extremely important but none of them matters very much if you can’t defend your own life against aggression. Leave your hands off my guns!","post_message":"BREAKING: Active shooter at Lackland Air Force Base in Texas, at least 2 dead"}]
