[{"comment_id":"10156327050085725","commenter_b":"A HUUUUUGE WALL. the next 11 months are gonna be a nightmare. Get in there and fix it asap donald trump. Please","commenter_a":"Caught and turned themselves in are two different things.","post_message":"Eight Syrians were just caught on the southern border trying to get into the U.S. ISIS maybe? I told you so. WE NEED A BIG & BEAUTIFUL WALL!"},{"comment_id":"457420381115209","commenter_b":"NO Never they Are NOT The Only Ones With Slavery in their History/Background Stop the Hate All People in JESUS NAME Ps139 Amen","commenter_a":"Hell no","post_message":"Should Blacks Be Compensated For Slavery?  Comment 'yes' or 'no'."},{"comment_id":"10152891097411491","commenter_b":"and because China is seizing Australian colonial territories in Antarctica which is morally wrong","commenter_a":"Asia is Asia, for the ASIANS. Why do we have to stick our noses in EVERYWHERE???? No wonder the U.S. is hated by so many countries.","post_message":"A historic debate over trade is now heating up in Washington."},{"comment_id":"824116754360678","commenter_b":"Not one of them will be caught, and not one of them feels guilty.","commenter_a":"My gosh, where did these barbarians come from ??","post_message":"“When my son left, he had a broken basket and was hysterically crying,” one mom said."},{"comment_id":"813299352038859","commenter_b":"You're ignorant whores on government programs. Stfu.","commenter_a":"This is her response. She would kill a newborn. Her OWN newborn even. Enough said.","post_message":"Thousands of protesters gathered at the US Capitol this week..."},{"comment_id":"10154062439342541","commenter_b":"Too much fat around the waist can't grab that skank","commenter_a":"Big deal. There's a position waiting for her in the White House after January, 2017. She seems to have the required credentials/ideology that would qualify her for employment under that administration.","post_message":"The non-profit director who called First Lady Michelle Obama an \"ape in heels\" has been fired for good."},{"comment_id":"10154989881801037","commenter_b":"She's a douchebag!","commenter_a":"Lol good","post_message":"Do you agree with this university's anti-Kim Kardashian West request?"}]
