[{"comment_id":"1088726504494434","commenter_b":"Ni en los concursos de pueblo se ve algo tan bochornoso!","commenter_a":"omg I am huge HARVEY FAN this was a horrible mistake i cant imagine how awful he must feel but thats live TV ...","post_message":"Something very unusual happened at the #MissUniverse pageant tonight...  #MissColombia was incorrectly crowned and she had to relinquish her crown to #MissPhilippines.  Social media has exploded from the result of this: @webpagelink"},{"comment_id":"10153598659872434","commenter_b":"@username you females don't have any sense in your head that oppose this kind of thing.","commenter_a":"It is not any feminism I know that tells a person what they can and can't wear. Beach or not. France should stop blaming their bigotry on feminism.","post_message":"French officials have cited everything from hygiene to feminism in order to ban the swimsuit"},{"comment_id":"10153047231286615","commenter_b":"Dogs are innocent. At least a human can report what happens to them and make the choice who they stay with","commenter_a":"But you are all ok with James Harrison? He beat his girlfriend. Vick never harmed A HUMAN BEING.","post_message":"DEVELOPING: Quarterback Michael Vick is on his way to #Pittsburgh to meet with the Steelers, according to ESPN's Adam Schefter..."},{"comment_id":"917835871594729","commenter_b":"This is a very old photo of Hillary...she has become too old and out of date to be the Democratic President we need!","commenter_a":"Be nice if She would make up Her mind!","post_message":"Are you supporting Hillary 2016? Then go to DemStarter.com right now and show your support: @webpagelink  Hillary is in 3rd place in pledged support behind Elizabeth Warren and Bernie Sanders on DemStarter.com, but we're still just days into it.  Go to DemStarter.com, and show your support for Hillary, or for your favorite Democrat!"},{"comment_id":"677143662389195","commenter_b":"Shut Up!!!!!","commenter_a":"The Patriots are speaking! Donald Trump is our Patriot Leader! E-verify. Numbersusa.com. Arm all our military - - active, reserve, and veterans. Honor The Constitution / Bill of Rights, limited government, free enterprise, and USAmerican exceptionalism. Make The USA Great Again! Go, Trump! Support the Muslim Reform Movement. No more terrorists! m.facebook.com/Muslim-Reform-Movement-@username/ MuslimReformMovement.org","post_message":"If Donald J. Trump \"gets his way, it will be like Christmas in the Kremlin,\" says Hillary Clinton"},{"comment_id":"10153153254808822","commenter_b":"You mothersfuckers are assholes","commenter_a":"5 kids and pregnant at 26? Jesus.","post_message":"Targeted or a random act?  Police are trying to figure out why someone shot and killed a local mother of 5, who was also pregnant."},{"comment_id":"10153379974755329","commenter_b":"You have a baby in your belly. No more goofing off!","commenter_a":"Michael Aragona @username @username how do you like that?","post_message":"Thank you, restaurant gods."}]
