[{"comment_id":"935666689826142","commenter_b":"Tom thats only because fox hires those wannabe dumb blonde bimbo beauty queens who are only good for getting idiots who watch them get a hard on.","commenter_a":"How low does your IQ have to be to qualify as a Fox viewer?","post_message":"Um......what?"},{"comment_id":"10153543401066336","commenter_b":"You illegal aliens need to self deport along with your anchor babies!!! Get Out!","commenter_a":"\"Mr. Trump's statements are offensive to all Latinos, but especially to the undocumented community,\" said Bertha Sanles, who has lived illegally in Miami for 14 years. \"Trump is focused on promoting hatred and ignores the positive economic contributions we bring to this country.\" You know what, become a citizen so you can vote.","post_message":"A resolution to condemn Donald J. Trump's remarks about Mexican immigrants failed last night to win approval of the city council in Doral, Fla."},{"comment_id":"873396172789454","commenter_b":"Taking our RIGHTS to to fulfill your agenda is not going to happen. Do you have armed security? I bet if a person walked in and brandished a weapon he/she would be taken out by a person you hired or are in connection with you and your party that is wielding a gun. You would say its protection...... We say the same thing.... It is for Protection.... While you want to make guns illegal for law abiding citizens to obtain, you will only make it Illegal to own them. Causing a bigger issue for some. People will always have guns. Ask a Drug dealer if they have issues getting illegal drugs.... NOPE. they will straight laugh at you. All you are doing is wasting taxpayer money and time. If you want to make change, ban together to reform Immigration to be fair and swift, Vote laws to tax churches to ...","commenter_a":"Real action","post_message":""},{"comment_id":"10152809432022060","commenter_b":"Ummmm she made that choice! PLEASE quit pretending she was Innocent!","commenter_a":"Oh yea she looks real scared. She was with him two weeks? Cant lay her choices on him.","post_message":"Faced with the vicious way in which Dexter Allen is accused of killing the victims, Haraquon Degruy's mother believes she was trapped, unable to flee for fear of repercussions against herself or her family."},{"comment_id":"1722240001356259","commenter_b":"@username the woman who thinks he looks oh so sexy cuz she on the same drugs lmaoooo wanna try em??","commenter_a":"@username no comment","post_message":"he was definitely turnt up..."},{"comment_id":"1709641872647327","commenter_b":"I cannot believe what is happening in this country. From this moment forward, when my wife or daughters-in-law or granddaughters are in the women's room of any public facility, I will guard the door, and woe to the man who tries to enter while they are in there. There will be blood!","commenter_a":"We are full of IDIOTS in America !","post_message":"\"There isn any doubt that this law was designed to be DISCRIMINATORY ...\""},{"comment_id":"10153039031790329","commenter_b":"Kriti Kothari","commenter_a":"One for you Bella La Verde","post_message":"Find out which one of these redheads will light your fire."}]
