[{"comment_id":"10154308160836509","commenter_b":"Shes done far worse with all the deleted emails and benghazi blood on her hands","commenter_a":"She doesn't have room to talk","post_message":"Will Hillary Clinton give Bernie Sanders a pass on the data breach or will she tear into him during tonight’s #DemDebate? @webpagelink"},{"comment_id":"10153896668671990","commenter_b":"She need the flowjob","commenter_a":"Why didn't this happen to my poll areas","post_message":"Two women, naked from the chest up, bust into a Manhattan polling station early Tuesday, shouting:  of our polls Trump, out of our polls Trump! Donald Trump was expected to show up later to cast a vote himself.  Our reporter Mark Matthews was in the basement of PS 59. @webpagelink"},{"comment_id":"559542634171067","commenter_b":"Attack Attack Attack !! We will give you something to cry about. Sieg Heil !","commenter_a":"Some of us have been warning of this for quite a while. People are not thinking. They are emoting feelings.","post_message":"He would know…"},{"comment_id":"434228700035058","commenter_b":"Why so illegal immigrants can collect our money??? I think u should have to prove that you' have worked for 20 yrs or more to collect","commenter_a":"Also give thanks to Bill Clinton who signed the bill making it legal to outsource jobs here.","post_message":"Jeb Bush wants people to work until this age. I'm sure this will raise some eyebrows."},{"comment_id":"10154194014766509","commenter_b":"*you're *themselves","commenter_a":"Why should everyone else have to be exposed to a trans person using the opposite bathrooms and locker rooms? If a person feels they are the opposite sex, get the full operation.","post_message":"The district has one month to provide access or they will lose federal funding."},{"comment_id":"1174568802605235","commenter_b":"They are not Isis,just Philly scumbags ,perpetrating a fraud. shoot them violent criminals have no place on our planet","commenter_a":"We are at war people. It's gonna be us or them, I'm stocking up, bigtime.","post_message":"In Philly,  this group of MUSLIM thugs ATTACK patrons and yell \"We Belong To ISIS\"  Obama has imported over 1 million muslims since he became president... 'FUNDAMENTALLY TRANSFORMING AMERICA!'  Let's GET 5000 SHARES if we should BAN Muslim Immigration!"},{"comment_id":"1607872669509039","commenter_b":"All those white people in the crowd. Not enough Super predators. We need more super predators in the crowd please.","commenter_a":"killary for prison","post_message":""}]
