[{"comment_id":"1199159113429677","commenter_b":"Pay for your own abortions, which you can find probably within a couple of miles of your campus. Grow up, get a job and don't bother adults.","commenter_a":"Keep your legs together and study.","post_message":" who are condemning my bill because it is   having the right to live a healthy life is NOT immoral and every student should have access to safe and accessible abortions especially because being a student at Cal is already so demanding. [] This is a womxn [sic] issue, a students issue, and a humxn [sic] issue. If you do not support abortions, don get one."},{"comment_id":"1715229538739557","commenter_b":"True. Plus who would want to see Hillary the Hag naked","commenter_a":"She was a good looking woman, now lets see them run nude picture of Hillary or maybe Chelsea, but then that would be equal and fair treatment and they will NOT be that.","post_message":"NYPOST runs naked pics of Trump's wife... again"},{"comment_id":"10154606331071037","commenter_b":"She will not become president!","commenter_a":"I will wait and see what he does when he is actually president this is just all talk for the votes on both Hillary bringing in all the families from Ferguson and the parents from the Military we need someone to fight for the people not against each other we already have enough of that.","post_message":"“What is Trump? He’s not a Republican. Absolutely not. Those are not the Republican principles. He’s not a Democrat. He is just himself. He is egocentric.”"},{"comment_id":"10153266875433010","commenter_b":"Except for leaving him to near starve and die for 66 days","commenter_a":"God is good all the time... :-)","post_message":"His family reported him lost at sea 66 days ago. He said he survived by rationing his food and drinking rainwater.  “...everyday I was like, 'Please God, send me some rain, send me some water.'\""},{"comment_id":"1410115659014394","commenter_b":"Andres Rivera illegals don't belong here","commenter_a":"IMPORTANT *** California, Montana, New Jersey, New Mexico, and South Dakota, please vote for Donald Trump on June 7. We have 126 UNBOUND delegates who can choose to not vote for him on the first ballot. We need 126+ more BOUND delegates to secure a first ballot win and avoid a second ballot! Vote for Mr. Trump on June 7!","post_message":"The good news is that my campaign has perhaps more cash than any campaign in the history of politics. That's because I am standing 100% behind everything we do."},{"comment_id":"1394774427201577","commenter_b":"She shouldn't even have a job because she is an illegal alien.","commenter_a":"Frank tokar maybe if you were in her parents situation would do the same , you do anything to make sure sure your children are safe and have the best you can give them , USA is a líder no a low un respectful selfish heartless country thanks god no every American think that way USA is a country of opportunities no one takes your jobs away all depends on you how hard you work .","post_message":"Rick Santorum and Anna Navarro engage in a passionate exchange with a DREAMer who says she may lose her career if the new administration ends DACA. @webpagelink"},{"comment_id":"10155148589429614","commenter_b":"Yes send them to jail!","commenter_a":"@username if I was that teacher I would have been calling the cops EVERY DAY about the abuse of that baby!! ESPECIALLY after he asked her to call the social worker!! That poor little boy knew there were people out there that could help him, and then realized how bad he was being failed by everyone","post_message":"In testimony during the preliminary hearing, teacher Jennifer Garcia said in the months before Gabriel Fernandez's death, she repeatedly reported to county child service workers new signs of abuse that prosecutors say came at the hands of his mother and her boyfriend.   In one instance, Gabriel came to school with swollen eyes and a pockmarked face, she said. At first, he said he had fallen, but he then told her,  mom shot me in the face with a BB gun, she testified.  On two occasions, she testified, a fearful Gabriel asked,  you call that lady?, referring to the county social worker. But as months passed, and the boy remained with his mother, Garcia said she began to lose confidence in child protective services."}]
