[{"comment_id":"861030830662191","commenter_b":"That's why we can't allow Muslims in","commenter_a":"Tragic.","post_message":"THE LATEST: At least 100 killed inside Paris concert hall"},{"comment_id":"10156219984965725","commenter_b":"Go home. You're drunk.","commenter_a":"WE NEED TRUMP!!! #Trump2016","post_message":"Signing my tax return...."},{"comment_id":"1886562518248287","commenter_b":"She's turning them","commenter_a":"This is beautiful","post_message":"EAGLET WATCH!  Did you see one of the eaglets peeping through a hole in its egg?  When do you think it will officially hatch?  Let us know where you tuning in from and what name ideas you have for the babies!  Full story:  @webpagelink  Pix courtesy Southwest Florida Eagle Cam"},{"comment_id":"10153179398831051","commenter_b":"I wouldn't make my daughter wear a sign as punishment. I would just give her a spanking.","commenter_a":"I like it!","post_message":"This is how a dad decided to punish his teenage daughter. Good idea or bad idea?"},{"comment_id":"10153494400717093","commenter_b":"They some hoes","commenter_a":"@username Mayra Castaneda","post_message":"Instead of going into a legal battle, the Dallas owners want the public's help picking a new name for the restaurant. @webpagelink"},{"comment_id":"10153885914416336","commenter_b":"Because of the way, they TREAT WOMEN!","commenter_a":"This woman is totally ignorant. How many Muslims live in the US? Are they all terrorists? How many such shooting have taken place in the US? Are these all terrorist acts done by Muslims? Why dont you open your eyes and find out that all these terrorists have links with Pakistan and Saudi? Why nobody dares to say where all these terrorists come from or have link with? Why do you stamps all Muslims as terrorists?","post_message":"“There are jihadists out there… who want to kill all of us because of our way of life... We have to understand that we can no longer be politically correct.”  Judge Jeanine Pirro slammed the White House for being too politically correct when it comes to the threat of terrorism. @webpagelink"},{"comment_id":"953749507999241","commenter_b":"I don't care if someone is breast feeding, but I cannot stand when attention seeking bitches claim they want equal \"rights\" but actually want to go around showing off their shitty bodies, crying for attention. Don't even try to tell me men and women's chests are the same, our chests have evolved for thousands of years to feed a child, men's have not. Just like men generally have a lot more muscle mass, they have evolved to meet the needs of his family while the mom nurtures and takes care of the babies. You are NOT feminists, you are an embarrassment to the female society. I want to fight for the rights of women who can't leave the house without a male, and are brutally forced into genital mutilation. The ones who are so \"oppressed\" because it's not socially acceptable to be naked in public make my blood boil. Like ...","commenter_a":"sorry, I don't want to see it either and I have 3 children myself. it's wonderful, its necessary and its private.","post_message":"Talk about a great response from the mom. (via TakePart.com)"}]
