[{"comment_id":"1191980840884045","commenter_b":"Seth Rich, DNC staffer, suspected of leaking information to WikiLeaks about the Clinton campaign randomly gets shot in the back walking down the street.... Why are so many Americans blind to the corruption in the Clinton campaign? People with credible evidence against Hilary are turning up dead. This is not a random instance. @webpagelink","commenter_a":"Trump will make changes, and yes Obama Trump doesn't think we faked the moon landing.","post_message":"Barack Obama’s greatest strength? “Probably that I’m always early.” hillaryclinton.com/makeaplan"},{"comment_id":"1075446135834786","commenter_b":"She's a sell out!","commenter_a":"I don't know who she is. I've seen her before but in what I don't recall. But I really didn't get the joke or whatever it was supposed to be. ...","post_message":"What did you think of Stacey Dash's appearance at the #Oscars? @webpagelink"},{"comment_id":"1074056242615386","commenter_b":"Because people destroy their habitat and poach them for money.","commenter_a":"Wild animals shouldn't be kept captive! They should be in the wild if people want to see them why don't they go to there homelands instead of leaving them kept in cages!","post_message":"This gorgeous little jaguar cub made his public debut this week at the San Diego Zoo."},{"comment_id":"996887350366269","commenter_b":"Democratic Presidential Debate CLINTON vs SANDERS --- @webpagelink","commenter_a":"I drove 4.5 hours to Flint, Michigan, this week from Toronto, Canada, to volunteer my time on the @username campaign in the days leading up to the Michigan Primary. The people who work in Bernie's Flint office are passionate people with a strong desire to change America and help the people of Flint. I have actually never seen such an example of government neglect in my life. I spent a significant amount of time handing out water, door to door, and I still can't shake the feeling of being helpless - I felt helpless that I couldn't do anything to help them and I felt even more helpless that no one else was doing anything to help them either. I am not an American, but I know that America is better than this. No civilized society should allow hundreds of thousands of their own people to be neglected and abandoned ...","post_message":"The governor of Michigan must resign, but more importantly we must take action to help the people of Flint. Children in America should not be poisoned. The federal government must act. No one should pay a water bill for poisoned water. #DemDebate"},{"comment_id":"10153018136071130","commenter_b":"I think ikea is a great test to the relationship for sure. I've gone with many friends who argue with their SO the whole time, who later break up... Whereas me and my bf of almost 10 years have gone together many times and have a blast","commenter_a":"Jacob opppsss","post_message":"Attention couples: this store will make you want to kill each other."},{"comment_id":"10153641394251350","commenter_b":"I think she would be a skank in a princess gown.","commenter_a":"Hilarious ! She has guts. Good for her!","post_message":"What did you think of Miley Cyrus' first outfit of the night at the MTV Video Music Awards?"},{"comment_id":"10153098035411336","commenter_b":"No black race can prosper in caucasian society africa today has more midlle class than india our people in united states are in hell we africans has more future than them i hope one day they would come back to their motherland and leave the caucasians with their stolen land","commenter_a":"Time to clean up your act. Why do Asians, Europeans and other immigrants acclimate themselves into society but after 150 years blacks still expect others to take care of them. They are a society of takers and beggers. I'm sick of it. Why has Oprah, Conde Rice, Colin Powell and many others succeeded? ... they conformed to society, got an education and accepted responsibility for their own life and THEY WON.","post_message":"\"Nobody from ISIS ever terrorized us as a people as the police do us daily,\" Nebraska State Sen. Ernie Chambers said during a recent legislative hearing."}]
