[{"comment_id":"10153875046907235","commenter_b":"So did Ollie North! The fuckery.......","commenter_a":"\"Former United States Attorney general sold guns to drug cartels.\"","post_message":"WHOA"},{"comment_id":"873720596067983","commenter_b":"Hey the Fuck out ugly bitch","commenter_a":"Good bye","post_message":"Well I guess she's going to say goodbye.  Will you happy to see her go?"},{"comment_id":"994048267321588","commenter_b":"Yes. And paid for by private donations","commenter_a":"Gorgeous yet not gaudy. Most important: Everything was Made in the USA . Wasn't it?","post_message":"Michelle Obama blows $600k on ‘modest’ dining room makeover"},{"comment_id":"10153291728974726","commenter_b":"Is it just me or is it beginning to look like it is just one group of \"slick\" parasites that is destroying America.","commenter_a":"Some people get it. Too bad the entitlement crowd isn't listening! They would rather consider themselves as victims of Whitey.","post_message":"VIDEO: Tavis Smiley: Government Programs Have Led to the Dissolution of the Black Family"},{"comment_id":"496840043839909","commenter_b":"No she should not!!!!!!","commenter_a":"well at least something can move them","post_message":"America in uproar after this Sarah Palin Picture leaks.  We stand behind her 100%. We need to show her our support.  Should Sarah Palin Refuse To Take Down This Picture?"},{"comment_id":"838491256240234","commenter_b":"Please go back to whatever planet you came from!!!! Haven't we had enough of her?","commenter_a":"Oy! She is no longer relevant, though she keeps trying to be. Now just looks foolsih. Very sad.....","post_message":"They're back! The Palins are trying to horn in on the Duggar spotlight, regardless of how grimy."},{"comment_id":"10153440458394087","commenter_b":"God please give us her in the White House so we can see her on TV everyday!!","commenter_a":"just a dumb shit for hanging with trump","post_message":"“Do I agree with him all the time? No,\" Melania Trump says of her husband Donald J. Trump. \"I think it is good for a healthy relationship. I am not a ‘yes’ person. No matter who you are married to, you still need to lead your life.”"}]
