[{"comment_id":"10158146961425354","commenter_b":"Patton Oswald? Never heard of her. When will the Secret Service pay a visit to this loon?","commenter_a":"King of Queens actor. Weirdo.","post_message":"PROGRESSIVES' HATE TURNS EVEN DARKER   “Holy F*ck. Come ‘n’ get it, terrorists.\""},{"comment_id":"10153906415276545","commenter_b":"@username You are correct, we have plenty of citizens/legal residents committing crimes we don't need those who aren't supposed to be here in the first place compounding the problem. It is time for sanctuary cities to end. Either you are part of the U.S. and adhere to U.S. law which should be enforced or you secede.","commenter_a":"Is this guy a legal citizen?","post_message":"Laura Ostteen took a hit so hard that it hurts to see. All because of a 5 a.m. run for milk to a convenience store as the city of Dallas sees increase in violent attacks."},{"comment_id":"10153328775418128","commenter_b":"I thing that puts our 18 trillion in debt in perspective...","commenter_a":"No doubt that population and geographical size - density as a dependent variable of income per-capita help construct the value perspective.","post_message":"The most valuable U.S. states by land value: 1. California 2. Texas 3. New York"},{"comment_id":"10154465654928908","commenter_b":"@username Now you want to talk about owning slaves, I don't know, maybe you do, but it is the year 2016... time for major changes in this world....","commenter_a":"Is this a good thing or a bad thing... killing of new born male chickens is a bad thing, but now genetically creating only females doesn't seem right... maybe people should just quit eating chickens.....","post_message":"Newly developed technology will determine the sex of each fertilized egg before the chick inside develops - enabling the removal of all male-identified eggs from the hatchery. This will eliminate the industry need to heartlessly grind male chicks once hatched"},{"comment_id":"977688075599947","commenter_b":"Dirty whore","commenter_a":"HOA president needs to remember where she lives!","post_message":"How idiotic!"},{"comment_id":"10153167916826336","commenter_b":"I don't understand it either.","commenter_a":"They should have just as much of a right to stop and salute the flag as anyone else. Baseball is America's pastime and they deserve the right to respect the country.","post_message":"Workers say ordering them to work through the singing of the national anthem is disrespectful."},{"comment_id":"1717609118507402","commenter_b":"She can move her wretched ass OUT!","commenter_a":"Please","post_message":"Michelle Obama: Every single day, \"I wake up in a house that was built by slaves.\""}]
