[{"comment_id":"500607250129855","commenter_b":"Smoke them if you got them, probably can get the best shit.","commenter_a":"This right wing crap. I am right of the right and this is crap","post_message":"The White House is in uproar after Obama daughters caught doing THIS.  This is outlandish. These are the daughters of our president.  Would you vote to kick the Obamas out of the White House?"},{"comment_id":"10152602775901636","commenter_b":"She could have kept going, but she also could have allowed the crazy lady to get a great distance away from her. She had a kid in the car. Why engage someone and put yourself and your child in danger? I do not blame the victim, however, she could have made the decision to pull over for 3 minutes or so to put some distance between them.","commenter_a":"Maybe that was the road she needed to take? So it's her fault for continuing to drive like she's supposed to??? Geeze","post_message":"Things take a scary turn when the woman stops her vehicle, gets out and walks up to the car."},{"comment_id":"1360247024053830","commenter_b":"Get these bastards out of our country they are worse than maggots","commenter_a":"Ship her sorry ass back to the Middle East. She will be the one spit on.","post_message":"This Muslim did something absolutely SICK to white Americans at Walmart... She's now facing hate crimes charges over this... wow."},{"comment_id":"10154413621893279","commenter_b":"Bet she took the money anyway. How pathetic","commenter_a":"Progressives are all right in the moment Conservatives alway have the best long range strategies for gaining and holding power","post_message":"Hillary Clinton faced protests Monday by Palestinian rights activists outside a fundraising event at the Beverly Hills estate of billionaire Haim Saban."},{"comment_id":"10150822941699963","commenter_b":"What an entitled, self absorbed, sniveling whiner she is.","commenter_a":"Grow up Donnie","post_message":"Who saw this coming?!  Everyone. Everyone saw this coming."},{"comment_id":"559542634171067","commenter_b":"Attack Attack Attack !! We will give you something to cry about. Sieg Heil !","commenter_a":"Some of us have been warning of this for quite a while. People are not thinking. They are emoting feelings.","post_message":"He would know…"},{"comment_id":"1241057529263037","commenter_b":"All those upset by the depiction of a multi-racial family should investigate their own DNA. One can only wonder at their stupidity and self-loathing!","commenter_a":"Well done State Farm.....","post_message":"Can you believe this?"}]
