[{"comment_id":"10155302418745579","commenter_b":"lady, you need medication.","commenter_a":"My Grade for President Trump A-. Will go up to an A++ when those planted by the last administration to attempt a political coup are removed. My grade for Congress D- will go up when BOTH party's stop trying to slow down the executive branch and start working for the people .","post_message":"GOP Only: Your Grade of Pres. Trump & Congress?"},{"comment_id":"10154257550106491","commenter_b":"Beyonce is racist scum","commenter_a":"Fuching nightmare.","post_message":"It's the ultimate playdate."},{"comment_id":"10154075647091770","commenter_b":"You are totally right, Tucker.","commenter_a":"We turned to Hollywood to be entertained...NOT FOR POLITICAL COMMENTARY OR OP-ED! It really is that simple.","post_message":"Tucker Carlson has a message for Hollywood liberals"},{"comment_id":"982852498479883","commenter_b":"racist hater sit down and shut up","commenter_a":"Oh, sure, especially the way he goes to other countries and slams the US, apologizes for America and bows to other world leaders and racist michelle complains that she wakes up in a house built by slaves, was not proud of her country til barry started destroying it and spends millions of taxpayer dollars taking her huge crew on vacation around the world. They are an embarrassment.","post_message":"Are you proud to have the Obamas representing America around the world?"},{"comment_id":"688602181316881","commenter_b":"Bitch bye","commenter_a":"@username smh","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"},{"comment_id":"10155024301581600","commenter_b":"Yeah, what's a whinner?","commenter_a":"Proof we have become a nation of whiners.","post_message":"Tens of thousands packed into downtown."},{"comment_id":"1108180832531570","commenter_b":"You need to get out more, specifically a museum.","commenter_a":"Ppl are quick to doubt things like this but believe whatever Fox News tells them. Meanwhile every civilization that recorded their history speak of giants. How can one make up or imagine Giants without being exposed to them or having seen them? Just like they wrote about hybrid races u think they made it up? Nope I think archaeologists (not all) but as a whole cover things up so they can keep getting funded. I don't by into dinosaurs, I think they are the hybrids ancient cultures speak about but hey if a man in a white lab coat says the grass is really blue a third of mankind would eventually start to see blue too. To each Is own tho","post_message":"A team of archaeologists have uncovered the skeletal remains of a giant in the Bulgarian city of Varna. Located on the eastern shores of the Black Sea, Varna is now a major tourist attraction. The area has a rich culture and its history goes all the way back to 5,000 BC. The oldest golden treasure in the world was found during excavations at the Varna Necropolis and carbon dating revealed it was buried more than 6,500 years ago. Thoughts?"}]
