[{"comment_id":"10153030735456378","commenter_b":"Weather this is true or not I don't know,but one thing I do know is none of us would be in the water if we saw what was swimming around or beneath us!!!","commenter_a":"Hoax","post_message":"REAL OR HOAX? A video showing a great white shark circling a surfer has gone viral... but now, people are questioning its authenticity. What do YOU think? Is it real or is it a hoax?"},{"comment_id":"766779530124121","commenter_b":"Vile woman","commenter_a":"LUCIFER CAN just go Home--The party is over--GOD BLESS AMERICA","post_message":"Thank you Indianapolis for the welcome. #ChooseCruz tomorrow: @webpagelink"},{"comment_id":"10155223291794218","commenter_b":"Hillary didn't get elected. You're a victim of liberal ideology and the dumbing down of society.","commenter_a":"Section 212(f) of the immigration and nationality act of 1952 states: whenever the president finds that the entry of any aliens or of any class of aliens into the united states would be detrimental to the interests of the united states, he may by proclamation, and for such period as he shall deem necessary, suspend the entry of all aliens or any class of aliens as immigrants or non immigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate. Any questions?","post_message":"The Department of Homeland Security says it will comply with federal orders not to deport detained travelers"},{"comment_id":"10153912824075579","commenter_b":"This women reminds me of what I leave behind in the toilet!!!!! And It really stinks! FLUSH!","commenter_a":"Whatever her stylist is doing, keep doing it. Love that green leather jacket!","post_message":" had a pretty long day yesterday. Hillary Clinton addresses the DNC Women Leadership Forum.  Watch complete video from the event here: @webpagelink"},{"comment_id":"1596643573967911","commenter_b":"She is a liar and should be behind bars!","commenter_a":"#Sethrich","post_message":"WATCH LIVE: Hillary Clinton reveals economic plan in Michigan — how will it differ from Donald J. Trump's?"},{"comment_id":"10150875072404999","commenter_b":"Why should it always be hush hush? I was told by a lady that '' Your daughter loves to play sports. Make sure she doesn't mention her periods or say it hurts because her coach will kick her out especially in our school district.'' She will still participate no matter what ,but y the taboo?","commenter_a":"All power to her to be able to compete with period cramps.","post_message":"An Olympic commentator turned to Fu Yuanhui, who was grimacing in pain. “It’s because I just got my period yesterday, so I’m still a bit weak and really tired. But this isn’t an excuse for not swimming well.”"},{"comment_id":"10153128289641636","commenter_b":"You got daughters?","commenter_a":"Absolute madness.....by all means reprimand him through school procedures but don't criminalise him....it's somewhat excessive.","post_message":"She was 14"}]
