[{"comment_id":"1514259995548132","commenter_b":"... People do realize the article isn't about humans right? None among us can store the seminal fluid of various males and asses it for quality before choosing our baby daddy's, just FYI. ;)","commenter_a":"Rachel Pratt :)","post_message":"There's more to semen than just sperm."},{"comment_id":"10156221727930389","commenter_b":"#Trump2016forPRESIDENT Build that Wall !! Make America Great Again is the only one running to can get the job done a Strong Leader ... carson is no-way President Material","commenter_a":"I am still voting for #TRUMP because he enforces the laws and is paying his own way and does not want a salary he is working for what is right for the American People","post_message":""},{"comment_id":"1384744278251983","commenter_b":"I blame Obama, Jackson, Sharpton, Pelosi ...................","commenter_a":"Maryliz T. Curtis","post_message":"'It's a kind of anti-black mood'"},{"comment_id":"1760125540941984","commenter_b":"They're far better than Hillary and her crooked minions! If she gets elected, we'll be under Sharia Law so fast your head will spin!","commenter_a":"Too funny - it just continues to be the funniest convention of all time - Hey, Christie a few months ago when you were running yourself - you decardedTrump unqualified to be President - too funny. All of these clowns: Christie; Gingrich; Pence and TRUMP are all an embarassment to the GOP party.","post_message":"Delegates at the Republican National Convention chant \"lock her up\" as Governor Chris Christie says \"I welcome the opportunity to hold Hillary Clinton accountable for her performance and her character.\" More: @webpagelink"},{"comment_id":"785245424951309","commenter_b":"Girl go sit down somewhere","commenter_a":"those that vote for the \"first female\" president will get the same crap that the \"first black\" man president gave us.","post_message":"President Obama is speaking at a \"Get Out The Vote\" rally in Ann Arbor.  Read more about his visit: bit.ly/ObamainAnnArbor"},{"comment_id":"10154133413586350","commenter_b":"Not cow milk. We are the only species who drinks another animals milk. You've been sold to drink milk because it gives you calcium but it does the complete opposite. It's all about $$$ Do your research, people! Cow's milk is not good for us.","commenter_a":"My siblings and I were fed carnation milk from a can and then whole raw milk from the bulk tank in the barn We're are all healthy and allergic to nothing.","post_message":"Is nonfat, low-fat, reduced-fat or whole milk best for your children?"},{"comment_id":"10155534707951509","commenter_b":"Hillary is going to prison, The wicked witch is dead.","commenter_a":"Black people don't vote for Hillary Clinton. In 1994, she signed the mass incarceration bill with her husband, which put many black people in prison for small related crimes. Trump wants to fix the black communities, get a better educational system, and invest more in the schools. Vote for Hillary and black people will be suffering for another 4-8 years, just like the last 8 years when we had all these promises that never came.","post_message":"Michael Dale Vance Jr., the Oklahoma fugitive who authorities said shot two officers and killed two of his relatives last week, was killed in a shootout Sunday night, according to the FBI's Terry Weber."}]
