[{"comment_id":"769355346496407","commenter_b":"I am on Pam side screw the rest of them assholes.","commenter_a":"Bullshit she clearly antagonized this lame ass broad","post_message":"She believes she saved lives by hosting the contest."},{"comment_id":"847297252033195","commenter_b":"Girls run the world!","commenter_a":"No on F'in cares except the racist thugs like OFAILURE & OSHARPTON & BSNBC !","post_message":"Who run the world?"},{"comment_id":"10153189105981336","commenter_b":"The pansies out there today would be a total embarrassment to this country. They would all turn tail and run. No backbone, no moral compass, no strength and no sense of reality. I blame the coddling society and the progressive liberal media.","commenter_a":"start the draft back up ...let these boys do a few years in the service","post_message":"Frat boys from the University of Florida and Emory University have been accused of urinating on an American flag, spitting on a vet and a service dog, and making derogatory comments toward veterans’ wives.  And that was just the beginning…"},{"comment_id":"504925023037210","commenter_b":"Geez. Is that OLD gal still around?","commenter_a":"She might find out how Hilter was if Hillary gets elected that your guns take away your health care tax away all your money distribute people money after the rich and powerful take most of it. OH MY GOODNESS THAY COMMUNISTISM","post_message":"According to the great celebrity-turned-philosopher Cher, Trump is now a genocidal murderer..."},{"comment_id":"903394569805665","commenter_b":"Blow them out of the water.","commenter_a":"Ok ok this time only send them $20 million","post_message":"New Video: Four ships belonging to Iran's Islamic Revolutionary Guard Corps (IRGC) \"harassed\" an American destroyer in the Strait of Hormuz Tuesday, a U.S. Navy official confirmed to Fox News. @webpagelink"},{"comment_id":"10154003941470950","commenter_b":"Elizabeth Lilly what a ignorant women you are","commenter_a":"His first 100 days will be tremendous. So tremendous and full of catering to Russia. Bigly. He will keep us in suspense as he plans to steal back the money he spent for the campaign. So many plans. Big plans. And we're gonna pay for it. Bigly.","post_message":"Trump is about to speak to a crowd about what his first 100 days in office will look like: @webpagelink"},{"comment_id":"10154633798866729","commenter_b":"Jamie i am totally sober at all times Jamie…..maybe you are on drugs for believing she is not an Evil Satanic Whore who laughs at Raped 12 year old Girls when she knowingly defends their guilty Rapist ?","commenter_a":"Many in the FBI still do love this country very much and are NOT blind followers of Obama and his Anti American Commie nonsense….it would be a good tactical move to wait till Hillary is nominated as the \"Head Liberal Witch\" before they Arrest her and burn her at the Stake ( like we are all praying) happens on live TV so we can rub one out while watching her salty tears run down her Reptillian Alien face.","post_message":"Finally, the end may be near..."}]
