[{"comment_id":"482294165294497","commenter_b":"Our home, our laws. Get out of our country!","commenter_a":"Kick islam out of America.","post_message":"First our schools, then our public areas, what's next?  'SHARE' this post, we have to let the nation know what the MSM won't.  Do you agree Shariah must be stopped?"},{"comment_id":"1157451387627650","commenter_b":"Another sidetracking trick.","commenter_a":"Ah yeah. That should do the trick.","post_message":"OBAMA'S NEXT MOVE TO SCREW AMERICANS and protect illegal aliens...  @webpagelink"},{"comment_id":"1833505306896062","commenter_b":"Oh good....another ignorant ass showing her prejudice for all to see like it should be something to be proud of.....it just shows how utterly stupid she is......but then again by hearing her accent I could have figured that out all by myself.....hey sea cow......why don't you go back to the ocean where you belong???","commenter_a":"Surely someone knows who she is and all of these comments should be sent to her. Sorry excuse for a human being!","post_message":"Ugh... welcome to Trump's America."},{"comment_id":"1722289054713180","commenter_b":"notice how she talks about white man?","commenter_a":"@username Former foreign minister , has failed in its mission and has caused much of the confusion the US administration @username was not calling things by their names correct .. for example, terrorist organizations ( liberation movements ) , states that support extremism ( our friends ) , dictatorships ( our partners ) @username win means that a disaster occur American nation","post_message":"Women across the country lose out on every paycheck—and women of color feel it the most. Our families can’t wait: It’s time to ensure equal pay for women. hrc.io/EqualPayDay #EqualPayDay"},{"comment_id":"10154165530049087","commenter_b":"Ironic. Very. Seeing as his white queen did the exact thing he's bitching about","commenter_a":"Who gives a SHIT? I certainly don't care about Podesta's emails...not from before, during or after....fuck Wikileaks. Here's a thought, Mr. Assange, perhaps if you surrendered to the British Authorities for violating the terms of your bail, returned to Sweden to face the rape charge against you and STOPPED being a puppet for Russian Intelligence, maybe I'd take you seriously? The fact remains you broke the law and you lose all moral high ground when you want others punished but not yourself.","post_message":"BREAKING NEWS"},{"comment_id":"10156573724785294","commenter_b":"This sickens me! There are so many people in this world that would love to have a child and would never do this to one, why do these type of people exist???i think they should have the same thing done to them!","commenter_a":"Makes me sick!","post_message":"'This is just one of those cases that just shocks the soul...'  A babysitter accused of horrific abuse after a 3-year-old is found bound and gagged in his closet for \"being too loud.\" The girl's head was also shaved as part of a plot by her mother to make some money, police say."},{"comment_id":"1642358432731311","commenter_b":"She was queen to Obammy's King. Both suck!","commenter_a":"This dumb bitch needs to shut the fuck up!","post_message":"Do you think Oprah is a bigot?"}]
