[{"comment_id":"10155963781495354","commenter_b":"Kick that racist bitch out.","commenter_a":"Socialist pig","post_message":"Stephanie Rawlings-Blake insisted that, in the last few weeks, she has “seen a lot of progress”--and by that, she meant tax dollars going to “recreation centers” and spending on schools."},{"comment_id":"245227072596737","commenter_b":"She's a freaking retard!","commenter_a":"One thing he is not insecure, but you are Nancy","post_message":"\"I feel sorry for you. You're the president of the US and you're so insecure...I pray for your Mr. President. And more importantly, I pray for the United States of America.\"  Do you think Trump is insecure?"},{"comment_id":"10152857531566491","commenter_b":"Dustin I spelled behaviour perfectly fine. Only AMERICANS spell it your way. And that's not saying much","commenter_a":"WHAT?! maybe influencing spoiled, childlike behaviour!","post_message":"Kanye West is on TIME's list of the world's most influential people #TIME100 @webpagelink"},{"comment_id":"1348114028561384","commenter_b":"This woman is supposed to be a reliable, professional journalist? Bitch please, she is a joke!","commenter_a":"F Kaine he's a hillbilly","post_message":"LIBERAL MEDIA's meltdown.  @webpagelink"},{"comment_id":"1941882042704784","commenter_b":"And some will just because it's a female!!","commenter_a":"I'm speechless!!! It's incredible what that vile woman has gotten away with! I've lost all hope in this government and country! It's bad enough she's gotten away with MURDER but to think of the multitude of fellow Americans who'll vote for her is an atrocity!!","post_message":"\"Yes, [Donald J. Trump] is far better to be commander-in-chief than Hillary Clinton in my mind. I don't think Hillary Clinton is going to do any of the things we need to do to get this country back on the right track. More importantly, I think she has been holding herself to a different set of standards, and I don't think that is representative of what we want to see in the White House.\" — Speaker Paul Ryan"},{"comment_id":"512585862199466","commenter_b":"Anyone who does homework works for his or her education.","commenter_a":"The man","post_message":"Thank you to everyone who has donated to my campaign- we have raised $51,000,000.00 in the month of June-- thanks to you! Lets MAKE AMERICA SAFE AND GREAT AGAIN! You can make secure donations here: @webpagelink"},{"comment_id":"244406076005864","commenter_b":"@username drug cartels make millions on drug sales they will find a way around it but okay build a billions worth of wall that will stop evrything","commenter_a":"Thanks for the post, I knew he was good, but I didn't realize he was THAT GOOD!! Awesome! It's sad he has to mop up this big mess from Obummer before he can get around to some other great changes.","post_message":"Give Donald J. Trump a chance? Here's what he's done in the past 36 hours..."}]
