[{"comment_id":"10154319507055329","commenter_b":"Haha complete and utter shit show Xxx","commenter_a":"Charlotte, number 4 and not number 5 lol!","post_message":"Here's to the tea addicts!"},{"comment_id":"1078684138859436","commenter_b":"How far out to sea is that wall going to stretch? Must be like that wall in Game of Thrones that can keep all the nasty people from taking to boats. Once Trump develops this wall technology he will make billions selling the idea to Europe and I bet they let him put his name on it in big gold letters!","commenter_a":"There will be no wall","post_message":"Thank you for the incredible amount of support last night- San Jose, California. I love you all - we will deal with the thugs & criminals -- we will build the wall --- and Mexico will pay for it!"},{"comment_id":"10153381593334411","commenter_b":"If you've been in brothel, you are worse than a prostitute, as prostitutes might were forced to do it, you go there at you own will, which makes you a sleaze-ball","commenter_a":"idk, a Russian backed news organization saying America is a police state? Maybe, but few people are being jailed for being gay here as opposed to your \"glorious\": homeland","post_message":""},{"comment_id":"10153999668791756","commenter_b":"Rapists and murderers... Yeah, idgaf about them. Kill them right away and stop wasting tax payer money.","commenter_a":"Not only 27. 27 too many. How many people were proven innocent after decades of being in jail?","post_message":"\"We get it wrong sometimes, and in the death penalty, we just can't get it wrong.\""},{"comment_id":"944224732371213","commenter_b":"Yeah, she didn't want to have sex with an Orange baboon.","commenter_a":"I guess Trump would know a lot about attitude. He has a very bad attitude and has the emotional age of three!","post_message":"\"She gained a massive amount of weight, and it was a real problem. We had a real problem. Not only that, her attitude,\" Trump said Tuesday morning."},{"comment_id":"10153813591902293","commenter_b":"Jealous women!","commenter_a":"Hmmm.....now what kind of people would call in and complain about a woman's bare shoulders......any guesses?","post_message":"The station received several e-mails during the broadcast complaining about her bare shoulders."},{"comment_id":"10154390282749411","commenter_b":"Yeah, only to let them in later since we have open borders with yhem","commenter_a":"@username Lessa Katherine but sure.. let them into europe haha","post_message":"'This is my sincere thought'"}]
