[{"comment_id":"946547988774787","commenter_b":"Theresa, get a job, I'm retired! Baaaaaaaa, sheep!","commenter_a":"I don't care what Stewart thinks; I'm not one of his unemployed sheep!","post_message":"\"I honestly have nothing other than just sadness, once again, that we have to peer into the abyss of the depraved violence that we do to each other, and the nexus of a just gaping racial wound that will not heal, yet we pretend doesn’t exist.”  -Jon Stewart"},{"comment_id":"1420716084688108","commenter_b":"Lol who said I support the wall..guck the wall just spend more deporting illegals... end of story","commenter_a":"Warren is a liberal piece of fucking shit!!!","post_message":"Republicans did NOT want you to hear this letter. Pass it on!"},{"comment_id":"1026655844022093","commenter_b":"so, we didn't have Zero cases of measles in the US in 2000 then?","commenter_a":"Wake up. Measles has NEVER been ERADICATED!","post_message":"Let's take a moment to remember that measles was ERADICATED from the USA in 2000. Nice job, anti-vaxxers."},{"comment_id":"10153496475494575","commenter_b":"\"She has since filed an appeal.\" Wow! She has some f***ing nerve!","commenter_a":"Horrible, horrible person.","post_message":"An 8-month-old baby girl died after an EMT refused to respond to the call.  The EMT told her boss, “I'm not about to be on no scene 10 minutes doing CPR, you know how these families get.\""},{"comment_id":"980669235328527","commenter_b":"That is exactly what they should do no money","commenter_a":"I do not know who those three boys are but they sure made me a proud American--What angers me with these Administrators do not care that the cemeteries are full men and women who fought and died for what that flag represents--I with @username","post_message":"Tennessee School District Bans All Flags, Including the American Flag (VIDEO)  @webpagelink"},{"comment_id":"10156563321065354","commenter_b":"She is such a fucking idiot.","commenter_a":"A lying bitch just a lot of talk. Her proposals want ever work. Hillary though will never be president","post_message":"#6 and #7 will INFURIATE you..."},{"comment_id":"765775893538794","commenter_b":"What about women that do?","commenter_a":"Wonder what this means for me","post_message":"Research Says Men Who Take Selfies Have More Psychopathic Tendencies"}]
