[{"comment_id":"10155104320669614","commenter_b":"Liliana Sanchez ghetto AF.","commenter_a":"Losers","post_message":"Officers recovered a large amount of stolen mail, checks, W-2's, government identification cards, and narcotics after arresting the pair, authorities say.   Police estimate there are more than 50 victims in San Bernardino and Riverside counties."},{"comment_id":"863959926995293","commenter_b":"Denise Lange-Baker ugly ugly ugly. @username stupid stupid stupid. Denise & Tim inbreeding at it's best","commenter_a":"Sen Blunt does it hurt to be so stupid. I imagine it must hurt","post_message":"I’m proud to co-sponsor Senator Johnson’s bill to stop President Obama’s lawless #immigration power grab. I’ll continue to working with my colleagues in the House and Senate to fight against the president’s executive amnesty and his blatant disregard for the law and the Constitution. #StopObamasAmnesty"},{"comment_id":"10153779566119170","commenter_b":"Bush is a tush","commenter_a":"They need to stop this childish back and forth banter, and get back to the serious problems that need to be solved in this country! SMH...","post_message":"Jeb is pulling out all the stops on trashing Donald J. Trump, even comparing the billionaire to ultra-liberal filmmaker, Michael Moore. Of course, Trump had to respond!"},{"comment_id":"1063632813696466","commenter_b":"Lol its the food colouring haha I wana try one of those, they're in Japan aren't they? X","commenter_a":"@username fancy a green poo? x","post_message":"This is gross Burger King"},{"comment_id":"10153443725952293","commenter_b":"O AGORA SOSSEGA E ME DEVOLVE MEU DESODORANTE","commenter_a":"Victoria Dowsley","post_message":"Why it’s smart to buy the men’s version of almost anything."},{"comment_id":"10153231132726336","commenter_b":"they should leave and not allowed back","commenter_a":"Look all black","post_message":"\"If you don't like what that flag stands for... leave!\"  On 'Fox & Friends,' Medal of Honor recipient Dakota Meyer called for a social media campaign to counter a movement encouraging Americans to stomp on the flag."},{"comment_id":"1547661255293998","commenter_b":"Bitch you out your rabbit ass mind","commenter_a":"Coo coo!!!!! One flew over the coo coo's nest, and there she is!!!!","post_message":"The classics NEVER cease to amaze..."}]
