[{"comment_id":"10155458466225354","commenter_b":"Just a bunch of average women.","commenter_a":"I still cannot wrap my head around the positive reinforcement people give instead of being honest and constructive. Don't take her to dinner, take her to the gym.","post_message":"\"They’re no angels—and they own it\""},{"comment_id":"10153216491624877","commenter_b":"I just saw a story about her on the ID channel on Sunday. She's ridiculous and should be ashamed of herself. She actually chose a life of crime over her kids when they were younger. There's nothing cute about what she's doing or has done. She should be locked up.","commenter_a":"She needs to sit her old, thieving behind down somewhere.","post_message":"Notorious jewel thief Doris Payne strikes again. Fresh out of prison, Payne is linked to a missing $33,000 diamond ring. Watch how it unfolded below.  Grio fam, 84 years old and Doris is still doing her. What do you think?"},{"comment_id":"218545795283614","commenter_b":"Children in poor areas should not be doomed to poor schools.","commenter_a":"Yes, The GOP has lost every bit of self-respect they ever had. To vote Betsy DeVos in as education secretary with no educational experience is just irrational. If Betsy were smart she would decline the office and get the hell out of town now. She will not survive as educational secretary.","post_message":"Republicans just sold our public schools to the highest bidder.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153374957661051","commenter_b":"Of course, a common sense approach. All sales and transfers should be subject to a background check protocol. Keep up the rhetoric NRA, unless we see some common sense prevail among the gun lobby & gun nuts the eventual backlash is going to greatly affect responsible gun owners.","commenter_a":"To purchase any firearm there are already checks in place.","post_message":"Do you agree or disagree with America's police chiefs on this?"},{"comment_id":"10152993326411336","commenter_b":"bahahaha hahaha........I love your comment....exactly","commenter_a":"So we agree....no gun is responsible for a crime.","post_message":"“No religion is responsible for terrorism. People are responsible for violence and terrorism.”  Moments ago, President Barack Obama delivered remarks at The White House Summit on Countering Violent Extremism. @webpagelink"},{"comment_id":"619174771576535","commenter_b":"Obama and Hillary: Muslim Brotherhood Connections Shoebat.com has spent quite some time revealing the Muslim Brotherhood and the Wahhabist connections of the Abedin family and it is perhaps the right time for all this to resurface again. We do not need just emails to prove it. @webpagelink.../ Vote @username 2016! & 2020! Crooked Hillary= 3rd Obama Term #BanShariaLawInAmerica #GodBlessAmerica","commenter_a":"While denouncing @username as unqualified to be president, Joe Biden pointed out the guy carrying his nuclear football to the crowd! The VP needs to be medically disqualified from office this day. @webpagelink","post_message":"We have a President and somebody running against me that doesn't even want to use the term RADICAL ISLAMIC TERRORISM. If they can't name it, they can't fix it! It is time to MAKE AMERICA SAFE AGAIN!"},{"comment_id":"10152769636891636","commenter_b":"One day women will be in charge of everything ! Roll on","commenter_a":"Girl power!","post_message":"Last night, women took back politics from the boys' club..."}]
