[{"comment_id":"10153860133856336","commenter_b":"He just figured this out LOL i knew ever since he took office.","commenter_a":"Absolutely.","post_message":"Do you agree with Mike Huckabee?"},{"comment_id":"10153823756905671","commenter_b":"Probably no one in particular , some clubs are natural enemies to each other","commenter_a":"Wonder who he pissed off?","post_message":"A motorcyclist was shot dead on Interstate 80 near Truckee."},{"comment_id":"1026093827483671","commenter_b":"Build big beautiful wall and put it inside Trump's Ass.","commenter_a":"Good idea!!!","post_message":"They recognize the danger that Trump poses to our nation."},{"comment_id":"1011840532205809","commenter_b":"She's always been a corrupt liar","commenter_a":"One thing I know, Hillary has always been involved in community service. Go Hillary! ; .)","post_message":"A young man met Hillary at the NewsOne town hall and asked: What did you learn from the Girl Scouts that you would use to be a successful president?"},{"comment_id":"1201058653247496","commenter_b":"@username Yeah get rid of all laws because you don't like them, shoplifting, welfare and insurance fraud, ect... Do you even know what Jaywalking is where you live it why its a law?","commenter_a":"How about telling the entire story how he ran from the cop and tried to board that red bus in the picture while the cop was writing him a ticket... Also how you can hear the cop tell him to stop resisting while the kid was grabbing his baton. Oh because he doesn't feed your anti cop agenda?.","post_message":"Nine officers can be seen in the video, as an onlooker pleads 'He's just a kid!'"},{"comment_id":"512585862199466","commenter_b":"Anyone who does homework works for his or her education.","commenter_a":"The man","post_message":"Thank you to everyone who has donated to my campaign- we have raised $51,000,000.00 in the month of June-- thanks to you! Lets MAKE AMERICA SAFE AND GREAT AGAIN! You can make secure donations here: @webpagelink"},{"comment_id":"10153236165233984","commenter_b":"Someone needs to sew a ZIPPER in her face!","commenter_a":"please STOPP","post_message":"Are you kidding me lady? Stop, just stop, please.  Do you think this new mandate is completely over the line?"}]
