[{"comment_id":"10154375945924749","commenter_b":"The man is a afgan veteran , a marine and a Muslim. I am a Hindu and I know , Imran name does not exist in us.","commenter_a":"Two Muslim brought up in America one killed 50 and the other saved over seventy, both are Muslim , it is not Islam, it is the illness inside each of us.","post_message":"Imran Yousuf decided to “take a chance” and it paid off."},{"comment_id":"1049118838444933","commenter_b":"Ross I'm quiet familiar with what you and others want, but that's not the way it is,especially me. I served this country for my beliefs and I'll be damned whether people like you like my opinions or not. One day when the liberals get their way and all the refugees and ILLEGALS are let in this country then maybe you may see what I'm talking about. Either way its not my problem, I've served my time and paid a life time of taxes and still paying. No I think Ross today's society are out of touch with reality is the problem.","commenter_a":"As an older person I've come to the conclusion you can't blame these young snot nose, entitled brats. This is the environment that's been created by the liberals, so everybody can feel hunky dory.","post_message":"She probably won't be too pleased..."},{"comment_id":"10153776592904087","commenter_b":"Socialists always promote Violence. In Europe They promote Muslim Violence by being WEAK!","commenter_a":"Bernie is an enabler for the lazy self entitled youth of this country.","post_message":"\"Party leaders in Nevada...claim that the Sanders campaign has a ‘penchant for violence.' That is nonsense,\" Bernie Sanders said in a statement. \"Our campaign has held giant rallies all across this country, including in high-crime areas, and there have been zero reports of violence.\""},{"comment_id":"406947019493592","commenter_b":"Another ride, but this time take obummer out","commenter_a":"Good for them!","post_message":"Enough is enough for these bikers..."},{"comment_id":"10153085331829205","commenter_b":"she would","commenter_a":"He needs to be charged with AT LEAST manslaughter... she w","post_message":"New Sandy Bland Dash Cam Footage Released"},{"comment_id":"10154638798186336","commenter_b":"Neil Cavuto ...per this morning's discussion: people killed on the highway not same as being murdered by immigrants...who over stay, are not vetted or are illegal!! How many of the 15 9/11 killers fit these descriptions...and we sacrificed the lives of many in order to accommodate immigration. Immigration is not in the Constitution...we need strong laws, enforcement and a wall!!","commenter_a":"dead people make it a war.","post_message":"On \"FOX & Friends Weekend,\" Dr. Sebastian Gorka commented on Donald J. Trump's approach to radical Islamic terrorism."},{"comment_id":"10154316871838203","commenter_b":"@username Jesus only chose men to be Apostles - but He had many female followers. The reason that women cannot be priests is that the priest acts in the person of Christ in the Mass. If it's a woman offering the Mass the sacrifice becomes one of bride to bride - and the significance is lost. Humans are sensual creatures. God knew that; that's why He created sensual experiments (the Sacraments) as visible signs of His grace. You cannot baptize someone with motor oil because it's not a sign of cleansing. Similarly, you cannot ordain a woman. It is not possible.","commenter_a":"st paul says there is no difference between men and women now that we are in Christ Jesus. there is nothing to suggest that women cannot be ordained priests or deacons from the mouth of Jesus himself. the fact that only men were chosen by him could be due to the fact that the social fabric of his day could not tolerate or make it possible otherwise. the holy spirit will continue to guide the church according to christ's own promise. let's not bar the way forward when we see he is driving along that path. we need to go to the spirit of our faith and not be kept back by men made rules and practices. WE HAVE TO LET THE LORD SPEAK.....AND LET US BE SILENT.","post_message":"The Catholic Church can never ordain women priests, so why all the confusing signals?"}]
