[{"comment_id":"1095394503811232","commenter_b":"sounds racist to me. peggy pauley.","commenter_a":"I am so tired of people saying, we're going to take this country back, it's not been anywhere but here! Give it a break !!!!!!!!!!!","post_message":""},{"comment_id":"10154110742322439","commenter_b":"Cowards !! Stay to fight for your country !! You are Iran's puppets !!","commenter_a":"No problem. Enlist them in the French Foreign Legion - minimum 12 year enlistment; send them to Corsica for Basic and Combat training, and then deploy them to Libya to fight ISIS.","post_message":""},{"comment_id":"10154274349426051","commenter_b":"CAN I HELP AL , GET THE HELL OUT OF THE U, S, A, DUMB ASS","commenter_a":"He is ALL mouth--did anyone really think any of these ppl. were going to leave? WHO would want them?","post_message":"The Rev. Al Sharpton has finally decided if he'll leave the country now that Donald Trump is President."},{"comment_id":"10153635830302061","commenter_b":"@username Wow.....you are a wicked mean nasty woman!!!","commenter_a":"It was a great dance to encompass her whole journey on the show, but in no way does it compare to Nyle's or Paige's.","post_message":"WATCH: Ginger Zee & Valentin Chmerkovskiy's take the dance floor by storm in last night's Contemporary Dance to a cover of Coldplay's \"Adventure of a Lifetime.\" Dancing with the Stars Season Finale continues TONIGHT!"},{"comment_id":"879266582115130","commenter_b":"The Zionists regime knows only the language of the gun.","commenter_a":"What can they have to talk about ? I am a pacifist , but in this case i would urge Iran to start building nuclear weapons, or get someone to supply them immediately , then maybe the Zionists will finally show them some respect.","post_message":"The foreign ministers of Iran and the United states kick off a fresh round of talks in the Swiss city of Montreux."},{"comment_id":"644007369123175","commenter_b":"She doesn't deserve the publicity!","commenter_a":"If this is true, I'm done with McD's....","post_message":"Michelle's face is being plastered all over this fast food chain.  Disgusting. We'll never eat here again.  'LIKE' if you think this is WRONG!!!"},{"comment_id":"734144593405526","commenter_b":"Yes","commenter_a":"Yes.","post_message":""}]
