[{"comment_id":"1362078013830431","commenter_b":"Cruz....Kiss that ass.","commenter_a":"Mr. President, Please do not squander this opportunity to put a conservative in the Supreme Court. This is extremely important, we do not need someone who's going to be a straddle of the fence. We have too much anti-American government, anti-Constitution battering happening inside our nations capital and a crossed our nation, we cannot afford to make evening a half step in the wrong direction. Please Mr. President I implore you to please hear my request, my plea.","post_message":"Ted Cruz NAILS it, everyone needs to see this!"},{"comment_id":"10153259880651162","commenter_b":"I wonder what he thought was going to happen to her after he beat her w/ the hammer?","commenter_a":"Hit her in the head with a hammer and get an I bond He's the real MC. HAMMER","post_message":"HAMMER BEATING: An 87-year-old man beats wife with hammer at a hospital to avoid her surgery ..@webpagelink"},{"comment_id":"10154430974181756","commenter_b":"The world hasn't forgotten.","commenter_a":"It's sad that it happened 2 years ago yet the world forgot them and nothing has been done to end the ordeal. Smh","post_message":"The young woman reportedly said some of abductees have died but many remain alive in Boko Haram captivity.   The mass abduction in April 2014 sparked worldwide outrage."},{"comment_id":"10153188400962894","commenter_b":"@username pediatricians have long ago said this is unsafe for children. Their immune systems cannot fight off adult germs. I am sure you want to keep your niece safe, right?","commenter_a":"North West is really cute. Kim should probably stopped letting Khloe kiss her baby in the mouth tho","post_message":"Kim Kardashian Shares Adorable New Photo Of North West With Her Curly Hair"},{"comment_id":"10154177327588984","commenter_b":"Don't want her anywhere near the White House.","commenter_a":"Lies more lies everytime she opens her corrupted mouth","post_message":"Hillary's campaign is once again doing damage control...  Is Hillary Clinton one of the last people you'd want to become president?"},{"comment_id":"1560631690895039","commenter_b":"Good for his ASS. I hope they rape him in prison nite and day. Carma is a BITCH lol","commenter_a":"the sentence is more lenient than what he deserves","post_message":"There is no punishment severe enough for these heinous crimes."},{"comment_id":"10156283880180354","commenter_b":"You illegals violated are rights to deport you if you are here illegally","commenter_a":"Good for Texas.","post_message":"“Today’s ruling is an important first step in insuring the integrity of birth certificates and personal identity information.\""}]
