[{"comment_id":"10152882647786234","commenter_b":"Hypocrite. ^^^ She let 4 Americans die. You dummy.","commenter_a":"Christie goin down. I always said he would.","post_message":"David Wildstein admitted to conspiring with others to \"punish\" the Fort Lee mayor for not endorsing Governor Chris Christie in his re-election bid."},{"comment_id":"10153900801473445","commenter_b":"Never mind I've heard it only the oil and certain illness so it's shit like Ga.","commenter_a":"@username get you a card!","post_message":"Big News! Ohio Becomes the 26th State to Legalize Medical Marijuana"},{"comment_id":"959009797494471","commenter_b":"Any politician that don't one our soldiers to be armed there traitor to our country","commenter_a":"I can see maybe arming an NCO or someone at a recruiting station as a deterrent against the crazies out there.","post_message":"NO CHANGE IN POLICY: Army chief urges caution on calls to arm more US soldiers in wake of fatal shooting (VIDEO)  @webpagelink"},{"comment_id":"10154226374872894","commenter_b":"Kim better stop bcuz money can dry up. At the rate that she is spending it.","commenter_a":"...but Andy Cohen has had work done himself so what's his point??? *sips Brandy and Eggnog*","post_message":"Andy Cohen Grills Kim Zolciak About Plastic Surgery: Sweetie, You Need to Stop (Video)"},{"comment_id":"10153199034456051","commenter_b":"To whom are you directing the \"Lazy whore\" term, Chieng Yang? Just wondering. ..I think that kind of name calling is unnecessary and unproductive.","commenter_a":"Hey lopsided breast implants are her punishment...","post_message":"This woman says she really doesn't care if anyone is offended by her photos - they're staying up."},{"comment_id":"10154690577255329","commenter_b":"Yeah, like. Hey white girls: YOU ARE FREAKING EVERYWHERE. Chill.","commenter_a":"Please don't come on here saying white girl magic and all prom dresses are beautiful cause i swear to god.","post_message":"#BlackGirlMagic is real."},{"comment_id":"624034747748270","commenter_b":"GO Hillary!","commenter_a":"I'm a republican but I'm pretty sure Hillary just earned my vote on the fact that Ted dropped out. Trump is a no go for sure!","post_message":"Donald J. Trump is the presumptive Republican nominee. Chip in now if you agree we can't let him become president: hrc.io/1SL1LgJ"}]
