[{"comment_id":"1038035722930072","commenter_b":"For all you little girls out there here is your biology 101","commenter_a":"Al u people that stand with planned parenthood are just as disgusting as they are., hope your babies don't get ripped apart limb from limb you sick bastards","post_message":"#BREAKING: \"Planned Parenthood & our CA affiliates today filed a lawsuit against the people behind [the] widely discredited video smear campaign,\" tweeted Planned Parenthood president Cecile Richards."},{"comment_id":"1190463677676992","commenter_b":"Immigration laws are not being in forest because it only applies to legals and not illegals. It's time to make stronger laws and strongly in force them. Also illegals shouldn't be given drivers licenses or any form of ID until they become American citizens.","commenter_a":"The way I see it is this, if people come here and they are illegals SEND THEM BACK TO WHERE EVER IT WAS THAT THEY CAME FROM, the next step is build a wall that's high enough with barbwire around it so they can't try anything","post_message":"Do you agree?"},{"comment_id":"1799477110270557","commenter_b":"IF CROOKED CLINTON GETS IN, IT WILL BE THE END OF AMERICA AS WE KNOW HER. GOD HELP Donald J. Trump WIN.","commenter_a":"Of course Donald Trump is low in the polls if that's all your polling are Democrats hello","post_message":"\"I think, frankly, he's going to end up beating Hillary by a surprising margin.\"  On Fox & Friends, Newt Gingrich touted Donald J. Trump's \"two historic speeches\" this week."},{"comment_id":"10152961247876680","commenter_b":"That's you and your crowd... Dead and cut up babies sold for the meat market !","commenter_a":"I proudly stand with Planned Parenthood.","post_message":"The move dramatically increases the chances of a government shutdown fight in the fall."},{"comment_id":"457420381115209","commenter_b":"NO Never they Are NOT The Only Ones With Slavery in their History/Background Stop the Hate All People in JESUS NAME Ps139 Amen","commenter_a":"Hell no","post_message":"Should Blacks Be Compensated For Slavery?  Comment 'yes' or 'no'."},{"comment_id":"1306220052736740","commenter_b":"Trump has everything a person could want so he just wants to pay American back!! Hilary tried to steal furniture from the white house the first time around","commenter_a":"Hillary should be in prison! Treason and lying are her crimes. Benghazi will never be forgotten as she turned a deaf ear to our own and did absolutely nothing! Trump in 2016! 🇺🇸🇺🇸🇺🇸","post_message":"As of now, Donald Trump and Hillary Clinton appear headed for a showdown in November. Who gets your vote in this matchup: Trump or Clinton?  LIKE Opposing Views for more breaking news and analysis!"},{"comment_id":"1397241813633169","commenter_b":"Shirley, this is the best comment I have read all morning. Thanks!","commenter_a":"That's why Christians should read Gods Word and trust the Lord and stop running around for a word . The Bible is Gods Word And you can get a Word from the Lord every day if you read it and Stay under your Paster if he is preaching the Gospel Of Jesus Christ","post_message":""}]
