[{"comment_id":"10153169080361336","commenter_b":"What's up with that first woman who RAN in the other direction? Nice.","commenter_a":"They only pitch in to help the fallen man and good Samaritan after RUNNING AWAY FIRST!","post_message":"The 28-year-old hero leaped on to the tracks to save the man from getting hit by a train and other commuters helped to pull them both to safety."},{"comment_id":"1004595529587074","commenter_b":"Show me where I said that Jeep!! Assume much?? Many woman have had very easy deliveries and others more difficult. You cannot predict which way it will go. HOWEVER, every successful abortion kills a new human.","commenter_a":"Choose Love, Choose Life! All human beings deserve a chance at life. If you agree with saving trees or animals but, not human beings you are an idiot.","post_message":"Every life is a blessing!"},{"comment_id":"10153792604111746","commenter_b":"Two fools!","commenter_a":"Not at all. I love them both and i hope they are the host on 10/19 which is my Birthday.","post_message":"People on both sides of the aisle thought the two were biased."},{"comment_id":"10154105448940950","commenter_b":"@username So many foaming at the mouth racists until he will need them. He will need them in heaven.","commenter_a":"This \"news\" is like a week old. Why do I care if she wants her son to finish school with his classmates this year? Most parents would do the same.","post_message":"Melania and Barron Trump plan to remain in New York City until at least the end of the school year."},{"comment_id":"1382199778464035","commenter_b":"Your a bitch","commenter_a":"I'm sure the First Sasquatch offered so much advice, what did she do...come to the defense of her brother Harambe?","post_message":"First Lady Obama took apart Trump, and just gave Republicans even more to worry about."},{"comment_id":"698707680267099","commenter_b":"@username ....and dumbasses vote for Hillary","commenter_a":"Liars will always call other people liars to hide the fact they are liars....haha. Seriously, he is a POS and he is nothing but a racist, a liar, a cheat, a thief, and I could go on. He is a danger to America....and if he can't run his casinos, his own campaign, think about what he will do to America. He will run it into the ground. It is pretty scary to think if he gets in the Whitehouse, he will insult other countries, and possibly be the first president to incite a war because of his mouth.","post_message":"\"Hillary Clinton  may be the most corrupt person ever to seek the presidency of the United States,\" Donald J. Trump  said."},{"comment_id":"10154691366756130","commenter_b":"She should be ashamed of herself!","commenter_a":"Funny and sadly accurate","post_message":"She got answers all right."}]
