[{"comment_id":"10155909073040354","commenter_b":"Yea I've been seeing her dumb ass everywhere lately","commenter_a":"Mike Romano this woman is crazy.","post_message":"SHOCK! Nancy Pelosi backs Planned Parenthood."},{"comment_id":"10153838476451509","commenter_b":"We \"poor people\" are richer than she'll ever be. Shallow, vapid tart.","commenter_a":"Grande opening, Grande closing. Hopefully her career.","post_message":"Security footage showed singer Grande appearing to \"maliciously lick\" a donut in a shop: @webpagelink"},{"comment_id":"10152763067471051","commenter_b":"Let that bitch rot.","commenter_a":"So @username all she has to do is profess her love for Jesus and all is forgiven. Huh......smh","post_message":"When her fiance broke up with her, this woman decided to make his 3-year-old daughter pay."},{"comment_id":"10155184641741509","commenter_b":"They wanted that sweet Brazilian booty","commenter_a":"I really think these dudes were out looking for mad hookers and they got robbed because of it LMFAO!!!!","post_message":"JUST IN: US swimmers Jack Conger and Gunnar Bentz were removed from their flight from Rio de Janeiro to the United States by Brazilian authorities, US Olympic Committee spokesman Patrick Sandusky told CNN Sports contributor Christine Brennan. Earlier this week, the two swimmers were with teammates Ryan Lochte and James Feigen, who are wanted for questioning by Brazilian police after questions were raised over their accounts of being robbed."},{"comment_id":"805710002902059","commenter_b":"But no one will ever do anything. She is above the law","commenter_a":"My biggest problem with Hillary Clinton is the fact that she condones an abortion minutes prior to birth, leaking national security time limits during a nationally televised presidential debate. She has been held non-accountable for any of her mischievous, murdering, actions. If she gets in she will be following Obama's legacy, and our country is doomed","post_message":"ARREST!"},{"comment_id":"10153326495519714","commenter_b":"Yeah a little weird but seriously.\"omg he got a picture of my butt.\" so what?","commenter_a":"If I were the girl in the picture, I'd send a thank you to him for making my derriere famous. We should embrace curves! I'm sure he's just goofing around. People need to stop being so sensitive.","post_message":"Do you think Michael Bublé crossed the line with this Instagram post?"},{"comment_id":"1622307121406726","commenter_b":"Jeff the Killer","commenter_a":"Kevin Mccaston this is another reason I won't move to Florida lol","post_message":"\"I now have an alligator in my sewer.\" #FloridaProblems  @webpagelink"}]
