[{"comment_id":"10153709197621336","commenter_b":"Was he having a stroke?","commenter_a":"Billynyvy Martinez","post_message":"WATCH: One Southwest Airlines employee could barely get through his safety spiel without nodding off and slurring his words."},{"comment_id":"10153660533997235","commenter_b":"She'll be fired for feminist ideology being expressed at FOX on air.","commenter_a":"Why is that \"news\"?","post_message":"In a rare lucid moment, Fox News' Andrea Tantaros NAILS IT."},{"comment_id":"1055171694505347","commenter_b":"If that woman is not tortured in hell eternally, then God does not exist... and let me TELL YOU something. He does.","commenter_a":"Where is Russia's outrage? Where is this woman now?","post_message":"Horror in Moscow: Woman in burka walks streets carrying child's severed head..."},{"comment_id":"1107032922700941","commenter_b":"Kyle Broussard","commenter_a":"That should be an Olympic sport!","post_message":"This guy has some skills.  (Via JukinVideo)"},{"comment_id":"10157633958190389","commenter_b":"@username IDIOT.","commenter_a":"I'm voting Donald Trump and I will not let the media influence me. Yes he has made some clear mistakes in his campaign with \"words\" but, Secretary Clinton has made clear mistakes multiple times with ACTIONS. She's a politician, getting paid by Saudi, Benghazi, getting paid to speak, email server, the list goes on. BUT, Trump showed more heart last night then any candidate I have seen; not because he wants power but because he cares for you & me. After seeing Lester Holt TRY to demolish trump, it did hit me, that the media does have power, and will do anything it takes to get what they want.","post_message":""},{"comment_id":"10153034761287235","commenter_b":"you learn to write, bitch...","commenter_a":"oh boo hoo it's fucking war get a life moron","post_message":"“My uncle killed by sniper in WW2. We were taught snipers were cowards. Will shoot u in the back. Snipers aren’t heroes. And invaders r worse.” -- Michael Moore"},{"comment_id":"10154355731201051","commenter_b":"stupid bitch.","commenter_a":"it doesn't matter what trumpie ever says His repugnant followers don't care about anything even if it affects them They lost out on the education they sorely needed..and they will never complain because they are too dumb to know it","post_message":"Actor Tom Arnold says he has secret recordings of Donald Trump doing something so bad that it could change everything."}]
