[{"comment_id":"793004177467954","commenter_b":"cuck","commenter_a":"Go take some selfies Obama you fucking disgrace","post_message":"Obama is a _______________."},{"comment_id":"10153440650715329","commenter_b":"What the fuck? Did you just call yourself a whore?","commenter_a":"This chick needs to get over herself. My mother was a lathe oporater at a pipe yard in the 70's and never whined about the way she was treated. Obviously this girl ain't from Texas. Suck it up buttercup.","post_message":"preach"},{"comment_id":"10154633798866729","commenter_b":"Jamie i am totally sober at all times Jamie…..maybe you are on drugs for believing she is not an Evil Satanic Whore who laughs at Raped 12 year old Girls when she knowingly defends their guilty Rapist ?","commenter_a":"Many in the FBI still do love this country very much and are NOT blind followers of Obama and his Anti American Commie nonsense….it would be a good tactical move to wait till Hillary is nominated as the \"Head Liberal Witch\" before they Arrest her and burn her at the Stake ( like we are all praying) happens on live TV so we can rub one out while watching her salty tears run down her Reptillian Alien face.","post_message":"Finally, the end may be near..."},{"comment_id":"649308955259683","commenter_b":"Stfu you stupid bitch.","commenter_a":"Gifts from the illegals","post_message":"A new disease is spreading like wildfire, doctors calling it the new aids.  Share this with your friends and family.  Have you seen these symptoms?"},{"comment_id":"1384744278251983","commenter_b":"I blame Obama, Jackson, Sharpton, Pelosi ...................","commenter_a":"Maryliz T. Curtis","post_message":"'It's a kind of anti-black mood'"},{"comment_id":"10154097655775736","commenter_b":"Threatening our non violent non threatening neighbors with war just because why not! Grounds for immediate impeachment!","commenter_a":"And there's no bad hombres up here?","post_message":"\"You have a bunch of bad hombres down there,\" Trump told Mexican President Enrique Pena Nieto, according to the excerpt seen by the Associated Press. \"You aren't doing enough to stop them. I think your military is scared. Our military isn't, so I just might send them down to take care of it.\""},{"comment_id":"1045198175503230","commenter_b":"BS, keep our money home to help Americans who need it.","commenter_a":"What the??","post_message":"Obama pledged millions of dollars to fight climate change abroad.  And it comes straight from YOUR pocket!"}]
