[{"comment_id":"10154300951236519","commenter_b":"But Hillary lost. There will be no Gulag.","commenter_a":"Boy, at least He can feel like he has clean hands as we are all marched into the Gulag. Very comforting.","post_message":"One elector defected so far, but not from Donald Trump."},{"comment_id":"10153911212003984","commenter_b":"Go Candance!!! Who is the woman on the right with the white duck on her head???","commenter_a":"I support Candace 100% God bless you","post_message":"I have to give major credit to Candace Cameron Bure. It can't be easy to be surrounded by the liberals of \"The View\" and stick to your guns like this. She sure got them riled up, and I could watch it over and over again!  Do you agree with Candace Cameron Bure?"},{"comment_id":"1237593022967110","commenter_b":"@username Because God made her a woman, SHE chose to be a sinner!","commenter_a":"Mormons are a religious cult not Christian in any shape or form. The only way that woman will ever change will be by the power of the Lord Jesus Christ and him alone.","post_message":"Beaten and made to carry bags of rocks for 18 hours a day"},{"comment_id":"816614281820679","commenter_b":"You have got to be kidding 49. Unbelievable! Evil surely takes its toll. She looks horrible. I am older than her!","commenter_a":"Can you believe the skanky crack whore, also known as KellyAnne Conway, is only 49? She looks like she is late 60's or early 70's... This is the toll that selling your soul to the devil will take on you!","post_message":"She did sell her soul to the Devil, after all."},{"comment_id":"1516900544996637","commenter_b":"And crooked lying hellary deleted 33,000 incriminating emails. That's why 5 people were given immunity so they wouldn't be prosecuted. Now why would they need that??? Here's the definition of immunity: Law. exemption from criminal prosecution or legal liability or punishment on certain conditions. Did hellary ever find the 6 billion $$$ that has been missing while she was SOS??? It's most likely in the clintons Swiss bank account! Wake up liberals!!! @webpagelink","commenter_a":"Trump is nothing but a CRIMINAL.. A FRAUD... CON ARTIST.","post_message":"City of Phoenix to Trump: Our cops didn't endorse you."},{"comment_id":"946732062040088","commenter_b":"Right. Because all those women raped enjoyed it. *eyeroll*","commenter_a":"If you don't want to get pregnant that is a choice. If you don't want to get pregnant, don't have sexual intercourse. There's other ways to find physical satisfaction than sexual intercourse & they won't create a baby. Abortion IS NOT a means of birth control. It's murder. For those who are for abortion as a woman's choice, what about the choice of all of those female babies that have been aborted?","post_message":"So true."},{"comment_id":"504839586342663","commenter_b":"You slimy cocksucker","commenter_a":"The poor need to try harder","post_message":"\"We are the first generation in human history that can end extreme poverty.\""}]
