[{"comment_id":"595817020606725","commenter_b":"Excellent point!","commenter_a":"If the Hillary Clinton fans were so well-educated, then tell me why they are turning out in Mass numbers to destroy property, assault their fellow Americans, and anyone who doesn't share their beliefs. My guess is that most of these people don't work and probably didn't even vote. If that's your following Hillary, I am so so very glad that you lost.","post_message":"I believe Spiderman once said that a “tree is known by it’s fruit” and “wisdom is vindicated by it’s children.”  No, wait… that wasn’t Spiderman. It was Jesus."},{"comment_id":"10155201433711320","commenter_b":"There's no Native American blacks and Latinos in Eastern Europe. The perfect place for RACIST AMERIKKKA","commenter_a":"Yeah the country is being lead by white supremacy you people find this okay?? oh wait a minute...This is RACIST AMERIKKKA. WHAT more can you expect.","post_message":"This is a live look at Washington, D.C.  Are you pleased with what our nation's leadership is doing right now?"},{"comment_id":"1602419506718167","commenter_b":"Ah yes blame everything on women. Typical","commenter_a":"Maybe because women control everything and dont put out these days unless you're a fucking broke ass bum loser with no future","post_message":"So higher house prices, higher tax, higher tuition AND less sex??"},{"comment_id":"1069087446447636","commenter_b":"Put her on the street .","commenter_a":"She looks flashy","post_message":"The liberal media loved Michelle Obama's tang SOTU dress.  Take a guess at how much it cost."},{"comment_id":"1503406889676883","commenter_b":"Are people really this stupid its kinda hard to belive","commenter_a":"She certainly has enablers on her death wish trip. Medical bills should be paid by her.","post_message":"Do you agree our tax dollars should NEVER be used on any of her medical bills? This is unreal!"},{"comment_id":"1077236902352732","commenter_b":"Ya \" maybe in Florida . You know were the Zika mosquitos were found!!!","commenter_a":"Yeah...but nevermind when democrats block Zika funding. @webpagelink","post_message":"How do they sleep at night?  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152564279192623","commenter_b":"Notice everytime it moves up and down is when she brakes. It falls forward when she brakes. And honestly this woman in the front car has been a menace for a while now! It's about time someone got proof of her ridiculousness.","commenter_a":"the cops were called. she started in back of driver redneck lady tried to run lady and child off road first time. and slowed down to let the other in front. the phone was in a dashboard holder while taping driver not holding phone.","post_message":"WATCH: Road rage out of Randleman.   Just tilt you head and wait until about the 3-minute mark.  Egads.  Warning: Language and gestures may be offensive to some."}]
