[{"comment_id":"1554113821370873","commenter_b":"What an ASS!","commenter_a":"Now we see how close he is to that N word, he will before to long.","post_message":"Speechless."},{"comment_id":"10153992023378145","commenter_b":"@username I agree completely!!","commenter_a":"Well, what do people expect when you're in their habitat take awake their habitats?","post_message":"Amazing Rescue: The mom started wrestling with the animal when she saw that her son's entire head was in the mountain lion's mouth."},{"comment_id":"1729114903976145","commenter_b":"Every country in the world should sink down these illegal Chinese fishing vessels wherever they are out of their rightful jurisdiction or territorial waters.They are becoming nuisance to every country's territorial water.","commenter_a":"GOOD, THEY ABUSING ALL THE COUNTRIES TERRITORY AND NOT RESPECTING THEM, THEY THINK THEY CAN JUST COME AND TAKE ANYTHING, LIKE WHAT THEY ARE DOING IN THE PHILIPPINES AND NEIGHBORING COUNTRIES.","post_message":"The Argentine coast guard says it chased, opened fire on and eventually sank the Chinese vessel."},{"comment_id":"1830025417217655","commenter_b":"Maybe he was looking at her pussy to grab it.","commenter_a":"Maybe he needed help figuring out how to fill out the ballot","post_message":"LOL!  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154481500504199","commenter_b":"Your mom is overrated. #yesidoknow","commenter_a":"Overrated.","post_message":"Sorry, but we have to ask...  Who's planning on seeing Star Wars: The Force Awakens?! [via.q13fox.com/Iat0q]  Photo manipulation by Mara Leite Photography"},{"comment_id":"894010200634440","commenter_b":"I'll call him a she once he's a female according to the dictionary.","commenter_a":"Caitlyn Jenner's award acceptance speech. Uplifting, heartfelt, inspiring... Courage, intelligence, compassion, awareness, education... Caitlyn pointed out many of the crucial life and death issues facing trans folks nationally and globally. She made an impassioned plea for acceptance and respect for all of humanity and the trans community in particular. For such a new figure in the global trans community, she did an excellent job at getting the truth across. Her speech had me in tears early on and particularly when she addressed her family and her mom. Something additional: twenty percent of transgender people have served in the military, which is double the percentage of the U.S. general population that has served. Close to 16,000 trans folks are currently serving in the U.S. military. Close to 135,000 trans Veterans have served.","post_message":"\"Oh you know, just in the kitchen by myself crying because of Caitlyn Jenner's ESPYs speech.\""},{"comment_id":"957903450911743","commenter_b":"Muslims are still using the jiihad to increase their power and stupid European leaders are letting it happen.","commenter_a":"LanceBell fox loves you","post_message":"Spread this everywhere:"}]
