[{"comment_id":"10153666636726336","commenter_b":"Karen,all illegal immigrants that have committed crimes are to be deported.Whatever that cost we will pay,and happily.Maybe we should take away all the taxpayers dollars we send to all SANCTUARY CITIES! Illegals cost us in a lot of ways.Tax the hell out of anything coming fro Mexico!Fine every employer that hire a illegal immigrants,$20,000 per illegal! There is many ways. You aren't suggesting that we do nothing I hope ILLEGAL IMMIGRATION is really a costly thing for America.They are welcome to apply for CITIZENSHIP or get a legal VISA. No other country does immigration this stupidity why should we. Have a good afternoon Karen,I just looked and saw you husband is from Mexico and so you probably have strong feelings about this.Please just gain citizenship and if you are a citizen,WHO in the world wants to pay for someone who broke the law and cost US a lot .good day","commenter_a":"Don't worry the 30 year old driver will go to Jail and the illegal will be allowed to stay and become a voter.","post_message":"Border Patrol officers near San Diego noticed that the driver, a U.S. citizen, was acting weird, so they used imaging technology to inspect the car."},{"comment_id":"10153953305054170","commenter_b":"It's really too bad the 'Pinoccio' factor isn't for real, Hillary would have four foot nose by now to go with her bulging eyes! Having made statements in front of people and then denying it, shows that she that she thinks we're all stupid! Well the jokes on you Hillary 'Rotten' Clinton, you're the 'Poster Child' for stupid! Careful what you say 'Hill' people around you do have a memory!","commenter_a":"Nothing has \"doomed\" her yet, doubt this will...","post_message":"Hillary definitively busted in another lie, by the father of one of the Benghazi victims. The media will try their best to ignore this so we're going to have to do their jobs for them."},{"comment_id":"1033684776642992","commenter_b":"Really???? No more than white folks killing each other!!! Racist azzes!!!","commenter_a":"where is black lives matter now?","post_message":"A deadly weekend"},{"comment_id":"10152878429492690","commenter_b":"Pothead thinking= had she been toking a doobie she would have been mellowed and not been on the pump jack. But then her parent or adult supervision may have been smoking one and thought it was funny.","commenter_a":"Hemp > crude","post_message":"Authorities say an 11-year-old Texas girl has died after falling from an oil field pump jack over the weekend. @webpagelink"},{"comment_id":"836575966473062","commenter_b":"Crooked Hillary is the scum of the Earth","commenter_a":"His campaign is a trainwreck.","post_message":"Meet Trump's new campaign chief: a man whose \"news\" organization, Breitbart, is known for its racist, homophobic, conspiracy-peddling stories."},{"comment_id":"1198210753566421","commenter_b":"She's a hack","commenter_a":"This isn't right. What is wrong with her?","post_message":"CNN HOST To Jill Stein: \"Have You Seen Any Direct Evidence That Anyone Hacked The Voting Systems In MI, WI And PA?\"...\"Um...no\" [VIDEO]   And then there's that whole issue with one of the states that only uses paper ballots...."},{"comment_id":"10153122322244705","commenter_b":"Rehan Perera Damith Wickramarathne","commenter_a":"It never looked black! Blue n Brown. On the right it's got black with blue.","post_message":"And there you have it, folks!"}]
