[{"comment_id":"1136613006364478","commenter_b":"He told that woman to \"GO AND SIN NO MORE,\" @username. Jesus calls even a single divorce for ANY reason one thing: \"... ADULTERY!\" ~ JESUS \"THOU SHALT NOT COMMIT ADULTERY!\" ~ GOD \"JUDGE YE RIGHTEOUSLY!\" ~ GOD ~ JESUS","commenter_a":"Mark 10:10-12 In the house the disciples began questioning Him about this again. And He *said to them, “Whoever divorces his wife and marries another woman commits adultery against her; and if she herself divorces her husband and marries another man, she is committing adultery.”","post_message":""},{"comment_id":"1308080519212956","commenter_b":"What's up with all this refugee hate going around? \"They're brown and muslim!! I hate em! They're animals! MURICA!!\"","commenter_a":"Until the refugees find it and start using it as there public restroom","post_message":""},{"comment_id":"800418456754419","commenter_b":"She shd be in jail","commenter_a":"Nobody in the GOP can't come to Hillary's standards, there is no comparison.. She is one smart and prepared capable Madam President!","post_message":"The #GOPDebate may have ended, but CNN’s Chris Moody is live, taking your questions from the post-debate spin room in Miami."},{"comment_id":"657506131049235","commenter_b":"Hope she's being watched closely. It's a good bet she's surrounded by other like-minded people. It's women like her that become human bombs.","commenter_a":"Send her home","post_message":"What the mother of the Boston Bomber said after he got the death sentence is SICKENING!"},{"comment_id":"367420580112903","commenter_b":"Rot in Hell B#$%H !","commenter_a":"Good for him !!!!","post_message":"INSTANT Justice: Judge: \"I Hope You Die in Prison!\"  Watch the video!"},{"comment_id":"1548076978821767","commenter_b":"@username Illegals are already criminals by definition.","commenter_a":"These liberal are making more and more people want to vote for Trump.","post_message":"Top progressives are terrified the Democrat mob attacks on Americans will send millions of voters running to Trump."},{"comment_id":"1199159113429677","commenter_b":"Pay for your own abortions, which you can find probably within a couple of miles of your campus. Grow up, get a job and don't bother adults.","commenter_a":"Keep your legs together and study.","post_message":" who are condemning my bill because it is   having the right to live a healthy life is NOT immoral and every student should have access to safe and accessible abortions especially because being a student at Cal is already so demanding. [] This is a womxn [sic] issue, a students issue, and a humxn [sic] issue. If you do not support abortions, don get one."}]
