[{"comment_id":"10155549473141729","commenter_b":"She's a deranged scumbag","commenter_a":"You have to feel for this poor delusional \"woman\". Her whole way of life is disintegrating & she needs to complain as loudly as possible so people actually hear her. Soon her dementia will kick in full blast & she will be confined to a nursing home. I can only hope she doesn't suffer. It's just too bad her legacy will be one of HATE & DIVISION !!!","post_message":"Whadd'ya think?"},{"comment_id":"10153171186966051","commenter_b":"stand your ground. no to muslims","commenter_a":"I would say no no no","post_message":"The people in this town are prepared to do whatever it takes to keep a Muslim cemetery out. In fact, they have one very specific idea in mind."},{"comment_id":"10154136361277293","commenter_b":"@username Oh! Just saw the guns!!!! You can live in your own basket. Would not want you as my neighbor. I'll live near a refugee.","commenter_a":"All these \"deplorable\" comments make me truly ashamed of my fellow Americans. SMDH at all the lies, irrational hate and fear mongering.","post_message":"Kerry told lawmakers \"that if it is possible to do more\" in terms of accepting refugees, \"we would.\""},{"comment_id":"367783356938627","commenter_b":"McDonald's drive thru but taco bell taco...hmmm🤔","commenter_a":"China Navarro Faviola Quiralte @username Natalie King","post_message":"Gotta be more specific  #WSHH"},{"comment_id":"1030788763705100","commenter_b":"Yup, start by getting rid of his useless ass.","commenter_a":"Asshole","post_message":"President Obama talks about the urgency of Climate change, saying \"We've proven that the choice between our environment, our economy, and our health is a false one. We've got to strengthen all of them together.\" What do you think?"},{"comment_id":"10153464723413734","commenter_b":"Take that child away from these monsters! Do NOT allow him back in that \"home\"!","commenter_a":"That's the kind of monster that deserves the death penalty.","post_message":"#BREAKING news out of Maryland.  The mom's boyfriend has reportedly been charged.  More details as they become available."},{"comment_id":"10152719503449117","commenter_b":"Don't these pigs have any REAL criminals to hunt down???","commenter_a":"Boy that's a basket of snarls","post_message":"Why the sex lives of teens should be subject to school discipline is suspect enough, but it's extra perplexing what interest the government has in such matters."}]
