[{"comment_id":"10153429629189087","commenter_b":"Deport all illegals","commenter_a":"California...the Land of fruits and nuts...and illegals...and terrorists","post_message":"\"America is great. Trump is disgusting. Anybody but Trump,\" read words dotted across the sky above the annual Rose Parade in California on Friday."},{"comment_id":"831331320235298","commenter_b":"Go back to Italy ya wop","commenter_a":"Reveal his name.","post_message":"A soon-to-be police officer just posted this comment publicly to our page. Is this a thinly disguised threat of violence against citizens? Doesn't sound like this guy should be allowed to roam the streets with a loaded gun in the near future."},{"comment_id":"10150759349264950","commenter_b":"Bam","commenter_a":"Are they going to address the facts that trump is pushing his daughter merchandise?","post_message":"WATCH LIVE: White House press secretary Sean Spicer takes questions from the press."},{"comment_id":"10153186263669411","commenter_b":"And what happens when two monsters get together? another monster!!","commenter_a":"ha ha ha America is a father England is a mother isis is a child isreal is a nanny","post_message":""},{"comment_id":"491174087737551","commenter_b":"Muslims offend me. Ban them from the U.S.","commenter_a":"BS!","post_message":"Muslims Want to Change Our Nation and Obama is letting them..."},{"comment_id":"1791155854463672","commenter_b":"We ARE heading to this disaster because we still hold on to capitalism and free market","commenter_a":"Bobby Schar","post_message":"Thanks for that Brian ..."},{"comment_id":"1182572491799444","commenter_b":"Mj we are talking about the ones that come here and are here illegally. You became a marine and I bet you did it the right way. Now we have a big problem with terrorist that are sneaking into all the countries. Sorry but we have to take care of all Americans first. You have to admit a country can only hold so many. Thank you for your service I am a vet myself so are my son and daughter.","commenter_a":"All these racist comments and generalizations. You should all be ashamed. I am cuban and came to the US. Im sure not many of you can say the same but i actually benefitted from government programs. I served our countries military as a marine, i hold three different degrees - accounting, finance and im a registered nurse- sonif an immigrant is taking your jobs then you didnt take full advantage of what the US has to offer, no just arrived unprepared laborer will ever take any of thoae jobs from me. I love thia country but i hate people like you that put down immigranta that only want to make a better life for themselves and family. You are whats wrong with the US today!","post_message":"Right?"}]
