[{"comment_id":"10152884498052293","commenter_b":"not really","commenter_a":"This is the internet they cant ban anything.","post_message":"Sad Keanu? Nope. And sad Putin? Absolutely not."},{"comment_id":"10154525583946336","commenter_b":"Another red herring, Republicans? We've had enough of your endless investigations that amount to NOTHING.","commenter_a":"I'm sorry to say that she could murder a nun on 5th ave. and nothing would happen ...... Why?","post_message":"\"She did it for greed and for power and for the almighty dollar.\"  In her Opening Statement last night, Judge Jeanine Pirro said it's now clear that Hillary Clinton used a private email server to \"hide her shady Clinton Foundation dealings.\" @webpagelink"},{"comment_id":"10153600253057431","commenter_b":"Well stated @username. Irony received. 😉","commenter_a":"White supremacist exist whether as paramilitary, or the idiotic Trump supporter who thinks he owns everything and everybody telling a Hispanic American (Jorge Ramos) to go back where he came from, to people who will destroy other cultures way of life for a dollar because they have no respect for others. They are so pervasive the only way to resist them is for people of color to band together. To pretend white supremacist don't exist or that they will magically disappear is to ensure their continued control over our lives. Working together to overcome an evil is not anti-American, it's just common sense.","post_message":"Fighting White Supremacists: Don't Forget, We Are In It Together!  @webpagelink"},{"comment_id":"10153840702631955","commenter_b":"No no, that's Bernie. Hillary is just a straight up thieving murderous cunt.","commenter_a":"And to think that there are idiots who say that she's a communist or a Marxist. What morons. After she gets so much $$ like Ted Cruz from Goldman Sachs","post_message":"HRC wore yellow debate jacket when meeting GOLDMAN SACHS CEO..."},{"comment_id":"825435090838373","commenter_b":"Low life piece of craps lock her away and throw away the key.","commenter_a":"Sick sick sick! Just beat her senseless for this. That poor innocent little girl. Hopes she rots in hell!","post_message":"This woman allegedly faked cancer to cover up a horrific crime:"},{"comment_id":"10153936928466130","commenter_b":"Tell his ex wife that. She's the one plastering the photos to every tabloid she can find.","commenter_a":"This is so incredibly none of anyones business--","post_message":"Amber Heard claims she’s the victim of repeated incidences of domestic violence."},{"comment_id":"10153294543663701","commenter_b":"Lets here the song about an old woman molesting you when you were a kid.. LMAO!","commenter_a":"@username :)","post_message":"Garth Brooks rocked the Rose City on Sunday! If you missed out, the Moda Center just announced that limited tickets are available for his three remaining Portland performances."}]
