[{"comment_id":"920220598016177","commenter_b":"This is bull crap. The people who were slaves and all of their children are dead and gone. The country should have done more back in the 1860's and 1870's. That is when reparations should have been.","commenter_a":"Someone send this pandering jack wagon home please. He has done nothing but side with hate and strife, and stir the pot of social discord continually. Not a leader by any standard. Socialist poster child at best.","post_message":"What do you think of this?"},{"comment_id":"967437919978383","commenter_b":"Bruce, you're just doing way to much now....you've had your 'fun' trying to outdue the Tupperware Girls and all, but this is enough now","commenter_a":"Ratings dropped.","post_message":"In one tweet, it seems Caitlyn Jenner's political support may have shifted."},{"comment_id":"10153680219934641","commenter_b":"Problem solved!","commenter_a":"I'd still like to know why they need to come HERE? It would be cheaper and safer to house and secure them over THERE. The need to vet them would be nearly eliminated, language issues would be non-existent, violence and criminal acts would be lessened, etc. We can't adequately provide for our nations homeless population as it is. We're going to bring in 10's of thousands of them from another country and shelter THEM, but leave our own (many of whom are veterans) out in the cold? (literally)","post_message":"\"If there's a rabid dog running around in your neighborhood, you're probably not going to assume something good about that dog,\" Dr. Ben Carson said Thursday, speaking about refugees. @webpagelink"},{"comment_id":"498132093702004","commenter_b":"Simone de Beauvoir said women were their own worst enemies.","commenter_a":"Callous treatment of human life?? Funny coming from a woman who tried with all her power to block her own residents from receiving healthcare under ObamaCare!!","post_message":"Not cool Gov. Haley!"},{"comment_id":"10154414118997042","commenter_b":"Exactly, she's just a trophy Wife to Donald anyway.","commenter_a":"Mealania Trump's If she only had a brain","post_message":"Melania Trump is being accused of plagiarizing from Michelle Obama's 2008 Democratic National Convention speech.   Judge it for yourself:"},{"comment_id":"689708227853298","commenter_b":"Evidently the back of your father's hand never helped you because you're still talking crap go home Joe go home","commenter_a":"Hypocritical scum. \"This is a Big f---ing deal\". Didn't you say that?","post_message":"Vice President Joe Biden: Donald J. Trump's language would have gotten me \"the back of my father's hand\" abcn.ws/2fOBDpy"},{"comment_id":"1354018291282776","commenter_b":"Lol a bitch","commenter_a":"Colin, the multi millionaire football player only started feeling oppressed after he began dating a devout Muslim. He now hates everything American, but still takes advantage of everything American!","post_message":"If they thought their fans would blindly go along with any insult to their country, they were sorely mistaken..."}]
