[{"comment_id":"1064458436973745","commenter_b":"FIRE HIS ASS !","commenter_a":"Fox should remove shep ,,,,he was absolutely rude because he only wanted his views to be discussed, Time to go,,,,","post_message":"Many are Calling for Shepard Smith to be FIRED After What he Just did ON AIR... @webpagelink"},{"comment_id":"1083798295013251","commenter_b":"The JUDGE is a woman...","commenter_a":"How stupid!!! Wonder how this guy became a judge!!! Her mother is with her!!! Who is the idiot who is challenging her contract? Hang tough Bindi!!!","post_message":"A court judge is demanding proof that the 'Crocodile Hunter' is dead.  (via Daily Mail Australia)"},{"comment_id":"976666089019811","commenter_b":"You're all correct....but the easiest clue is the shadows on the stairs. Show the cat is clearly going down.","commenter_a":"down, the trim and the lip on the edge of the stair confirms that.","post_message":"No dress or Llamas in this morning's big Internet debate ..."},{"comment_id":"519056438282649","commenter_b":"cair can go to hell","commenter_a":"Our country. .USA..AMERICA","post_message":"PLEASE SHARE AND HELP PROTECT OUR VETERANS!"},{"comment_id":"10153727923344153","commenter_b":"Leave them where they are at!!! Fix their country!!! Build camps at their country, protect their country and teach them to protect themselves against their issues as we still have to learn to deal with ours and protect our people and shelter our vets and homeless and dude in 30 more years I better have my social security I put into that pot religiously for me not for them !!!!!!!","commenter_a":"I still feel the same way : JUST SAY NO TO SYRIAN \"MIGRANTS!!!!\"","post_message":"Has your opinion on taking in Syrian refugees changed since the Paris attacks?"},{"comment_id":"10153828561639369","commenter_b":"You know all people do is speculate as to what happened but there was clearly better ways to handle this situation then to get your own self in trouble and have your whole neighborhood thinking there is some psycho out there. No the kids shouldn't be doing that kind of stuff but why would a grown woman behave that way over some toys and trash.","commenter_a":"This woman didn't handle this situation well at all. That being said, don't parents teach their children what respect is any more??","post_message":"News of the weird....   An anonymous threat said, \"The children look delicious. May I have a taste?\""},{"comment_id":"10154133413586350","commenter_b":"Not cow milk. We are the only species who drinks another animals milk. You've been sold to drink milk because it gives you calcium but it does the complete opposite. It's all about $$$ Do your research, people! Cow's milk is not good for us.","commenter_a":"My siblings and I were fed carnation milk from a can and then whole raw milk from the bulk tank in the barn We're are all healthy and allergic to nothing.","post_message":"Is nonfat, low-fat, reduced-fat or whole milk best for your children?"}]
