[{"comment_id":"10155261002826509","commenter_b":"I can tell you as a white American that she's not going to help me or my family either.","commenter_a":"I love how all you white Trump supporters are trying to convince African Americans how Donald Trump can help them and Hillary Clinton can't when you probably have no freaking idea what the African American Community needs. Hysterical. I know you don't like the analogy, but it would be like Adolf Hitler's supporters trying to convince Jews that the Nazi party is better for them.","post_message":"Senator Jeff Flake says, \"I simply can't\" support Donald J. Trump. cnnpolitics.com"},{"comment_id":"639736896151349","commenter_b":"That's great and all but how do these women make money now?","commenter_a":"yeah and there'll be some bleeding heart liberal who'll be out fighting for robots rights and defending human trafficking because \"pedophelia is a disease!\" and we \"shouldn't judge\".","post_message":"Experts believe that cyborg prostitution will help ‘clean up the industry’ by reducing sexually transmitted diseases and ending sex slavery."},{"comment_id":"10152897660675950","commenter_b":"I wondered the same thing. Those bitches be crazy!","commenter_a":"where's part 3??","post_message":"In a video of the incident, two women are heard yelling at one another before the argument escalates and gets physical. Then a 6-year-old gets involved; at one point, the boy is seen hitting a woman with a shampoo bottle as the women wrestle on the ground."},{"comment_id":"522533064595578","commenter_b":"Shut up and set down!!","commenter_a":"he is not black he had a black father and a white mother so put that in his book","post_message":"WATCH: At a rally in Harlem, Hillary Clinton suggested there was an element of racism in Republicans' insistence that President Obama doesn't have the right to nominate Justice Scalia's successor. They're acting like he's \"not the real president\" @webpagelink"},{"comment_id":"577516445785152","commenter_b":"Sarasota canceled the witch!","commenter_a":"The pumkins look just like trumps he ad. Lol","post_message":"WATCH LIVE: Hillary Clinton continues to campaign in Florida, where she leads Donald Trump 45% to 44%, according to an NBC/WSJ/Marist poll reported by FOX News.  This morning, she's at the New Mt. Olive Baptist Church in Ft. Lauderdale."},{"comment_id":"10153717076186680","commenter_b":"Hillary Clinton is unfit!","commenter_a":"Odummy you aren't fit to tie Trumps shoe laces sorry doesn't even begin to describe you.You are just a halfbreed SOB that got elected for your skin color nothing more.","post_message":"President Obama on Donald J. Trump : \"The Republican nominee is unfit to serve as president.\""},{"comment_id":"10155146081185725","commenter_b":"I would never allow a nun within a telephone poles reach of me! Hahahah","commenter_a":"At least the club is consenting adults! Not a priest on scared little boy! Protest that instead you concrete vagina bitches!","post_message":"A group of suburban nuns is suing a neighboring strip club for the second time. What their complaint is this time --> @webpagelink"}]
