[{"comment_id":"10154138321738837","commenter_b":"I read she was with the lady already in line she just had more items for her. She did'nt skip the line. That racist pos was out of line enough said! Pendeja!!!!!","commenter_a":"Realistically speaking if you're with someone and they're at the counter cashing out who's going to go to the back of the line if they were \"Together\" and you're only adding an item or two?? saying she should have went to the back of the line is both irrational and impractical... part of the problem is making excuses for the inexcusable...","post_message":"#RACIST RANT RECORDED: A woman's Tuesday night racist rant while Christmas shopping goes viral on social media."},{"comment_id":"10155025724612940","commenter_b":"And youre a profile of a pussy chucky","commenter_a":"No she is a political hack","post_message":" Yates is a profile in courage.  ICYMI: Senator Chuck Schumer took a shot at the Trump administration over the firing of acting Attorney General Sally Yates for her refusal to enforce Donald J. Trump refugee order."},{"comment_id":"977002452335214","commenter_b":"Slaves","commenter_a":"the American people need to rebel against this. Citizens of a nation( especially one a great as america) should not have to live in fear of police persecution. The whole police force needs reform. The dirty cops, racist cops and just dam right bad police officers need to go. If your a trigger happy racist peace of shit who hides behind a badge and a gun to only parade around saying your a protector of peace, you need to be weeded out. Police in america don't know how to be police. Other countries around the world have polices forces that can control far greater numbers than america and without the casualties.","post_message":"Very disturbing video shows police killing a restrained man with three shots to the back."},{"comment_id":"10153288291318812","commenter_b":"That is great! I had to tell a mom to stop playing games on her phone in the theatre once. She was playing for nearly half an hr into the movie & it was totally distracting cuz of her huge bright screen & she was holding it up right in front of her face.","commenter_a":"Praise God it is so good to know that some people do still believe in kids being obedient and respectful to their elders.","post_message":"\"This rude, disrespectful, and awful behavior is unacceptable and they owe you an apology.\"  Mom's Facebook apology for kids' bad behavior at the movies brings recipient to tears: @webpagelink"},{"comment_id":"10154992075558256","commenter_b":"I agree","commenter_a":"Nobody equates \"America First\" with WWII references anymore - most of that generation is no longer alive. If you walk up to the majority of Americans on the street they will not be able to identify that historical reference. You are stretching for a story here.","post_message":"The phrase galvanized a mass populist movement against U.S. entry into WWII. While it attracted a wide array of support, its highest profile spokesman, Charles Lindbergh, blamed American Jews for pushing the country into war.  Trump started using the slogan in the later months of his campaign, and despite requests from the Anti-Defamation League that he drop it, he stuck with it."},{"comment_id":"10152609113745950","commenter_b":"Those \"children\" walk around with ak-47's and would not hesitate to kill an American or any other national that isn't one of their own upon first sight. They are bred with hatred from birth. Sad to say they are already tainted. BOMB THEM ALL! What do you do when roaches run rampant in your house? You call an exterminator correct? Do you take the baby roaches into consideration simply because they're innocent? It's still a roach. BOMB THEM ALL!","commenter_a":"When we get a President with a backbone to go into these countries and bomb the hell out of them, we will continue with these problems....Clean house no matter if there are innocent people or not....Get the Job Done Now...","post_message":"According to a CIA insider, it would take 100,000 ground troops to effectively respond to ISIS."},{"comment_id":"10154099546462377","commenter_b":"How about all of us that approve? No one asked me if I approve the transition? Comon, same old story as we heard during the lection!!!","commenter_a":"Awe !! Get used to it .","post_message":"More than of half of Americans disapprove of how Donald Trump is handling his presidential transition, a new Gallup poll reveals."}]
