[{"comment_id":"10153598339119205","commenter_b":"Fuckdonaldbitchasstrump!!!","commenter_a":"*****Hillary Clinton leads the Nation in overall votes and delegates, than any other Candidate running for the Presidency! She is more qualified and has more experience and will be ready to be our Commander in Chief, on day one. She has exemplary qualification in Foreign Policy, National Security and Diplomacy. Please vote wisely and vote for Hillary Clinton, our next POTUS 2016*****","post_message":"The biggest LOSER of the MSNBC #DemTownHall was..."},{"comment_id":"1300733136636619","commenter_b":"Crooked Hilary!! She lose everything ad her life evil woman!","commenter_a":"The Clintons are Milliinaires who t.Trump values over his loser voters","post_message":"They illegally set up a charity to line their pockets for foreign influence...most countries call that treason."},{"comment_id":"10152800967581545","commenter_b":"I'm with you on that","commenter_a":"Thats why i don't let my kids go to other peoples houses. I know im responsible but are they?","post_message":"Police investigated the death of a 13-year-old Garland boy as a possible suicide but later determined his friend likely shot him while the pair were playing with a gun they thought wasn't loaded."},{"comment_id":"923764651058995","commenter_b":"I've officially had it, I want Muslims in Muslim countries period not here...","commenter_a":"It was going to happen sooner or later. Might as well start it now.","post_message":"RT Khalilah Sabra: Muslims to Start a Revolution in America"},{"comment_id":"10154294683907061","commenter_b":"Wow what a brilliant idea. Lets a build a wall to keep ILLEGAL people out! Sounds logical to me.","commenter_a":"We already have about 700 miles of border walls and fences. Maybe we should try actually enforcing our immigration laws before we go out and spend money we don't have on walls and fences that don't work.","post_message":"WATCH: President Donald Trump promises to \"build the wall;\" will take action on immigration this afternoon: @webpagelink"},{"comment_id":"631181740405738","commenter_b":"Deport all illegal immigrants. .","commenter_a":"Yes","post_message":"Sheriff Joe and Donald Trump are joining forces to take on illegal immigrants.  It's about time someone put their foot down and stopped this madness.  Do you think all illegal immigrants should be deported?"},{"comment_id":"1281011171918910","commenter_b":"I would buy a hitman to kill grammar Nazis","commenter_a":"Your not going to win. Buy a beer instead","post_message":"What would you do with hundreds of millions of dollars?"}]
