[{"comment_id":"1405534516411777","commenter_b":"Yet, @username, the GOP has declared their Cleveland Convention a Gun-Free Zone!","commenter_a":"Senator Murphy, when will you learn about guns and understand the meaning of the 2nd Amendment? When will you stop infringing on legal gun owners and take the guns away from criminals? When will you outlaw gun free zones, which are obviously attracting all these liberal lunatics wh commit these horrendous acts against innocent people? When will you and other democrats come up with common sense ideas that punish criminals and not legal law abiding citizens? I'll wait for your response!!","post_message":"Taking your questions live with Senator Cory Booker"},{"comment_id":"10153623182969714","commenter_b":"Misspelled here.....lol","commenter_a":"Ouch! Whitney Karp","post_message":"Talk about a teachable moment."},{"comment_id":"10154313146426045","commenter_b":"Lady Liberty not going to get you in HEAVEN","commenter_a":"For all the Christians out here, I thought you might need a reminder of what your God says about foreigners. Leviticus 19:33-34 ESV “When a stranger sojourns with you in your land, you shall not do him wrong. You shall treat the stranger who sojourns with you as the native among you, and you shall love him as yourself, for you were strangers in the land of Egypt: I am the Lord your God. Before anyone starts screaming Old Testiment. Mark 12:30-31 (NIV) 30 Love the Lord your God with all your heart and with all your soul and with all your mind and with all your strength.’[a] 31 The second is this: ‘Love your neighbor as yourself.’[b] There is no commandment greater than these.”","post_message":"Mexican President Enrique Pena Nieto said his country  not pay for any wall, defying the claims U.S. President Donald Trump has made."},{"comment_id":"521903667998585","commenter_b":"So much for ESPN claiming to be a \"all inclusive\" company.","commenter_a":"We no longer have free speech. Opinions are free speech. These liberals are destroying the Consitution.","post_message":"The final straw came when Schilling shared a virulent anti-transgender meme on Facebook. via NBC Sports"},{"comment_id":"10150755194664999","commenter_b":"Are you suggesting women become prostitutes?","commenter_a":"Domestic housekeeping is correctly dismissed as being of economically minimal value, because in the free labor market performing these tasks for others (child care / babysitting, housecleaning, short-order food preparation) are low- (or no-) skill jobs that are either minimum-wage, or \"under the table\" cash-based work.","post_message":"\"We need to call work what it is — work — whether you do it at home or whether you do it out in the labor force, and then give men and women options to choose what they want to do.\""},{"comment_id":"1554742308153991","commenter_b":"IM A WOMAN...A STRONG WOMAN...AND I SAY TRUMP 2016!!!!!!!!!!!!!!!!!","commenter_a":"Classless joker","post_message":"What do you think about President Barack Obama's statements regarding Republican women and Donald J. Trump?"},{"comment_id":"2049944575230110","commenter_b":"Should have Shot those idiots","commenter_a":"Awwww poor police. .. terrible. . They r great people who never ever do any wrong. . I wish I could be sad for that mf... but I'm not","post_message":"OFFICER ASSAULT: A crowd watched as 2 people became entangled with an officer. Those 2 face charges after this video surfaced.   STORY: @webpagelink"}]
