[{"comment_id":"10154682154393984","commenter_b":"She's the whore of Babylon","commenter_a":"Let me tell you all her dx.......she needs Jesus Christ!!! Maybe she is possessed by a demon, highly likely......! God has allowed her to come to ruin because she wont turn from her wicked ways.....for those who do not like my comment.....read your bible, you will find out lots a things God allowed to turn people away from sin!!!","post_message":"There's been lots of speculation about what might be ailing Hillary Clinton, if anything. One dental expert took a look inside Hillary's mouth... and almost instantly, he said he knew the condition that's been causing all of her health problems.  Could this expert be right?"},{"comment_id":"10155402759240354","commenter_b":"A bunch of trouble making bitches trying to talk over one another","commenter_a":"Irrelevant opinions from an irrelevant long in the tooth washup","post_message":"**sigh**  WATCH the insanity for yourself."},{"comment_id":"935619299833521","commenter_b":"TRAITORS!!","commenter_a":"I'm done with them !","post_message":"SENATOR: Disney Fired 250 American Workers So They Could Hire Foreigners  A US senator demanded an investigation of a US visa program that Walt Disney World used to replace 250 American workers with...  @webpagelink"},{"comment_id":"10158081616760603","commenter_b":"@username Lame.","commenter_a":"Well I had sushi last night lol","post_message":"Any fish eaters out there? The most popular fish on your plate could be carrying a tape worm"},{"comment_id":"10153844548482894","commenter_b":"Girls dem suga 😁 get well mi fellow Jamaican .","commenter_a":"Aww cmon now not Beenie Man","post_message":"Beenie Man Contracts Zika Virus, Forced to Miss OVO Fest Performance"},{"comment_id":"1015366121832142","commenter_b":"Get em allll out of our country","commenter_a":"True!!!!!","post_message":"NO Sharia, NO Obama!"},{"comment_id":"10154493907103352","commenter_b":"Amen and thank you Lord","commenter_a":"Amen","post_message":""}]
