[{"comment_id":"529778360546077","commenter_b":"Live in America follow American rules! Don't like it leave","commenter_a":"This should be an example and a warning to others that they and their laws will NOT be tolerated in the United States ! ! ! !!","post_message":"The Muslim Brotherhood tried to take over this school, locals refused to back down.  This is patriotism at it's finest. These Muslims should serve life.  Can we get 10,000 'LIKES' for these patriot's stand against the Muslim Brotherhood?"},{"comment_id":"1088341921206279","commenter_b":"She is smart ! He is Dumber than a door knob !","commenter_a":"THE WHOLE WORLD condemns this moron. He's out of his fucking mind.","post_message":"As far as Mika Brzezinski is concerned, Mike Huckabee is repulsive and has no business being a candidate for president."},{"comment_id":"10152769636891636","commenter_b":"One day women will be in charge of everything ! Roll on","commenter_a":"Girl power!","post_message":"Last night, women took back politics from the boys' club..."},{"comment_id":"1537396076280417","commenter_b":"I would just ignore them all. Not worth stressing over. Continue on with remaining diplomatic and professional.","commenter_a":"If you support Yazidi Sex slaves, Vote Hillary. If you support crucifying Christians, Vote Hillary. If you support stealing relief funds from Haitians, Vote Hillary. If you support calling black people super predators, Vote Hillary. If you support foreign nations calling the shots in America, Vote Hillary. If you support free passes to the Rich and powerful and \"justice\" for the rest of us, Vote Hillary. If you love Wall Street, Vote Hillary. If you think arming Islamic Terrorists is a jolly idea, Vote Hillary. If you think going to war in Iraq was grand, Vote Hillary. If you'd love to have Islamic Terrorists \"Refugees\" in your backyard, Vote Hillary. If you support Drug Cartels, Vote Hillary. If you think women should have no rights accept in the US of course, Vote Hillary. If you like High Taxes, Vote Hillary. If you'd rather have the cops outline your dead body ...","post_message":"The document focuses attention on talks about which parts of Clinton's emails should have been be marked classified before release to the public."},{"comment_id":"653257648132607","commenter_b":"I agree. Fuck Kim Kardashian! She is trash.","commenter_a":"So a woman who's apparently famous for releasing a sex tape of her getting pissed on gets robbed of 10 million dollars worth of jewellery. Who the Fuck cares.?","post_message":""},{"comment_id":"472875716234055","commenter_b":"fk you brenda","commenter_a":"Idiots!!!!!!!!! disgraceful cannot wait till they are gone from the white house.","post_message":"I cannot believe they DID THIS on the same day! I am sick and tired of a president that doesn't care for our Marines and Veterans!"},{"comment_id":"10153974645223132","commenter_b":"ITS NOT A WOMEN!!!!! Check the DNA!!!! It has not had ANY of the real struggles of a REAL women. Tell it to give birth, have a period, nurse a newborn baby!!!!! Completly undeserving!!","commenter_a":"maybe if the men who hink that they are women should have the gender description of woman and all women change to the smartersex as our descriptive verb!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","post_message":"Congratulations, Caitlyn Jenner, who was an honoree!"}]
