[{"comment_id":"1093998960667966","commenter_b":"party endorsed toadies dont age well","commenter_a":"PUT these clowns out too pasture","post_message":"BEYOND TIME  America's Freedom Fighters"},{"comment_id":"1199029986880444","commenter_b":"give out birth control pills....us older people didn't even have those in our days ....PPH sells baby parts so that's one reason they like abortions......","commenter_a":"And baby mortality will go down","post_message":"Cecile Richards: Maternal Mortality Will Increase if Planned Parenthood Defunded [VIDEO]"},{"comment_id":"1590001651301475","commenter_b":"Great she'll be a steady war monger!","commenter_a":"Yeah diplomacy works! First and foremost.","post_message":"The Young Turks #LIVE coverage of the Commander In Chief Town Hall hosted by Ben Mankiewicz, John Iadarola & Ana Kasparian"},{"comment_id":"957899690952352","commenter_b":"If they're refugees where have they got the money to buy fireworks - surely they need it for food, clothes & shelter","commenter_a":"Scare them all back where they came from..... And walk a few swine around with you.","post_message":"German officials have asked residents to refrain from using fireworks to avoid traumatizing refugees."},{"comment_id":"10153203354164071","commenter_b":"I also voted for Romney and would do it again. The Presidency was 'stolen' from him.","commenter_a":"Vice President Romney","post_message":"Mitt Romney just unloaded on President Barack Obama's foreign-policy legacy."},{"comment_id":"10153801088312690","commenter_b":"But that's just it. It's not about the transgender. In fact its nothing against them. It's about the fact that it now opens the door to any man out there. How do they want to strip women who were born women from there rights??? How do they want to take our safety and security. And yes a sexual assault can happen anywhere. We get it.","commenter_a":"Show me one article where a transgendered person assulted someone in a bathroom and I'll show you 10 where a priest, football coach, or teacher did the same thing.","post_message":"President Obama will issue an executive order that public schools must permit transgender students to use bathrooms consistent with their gender identity. Who should make that decision?"},{"comment_id":"10153101255675779","commenter_b":"Tailgate Savannah only time will tell i like ronda but she is getting a bit arrogant t","commenter_a":"ronda rousey is gonna lose to holly like if you agree","post_message":"Ronda Rousey visited the The Tonight Show Starring Jimmy Fallon last night to promote her upcoming fight with Holly Holm and discussed Floyd Mayweather and challenged Fallon to a Mario Kart match. Watch below."}]
