[{"comment_id":"10154211946341523","commenter_b":"@username shut the hell up. U bitch","commenter_a":"I smell bullshit. Somebody lying","post_message":"“The mother says that in the moments before the crash, the bus driver said something to the effect of ‘Are you all ready to die?’  Seconds later, the bus was on its side and five kids were killed.\""},{"comment_id":"603295489861030","commenter_b":"Willie is anti-gun. Doesn't really matter what else he says, Willie can go to hell.","commenter_a":"Go getem Willie.....","post_message":"Willie Nelson just made this huge stand against Obama.  We stand behind him 100%. Let's show him our support.  Can we get 10,000 'LIKES' for Willie Nelson?"},{"comment_id":"1104014366324977","commenter_b":"How is that racist lol Muslims are a ravery of people haha and no makes them follow a old book written by a peodphie that married a 9 year old girl","commenter_a":"Hey! Don't forget that ISIS are not \"real\" muslims. And it is just a coincidence that 100% of those who join or support are muslims. This has NOTHING to do with islam. And it is only 8% of the entire population of Turkey who supports ISIS. (according to a recent Pew Research poll) But don't worry about it, they are not \"real\" muslims either. Anyone who says that the world has a problem with islam is just a racist. We all know that islam is a religion of peace. Case closed.","post_message":"EXCLUSIVE"},{"comment_id":"474511766072737","commenter_b":"Can't do that until you remove the Muslim president who encourages them to take over.","commenter_a":"we need to take our Country back. We outnumber them let stop the insanity. Dont let any mosks be built in this country. We cant build Churches in theirs. If they dont like it here than leave. No one would care.","post_message":"Muslims force this school to ban Christian holidays.  America is under attack, this is treasonous.  'LIKE' if banning Easter is WRONG!"},{"comment_id":"10153174842954342","commenter_b":"Amyaa Brown what u done did? Lol jk","commenter_a":"Deepan Patel","post_message":"EVACUATION CHAOS: Southwest Airlines evacuated a plane at Hobby Airport when the cabin started smelling like smoke.   WATCH:"},{"comment_id":"1015814318563348","commenter_b":"Illegals are getting benefits. Its not my fault that youre too much of an idiot that you cant see that. And because of our backwards government giving handouts to everyone of these assholes, theres not enough resources left to give them to the people who really deserve them. Stop being such a dumb cunt. Every chance i have to take part in getting rid of these parasites, you better god damn well believe that i will!","commenter_a":"And illegal immigrants shouldnt be in the us either. Have you seen the jails in this country? If you break the law, they lock you in nasty, unsanitary cages like fucking animals. If you break yhe law, you get what you deserve!","post_message":"These conditions should not be allowed anywhere, especially in the U.S."},{"comment_id":"819567068195360","commenter_b":"Build the wall. Get rid of illegals now.","commenter_a":"Those of you who are trolls (you know who you are) , really need to attempt to get some education, I.e., government or civics classes. 🇺🇸🇺🇸🇺🇸 TRUMP","post_message":"WATCH LIVE: Members of the Electoral College in Texas gather at the statehouse in Austin to vote for the president and vice president of the United States. One Republican elector, Chris Suprun, has revealed his intention to vote for John Kasich instead of Donald J. Trump."}]
