[{"comment_id":"1181257421894286","commenter_b":"Lmao. Wouldn't that be frowned upon?/ wouldn't we be illegal immigrants?","commenter_a":"#getyourasstomars","post_message":"Aldrin wants us on Mars by 2040."},{"comment_id":"947171632075323","commenter_b":"She can put them in her house","commenter_a":"She is insignificant.","post_message":"Now Amal Clooney slams Britain!"},{"comment_id":"10158601678305354","commenter_b":"And don't forget while wearing a vagina costume ......","commenter_a":"it'd be cheaper just to say \"get the fu_k out!\" stupid leftists just cant bring themselves to be rude or nasty ... unless they are being rude & nasty to conservatives.","post_message":"Desperate."},{"comment_id":"877009682392087","commenter_b":"If you are a salaried worker, no overtime pay. Which means you get a set rate of pay weekly or biweekly and have to work how many ever hours you have to, to finish your job. Whether it's 30 hrs or 50 hrs you get the same pay. It's like that for a lot of managers and supervisors.","commenter_a":"I must be in a bubble, I thought anything over 40 hrs is overtime, I have always been paid time and a half for anything over 40 always. What is it the restaurant businesses? Who doesn't pay overtime?","post_message":"This is HUGE! \"A hard day's work deserves a fair day's pay,\" the President said in his announcement.  Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10155909073040354","commenter_b":"Yea I've been seeing her dumb ass everywhere lately","commenter_a":"Mike Romano this woman is crazy.","post_message":"SHOCK! Nancy Pelosi backs Planned Parenthood."},{"comment_id":"1203183663111217","commenter_b":"STFU","commenter_a":"Nothing Mr. Trump does compares with crimes Hillary and obama have committed.","post_message":"A prominent Republican who supports Donald Trump urged the candidate to start acting like “a potential leader of the United States.”"},{"comment_id":"923822694380650","commenter_b":"@username, Hillary is not a good choice for president. I'll take Bernie Sanders!","commenter_a":"How pathetic is this woman??? EVERYTHING she does has an ULTERIOR motive....EVERY word is calculated......she is not genuine in the least bit.....","post_message":"Hillary Clinton will soon meet this history-making couple."}]
