[{"comment_id":"10157695745225354","commenter_b":"Kanye and his fat ass bitch are 2 POSs.","commenter_a":"Yezzy? I think he probably meant sleezy.","post_message":"FIRESTORM as Twitter backlash grows.   Read the TWEETS:"},{"comment_id":"560619820771155","commenter_b":"Happy Thanksgiving Dr. Carson and family!","commenter_a":"God bless and keep you both always,many more Thanksgiving to share our blessings.","post_message":""},{"comment_id":"1591036221183491","commenter_b":"NICE ! Drop that bitch","commenter_a":"That was just so great","post_message":"OUCH! That's gotta hurt.  This bully had it coming."},{"comment_id":"10153514022490047","commenter_b":"Why couldn't they give birth control wouldn't that been cheaper going have to do better than that","commenter_a":"Except what little they give women for birth control. When I couldn't afford birth control, much less a birth, they were there to help.","post_message":"A senior Planned Parenthood abortionist was caught on camera detailing how they \"crush\" the baby and sell the organs.       Planned Parenthood must be stopped.  SIGN our petition to take action: @webpagelink"},{"comment_id":"10154339492484087","commenter_b":"@username, good luck trying to deport a Native, you racist bigoted POS.","commenter_a":"Meanwhile, Boeing stocks take a hit because of this asshole.","post_message":"Boeing released a statement saying it was under a $170 million contract with the Air Force, not $4 billion as Trump claimed."},{"comment_id":"10153551321648984","commenter_b":"A coal burning slut","commenter_a":"Kardashian is nothing more than a SLUT! Don't watch anything to do with her, PERIOD!","post_message":"Look out, Kim Kardashian. I don't think you realize who you're messing with...  Do you side with Megyn Kelly on this one?"},{"comment_id":"10154271222713984","commenter_b":"She is a liar and manipulator ..","commenter_a":"A vibrator up her cooze? Call out the nuke-sniffing pig from South Park.","post_message":"Hillary Clinton was about to give a speech when suddenly the reporters heard a very strange noise... they knew immediately that Hillary was hiding something.  We know Hillary can't be trusted and this proves it... everyone needs to know what Hillary just did."}]
