[{"comment_id":"1089067221104747","commenter_b":"it's only good enough for those of us that don't pray to the gun god!","commenter_a":"Republicans; \"Carry a gun everywhere, except near us.\"","post_message":"If conservatives are so convinced that gun-free zones attract killers, then why do so many conservative places and events ban guns?"},{"comment_id":"1588980671119277","commenter_b":"Agree all the way.the truth is black or white, can be proved.lies can not be proven.the cons get mad because facts on mostly on the liberal side. We can't help it if they love lies and are prejudiced to believe them.warped sub humans.","commenter_a":"Without fake news he and the GOP are dead in the water. Then all they have left is election rigging, voter suppression, and Gerrymandering. Oh yeah, and help from COMMUNIST Russia! And that just ain't enough!! #GOPTraitors","post_message":""},{"comment_id":"10154973031601509","commenter_b":"yah ! you r big brother of DONAL TRUMP .","commenter_a":"Farage is a racist. And Trump is a racist. Racists love each other.","post_message":"Brexit leader Nigel Farage: Donald J. Trump \"dares to talk about things that other people want to brush under the carpet... For the United Kingdom, I think Trump would better for us than Barack Obama's been.\" @webpagelink"},{"comment_id":"10153083416063984","commenter_b":"Stoopidbitch","commenter_a":"Doesn't it just make you proud?","post_message":"Obama will not meet with Israeli Prime Minister Benjamin Netanyahu, but he'll meet with these 3 YouTube sensations? Priorities..."},{"comment_id":"377454052442889","commenter_b":"Let's BAN Muslims, this is our country and our freedom of religion!!!! They need to go back home where they belong to do this in their own country!!!!😡😡","commenter_a":"If the Muslims choose t o.live here, Don' t tell us what you want. This is America and a lot of us are Christians and we don't need or want immigrants telling us to change our beliefs. If you don't like our beliefs and our freedoms, maybe you should g o back to you country and try to get along. If you choose to stay here and enjoy our life and freedoms, then stop telling us to give up.our beliefs. I suggest you join a branch of service and share the responsibility of living here instead of holding your hands out for every thing you can get for free. It's time we stand up to you and what you want. I'm tired of it. God bless America!!!!","post_message":"The want to change Easter in \"Spring Break\"..."},{"comment_id":"10155080239376037","commenter_b":"Wow, just wow! How much tin foil DO you go through a week???","commenter_a":"Being \"sold to us\" as home Terrorist attack.... Each minute the MSM spews more misinformation pushing their Naritive. My guess , MK Ultra mind control at work...., , distraction? Agenda? To be determined. ?..","post_message":"Suspect Esteban Santiago, who was carrying a military ID, allegedly opened fire, killing at least five people before being taken into custody."},{"comment_id":"10153274848901600","commenter_b":"Just send a card. She should get the hint.","commenter_a":"Decline the invitation","post_message":"A mom is causing a backlash online for an apparent email she sent before her son’s first birthday party. The email includes specific requests about acceptable gifts for her son."}]
