[{"comment_id":"539258706198723","commenter_b":"Fuck her","commenter_a":"She wrote the book on \"reckless\" and \"dangerous foreign policy\". Just ask Sean Smith's mother.","post_message":"Hillary Clinton took aim at Republican candidate Donald Trump's foreign policy calling it \"reckless\" and possibly \"dangerous.\" Do you agree or disagree?"},{"comment_id":"1782129738697799","commenter_b":"She doesnt know, she just wants to bash him because shes a Kate fan.","commenter_a":"Shameful that these girls have been brainwashed.....the mother is more responsible for the marriage breakup. She treated the father horribly. TLC destroyed this family. Just as you have one mother young ladies; you also have one father. He nurtured you as well when you were babies up to the point your mother ran him off. Look at your old pictures and first episodes of your show. Your father was pretty much left with nothing.","post_message":"“He doesn’t even know us”"},{"comment_id":"10153612601766336","commenter_b":"You know they wont. Shes gonna get a slap on the wrist.","commenter_a":"Lock er up!!!","post_message":"The DIA, the NSA, and the NGA, which oversees U.S. government spy satellites, confirmed to Catherine Herridge that the information was classified at the time and remains classified now."},{"comment_id":"1277987642251583","commenter_b":"When I say technology, I'm talking about millenia of advancements. Even our simplest tools at one point put someone out of work, probably starting with the wheel. If you want to walk away from technology (or just some technology) that's your choice, just don't try and force others to pay for your choice.","commenter_a":"Low skill workers have been making this argument for generations since the first automation came about and it still doesn't work. Someone still has to design, manufacture, install and service the machine. Someone has to stock supplies for it to use. Still plenty of jobs, just not the job you were doing yesterday. They are also overlooking the other basic problem that the Government doesn't create wealth. If you get a freebie from Uncle Sam, that came out of someone else's hard earned money via taxes. If we're all sitting at home due to this miracle automation, then there's nobody around to pay the taxes to fund the government. It simply doesn't work. Worse, we've seen countless times around the world how it doesn't work and people still don't get it.","post_message":"Simply put, the idea is that Uncle Sam will cut citizens a regular paycheck whether they work or not."},{"comment_id":"453510694837224","commenter_b":"I love it! muslims do not belong within our borders!","commenter_a":"Arkansas get on the ball, and do the same.","post_message":"If you don't like our laws and constitution...we can help you pack and leave!!!"},{"comment_id":"10152810357076130","commenter_b":"Dike supporter? Leave the USA then","commenter_a":"Too bad they can't be fired for being worthless POS's and I'm talking about the people the staffers work for","post_message":"Under current House rules, congressional staffers can legally be fired for their sexual orientation, gender identity or gender expression."},{"comment_id":"10153428290568487","commenter_b":"?? Do you think it while turn a woman into a fuck machine? Does Viagra turn men into drooling cock monsters?? WTF are you even talking about??","commenter_a":"Am I the only one with a slight concern that this could be used to spike women's drinks? Just a thought in the back of my mind....","post_message":"A FDA panel has recommended approving female Viagra for the market. Is it even necessary?"}]
