[{"comment_id":"10153371613511336","commenter_b":"Leave it alone. Enough already!!!!!!!","commenter_a":"REALLY? think theres much better ways to spend our tax dollars","post_message":"With your help, #TheNew10 will be decided later this summer."},{"comment_id":"10156367673320725","commenter_b":"@username pull your pants up","commenter_a":"This Latina and my family are voting for Donald Trump all the way to the white house!! Yay for me!","post_message":"I will NOT let America down! Thank you for your continued support of my presidential campaign. Together, we can all #MakeAmericaGreatAgain! #Trump2016"},{"comment_id":"10154491854776002","commenter_b":"Yeah, she's a great mother!?!? Ha. Get those poor kids away from her immediately; lock her away with the scum husband.","commenter_a":"Seriously-not only her but her husband has committed the same crime-hurting thousands of others-stealing money from the government and she wants a break?!!!!!!","post_message":"Washington is asking the judge for a massive break. The judge ordered her to serve four years in prison, but she is asking not to go to turn herself in for five years so she can stay home with the kids while their father serves his time for the same crime."},{"comment_id":"10153594324081336","commenter_b":"These animals should be disposed of! Don't waste the tax-payers money on public defenders, trials and a life in prison!","commenter_a":"This animals need to be caught and put away for life!","post_message":"The Lash family had just returned home from vacation when a group of teens came to the door and asked to borrow a jack for their car, then tried to force their way into the home."},{"comment_id":"1342427385796715","commenter_b":"Lock her up!","commenter_a":"How can people be voting for this woman I just don't understand we are doomed","post_message":"BOOM.... !! Judicial Watch comes out with a powerful STATEMENT.  @webpagelink"},{"comment_id":"1160460537342680","commenter_b":"@username God is with us; not the one @username's people created, but the One who created the rest of us.","commenter_a":"You could make this same argument against every single other country in the world as there is no country that didn't have slavery and there is no race on earth that was not enslaved at some point, I was never a slave nor did my ancestors own any slaves so my question is why in the hell would I owe any reparations? Please explain?","post_message":"U.N. experts believe that the U.S. owes a significant amount of reparations to African-Americans.   With ongoing police shootings, unsolved legacy of slavery and so much more do you believe the U.S. will pay reparations? DETAILS ——> @webpagelink"},{"comment_id":"10154556133417235","commenter_b":"Good bye you old hag","commenter_a":"It could only have happened more quickly. Thank God for small miracles. Goodby. God Bless, where ever \"He\" .Kisses.","post_message":""}]
