[{"comment_id":"10154475429571336","commenter_b":"One could only hope. But she seems to be too slimy to catch!","commenter_a":"Wikileaks founder, Julian Assange, has said that Wikileaks has obtained information that, when released soon, will guarantee a Hillary Clinton indictment. During a recent interview with ITV, Assange said his next release will “provide enough evidence” to see Hillary arrested.","post_message":"At the Veterans of Foreign Wars VFW convention, Donald J. Trump slammed Democrats for not mentioning ISIS during their DNC speeches. @webpagelink"},{"comment_id":"10154394358144062","commenter_b":"I don't trust these hoes","commenter_a":"\"According to the police report, Crowley was intoxicated and made inconsistent statements about Manziel's actions. \" Dem hoes!","post_message":"Johnny Manziel could face NFL discipline for Ohio incident..."},{"comment_id":"10153569786727522","commenter_b":"What do American soldiers have to do with restriction of future immigrants?","commenter_a":"Barbara Bell","post_message":"\"When you question a mother's pain...you are attacking us.\""},{"comment_id":"564500333698743","commenter_b":"Liz is either stoned or drunk on the kool aide.","commenter_a":"yeah right","post_message":"Hmm...gratitude was not exactly the word I had in mind."},{"comment_id":"10153693446321037","commenter_b":"Women on women issues unless it's Bills sexual affairs then she doesn't care.","commenter_a":"Maybe she should have first looked to tackle it at the White House when she was living there.","post_message":"Hillary Clinton is the first 2016 presidential contender to address the issue of campus sexual assault on the campaign trail, but she may not be alone for long."},{"comment_id":"10154678664866037","commenter_b":"#CutHerLoose","commenter_a":"She should stay in jail where she belongs.","post_message":"Tulsa police officer Betty Shelby turns herself in after being charged with first-degree manslaughter — but has since been released on $50,000 bond."},{"comment_id":"1158332250952774","commenter_b":"I am an American who moved abroad and I get better healthcare for very cheap and birth control and maternity leave and the whole shebang... Anyone working gets rights to this in other countries. I can't believe America is fighting such a simple idea. A healthy population is a productive population. You want more able workers? Make sure they can remain healthy enough to work!","commenter_a":"Todd...more than 3 million more said No to Trump than yes!","post_message":"WATCH LIVE: The Women's March on Washington following Donald J. Trump's inauguration –— over 500,000 are in attendance."}]
