[{"comment_id":"10154200313034411","commenter_b":"@username do explain which nation was exterminated, and you're a unwelcome imigrant in south africa, you will also get what you sow, dickhead","commenter_a":"England never apologized for any war crimes during Imperialism era ...bcoz they are too fucking arrogant and Egoistic goons !!!","post_message":"During the Second World War, Ireland remained neutral and successive Irish governments were openly belligerent to British interests (Op-Edge by Bryan MacDonald)"},{"comment_id":"10153440207470950","commenter_b":"The stats show that you're more likely to shoot a family member than anyone else. Guns don't kill people, but people with guns can and do kill more people than those without. Who would have been at fault if the kids shot out the car window and killed someone? The kid, or her for failing to secure a murderous weapon? What if after after being almost killed by her son, she veered into on-coming traffic and kills another driver? Who is at fault then? Not only do I not understand the pro-gun and pro-kill people, I don't believe their justification for wanting to kill.","commenter_a":"Dumb ass","post_message":"The mom, a pro-gun activist who runs the page Jamie Gilt for Gun Sense, told deputies her 4-year-old son shot her in the back with a .45-caliber handgun that was on the floor of her pickup truck."},{"comment_id":"10154878892083812","commenter_b":"GregOwens, @webpagelink","commenter_a":"That was just a typo. He didn't mean POTUS. He meant P.O.S.!","post_message":"Pres. Barack Obama in response to last night's presidential debate: \"Hillary Clinton went high and showed why she'll be a POTUS for all Americans.\" @webpagelink"},{"comment_id":"1085742424820999","commenter_b":"Steven Lumb then ask yourself why. She must be doing something right.","commenter_a":"So after my 12 years teaching and three post-grads I am still not allowed to call myself a professor but she can, in her first teaching job, what a joke.","post_message":"2016"},{"comment_id":"10153247983639411","commenter_b":"Why so you can kill some hardworking people going to work or school children. Blow yourself bitch and take some jihadists pigs back with you you prostitute. Hope you fry in hell you piece of shit.","commenter_a":"She shouldn't be allowed back into the UK","post_message":""},{"comment_id":"414886538699640","commenter_b":"She needs to keep her legs closed and get a f*^king job....lazy ass","commenter_a":"That's sick","post_message":"She wants one more HUGE favor from us..."},{"comment_id":"10152967718236545","commenter_b":"White male driving.","commenter_a":"He's going 5 miles an hour. 1 car go in front and the rest block him in. This isn't rocket science. I don't think this is that news worthy. Just let us know what happens when it's over. #annoyed","post_message":"UPDATE: From Fort Worth police: Citizens, for your safety, please do not stop to take pictures, stay in your vehicle.  You may want to avoid east bound I-30 in Fort Worth for a while. Traffic is backed up for miles as police are still in a low speed pursuit of a vehicle.   WATCH LIVE: @webpagelink"}]
