[{"comment_id":"10154498468358690","commenter_b":"Julia I was having discussion with other posters in the same tone.. You should be ashamed that you cannot tell the difference . Who do you think you are to tell others ? Get off my post ! Then hit the block button . Theres a good little troll.","commenter_a":"What nonsense. The trouble began when Islam became the majority religion. ISIL is just a mixture of many Islamic terrorist organizations. The mistake the US made was leaving all the weapons and armory behind thinking Iraq would use them to fight them , instead a lot of the Iraqi army used them against eachother.","post_message":"The Iraqi town of Saadiya's problems began after the 2003 US invasion."},{"comment_id":"1074056242615386","commenter_b":"Because people destroy their habitat and poach them for money.","commenter_a":"Wild animals shouldn't be kept captive! They should be in the wild if people want to see them why don't they go to there homelands instead of leaving them kept in cages!","post_message":"This gorgeous little jaguar cub made his public debut this week at the San Diego Zoo."},{"comment_id":"690494281108627","commenter_b":"pregnancy, keep your pants on and shut up!","commenter_a":"They need a Vasectomy law instead lol stop blaming the Uterus","post_message":"100,000 women took to the streets ... and now the abortion law has been dropped."},{"comment_id":"10153892614846323","commenter_b":"Heartless bitch","commenter_a":"you failed your child it is your job to teach them not to go to strangers homes do not trust people over the internet and so on","post_message":"\"My heart breaks to think how scared he must have been.\""},{"comment_id":"10155273538573797","commenter_b":"build a wall...then build another wall around the south side","commenter_a":"I blame the mayor. Its his fault this stuff happens","post_message":"A 74-year-old man has been charged with shooting another man Saturday night in the Park Manor neighborhood on the South Side."},{"comment_id":"1692664807687298","commenter_b":"She is evil...completely stupid","commenter_a":"She needs help that was sick","post_message":"This is SICK!   End the Cop-Hate NOW. #AllLivesMatter"},{"comment_id":"10153516807860575","commenter_b":"Schmuck must go!","commenter_a":"He looks mentally ill.","post_message":"The Gateway Pundit - DISGRACEFUL: Mitch McConnell WILL NOT Allow Vote to Defund Planned Parenthood (VIDEO)"}]
