[{"comment_id":"1732269190330470","commenter_b":"Lol sure","commenter_a":"This just in, scientists baffled that the universe is not that old, may have been created by a a Supernatural being....\" I can't wait.","post_message":"The breakthrough could offer greater understanding of the Big Bang among other things. @webpagelink"},{"comment_id":"510533845803862","commenter_b":"Leave you camel humpers","commenter_a":"get OUT","post_message":"This Fox News reporter was absolutely disrespected by these Muslims.  They are out of control. If Muslims are going to live in our country they need to learn some manners.  Do you agree Muslims have to assimilate or get out?"},{"comment_id":"1529798700659483","commenter_b":"Compensate us all for the injuries we suffered because of what our ancestors did. We had no part I f it. Then compensate the Irish remember, \"Irish and dogs, need not apply\" Chinese, italians, \"WOPS\". And then we women, are expecting big checks for years of abuse. Finally, when you finish paying everyone off, well all go to work to pay the huge federal debt you ran up, and will have reached \"slave\"status. I want my check too, otherwise I'm going on wekfare. Get over it. Get real.","commenter_a":"I'm excited. I had an ancestor who fought with Sherman's army....so I certainly will not be required to contribute, and maybe even receive compensation for the hardship he endured.","post_message":"BREAKING: Obama Just Announced That He Will Be Forcing You To Compensate Blacks For Slavery.  The slave trade was hundreds of years ago, get over it.  Will you pay up?"},{"comment_id":"10153968954135695","commenter_b":"Read article it happened in Pittsburg","commenter_a":"Way to go ga.","post_message":"“They told me I was OK to park where I was, as long as I was not on the curb… then I come out and I'm being towed,\" one parent said."},{"comment_id":"10154895009386337","commenter_b":"A pussy with a ring...yah right!","commenter_a":"Jefferson has always been a pussy!","post_message":"LOL. Joel Embiid cares not for your veteran status, Richard Jefferson..."},{"comment_id":"10153413861058352","commenter_b":"Keep raping her for the rest of her life like she did to her grands","commenter_a":"Sick piece of shit","post_message":"Woman sent to jail for the rest of her life after raping her four grandchildren is described as the ‘most evil person’ the judge has ever seen. #STILLTRENDING"},{"comment_id":"10152726918051051","commenter_b":"She should really be charged with Involuntary Manslaughter...","commenter_a":"Some people should have no children Stupid ass how can she do that","post_message":"This woman left her 2 small kids alone to get her hair done. When she returned, there were firefighters everywhere."}]
