[{"comment_id":"933295990044593","commenter_b":"Most reusable bags are made from thick plastic. It makes me wonder how many thin bags it takes to make up one of those. Then how many if those are just thrown out because they become dirty or torn. Plus, as it was stated, the carbon footprint of these bags isn't helping anything. I think the best solution might be bags made biodegradable from corn or potato. I've seen some restaurants begin using those.","commenter_a":"when you walk a beach every day, as i do in seattle, it is clear that limiting the use of plastic bags is completely reasonable.","post_message":"Ah, the infamous \"paper or plastic\" question. It's way more complicated than we thought, and now scientists are throwing their hats into the ring to solve this environmental quandary."},{"comment_id":"1733272846942683","commenter_b":"Girl bye! Ain't nobody listening to your BS. Ms Lori.","commenter_a":"Poof Obama creating race card and divide.... Michelle just made it clear she lives in the house built by slaves! REALLY?! A spokeswoman for the first lady says that Michelle Obama currently has a staff of 24. So, she has slaves using taxpayer money too, huh?! You have done nothing but create racial divide while in that house! Nothing deserving or anything to brag about....You could have gone down in history as a great black leadership in that house. Instead, you have did the biggest disservice to people of color by creating the deepest racial divide I have ever witnessed in my well over 50 years of life! You have weakened our country security and will go down in history as one of, if not the worst President in USA history!","post_message":"\"Don’t let anyone ever tell you that this country isn’t great.\" - Michelle Obama delivers an emotional testimony to the greatness of the United States of America. @webpagelink"},{"comment_id":"884400811644417","commenter_b":"Once again, that blonde bimbo has diarrhea of the mouth!","commenter_a":"this guy has an ego like no other. he is disgusting to look at and if he weren't rich he would probably be a homeless pervert or a wall street runner.","post_message":"The Oracle of the Republican Party speaks out."},{"comment_id":"1700109030241371","commenter_b":"@username @username lol this lady","commenter_a":"@username I so see this being you in like 100 years","post_message":"This 105-year-old woman has the best reason for ignoring her doctor's advice about drinking soda."},{"comment_id":"1147635848590103","commenter_b":"that evil woman will cause alot more problems for america","commenter_a":"HAHA!!","post_message":"North Korea has backed presumptive U.S. Republican nominee Donald Trump, with a propaganda website praising him as \"a prescient presidential candidate\" who can liberate Americans living under daily fear of nuclear attack by the North."},{"comment_id":"495256197331627","commenter_b":"She can't ban nothing she is just a picture hanging on the wall so tell her to stay out of Americans business","commenter_a":"So sad","post_message":"What Michelle Obama is banning now is just plain unacceptable.  The American people are tired and finally fighting back.  Do you agree Michelle Obama should mind her own business?"},{"comment_id":"10153554129132452","commenter_b":"#motivation","commenter_a":"Leydy","post_message":"Congratulations, Alfonso! The 96-year-old World War II veteran graduated from USC and is the oldest graduate in the school's history."}]
