[{"comment_id":"989968744373799","commenter_b":"I will be keeping the guns thank you.","commenter_a":"We need anti knife and anti-texting while driving legislation.","post_message":"Commentary from Blaze contributor and pastor Jarrid Wilson."},{"comment_id":"1059645677404171","commenter_b":"Stop her","commenter_a":"Pero que no fueron capaces de pararlo...","post_message":"LIVE NOW: Police chase in Long Beach, CA."},{"comment_id":"1394765567230964","commenter_b":"Because they enjoy it. They love to rape. That's it.","commenter_a":"Im still confused. Why does it seem that boys need to be educated against forcibly sexually attacking a woman? Like, hey! You shouldn't hurt that girl! Why is that something they need to be taught? Its like saying boys are rabid animals that need to be trained or something. Maybe they are, but why??!! I guess in the case of Nairobi born boys, if one in 4 women have been raped, perhaps they witness a lot of those attacks and it normalises the behaviour. But still. I am struggling to comprehend how a boy in ANY country comes to believe that raping a girl and causing her harm is normal. 😕","post_message":"In case you missed it: Take a look inside Kenya's successful rape prevention program."},{"comment_id":"10154345885036051","commenter_b":"No second chances for this crazy woman!! That poor girl going thru all those surgerys...","commenter_a":"The sister is right she is not a monster!! She is a crazy bitch! And to me the sister is as bad, would she want the mom released if it had been her that had been put in an oven!! I mean seriously what the hell is wrong with people?? And myself i have a hard time buying the insane bit anymore, to many times it is used to try to get away with doing wrong!","post_message":"When she was only 14 months old, Ashley's mother put her in the oven and turned it up. Her father was able to save her. She spent the next 10 years in and out of surgeries. Now she is 15 and ready to start high school - and she just got some unexpected news about her mother."},{"comment_id":"10153809354827169","commenter_b":"Let's make a new list and start it with Tamir Rice.","commenter_a":"White people in America don't have Race Hustlers disguised as Christian Reverends telling the young men that they can't win in life because they're a victim, nor have Whites exalted bards who glorify violence against sex objects that once were loved as women, violence to police, and street crime. In short, White people are starved for heroes, but Black people have chosen villains for their heroes, and feed their souls on poison. And what people of any age can rise above their heroes?","post_message":"Four out of 10 African-Americans said they doubt the nation will ever achieve racial equality, but as many white Americans believe racial equality has been achieved, according to a national study released by the Pew Research Center (From PBS NewsHour)"},{"comment_id":"10153430518633445","commenter_b":"She is no friend of common Americans! This bitch is out for herself and her MIC handlers, fucking traitor!","commenter_a":"Hillary Clinton will say anything to get elected but she is no friend of Marijuana.","post_message":"#Trending - Hillary Clinton Suggests Rescheduling Marijuana, But Does Not Currently Support Like-Minded Legislation."},{"comment_id":"10153908258427235","commenter_b":"Clowns with Guns!","commenter_a":"Listen up numbnuts, the oath to protect the constitution against all enemies foreign and domestic means that YOU are the enemy and should be eliminated. YOU are the one threatening the government, YOU are the one who hates America. YOU are a moron and a #faketriot.","post_message":"These guys are treasonous."}]
