[{"comment_id":"10153090581796749","commenter_b":"Go fack your mam","commenter_a":"Fack you","post_message":"This is no longer a problem to leave for the next generation to fix. We have to act now."},{"comment_id":"679207482232542","commenter_b":"Criminal woman Brave !!","commenter_a":"Hillary is so brave for being a woman!","post_message":""},{"comment_id":"1405534516411777","commenter_b":"Yet, @username, the GOP has declared their Cleveland Convention a Gun-Free Zone!","commenter_a":"Senator Murphy, when will you learn about guns and understand the meaning of the 2nd Amendment? When will you stop infringing on legal gun owners and take the guns away from criminals? When will you outlaw gun free zones, which are obviously attracting all these liberal lunatics wh commit these horrendous acts against innocent people? When will you and other democrats come up with common sense ideas that punish criminals and not legal law abiding citizens? I'll wait for your response!!","post_message":"Taking your questions live with Senator Cory Booker"},{"comment_id":"635910406556387","commenter_b":"Go away stupid black man","commenter_a":"Always has the Muslims in the forefront of his talks before even condolences ... God forbid we upset the Muslims because they practice the religion of peace!","post_message":"President Barack Obama addressed the horrific terror attacks in Nice, France and called suggestions to target Muslims in America \"repugnant.\""},{"comment_id":"10153279358959087","commenter_b":"You're a stupid bitch","commenter_a":"Democrats have become the party that endorses Corrupt Liars. Next time a Democrat points a finger at Republicans they should point 5 back at themselves first.","post_message":"Nearly twice as many Americans say they are unsatisfied with Hillary Clinton’s response to the 2012 attacks in Benghazi as say they are satisfied, according to a new NBC News/Wall Street Journal poll released today."},{"comment_id":"10155064838244497","commenter_b":"Cankles, in Hillary's case","commenter_a":"Mike Pence is worried that those shameless hussies will show a flash of their ankles during the march.","post_message":"\"I can tell you how let down I feel by the heads of these households who did not simply give their wives and daughters a firm, decisive  when they asked to participate in today demonstration.\""},{"comment_id":"937487649627809","commenter_b":"NO, NO, NO. Why is there even a question about this. Too many illegals in this country already. Do you want more?????","commenter_a":"Everytime I think I hear the dumbest thing ever, something else trumps it. I cant believe how unpatriotic some folks are now days. America is for Americans. Become an American and then you can vote. No intelegent group would ever let an outsider make a decision for them. It doesent make sense.","post_message":"More than 1 in 3 Americans believes illegal aliens should have the right to vote in U.S. elections, a figure buoyed by the majority of Democratic voters who favor the idea. @webpagelink"}]
