[{"comment_id":"1071940456151087","commenter_b":"the medias role should be to challenge state lies... now their main role is to amplify it","commenter_a":"this is not good.","post_message":"Barry Grey: Addressing the United Nations General Assembly on Monday, President Barack Obama portrayed himself and the US government as the preeminent defenders of international law and diplomacy. He did so even as the catastrophic consequences of the illegal wars of aggression he has overseen continued to send waves of refugees fleeing the ruins of entire countries—including Afghanistan, Iraq, Libya, Syria and Yemen—and as Washington took new steps to turn Eastern Europe into a militarized zone for eventual war against Russia."},{"comment_id":"10153898665266336","commenter_b":"Don't forget about us crazy white women !!","commenter_a":"The white boys who are already here have horrible things on their minds. When are you going to call for them to be banned Donald the clown? @webpagelink","post_message":"On last night's 'The O'Reilly Factor,' Donald J. Trump defended his proposed Muslim ban and said the U.S. \"cannot allow people to come into this country that have horrible things on their mind.\" @webpagelink"},{"comment_id":"10154014162531636","commenter_b":"Nope! Jeremy Corbyn.","commenter_a":"ISIS?","post_message":"BREAKING"},{"comment_id":"10154462042369062","commenter_b":"Lmao... Con el nopal en la frente y encontra de illegales.... Everyone with a hispanic latino last names shall research theyre ancestry our families come from illegal immigrants","commenter_a":"We are not \"united\" and Trump is not racist. I am against illegal immigration and support Trump!","post_message":"It translates to, \"United Latinos: Don't vote for racists.\""},{"comment_id":"10158490372020354","commenter_b":"Hope they make an example out of her","commenter_a":"Jail her.","post_message":"My, my, my..."},{"comment_id":"10153151656451336","commenter_b":"Prayers for our Country. This woman is a tyrant!","commenter_a":"The last person on earth we need as president.","post_message":"BREAKING NEWS: Hillary Clinton announces 2016 presidential campaign. @webpagelink"},{"comment_id":"10154245788639060","commenter_b":"\"Women: Kill yourselves.\"","commenter_a":"Rename this rag to The Feminist. I'm sure that there was something else happening in the world today more important than finding another excuse the use the word misogyny in an article. Generally more men die in every society than women by an order of magnitude. Women have a lot of catching up to do to meet those equality of outcome goals.","post_message":"The murder of a young woman in South Korea has prompted hand-wringing over festering misogyny in a country that ranks near the bottom of the pile for gender equality"}]
