[{"comment_id":"1659577024311353","commenter_b":"Trump has no chance of beating Hillary---and that is a fact. She would chew him up.","commenter_a":"Just another reason to vote for Trump!","post_message":"I'll help you PACK!"},{"comment_id":"10154265295731756","commenter_b":"Barriers for woman are more subtle in every field!","commenter_a":"Chet Logue","post_message":"The lingering, less-visible barriers to women in science create a new kind of challenge: People will fail to acknowledge they're there, writes Tania Lombrozo."},{"comment_id":"10157076549400354","commenter_b":"Does the rules say you can steal another candidates votes like he did with Ben Carson?","commenter_a":"Cruz is playing by the rules...PERIOD. Elections have been done this way your entire life. There is nothing different from other elections, with the exception of a whiny, sniveling, jealous loudmouth. Too bad Trump hasn't been paying attention to the rules.","post_message":"\"Ted Cruz has no chance of winning this without bribing the delegates. That’s his game at this point. He’s mathematically eliminated....\"  WATCH:"},{"comment_id":"10153220883066491","commenter_b":"Unnecessary! Girls that are having their period don't play with barbies","commenter_a":"LOL - that is just rich.","post_message":"“It’s just what happens in real life.”"},{"comment_id":"1170750279653754","commenter_b":"Leave, Obama, just leave already. Go live in the ghetto desert with your Saudi prince best friend, before whom you knelt and kissed his hand. And take lying, leftist, socialist Hillary with you, and Bill, too. Don't forget to tell Bill to keep his pecker in his pants. We'll even provide a private jet on Egypt Air for you. In your picture at the Orlando vigil for our citizens you coundln't kneel like you did b4 the jihadist price, you just sqatted like they all do since they all don't have toilets. You are a disgrace and you are one of them!!!","commenter_a":"he is absolutely right","post_message":"When Obama ignored radical Islam, this YouTube star went online and slammed him for the coward that he is. He proved that Donald Trump was 100% RIGHT in calling this ISLAMIC TERRORISM, and we should not be afraid of those words!  Let's get 1,000 SHARES for a man who's not afraid of telling it like it is!"},{"comment_id":"992259924200395","commenter_b":"I do not believe recreational marijuana should be legalized. Medicinal marijuana, yes. But there are enough zombies wandering our streets and driving our roads already, we do not need a bunch of stoners driving.","commenter_a":"It's about time, the stigma needs to go.","post_message":"Finally! It's time to stop throwing kids in prison over a little pot."},{"comment_id":"482642515272130","commenter_b":"Absolutely it is. We're nearing the point of no return for this planet (relative statement. Could be in 100, 300, 500 years) and without a plan to continue our species (even if generations have to spend their lives in a travelling spaceship) we will go extinct. Planning for the future is always a worthwhile investment no matter how far ahead the worst case scenario seems.","commenter_a":"In other news more useless discoveries that are so far away they might as well not exist","post_message":"AMAZING news."}]
