[{"comment_id":"1658190531136070","commenter_b":"Racist unethical cheater!","commenter_a":"This garbage troll shouldn't be allowed to breathe at all!","post_message":"Geraldo Calls The Constitution Bullsh*t And Then Goes On Epic Rant Slamming Americans  Kick him off Fox. He doesn't deserve to be on the air. Do you think he should fired?"},{"comment_id":"10152882725317807","commenter_b":"More trolling stupidity. Shuster, you are pitiful.","commenter_a":"Does this give you pause @username??????@webpagelink","post_message":"It’s tax day, but the American people certainly don’t need another reminder that the federal government is taking too much of their money.    In what ways do you believe government is over taxing you?"},{"comment_id":"1319359411443456","commenter_b":"LOL...she needs to put her fake boobs away....","commenter_a":"Totes newsworthy!","post_message":""},{"comment_id":"10154049332181749","commenter_b":"Immigrants don't commit horrible crimes, don't you look at crime statistics? They commit the FEWEST horrible crimes by a massive margin.","commenter_a":"Yeah... It's not like we have any other threats that are more prevalent. Like terrorists, a government who's trying to destroy our freedoms, our Constitution, or our country for that matter, illegal immigrants crossing our borders and committing horrific crimes... No no climate change is so dangerous. Good thing we have you to keep us safe from uhhhh... the sun.","post_message":"The Clean Power Plan helped pave the way for the historic Paris Climate Agreement—the first-ever global climate deal."},{"comment_id":"10155558251545354","commenter_b":"If I was her I would bow out of this hot potato that may leave egg on her face!","commenter_a":"Who really cares Baltimore's become the septic system of America","post_message":"Uh oh...."},{"comment_id":"10153933179656509","commenter_b":"Lol see what I mean? \"White people do this all the time.\"","commenter_a":"Who could do such a thing? I don't want to hear that mental illness mess either. Lethal injection time.","post_message":"The suspect broke into the house and handcuffed the victims in their bedrooms -- and then shot them, authorities said. @webpagelink"},{"comment_id":"10153919396826509","commenter_b":"White people have killed 300 million people","commenter_a":"Agree...Tony..history...no human life should died..in wars...but happens.","post_message":"The world still struggles to fully understand the events on August 6, 1945. Hiroshima survivors and artifacts link us to the past: @webpagelink"}]
