[{"comment_id":"1651334078420186","commenter_b":"Disgusting Banker Thugs.","commenter_a":"cowards shouldn't be cops","post_message":"The woman's vehicle was clearly functionally disabled, but that didn't stop these cops from \"fearing for their lives\". The most disturbing part about it; the cops seemed to enjoy executing her.  Story/Video here: bit.ly/1HARM4N"},{"comment_id":"10153919484005950","commenter_b":"I'm not copying, I'm telling the truth. You also look like a witch. It's catching.","commenter_a":"Angelina ruined him once, now she's trying again. She should have kept her man eater claws out if his first \"real\" marriage. I swear, I think she's a dark witch, casting dark spells.","post_message":"The LAPD released a statement to Entertainment Tonight to clear up reports that they were investigating Brad Pitt for allegedly being physically and verbally abusive with one of his children."},{"comment_id":"10153474426766350","commenter_b":"u don't have 2 worry then bitch. your pathetic.","commenter_a":"sad and pathetic. marriage between homosexuals is wrong on any level and again the moral majority is forced to put up with this BS. i for one will give no male or female homosexual the time of day much less respect they don't deserve. it is wrong on any count for male and female homosexuals to marry.","post_message":"\"Today is beautiful,\" said Anna Kendrick."},{"comment_id":"10154141762806162","commenter_b":"Wild animals!!!!! trump is the wild animal causing all this bs PIED PIPER !!!","commenter_a":"People need to stop blaming Trump for the actions of low life people. They get out of hand, then don't want to own up to their actions. It's the generation of placing the blame elsewhere. Trump didn't tell them to act like wild animals. That's just how they act.","post_message":"\"We're going to take our country back from 'these people,'\" Trump told supporters after his canceled Chicago rally. \"These are bad, bad people.\""},{"comment_id":"1116402168438318","commenter_b":"Darren VM They don't want the imbecile either, probably why he ran here! LOL","commenter_a":"I don't understand how this humiliates Obama. I don't understand why Michelle is included in this. I don't understand why any sane American will be for humiliation of an American President regardless of agreement on issues.","post_message":"Obama may think he's Europe's favorite politician, but Queen Elizabeth just made a stunning announcement that put Obama right in his place.  You know Michelle was furious when she heard about this."},{"comment_id":"510533845803862","commenter_b":"Leave you camel humpers","commenter_a":"get OUT","post_message":"This Fox News reporter was absolutely disrespected by these Muslims.  They are out of control. If Muslims are going to live in our country they need to learn some manners.  Do you agree Muslims have to assimilate or get out?"},{"comment_id":"470081979849049","commenter_b":"Sure try take away all our guns but let the criminals still have them way to go","commenter_a":"Terrible First Lady","post_message":"Michelle Obama just made a major move on gun confiscation.  This is ridiculous, restrictive gun laws cause HIGHER murder rates.  Will you refuse to allow Michelle to take away the 2nd amendment?"}]
