[{"comment_id":"1728684567380415","commenter_b":"#NotMeUs hillary just want your vote so she can work hard for the rich people!","commenter_a":"Please exit out of video , share the post by clicking SHARE button on bottom right. Come back and join us❤️","post_message":"Bernie Sanders rally in Pittsburgh: Part I"},{"comment_id":"895114997196955","commenter_b":"Your mother is a rat","commenter_a":"for press tv and iran the houthi rebels who tried to overthrow the govt are not terrorists. Instead the forces fighting houthi rats are terrorists. and iran claims to be a democracy. wtf","post_message":"Saudi warplanes airdrop weapons to militants in #Yemen  Read more: @webpagelink"},{"comment_id":"1243719872306934","commenter_b":"I would kill radical's in a minute for these women!","commenter_a":"These guys need to be exterminated!","post_message":"Of all the atrocities committed by ISIS, this just might be the most horrific of all. Kidnapped girls and women caged like animals and then set on fire for refusing to have sex with their Islamic captors"},{"comment_id":"870530659649023","commenter_b":"This seems to imply, the next President has to be a woman...","commenter_a":"I completely agree with her that Hillary is not the woman for the WH. And I'm looking hard to find the one who will do all they can to put us back on track as a Nation, restore our economy, and undo the damages done to our International Affairs across the world. We need to sure up our relationships with our friends and work harder with the ones who threaten the peace and safety of this world to ensure they do not get nuclear capabilities and the ability to use them. We also need to clean up our Nation from illegals and close our Borders so that they are not so easy for illegals to cross them. We need some common sense leadership for this Nation instead of all the socialism and liberalism, lies and corruption that is tearing this Nation apart. Hillary Clinton has already proven she can not ...","post_message":"Want a female president?   Skip Hillary. Look at Carly Fiorina!"},{"comment_id":"1802927083306226","commenter_b":"Well you got what you wanted...he called Illegal Aliens, \"Guests\" Now wallow in it.","commenter_a":"Only people glad he's gone are the criminals and illegals","post_message":"LIVE VIDEO: There's a new sheriff in town as Paul Penzone is sworn-in as Maricopa County's 37th sheriff after defeating Joe Arpaio in November's election. Arpaio served as sheriff for the last 24 years."},{"comment_id":"10153195780106130","commenter_b":"I'd give her an orgasm!","commenter_a":"Who's the asshole out there denying women orgasms??? Selfish prick!","post_message":"\"Don’t not have an orgasm. Make sure he knows that you’re entitled to an orgasm.\""},{"comment_id":"10153147861257060","commenter_b":"That's her dumb ass then.","commenter_a":"She fell for the Kenyan Prince trick, lol","post_message":"A Metairie woman was duped into sending more than $195,000 to man she knew only through Facebook, according to the Jefferson Parish Sheriff's Office."}]
