[{"comment_id":"10153778323659497","commenter_b":"Oh, NOW I find out where all the women with things are. You couldn't have said this sooner?","commenter_a":"I grew up in Bloomfield Hills. This is too accurate! 😂","post_message":"Walsh family members confirmed that Mom wouldn be home until later because of her thing."},{"comment_id":"1011674828909358","commenter_b":"The thought of that ticket is NAUSEATING but a SURE WIN for you DT! The Witch and Crow will cause Havoc where ever they go!","commenter_a":"I am a Trumper and together we will defeat Hillary and her running mate.","post_message":"I hope corrupt Hillary Clinton chooses goofy Elizabeth Warren as her running mate. I will defeat them both."},{"comment_id":"1757425844524023","commenter_b":"Is not as easy as you put it my friend, illegal immigrats don't just \"apply\" to get their papers...if it were that easy we woudnt have so many illegal immigrants.","commenter_a":"I am sure this girl is worried about deportation of her parent's. I am also certain that many kids of illegal immigrants living in the US are fearful.. but wouldn't parents apply for a visa and for proper citizenship? So their kids wouldn't live in fear? And set an example that this is exactly why the US is the greatest place to live!","post_message":"Young child of undocumented parents speaks at the Democratic convention about her fear of being deported: \"I’m scared that at any moment my mom and my dad will be forced to leave. And I wonder what if i come home and find it empty?\" @webpagelink #DemsInPhilly"},{"comment_id":"10155384832638132","commenter_b":"I wouldn't think a pregnancy so close after a tummy tuck would be good.","commenter_a":"Didn't she get a tummy tuck?","post_message":"Congrats to the Teen Mom 2 star!"},{"comment_id":"10154249032461178","commenter_b":"She should be gangraped!","commenter_a":"Is the reverse also true?? Are you fair game if you disagree with my views?? What an idiot!","post_message":"A rapper with a history of controversy says violence against women is OK as long as they disagree with her politics."},{"comment_id":"10153955830944087","commenter_b":"Never trust a woman in a white pants suit.","commenter_a":"No bitch, that's not how this works!","post_message":"#BREAKING: Hillary Clinton accepted the Democratic Party’s nomination for president Thursday, making history as the first woman to lead a major political party."},{"comment_id":"1176004315773372","commenter_b":"And make Texas pay for the wall","commenter_a":"I think we should just let all the gun nuts go to Texas and secede from the Union. They already have their own power grid, so we could build a bullet proof wall around the state and let them shoot all they want.","post_message":"Nugent's response to the San Bernardino shooting is to call for a new American civil war."}]
