[{"comment_id":"1405973546081315","commenter_b":"Trump by a Landslide","commenter_a":"and the subsidy goes up so the real cost is less. The cost of healthcare is going up for everybody for 25 yr and every yr so whats new here","post_message":"First, we were told we could keep our doctors, but that was a lie and now we discover that premiums will rise 25%..."},{"comment_id":"10154595854899203","commenter_b":"It has nothing to do with civil rights get real. If the NFL wants security they can hire their own. The police are voluntary for the game.","commenter_a":"Pathetic. A cop's job is to protect and serve, not protect and serve who they agree with. Bad cops.","post_message":"They are furious with Colin Kaepernick."},{"comment_id":"10153880758701337","commenter_b":"Lesbians","commenter_a":"Who the fuck cares..","post_message":"Justin Bieber has more than 50 tattoos yet this one fit perfectly in an unexpected spot..."},{"comment_id":"1378443058862829","commenter_b":"SHES WAVING TO THE CROWD YOU ASSHOLES..","commenter_a":"Conservatives suck","post_message":"Wait till you see what she appears to be saluting."},{"comment_id":"1701440090108890","commenter_b":"They jeer at Cruz. Call him \"politician.\" What they surely remember is the way Cruz sucked up to Trump in the early part of the campaign. \"Lyin' Ted\" sticks because Cruz seems two-faced.","commenter_a":"All Cruz did was bash Trump. What a looser.","post_message":"\"He's gonna put a liberal on the Supreme Court. He's going to take away your Second Amendment rights. This man is lying to you and he's taking advantage of you.\" -- Ted Cruz to Donald J. Trump supporters in Indiana today"},{"comment_id":"10153058283284411","commenter_b":"Carlan those who behead people in the name of fake Islam are created by Mossad , CIA and MI6 have been given training by them please wake up to the reality CNN and fox news are not just the lives stop your hatred against us muslims please leave us alone , those isis members have kept their fake muslim names","commenter_a":"Germany starting shit again... Shocker.","post_message":""},{"comment_id":"1603977773244161","commenter_b":"Revoke her clearance!","commenter_a":"BREAKING: HILLARY SET TO RECEIVE SECURITY CLEARANCE ANY DAY NOW!!! She broke the law. She exposed our nation secrets. She lied to the American people countless times. And yet, this week she is set to receive access to information she already proven she can handle. We cannot allow Hillary to put America safety at risk. Demand the FBI revoke her security clearance","post_message":"Tom Fitton is LIVE to discuss our Judicial Watch weekly update on the Obama IRS Scandal and more!   [touch sound icon at bottom right to increase the sound or turn your own volume up. Thx! . ]"}]
