[{"comment_id":"1315269151829205","commenter_b":"Somebody need to give this Scum, a History lesson !","commenter_a":"This idiot is truly deranged.","post_message":"White nationalist Richard Spencer held a conference in support of Donald J. Trump and claimed that America belongs to white men.   1,000 protesters met him outside."},{"comment_id":"529761760538579","commenter_b":"You ruined it","commenter_a":"@username @username Sam Finch We get the joke :)","post_message":""},{"comment_id":"1121252964608432","commenter_b":"Shouldn't he be taking on Hillary??? Just another dumb ass between the choice of two dumb asses","commenter_a":"Acting just like hillary","post_message":"Politics."},{"comment_id":"624394087751170","commenter_b":"SO TIRED OF STUPID RACISTS. !!!!!!!!!!!!","commenter_a":"Doesn't she want her peep to show? What a POS this he/she is.","post_message":"Michelle Obama suffers a humiliating wardrobe malfunction during vacation. This is hilarious. Do you agree Michelle Obama is a disgrace to America?"},{"comment_id":"10153316007267144","commenter_b":"Why doesn't she ever just answer the questions and stop telling everyone everything else!! Oh yeah, because she is the biggest liar ever!!!!!","commenter_a":"Way to go Hillary Clinton!","post_message":"The whole room joined her. Watch."},{"comment_id":"873586192785317","commenter_b":"U feel sorry!!! Speak up your no better than them if u witness it and say nothing. Damn","commenter_a":"When I worked at the hospital in the lab..I can't tell you how many times I saw cops get unnecessarily rough with women ..women of any color. Not all but a lot..it actually made me start to feel sorry for their wives . If they do that on the job I hate to see what happens when they know they aren't being watched","post_message":"BRUTAL CONFRONTATION: Pennsylvania police officer charged after being caught on video appearing to punch a woman during a traffic stop: @webpagelink"},{"comment_id":"10154075360053797","commenter_b":"You know her personal","commenter_a":"Wow look at all these people who would vote for a liar to run this country. What an uneducated bunch.go clear back to Watergate with hillary she is a liar.","post_message":"WOW! Rest in Peace Elaine. She was a registered Democrat and not \"a political person.\" However, her obituary says: \"Elaine requests, in lieu of flowers, please do not vote for Hillary Clinton.\" Her reason is getting a lot of attention. See here:"}]
