[{"comment_id":"688195661362262","commenter_b":"You are awesome president Obama! !!! Thank you for all you've done","commenter_a":"This guy is a crook 2","post_message":"LIVE - President Obama on the Election Night win of President-elect Donald Trump."},{"comment_id":"1626970717590041","commenter_b":"Just another dumb ass girl.","commenter_a":"Great job to a fellow veteran to set her straight. As a veteran we all lay our lives on the line and people like this little girl has no concept of what that means. It seems to me her family hasn't taught her or the school's she has gone to they need to wake up","post_message":"What an epic response by this Veteran!"},{"comment_id":"913542928735066","commenter_b":"President Barack Obama saved America while dealing with racism, hate and obstruction.... @webpagelink","commenter_a":"Look at his eyes. He's not just low energy. He's medicated.","post_message":"Ben Carson thinks being called out on homophobia is what's destroying America."},{"comment_id":"10154497186563445","commenter_b":"Our friends in england's women and children are also being raped to death or enslaved by \"refugees\" and have some of the strictest gun laws ever so I think we can cut our losses there, drug addicts.","commenter_a":"Shit","post_message":"While the DEA has been busy reclassifying CBD as a Schedule I drug, our friends in England are rightly classifying it as a medicine."},{"comment_id":"1046343315386679","commenter_b":"Can two women already have a baby? I mean in a biological way of course...","commenter_a":"Wow","post_message":"No women required."},{"comment_id":"535194776668815","commenter_b":"Enough reason to deny them into the USA!!!!","commenter_a":"Send them to the Obama White House when theyb return from vacation.","post_message":"***WARNING***"},{"comment_id":"893334250795530","commenter_b":"@username shut your dumbass up. She doesn't need to be in a nasty bathroom cause ur perverted ass can't keep walking and mind ur business. I'm sure you don't mind girls shaking their tits for u just not this baby doing what they were actually made for. Take your ignorant ass on.","commenter_a":"Do it in the bathroom where u have your privacy. Not in the cafe lady...and why are you filming it? Cause you want attention? Or go to the women's section and do it there. You knew you were going to Target, why didn't you bring some bottles with you?","post_message":"This stranger started harassing a woman because she was breastfeeding at Target  but customers and staff defended in the most beautiful way.  #MicBrights"}]
