[{"comment_id":"10153111787816051","commenter_b":"I think girls are more likely to want to fight for what they feel at the moment and most of the time it's about nothing. Hopefully when they grow up they will become ladies","commenter_a":"Awwww. Look at that gentle giant trying to help that girl up off that park bench","post_message":"This girl was holding a baby when they surrounded her. She didn't want any trouble, but it didn't matter."},{"comment_id":"10153245501553984","commenter_b":"This is a state matter not federal.If these Muslims can't live by the laws that are already here and set then I suggest they leave.Preferably the latter.","commenter_a":"go girl ... rippem up !","post_message":"Political correctness is NOT in this mayor's vocabulary.   Do you support her stand against Sharia Law?"},{"comment_id":"10153840702631955","commenter_b":"No no, that's Bernie. Hillary is just a straight up thieving murderous cunt.","commenter_a":"And to think that there are idiots who say that she's a communist or a Marxist. What morons. After she gets so much $$ like Ted Cruz from Goldman Sachs","post_message":"HRC wore yellow debate jacket when meeting GOLDMAN SACHS CEO..."},{"comment_id":"1260170427412540","commenter_b":"Rudy Giuliani, just said, before president Obama there was no successful terrorist attack on America. I loved it! these so-called educated white men show their stupidity, every time they open their mouths, he just spit and pissed on the graves of all the 911 victims! , it happened not once, but twice in New York (terrorist attacks), and how could sun-bleached bleached Donald Trump care about the veterans when he said he doesn't like the ones that got captured? And before running for president he has never! donated to any veterans organization, but he's going to take care of the veterans and loved the veterans, he's a real sleaze ball!","commenter_a":"We got nothing","post_message":"Is Donald J. Trump likely to double-down on his proposed immigration ban?"},{"comment_id":"10153921224283132","commenter_b":"They tend to get bigger when you are pregnant","commenter_a":"Are her tits hanging out far enough?","post_message":"Kim Kardashian West and her family are rallying around Lamar Odom."},{"comment_id":"10153875809248352","commenter_b":"Thank you Doriaan. This bitch hatin ain't she?","commenter_a":"Instant reflex nigga don't touch me while I'm performing bitch you lucky that's all you got...KEVIN GATES THAT MOTHAFUCKING NIGGA","post_message":"RAPPER BRUTALLY KICKS FEMALE FAN BECAUSE SHE TOUCHED HIS SHORTS. REALLY? #DISGUSTING"},{"comment_id":"1062159727157832","commenter_b":"If that were to happen then only the criminals will have guns.","commenter_a":"Aaw Fuck, here we go. Egotistical morons doing \"research\" and thinks their Right. Others just making shit up, then there's the name caller who judges everyone else..No One has a Fuckin Solution?! Then don't write Anything","post_message":"Karl Rove had a unique idea during a Fox News interview: The only way to stop people like Dylann Roof is to completely repeal the Second Amendment."}]
