[{"comment_id":"915027651932695","commenter_b":"Yes","commenter_a":"YES!","post_message":"Follow us for more at BuzzKix"},{"comment_id":"1383799158379801","commenter_b":"I hate that little bitch","commenter_a":"Omg I can't stand her, I saw her the first time (and the only time) on one American news network, I guess she's not on there anymore. Good, she's awful, she's uneducated, and that voice omg....id rather jam an ice pick in my temple than listen to her.....who decided she had a brain or talent was sorely mistaken......oy.......","post_message":"Your move, Tomi Lahren!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"628263567364222","commenter_b":"I'll stick with Palin on this issue!","commenter_a":"Sarah Palin is just an nut","post_message":"Americans are now claiming that Sarah Palin is racist.  This is absurd. Sarah is under attack, let's get her back.  Do you support Sarah Palin?"},{"comment_id":"10154172121273010","commenter_b":"They are moving the focus to have room to build a new ranger...","commenter_a":"This is disgusting. All respect for Ford, gone. After 2 Rangers, no more.","post_message":"It's cheaper and more profitable to make the cars in Mexico."},{"comment_id":"10153434512226749","commenter_b":"Oh we WILL get your guns. We will save this country from the terrorist gun owners","commenter_a":"Give it up Obama....you're not getting our guns! Stricter gun laws will only make more people buy them illegally!","post_message":"It's time to do something. @webpagelink"},{"comment_id":"841359735901368","commenter_b":"He just \"forgets\" that we are in the 21st century, not in the Middle Age. We've learned from the past and they don't.","commenter_a":"We are all aware that this President is ill informed and has had trouble when it comes to Historical accounts... Whether or not you believe the Crusades were meant to stop Islamic atrocities or to spread Christianity, that should not be the focus here. Suggestion: Truly read the differences between Christianity and the Islamic faiths and decide which spreads peace within its holy scriptures.... An interesting example below siting scripture from both religions (read in its entirety). ...Especially, the Ellen Mems comparison. This is a public FB debate between a Muslim and a Christian: Quoting \" Christianity & Islam A debate... Gamal Abouomar Who is Prophet Muhammad, may peace and blessings be upon him? He is the one who defended the rights of all humanity 1400 years ago. He defended men's, women's and children rights He commanded and fostered the love between relatives and neighbors He established a coexistence relationship ...","post_message":"Barack Obama's prayer breakfast comments about Christianity are causing some to perk up.   “Unless we get on our high horse and think this is unique to some other place, remember that during the Crusades and the Inquisition, people committed terrible deeds in the name of Christ.\""},{"comment_id":"489295787927668","commenter_b":"screw her","commenter_a":"first explain what 20,000 likes will accomplish ......","post_message":"Hillary Clinton is attempting to make it punishable by law to criticize Islam.  She just crossed the line. We can put a stop to this, let's end this right now.  Can we get 20,000 'LIKES' for freedom of speech?"}]
