[{"comment_id":"10153174842954342","commenter_b":"Amyaa Brown what u done did? Lol jk","commenter_a":"Deepan Patel","post_message":"EVACUATION CHAOS: Southwest Airlines evacuated a plane at Hobby Airport when the cabin started smelling like smoke.   WATCH:"},{"comment_id":"10153200811382377","commenter_b":"I'll agree with you on that , but it still doesn't change my position on accepting unvetted refugees !","commenter_a":"So he just declared the Obama administration a terrorist group then !!","post_message":"British Prime Minister David Cameron: \"The Muslim Brotherhood is not the only movement that promotes values which appear intolerant of equality and freedom of faith and belief.\""},{"comment_id":"1905080359721745","commenter_b":"I. Bet money the daughter started it and got in her feelings when white girl wasn't going for the bullshit.","commenter_a":"But yet where were you at when your monkey was jumping around and disrespecting people.","post_message":"Used that right hand like a weapon!  #WSHH #Fight"},{"comment_id":"10153341871609411","commenter_b":"Lady is.Europe.is ur ultimate paradise huh wow, what's ur talks pointing out? Ur a pervert who looks at European ladies as 'new lady to rape'? U think European ladies are the ultimate ones in world? U must be an ignorant fool since birth","commenter_a":"Just thinking about sex is not life, u can be happy with out thinking about sex Thinking of sex make us animal and blind and leads u to rape a new woman","post_message":""},{"comment_id":"10153364798139877","commenter_b":"Robin! Amen! Everybody wrong for agreeing with that old woman!","commenter_a":"She is so wrong , she is not the Pastor nor is she the head of the Church. So far out of place in the Church , just because you put in a offering or your family started the church its not your church nor are you the Pastor. Dang shame! Guess she wants to go to hell in a hand basket.","post_message":"103-year-old woman who was kicked out of her church clapped back...now the pastor is in hot water. Watch what happened next below.   Grio fam, we're glad she put up a fight. What's your reaction?"},{"comment_id":"1026494337483744","commenter_b":"#MakeWhiteAmericaGreatAgain","commenter_a":"How about instead of protesting they work on getting jobs and off the system. I'd love to go to the inauguration but I have a job and millions of people on welfare are counting on me every day to work so they can freeload.","post_message":"Unbelievable..."},{"comment_id":"10157018686460389","commenter_b":"And who is this new party going to be run by.. Romney?","commenter_a":"Ronald Reagan had similar numbers at this point in the process...the anti-Trumpites will fall by the waste-side....they are caught up in narrow-mindedness babble that has locked the GOP out of the White House for 8 years...it does not work WITH their current platform...we will re-write the \"Contract with America\" and the Republic's Platform (for our constitutional republic) and our new GOP party--the New American Conservative Party...AND TRULY MAKE AMERICA GREAT AGAIN. #TeamTrump #TeamUSA #BrightLightOnTheHill #AnythingisPossible #PositiveAttitude","post_message":"This is what an insurgency looks like."}]
