[{"comment_id":"1026275800718010","commenter_b":"Oooooh. Oh Oh someone is actually deciding that the Manchurian fraud president could actually be an Islamic terrorist. Well the grasshoppers may actually be waking up to that fact. What the hell do you think I have been saying for the last six years. In the movie the Manchurian candidate American prisoners were being brain washed by the Chinese to undermine America and it's politicians and kill them. In Obummer's case he was indoctrinated into the Muslim cult and communism by his father mother and his in-law's. There are no Muslim or Islamic American's because they will give their lives for Islam. They are instructed by the Koran to deceive the infidel's and make them think that you are their friend. When the time is with us we will torcher them and then kill them in the name of Islam There are no good Muslim's . That is for outward ...","commenter_a":"Yes","post_message":"Millions of Americans have suspected for quite some time about Barack Obama's ties to the Muslim Brotherhood. Now, there's a document that's being called \"the smoking gun.\""},{"comment_id":"10153782447389094","commenter_b":"Ppl are making it one. So just fix it where only one person can use the restroom by themselves.","commenter_a":"Just make all businesses have two restrooms with one stall. And a lock on each door. Problem solved","post_message":"The states allege the government action has “no basis in law.”"},{"comment_id":"10154570112539497","commenter_b":"*grandma hands me a $10* \"Go get yourself a cup of coffee!\" \"Grandma, this is a $10...\" \"Then get yourself 3 cups of coffee!\"","commenter_a":"Jennifer Ann Winchester","post_message":" don tell your parentsthis is just between you and me. Good boy."},{"comment_id":"10154450153734411","commenter_b":"@username Is there a government on this planet that is not - up to no good - ?","commenter_a":"Why are they bombing their own airport... ISIS Turks are weird","post_message":"BREAKING - #ATATURK #BLASTS:  - at least 50 dead - about 60 wounded - 2 explosions"},{"comment_id":"10153215543531519","commenter_b":"She now has to move from comedian to propagandist. Not an easy feat","commenter_a":"Last nights show was unfunny. Amy Schumer was not funny last night IMHO. She's really being pushed right now, and while I think she can be funny, there are way funnier female comedians.","post_message":"Watch: Amy Schumer crushed it on \"SNL\" last night, but this gun commercial parody might be the most brilliant short clip the show has done in years"},{"comment_id":"1417324464960761","commenter_b":"We were all originally from somewhere else. The wretched refuse remember! You know the statute of Liberty!!","commenter_a":"Remember Americans are paying for their free benefits!!!","post_message":"What do you think?"},{"comment_id":"10153589357933984","commenter_b":"Just WHAT THE HE#% IS WRONG WITH AMERICANS, just like the poor Jews in Germany, we just sit back and let all this crap happen!!!","commenter_a":"Screw you","post_message":"The NAACP just made a stunning demand about this historical monument... this is shocking move.  Nobody thought they would go this far...  What do you think about the NAACP's demand?"}]
