[{"comment_id":"930363577060209","commenter_b":"She is as STUPID as HILLARY","commenter_a":"Germany's Government \"feel good\" Migrant policy has consequences.","post_message":"CLUELESS..."},{"comment_id":"10153091862830329","commenter_b":"Some women like to be told.","commenter_a":"This world needs to stop being offended by everything, and just let people live their lives.","post_message":"A pledge email from the University of Southern California’s Alpha Chi Omega chapter published by Jezebel today shows how authoritarian the sorority’s rules are for things like hair color, eyebrow shape, and required Spanx wearing."},{"comment_id":"460222577435670","commenter_b":"Build the Wall, send all illegals home with the babies, end sanctuary cities, take care of our Vets and end abortion. Yippee!! Go Trump.","commenter_a":"Everyone like how he \"tells it like it is\"---after he becomes president and tells YOU the truth about yourselves, don't call for impeachment!","post_message":"When asked for the reason behind his recent political success, Donald Trump gave this simple answer."},{"comment_id":"10153909569808717","commenter_b":"Horrible! That poor man and his patient! Dam it!!!! This IS disgusting!","commenter_a":"The cop should be fired and imprisoned","post_message":"The caretaker was trying to get his patient back to a facility from where he had wandered: @webpagelink"},{"comment_id":"10153034720411130","commenter_b":"Biggest problem, IMO,is the black daddies who make kids then disappears.The moms are just as bad with 5 kids and 5 different Fathers.","commenter_a":"All lives matter, saying only one race matters is why there is much violence going on. Race should not factor in to it. LIFE matters period, unborn baby, elderly, black, white, or purple with pink polka dots.","post_message":"\"How many more minorities have to die at the hands of the police who are supposed to protect us before we finally wake up? How many?\""},{"comment_id":"10154641640883145","commenter_b":"Yes 3 station, back in the day....... Family time is lost to the streets now.","commenter_a":"Its sad that some ppl don't have a life n wanna ruin it for everyone else","post_message":"Over the weekend they announced the circus would end in May. @webpagelink"},{"comment_id":"553000848198682","commenter_b":"More illegals are prosecuted in the state of Florida than any other state for voter fraud. It goes on everywhere though. I agree, there should be further evidence required to prove you are a citizen. Maybe a place on your driver's license should be reserved for this information. Not only are these illegals breaking the law to come here, they are electing people like Marco \"The Chihuahua\" Rubio to be their senator. Oh, and Google: \"Rubio Gay Arrest\" to see what Rubio likes to do in his spare time.","commenter_a":"Voter fraud has been proven in tx. People voting for trump are seeing their computer vote switched to Rubio, and cruz. And let's not forget, that the kkk is backed by the democratic party.","post_message":"We are #WINNING - #TrumpTrain! Thank you for your support. Lets keep this going! WE WILL MAKE AMERICA GREAT AGAIN!"}]
