[{"comment_id":"10154219980731336","commenter_b":"Oh well....","commenter_a":"Aww. Poor things. I'm sure daddy will throw money at someone to make it happen.","post_message":"“They feel very guilty, but it’s fine.”   Donald J. Trump spoke to 'Fox & Friends' about his children Ivanka and Eric not registering to vote in the New York primary. Plus, hear what he said about choosing Ivanka Trump for VP."},{"comment_id":"10153937111420695","commenter_b":"Girl you got something to be thankful.","commenter_a":"God bless","post_message":"“Everybody at the church got up and started handing the preacher money, and it was just crazy. So many people got up. They started hugging me. It was just awesome. I couldn’t help but cry. It was just amazing,” the mom said."},{"comment_id":"10153689413136336","commenter_b":"Because 1471717696187557gallathat is not how God works in a church. If the pastor is wrong God will deal with him, it's not her place to do that. @username we don't know if he spoke to her privately & just because he rebuked her behavior doesn't mean it wasn't in love or that he doesn't love her. She may truly have been disrupting the services. God rebuked the behavior of many in the bible. The bible also says that God disciplines those he loves. No pastor is going to be able to preach in a way that makes everyone happy & making people happy isn't part of his job. He's supposed to preach the truth of God's word without compromise. His delivery can change, but the truth cannot.","commenter_a":"What kind of pastor throws out a 103 year old woman? Not even non-Christians would do this to an elderly woman. Madness. They hate her for believing the same doctrine that she learned at that church every Sunday for a century. The bible charges Christians to take care of the elderly and the widowed.","post_message":"Genora Biggs said that she and the current pastor, Rev. Tim Mattox, have long sparred over his form of preaching, which she characterizes as a \"Holiness style\" that doesn't belong in the Baptist church."},{"comment_id":"10152804418020326","commenter_b":"Another FREAKING ASSHOLE. You repeat that comment you idiot after someone rapes you!","commenter_a":"what a sicko","post_message":""},{"comment_id":"10153866356179087","commenter_b":"@username elillegal means\" elite illegal immigrants living in comfort due to free dows from Obama government, at the expense of us tax payers!","commenter_a":"LOL...Trump is a con artist...serial adulter...pathological liar...crooked businessman who preys on the less fortunate . He uses our vets as campaign props and lies about giving them donations. He funds his own businesses with his political campaign. He refuses to make his tax returns public. Be serious. Trump is the most corrupt individual to be running for office.","post_message":"Donald J. Trump gets standing ovation after saying Hillary Clinton \"may be the most corrupt person ever to seek the presidency of the United States.\""},{"comment_id":"1059407147484519","commenter_b":"She is terrible!!! She never said how she would protect us. My dog can do better than her!!!","commenter_a":"Agree!","post_message":"Eric Trump criticized Hillary Clinton's foreign policy and said it should be a requirement for Americans to watch \"13 Hours: The Secret Soldiers of Benghazi\" before voting for president."},{"comment_id":"10154269776132619","commenter_b":"What is ISRAEL SUPPOSED TO DO?????????? let the rest of the world walk all over them????? I don't think so..... If a lot more countries in the world were like ISRAEL the world would be a better place....","commenter_a":"Let's black list the UN. It needs to go. Thugs in suits.","post_message":"A push is currently being made in the United Nations to have the Israeli Defense Forces added to the blacklist of the council for Children and Armed Conflict."}]
