[{"comment_id":"10153737877981409","commenter_b":"What a jerk!!! He thought what he did was a start for his 2020 presidential run. After tonight, he'll never be elected. He shot himself in the foot and his chances for 2020.","commenter_a":"Unfortunate choice. He committed political suicide and will take the name \"Lyin' Ted\" to his grave.","post_message":"Former Trump rival Cruz met with boos during GOP convention speech."},{"comment_id":"923764651058995","commenter_b":"I've officially had it, I want Muslims in Muslim countries period not here...","commenter_a":"It was going to happen sooner or later. Might as well start it now.","post_message":"RT Khalilah Sabra: Muslims to Start a Revolution in America"},{"comment_id":"163756660695086","commenter_b":"She's unbelievable. I swear she better not get into office. WAKE UP AMERICA!!!","commenter_a":"I think Hillary is channeling Marie Antoinette.","post_message":"Hillary Clinton just landed her plane in Nantucket...   Almost immediately after people saw her, this HUGE problem went viral..."},{"comment_id":"1282426895139188","commenter_b":"Build That Wall","commenter_a":"So sad! Blue lives matter","post_message":"LIVE NOW: Procession now underway in the LA area, for an officer who died in a shooting there this morning. FULL STORY: @webpagelink"},{"comment_id":"10154444576164586","commenter_b":"I would still eat the ishhhh out of that piggy","commenter_a":"What do they expect it's part of an animal! Keep showing these disturbing photos until it makes a real difference","post_message":"This is so gross, it's no wonder so many bacon-lovers are vowing to ditch it."},{"comment_id":"10154732031694411","commenter_b":"Well you said yourself 'you feel sorry fkr iranians lving in primitive conditions ' and i drew a comparison with Saudi Arabia just to show you its worse there but you won't see that on your tv because saudi arabia is an ally of the west so western media will cover them up... the same iranians you said are living in primitive conditions, make cars, fighter jets, warships, commercial ships, helicopters and are very independent meanwhile saudi arabia doesnt even make a pen so whats primitive to you?","commenter_a":"Good to hear.. Iran and Italy are ties in a relationship against the Israeli brutalities. (Y) it seems that Iran is going to change her policy. Undoubtedly Iran is at right path..","post_message":"'Unprecedented': Maneuvers come despite several controversial incidents involving US warships in the same area"},{"comment_id":"533111413538548","commenter_b":"This idiot already built a wall and call it over taxation, high gas prices, sanctuary cities.","commenter_a":"I'll help, maybe they will leave the union. Or better yet, fire their idiot governor.","post_message":"Liberal California Governor Jerry Brown: ‘If Trump Wins, we’ll build a wall around California’"}]
