[{"comment_id":"10153177685071800","commenter_b":"Lol all these super women who, according to themselves, work so much harder.... Men work more hours, more dangerous jobs. Statistics are a bitch. The pay gap is a myth. Plain, simple. Even a feminist can see it. But yall keep pretending. Keep that victim thing going.","commenter_a":"People. It takes literally five minutes or less to find a credible publication explaining exactly what the wage gap is, and it really isn't anything in fact. It's just kind of inherently flawed, it is NOT based on men / women doing the same work but rather every man's wage and every woman's wage for EVERY FULL TIME JOB PERIOD, from waitress to business executive. It doesn't mean men are paid more automatically for being men, it just means men are generally getting the higher paying jobs (which there are legitimate sociological reasons for), OR men are more willing to do dirty / dangerous jobs that women are generally unwilling to do. So assuming of ten... Oh I don't know, sewer workers making 20 dollars an hour , eight are men and two are women, and of ten store clerks making 13 dollars an hour , eight are women and ...","post_message":"Jon: You're telling me we're going to print a human heart out of a Xerox machine before women get pay equality? Kristen Schaal: I'm telling you we're going to print human hearts out of Xerox machines 30 years before women get pay equality!    ► Jon and Kristen Schaal discuss the gender pay gap: @webpagelink"},{"comment_id":"10153760564233812","commenter_b":"Douche","commenter_a":"Well, they did turn off the steelers radio headsets, but hey it is the cheating Pats!","post_message":"With \"Deflategate\" behind him, Tom Brady was back to his unstoppable self: @webpagelink"},{"comment_id":"875517669161528","commenter_b":"Well here's the problem because of women like you these little Angel can't even make to birth how disgusting!","commenter_a":"The American dictionary says it's a human embryo, human fetus, human unborn baby. Common sense says it deserves human rights.","post_message":"Tell Congress to protect the unborn! Sign your Life at Conception Act petition today!  CLICK HERE to sign! @webpagelink"},{"comment_id":"10153155550251051","commenter_b":"Oh Erika bitch still has vagina","commenter_a":"HUGE.....SORRY ISRAEL...OUR PRESIDENT IS SETTING US UP FOR WAR....SORRY HES SUCH AN EVIL P.O.S....an i for one stand with my people an Israel....suk it obama....rot!!!!!","post_message":"Israel came out and called President Obama's nuclear deal with Iran a big mistake. Here's how they're going to respond to it. Do you agree or disagree with the idea that the Iran deal is a mistake?"},{"comment_id":"1730793227218701","commenter_b":"My dad years worked in the fields of Arizona I whent with him knights we would spent checking the water pipes it's hard work but he was a proud man I learned a lot from him the truth is they won't last a night it day in the fields they beg that's all they do lazy","commenter_a":"Yeah right !","post_message":"They wouldn't last a day!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1272820716123006","commenter_b":"Women like you make me so embarrassed for my gender! The same that screwed America with Obamacare. Truly disgusting","commenter_a":"There is a clear path of the Democratic Party to take the presidency, the house and the senate... This is the core issue why the FBI director was pressured to make the announcement... #Ihaveherback Grab them by the polls vote blue","post_message":"JUST IN: Federal investigators looking into Hillary Clinton email matter have obtained the warrant needed to start reviewing emails found on laptop used by Anthony Weiner and Huma Abedin."},{"comment_id":"976040162431405","commenter_b":"I haven't watched this show in years and don't see how it's still on the air! These women are so \"out of touch\" with the real world, they're clueless!","commenter_a":"These women on the view must b a special kind of stupid","post_message":"Thank you, Dr. Ben Carson!"}]
