[{"comment_id":"705392762974353","commenter_b":"Lol too bad she does more for this country than you ever will","commenter_a":"She's awful. She's a spoiled brat that needs attention. We need to stop giving her a second of our time and let her slither back to wherever she came from. Maybe she can go live with Heidi and Spencer.","post_message":"Newly-uncovered video proves Tomi Lahren changed her position on climate change to appeal to misinformed conservatives. SHARE to spread her shame!   Video by Occupy Democrats, like our page for more!"},{"comment_id":"10154474483213812","commenter_b":"Arrested for saving lives........?????? Your mother should have swallowed you.","commenter_a":"Why don't you take care of them too. He should be arrested for illegal immigration. Try and bring Mexicans through the US border and see what happens.","post_message":"Privately owned search-and-rescue company owned by American millionaire has saved 500 refugees and migrants at risk of drowning after only 2 days of searching."},{"comment_id":"10154084384520695","commenter_b":"Good for you. My half white, have Creek. Mother - full blooded Cherokee. . . And l saw a lot of beautiful children of all colors posted here.","commenter_a":"Why does the baby have to be white","post_message":"7-month-old Isla is darn cute."},{"comment_id":"650282881785927","commenter_b":"She is such a fool. And not even a human. She needs to be in jail","commenter_a":"Putin looks at Killary, like you are in way over your head old lady. Don't even try to match wits with me.","post_message":"Busted: Clinton News Network's \"Fact-Check\" Proven 100% False!"},{"comment_id":"10154273295026051","commenter_b":"Illegals cant vote genius, doesnt Trumps morin base know 95% of his workers are illegals working on HB2 visas ? He games the laws to get illegals to work for less money because he says he cant find experienced US workers, he thinks Americans are fucking idiots and lazy and Boy did he get that right !!","commenter_a":"Once you take all the illegals out, she will have lost the popular vote too. The electoral college was created for a reason. Should not be changed!","post_message":"Hillary Clinton continues to increase her lead in votes over Trump despite losing the election. Do you think the electoral college should stay?"},{"comment_id":"1482796298404171","commenter_b":"@username that's such a nice thing to say","commenter_a":"As an Asian non-American, I have a lot of similar feelings with people from the video. However, one thing I do not share is the that even I am not American, not born here, you still don't get to say \"go back to China\" to me. I go where I want and I came here legally. America could be more friendly.","post_message":"An editor for The New York Times wrote an open letter to a woman who told him to \"go back to China.\" Asian-Americans responded by sharing their own racist moments using #thisis2016. Here are some of those moments.  Warning: This video includes racial slurs and vulgarities."},{"comment_id":"10153268129696782","commenter_b":"$50 charge on all transfers of money to Mexico. Wall built!","commenter_a":"Since illegals sending money back to Mexico props up the Mexican economy, I would propose a fifteen percent tax on all wire transfers and international money orders bound for Mexico. That alone would pay for the wall in a short amount of time.","post_message":"Mexico won't pay a single peso to help build the bigger border wall Republican presidential candidate Donald Trump is proposing, the country's treasury secretary said."}]
