[{"comment_id":"10153739265778984","commenter_b":"No need to wonder what you are, being from Liberfornia and all.","commenter_a":"I 100% support her staying in jail until she agrees to do her job as ordered by a federal judge.","post_message":"For Kim Davis, this is Day 5 of her incarceration - but her lawyers just made an announcement that could turn things around.  Do you support Kim Davis?"},{"comment_id":"1003069729713383","commenter_b":"Can they impeach her?","commenter_a":"Don`t forget she too has her rights, if you think some one has the right to forget his or her gender then she has the right to forget her job","post_message":"Davis, who returned to work on today, told a news conference any marriage licenses issued would not carry her name, title or her personal authorization. She added she would take no action against deputy clerks who issue licenses, although she does not believe they have the authority to do so. Read more: @webpagelink"},{"comment_id":"10153992040756336","commenter_b":"This is a must read. I copied it from a post. These are things you need to know about Islam and Muslims. Allah IS NOT the same God who is worshiped by Jews and Christians. Allah is no more a God than the Golden calf of Egypt. Allah predates Islam by over a thousand years, and was a minor deity in the Temple of Baal, the Canaanite Sun God, who was worshiped throughout the Middle East. Baal (ba'al) was an ancient Canaanite and Mesopotamian deity associated with agriculture. He was believed to be the \"giver of life\" and mankind was dependent upon him for providing what was necessary to sustain the farms, flocks and herds. Allah was the moon god who's sign was the crescent moon. Mohammad, born 570 years after the Birth of Christ, was very familiar with Judaism and Christianity and stole traditions from both religions to create ...","commenter_a":"Why does Christianity need protecting? It is the dominate religion and is afforded special privileges. Christians are just upset that they don't have the right anymore to force their beliefs on others.","post_message":"Donald J. Trump spoke about protecting Christianity during a speech at Liberty University today. @webpagelink"},{"comment_id":"683878711749701","commenter_b":"By the way, good little robot response, Hudson. Care to elaborate?","commenter_a":"I've always admired Colin Powell. Mr. Powell said the Iran deal is a good deal. That's good enough for me.","post_message":"The nuclear deal with Iran risks the safety and security of America and our allies. It must be stopped. #NoNuclearIran"},{"comment_id":"376942655827362","commenter_b":"Go Back To your frickin homeland!! We did not invite you here!!","commenter_a":"Deport them","post_message":"The want to change Easter in \"Spring Break\"..."},{"comment_id":"10155002538802178","commenter_b":"Please NO MORE ! Can't stand that woman, Muted ever time I seen her appear","commenter_a":"Well hopefully I will never have to see that white haired women doing Holdings commercials ever again now that it is over. During the evening news that same commercial ran 4 times an hour.","post_message":"BREAKING NEWS: Three-term 2nd District Congresswoman Renee Ellmers has lost the Republican primary to fellow Congressman George Holding, who ran in her district after a court-ordered revamp of North Carolina's congressional map moved his 13th Congressional District out of the Triangle, according to The Associated Press. Follow the latest developments at @webpagelink"},{"comment_id":"1429758383703081","commenter_b":"Drain the swamp!","commenter_a":"If this is true the whole bunch including the Obamas need to be in prison. All the laws from the last 8 years need to be scaled back, especially the executive orders. So ridiculous that a birth certificate isn't presented before even running for president. So sick!","post_message":"You already know that Barack Obama's \"birth certificate image\" has been demonstrated to be fake. But now, the trail into the deception goes deeper, as the investigator handling the case has concluded that government officials were involved in the fraud that transformed America ..."}]
