[{"comment_id":"687214161469162","commenter_b":"Working class Americans can't & choose not to have more children then they can afford. Immigrants, illegals have as many as they want & working class pay for everyone of them, sick. Disgusting. Send anyone one assistance to the employment center. Get a job or get out. No more free ride.","commenter_a":"Yes, for sure","post_message":"This Muslim father of 11 has been receiving insane amounts of welfare for the past 10 years. He say’s the government is basically raising his children for him. Should this lazy father be cut off from all welfare?"},{"comment_id":"10152505089467434","commenter_b":"So feminism is bs cuz this guy is an a-hole?","commenter_a":"Jefferson owned slaves, Ayn Rand's life was full of contradiction ... ideas are not contingent of the righteousness of the persons life, they are objective concepts.","post_message":"A knowledge of feminism doesn't always translate into expressions of feminist ideas."},{"comment_id":"881686708534340","commenter_b":"Still doesn't eliminate the fact that your router has been hijacked.","commenter_a":"Ad Block Plus add on for Chrome and Firefox","post_message":"If you're seeing scammy ads on legitimate sites, hackers may have gotten to your router."},{"comment_id":"10153240911786491","commenter_b":"Women spend 25 percent of their lives menstruating. That is the biggest reason we spend more time in the bathroom.","commenter_a":"The only way to have bathroom equality is for women's toilets to have the same turnover rate of women coming out of the bathroom as men. Just because it's the same physical size restroom doesn't mean it's an equal situation.","post_message":"\"Many public restrooms continue to be facilities that are equal in physical space, while favoring men’s bodies, experiences, and needs.\""},{"comment_id":"1586196515000795","commenter_b":"Then duck tape her ugly ass mouth","commenter_a":"she's just another stupid liberal bitch, who doesn't deserve to live in this country. she shold go live in some isolated place, where her rants and raves can go un-heard.","post_message":"Way to go Tom Selleck. Rosie is just so rude."},{"comment_id":"10154048889111955","commenter_b":"How does Mexico treat even LEGAL immigrants? Far worse than the USA treats illegals: @webpagelink","commenter_a":"Just like in the movie \"World War Z\".","post_message":"Illegal immigrant numbers skyrocket at Mexican border..."},{"comment_id":"10154126843971254","commenter_b":"Yeah what ever and if the western woman didn't she'd be killed Mu idiots","commenter_a":"If a muslim man approached a western non muslim woman in the middle east and threw a niqab on her asking to wear it because she is in their country it would have went viral and all muslim would have been accused as extremists. We live in a world full of contradictions.","post_message":"'Our Britain, you live by our f****** rules'"}]
