[{"comment_id":"752331831534238","commenter_b":"This guy is DANGEROUS!!! USA will not be a safe place if this ass hole wins. countries like RUSSIA! Will declared WAR on USA. He is thinking to pressure MEXICO to pay for a wall base in WAR!!! Mexico has many ALLIES! WWIII Don't make a bad decision people!","commenter_a":"He is the devil","post_message":"Watch Trump directly contradict himself — watch more here: @webpagelink"},{"comment_id":"10153093946344205","commenter_b":"Illegals idiot","commenter_a":"He realizes that Mexicans aren't the only immigrants in America, right? Over half of Americas population would be kicked out if he tried to do that, and that's only recent immigrants. If you wanna get technical, the only people that aren't immigrants are Mexicans and Native 741915279236631s. They were here first.","post_message":"Donald J. Trump's detailed and foolish immigration plan explained."},{"comment_id":"10152774860755927","commenter_b":"Is this wife beater and Obama DNA guzzler still relevant?","commenter_a":"The question is does Reid understand the U.S. Constitution? He should not try and put pressure on the Supreme Court. Reid is a pathetic old ugly man. He is mean and unhappy in life. Can't wait till he is standing before his Maker. Won't be a pretty sight for sure","post_message":"WATCH as Senator Harry Reid maligns the U.S. Supreme Court on forthcoming Obamacare decision "},{"comment_id":"659659264197547","commenter_b":"We all know why he said this... Statistically speaking illegal immigrants will vote Democrat.. This is another reason why they do not want voter ID... It is not racist to want voter ID... everyone carries an ID.. Again a narrative from the left, In 10-15 years will we will be a one party country... We will also have a single-payer system, so get in line and prepared to wait for your doctor because you are now dealing with the government which is like dealing with the department of motor vehicles.. We will also have 500,000 more Syrian refugees in this country, A pay for play with Soros, she is a puppet for him... All of our tax dollars will have to pay for these refugees and all of the entitlement programs, along with all of the illegal immigrants in the country currently... We are on our way to socialism, open ...","commenter_a":"Well, in the next three days you will see our crooked media , led by CNN and NBC , run all the dirt they can dream up on Trump and absolutely nothing negative on Hillary despite all the information. It's our last chance to get rid of corrupt Washington insiders like the Clintons. VOTE TRUMP !!!","post_message":"***SHOCK*** Days before presidential election, Obama is openly and blatantly thumbing his nose at the rule of law that governs American elections..."},{"comment_id":"945163755529692","commenter_b":"The teacher needs the bag a brown bad cause she butt. Ugly","commenter_a":"What the hell","post_message":"An after-school elementary teacher is accused of putting a plastic grocery bag over a child’s head until he could no longer breathe: @webpagelink"},{"comment_id":"10154894938720295","commenter_b":"Victoria bc watching","commenter_a":"I see it","post_message":"We're on baby watch again! Will today be the day that April the giraffe gives birth? Thousands of people have been glued to this video for days, waiting for any sign of her calf!  (Video courtesy: Animal Adventure Park)"},{"comment_id":"10154456636350695","commenter_b":"@username - you sir have won the internet today! That is hilarious!!","commenter_a":"What didn't this guy do during the rampage? I'm sure we're gonna hear he saved 15% on his car insurance next.","post_message":"NEW: Authorities say the shooter texted his wife while he was hiding in a bathroom, asking if she'd watched the news..."}]
