[{"comment_id":"10152899941331336","commenter_b":"Sick woman","commenter_a":"This young lady will burn in her afterlife.","post_message":"A New Jersey woman who authorities say put her newborn baby in the middle of a road and set the child on fire was charged with murder."},{"comment_id":"10153447709650667","commenter_b":"If this would ever happen to my mom. I would make room so she can live with me.","commenter_a":"Good just because your old , you still have to follow the rules . If they make exemptions based on age that would be discrimination .","post_message":"“I have four grandsons, but I don’t want to be dependent on them. I can’t be a burden to my family. They don’t have room for me. That happens in life.”"},{"comment_id":"10153974696736943","commenter_b":"Double talk.!","commenter_a":"This is how you stand for law in government?","post_message":"Wednesday, June 01, 2016 Judicial Watch Director of Research and Investigations Chris Farrell appeared on\"America's Newsroom\" on Fox News Channel to discuss the latest developments in the depositions of Former Secretary of State Hillary Clinton inner circle regarding her use of private email while serving at the State Department."},{"comment_id":"10156674955065354","commenter_b":"Win by selling out our principles ? No way .","commenter_a":"Trumps campaign has been a wrecking ball for the conservative movement . Fox News was once our most dependable news outlet , it wasn't perfect . National Review use to be a respected magazine for conservative ideas , now there being attacked . Good conservative candidates such as Rand Paul , Rick Perry , Ted Cruz all now being attacked not by the liberals but by the GOP front runner . Good job trump you did more damage to the conservative movement than the liberals ever could","post_message":"***What happened to Fox News?***  “What would a conservative network be doing giving time to Michael Moore? Why would New York Times and Washington Post reporters be on the air to give opinions on a conservative network?” Limbaugh asked. “This is what peope are saying out there.\""},{"comment_id":"10154004178307452","commenter_b":"Oh, but still lol what a sick hoe","commenter_a":"Her Bfs ex girlfriend is mad @username","post_message":"A Redlands woman woke up to a gruesome discovery when she walked out her front door to find pigs’ feet, fish heads and other animal parts scattered across her doorstep."},{"comment_id":"10153730476318145","commenter_b":"Lol Hilary is a f** murderer and needs to rot in a prison cell.","commenter_a":"I never thought I would say this but I really hope Hilary wins !! Republican Party has become a freaking joke !!","post_message":"#BREAKING: Former presidential candidate Dr. Ben Carson will endorse Donald J. Trump, the real estate mogul said. Watch Channel 9 Eyewitness News at Noon for details and a recap of the GOP debate."},{"comment_id":"10153608463849440","commenter_b":"You are so uneducated, illiterate and pathetic. Worthless. Parasite. A rodent of no worth or accomplishment.Stop #WhiteGenocide 14/88","commenter_a":"Colorado is the epicenter of #WhiteGenocide and the GOP here is allowing it because they're afraid of calling Amy E. Brown and her #Blacklivesmatter5280 terrorist friends out.","post_message":"Editorial: Colorado Republicans made a big mistake in abandoning the 2016 presidential caucus."}]
