[{"comment_id":"10153396293173525","commenter_b":"@username, yes I do know that. It has never happened despite 45 of 50 states allowing open carry, and some that have NEVER PROHIBITED it since they became states. No open carrier has ever been \"taken out' by a criminal.","commenter_a":"Kinda think it's dumb. Makes you a target basically. Someone will see ur gun and be like let me take them out first... Ya kno... Element of surprise is better.","post_message":"OPEN CARRY: The same law that's being proposed here in Florida just went into effect in Texas, and to celebrate, several groups rallied at the State Capitol carrying their guns.  STORY: @webpagelink"},{"comment_id":"10153185044695950","commenter_b":"And without reading anything, you're a jealous dumb girl who don't know kids are kids.","commenter_a":"Yeah except when you read his school behavior record you realize he's a little shit.","post_message":"Ahmed Mohamed attended Astronomy Night at the White House last night, where he met scientific stars, astronauts and President Obama. During his visit, he had a chance to chat with the president, passing along a valuable lesson: \"...You shouldn't judge a person by what they look like. You should always judge a person by their heart.\""},{"comment_id":"10153063364393188","commenter_b":"Idiot and hypocrite. So he says he was a solider.","commenter_a":"He's a traitor and needs to be deported immediately","post_message":"Really?"},{"comment_id":"10153498336211955","commenter_b":"Why would anyone go? Build the freaking wall.","commenter_a":"Are they trying to raise money for the wall?","post_message":"MEXICO ORDERS TOLL TO CROSS IN"},{"comment_id":"969391529750304","commenter_b":"Even a whore has the right to decide when she has sex!","commenter_a":"Following a celebrity back to their hotel room doesn't make you ambitious. It makes you a whore.","post_message":"This is the side of the Bill Cosby rape scandal that hardly anyone is talking about  but everyone should."},{"comment_id":"10153850699096955","commenter_b":"She got too big for her britches!!","commenter_a":"All of you hating on Kelly now, probably liked her before she decided she doesn't like trump.","post_message":"SCALIA'S SON BREAKS SILENCE"},{"comment_id":"10153732980425530","commenter_b":"wow this is news someone reports to Jury duty and they also have a book what a novel idea, I haven't done that at least on 3 separate occasions.....oh wait I did......what people consider news now a days is idiotic.","commenter_a":"Kate Crispignani","post_message":"Kid Rock showed up to jury duty this morning along with a paperback book to help pass the time."}]
