[{"comment_id":"997942853639367","commenter_b":"Shut up ! this is ridiculous ! I refuse to allow illegal immigrants to pour into this country.","commenter_a":"Yes","post_message":"Seattle Mayor Murray, officials and advocates are holding a press conference in response to President Trump's executive orders on immigration.  Do you think Seattle should remain a sanctuary city?"},{"comment_id":"10153505225891615","commenter_b":"These two are animals !!!!","commenter_a":"From that shiner, I wonder if our esteemed and trusted servants might have exacted a little street justice... Nah - THATS ILLEGAL!!!!!","post_message":"Shocking testimony reveals new details about the Uniontown toddler who was only 10 lbs at the time of her death. WPXI Cara Sapida is in court right now.   TONIGHT AT 5: Cara shares the disturbing testimony from an ER doctor and state trooper about the day little Lydia died."},{"comment_id":"10150755194664999","commenter_b":"Are you suggesting women become prostitutes?","commenter_a":"Domestic housekeeping is correctly dismissed as being of economically minimal value, because in the free labor market performing these tasks for others (child care / babysitting, housecleaning, short-order food preparation) are low- (or no-) skill jobs that are either minimum-wage, or \"under the table\" cash-based work.","post_message":"\"We need to call work what it is — work — whether you do it at home or whether you do it out in the labor force, and then give men and women options to choose what they want to do.\""},{"comment_id":"1150215321713025","commenter_b":"Yes and I only saw a women that look drugged","commenter_a":"YES YES YES! Are you guys blind. I only saw a pathetic man sniffing,drinking water, making faces. acting like the idiot he is. Never answered a question. Talked about himself. Never said what he would do as president. Next to him stood a confident women who answered questions, with plans for our country future.","post_message":"Would you like to see Hillary Clinton win big this November?"},{"comment_id":"10153883413908797","commenter_b":"Wayne if weren't a firefighter then don't offer an opinion you don't know anything about, the twit woman had it coming!","commenter_a":"They didn't have to do it. .could've went over her car and just give her a ticket","post_message":"DRASTIC MOVE: Look close. That’s Yasmine’s car. The windows are smashed and a fire hose has been pulled through it. Firefighters say they had to do it to get to a house engulfed flames. And they point to what Yasmine did just minutes earlier as the reason. Do you think she has any right to complain?"},{"comment_id":"1825547344399892","commenter_b":"Guess what? They don't want her in their sh*thole!","commenter_a":"Please stop telling them any different! We don't want them coming here!!","post_message":"More liberal condescension and arrogance."},{"comment_id":"10154744279541323","commenter_b":"ooh, you bitch you. i wouldn't invite you to your own funeral","commenter_a":"Hillary looked like she could use a shower and some crayons when she slithered out from under her rock last night.","post_message":"\"None are without controversy.\""}]
