[{"comment_id":"1297864100266083","commenter_b":"She is yuck. Big mistake!","commenter_a":"Lmao!!","post_message":"Well.   OK."},{"comment_id":"10150859556744999","commenter_b":"Did she calll Monica Lewinsky ? It is only a mediocre actress and above is false as it was her husband","commenter_a":"Only in America is it possible that the president of the state --otac son candidate second son, husband and wife ..","post_message":"President Barack Obama: “We’re going to carry Hillary to victory this fall, because that’s what the moment demands.”  More photos: @webpagelink  Photo: Doug Mills/The New York Times"},{"comment_id":"10152829564776770","commenter_b":"Go home Clintons","commenter_a":"Bullshit cover up","post_message":"Hillary is secretly a great person, says Clinton campaign"},{"comment_id":"1767897086815216","commenter_b":"Stfu u dummy","commenter_a":"She has to be on drugs and was coached for the interview. There is way more to this story. I've never had a cop pull a gun on me when I was pulled over for a speeding ticket.","post_message":"WATCH: ABC News EXCLUSIVE: Woman who live-streamed boyfriend shot by police in Minnesota shares her story: @webpagelink"},{"comment_id":"1047364981986697","commenter_b":"I'm sure you told her she could take as much time off as she needed. With pay. Heck, you probably promised her time and a half pay while she was on leave. Extra Holiday pay. The Government will start a college fund for the little toddler, paid for by the 1%. Free daycare too while mom runs errands. Don't even bother going back to work until the kid is in college, we'll still pay you. Anything else?","commenter_a":"I agree with Hillary, it IS time for a women President, just NOT her!","post_message":"An expectant mother in Iowa asked: What are your plans for parental and maternity leave?"},{"comment_id":"1868657266690469","commenter_b":"Talking about Melanie trump class haha she need a pole and dancing,center for the entertainment industry.","commenter_a":"She is such a beautiful person, so graceful and such class she brings to the WH, something g we Havn't had in several years.. What a great change","post_message":"Michelle Obama doesn't think Melania is fit to serve as First Lady.  'LIKE' if she's WRONG!!!"},{"comment_id":"10154600253629170","commenter_b":"All the hildebeast fears is losing the election and facing her well deserved comeuppance .","commenter_a":"The FBI said that she had no intent when she broke the law, but Trey Gowdy said in the documents they received from the FBI, that there were no questions to probe if there was any intent. No questions of why, she had a private server. No questions at all, to prove intent. Sounds very fishy. They ( the FBI) just threw that in, ( No intent ) to get her off , from all the crimes that she committed","post_message":"The one thing she fears the most."}]
