[{"comment_id":"10153760564233812","commenter_b":"Douche","commenter_a":"Well, they did turn off the steelers radio headsets, but hey it is the cheating Pats!","post_message":"With \"Deflategate\" behind him, Tom Brady was back to his unstoppable self: @webpagelink"},{"comment_id":"633829223459429","commenter_b":"Stupid stupid girl , the more she talks the dumber she is .","commenter_a":"Do they have no parents","post_message":"From American AF - AAF Nation...This is what's wrong with society TODAY!!"},{"comment_id":"1053111538057600","commenter_b":"Both of these mooches need to get out.Better make sure they don't steal anything, like clinton did when she left the whitehouse.","commenter_a":"She looks bored big time.","post_message":"I agree!"},{"comment_id":"521952154659744","commenter_b":"When pigs fly, I'll believe it when I see it!","commenter_a":"Thank you for finally thinking of Americans and our safety !","post_message":"BREAKING..."},{"comment_id":"1148491358514249","commenter_b":"She would not make a good POTUS. She ran HP into the ground.","commenter_a":"I have thought the same thing about Carly Fiorina. I like her and believe technically she might make a good president. But she has a \"look\" about her, not about beauty or sexiness, but a look like she's been hurt badly sometime in her life and is going to have a nervous breakdown at any minute. Leadership also relies heavily on appearance and Ms. Fiorina's \"look\" just isn't motivational. It's almost all about appearance...when is the last time you've seen a multi-million dollar preacher that looks like he/she just lost their puppy? This country is going to need vitality to rebuild itself and she does not project that; FDR would not be photographed in his wheelchair and people still talk about Jimmy Carter's preacher look. We need and I haven't seen anyone that \"appears\" to resemble him, except maybe Sen. Marco Rubio, and only somewhat, a JFK.","post_message":"Trump was watching a newscast when a video clip zoomed in on rival Republican 2016 candidate Carly Fiorina. \"Look at that face! Would anyone vote for that?\"said Trump."},{"comment_id":"10153368528042217","commenter_b":"i might put some tinfoil hats on eBay...","commenter_a":"if this crap conspiracy rubbish was true, the yanks would of asked us to extradite him, which we would have done. its that simple.","post_message":"A UN panel will conclude the Wikileaks founder is being \"arbitrarily detained\" in the UK, the Swedish foreign ministry has said."},{"comment_id":"10157152900750206","commenter_b":"I was with the writer until he called Manziel \"talented.\"","commenter_a":"Who cares!! He's a spoiled little brat that had everything handed to him. he has no class and a horrible role model for our youth. He shouldn't even be in the NFL..","post_message":"The football player's own father said, \"I truly believe if they can't get him help, he won't live to see his 24th birthday.\""}]
