[{"comment_id":"1048601445225209","commenter_b":"I know... she has effectively modeled pant suits for old bags of dirt","commenter_a":"So tell me and please be honest what has Hillary done for America like a policy or a law or something that has benefited us you know she's been in politics for over 25 years been the first lady and a senator and Secretary of State what actually has she done for us and don't use her as an example.","post_message":"What our president says matters. We can't let Donald J. Trump's hateful words speak for us."},{"comment_id":"10153324707666336","commenter_b":"Hillary 2016! Go USA!","commenter_a":"Welp, if rand does not win the nomination I'll be voting libertarian. Good luck","post_message":"Breaking News: A bill that would allow key government surveillance programs to resume for now – after they were temporarily suspended Sunday – has cleared another hurdle in the Senate and is headed to the president's desk. @webpagelink"},{"comment_id":"10154353544894228","commenter_b":"Middle aged white ladies also have much less to fear now don't ya? Or was there a string of incidents where the police killed a group of white women I didn't hear about? Common sense...","commenter_a":"I was always when pulled over by the police to put my hands on the steering wheel (10 & 2) until the officer approached you and asked for your information. Common sense people.","post_message":"The victim's name is Philando Castile"},{"comment_id":"1004322553035851","commenter_b":"Great point. Now- ALL women use shame to enforce social order among women, and men when they can get away with it. Men are the same with violence. ALL men. (And towards women when they can get away with it) Here a white women leveraged racism to solidify her place in her social order at that time. (The black male victim suffered death for that.) When enough white males clue in that women leverage \"male\" state and personal violence to enforce their own wishes, black lives will be saved.","commenter_a":"Female privilege. Didn't you know?","post_message":"Why Did Tyson Wait So Long to Reveal Carolyn Bryant Donham Lied About Emmett Till's Murder?"},{"comment_id":"10154075062351037","commenter_b":"And she banged Frank enough to make Dutch jealous, and to tell him to eff off. 😘","commenter_a":"one classy Lady that loved her husband and her country","post_message":"“She totally saw her role as supporting and defending her husband.”"},{"comment_id":"10153644186381336","commenter_b":"If our courts allow Muslims who demand to be tried under Islam law, to actually be tried under Sharia law - why can't Christians demand be tried under Christian Biblical law? Courts allow it for Muslims. This raises a constitutional question - Under the 'Equal protection Clause' of the 5th and 14th Amendments, should Christians be afforded equal protection under the law - to be tried under Biblical law equal to Muslims demanding to be tried, and their case(s) adjudicated for crimes under Sharia law?","commenter_a":"Why can't another clerk do it ??? Problem solved !","post_message":"“Some people have said I should resign, but I have done my job well,” Rowan County Clerk Kim Davis said in a statement."},{"comment_id":"10155244013599384","commenter_b":"We the American people deserve to have accountability for all elected officials from all branches of Government!","commenter_a":"Thank you, @username, for doing your part in bringing this situation to light. I want nothing less than a full, thorough investigation of all possible inappropriate ties between Trump administration officials and foreign powers. Pursue this to completion, wherever that leads. Thank you again.","post_message":"Mike Flynn’s resignation was a step in the right direction – but there are many more questions that need to be answered before we can fully understand the relationship between the Trump Administration and Russia. Tune in now to watch my press conference on the topic live:"}]
