[{"comment_id":"10153411890906167","commenter_b":"Nah. Satan and the Mrs, would have had an abortion before bringing this creep into the world. ;)","commenter_a":"the son of satan.","post_message":"Troy Newman's views are so extreme that, as The New York Times reported in 2015, Australia cancelled Newman's visa over \"concerns that he might encourage violence against abortion providers or women seeking the procedures.\""},{"comment_id":"10153805659416167","commenter_b":"For some reason I don't find the position of first lady (as you put it) as important as President. He cheated on his wife, maybe you've never done that, but there's many people ou t there who have cheated on their significant others. Not saying it's right of course, but the other presidential candidate cheated on his wife(s) also and I know the Republican's like to compare other political people when they're accused of something. Look at Trumps wife and her past. Do you really think she should be living in the White House? She's not even from America. Not that I think that's a good enough reason, but I know how you Republicans feel about immigrants. If you look at the naked pictures of her you may also feel she doesn't belong in the White House for that reason. Not that I think that's a good enough reason, but ...","commenter_a":"IMAGINE if you can...a useless, disgusting, nasty, corrupt, rapist, POS perverted woman abuser as our 1st Lady...Billy the perverted Clinton!!!","post_message":"Good grief. Uhh Joe why are you just mentioning this now?"},{"comment_id":"1303084943055048","commenter_b":"And I would make the vandal pay for it too!","commenter_a":"Looks better like this.","post_message":"Donald J. Trump just got hacked."},{"comment_id":"1023389334348744","commenter_b":"freaking australia","commenter_a":"How so they come up with 95 millions years?","post_message":"This bizarre species of shark is thought to date back at least 95 million years."},{"comment_id":"650058555184723","commenter_b":"If they prove he's here under false terms. He an illegal. Hell yes deport him. Send him 2 where he could B put in jail. What a smear on the face of America.","commenter_a":"Would be great if this were true & a Blessing to the USA.","post_message":"Obama to be removed this country after justice department lawyer does this.  Get rid of him. He doesn't deserve to stay in this country.  Do you agree Obama should be deported?"},{"comment_id":"10156047259680231","commenter_b":"Kayne and Wiz are dirty whores!","commenter_a":"How you gonna forgive someone for you being a hoe? js","post_message":"Rose broke down in tears while talking about her exes during the SlutWalk she organized."},{"comment_id":"10152998251641045","commenter_b":"She should not be allowed the 10 as pets! Remove all the animals! What if those 10 are someones pets!","commenter_a":"Did she also house cats? I haven't read of any being there, but I wondered what happened to them if there were. Being that she was acting as a shelter for the county there should have been.","post_message":"The ASPCA's disaster response vehicle is now on site in Lawrence County to help remove more than 250 animals from the shelter. Police continue to guard the entrance, admitting only those who are helping with the investigation or caring for the animals."}]
