[{"comment_id":"1123039051096182","commenter_b":"@username Y u so MAD!","commenter_a":"Everyone who verbally attacks BLM are silent supporters of the kkk!! Show me why u hate BLM so much. Show us pics of the smiling around a dead white person or any other ethnic groups body!!! U can't so fuck u","post_message":"Lol: #Virginia #police pulls a woman over for driving without an ice cream cone!  #WSHH"},{"comment_id":"10153058361321770","commenter_b":"She is a loser !","commenter_a":"I'm sorry Hillary just wasn't natural, it was forced. That being said the bill was funny.","post_message":"Hillary Clinton made a “spontaneous” campaign stop with an appearance on Saturday Night Live. She even mocks Donald J. Trump.  @webpagelink"},{"comment_id":"1284514134973476","commenter_b":"CJ 😂","commenter_a":"Eric Sylvain 😂😂","post_message":"It really be like that  #WSHH"},{"comment_id":"10153902259248855","commenter_b":"She will","commenter_a":"Can only hope it won't look like don't ask don't tell","post_message":"Will she follow through?"},{"comment_id":"10154789649578256","commenter_b":"@username. Does a strong woman and her opinions scare you?","commenter_a":"This just makes me laugh at how low the democrat communists have slunk.","post_message":"Donald Trump knots his ties so that they hang well below his belt buckle — often several inches, a fashion-don't so egregious that GQ recently used it as the subject of a photo spread titled, \"The one style lesson you can actually learn from Donald Trump,\" columnist Eric Zorn writes."},{"comment_id":"1131317030222640","commenter_b":"Nice trolling bitch.","commenter_a":"If I want my kids taught fairy tales I will send them to church. As a Louisiana resident this does not come as a surprise.","post_message":"This is appalling."},{"comment_id":"932489970229038","commenter_b":"Nothing compares to what Bill Clinton did as Gov of Ark, and in the White House with Monika Lewinsky and other women..same with John F Kennedy, with Marilyn Monroe, and mistress of a Gang boss, and nude swimming parties. They both dis honored our White House...where was the media..and why were they voted in twice...","commenter_a":"I agree! Mr. Trump has changed in the past 11 years but Hillary Clinton has not except for the worst!!","post_message":"Dr. Robert Jeffress, Senior Pastor of the First Baptist Church in Dallas, Texas, stated that he still supports Donald J. Trump, despite the GOP nominee's controversial 2005 comments."}]
