[{"comment_id":"10153667597986770","commenter_b":"She belongs in prison!","commenter_a":"Prison","post_message":"Hillary Clinton thinks she should be president. But does she really belong in prison? @webpagelink"},{"comment_id":"10153099972135329","commenter_b":"Nah, I don't think I will.","commenter_a":"Someone needs to give him his balls back.","post_message":"BuzzFeed Books editor Isaac Fitzgerlad wore makeup for a week, here is what he learned."},{"comment_id":"845673835565796","commenter_b":"@username - As usual, the liberal fails to consider the unintended consequences of their actions. Transgenders make up only .3% of the population so the threat from them is minimal. The threat from perverts who will abuse this decision to commit assaults will far outnumber the Transgenders who simply want to go pee. It will be the innocent among the majority of Target's customers that will face the consequences of Target's liberal, feel good decision.","commenter_a":"Well I guess my kids will not be using the fitting rooms. I to will be reconsidering using their bathrooms and even shopping there. This country has lost it's damn mind!","post_message":"Are you kidding me?!"},{"comment_id":"216170728787107","commenter_b":"She is a dried up piece of human flesh!","commenter_a":"This is a crazy idiot sue her but her out of business","post_message":"The heck!"},{"comment_id":"10154532123498271","commenter_b":"Oh, you're so compassionate from your suburban home, Kim. Here's to hoping they move in next door to YOUR family.","commenter_a":"So green card holders and those with dual citizenship are our enemies? And regardless of that, these people, they are us. We or generations ago of us were standing on this land as immigrants. They are us.","post_message":"\"This is not about religion - this is about terror and keeping our country safe,\" says President Donald J. Trump in new statement.   @webpagelink"},{"comment_id":"10154018245628352","commenter_b":"Why kill the woman?... Just get a divorce and carry on with your life idiots!!!","commenter_a":"he was lying to her crazy ass....","post_message":"‘I want you so bad – if only someone was out of the way': Chilling texts Army medic sent to his mistress weeks before his wife was found murdered"},{"comment_id":"10154925152646320","commenter_b":"Omg bottom left woman.. I hope after seeing her fkn face she would stop doing drugs !!","commenter_a":"Dam, they should've left Tiffany Dawn Evans alone. If that girl can make money from sex, cudos to her.. poor thang!","post_message":"Almost a dozen people in South Carolina were arrested on prostitution charges. Some of them were also charged with drug-related offenses...  @webpagelink"}]
