[{"comment_id":"934086226709659","commenter_b":"Put more women in your cabinet!","commenter_a":"I AM MY SISTERS VOICE VOTE DEM :::::::::::REVELATION 21 = THE TWO ARE ONE = TWO TRUMP AND WALKERIGHT ONLYESATANACYES <DID 911 SATANACYESEENTHREE THE FATHER THE SON THE HOLYESPIRIT <<< THEY DID IT NY INDYESHUALLHEARTRUTHEART:::::KY DC = DOVESON CHRIST < TRUE IN THE FLEASH CAME ON THE 3RDAYESON ROCKING < THE TRUTH USABLE <++++}:::::::::::::::::::::::::::::::>ART<:::::::::::::::::::::::::::::::{+++>:<>","post_message":"Born five years before most women could vote in America, Shirley has lived through the Great Depression, two world wars, the Civil Rights Movement, and the moon landing. Today, she’s rooting for something she never thought she’d live to see: the first woman president of the United States."},{"comment_id":"985288268192005","commenter_b":"she looks like the Queen of Qualudes.","commenter_a":"Or if she is in jail","post_message":"The Democrat Party WILL NOT let Bernie Sanders be the nominee – no matter how many States he wins, how many delegates he has or an other reason.   Watch this and tell me if you agree:"},{"comment_id":"997885863556217","commenter_b":"LOL -like a woman has time for that","commenter_a":"That was a woman who was all masked up","post_message":"The clinic staff say they aren't going anywhere"},{"comment_id":"1147448235275205","commenter_b":"Isn't it wonderful how they know everything even you personally. The caps are supposed to be gone according to gore. You can go to nasa and and other gov weather sites and look at the charts. There is nor a warming trend. But when they don't know just guess the insult. Just shows there ignorance","commenter_a":"Climate change happened with or without fossil fuel use. Isn't that interesting?! Well unless dinosaurs and such drove gas guzzling SUVs","post_message":"\"The message to society is clear: Prepare now, or be prepared to face the consequences.\""},{"comment_id":"10153898357108984","commenter_b":"@username - there is a huge difference between then and now regarding \"camps\" and rounding up people; if the refugees were peaceful, they have proven otherwise, but if they were- they would not be in \"camps'- we didn't round up the illegals and place them in camps- the only reason they would be in camps now: time to be thoroughly vetted before allowing them among the citizens in America. Reasonable- yes.","commenter_a":"It seems as though the Founding Fathers knew something like this could happen, and in the Constitution under the 9th, and 10th Amendments gave each State the right to Sovereignty. State's that \"believe\" in the Constitution should be able to break away from those that want excessive government control, and socialism! the de-centralization of power is essential to the preservation of \"Freedom\", Washington has no more right to control us than London does. There is a reason we are defined as \"States\", and not Provinces. we are sovereign state with our own constitutions. Our union was formed as an agreement between the States. Texas itself made it part of the agreement to join the union that they could leave at anytime. America was founded as a Confederation. Abraham Lincoln destroyed our states rights. I can assure you that Washington will not hold us together by force should we choose to ...","post_message":"One state is taking the refugee crisis seriously, and they're now making a huge move to send in the National Guard.  Obama may be able to bully other states, but this one's not having any of it.  Time for the rest of the states to follow their lead!"},{"comment_id":"966202806772801","commenter_b":"#dumbasses","commenter_a":"Robbie Raul Markosyan","post_message":"Kate Upton among scores taking part in #HoldACokeWithYourBoobsChallenge for breast cancer... unaware the trend ISN'T raising money"},{"comment_id":"549880968533529","commenter_b":"The ones who say they are refugees are young muslim men . I never see women or children in the pictures. This is what obummer wants to bring to America.","commenter_a":"It's funny how you people think all Muslims are bad, but I never heard you talk about all the Muslims in California who raised over 200k dollars for the victims of the San Bernardino shooting. Or what about the Muslims in Africa who protected Christians from getting shot on a bus.","post_message":"This makes me SICK!!!"}]
