[{"comment_id":"10157399464465093","commenter_b":"A hun will never kill anyone! Its the people that use them! People kill people! Criminals get them illegally and you can't stop that! It is not possible! Give me a reason why you think criminals should only have guns?","commenter_a":"Yes but 100% of gun crimes involve guns, so start with the legal gun owners because it's way easier, and it looks like we're doing something.","post_message":"Pass it on."},{"comment_id":"10153530679413984","commenter_b":"I hope she gets jail time!","commenter_a":"Some beasty mom will kick her face in I'm sure. As a Juvinal little will happen to her in our current legal system.","post_message":"The extremely disturbing video of a young girl brutally attacking a schoolmate who was holding a small child went viral, now the attacker is facing some serious consequences...  Are you hoping justice is served?"},{"comment_id":"1277154398974272","commenter_b":"How does she keep getting elected ??","commenter_a":"Liberal Ass Clown","post_message":"Remember that time Nancy Pelosi reassured us that Obamacare was going to be \"affordable?\""},{"comment_id":"1190463677676992","commenter_b":"Immigration laws are not being in forest because it only applies to legals and not illegals. It's time to make stronger laws and strongly in force them. Also illegals shouldn't be given drivers licenses or any form of ID until they become American citizens.","commenter_a":"The way I see it is this, if people come here and they are illegals SEND THEM BACK TO WHERE EVER IT WAS THAT THEY CAME FROM, the next step is build a wall that's high enough with barbwire around it so they can't try anything","post_message":"Do you agree?"},{"comment_id":"1663378140627092","commenter_b":"wow cant wait to see u guys in 10 years w ur sugar daddy/ies, and ur lavish lifestyle its gonna be great","commenter_a":"@username time to sign up😂","post_message":"This summit actually teaches young women how to score a sugar daddy..."},{"comment_id":"10154375945924749","commenter_b":"The man is a afgan veteran , a marine and a Muslim. I am a Hindu and I know , Imran name does not exist in us.","commenter_a":"Two Muslim brought up in America one killed 50 and the other saved over seventy, both are Muslim , it is not Islam, it is the illness inside each of us.","post_message":"Imran Yousuf decided to “take a chance” and it paid off."},{"comment_id":"10152933531687434","commenter_b":"Sex is only for straight, married, rich people!","commenter_a":"It's like they WANT teenagers to have babies. No sex ed, no planned parenthood. Since we know abstinence only education does not work, what else can we take from this?","post_message":"“If they’re doing such a great job, why aren’t these things better?” Bobby Jindal asked of Planned Parenthood."}]
