[{"comment_id":"10152715652847293","commenter_b":"Way to bury your head in the sand. Typical liberal","commenter_a":"we have chosen not to see the film because we don't support war/killing...either way, the good thing is it got people thinking/talking...or, at least, trying to talk/think...","post_message":"Regardless of what Bradley Cooper wants, his movie American Sniper has become political."},{"comment_id":"10153876506189726","commenter_b":"Alas, McCain's time as a politician has lasted too long--- in fact, it was too long the day he took office.","commenter_a":"Tell McCain to shut up","post_message":"WATCH: John McCain Has Doubts About Ted Cruz's Citizenship"},{"comment_id":"1079865505382241","commenter_b":"This video is retarded. Women aren't funny.","commenter_a":"Adam Isaacs","post_message":"There's an absurd stereotype that women aren't funny."},{"comment_id":"10152865678521336","commenter_b":"Christ is the answer for the muslims !!","commenter_a":"All muslims are either radical or they support it ! they follow the qoran and that is what the qoran teaches !! their leader was a pedifile and mass murderer !","post_message":"\"I think we should cut out the political correctness. This is Islamic extremist terrorism. It is not the entire Muslim religion.\"  Former NYC Mayor Rudy Giuliani said President Obama appeared weak for describing Wednesday’s deadly terror attack in France as \"senseless violence of the few.\" @webpagelink"},{"comment_id":"10156418546700354","commenter_b":"Obama would leave the citizens help to protect their selves just like what happen to Paris.","commenter_a":"Isn't that what Carson said and he got chastised","post_message":"This is slated to air tonight on \"60 Minutes,\" and it's going to INFURIATE liberals..."},{"comment_id":"10153220581496336","commenter_b":"And the rap sheet of those deceased are mind blowing. Sad to be in A profession where u care so much but the ones u protect care so little.","commenter_a":"A bad situation when police are persecuted for doing their jobs. The whole force should resign. I would.","post_message":"The booking photos of the six Baltimore police officers charged in the Freddie Gray case have been released."},{"comment_id":"1345056415554103","commenter_b":"Parents fault? No, it was the sick pervert who raped her fault!!","commenter_a":"What the hell is a 13 year old child doing on a beach at 02 in the morning Even if her brother was with her The child should have been at her home in bed How could her brother let her out of site I just hope they will be able to catch the guy And made him pay for what he did to this young girl","post_message":"She lost her brother before she was attacked."}]
