[{"comment_id":"1204140369633795","commenter_b":"Did Queen Elizabeth die and they forgot to tell us about it? Holy hell had busted out all over England and some muslim dude is acting like the king! What's up England?","commenter_a":"Dear God, what will happen next? Aren't things crazy enough?","post_message":"Yes, this is real..."},{"comment_id":"1723610494573092","commenter_b":"Thanks a fucking lot to the woman who decided to skip her period and have this douche","commenter_a":" Marihuana is not physically addictive, but isn't pshycologically just as dangerous!?! Just because one bad and dangerous thing(alcohol) is legal - does not mean that legalizing another is a good idea!!!","post_message":"Alcohol is 114 times more deadly than marijuana.  Like ATTN: on Facebook."},{"comment_id":"893350990721431","commenter_b":"She's not getting my vote","commenter_a":"Go Hillary!!! :)","post_message":"All across the country, people are working hard and making plans for their futures. Hillary is getting started too. Be a part of her campaign from the very beginning:"},{"comment_id":"10153772356976323","commenter_b":"Fuck off cocksucking bitch","commenter_a":"There is no climate crisis. It is a hoax of liberal desperation. There is however CYCLICAL climate changes.","post_message":"The fate of 70 million people rests on what happens to the Mekong river. Featuring extraordinary and beautiful drone footage of south-east Asia’s vast waterway, this important piece meets people struggling to deal with the impacts of climate change."},{"comment_id":"10153501091738690","commenter_b":"Afgan want peace but usa want target killing of muslims.","commenter_a":"Afghan was peaceful peoples. Bu when usa attack on afghan they become defender and now usa and others calling terrorist. Shame on you.","post_message":"At least 17 policemen have been killed in Afghanistan's Helmand province after \"hundreds of Taliban fighters\" attacked the police compound, officials said. @webpagelink"},{"comment_id":"10153447455781051","commenter_b":"Trash get class Ur pregnant!","commenter_a":"Well if there married its her car too sucks to be him hopefully the baby in her tummy is ok","post_message":"When passersby saw this pregnant woman smashing a car in the parking lot, they ran outside to stop her. As soon as they learned why she was doing it, they let her continue"},{"comment_id":"1136953183031095","commenter_b":"I can guarentee she will have a fitness dvd out soon, watch this space. All these reality stars have horrible pics taken of them on the beach then get fit n do dvdds xx","commenter_a":"A well cut swimsuit would be far more flattering, although not much one can do with cellulite - ugh.","post_message":"The Only Way is Essex star soaking up those wintry rays ☀"}]
