[{"comment_id":"1263988416963489","commenter_b":"@username yes it means no crime was committed. It means she's innocent of any wrongdoing. This is America.","commenter_a":"Did they fit her for her orange jumpsuit yet? A woman in the White House is just a novelty. Wake up America! She is a criminal!!","post_message":"“The other day, Mr. Trump accused me of playing the ‘woman card’…”  WATCH: During her victory speech tonight, Hillary Clinton turned her attention to Donald J. Trump and Republican talking points."},{"comment_id":"10155065453241323","commenter_b":"You still refuse to answer the question.","commenter_a":"An admirable academic for sure . But; one line in the video had me chuckling \"And then population growth will stop\". Naive to think population growth will ever stop. Deluded dreamy lefty thinking.","post_message":"\"Let me show you the world\", said Swedish academic Hans Rosling, who has died aged 68.   Here he demonstrates the dynamics of population growth, child mortality and carbon dioxide emissions. The challenge for the world is to get everyone out of extreme poverty and get the richest people to use less fossil fuels, he said."},{"comment_id":"10153469659427042","commenter_b":"She's getting a life now getting away from that abrasive idiot.....stop with the marriage BS married or not no woman should be abused","commenter_a":"It means there not married right!! Now they have a child with no Dad , that's why Hashem laws say first we get married than have children . Are actions will let us all see our Rebbe King Moshich . She should get a life. Yechi Hamelech","post_message":"\"I have the courage to actually do something about it this time.\""},{"comment_id":"951268851580640","commenter_b":"Nadia: You must one miserable bitch in real life. you have the nerve to pretend to know Shannon well enough make the unfounded assumptions you just made. You have no idea what her function at Walmart even is yet you make this idiotic comment. Let me guess, you hate YOUR job and so have this need to crap on others? Her simple point was that it's a myth that all Walmart employees are on or qualify for foodstamps. Keep on hating and being ignorant!","commenter_a":"I have worked at walmart for ten years. I don't even qualify for wic because I make too much money! And with my first baby on the way I could have used the assistance. Not every single walmart employee is on food stamps. Oh and I also bought a house, got a nice car, all while working there....crazy","post_message":"That's a one cent difference, folks. Only *one* cent.  Many thanks to Slate.com for the image (and the facts)!"},{"comment_id":"10154490901549062","commenter_b":"She has that privilege","commenter_a":"Well at least she looks happy.","post_message":"The Drug Enforcement Agency has confirmed that a woman arrested for allegedly selling drugs in College Station is the daughter of a DEA agent."},{"comment_id":"10158731027245206","commenter_b":"No pair of shoes, living or dead, is worth 700 buckers. Stop it. This makes me miss the old days, when you'd never hear about some spoiled girl and her \"serious,\" attention-getting problems.","commenter_a":"Material stuff irrelevant .. dog love for ever by the way very ugly shoes","post_message":"This mischievous pup sunk her teeth into some high fashion — literally — when she chowed down on her owner’s new $700 Christian Louboutin heels."},{"comment_id":"367411220096110","commenter_b":"Dalia Montosa","commenter_a":"Katherine Cardenas","post_message":"No bridesmaids assistance necessary!"}]
