[{"comment_id":"10153145592901336","commenter_b":"I bet if not for her panties her guts would fall out","commenter_a":"Hope they send all the men back.","post_message":"Liana Barrientos, 39, who took six trips down the aisle in 2002 alone, will now be walking into court to face felony charges."},{"comment_id":"538972829636804","commenter_b":"Stupid lady","commenter_a":"I don't anything about this conflict, and it seems like this woman is being pretty rude. However, it is also true that anyone living in this country should be speaking English in their public lives.","post_message":"\"Speak English, b****. It's America. Put me on YouTube.\"  What starts as an argument over a dog quickly escalates into a vicious tirade about language, nationality and entitlements. Now this parking lot rant, seen by millions, is quickly going viral. Why it's touching such a nerve. @webpagelink"},{"comment_id":"1260941960612940","commenter_b":"To unite for all the right concerns all of them with us in mind because is 100% for and by the people...please for your families...you have to check learn help in anyway you can act and share and share again...because species are disappearing everyday...everyday...for you your loved ones for the nation for the world the planet..hiring humans for humanity and peace for all not the few...www.jill2016.com","commenter_a":"What a lot of people don't know about Trump that support him is, that those same people would not survive him ...Trump would even eat his own kind....it's just his nature.","post_message":"This teen just figured out the perfect question to start asking Trump and his supporters."},{"comment_id":"10154413621893279","commenter_b":"Bet she took the money anyway. How pathetic","commenter_a":"Progressives are all right in the moment Conservatives alway have the best long range strategies for gaining and holding power","post_message":"Hillary Clinton faced protests Monday by Palestinian rights activists outside a fundraising event at the Beverly Hills estate of billionaire Haim Saban."},{"comment_id":"10157089744255347","commenter_b":"If Obama lied about military service/valor, would he be a hero or a liar? My guess is he'd be a liar, so how is this man still a hero?","commenter_a":"Chris Kyle was an American war hero...PERIOD. You liberal hacks need to find another hobby :/!","post_message":"American Sniper Chris Kyle told yet another lie: How many medals he received."},{"comment_id":"10154244618664205","commenter_b":"Hillary Clinton is the Jerk of the year, because she put her personal ambition to be President, ahead of the welfare and safety of the vast majority of the American people!!!! Now we are all faced with the train wreck, of Donald Trump, with the nuclear launch codes at his incompetent finger tips!!!","commenter_a":"I vote Yank Jerkin \"off\" as #1. :-)","post_message":"Get in your last minute votes, before it's too late. @webpagelink"},{"comment_id":"1011674828909358","commenter_b":"The thought of that ticket is NAUSEATING but a SURE WIN for you DT! The Witch and Crow will cause Havoc where ever they go!","commenter_a":"I am a Trumper and together we will defeat Hillary and her running mate.","post_message":"I hope corrupt Hillary Clinton chooses goofy Elizabeth Warren as her running mate. I will defeat them both."}]
