[{"comment_id":"943876645729114","commenter_b":"Put her as a no fly list and jail","commenter_a":"🖕🏿","post_message":"When this Black Lives Matter entitled brat threw a fit on an American Airlines flight after not getting her way she started up the accusations of racism immediately.   'LIKE' if you think this race-baiting BLM supporter got what she deserved."},{"comment_id":"536178543246730","commenter_b":"Meg Whitman is a disgrace and a lousy CEO.Bitch needs to shut the hell up.","commenter_a":"She's a fool","post_message":"SICK & SHAMEFUL"},{"comment_id":"1306577949392367","commenter_b":"Rapidly arriving at the point where I can't bear to read or watch anything this Neanderthal does. In my opinion, he is a racist, terrorist supporting radical Islamist bent on bringing about America's downfall.......on the orders of his puppetmaster, George Soros.]","commenter_a":"Obama helps promote fake news, since it serves his purpose.","post_message":"\"obsessed”"},{"comment_id":"1043277849065296","commenter_b":"Stupid cow! Needs to get over herself","commenter_a":"What a cow!!!","post_message":"'His career won't suffer, but I've been told I'm ruined'"},{"comment_id":"10154543040158812","commenter_b":"Not this woman!!","commenter_a":"Hillary and her husband are as dirty as dirty can be! Can't believe this lying, two faced, arrogant broad is the Democratic nominee for President! Thank you women voters for voting for gender instead of what was best for this Country!","post_message":"An impromptu meeting between President Bill Clinton and the nation's top cop could further undermine Hillary Clinton's efforts to convince voters to place their trust in her, highlighting perhaps her biggest vulnerability. @webpagelink"},{"comment_id":"894821663947420","commenter_b":"more idiots!","commenter_a":"I blame Obama","post_message":"Don't be quick to blame California's drought on plush lawns and swimming pools ..."},{"comment_id":"977904432246897","commenter_b":"She is an EVIL woman an not sure why she isn't in JAIL @username!","commenter_a":"Who is that masked woman?","post_message":"It's a very simple question:   “Have you seen those very, very controversial videos?”"}]
