[{"comment_id":"10154179753088645","commenter_b":"Girl bye!!!","commenter_a":"She should be offended, he was trying to hook up with another woman while she was pregnant with his kid and during his apology he never said sorry to his wife.","post_message":" does not represent the man that I know, she added."},{"comment_id":"10153451466636336","commenter_b":"That's why I tagged you in this lol","commenter_a":"Sarah Garvey","post_message":"NEWLY RELEASED: The official images from the christening of Princess Charlotte have been made public by Kensington Palace."},{"comment_id":"1244076232270511","commenter_b":"@username And, that remark after you just said everything about her that Bernie did too. Crime Bill vote, wasn't for gay marriage because he thought it was a 'states rights' issue. Voted to send Vermonts nuclear waste to a small latino poor town in Texas. Voted to FUND the war in Iraq and plenty of other wars. Couldn't even to get the members of the Progressive Caucus in congress, that he started, to support him. You lost. Get over it.","commenter_a":"Of course he can't give Hillary credit for winning on her own merits. It must be because of closed primaries, or \"the poor not voting,\" or whatever other excuse he can come up with. How about the fact that Bernie benefited from the caucus system in certain states that actually make it difficult for voters to participate & thereby lower turnout? I don't hear Hillary whining about that. #feelthewhine","post_message":"He's looking ahead."},{"comment_id":"1090190811037255","commenter_b":"Dear Charlotte She gonna frack it up","commenter_a":"So proud of you @username! Can't wait to vote for you in Kentucky on May 17th! Hillary 2016!","post_message":"What kind of president would Leslie Knope be? Amy Poehler: \"Full speed ahead!\""},{"comment_id":"10157765816045354","commenter_b":"Amanda, I have a question for you.At this moment in time, as we can not get a \"do over\" and the Republicans have a nominee what do YOU do? Do you \"vote your conscience\"? To what end? Don't mean to insult, but truly what do you do? Write in Cruz for President? IMO wasted vote..vote 3rd party? As neither Johnson or Stein don't have a snowball's chance in hell, they can't even get on the debate stage, wasted vote. Vote Hillary? Can't imagine that would be an option either. Any option that I have mentioned do one thing only..help Hillary Clinton. The results: 100k's refugees enter the country; amnesty for illegals who in turn get jobs, healthcare, not to mention open borders for additional immigrants to walk in through; the loading up of Federal courts and the Supreme Court with liberal judges who will destroy the very Constitution you and ...","commenter_a":"I have a better idea...Why don't YOU and the GOP along with Congress get on board with the true Liberty Loving Conservative Patriots? Yea, sure I have a lot of nerve, but then again so do you, jackass.","post_message":"\"Those people need to get on board.\""},{"comment_id":"10152586371551135","commenter_b":"This is unacceptable. We need to stand up and love one another despite differences! Isis has definitely scared a lot of people. It would be nice if the Muslim community would make a statement in response to the killings around the world. Just to declare they are different of the terrorist and that what Isis has done is wrong. Then I think there would be a better understanding of Muslims. But even still there will remain evil people , like this man at Kroger. I'm constantly praying for our world. The world needs love. The world needs God. Blacks against whites. Whites against Arabs. Muslim against christian. Oh God help us all!!!!!","commenter_a":"Kelly Sleiman!!!!!","post_message":"Dearborn Police are investigating the beating of an Arab American man inside a local grocery store.  Police have also contacted state & federal officials to help investigate the attack.  STORY: @webpagelink"},{"comment_id":"10154136218409384","commenter_b":"She's just the best, go home to your expensive home and shut up...","commenter_a":"Everyone should see the damage that democrat loal gov't can do.","post_message":"It was my privilege to call to order House Democrats' hearing on the Flint Water Crisis. In an American city, thousands and thousands of children have been drinking and bathing in poisonous water for more than a year. It was not an unavoidable natural disaster. It is a man-made catastrophe. Now, thousands of children are at risk of lifelong damage from lead exposure – unless we help get them the care, attention and resources they need. We have a responsibility to help the people of Flint tell their story – and to be sure that story is heard loud and clear in the halls of Congress. The story of Flint challenges the conscience of America. It holds lessons and warnings for communities across the country."}]
