[{"comment_id":"10150875072404999","commenter_b":"Why should it always be hush hush? I was told by a lady that '' Your daughter loves to play sports. Make sure she doesn't mention her periods or say it hurts because her coach will kick her out especially in our school district.'' She will still participate no matter what ,but y the taboo?","commenter_a":"All power to her to be able to compete with period cramps.","post_message":"An Olympic commentator turned to Fu Yuanhui, who was grimacing in pain. “It’s because I just got my period yesterday, so I’m still a bit weak and really tired. But this isn’t an excuse for not swimming well.”"},{"comment_id":"989968744373799","commenter_b":"I will be keeping the guns thank you.","commenter_a":"We need anti knife and anti-texting while driving legislation.","post_message":"Commentary from Blaze contributor and pastor Jarrid Wilson."},{"comment_id":"859553757415299","commenter_b":"Coming out of the mouth of the most oppressive Fascist in American History!!","commenter_a":"Beat that dead horse. ..beat it some more","post_message":"Attorney General Eric Holder told reporters Friday that the federal government is “prepared” to dismantle the Ferguson Police Department if “necessary.”"},{"comment_id":"10153157305281636","commenter_b":"very wicked woman ! she deserve it.","commenter_a":"The states where the capital punishment extists are muderers on the level of the nation.","post_message":"Even Pope Francis made a last-minute appeal for clemency"},{"comment_id":"541637449341656","commenter_b":"Pls sign here here and here","commenter_a":"Wow, big shock. The state who elects the most insanely leftist politicians went for Trump. I wonder why. I can't wrap my head around it. Man, so bizarre.","post_message":""},{"comment_id":"10154176687291337","commenter_b":"Good now the bitch dont have a job...now go get that unemployment check","commenter_a":"Freedom of speech, freedom of press, wwlcro American land of lies","post_message":"YIKES! Terrible move by this anchor..."},{"comment_id":"845732068898255","commenter_b":"bring all our soldiers home to protect us from the illegals, n's, and queers. let those other countries fight their own battles. money paid by americans stays in america","commenter_a":"I told you from day 1. We Americans are so super sick and tired of you liberals and media trying to water down America. We're sick and tired of you trying to pussify America. We're sick and tired of you trying to force liberalism down our throat. So guess what ? Open wide because now you forced us to shove Trump down your throat !! Enjoy !! We just got our balls back !! Liberals and socialists suck ... They don't like guns, So they don't think you should have one. They like social programs, So they think you should pay for them They don't like religion, So they don't think you should be religious They like abortion, So they think you should like abortion They hate success, So they think you should pay more taxes. They elected the first Muslim president, So they think you are a racist.","post_message":"ClashDaily.com"}]
