[{"comment_id":"10153513356977061","commenter_b":"Oh god please... What a fake","commenter_a":"Worst First Lady and president ever ....E V E R ...","post_message":"WATCH: Pres. Barack Obama and First Lady Michelle Obama do the Whip/Nae Nae at The White House Easter Egg Roll. abcn.ws/1VPZxxV"},{"comment_id":"452509181540789","commenter_b":"Courtney i could care less what a fugly cunt, such as yourself thinks.","commenter_a":"No one wants to see ugly bitches without a top on.....maybe feminazis, but they don't count they're not people","post_message":"We support these brave and courageous women as they demonstrate against the rise of #policebrutality nationwide. What do you think about this form of protest? Effective?   Learn more → @webpagelink #SayHerName #FreeTheNipple #StopPoliceBrutality #TFTP"},{"comment_id":"1164001233718693","commenter_b":"Come on bitch follow the dress code","commenter_a":"Justin Drake pleaaaaase go off on her for being annoying","post_message":"Her bare shoulders were enough to get her sent home from school. Now this teen is baring her thoughts on sexist dress codes."},{"comment_id":"387361158112432","commenter_b":"the WHAT?","commenter_a":"A lot better then the B.N.R. CRAP","post_message":"What did the Christian left do to draw the ire of Fox News?"},{"comment_id":"1207325982676961","commenter_b":"Epic smackdown","commenter_a":"Loved it. She asked for it.","post_message":"WHOA!!!!! Gingrich went nuclear on the Kelly File and sends social media into a frenzy!"},{"comment_id":"1573029682757155","commenter_b":"What's to be done. Vote for Hillary to screw over the vets, give away more jobs and flood us with refugees and illegal Hispanics?Seriously.","commenter_a":"@username shell say anything to get a vote this is how she really is a dirty white devil","post_message":"She used the racial slur over and over and over..."},{"comment_id":"1217472704997930","commenter_b":"WE MUST STOP CORRUPT CROOKED LYING KILLARY...If she gets into OUR White House she will appoint the nest Supreme Court Judge...GOD Forbid it be the MUSLIM POS OVOMIT. This will affect US, OUR CHILDREN and OUR GRAND CHILDREN for years to come. She will do her best to cost us OUR SECOND AMENDMENT RIGHTS, While keeping the Secret Service ARMED to protect HER SORRY ASS !!!! She will FLOOD OUR COUNTRY WITH SYRIANS, TERRORISTS, and ILLEGALS.... OUR Borders will NEVER BE CLOSED. AND all of this we will be FORCED TO PAY for with her PROMISED RISE IN TAXES on the MIDDLE CLASS. if that DOESN'T KILL US, we can always be BOMBED, BEHEADED, RAPED or MURDERED by ISIS....GET A CLUE, OPEN YOUR EYES, SEE HILLARY'S AMERICA , BUT THINK TWICE BEFORE YOU VOTE FOR THIS TRAITOROUS B*TCH !!!!!!....TRUMP 2016 !!!!!","commenter_a":"TOO many martinis & pills.","post_message":"Democrats are in full-on panic mode after reporters scooped a picture of Hillary Clinton literally UNABLE to stand. This is going to intensify speculation about her health BIG TIME.  Do you think that Hillary Clinton is fit to serve?"}]
