[{"comment_id":"976551429087752","commenter_b":"She is a pathetic little girl who wants to be relevant. Too bad that will never happen.","commenter_a":"Who cares what she says????","post_message":"\"Pop-star' Calls Christians \"F*****g Insane\" and \"Conservative-A** MotherF****rs\"!"},{"comment_id":"10153203916923984","commenter_b":"Stand By Him- Military knows they are the boss-but a chaplain has an higher boss. Military should not let this man go.","commenter_a":"Why only a 1 month assignment as assistant? Is that the norm? Missing pieces of this story.","post_message":"This highly decorated vet and former SEAL chaplain is facing something unexpected after 19 years of service...  Do you stand by this lieutenant commander?"},{"comment_id":"1038727149505600","commenter_b":"Trump, get your ass to basic training, and stop with your faux patriotism act.","commenter_a":"Hahaha.","post_message":"Trump 'always felt that I was in the military' when he was at military-themed boarding school @webpagelink"},{"comment_id":"806051249493483","commenter_b":"Republicans....","commenter_a":"What flipping IDIOT would vote for this nut","post_message":"He leads his closest competitor by 11 percentage points."},{"comment_id":"173468886485698","commenter_b":"Well...Bye!","commenter_a":"California says screw you USA, until they want something from the rest of us in the USA.","post_message":"Spread this everywhere!"},{"comment_id":"10152883747411051","commenter_b":"Feel attractive and beautiful? Get out. So a 16 or 18 year old kid gave her that? Sick. Lock her ass up.","commenter_a":"Just wait","post_message":"A teacher who was busted with not one, not two, not three, but four students is now looking at a lot more jail time than she initially realized."},{"comment_id":"886400474789539","commenter_b":"so many thugs trying to kill cops what do you expect?","commenter_a":"Crooked cops what would you expect?","post_message":"\"I just tried to cover my face from all the beating that the officer was giving me.\"  -Floyd Dent"}]
