[{"comment_id":"10153227651945329","commenter_b":"Ikr how dare she maintain a healthy lifestyle, the bitch.","commenter_a":"She can fuck off","post_message":"More like baby washboard, amiright?"},{"comment_id":"10154860670292435","commenter_b":"Take flamethrower out there and really clean the swamp!","commenter_a":"You get a fire truck and water board them with a hydrant.","post_message":"Happening Now: Protesters outside the White House opposing President Donald J. Trump's travel ban."},{"comment_id":"1017008728310597","commenter_b":"The imaginary kind.","commenter_a":"Just what kind of Christians are they ?","post_message":"\"Poverty and joblessness are not indicators of bad character\""},{"comment_id":"10154290485811545","commenter_b":"Building a physical wall between MX is imsidious but ee must create a climate of understanding with the that they are responsible for these people comimg over illegal. We need to have serious talks with Mexico and make clear that vast fines will be waged against them if this invasion continues.","commenter_a":"He's lying like his president about everything","post_message":"Our Facebook stream has ended, but you can keep watching here: wfaa.com/livevideo  WATCH LIVE: Confirmation hearing for Alabama Senator Jeff Sessions, President-Elect Donald Trump’s pick for attorney general.  MORE: @webpagelink"},{"comment_id":"1232217873516420","commenter_b":"Female dog","commenter_a":"Convicted felon","post_message":"I want to see what you all come up with... Describe Hillary in just two words... Ready, set, go!"},{"comment_id":"10156794675835389","commenter_b":"That's what happens when you allow undocumented immigrants flood into your country, Duh....","commenter_a":"So where is the UN? What is the purpose of th UN? How much money does the UN get to do nothing to help","post_message":""},{"comment_id":"1703915029828450","commenter_b":"Mitt you looking for your10 mintues of fame????.... you lost get over it.....How can you allohw a Party to say mine and millions of people vo te don't count.....????..we don't like Rubio.and by the way llook hard in Flordia about his pass!!! we don't like Ted Cruz.. which i think thie Chistian voter shows that... Donald Trump for President 2016 has grown your Party... I am 60yrs old i have been a Dem all my adult life.. this year,, i changed to Rep Party....to vote for Donald Trump for President 2016... and now it doesn't matter?? because the GOP says so.... pure Goverment !!! trying to hold on to there ways the hell wi th the people e.... ok i you keep your crap up.. just won't vote.....and we can have another 4 years of Obama... and i am sure i am not a lone on this....th an you have ...","commenter_a":"And I put a hundred hours and a lot of cash working for Romney. A RINO at heart and a man that can't close the deal.","post_message":"Donald J. Trump responded to Mitt Romney, calling him \"one of the dumbest and worst candidates in the history of Republican politics.\""}]
