[{"comment_id":"1571786566441790","commenter_b":"What good will it do, congress passes these laws.","commenter_a":"These people make me sick.","post_message":"These welfare abusers need to be taught a lesson.  Way to go Judge Judy!"},{"comment_id":"10153387140986323","commenter_b":"How did the chicken cross the road? Roads, where we're going we don't need roads.","commenter_a":"Go Peter Rabbit!! (Y)","post_message":"Is this rabbit really scurrying across an avalanche?"},{"comment_id":"956678911036116","commenter_b":"Trump is right ! All 11 million illegals have to go !","commenter_a":"Trump Chopper in Air Salad toss on a stick taint Fear God Trucker Hat -.......... high-ku Reverend #TrumpTrain #GOPClownCar #iacaucus","post_message":"\"They have to go.\""},{"comment_id":"512225352297167","commenter_b":"put that baby arm away bitch get tight hoooeeeee","commenter_a":"Savage","post_message":"It be like that "},{"comment_id":"573365229526142","commenter_b":"Because they are spoiled sissies","commenter_a":"If the people who voted for Trump are racist and if he is racist, where were the protests and riots when the first mixed/black president was elected? (Crickets) Why do the democrat-progressives always take the low road and pitch fits when they don't get their way?","post_message":"Hmm, if people of color are endangered by having white people in office, are white people endangered by having people of color in office?  hillarysamericathemovie.com/#dvd"},{"comment_id":"10152859683207434","commenter_b":"@username is a pathetic cesspool. Pandering feminist Cosmo garbage","commenter_a":"Lenny Kravitz’s dick fell out on stage. Look at it dangling. Kravitz was performing at a show in Stockholm on Monday when his (perhaps cock-ringed) penis came tumbling out. Just as the rocker was getting low to the flo’, the D broke out from its restrictive leather pant cage and gave the world a show.Note how the tongue and the penis simultaneously present themselves during this tragic wardrobe malfunction. Is it a beautiful thing? Who knew.","post_message":"Note how the tongue and the penis simultaneously present themselves during this tragic wardrobe malfunction."},{"comment_id":"10153796714106636","commenter_b":"Lady please..take a seat!!","commenter_a":"Obama has destroyed this country and race relations in US","post_message":"\"Black men dying and being forgotten. People retaliating against the people that are sworn to defend us. We have to come together and end all of this.\""}]
