[{"comment_id":"10156349678780354","commenter_b":"They can cut off their cocks all they want. DNA will still say male no matter what. Liberals always want to Goto science to try and disprove the Bible but don't with this sick shit. God bless Texas for taking a stand!","commenter_a":"I'll show you mine if you show me yours. President Obama said it's perfectly alright.","post_message":"How upside down is the world when this even had to be voted on in the first place?  That said, LOOK at the percentage of Houston voters who voted for and against this..."},{"comment_id":"1515340161809773","commenter_b":"Well... he lost the popular vote, so that's clearly not true. But you're right, Bernie supporters should feel cheated.","commenter_a":"Obviously people approve of Trump more then Hillary 🤗🙃 Let's be honest he won because of crocked Hillary's disapproval. Bernie supports should feel cheated... he'd be the next president if she hadn't been the democratic candidate.","post_message":"Do you approve of Donald J. Trump?"},{"comment_id":"10153028815641336","commenter_b":"Netanyahu is a coward he's trying he's best coz he's scared of Iran","commenter_a":"I don't know what history books Obama has been reading but it would do him good to listen to this leader of the free world for America as we know it will disappear from us and our future....","post_message":"Today, Israeli Prime Minister Benjamin Netanyahu - בנימין נתניהו will make his case to Congress – and the American people – for why a pending nuclear agreement with Iran would risk his country’s security.  Tune in to Fox News Channel at 11:00a ET for live coverage of Netanyahu’s speech."},{"comment_id":"983450188381396","commenter_b":"Sal khan would you stop blaming anyone appart from your pals?!?!? Europe did this, US did that. Wake up.","commenter_a":"Islam for you. Peadophile third world cult. Enough said","post_message":"Sickening."},{"comment_id":"991442284225448","commenter_b":"Matthew Acheron","commenter_a":"Daniel Kulick","post_message":"Nintendo introduces Linkle, a female version of The Legend of Zelda's Link."},{"comment_id":"1234377609916581","commenter_b":"Euuuuuw you wouldn't bitch!!!!!!","commenter_a":"Shieeet om det här hade hänt... :S xD @username","post_message":"Just going to grab a nice handful of san - WHAT IS HAPPENING."},{"comment_id":"1058315940902294","commenter_b":"Stupid white girl","commenter_a":"Dr. Cornel West is as arrogant and blind as Bernie. Blaming good Democrats for not getting things done and ignoring Republican majorities blocking them. They don't help. They just \"manage\" from the side lines. Bernie at least has worked some in legislation, but not as hard or as successfully as Hillary. Dr. West has done nothing put complain that people who are doing the heavy lifting are not working hard enough.","post_message":"What do you think about his choices?"}]
