[{"comment_id":"10155094877376037","commenter_b":"She deserves the same treatment.... sick sick sick nasty woman. She doesn't deserve life","commenter_a":"Where's the picture of the mother?","post_message":"14-year-old Grace Packer was beaten, raped, poisoned and strangled."},{"comment_id":"10154247544237894","commenter_b":"Damn yo mama mean BUSINESS!","commenter_a":"one year my brother and i unwrapped all our Christmas presents before Christmas and my mom found out and took everything back, i would've much rather gotten the ASS whooping instead.","post_message":"Say What Now? Indiana Woman Arrested After Beating Kids for Opening Christmas Gifts Early"},{"comment_id":"10153120614663203","commenter_b":"Women have degraded themselves to unbelievable depths. How sad, how very very very sad.","commenter_a":"This movie distorts how Love is supposed to be expressed. Women deserve better than to be chained and beaten.","post_message":"Say no to porn. Boycott 50 Shades of Grey, the movie: sign the petition"},{"comment_id":"1563692830591111","commenter_b":"@username We don't need to build a wall... we need to make all employers use E2Verify, get our Congress to quit allowing corporations to import H1b and H2b workers... Then move military bases from sanctuary cities and put them along the border...use the open spaces for war practice and bombing ranges to collapse the tunnels.","commenter_a":"Trump wants to build a wall on the border and make Mexico pay for it, deport illegals, cut taxes on the middle class and corporations, destroy Isis, take care of our veterans, strengthen our military, build the keystone pipeline, repeal Common Core, repeal Obamacare and replace it with a market based system, stop SS and welfare fraud, fight Mexico and China unfair trade and currency practices, preserve the sanctity of the unborn life, preserve the sanctity of the 2nd amendment ... that's conservatism ... that's patriotism ... that's what it will take to bring America back to greatness","post_message":"We cannot pretend the problem does does not exist. We need to build the wall- in order to make America safe now-- and for future generations!"},{"comment_id":"10152666104531028","commenter_b":"Time for a layoff","commenter_a":"New Orleans!","post_message":"No tickets for having an open container of alcohol, no tickets for public urination, no tickets for double parking, no tickets for costumed characters hassling tourists to take their picture.   It's perhaps the most jarring example of a slowdown in low-level enforcement across NYC amid tension between rank-and-file police and the city's mayor.  @webpagelink"},{"comment_id":"751484411652421","commenter_b":"It's designed to expand and contract no matter what the fuck it is you do. Stop acting like Waist Training is associated with organ ruptures because it isn't. No woman has ever died from using a waist trainer in our society because we have made vast improvements in it's design. You can't be like \"WELL WHEN YOU'RE PREGNANT YOUR BODY NATURALLY CONTORTS\" It contorts either way. The organ placement isn't even permanent when using a waist trainer it is almost the same exact process except rather than an expand you are placing the pressure in other areas making it look evenly distributed. The entire point is that nobody drinking, smoking or who is Obese (Yes we can tell when someone is obese) should be complaining and bitching at women who are using waist trainers periodically to go out, or to exercise about \"health\" without sounding like an absolute hypocrite. We ...","commenter_a":"So...insanely tight corsets are coming back into style? Didn't we learn anything from the history of these awful garments?","post_message":"Waist trainers are terrible for you, but the media keeps pushing them on women.   To learn more about the health risks associated with waist trainers, follow this link: attn.link/1T22tWr."},{"comment_id":"1180631801992422","commenter_b":"THE wall is necessary","commenter_a":"Hell no!!! I don't want to see a big freakin wall between my state (Texas) and Mexico (with whom we've been friendly for a LONG time). Way to go, Trump...maybe you can start a war with Mexico 😠 Brilliant!","post_message":"Agree or disagree: It's time to build Trump's wall at the border."}]
