[{"comment_id":"1058239930927979","commenter_b":"This woman has to be one of, if not the stupidest person in the world.","commenter_a":"This piece of whale shit....no I stand corrected, whale shit has a purpose. This Is the very definition of dumbocrat....take your old tired ass and retire you outdated elite POS. You are so far out of touch with the human race just knowing you made that statement makes me throw up in my throat. Please go off to your pasture, dig yourself a hole so I can put an outhouse above it and shit upon your face.","post_message":"\"They voted against their own economic interests because of guns, because of gays, and because of God, the three G’s, God being the woman’s right to choose,\" said Pelosi."},{"comment_id":"1012675578755490","commenter_b":"Stupid women","commenter_a":"shut up skanks, cancel the p.o.s....","post_message":"Umm ACTUALLY it is in the Bible!"},{"comment_id":"10153199114815950","commenter_b":"I'd pick up the deal with her in it and put her outside. Call her parents and tell them she's outside. She looked small enough. The cop lost his cool. Out smarter by a brat. Now he is fired and they will sue. Sad all around.","commenter_a":"I was raised very conservatively about manners and respect, and I agree that she was wrong for her actions. However, that deputy does not need to be a SRO if he is going to deal with students this way. It's unprofessional and disturbing.","post_message":"\"I was praying out loud for the girl and I just, I couldn't believe it was happening. I was just crying, and he was like, well since you've got so much to say you're coming too.\""},{"comment_id":"10154734525598812","commenter_b":"@T Elliot Cato. The Trump clan is made up of deluded folks. Please let them be...case is chronic!","commenter_a":"Why do Trump supporters keep believing the lies and conspiracy theories?","post_message":"NEW: The FBI expected to release Hillary Clinton interview notes and case documents in the coming days."},{"comment_id":"486035008253746","commenter_b":"Cover her ugly ass back up. Been eating too many Chitterlings","commenter_a":"Cover her face??","post_message":"A woman is suing the police department... over a hijab?  This woman broke the law, the police are completely in the right.  Do you support our police?"},{"comment_id":"10153602111881336","commenter_b":"No Obama already congratulated them.","commenter_a":"Obama will probably prosecute them.","post_message":"Three Americans are being hailed as heroes today for tackling and disarming a gunman on a high-speed train traveling between Amsterdam and Paris."},{"comment_id":"1712662805615424","commenter_b":"What a drunk bitch. What is she? Fucking 3?!","commenter_a":"Leigh Mangubat","post_message":"Guy Records His Girlfriends Meltdown"}]
