[{"comment_id":"10153540575624411","commenter_b":"with Californias massive extreme drought, its like a match head waiting for a strike anytime any place.","commenter_a":"accidents happen anywhere why blame beautiful California. Nothing like California in this whole WORLD!!!!!!","post_message":"Watch: Huge forest fire sweeps highway in California"},{"comment_id":"10153097133433271","commenter_b":"Better relocate. .. drunks and moosee don't mix well..... drunk will loose","commenter_a":"@username this would've been amazing:)","post_message":"A young female moose wandered into downtown Boulder Sunday night, strolling down the Pearl Street Mall. On the advice of a state wildlife officer, police fired some bean-bag rounds at the moose's backside and eventually shooed it away from the populated area.  More details: @webpagelink"},{"comment_id":"10153303444396051","commenter_b":"JFK worked for no salary.","commenter_a":"Wonderful! No salary or expensive vacations. That should lower the debt that Obama has racked up.","post_message":"Donald Trump plans on working for free if he's elected president. Do you like the move?"},{"comment_id":"1176769975734870","commenter_b":"Hell yes, it's about tyme someone stand up the the World Biggest Bully Obama, You Go Donald Trump.","commenter_a":"Trump is our only way out he is our only Vote we got to stay in touch @ all times","post_message":"Liberals are demanding that Donald J. Trump walk back his rhetoric against President Obama in the wake of the Muslim terror attack in Orlando. Trump isn't going to do that, though... he just doubled down and accused President Obama of TREASON.  This are Trump's most stunning remarks on President Obama yet. Do you agree with what Trump had to say?"},{"comment_id":"10153711323820695","commenter_b":"Girl, STOP!","commenter_a":"A true example of faith. My prayers go out to him and his family. They'll get what they deserve, evil doers do not prosper.","post_message":"FORGIVENESS: That's what the wife of a man shot during a home invasion is expressing as her husband recovers."},{"comment_id":"10153703239058984","commenter_b":"She would be the worst women president ever !!!!","commenter_a":"Same crap. Boring!","post_message":"She wasted NO time with this one...  Do you think Hillary would be the worst pick for president?"},{"comment_id":"1707461899536305","commenter_b":"This lady is lady has her own set of rules","commenter_a":"From you? Yeah right!. . . The Ambassador and thsoe Marines are - ROLLING IN THEIR GRAVES. . . right now. . .","post_message":"Do you agree with Hillary Clinton? #SCPrimary"}]
