[{"comment_id":"562653790568588","commenter_b":"That's bad...right :-) Bernie is a moron, a pandering moron.","commenter_a":"idiots topped with lie pudding","post_message":"No, this wasn't Saturday Night Live. Bernie Sanders actually said this in a real debate..."},{"comment_id":"10153257325640950","commenter_b":"Quit smoking dumb ass broads or don't get pregnant!!!","commenter_a":"Smoking while pregnant should be child abuse. The reason it is not is that Planned Parenthood and the rest of the abortion industry wants no rights assigned to kids when they are in utero, because doing that would admit that they are a person.","post_message":"Smoking during pregnancy can lead to complications including sometimes dangerous premature births and sudden infant death syndrome."},{"comment_id":"868880693208184","commenter_b":"She is a liar","commenter_a":"You idiots have hit the bottom of your now famous SKUM barrell!!!! Cant you all find anything on the first woman president to be besides a cell phone E-MAIL really!!!!","post_message":"Blackberry-toting Clinton is now an action figure."},{"comment_id":"1791155854463672","commenter_b":"We ARE heading to this disaster because we still hold on to capitalism and free market","commenter_a":"Bobby Schar","post_message":"Thanks for that Brian ..."},{"comment_id":"1056816484380468","commenter_b":"Islam, by law, is prohibited from US immigration The Immigration and Nationality Act passed June 27, 1952 revised the laws relating to immigration, naturalization, and nationality for the United States. That act, which became Public Law 414, established both the law and the intent of Congress regarding the immigration of Aliens to the US and remains in effect today. Among the many issues it covers, one in particular, found in Chapter 2 ACT 212, is the prohibition of entry to the US if the Alien belongs to an organization seeking to overthrow the government of the United States by \"force, violence, or other unconstitutional means.\" This, by its very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House.Islamic immigration to the US would be prohibited under this law because the Koran, Sharia Law and the Hadith all require complete submission ...","commenter_a":"Don't waste tax dollars with a trial, start setting an example of what happens to terrorest who murder.","post_message":"BREAKING: Muslim Teen Refugee Charged With MURDER For Beating 97-Yr-Old WWII Veteran To Death  These refugees can not be trusted with freedom... give an inch they take a mile.   Http://woundedamericanwarrior.com/breaking-muslim-teen-refugee-charged-with-murder-for-beating-97-yr-old-wwii-veteran-to-death/"},{"comment_id":"10153440624016680","commenter_b":"@username KILLERY LOVER<< YOUR SICK GO LIVE IN CANADA YOU LIBERAL IDIOT>>","commenter_a":"Donald Trump all the Way to the White House,,Heck with all the Haters and the Crooked Sander Backers,, and the ones that Love Hilary yea way to Support her a Criminal That Killed 4 American Servicemen,, she should be in prison,!!!!!!!!!!!!!!","post_message":"Donald J. Trump: Michelle Fields grabbed me."},{"comment_id":"1569576153350573","commenter_b":"Oh, and your fat head out of women's uterine issues!","commenter_a":"The goverment has no right to interfere in a very personal decision, hard enough without some men thinking they can decide for us.","post_message":"Don't doubt him for a second..."}]
