[{"comment_id":"10154048575244456","commenter_b":"Joke","commenter_a":"Prayers for Gunn's mom and prayers for Officer Smith. I pray that the whole truth be revealed and this young man will be safe.","post_message":"\"MPD supports their men and women in blue. #it'sok2hitthelikebutton,\" the post on a MPD Facebook page stated.  Here's what we learned today:"},{"comment_id":"1202995606404444","commenter_b":"Made all her money from being sexy. Buuuuuwahaaaaaahaaa","commenter_a":"Funny how a party girl talks about porn","post_message":"COMMENTARY from Matt Walsh:  “I don’t have my Bible in front of me, but I’m pretty sure Pamela Anderson being accused of puritanism is a harbinger of the End Times.”"},{"comment_id":"903880782991323","commenter_b":"Discrimination!!","commenter_a":"I think it something that must be done, especially when children are involved. The effect of cigarette smoke on kids is devastating.","post_message":"A children's hospital announced it will no longer hire employees who smoke: @webpagelink Do you think it's a good policy or too harsh?"},{"comment_id":"10153882814429916","commenter_b":"You can tell she loves BREAD, not that she's inbred.","commenter_a":"Well just look at her, you can tell, she is inbred.","post_message":""},{"comment_id":"1263988416963489","commenter_b":"@username yes it means no crime was committed. It means she's innocent of any wrongdoing. This is America.","commenter_a":"Did they fit her for her orange jumpsuit yet? A woman in the White House is just a novelty. Wake up America! She is a criminal!!","post_message":"“The other day, Mr. Trump accused me of playing the ‘woman card’…”  WATCH: During her victory speech tonight, Hillary Clinton turned her attention to Donald J. Trump and Republican talking points."},{"comment_id":"10157460185340725","commenter_b":"Awesome speech in The Motor City, Mr. Trump. Inspiring, uplifting. Gave me goosebumps!","commenter_a":"CHINA = GARBAGE","post_message":"My trade reform means STRONG protection against currency manipulation."},{"comment_id":"1357571687635909","commenter_b":"Kidult fan!","commenter_a":"That's what the fans should be saying to you","post_message":"Don't get us thrown out of Euro 2016"}]
