[{"comment_id":"1104531886270791","commenter_b":"She's a pussy cat","commenter_a":"@username take your next vaca with Marina","post_message":"Welcome to dog paradise — tons of land to run free and daily visits from human playmates. (via INSIDER)"},{"comment_id":"1664084467202646","commenter_b":"Then I would campaign for congressional term limits Allow the country to decide if abortion is to be legal or not. The same with gay marriages. The supreme court should not be involved in these maters. If the is challenged and reversed. So be it. I would not allow mass illegal immigration. Illegal is wrong by definition. As to radical Muslims. Not welcomed. Peaceful Muslims who migrate legally are welcomed as long as they assimilate . And do not try to impose sharia law. This country has its laws made by its citizens. If you come here. You need to assimulate. I would ask for voter IDs. Driver license are not proof citizenship. Sorry.","commenter_a":"I would dump Obama care and replace it with something that makes sense. Eliminate the following depts. Education, environment and agriculture. TSA homeland security plus the irs. Treasury dept can handle collecting a flat tax. Eliminate the federal minimum wage. No need for the federal govt to be involved in these areas. Then I would walk away from the Iran nuke deal and global warming. Bad policies. Then I would invite the Mexican president to the white house and bitch slap him. Cut the budget across the board by 10% for each of the 1st 4 years Have a flat federal tax of 17.5 on everyone. Period. No deductions. Nothing. Flat. Period. I would then review all of BHS executive orders and reverse or modify what I decide what is needed.","post_message":"If you were president what is the first problem you would address?"},{"comment_id":"10152918751311336","commenter_b":"Because there wasn't technically a government and laws like European style governments didn't give the European invaders the right to grab the land and kill the people that were already living here my ancestors didn't welcome yours","commenter_a":"If you are in a country without the required paperwork, you are an illegal. Check the dictionary please.","post_message":"\"We don't believe in capitulating to people who are going to tell us how to run our newspaper,\" said Scott Steepleton, city editor of the Santa Barbara News-Press on FOX & Friends Weekend."},{"comment_id":"10153664912304726","commenter_b":"There are Syrian refugees already there!!","commenter_a":"Yeah, let the refugees all live at the vatican. they got lots of money and plenty of room.","post_message":"The Vatican keeps out the throngs while the Pontiff urges the U.S. to open borders."},{"comment_id":"10156823156490594","commenter_b":"I don't want my great-granddaughters going into to bathrooms where males are also present. I'm not talking about transgender; there are sick people that will use that as an excuse to be were they shouldn't","commenter_a":"I never really shopped at Target's, I will now. I'm glad your taking a stand for the transgender population. So sad that people's lack of knowledge or fear make them judge.","post_message":"\"Inclusivity is a core belief at Target,\" said the retailer in a statement. \"It's something we celebrate.\""},{"comment_id":"724979780984130","commenter_b":"Let's not forget that the woman also has to spread her legs.","commenter_a":"I have been saying this for years. The whole thing starts when a man can't keep it in his pants. He has no business telling women what they should or shouldn't do.","post_message":"Let me share a piece of myself. Yours truly was abandoned as a newborn by a man who now he is 100% against abortion. I guess me being taken to Arkansas and being raised by an abusive stepfather (and the first few years in a shack with an outhouse and a well for water) was OK. I appreciate that I had a chance at life. But you men who think you can make decisions for women? STFU. Now.  ~tiff  via Occupy Democrats"},{"comment_id":"10154885084089411","commenter_b":"we all good woohoo like riding a wave..","commenter_a":"Leah stay safe. Xx","post_message":"URGENT New Zealand civil defense warns of tsunami, urges people on South Island to move to higher ground"}]
