[{"comment_id":"1369042613147367","commenter_b":"@username and us tax payers get to pay for double security bc the poor widdle brat can't move and change schools like every other American kid has to do when they move🙄🙄","commenter_a":"I mean Donald did say if she wasn't his daughter he would marry her so essentially it's what he wanted.... still Creepy AF!!! 😷😷😷","post_message":"Did you see this coming?"},{"comment_id":"363905233797771","commenter_b":"Stupid wench. I hope her show and all of her movies bomb.","commenter_a":"And the answer to your question, YES. Oprah is a racist....","post_message":"Is Oprah a race-baiter?"},{"comment_id":"10157928279665500","commenter_b":"Why did they have babies to begin with? People like them have no business having babies - period. Don't believe in birth control - don't have sex.","commenter_a":"This makes me sick! The parents don't look like they missed any meals! Lock them up and throw away the key!","post_message":"The nurse also told police there were feces in one of the child ears and that the child looked  a skeleton. @webpagelink"},{"comment_id":"630413113793105","commenter_b":"okay so heres why i still disagree, especially in regards to syrian refugees. the poison example is still not a good one, because no damage that isis can do to the country is comparable to the damage that poison will do to a persons body. it would be tragic to lose people in attacks, but it wouldnt be strictly \"devestating\" to the country. the united states stregnth and resolve would be largely unchanged. refuting refugees is stupid, and here is why i think so. for one, the refugee vetting process is the most extensive and thorough process that is in place, if any sort of check is going to detect a potential terrorist, this is the one. refugees take about two years to finish vetting and finally get relocated, and they dont even get to choose where they go! they get sent to a country that is assigned to them. ...","commenter_a":"@username thoughts","post_message":"Donald J. Trump tweeted about the case, saying Bonifacio Oseguera-Gonzalez \"should have never been here.\""},{"comment_id":"426004474226175","commenter_b":"Oh, and fuck Conservatives. They're the ones who started anti-gun laws. Reagan and the NRA (racist hypocrites) got restrictions for firearms in California in response to the Black Panthers having a PEACEFUL open-carry demonstration. If Obama did the same thing to OPEN CARRY California, you'd probably be screaming for his head on a pike.","commenter_a":"Killing people sanctioned murder to satisfy blood lust and a wanting for revenge. Sounds pretty medieval and 3rd world to me.","post_message":"We traveled the world to ask people about the the death penalty."},{"comment_id":"10153384160134087","commenter_b":"RINO","commenter_a":"And we should listen to Kasich because his numbers are so high? Isn't that why he was on the end?","post_message":"“I don’t have anything against Mr. Trump personally, but we’re not going to scoop up 11-and-a-half million people and ship them out,\" said GOP presidential candidate Gov. John Kasich.  \"He’s disparaged Hispanics and Muslims, and he’s insulted women. These are not the things that unify the country and make us stronger.\""},{"comment_id":"10154686033581336","commenter_b":"Yeah...nothing says 'witch hunt' like having your underlings whack up 13 mobile devices with a hammer...then giving those underlings immunity...then they all plead the 5th except for one who doesn't show up under subpoena.","commenter_a":"Trumps lewd comments must be getting old or too obvious, I woke up today hearing how No presidential candidate has ever threaten to put their opponent in jail, That is because the previous 44 elections there wasn't a candidate with a 30 year crime sheet. God I hate our media.","post_message":"WATCH: \"Mini-Trump\" joins Donald J. Trump on stage at a rally. @webpagelink"}]
