[{"comment_id":"1794488717482719","commenter_b":"Entertainers are daydreamer & live in fairytale world. Reality is not their attribute or focusing on oneself identity. Most live in denial & are good at role playing an artificial character. I'm not shocked at their liberal idealism & doing whatever for attention. These are individuals that struggle with growing up.","commenter_a":"Are they all just insane. Who cares if you cut your hair or any other stupid thing. It only hurts you no one else. So asinine.","post_message":"This is how some liberal women are coping with Trump's election win."},{"comment_id":"1140671769377398","commenter_b":"This lady is such a trash!","commenter_a":"Why didn't they do this when Obama was in office?","post_message":"Thankfully we have Elizabeth Warren in the Senate to call him out.  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1134932883194388","commenter_b":"down, look at the squares on the sides","commenter_a":"I think up it is hard to say!!","post_message":"o.O"},{"comment_id":"10153361395611107","commenter_b":"Class on the left, and no class on the right. She is just another, inept, liberal, lying skank. I put her in the samne group with that traitor, Hanoi Jane.","commenter_a":"Better yet , hit her at her cankles. Paul/Trump ... Trump/Paul for America, not the establishment","post_message":"Guess who I ran into? Tune in to @CBS now to find out why I think she should forever be precluded from being potus"},{"comment_id":"456392161152491","commenter_b":"i dont spank my daughter and she is extremely well behaved. she says please and thank you and your welcome at the appropriate times. she is VERY advanced for her age. I am enrolling her in MMA classes to teach her not to be a little \"bitch\" as you put it. and because she came from my loins, she will be a force to reckon with","commenter_a":"Spanking children teaches them consequence for actions. It also teaches you not to be a little bitch.","post_message":"So what are the alternatives? We look into them:"},{"comment_id":"10154757524712300","commenter_b":"booooooooooooohooooooooooooo","commenter_a":"Got eeeem","post_message":"Anti-Donald J. Trump protesters gather at Bayfront Park (may contain graphic language)"},{"comment_id":"1706384232981728","commenter_b":"5his woman is so evil ,.","commenter_a":"Explain that one...Obama, State Dept, FBI DOJ. If something isn't done to Hillary, than Eric Snowden should be allowed back in the US and not charged.","post_message":"#Petraeus was ruined for one leaked email. #Hillary deleted thousands of emails and sent multiple classified ones—indictment time!"}]
