[{"comment_id":"10154831195946729","commenter_b":"Well, turns out Michelle Obama herself was accused of plagiarizing part of her speech. In fact, the Democrats who are using last night’s speech as a means to cast aspersions might have done well to pause and consider the list of their own high-profile leaders who have been caught plagiarizing.","commenter_a":"Melania Trump Did NOT Plagiarize Michelle Obama’s Speech And This Is Why… The accusation is that Melania Trump “plagiarized” a speech made by Michelle Obama in 2008. Well I’m sorry liberals, she did not. Here are the comments from Michelle Obama in 2008: \"And Barack and I were raised with so many of the same values: that you work hard for what you want in life; that your word is your bond and you do what you say you’re going to do; that you treat people with dignity and respect, even if you don’t know them, and even if you don’t agree with them. And Barack and I set out to build lives guided by these values, and pass them on to the next generation. Because we want our children — and all children in this nation — to know that the only limit to the height of your achievements ...","post_message":"Wow..."},{"comment_id":"977904432246897","commenter_b":"She is an EVIL woman an not sure why she isn't in JAIL @username!","commenter_a":"Who is that masked woman?","post_message":"It's a very simple question:   “Have you seen those very, very controversial videos?”"},{"comment_id":"1245719035484009","commenter_b":"Is the translation is correct? If yes why he should bother. He can marry any time and breed","commenter_a":"This is why America has never nor should have open borders.","post_message":"Video captures a Syrian mother and father preparing their two daughters, ages 7 and 9, for jihad suicide missions."},{"comment_id":"10152884468574877","commenter_b":"Happy birthday you beautiful queen","commenter_a":"Happy Birthday!!!!!","post_message":"We are wishing Lupita Nyong'o HAPPY BIRTHDAY today!!  The Academy Award winning actress received her masters degree in acting in 2012 from the Yale School of Drama and in 2014, she was named \"The Most Beautiful Woman\" by People and \"Woman of the Year\" by Glamour.  LIKE and SHARE to celebrate!! >>>@webpagelink"},{"comment_id":"1085812054871914","commenter_b":"Ignorant pig","commenter_a":"Be careful what you wish for buddy","post_message":"\"I think we should take a drug test prior to the debate.\""},{"comment_id":"1075446135834786","commenter_b":"She's a sell out!","commenter_a":"I don't know who she is. I've seen her before but in what I don't recall. But I really didn't get the joke or whatever it was supposed to be. ...","post_message":"What did you think of Stacey Dash's appearance at the #Oscars? @webpagelink"},{"comment_id":"10154448547351523","commenter_b":"I got attacked by a rott happens. Why are you so short thinking. Now walk away","commenter_a":"SO SAD - and here come the pit bull lovers who will blame everyone/everything to protect pit bulls - how many people have to be attacked/killed before something is done to stop these attacks?? I suffered a vicious attack by a pit bull and it breaks my heart every time I hear of another pit bull attack. Pit bulls killed 232 Americans between 2005 and 2015 - here are the FACTS: @webpagelink","post_message":"\"Two pit bulls ran out after my dog and just ripped it apart.\""}]
