[{"comment_id":"10153377527143984","commenter_b":"Are some people just figuring out she's a LIAR and always will be!","commenter_a":"People need to wake up & research the person they are going to vote for....She is hiding so many things....","post_message":"Supporters of Hillary Clinton are reconsidering their choice for president after learning some stunning facts.   Are you glad to see Clinton's hypocrisy exposed?"},{"comment_id":"10153564661133837","commenter_b":"If they are illegal then yes deport them and yes build a wall preferably with large guns","commenter_a":"He just wants to deport them all, and thinks they're all criminals, and wants to build a wall!!","post_message":"TRUMP LOVES HISPANICS!  Presidential candidate Donald Trump tweeted out this afternoon, \"I love Hispanics!\" to help celebrate Cinco de Mayo.  THOUGHTS - THAT'S SO NICE or THAT'S SO WEIRD?"},{"comment_id":"1647473612211471","commenter_b":"Trump has done nothing against the law and if he did why didn't they file charges or even report it....This is just bull and not important...but on the other hand Hillary can and will be in trouble with these email leaks...statue of limitations is not up on her...so there can be charges brought up on her","commenter_a":"The fact is, that you people have lost all credibility with anyone with the ability to think for themselves...Your obscene bias, is so obvious, it's not even funny anymore....The NY Times has even less credibility, and is viewed as even more bias and corrupt than @username or People, because the previous allegation the Times made a few months ago, was **proven false by the \"victim\" herself**. And you have to understand that the election is *temporary*, and after the election is over, your ratings will still be at records lows, except your reputation/credibility will have been permanently shot, permanently destroyed. This is the price you, your producers and executives have paid to try and skew this election towards Hillary at any and all costs...","post_message":"Ex-beauty queen says it was humiliating for Donald J. Trump to be backstage, \"before you could put a robe or kind of dress yourself, he walked in. Some women were half naked, others were in the process of changing.” @webpagelink"},{"comment_id":"1415272741824926","commenter_b":"If I was as ugly as her I wouldn't be calling attention to my stupidity too !!","commenter_a":"sounds more like Eva Braun more and more!","post_message":"Less than 30 minutes after Donald J. Trump was sworn in as President, MSNBC's Rachel Maddow was calling him Hitler."},{"comment_id":"10153573221561336","commenter_b":"Give a clipboard to a woman...And this is what you get. I live on land and not in a neighborhood for this reason. If I wanted to have one painted hot pink it would not matter :)","commenter_a":"That's why I would never buy a home in an subdivision with a HOA they try to control living !!!","post_message":"The homeowners association says the purple playground must be “subdued and within harmony with other colors of the community.”"},{"comment_id":"1202278743181685","commenter_b":"Lots of estrogen.","commenter_a":"Causation or correlation? Lol","post_message":"Men Supporting Hillary Clinton Have Lower Testosterone"},{"comment_id":"788608041305150","commenter_b":"Seems like a good time to turn off the tap to these law breaking cities. Go Trump!","commenter_a":"STOP THE INSANITY! Defund them and arrest those in charge that are breaking the law!","post_message":"A new study shows that more than 100 sanctuary cities across America received a total of $27 billion in federal grants and direct payments in one year."}]
