[{"comment_id":"10153612119195530","commenter_b":"Nobody at the restaurant saw anything?","commenter_a":"How come nobody saw anything?","post_message":"So what really happened that Wednesday afternoon in 1975?"},{"comment_id":"525788244278422","commenter_b":"Look at her eyes, do you really want this ugly, selfish and stupid woman as your president,,,?","commenter_a":"She won`t be done until she takes her last breath. Shes to damn dumb to quit.","post_message":"Hillary tried to hide the truth, but Gowdy refused to give up until justice was served.  This is amazing. Hillary is finally going to pay for her crimes.  Do you agree Hillary Clinton should be arrested for treason?"},{"comment_id":"1056082027782443","commenter_b":"She needs to speak for herself. Some of us still clean our own houses.","commenter_a":"Well it's probably good she is his ex wife lol","post_message":"Donald J. Trump's ex-wife spoke out in support of the GOP candidate and the need for legal immigrants."},{"comment_id":"10157388184590603","commenter_b":"That wall doesn't work. Many people coming in illegally from Mexico are actually from Cental America.","commenter_a":"I think it will help open discussion about illegal entry into the US. Mexico has a huge wall on its border with Guatemala for the same reason.","post_message":"Do you think think this trip will help or hurt Donald J. Trump?"},{"comment_id":"10153986219495950","commenter_b":"You must be getting paid a pretty penny, lady. #HillaryForPrison2016","commenter_a":"Wikileaks, Hitlery's thugs throwing bombs, stinking libtard filth?","post_message":"“I’m very excited to see Hillary become president,” gushed Natalie Portman."},{"comment_id":"1785556881731423","commenter_b":"The white house will probably be full of naked stripper","commenter_a":"Trump will bring that back","post_message":"Yes!"},{"comment_id":"10156715676250725","commenter_b":"Reilly Steidle they're calling for you","commenter_a":"Lauren Lynn","post_message":"MTV is on the search for the next reality stars of the “Real World,” and fans living in the Chicago area have a chance to be a part of the show this weekend. How to apply ----->   @webpagelink"}]
