[{"comment_id":"897074360335805","commenter_b":"She is an creep and liar..NO FOR PRESIDENT..","commenter_a":"Treason :How about collecting those deleted e-mails .We know you can do it .Obama and few more need to go with her .Sheis not in the boat by herself .Communist","post_message":"Which Hillary Clinton scandal is bigger? Is it the one involving her likely illegal secreting and destruction of email records from her time as secretary of state, or is it the one involving the massive conflict of interest she wholeheartedly embraced by using her family’s nonprofit foundation to collect millions of dollars from foreign government donors — again, during her time as secretary of state? @webpagelink"},{"comment_id":"868758169887103","commenter_b":"crying about the NRA , every lobbying groups receives money from those they represent . Guns sell themselves , new models fly off the shelves and gun stores hardly discount. Women are one of the fastest group of gun owners in the country .Many single mothers and single women carry weapons , it is the best defense . Many women have stopped harassment , rape or assault because they were armed, weapon is often never fired .","commenter_a":"If you read the article, it sounds as if alcohol should be banned from campus. What the article does not say, is you still need to be 21 to legally have a handgun. That and you would still need your concealed carry permit. Concealed carriers are as a group less likely to commit crimes than even the police. Ever time carry options get more loose, liberals cry the streets will run red with blood, but the reality is just the opposite.","post_message":"These bills are moving through state legislatures across the country - here's what you need to know."},{"comment_id":"10153107912406051","commenter_b":"I hope she gets eaten by a carnivorous flower","commenter_a":"Or go egg free. Its possible. Vegan all the way!!","post_message":"We're going through the worst egg shortage in US history. What does that mean? It means get ready to pay a lot more for all your food."},{"comment_id":"10153770425869153","commenter_b":"You can't possibly be that stupid Christine ....","commenter_a":"just read where radical islamic muslims will come in with Syrian refugees so yes I agree with Trump","post_message":"What are your thoughts on Donald Trump's comments?"},{"comment_id":"10158911278605206","commenter_b":"@username, would you feel that way too if you were on an airplane and didn't like the pilot? According to you lilies Trump will destroy America. You might want to hold off on purchasing any party supplies. According to you dandelion's Putin will take over America because of Trump. You daffodils won't be allowed to throw any party's if that's true...","commenter_a":"The world deserves Donald Trump. No doubt about it.","post_message":""},{"comment_id":"10154609681272300","commenter_b":"Actually she was not fat. The rules do not say you have to be a size 2.","commenter_a":"trump has no room to talk about calling anybody miss piggy especially when he posts pictures of him eating Mcdonalds and KFC on his private jets.","post_message":"Donald J. Trump called her “Miss Piggy” and “Miss Eating Machine” because she gained weight after winning the Miss Universe crown."},{"comment_id":"1210812922267700","commenter_b":"Fools! All of them!","commenter_a":"Liberalism hit squads at their finnest huh Rush.","post_message":""}]
