[{"comment_id":"974532882587184","commenter_b":"Yeah but what are you going to do about your wife?","commenter_a":"Me too def on the pedophile down low","post_message":"Welcome to this crazy Christian Dad's painfully awkward attempt at sex-ed."},{"comment_id":"1717613511850715","commenter_b":"Shoot everyone of those goat humpin bitches! Problem solved!","commenter_a":"It's time to take a stand America !!!","post_message":"Muslim Man Kills Pregnant Woman For Coming To Close To His Mosque. He ended two lives for nothing. Justice needs to be served. What do you think his punishment should be?"},{"comment_id":"10152785175031051","commenter_b":"Headbutt got her an ass whipping-lol","commenter_a":"I can't believe I watched this. I liked the headbutt though. lol","post_message":"It started out as an ordinary day at Walmart. Then, without warning – all hell broke loose."},{"comment_id":"1106451702729020","commenter_b":"Go girls. Rape is never justified!","commenter_a":"It's sick that they were still trying to give excuses even though there is never an excuse for rape. Once that girl brought up raping 6 year olds they shut right up! They know it's not right but they're still trying to make up ways to say it's the women/girls' fault. This is so unacceptable and disheartening. 😔","post_message":"These teenage girls are confronting rape culture in India. This is what bravery looks like. (via AJ+)"},{"comment_id":"10153873855796037","commenter_b":"He was perhaps just as bad but we will all suffer the negative consequences of their actions.","commenter_a":"Obama's abuse the executive privilege and failure to uphold the constitution has set a dangerous precedent for all those who follow, whatever political party they may belong to...","post_message":"Here’s why President Barack Obama’s actions could empower Donald J. Trump’s Muslim ban in the future."},{"comment_id":"10153491404021680","commenter_b":"We live in a generation that feels like everybody owes them something. @webpagelink","commenter_a":"You guys are so biased, it's disgusting.","post_message":"Bernie Sanders must run a gauntlet of closed primaries and Hillary Clinton strongholds next week."},{"comment_id":"10154416469089342","commenter_b":"@username deal with it, pussy.","commenter_a":"Rip","post_message":"BREAKING: Former Cuban leader Fidel Castro has died at age 90"}]
