[{"comment_id":"1195176803855108","commenter_b":"They, Mexicans, would have had more support, and got more support, but the riots have highlighted the burden they are on our nation AND the quality of the people involved. Now more than ever we want them out of here. The illegal aliens are criminals, it is that simple - but not only here illegally, but getting benefits and even legal advantages not given to Americans (like conviction and released to streets). Illegals are getting better benefits than many American's in need, BUT let's just consider one aspect that without any doubt is unacceptable; illegals are getting aid while vets die waiting for help. We must correct this problem. ONLY Trump will start the process. Thanks you Mexican rioters - you have reached a new low of acceptance in OUR nations. You are creating a new population of racists - it isn't hard to hate watching your antics!","commenter_a":"Taxpayers On BOTH Sides -- Aren't you sick and tired of all the destruction and crapola coming from these little punks and thugs, illegals, and paid rioters?? Taxpayers have to PAY for their destruction and mess! These PAID for Rioters should be ARRESTED, given LONGER jail time and VERY HIGH FINES -- also, if on government welfare programs or student benefit programs - they should be TERMINATED Immediately! Also, Make Them Do Community Service - Cleaning up All That They Destroyed. No Punks & Thugs, or George Sorsos Paid for Rioters, Muslim Agitators, or Law Breaking Illegals Are Going to Stop Donald from Making America Safe, Secure and Great Again! No Left Wing Owned, Biased Media will stop Mr. Trump! The more they try to throw the dirt and lies on Mr. Trump - the more I support him and his agenda, which is to make America SAFE, SECURE and ...","post_message":"KEEP WAVING THOSE MEXICANS FLAGS AROUND....    @webpagelink"},{"comment_id":"10153059352079342","commenter_b":"Sick sick person, wonder how she would like that done to her. She looks mean! Glad she is not my grandmother.","commenter_a":"guela knows","post_message":"A grandmother from southwest Houston is accused of burning her 12-year-old granddaughter with a hot tortilla pan after the girl got in trouble at school for writing on the chalkboard.  FULL STORY---> @webpagelink"},{"comment_id":"10153567353788984","commenter_b":"I will have one long after your ass is gone","commenter_a":"that just show the driver of the truck isn't paying attention what is going around his ride. That ass hole would be wearing salt rock in his britches","post_message":"I don't care what your opinion on the Confederate flag is, there's no denying that what this guy did is truly insane..."},{"comment_id":"1614898715485754","commenter_b":"No need to worry, Just Drink a Coffee ☕","commenter_a":"Brad Sherman","post_message":"Two days ago, an enormous asteroid flew past Earth. It was half as close as the moon. And we barely saw it coming."},{"comment_id":"10154886159283010","commenter_b":"Hippie bitch is a nobody","commenter_a":"The left is still jockeying for attention...and this is the best they've got..Less than impressive..","post_message":"A political twist on a holiday classic."},{"comment_id":"484244465097180","commenter_b":"Why does anyone listen to her?","commenter_a":"PIG","post_message":""},{"comment_id":"10153526527726770","commenter_b":"What a buch of sissys can't block it","commenter_a":"It is this lack of backbone to do the right thing that is causing people to be so angry at the establishment! Stand up and be counted! You might be surprised at the response!","post_message":"A former Delta Force commander,says President Obama is letting terrorists flow across the U.S.-Mexico border --- and that Republicans are too \"paranoid\" to stop it."}]
