[{"comment_id":"1229557370394944","commenter_b":"The GOP doesn't like it when the democrats do to them what they had been doing to the democrats since Obama was elected.","commenter_a":"Games. . .ugh! Both sides need to just stop them!","post_message":""},{"comment_id":"10153264086439342","commenter_b":"All you women bashing this woman are evil! Women are the quickest & most harsh to tear another female apart! Low life, heartless, evil women!","commenter_a":"The amount of alcohol that it would take for me to touch that would kill me...","post_message":"A Spring woman says she was sexually assaulted by a deputy during a traffic stop earlier this summer."},{"comment_id":"905141892877096","commenter_b":"You are a gruberized voter.","commenter_a":"Based on the polling from this thread Roy should keep his money and not bother to get re-elected. @webpagelink","post_message":"Missouri was one of the first states in the nation to reject President Obama’s fundamentally flawed health care law. For the past five years, I’ve heard from countless Missouri workers, seniors, and families who are facing higher costs and fewer choices due to the president’s health care take-over. As we mark the 5th anniversary of #ObamaCare becoming law today, I’m still fighting to repeal this flawed law and replace it with common-sense health care solutions."},{"comment_id":"10152868223844342","commenter_b":"You all ladies is nutts","commenter_a":"The mom went looking for trouble. This all would not have happened if she would have been the adult and just let it go, but she couldn't. She payed the ultimate price and now this teen is going to have to answer to a judge. No one wins in this situation. Two families lifes are forever changed. Smfh","post_message":"Police tweeted this photo of the suspect in a road rage case that left a #LasVegas mother dead  FULL STORY @webpagelink/  Photo courtesy Las Vegas Police Department"},{"comment_id":"1611989915762064","commenter_b":"Women are objects to Trump- not people. Unfortunately, that's nothing new and despite all the changes in the way our society views and treats women today, they are still objectified. Some women today even objectify themselves- Beyonce, the Kardashians, many others who make themselves sex objects in order to \"succeed\". As a female, you can't be an actress, a musical artist, a broadcaster on CNN or any other job in the public eye unless you're young and attractive. So if you're shocked or offended at Trump's words, you've been living under a rock. There are tens of thousands of men who think and talk like him and they're your fathers, brothers, husbands, co-workers, bosses, judges, CEOs, doctors, lawyers, cops and US Presidents. It's nothing new and it will never change.","commenter_a":"Sad for her. He is such a shameful person.","post_message":"JUST IN: Melania Trump issues statement following release of husband Donald J. Trump's 2005 sexually-charged remarks: \"The words my husband used are unacceptable and offensive to me. This does not represent the man that I know.\" abcn.ws/2dmz2yg"},{"comment_id":"10154031990961636","commenter_b":"Yusuf Saleh shut up","commenter_a":"It disturbs me that people have used the laughing response to this. Because domestic violence and child abuse (not to mention sheer ignorance and sexism) is just hilarious(!)","post_message":"He's on the run"},{"comment_id":"10153916920276350","commenter_b":"The dumb lady who filed said her lips started drying after putting it on...so she put more on. Idiot.","commenter_a":"I used this, got a rash and it dried my lips out so bad that they cracked and bled. I had to get medication to heal my lips, but I STOPPED USING IT!!!!!! It's not rocket science. If it hurts you or doesn't work, don't use it. I wouldn't sue over it even though it was nasty looking and hurt like no other.","post_message":"Have you had any skin issues using eos lip balm?"}]
