[{"comment_id":"10153165834319411","commenter_b":"Errrmm... only one that i can think of.","commenter_a":"Russian threat !! NATO's a war monger since its creation,based on Anglo Saxson ,Viking ,etc...of blood thirsty tribes !","post_message":""},{"comment_id":"1844880965799014","commenter_b":"Despicable, she has done this before....","commenter_a":"How long have these two been doing that kind of stuff? Looks kind of brazen to me! If that were my property, it would have been a totally different outcome.","post_message":"Totally. Busted. Sure, they're caught red-handed, but just wait until you see how they respond..."},{"comment_id":"10153268798664170","commenter_b":"I'm sure asexuals all over are just shaking their heads and thinking the rest of the world is delusional in this quest for \"happiness\" which Hollywood and Madison Avenue thrive upon.","commenter_a":"Gay conversion therapy.... Sounds like a good way to convince gay youth to commit suicide. Let them be who they are. Perhaps we should have idiot religious zealot therapy","post_message":"I think families can make this decision for themselves, don't you?"},{"comment_id":"1711261402459148","commenter_b":"Hilly would be in the slammer if she wasn't in the cartel","commenter_a":"BERNIE","post_message":"Chaos on the convention floor as the Stop Trump delegates chant for a \"roll call vote.\" RNC officials officials denied the roll call vote over the rules.  Fuill convention coverage: @webpagelink"},{"comment_id":"1477131165645723","commenter_b":"She is a phony douche like her old man.","commenter_a":"Lying runs in the family!!!!","post_message":"Of course it is..."},{"comment_id":"10152589675067623","commenter_b":"Im on reserve Obama","commenter_a":"And I asked the cable co. to lower its rates!!","post_message":"#BREAKING President Barack Obama sends letter to Congress requesting authorization for the use of military force."},{"comment_id":"10153823675392235","commenter_b":"Truth hurts bitches!","commenter_a":"Oh you f****** douchebag liberals have your head so far up your asses if it wasn't for us good white heterosexuals paying all the bills for your lazy asses because you want everything handed to you for free because you believe you're entitled to everything that anyone else has and not willing to work your ass off for it Donald Trump is point on need to shut our f****** borders down. If that's racist then I'm proud to be a racist and stand up for my white skin! You f****** liberals can f*** off and die!!","post_message":"This is truly hilarious."}]
