[{"comment_id":"501575200039916","commenter_b":"WANTS TO KEEP AMERICANS STAGNANT, MOVING BACKWARDS AND PAY HIGHER TAXES TO SUPPORT IMMIGRANTS COMING OVER OUR BORDERS FROM ISIS COUNTRIES TO PUT AMERICANS IN GREAT DANGER, WANTS TO KEEP MINORITIES IN DEMOCRATIC OPPRESSION, POVERTY, JAIL, AND HIGH CRIME, NO FUTURE, WELL WHY NOT VOTE FOR HILARY CLINTON.","commenter_a":"Yes","post_message":"Question of the Day: Should the media be giving Tim Kaine's past comments about President Bill Clinton more attention? Share your thoughts below."},{"comment_id":"10153277362054170","commenter_b":"she is such STUPID IDIOT","commenter_a":"Her strategy, which has worked in the past, is to blame everything as due to \"Right-wing extremists\" and denounce reports of her past as \"old news.\" The liberal press will support her.","post_message":"Well, the much-awaited Hillary announcement video is out, and we've got it here. If you can find a rationale for a Hillary presidency anywhere in it, by all means let us know. We couldn't."},{"comment_id":"1022105807844423","commenter_b":"@username Mexico can barely afford to do anything for it self what makes you think it's going to pay for a damn wall? Because let's think about this..America is scared you are living in fear. Last time I checked Toddlers kill more people with guns per year in the USA than Terrorists do.","commenter_a":"As soon as #DonaldTrump builds the wall, Hillary needs to be tossed up and over the wall into Mexico!! #Trump","post_message":"Making public colleges and universities tuition-free is not unrealistic. It's necessary. — Sara Goldrick-Rab"},{"comment_id":"180851402403803","commenter_b":"Your a dumb bitch 😂😂","commenter_a":"@username dude this reminds of all of us 😂😂😂","post_message":"Friends like this  #WSHH"},{"comment_id":"746903725500205","commenter_b":"she is a disgarce and should be reprimanded so should cbs and the nfl they truly are responsible for giving this racist cop hating person a platform in which she was able to spread hate and racism","commenter_a":"YES.","post_message":"Congressman Absolutely Unloads On Beyonce For Vile Halftime Show  She completely overstepped her boundaries.  Do you agree with this Congressman?"},{"comment_id":"496464583811469","commenter_b":"we are not picking on her because she is a women!!!!!!!!!!!!!! Get that straight right off! we are stating that she has a very long line of a shady past, and if you people dont get your head out of the sand it could very well damage our country more than what we can correct. She will never get my vote, already saw her in action and it was not a pretty site.","commenter_a":"I can't believe how mean and cruel people are!!! It's sad. Hillary is not perfect, no one is!! She has made mistakes just like all the other presidential candidates. Every person that has run for President and every President in the White House has made lots of mistakes. Everyone picks on her because she's a woman!!!!! I'm thinking seriously about voting for her.","post_message":"Trump says Clinton is a woman abuser who would be a horrible president. Agree or disagree?"},{"comment_id":"469085879883119","commenter_b":"Except for people who saw it flying over their state capital day after day, a flag that also flew with burning crosses and nooses around the necks of limp bodies. Sick of fucking people saying this is a diversion. First of all, it's pretty damn serious to A LOT of people. Secondly, you act as if these news stories would be discussed anyway. Anyone stupid enough to think real shit is covered by the MSM is the true \"idiot sheep.\" Grow the fuck up, we have a nearly unlimited access to all sorts of information. If this \"diverted\" you, you were never paying attention.","commenter_a":"I read some of the commits and have to wonder if red necks get the discovery channel. If all of mankind's dna began in Africa. What does that make all white people on earth? Some different people but it is the rays from the sun that could be a problem.","post_message":"While the media turned a tragedy into a debate over a flag, here are 10 major stories you might have missed"}]
