[{"comment_id":"10153861731493352","commenter_b":"Beat you make ass. Seems like that's what the people in the world needs.. #anasswhipping","commenter_a":"Haha. Wow.","post_message":"Woman frantically calls police after she finds a naked intruder inside her house taking a shower and doing his laundry"},{"comment_id":"10154056014236336","commenter_b":"I've heard liberals say that the Constitution is a living,breathing thing so many times! This is because they want to change America's FIRM laws to fit their Anti American agenda! Obama and the Anti American socialist judges do not have the right to make law! Thats how Obama's illegal Obama care was approved! I fear that our once free country is in grave jeopardy of being overrun by these evil Marxist! I think it will get so bad that people will be forced into defending their family s, themselves,their neighbors, their freedom,the Constitution and their Country in what ever means necessary! My God protect us!","commenter_a":"Guns and ammo.... Buy them now while you still can. God Bless America (what's left of her)","post_message":"U.S. Supreme Court Justice Antonin Scalia defended interpreting the Constitution as it was originally written and intended.  Scalia passed today after serving on the nation's highest court for 30 years. fxn.ws/1obcGnN"},{"comment_id":"10152692514188299","commenter_b":"All this talk...............start calling your congressmen, bombard them with calls until they DO something....................","commenter_a":"What the hell is wrong with this guy? Most Americans are against this.","post_message":"Five More Terrorists Transferred Out of Gitmo … @webpagelink"},{"comment_id":"10154614899766729","commenter_b":"The woman is already bought and paid for, she is an insult to any decent woman!","commenter_a":"Bitch please!!!!!!!","post_message":"Where is the mainstream media on this? Complete silence..."},{"comment_id":"1055345397919589","commenter_b":"Natural selection for the girl that's in the bikini","commenter_a":"Wow","post_message":"LIVE FROM HOLLYWOOD BEACH - Take a look at LIVE video from our Hollywood Beach Cam where the outer bands of Hurricane Matthew are making their presence felt."},{"comment_id":"1704858546467924","commenter_b":"Ha-Ha! She is starting to look like James Earl Jones. Too bad she's a dumbass.","commenter_a":"Black Mrs Potato Head. yikes.","post_message":"Whoopi Goldberg is just plain GROSS...   I hope this means the end of The View!"},{"comment_id":"967905263263639","commenter_b":"She needs to be in jail!","commenter_a":"No just you","post_message":"EPA Chief Reveals Her 'Trashy' Upbringing And What She's Sure All Families Did Pre-EPA [Video]"}]
