[{"comment_id":"1175029912517037","commenter_b":"Hal the point is we do need to tighten our borders, there are too many illegals here that get a free ride from the tax payers, and as much as people are going to hate this, if you came here illegally the children you have here are illegal. So, I do agree with you just never heard of known a Canadian to come here just to have a baby.","commenter_a":"look people. If you come to this country legally, doing all the appropriate paerwork and forms, any kids you have that are born here will be American Citizens. That won't change. What we want to change is the Anchor Baby tourism that flourishes on the West Coast, with the Asian women travelling here on 'vacation' to have their babaies in specially marketed motels just for them, so that their children, and them by association many times, would be American Citizens. And those illegal immigrants who cross our northern and southern border, from a multitude of countries, who break the law by sneaking in like a thief in the night, who have their babies here hoping for the chance to stay with them. People should not be rewarded fro breaking a law.","post_message":"With a renewed conversation challenging birthright citizenship, a look back at the 1898 case that first established the legal precedent in the U.S."},{"comment_id":"10154523076746028","commenter_b":"Milo is trash","commenter_a":"And most of you laugh when our president calls all of the BS networks and papers \"fake news\"!","post_message":"Eek."},{"comment_id":"484282168429030","commenter_b":"deport her and all the rest of the muslims in america","commenter_a":"Yes","post_message":"She walked on the plane wearing her Hijab, boy was that a mistake.  Shariah Law is dangerous, we support the patriots that stand against it.  Should Shariah be banned in all 50 states?"},{"comment_id":"10157199580185231","commenter_b":"Congratulations!","commenter_a":"Congratulations","post_message":"This will make her the first African American recipient in the award’s 21-year history. Congrats Gwen Ifill!!"},{"comment_id":"1145897778760904","commenter_b":"I have the same solution no matter the skin color......shot them, protect the population from killers.","commenter_a":"Throw him in a cell with a bunch of big angry sex offenders.","post_message":""},{"comment_id":"1632165196804485","commenter_b":"@username how are we snowflakes if we don't want to hear the opinion of some feminist being sad about a pipeline when there are thousands already in this country. To the other side of the wall for you.","commenter_a":"Unfollow.","post_message":":("},{"comment_id":"10155091022728734","commenter_b":"Look at these white American men!! Hahahah! Look at these savages","commenter_a":"Disgusting","post_message":"A 37-year-old man has been arrested after allegedly trying to pay a mother to have sex with her seven-year-old daughter."}]
