[{"comment_id":"10153817887769203","commenter_b":"Michelle will body slam Barry!","commenter_a":"Coming from the first female POTUS this is funny. Obummer, you can't handle your own angry wife let alone Putin....get out of the White House you effeminate jackass","post_message":" can handle a bunch of CNBC moderators at the debate. Let me tell you, if you can handle those guys, then I don think the Chinese and the Russians are going to be too worried about you."},{"comment_id":"10153079641390950","commenter_b":"Bitch, fuck you and the white man!","commenter_a":"Jorge Ramos can kiss my hispanic behind! Go back to Univision y callate la boca! Legal hispanics are tired of paying for ANY illegals from ALL COUNTRIES (not only Spanish speaking) with our hard earned tax dollars!","post_message":"JUST NOW: Donald J. Trump tells reporter Jorge Ramos to sit down, has him escorted from press conference: \"Go back to Univision!\" \"You can not deport 11 million people,\" he yells: @webpagelink"},{"comment_id":"800418456754419","commenter_b":"She shd be in jail","commenter_a":"Nobody in the GOP can't come to Hillary's standards, there is no comparison.. She is one smart and prepared capable Madam President!","post_message":"The #GOPDebate may have ended, but CNN’s Chris Moody is live, taking your questions from the post-debate spin room in Miami."},{"comment_id":"969205239835501","commenter_b":"Karma ain't she a bitch!!!","commenter_a":"Karma is a bitch. Racism and bigotry are not signs of a patriotic, freedom loving American.","post_message":"The couple that hates together stays together, but their hypocrisy has finally come back to bite them."},{"comment_id":"1113200062092053","commenter_b":"Hillary is the bigger liar and has laundered millions for her own use through the Clinton Foundation. At least Donald actually worked for his money. She is a murderous also. Her stint as Secretary of State and her private e-mail server has put us in great danger from our enemies. If you plan to vote for Hillary raise your right hand and slap yourself in the face!","commenter_a":"I really like you Dr Carson but if this is true why do you support TRUMP, who lies, has no common sense and won't release his tax returns. He's hiding a lot and we all know it.","post_message":"People all over the nation are starved for honesty and common sense."},{"comment_id":"10153472677806051","commenter_b":"Ugly and a moron. She'll make some desperate man really happy","commenter_a":"😳😱","post_message":"This model decided to remove six ribs to look like Jessica Rabbit. Now she's facing the consequences."},{"comment_id":"10154235366227060","commenter_b":"Yea and Mardi Gras day they'll be showing their breasts for beads!!!","commenter_a":"Yall be safe.....show them","post_message":"The Women's March New Orleans begins now from Washington Square Park."}]
