[{"comment_id":"521903667998585","commenter_b":"So much for ESPN claiming to be a \"all inclusive\" company.","commenter_a":"We no longer have free speech. Opinions are free speech. These liberals are destroying the Consitution.","post_message":"The final straw came when Schilling shared a virulent anti-transgender meme on Facebook. via NBC Sports"},{"comment_id":"1344000762286340","commenter_b":"I wonder how much Hillary paid all of these women","commenter_a":"My breast feeding children touched me inappropriately. Good Lord, People,..... Killary's Husband raped people. No comparison. Doh!","post_message":"New allegations against Donald Trump."},{"comment_id":"595817020606725","commenter_b":"Excellent point!","commenter_a":"If the Hillary Clinton fans were so well-educated, then tell me why they are turning out in Mass numbers to destroy property, assault their fellow Americans, and anyone who doesn't share their beliefs. My guess is that most of these people don't work and probably didn't even vote. If that's your following Hillary, I am so so very glad that you lost.","post_message":"I believe Spiderman once said that a “tree is known by it’s fruit” and “wisdom is vindicated by it’s children.”  No, wait… that wasn’t Spiderman. It was Jesus."},{"comment_id":"525608654307175","commenter_b":"Have dreams that often come true about other people.","commenter_a":"How do you know if you have a gift? My husband thinks I am a empath... I feel energies but don't know how to interpret them.","post_message":"We LIVE with Theresa Caputo! Send us your questions for the Long Island Medium."},{"comment_id":"1219889091393445","commenter_b":"Is it racist to say pot calling kettle black ?","commenter_a":"Cummings is a walking violation of ethics. Pot call.","post_message":"Whoops."},{"comment_id":"10154237542506162","commenter_b":"Years wasted but enjoy that compensation my man","commenter_a":"I'm so sorry you lost all those years","post_message":"WRONGFULLY CONVICTED: A former U.S. sailor who has spent 33 years in prison will be released as early as today after new DNA evidence showed he was wrongfully convicted of murder and rape... @webpagelink"},{"comment_id":"544743005709397","commenter_b":"@username go play in you sand box.","commenter_a":"You Trumpeters are rotten to the core to attack a decent man like @username like this. For shame. I supposed flies are attracted to stinking matter, so what else would we expect.","post_message":"Republicans, this is your party. You have to decide who you are. Are you a collection of principles, or are you about a man?"}]
