[{"comment_id":"10154384594879705","commenter_b":"@username which of these girls is overweight? What weight should girls be according to you Bill?","commenter_a":"Ten bucks says that all the people saying they're disgusted are the same people who get pissed when someone calls a thin girl 'too thin' because apparently body positivity is only for bodies YOU feel positive about. Right.","post_message":"No photoshop, no frills."},{"comment_id":"1109422589147098","commenter_b":"Dumb whores for Trump","commenter_a":"He has no respect for anyone. Scum","post_message":"In a battle between Trump and Intelligence, Intelligence wins."},{"comment_id":"10153755960426101","commenter_b":"Your mother gives rimjobs","commenter_a":"9/11 was an inside job","post_message":"EXCLUSIVE VIDEO: A massive residential Dubai skyscraper was engulfed in flames as authorities rushed to evacuate hundreds during New Year's Eve celebrations. At least a dozen people are injured, primarily due to a stampede rushing to escape the growing fire. Updates from Newsweek Middle East: @webpagelink"},{"comment_id":"10153477974742217","commenter_b":"When u search at this matter, u will find that these are european muslims.... not arab muslims or the east muslims. they misunderstood the islamic religion. I hope return to their mind.","commenter_a":"We reject and condemn terroristic attacks which happened in Brussels today. These attacks make our travel to the Union Europeans' countries a more difficulty, and will sufer the syrian refugees and arab muslims who work there from a compulsive procedures at this regard from now on. These actions obstruct anyone wants to travel so as learning and resume his study and those that travel to enjoy short trip. #Islam is a peace religion. we will find your media tell u that muslim persons commited these actions..... but these persons don't believe in any religion, yes. they are extremists. they don't belong to us. All of us feel sad for u","post_message":"Belgian PM calls for \"calmness and solidarity\" in \"black moment\" for country. #Brussels   Latest: bbc.in/21ENlj8"},{"comment_id":"10153246589888445","commenter_b":"I hope all these dumb fucks on her get arrested by the feds no one wants your dirty swag bitch","commenter_a":"Haha don't worry we got your back here in co haha oh and water","post_message":"NEW: California Wildfires Are Affecting the Pot Industry."},{"comment_id":"881902208536195","commenter_b":"At least he is not a puppet, says the supporter of Marxist-Leninism.","commenter_a":"Funny how the enemy jumps straight to laugh..at what seems to be normal..we love you BOB born to be stronger, born to live longer...91years of age...and still fit ...let them laugh...You are the GREAT ZIMBABWE WALL..you don't need to go to care home...unlikely some white folks at your age will die alone in their care home...without grand kids....","post_message":"Robert Mugabe orders the internet to delete images of him falling over at event... and this is how it responds."},{"comment_id":"614194488771130","commenter_b":"Good for them and if was some other county's,or orig,before 1860 or maybe south it before civil main thing is who cares when was adopted by south or when ain't THERE flag now belong's to the SOUTH and USA.now.AND GO SOUTH go TELL THE IDIOT'S TO Get LOST UR FLYING IT FOR EVER OR ANYONE ELSE WANT'S TO FLY IT in THIS CNTRY'S 50 not 57 or 58 states u idiot abomination it's 50","commenter_a":"fantastic!!","post_message":"NASCAR fans at Daytona refused to hide their support of the Confederate flag.  This is true patriotism. They are proud to be Americans.  Do you support their refusal to back down?"}]
