[{"comment_id":"10153182332356051","commenter_b":"i dont read anything about this lying bitch","commenter_a":"Hell no","post_message":"Here is how Hillary Clinton is defending herself against the e-mail scandal. Do you believe her?"},{"comment_id":"10153265498530047","commenter_b":"@username over 5million LOL. Dead people and illegals","commenter_a":"SIGN THE PETITION / CLICK ON WEB SITE Justice Scalia one of the most brilliant and ardent defenders of the Constitution has just passed away. This is a huge, deeply felt loss. We must not forget that the next justice could impact the Court and the direction of our nation for decades. The American people deserve a voice in this decision: @webpagelink","post_message":"President Obama will stop at nothing to force his nominee for the U.S. Supreme Court through the Senate before his last year in office comes to an end.      But we can stop this from happening.  SIGN & SHARE our urgent petition to the U.S. Senate today: @webpagelink"},{"comment_id":"10153154056999087","commenter_b":"I dont believe Obama is favorable in other countries eyes as i have seen some of what other countries say about him bowing to the arab king,,while not saluting our countries flag that many died for.. as far as the immigrant worker.. maybe in yester year they took menial jobs but now i know plenty that take 20,00 hr jobs from americans who are willing to do it...just by being here being here illegally oh and should i mention the illegals get paid cash so most collect welfare and food assistance along with housing , wic and health benefits the whole time....im tired of seeing my fellow americans collect welfare and food assistance cos they cant find a job to support their families.. Being illegal is breaking the law..if they cant follow our law to stay out unless processed properly and not enter illegally do you really believe they will ...","commenter_a":"Donald Trump is on his way to offending every nation, we deal with.... want to really watch us lose our standing in the world? Elect this dufus.","post_message":"\"Negotiating with Japan, negotiating with China, when these people walk into the room, they don't say, 'Oh hello, how's the weather, so beautiful outside, isn't it lovely? How are the Yankees doing? Oh they are doing wonderful, great,' \" Donald J. Trump said. \"They say, 'We want deal.' \""},{"comment_id":"10153709197621336","commenter_b":"Was he having a stroke?","commenter_a":"Billynyvy Martinez","post_message":"WATCH: One Southwest Airlines employee could barely get through his safety spiel without nodding off and slurring his words."},{"comment_id":"10152784038336491","commenter_b":"Preaching to the choir, sister! One of many reasons I'm now divorced.","commenter_a":"Now if only science could find a man worth having......","post_message":"Science shows that there are quite a few health benefits of getting intimate."},{"comment_id":"10153669606379060","commenter_b":"@username - my point is that Germany is too influenced by its past, too ready to apologize for its past. In the 90s, the extreme right-wing Republikaner and the DVU gained in support because of this blind open-door policy. What is more, Germany expects other EU countries to do the same, irrespective of the cost. I say that this has to stop.","commenter_a":"The Germans typically let in loads of war refugees. More than they can handle. It's their way of apologising for World Wars 1 and 2. In the 90s, they let in 320,000 war refugees from Yugoslavia. What happened in German towns ? Property rents skyrocketed and the crime rates went right up. What's worse, the Germans expect every other country to do the same. Whacky open-door immigration. The UK needs to leave the EU, get sovereignty over its borders and immigration / refugee legisation back and tackle the problem as a single nation. This time, the Germans are letting in 800,000 war refugees from Syria. Absolutely crazy.","post_message":"Ever since Angela Merkel took the lead on the migrant crisis, critics began speaking as though she created it. This is nonsense"},{"comment_id":"10153058403318984","commenter_b":"Americans should shoot and kill all radical invading muslims on sight.","commenter_a":"Stop by my place I will make you a BLT with extra bacon","post_message":"Mind blown. One of the world’s biggest schoolbook publishers just ‘banned’ this to avoid offending people... There is no way they can be serious!  Do you agree that we have got to get a grip on all this nonsensical political correctness?"}]
