[{"comment_id":"10153170103931770","commenter_b":"She's improved at lying ! And she makes Barb not feel like such a hag.","commenter_a":"Crap","post_message":"Barbra Streisand said she thinks Hillary Clinton's campaign strategies have improved a lot over the last few months."},{"comment_id":"1673236709627945","commenter_b":"I can't stand this big eared liar!","commenter_a":"Bull crap! You say that federal background checks don't work when it relates to gun control but when it relates to checking refugees you say it does so apparently it only works when you are telling the public lies to get what you want = pitiful","post_message":"\"Any refugee coming to the United States, some of them victims of terrorism themselves, will continue to get the most intensive scrutiny of any arrival.\"  After meeting with his national security team, President Barack Obama said that \"our intelligence and counterterrorism professionals do not have any specific and credible information about an attack on the homeland,\" but that \"we have to be vigilant.\""},{"comment_id":"608933979286362","commenter_b":"Gennifer Flowers: Bill Clinton Told Me 'Hillary Had Eaten More Pu**y Than He Had'","commenter_a":"i like hillary clinton","post_message":"If we unite together, we will rise together."},{"comment_id":"10153720539999749","commenter_b":"Andrea Lopez who is an American? You are an illegal 2 me","commenter_a":"I think Trump can cause the 3rd world war with only his mouth , the N.korean dear leader wldnt stand him for a minute","post_message":"\"Ivanka’s intervention has only served to undermine her own integrity. Just one more mortifying moment in a long line of Donald Trump’s dealings with women.\""},{"comment_id":"10154398090436523","commenter_b":"She loves abortions. Of course her mother chose life for her. Lol","commenter_a":"Just look who they are and what their purpose is. This is just Evil and Horrendous!","post_message":"WATCH: Women's March on Washington, D.C."},{"comment_id":"10154014053348984","commenter_b":"SHES A RACIST BIGOT ANYWAY","commenter_a":"I don't know anyone that likes that show, or doesn't think that Whoopie is whoopie.","post_message":"Donald J. Trump has had enough with the liberal ladies of \"The View.\" In just one word, he absolutely destroyed host Whoopi Goldberg... this is brutal.  This goes to prove one thing... never pick a fight with The Donald."},{"comment_id":"548837575304535","commenter_b":"Bill Clinton could get away with anything.....all Hillary has ever cared about is \"power\". God forbid her from being President.","commenter_a":"Butch and Billy Americas First family good replacement for the Kennedys","post_message":"They can't cover this one up!"}]
