[{"comment_id":"10154176687291337","commenter_b":"Good now the bitch dont have a job...now go get that unemployment check","commenter_a":"Freedom of speech, freedom of press, wwlcro American land of lies","post_message":"YIKES! Terrible move by this anchor..."},{"comment_id":"943618162339946","commenter_b":"^ What an asslicking, apologist bitch.","commenter_a":"It's his fathers fault.... He had warrants and ran.... Then tried to run over police.... Look up the story before u believe this wack ass page- that boys father deserves to be charged with murder","post_message":"Courage, bravery, hero, protect, serve... These words are not affiliated with the cops who killed this boy.   Full story → @webpagelink Police The Police | Filming Cops"},{"comment_id":"1354028091302090","commenter_b":"Thank you for telling it like it was and appeared. I completely agree with your assessment. I am sure some women were just following what everyone else was doing: clueless, just part of the cattle drive to slaughter. Made me sick to my stomach seeing pictures of the filthy, vile costumes they paraded around wearing. Unbelievable, no shame whatsoever!! Hillary's minions!","commenter_a":"Straight talk: haven inspired me to join your cause, Hubbard went on. anything, you inspired me to run the other way.","post_message":"You've got to see this!"},{"comment_id":"10152716358611680","commenter_b":"Red herring fallacy and straw man fallacy.","commenter_a":"This is sexist and Politico and the lib media are trying to hide this story. Nice try. @webpagelink","post_message":"Kelley Paul says \"to have that label put on him, that really upset me.\" @webpagelink"},{"comment_id":"10153155479946051","commenter_b":"I take it, SHE is a woman who likes to dress as a man.","commenter_a":"Disgusting","post_message":"This soldier has been told point blank: You must wear a female uniform if you want to participate."},{"comment_id":"881902208536195","commenter_b":"At least he is not a puppet, says the supporter of Marxist-Leninism.","commenter_a":"Funny how the enemy jumps straight to laugh..at what seems to be normal..we love you BOB born to be stronger, born to live longer...91years of age...and still fit ...let them laugh...You are the GREAT ZIMBABWE WALL..you don't need to go to care home...unlikely some white folks at your age will die alone in their care home...without grand kids....","post_message":"Robert Mugabe orders the internet to delete images of him falling over at event... and this is how it responds."},{"comment_id":"1021161244667320","commenter_b":"Thank you Sir for your service. You inspire - Me - to be a better person.","commenter_a":"How very inspiring to Americans!","post_message":"'God Kept Me Alive for a Reason'  Can we get 5,000 'LIKES' and 'SHARES' for this HERO?'  @webpagelink"}]
