[{"comment_id":"496937747163472","commenter_b":"Put the hag in prison","commenter_a":"I like that picture of Hilliary, \"hands up, bitch, you're under arrest.","post_message":"New documents released shows incriminating evidence that could put Hillary away for good.  She is a terrorist. We need to act now.  Should Hillary Clinton be arrested for treason?"},{"comment_id":"10154528974934062","commenter_b":"I want to meet Bruce Jenner aka caitlyn","commenter_a":"Don't care","post_message":"Jenner is apparently in town filming her new television show, \"I am Cait.\""},{"comment_id":"926192544193565","commenter_b":"TO BAD THEY HAVE TO CHANT THAT!!! IF LEGAL SYSTEM HAD DONE THEIR JOB,SHE WOULD ALREADY BE IN ORANGE!!!!!!!!!!","commenter_a":"Apparently Kate Bolduan is the only one left that dosen't know what is PAINFULLY OBVIOUS...\"Slick Willie\" either bought out Lorett Lynch or threatened her with death in that plane meeting and Obama threatened Comey with his job and political future...Her problem is that she thinks we're all as dumb as her...smh","post_message":"CNN anchor Kate Bolduan whined about the \"lock her up\" chants directed at Hillary Clinton during the Republican National Convention on Wednesday while expressing doubt that it was the right \"message.\""},{"comment_id":"10155973415020354","commenter_b":"Shame on you Fox. Personal feelings are so beyond this forum. You putzes might as well learn how to say, \"large sized or regular?\"","commenter_a":"I'm for Ted all the way, but if Fox wanted to hurt trump it was a mistake,","post_message":"Trumpnado!"},{"comment_id":"10153504352285329","commenter_b":"She's been on hormones for years-that's where the breasts come from. And you can't see anything under the suit because it was removed. Think ya need your eyes checked","commenter_a":"Guys... Where did that breast come from so suddenly?","post_message":"The olympian and reality star has made her debut in the July issue of Vanity Fair)"},{"comment_id":"501775896685267","commenter_b":"She is a POS!!!!!!!!LIAR too!!!!","commenter_a":"NO","post_message":"Hillary Clinton has been defying stereotypes about what women can accomplish her whole life. Would you like to see her do it again this November?"},{"comment_id":"10157272858800389","commenter_b":"This is very inappropriate. It is not the job of Ginsburg to comment on any of the political constituents, democrat or republican. Her job is to interpret the law only and she is way out of bounds in this matter. If she wants to leave the country somebody would have to nudge her and wake her up because every time she is seen on tv she is either falling asleep or looking like she just woke up. It is way past the time for her to retire.","commenter_a":"This old prune needs to retire. She can't even stay awake. She's hateful!","post_message":""}]
