[{"comment_id":"10154491854776002","commenter_b":"Yeah, she's a great mother!?!? Ha. Get those poor kids away from her immediately; lock her away with the scum husband.","commenter_a":"Seriously-not only her but her husband has committed the same crime-hurting thousands of others-stealing money from the government and she wants a break?!!!!!!","post_message":"Washington is asking the judge for a massive break. The judge ordered her to serve four years in prison, but she is asking not to go to turn herself in for five years so she can stay home with the kids while their father serves his time for the same crime."},{"comment_id":"10153836803272623","commenter_b":"Good players But it's another\"L\"","commenter_a":"Ga...NO ....Riverboat must have sank and Cam Ain't ..... stupid Panther Fans","post_message":"The New Orleans Saints beat the Carolina Panthers in a 41-38 victory Sunday in New Orleans."},{"comment_id":"1013898135398451","commenter_b":"He'll yes. Put them back in there own country then nukem. All","commenter_a":"Time to fight back.","post_message":"The religion of Peace Strikes again! This time muslim migrants welcome their hosts...   Do you agree we should deport them all!?"},{"comment_id":"472935749563672","commenter_b":"Able bodied people that are on welfare should be required to work. Taxpayers have to work, why not the leeches on welfare.","commenter_a":"If they are able to work,then yes. They should have to work. Same as they should be drug tested.","post_message":"These free loaders just got some very bad news.  Awesome. It's about time these people are put to work.  Do you agree that people on welfare should have to work?"},{"comment_id":"1237347102949965","commenter_b":"You and me, (and millions of others, I'm sure), both!","commenter_a":"It isn't because she's a woman. I would stand in line for 5 hours to vote for Elizabeth Warren. Hillary? *shrug* It better be a short line.","post_message":"Here’s a strong but fair piece from the heart on the media establishment in DC by CNN’s Jeff Greenfield, whose long experience in politics and journalism began with Robert F. Kennedy back in the 60s."},{"comment_id":"1857903094453796","commenter_b":"@username AND U DON'T YOURSELF.","commenter_a":"Please leave MLK's son alone. Focus black people, stop criticizing on something or someone you know nothing about or the reason behind it. You do you. Keep out of everyone else's business! We're black/African Americans but we're individuals.","post_message":"He went off on the Civil Rights icon's son."},{"comment_id":"10153541380362093","commenter_b":"@username obviously you think you are what you arent thats why its called a disorder im not going argue... is the sky green? is grass blue.. no... and im not going to argue that it is.... and the problem isnt so much trannies like i said its men who know what they are that are now not looked at twice for going to the womens restroom, nobody will bat an eye even if his intentions are evil...","commenter_a":"As a transgender person, I'm sorry that me having to do a natural bodily function in the bathroom that matches my gender identity affects your life so much. Get over it, we're here to stay. I was born and raised in Texas, regardless of what y'all say about us, I'll still be using the men's room.","post_message":"The founder of the movie theater believes the bathroom debate has gotten out of control and hopes his new design will make the issue a non-issue for customers... @webpagelink"}]
