[{"comment_id":"10154361925736336","commenter_b":"@username Post the video of your interview with Dr. Jasser!","commenter_a":"Thank you President Obama for speaking up on this issue. It's sad that this event had to happen during Ramadan. Something needs to be done about assault rifles now!","post_message":"“We know enough to say that this was an act of terror and an act of hate.”   Moments ago, President Barack Obama addressed the city of Orlando facing the tragedy of the deadliest shooting in modern U.S. history."},{"comment_id":"10154028327039411","commenter_b":"Might have a heart... But she has no brains.... Sadly without that.. She is and 326683984410ard like you :)","commenter_a":"Punished for having a heart and a conscience.....","post_message":"'Military jail frightens me less than our society losing its humanity'"},{"comment_id":"10155027837294411","commenter_b":"I am trying to learn you that you can't blame a whole religion on the wrongdoing of one person.. It's like blaming denmark for a crime a danish man did in Spain... And you are still rude and can't spell.. Please go back to school and learn english and grammar... And maby move to an island with all your other nazi racist friends...","commenter_a":"What??? In most of europe these markets has nothing to do with christianity, but with shopping... Stop trying to divide people based on religion... We all know how you hate muslims now... And maby you should think that the western world, and Russia is bombing and killing the shit out of the middle east... Could be a reason for the hate you know...","post_message":"'A Christmas market which is a Christian symbol is a classic target for Islamic jihadists' (Op-Edge)"},{"comment_id":"10153683265791336","commenter_b":"Most illegals do not get food stamps or welfare. Tons of Republicans ARE on welfare.","commenter_a":"That's great all the illegals like to hit Trump..they have money for parties and pinatas thanks to welfare Checks and food stamps! If I was living off the government tit I would hate him too..but I don't and I want my country strong again so I like Donald Trump. Trump 2016","post_message":"“We sell out pretty fast.” - Guadalupe Mendez, salesperson   (CC: Donald J. Trump)"},{"comment_id":"10153427592702377","commenter_b":"WE NEED TO TAKE THE WHITE HOUSE BACK!!!","commenter_a":"Carefull what you wish for... then stack the $15 minimum wage movement on top of that! :-(","post_message":"April 15 just got a lot worse."},{"comment_id":"1412807245405968","commenter_b":"Again....she attacks her husbands victims. She's a POS female.","commenter_a":"Says the woman who stood by her philandering husband on numerous sexual misconduct occasions. And then she attacked the women. She is the one who set women back!! I want a much better role model for my daughter.","post_message":"\"When Donald J. Trump says, 'Let's make America great again,' that is code for 'Let's take America backwards,'\" Hillary Clinton said."},{"comment_id":"875788715811158","commenter_b":"@webpagelink, watch this and tell me is this ridiculous?","commenter_a":"Worse than ridiculous","post_message":"Don't you agree this is ridiculous?"}]
