[{"comment_id":"880245452022083","commenter_b":"@username // Lets jail women for miscarriage oh wait we already are -_-// Who's advocating to throw woman in jail for miscarriages. Again how many time's have been through this? Hiring, a contract killer to end the life of ANOTHER HUMAN BEING is NOT a miscarriage. Miscarriage's happen naturally, not by FORCED.","commenter_a":"People who cannot distinguish a fetus from an infant have no right legislating against abortion","post_message":"Tell Congress to protect ALL babies.  Click here to urge your Congressman and Senators to cosponsor the Life at Conception Act! @webpagelink"},{"comment_id":"1781276175448687","commenter_b":"And she wants to spend her last dying days being president? Really? Think please!!","commenter_a":"Make it sound as bad as you can, @username, you always do.","post_message":"JUST IN: Hillary Clinton was diagnosed with pneumonia on Friday, her doctor says. The doctor revealed the condition hours after Clinton stumbled while leaving a 9/11 event. @webpagelink"},{"comment_id":"10153821325285329","commenter_b":"Beth Carpenter","commenter_a":"Arthur Smith -- perhaps Tiona might be interested in this.","post_message":"He says he plans to read every last book. (via BuzzFeed Trending)"},{"comment_id":"10153592500342235","commenter_b":"Stepford wife! A woman with no dignity!","commenter_a":"Brave woman. ...","post_message":"This is sick."},{"comment_id":"685699241620654","commenter_b":"How can \"she\" be a woman with male genitalia!","commenter_a":"I believe that by giving Jenner this award merely shows base ignorance. Women should not be offended, but rather look at the monster joke. A man that has not completed his surgery is woman of the year. What a joke. Gentleman the majority of us would never want to be a man. We are happy with ourselves. I feel sorry for this mockery of a woman and an insult to men in general.","post_message":"Female Marine goes off on Bruce Jenner for winning 'Woman Of The Year' Award. She's right. This is getting so ridiculous its not even funny. Can we get 75,000 'LIKES' for this female Marine?"},{"comment_id":"795368217263025","commenter_b":"I'd go and break it off in her ass, show the Bitch who's Boss","commenter_a":"I think if they are seriously considering removing her, an independent moderator, because Trump backed out of the debate and their worried about ratings, then I think all of this proves what a sham these debates all are. #StandwithRand","post_message":"Should she be removed?"},{"comment_id":"10153680967462577","commenter_b":"These migrants have been through much and they should be afforded more rights than everyone else. Don't wanna get attacked by a Muslim migrant? Stay inside. A Muslim migrant broke into your house and attacked you? Should have gone outside.","commenter_a":"The world is a sick place where everyone's rights are being removed under the guise of equality. Everyone has the equal right to shut up and lick big government's boots while footing the bill. Fuck this bullshit.","post_message":""}]
