[{"comment_id":"971619749553192","commenter_b":"Wtf","commenter_a":"Saudi Arabia is holy land and not a country prepared for war, and have no military status. Iran should know better and could not even beat Sadaam at the time","post_message":"\"Because a war between Saudi Arabia and Iran is the beginning of a major catastrophe in the region... For sure we will not allow any such thing.\" @webpagelink"},{"comment_id":"801468519888245","commenter_b":"The female judge is pathetic.","commenter_a":"Wow....","post_message":"The cop sexually violating her body is evil enough, and to see the judge's reaction is absolutely chilling. Watch now (WARNING: GRAPHIC): @webpagelink  -Via Filming Cops flashback files."},{"comment_id":"10156516063715206","commenter_b":"Trump is a pig and she stuck it to him with class.","commenter_a":"Watch yourself here on the video without sound even...you come off snobbish arrogant and grumpy and that is exactly what Trump meant by your face. You are well spoken, but you are not a happy person obviously. Not one smile! Mostly grimace. As to your subject matter-good for the blows to Hilliary and putting Christie in his place. But your arrogant head bobbing when talking about meeting foreign leaders etc. is just overboard. You better get on board with Trump, only the media and establishment hate him and are tryin their best to convince audience that he is hated. VOTERS want him!!! Voters love him!!!","post_message":"Putin won't listen to more talk. We need to show him there's strength, leadership, and courage on the other side. Pitch in $3 to rebuild America's role in the world.   @webpagelink"},{"comment_id":"10153542250533812","commenter_b":"Chriss if you lease a car. Can anybody come in that vehicle and disrespect you. Chriss you happened to get a job that you get assigned a vehicle can anybody come tell you what and how. You're a smart man. You might get a job that requires you to move out of the state or even the country. That job comes with all expenses paid for four years including the house and the car. You tell me who can come in there and disrespect you. Not even the ceo or cfo of that company can do that without proper protocol. You had to move your family. And your doing your best job. Think about that chriss. YOUR A SMART INTELLIGENT MAN","commenter_a":"Pres. Obama. It is America's house we only let you borrow it for a little bit! Respect all people as you desire to be respected. You are in my house and every legal Americans house. Not that they were right but you are wrong!","post_message":"WATCH: Pres. Obama normally lets hecklers speak, but this time, he put his foot down: \"OK, you know what? No, no, no...\""},{"comment_id":"516357545155952","commenter_b":"I'd be pissed,then sue everybody.Which I'm sure she'll do.","commenter_a":"How did they get the right to determine her mental state?","post_message":"Via Filming Cops -- How would you feel if within 24 hours you go from being a successful corporate executive to being forced to become a patient at a mental ward, stripped naked, where no one believes you? It feels straight out of a psycho thriller, but this is what cops did to her."},{"comment_id":"1563876947236715","commenter_b":"She a crook herself","commenter_a":"Sarah, go walk to the end of that bridge in your yard and ask Vlad of he is afraid of Trump...","post_message":"Sarah Palin called out Mitt Romney on Facebook for attacking Donald J. Trump."},{"comment_id":"10154069186973967","commenter_b":"Yeah how dare she have an opinion, why didn't your whore mother have that coat hanger abortion she wanted?","commenter_a":"Check your shit together before basing bias yo..she was more concerned about her own BS and not about Nintendo. Also you have to be THIS goddamn retarded to lose an awesome job at Nintendo","post_message":"Nintendo watched her become the center of a witch hunt and did nothing publicly to defend her."}]
