[{"comment_id":"10153557927894411","commenter_b":"they should allow rocket launchers and rpg's to blow out anyone who draws out the frigging gun","commenter_a":"We need to make sure movie theater workers all carry guns so they can pull one from their holster and save the day!","post_message":"BREAKING: One of the deceased is the suspect, who reportedly turned the gun on himself."},{"comment_id":"10153874531382464","commenter_b":"IF YOU ARE REALLY WORRIED ABOUT AMERICA CHRISSY ....... DUMP THE TRUMP!!","commenter_a":"Cruz lied about what he did with Carson! CNN fact checked and it was just like everyon knew it was. Cruz is a Liar and a terrible man! He threw Carson under the bus! Rubio puts out the same speech he and his family migrated here and had no money and how he supposedly walked dogs for spare change whileforgetting to mention that the dogs he walked were gaurd dogs for his mother and fathers drug dealings. Both which spent time in prison and were with a Cartel. I am not saying that as a child Rubio was guilty of the drug dealings.What I am saying is that he is giving peoplea false storyof some made up life. Anyone can fact check eitherof these two lying cheating thieves. I wouldn't let either of them wpe my dogs paws! Both are liars and career politicians. As for Bush, His familyuses eminant ...","post_message":"A super sale for #SB50. Get your #TeamCruz jersey for just $50: @webpagelink"},{"comment_id":"1266839853337023","commenter_b":"Hey Mario, stfu !","commenter_a":"You're an idiot if you think you can light a fire in the airless vacuum of space","post_message":"That classic \"teardrop\" shape only forms because of gravity. So what happens when there's no gravity?"},{"comment_id":"10154134497810575","commenter_b":"I'm so sorry for your lost child. It sad and terrible we are being made to put up with these illegal criminal invaders.","commenter_a":"Hang him and the next ten people who allowed him to be here.","post_message":"NEW YORK GIRL DIES AFTER BEING HIT BY TWICE DEPORTED ILLEGAL ALIEN...."},{"comment_id":"10155549473141729","commenter_b":"She's a deranged scumbag","commenter_a":"You have to feel for this poor delusional \"woman\". Her whole way of life is disintegrating & she needs to complain as loudly as possible so people actually hear her. Soon her dementia will kick in full blast & she will be confined to a nursing home. I can only hope she doesn't suffer. It's just too bad her legacy will be one of HATE & DIVISION !!!","post_message":"Whadd'ya think?"},{"comment_id":"1283735711683013","commenter_b":"horrible woman","commenter_a":"How bitchy she is...very bad attitude though","post_message":"The Hungarian camerawoman who tripped and kicked migrants has been sentenced."},{"comment_id":"10153106076119255","commenter_b":"We have so many publications on both side that are mudslingers with out facts--about time both sides clean up their act and print thing to promote and support","commenter_a":"@username only wants to stir the pot recently!","post_message":"They were insiders. Home grown. Godly. Our neighbors, friends, and kin. People like us.  By Bill Moyers"}]
