[{"comment_id":"10153990525422452","commenter_b":"Jayleen Guadarrama","commenter_a":"LAPD. Respect the rights of the people.","post_message":"Anti-Donald Trump protesters marched through downtown Los Angeles for hours before LAPD tactical officers blocked in the crowd and began dispersing people in small batches. @webpagelink  The protests were generally peaceful, aside from scattered reports of bottle throwing and graffiti."},{"comment_id":"10153378758554575","commenter_b":"Would this woman have been willing to pay the stewardess' salary when the stewardess got fired for allowing her to make the phone call? Bet not....","commenter_a":"Why is she leaving if her husband was suicidal","post_message":"A woman says Southwest Airlines refused to let her call her husband after she received a troubling text message shortly before her flight was scheduled to take off.  The woman said the text read, “Karen, please forgive me for what I am about to do, I am going to kill myself…” She said she replied \"no\" and immediately tried to call her husband, before a steward \"slapped the phone down\" and told her to put her phone on airplane mode."},{"comment_id":"1204270932993102","commenter_b":"Ape woman","commenter_a":"never heard of him !!","post_message":"Are you proud to have Michelle Obama as America's First Lady?"},{"comment_id":"506081702885118","commenter_b":"Fuck you too. Bitch ass gringo","commenter_a":"Im mexican and even i say fuck mexico.","post_message":"\"When you're in danger, they're the last people you think to go to.\""},{"comment_id":"10155463122287908","commenter_b":"They have BEEN doing this for years. My Mom (bless her soul) was very inept with her money and defaulted on her student loans. Her SS WAS garnished. 15% came out every month. Luckily she lived with me so she was OK. We calculated what she owed and what was taken from her...... tax refunds and garnishes..... she paid that loan over and above YEARS before. But, they are like the IRS they charge interest for every day, week, month and SECOND you owe them money. I told my daughter, it's better to work and pay as you go and maybe take a few years longer to get an education than EVER take a loan for it.","commenter_a":"So what has Obama and the DNC been doing about this?","post_message":"How absurd! The very rich get richer and receive giant tax breaks, while low-income seniors see their social security benefits cut to pay off decades old student debt. We should be expanding social security benefits, not punishing seniors for the \"crime\" of getting a higher education. Garnishing social security benefits to pay off student debt is a crystal clear example as to why we need fundamental changes in our national priorities. In the richest country on earth, we should make life easier for seniors, not hard"},{"comment_id":"10153569786727522","commenter_b":"What do American soldiers have to do with restriction of future immigrants?","commenter_a":"Barbara Bell","post_message":"\"When you question a mother's pain...you are attacking us.\""},{"comment_id":"10153226865953132","commenter_b":"He's happy. That's all that should matter","commenter_a":"Sarah Nemes","post_message":"Bruce Jenner's children are rallying around his decision to transition to female."}]
