[{"comment_id":"10152826329111130","commenter_b":"Women are a different race?","commenter_a":"Arrogant and controlling and not smart enough yet to hide it. Did anyone else who watched this wonder whether he would have shushed a male reporter?","post_message":"Unbelievable."},{"comment_id":"1407285352638546","commenter_b":"Mama and papas feathers are probably nice and toasty.","commenter_a":"There it is","post_message":"CHIILLLLYYYY! Let's see what our favorite eagles are up to today, hopefully they're staying nice and warm! The little eaglet is getting big(ger)! For more: @webpagelink #HatchWatch2017 (Video courtesy of Dick Pritchett Real Estate)"},{"comment_id":"1025607307502400","commenter_b":"@username do you not understand what rape is? Many women are unintentionally impregnated by a RAPIST. Involuntarily having sex is what rape is, if you didn't catch that. A women's should be able to choose if she wants to have an abortion, with advanced technology we can safely perform these procedures. Abortion is NOT A contraceptive, it is a last resort and if you wanna take the baby and provide for it along with the thousands of other rape victim babies then go ahead.","commenter_a":"Look I'm not all for abortion, nor all against it, let me just say my peace like everyone else has, and that we are all entitled to.. A females choice about her body, is exactly that, her choice. I'm not saying abortion ahould be used for a form of BC or a contraception, there are other ways, educate your children, its not just the girls in this that need it. All children need to be educated. But lets get surreal, how or what do u know about that female walking in to planned parenthood, little to nothing about her story. How do u know she didn't get raped, or isn't going thru some kind of abuse (whether it be physical or emotional) u don't know. We cannot judge people, who gives another that right, and all I have to say is those doing the judging I hope to hell u ...","post_message":"Hillary's Hypocrisy is Astounding www.eaglerising.com"},{"comment_id":"1283029891737480","commenter_b":"It is so embarassing to see some women with such low IQ and/or low self-esteem.","commenter_a":"TRUMP for PRESIDENT...GO TRUMP","post_message":"The crowd cheered."},{"comment_id":"10157633958190389","commenter_b":"@username IDIOT.","commenter_a":"I'm voting Donald Trump and I will not let the media influence me. Yes he has made some clear mistakes in his campaign with \"words\" but, Secretary Clinton has made clear mistakes multiple times with ACTIONS. She's a politician, getting paid by Saudi, Benghazi, getting paid to speak, email server, the list goes on. BUT, Trump showed more heart last night then any candidate I have seen; not because he wants power but because he cares for you & me. After seeing Lester Holt TRY to demolish trump, it did hit me, that the media does have power, and will do anything it takes to get what they want.","post_message":""},{"comment_id":"1202853869734641","commenter_b":"Muslim go home","commenter_a":"I don't believe we should elect a president so delusional he believes the Earth is only 6000 years old and that going to prison can make a person be gay...","post_message":"\"I would not advocate that we put a Muslim in charge of this nation,\" Dr. Ben Carson told Meet the Press."},{"comment_id":"10153917581018010","commenter_b":"Humans. When will humans realize that we are the most dangerous species.","commenter_a":"Pit bulls. When will humanity accept that this breed of dogs is classified amongst the most dangerous in the world? Hence why they are mostly bred for illegal dog fights","post_message":"A woman's 3 pitbulls mauled to death her 9-year-old brother."}]
