[{"comment_id":"467273093466185","commenter_b":"Hello . It is ok to call this guy a f....t ?","commenter_a":"Haven't we learned that terrorist have the greatest amount of patients and will take years and alter thier lives how ever they need to to carry out a plan. Throwing us off course, that's part of thier plan. Taking our attention away, part of the plan.","post_message":"Orlando shooter who killed 49 people at the Pulse nightclub was himself a regular patron of gay clubs in Florida for years, classmates, friends and club employees say."},{"comment_id":"992220407519685","commenter_b":"Meghan Sullivan","commenter_a":"Hold up! Imma let you finish, but I just wanted to say Bernie Sanders had one of the best shut downs of all time!! #feelthebern","post_message":"Bernie Sanders to Hillary Clinton: \"Excuse me, I'm talking.\""},{"comment_id":"1397444103681973","commenter_b":"Welcome to the internet hun.","commenter_a":"90% percent of the people calling others cry babies are the same who were crying and complaining when obama was president.","post_message":"This one sums up today's women's rights marches beautifully..."},{"comment_id":"1050271788402406","commenter_b":"My father is vet and is against privatizing !!!","commenter_a":"Privatizing is what the vets want. Who knows more about it than the vets!","post_message":"\"We cannot – and I will not – put our vets at the mercy of private insurance companies without any care coordination or leave them to fend for themselves with healthcare providers who have no expertise in the unique challenges that are facing our veterans.\"   --Hillary Clinton"},{"comment_id":"10153278165616336","commenter_b":"Put down the assault fork and nobody will get hurt!","commenter_a":"Ummm.. Say what fattie? You can't handle food ownership.","post_message":"\"Americans do not seem to be able to handle gun ownership in a way that permits maintenance of a civil society.\""},{"comment_id":"10153080670828721","commenter_b":"ITT: Idiots. Everywhere.","commenter_a":"No matter what does someone have something -ve to say","post_message":"ConnectHome is a pilot program through which Google and other Internet service providers will give free or low-cost Internet access to 275,000 homes in 27 cities across the country."},{"comment_id":"10152888898915496","commenter_b":"But... But... Gay marriage is destroying straight marriage! @webpagelink","commenter_a":"Brenda. I believe that you are right in some of your thoughts. I don't delieve we should judge people. However we are definitely called to judge actions. In the case of same-sex marriage to support same-sex marraige is to supoort something that goes against the Bible's definition of marraige. Same-sex marraige is social, cultural, and traditional. Social, cultural and traditional acceptance will change with time but Biblical truth does not. Therefore I believe that we are to love everyone but support what is right in the eyes of the Lord.","post_message":"Brenda Wood 11Alive looks back at the fast-moving and historic events of last week in Monday's Last Word -- \"Same-sex marriage: Judgement Day.\"  More Last Words: @webpagelink"}]
