[{"comment_id":"10153977158805329","commenter_b":"Tia Guilbert","commenter_a":"@username this is me","post_message":"jump in! (via BuzzFeed Animals)"},{"comment_id":"421728768009004","commenter_b":"Burn her as a witch","commenter_a":"So intelligent, and powerful women","post_message":"Share if you're Ready For Hillary!  Get all the best HRC coverage you need here:  @webpagelink"},{"comment_id":"10152589003412894","commenter_b":"That bitch got implants","commenter_a":"I agree with C completely. He has God given talent. She has what God and cosmetic surgery gave her. She has no talent. She did not invent big, voluptuous butts.","post_message":"Charlie Sheen Pops All the Way Off on 'Zero Talent' Kim Kardashian: 'Go F Yourself'"},{"comment_id":"1055171694505347","commenter_b":"If that woman is not tortured in hell eternally, then God does not exist... and let me TELL YOU something. He does.","commenter_a":"Where is Russia's outrage? Where is this woman now?","post_message":"Horror in Moscow: Woman in burka walks streets carrying child's severed head..."},{"comment_id":"1742724086013339","commenter_b":"Go Girl!","commenter_a":"So good","post_message":"Live from San Diego: Watch as Hillary speaks on smart foreign policy, keeping our country safe, and why we can't afford Trump as Commander-in-Chief."},{"comment_id":"10153978466591002","commenter_b":"These are Outlaw Motorcycle Gangs..not Motorcycle Clubs..Outlaw Gangs are nothing but Thugs","commenter_a":"I am in the minority here, but I feel safer with motorcycle clubs than I would anyone else. I would not turn away of I walked into a place of business and seen club memebrs in the same place. They don't just go out and rob and kill people because they want to. You can't compare existing clubs to SAMCRo from Sons of Anarchy. This is a TV show. Hell, we should have the clubs patrol the streets. Think about that one!","post_message":"After the Waco shootout this weekend, outlaw motorcycle gangs are again in the spotlight. Roger Weber takes a look at local biker gangs: @webpagelink"},{"comment_id":"10153427905081051","commenter_b":"stupid woman I hope she gets in big trouble .People like her don't need pets .They are a big part of the family","commenter_a":"GOOD! SHE NEEDS TO BE IN TROUBLE!","post_message":"Friends and family took one look at this woman's Facebook update and immediately called the police."}]
