[{"comment_id":"901951363197946","commenter_b":"Does this Kate Hopkins woman realize how ugly she is?","commenter_a":"i think thie so called woman shoudl keep her many nasty comments too her self ,she must have a very unfilled life ,becuase she comments and has ago at everybody ,stut up Katy Hopkins .","post_message":"Kelly Clarkson admits she didn't even know who Katie Hopkins was  (Daily Mail Celebrity)"},{"comment_id":"1916222085104197","commenter_b":"I thought Barbie vaginas were that lot marching in London recently lol","commenter_a":"Haha a what can I get a KenCock then in bits ere me like!!!","post_message":"Increasing numbers of women are going under the knife to have a 'Barbie vagina'  as a result of watching internet porn"},{"comment_id":"743053085796330","commenter_b":"Idiots !!","commenter_a":"\"It is self-evident that no number of men, by conspiring, and calling themselves a government, can acquire any rights whatever over other men, or other men's property, which they had not before, as individuals.\" -Lysander Spooner","post_message":""},{"comment_id":"822546624556646","commenter_b":"Trying to straight-wash and white wash the situation is terrible. Not only was this guy scoping out gay bars before, he also chose to go on Latinx night, when most of the patrons were PoC, generally of Latin descent. So this was a hate crime. It had to do with race, it had to do with sexual orientation. You trying to bury those facts is deplorable.","commenter_a":"This isn't a gay attack. It's a terrorist attack that's being portrayed as homophobic because that's a cause people will rally for. Anything to further your agenda. No one wants to believe it's radical Islam, but that's what this is. Of course his family and even his own tweets blame gays. A gay bar is a perfect target so we can blame homophobes and call it a a hate crime. Well terror is also a hate crime and gay or straight these people are dead.","post_message":"President Obama on Sunday morning's mass shooting at a gay nightclub in Orlando, Fla. It's the deadliest mass shooting in U.S. history. @webpagelink"},{"comment_id":"10153138369757293","commenter_b":"freedom of religions","commenter_a":"Delaney Lynch","post_message":"“To be the first person to touch something that’s been lost for 300 years is a magical experience.”"},{"comment_id":"1259980317411527","commenter_b":"That says alot about him.... smh. He hasn't given any serious amount of attention to our military and now he wants them to turn on the new commander in chief. #HURRYUPJANUARY#","commenter_a":"Will be so glad when POS OBAMA is GONE!!! WORST President EVER!!! A racist TRAITOR!!!","post_message":"OBAMA TELLS TROOPS To Rise Up Against Trump…Protest His Authority…Feel Free To Criticize Him [VIDEO]  43 more days..."},{"comment_id":"10154528764136955","commenter_b":"TO ALL AMERICANS - PLEASE WAKE UP AND SMELL THE ROSES. Whether you like TRUMP or not, he is the only viable candidate. If you want all of the above to happen, the lost of 5 amendments to the Constitution that we all learned about in school and everything else she wants to do to put this country into the ground for her benefit only ( REMEMBER, SHE LIVES ON OTHER PEOPLE'S MONEY), we have to work hard for ours, then HILLARY is your girl. If you want the opposite, to save all our rights and freedom, more jobs, getting better and cheaper health insurance (UNLESS YOU WANT TO PAY REALLY HIGH PREMIUMS), a strong military should we ever need it, keeping the refugees out of this country (otherwise you will find them right in YOUR OWN BACKYARD), childcare for all working women (who make up 40% of the workforce), ...","commenter_a":"Lol Trump was winning anyway see yea dumas Hillary quacks","post_message":"PAPER: Dems should ask her to step aside..."}]
