[{"comment_id":"10153074240773067","commenter_b":"Lol no, A stockholder though, and everything that i put on here were statements from Ford in response to Donald Trump.. Just summarized","commenter_a":"Trump had nothing to do with this. This was because Ford, and the UAW were able to work an agreement, Ford is committed to keeping and creating jobs in the U.S. They have created 25,000 new jobs in the U.S. In the past four years. Over 80% of their manufacturing is done in the U.S. And 97% of their engineering is in the U.S. As they stated. No i dont like seeing jobs being outsourced, but Trumps statement had no effect on the outcome of this. Im happy for all the people who kept their jobs. Ford is a great company! And will do what they can to keep bringing new jobs to the U.S.","post_message":"This comes after Ford Motor Company came under fire for creating thousands of jobs in Mexico. @webpagelink"},{"comment_id":"10154620452720575","commenter_b":"She should have had a gun!!!!!","commenter_a":"Was it a Muslim?","post_message":"WIFE OF MISSOURI GOVERNOR-ELECT IS ROBBED AT GUNPOINT IN ST. LOUIS!"},{"comment_id":"1021100727949032","commenter_b":"I'm no a socialist I'm a total independent from the corruption government..I'm so proud of myself","commenter_a":"Bernie Sanders it's a socialist.. !!","post_message":"We're live in the #GOPDebate hall!"},{"comment_id":"2202427943315983","commenter_b":"@username go beat your wife old man","commenter_a":"The ole draft dodger than said McCain wasn't a war hero because he was captured in battle. Yeah he really respects our military to nominate someone who is already part of the problem with the VA. I am a Republican at heart but I'm not going to blindly follow this man like some are. Words have meaning.","post_message":"Watch: President-elect Donald J. Trump and Vice President-elect Mike Pence lay a wreath to honor the nation's fallen soldiers at Arlington National Cemetery."},{"comment_id":"10154732148698961","commenter_b":"You recently proclaimed that you would rather see a move toward screening and the passage of more gun control. Are you serious? American citizens are being raped and murdered by illegal aliens streaming into our borders and you want them all to come on in, collect benefits paid for by American taxpayers, yet take away guns that can protect us from these illegals. You are a very disturbed person and even worse are those endorsing you and voting for you. It's a state turned upside down by liberal sycophants.","commenter_a":"Senator Murphy, how about a little get together down here in the New Haven area?","post_message":"A huge THANK YOU to everyone who came to the town hall tonight. For those who couldn't join, check out the full video here."},{"comment_id":"10154588771167178","commenter_b":"Are expecting any more snow or ice around Roanoke Rapids?","commenter_a":"Is it going to be windy today?","post_message":"WRAL Elizabeth Gardner is taking questions now about today's forecast and what you should expect. For the latest weather conditions go to wral.com/weather."},{"comment_id":"487115881470292","commenter_b":"What a perverted, sick and depraved asshole!!","commenter_a":"Fucktard","post_message":"God will put rainbows and sunshine over the house of every straight, white, christian cis man!"}]
