[{"comment_id":"1142380192485341","commenter_b":"Wow are you serious they are trying to take out the Americans 1 job at a time and all the free handouts our government will give them. While our own government let's the Americans suffer by allowing them to free load off our system. Really they get social security for what . Americans get denied SSI while the immigrants step right up and no problem. really ?? Go Trump","commenter_a":"Welcome to the future!!!","post_message":"Nearly 40% of less-educated, working-age Millennials ages 18-29 don’t have a job.  That’s more than 15 million young-adult high school grads and high school dropouts who aren’t working."},{"comment_id":"773980632650962","commenter_b":"i cannot stand that woman","commenter_a":"Why don't you just all tell the truth and say \"he's a muslim that's why he didn't go\" it's like anyone would do anything about it!","post_message":"Very painful to watch."},{"comment_id":"1089868204425048","commenter_b":"Ugly racist bitch","commenter_a":"Leave the Sgt alone he is right she shouldn't have done that it took me two times watching it to figure out what she was doing and it not right","post_message":"This officer thought he could speak his mind about Beyonce's halftime performance... but as soon as he spoke out, he got some VERY bad news.  He never though this could happen....  Welcome to Obama's America."},{"comment_id":"536936909817584","commenter_b":"both plans are BS","commenter_a":"Interesting. Makes sense though. Someone has to pay for all the freeloaders and the Crap that the Dems promise them.","post_message":"Here's how much your taxes could decrease under Donald J. Trump and rise under Bernie Sanders. @webpagelink"},{"comment_id":"10153546137853352","commenter_b":"Black cop should shoot to kill her ass","commenter_a":"And today in white folks news","post_message":"Tulsa Woman Caught At Funeral Home Cutting Up Face, Hair, and Messing Up Makeup of Corpse Who Once Dated Her Boyfriend"},{"comment_id":"10158560874630354","commenter_b":"THOSE COW PASTURE BALL PLAYERS DO NOT MOVE ME. JUST BECAUSE THEY CAN PLAY BALL DOES NOT MEAN THEY ARE ANY MORE THAN THE COWS OR HOGS THAT LIVED ON THAT FARM. THE SAME GOES FOR ANY HALF TIME WHORE THAT TRIES TO MOVE ME. BTW, I HAVE ENOUGH COMMON SENSE TO HAVE AN OFF BUTTON ON MY TELEVISION!!!","commenter_a":"You remember when entertainment used to be all about entertaining It all changed until Democrats lost...","post_message":""},{"comment_id":"245227072596737","commenter_b":"She's a freaking retard!","commenter_a":"One thing he is not insecure, but you are Nancy","post_message":"\"I feel sorry for you. You're the president of the US and you're so insecure...I pray for your Mr. President. And more importantly, I pray for the United States of America.\"  Do you think Trump is insecure?"}]
