[{"comment_id":"10152835488861051","commenter_b":"What a bitch","commenter_a":"What kind of a person hurts an old lady. Hope she is sued . She needs jail time","post_message":"This 71-year-old woman tried to park in a handicap spot in the Walmart parking lot. That's when all hell broke loose."},{"comment_id":"497892010370754","commenter_b":"I should be arrested for the nuclear bomb I just dropped in the women's bathroom at my work. You'll never take me alive!","commenter_a":"I hope his family sues the shit outta that school so his entire future is paid for, Racists fucks","post_message":"\"Cool clock, Ahmed. Want to bring it to the White House? We should inspire more kids like you to like science. It's what makes America great.\"  - President Barack Obama"},{"comment_id":"10153465913933145","commenter_b":"Your mom took the time to raise you right....take the time to raise your children right !","commenter_a":"This kid didn't have to go thru this were was the mama, I hope the kid has been taken out of the home? Why did the grandmother didn't do anything for the girls. We live in a crazy world?","post_message":"A father is facing child abuse and drug charges after police say he beat his daughter because she didn't get enough candy while trick-or-treating."},{"comment_id":"1287965734605309","commenter_b":"Fuck Trump. There's my dignity. I'll grab him by the pussy.","commenter_a":"All of you need to remember that you are not in the fourth grade anymore, and that we can actually behave as adults. Cut out the filthy language and the belittling insults. If you have something to say, say it with a little dignity. Also, try to improve your spelling and grammar.","post_message":"Gullible fools...  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1361756670528336","commenter_b":"Vengeance is mine saith the Lord.","commenter_a":"Disgusting and low class","post_message":"More tolerance from our friends on the left."},{"comment_id":"1709641872647327","commenter_b":"I cannot believe what is happening in this country. From this moment forward, when my wife or daughters-in-law or granddaughters are in the women's room of any public facility, I will guard the door, and woe to the man who tries to enter while they are in there. There will be blood!","commenter_a":"We are full of IDIOTS in America !","post_message":"\"There isn any doubt that this law was designed to be DISCRIMINATORY ...\""},{"comment_id":"10153353457471037","commenter_b":"@username he fondled them vaginally. He violated them. Fine line when denying it is rape...","commenter_a":"How can they know he touched his sisters and allow him to continue to live in their home?","post_message":"Josh Duggar of 19 Kids and Counting is embroiled in scandal"}]
