[{"comment_id":"1886562518248287","commenter_b":"She's turning them","commenter_a":"This is beautiful","post_message":"EAGLET WATCH!  Did you see one of the eaglets peeping through a hole in its egg?  When do you think it will officially hatch?  Let us know where you tuning in from and what name ideas you have for the babies!  Full story:  @webpagelink  Pix courtesy Southwest Florida Eagle Cam"},{"comment_id":"1170750279653754","commenter_b":"Leave, Obama, just leave already. Go live in the ghetto desert with your Saudi prince best friend, before whom you knelt and kissed his hand. And take lying, leftist, socialist Hillary with you, and Bill, too. Don't forget to tell Bill to keep his pecker in his pants. We'll even provide a private jet on Egypt Air for you. In your picture at the Orlando vigil for our citizens you coundln't kneel like you did b4 the jihadist price, you just sqatted like they all do since they all don't have toilets. You are a disgrace and you are one of them!!!","commenter_a":"he is absolutely right","post_message":"When Obama ignored radical Islam, this YouTube star went online and slammed him for the coward that he is. He proved that Donald Trump was 100% RIGHT in calling this ISLAMIC TERRORISM, and we should not be afraid of those words!  Let's get 1,000 SHARES for a man who's not afraid of telling it like it is!"},{"comment_id":"674485572723233","commenter_b":"she needs to sit down and shut up","commenter_a":"Talk about a nightmare! Handler, look in the mirror!","post_message":"Lefty comedienne Chelsea Handler goes on a racially charged rant against Trump.  Just imagine if a conservative said anything like this?"},{"comment_id":"1677003925887340","commenter_b":"@username, why do many Americans believe that Obama isn't concerned about protecting America? He has given no indication whatsoever that this is the case. As a matter of fact, he does just the opposite. Do you seriously believe that building a wall at the Mexican border and not accepting any refugees will do anything to stop terrorism? The roots of terrorism are not illegal immigrants or refugees. The roots of terrorism are Americas interferences in the middle east. The roots of terrorism are people who say \"bomb them and take their oil\". How would you feel if someone would say this about the USA? Terrorists can be fought with weapons but terrorism can only be fought with education. And this is exactly what Obama does. Educating people...by talking about Islam, by visiting a mosque, by saying he will stand with the Muslim Americans. That doesn't mean he hates Christians or ...","commenter_a":"Congratulations Mr. TRUMP. We look forward to seeing you here in SC. Our country needs a strong leader that's going to make this country great again. We need someone in the white house that actually is a christian, strengthens our military and will secure our borders. Take care of our people first, the great people of the United States.","post_message":"Good morning America! THANK YOU for your vote, New Hampshire! We will MAKE AMERICA GREAT AGAIN! Off to South Carolina today. Everyone have a GREAT DAY, and again- thank you!"},{"comment_id":"565700806961575","commenter_b":"Don't they get it! We don't want her!","commenter_a":"Hillary will probably die before then of karma and natural causes!","post_message":"Trump-Clinton rematch for 2020?"},{"comment_id":"10153000852919197","commenter_b":"Put the plow down !","commenter_a":"Another fun icy Monday! Wha's up with that?","post_message":"It was definitely a slippery morning on most of the roads in the state. Check out this video from an eyewitness on I-84 in Newtown. Stay updated with the latest weather conditions here-->>@webpagelink"},{"comment_id":"10157390239980354","commenter_b":"Strip their citizenship and deport them. They do not deserve to be American citizens.","commenter_a":"BLM must be destroyed as a movement...just like the mob, or any other organized terrorist group.","post_message":"The BLM radicals shut down a CA freeway and vandalized an Oakland police station..."}]
