[{"comment_id":"1705936436359891","commenter_b":"Oh shut up! The murdering, lynching KKK will be around to continue their hate. It would be great for you all to go back where you came from. The Indians would love it!","commenter_a":"so Black lives matter can protest anywhere and everywhere, but no other group can.hum? not that i agree with the kkk but they do have the same rights as Black lives matter.","post_message":"By the time this KKK rally was over, blood was on the sidewalks and ambulances were on the way:"},{"comment_id":"10153247400764614","commenter_b":"It's everyone's BUSINESS to make sure people like this Dispicable mother is prosecuted to the MAX extent.","commenter_a":"Mind your own god dam business people","post_message":"Disturbing video captures a woman hitting a crying 3-year-old in the face with what appears to be a tablet in a Victorville parking lot.  A man decided to film the woman, identified by police as 39-year-old Yvonne Camargo, after allegedly seeing her pull the child out of a Khol store by his hair.  The boy was examined for injuries by a sheriff deputy and officials plan to submit the case to the DA office.  Read KTLA story here: @webpagelink"},{"comment_id":"590256634486210","commenter_b":"Haha america was never great and with you or Hilary as our president it will continue to never be great !","commenter_a":" Vote strong Vote Trump","post_message":"This is only the beginning. Hillary is CROOKED! She is not capable of making America great again. Sadly, she would do the opposite."},{"comment_id":"10153223558734726","commenter_b":"She has already stole enough","commenter_a":"She can just get over her self classless wonder","post_message":"WATCH: Obama: Michelle Upset She's Not Being Paid as First Lady"},{"comment_id":"900975760004551","commenter_b":"Or woman!!!!!!","commenter_a":"Not just white men no man should talk like that it is bad what ever color they are.","post_message":"RT LeBron James: “White Men Don’t Have the Right to Talk Like Trump in Locker Rooms or Elsewhere”"},{"comment_id":"10153628379818145","commenter_b":"Feed your own kid. Simple fix. And teach the little demon to sit still and learn.","commenter_a":"My son is 6, and gets recess twice a week!!!! Twice!!! He then gets in trouble because, as most 6 year old boys, he gets out of his seat and wiggles all day. But the kicker is what he's fed! Sugar sugar sugar for school breakfast! He's even come home and told me he had a freaking pop tart! What the crap! Then he's punished for their stupidity. Schools need to lay off the sugar, and allow for atleast 20 minutes for recess. I vote for 20 mins twice a day. My son would be SO much better for his teacher! (Oh, and I agree with many comments....get rid of this common core crap! It's just that....CRAP!!!)","post_message":"Do you think that Florida elementary schools should be required to provide 20 minutes of recess every day?"},{"comment_id":"10153557938016438","commenter_b":"That woman is a criminal with a capital C.","commenter_a":"This is why I love Hillary Clinton!","post_message":"Clinton knows the only word a politician enmeshed in scandal needs."}]
