[{"comment_id":"10154125640609071","commenter_b":"Success is subjective. I'm fairly certain her and her family would be happier if neither of them worked so hard at their music careers.","commenter_a":"Why would you put front and center a couple that hates police officers and deals drugs? great role models you morons.","post_message":"“You have the same number of hours in the day as Beyoncé.”"},{"comment_id":"10153910150514657","commenter_b":"Go home","commenter_a":"GITMO","post_message":"One doesn't have to think long or hard about how this would play if Hillary Clinton were a Republican (which she once was)."},{"comment_id":"1676347295991211","commenter_b":"Of course she would praise him. He is a lying louse like her husband.","commenter_a":"Libtard !!","post_message":"Michelle Obama is sending a message to Donald Trump."},{"comment_id":"10153103195541491","commenter_b":"Clearly a publicity stunt again, the shark is obviously a mate of his","commenter_a":"fake shark..","post_message":"Mick Fanning had another close encounter with a shark."},{"comment_id":"10155023483731037","commenter_b":"Fetuses are not considered sentient until around 6 months. Nothing wrong with an abortion within that time period","commenter_a":"Well, it would help if people quit having sex like rabbits and then run out and get an abortion because having the baby would be an \"inconvenience\". It's disgusting that 55 million innocent babies have been brutally murdered in a mere 43 years.","post_message":"An uptick in deaths, a slowdown in births and a slight drop in immigration all damped American population growth."},{"comment_id":"10153702004727464","commenter_b":"He is my Prince.","commenter_a":"Conservative....I don't think that word means what you think it means.","post_message":"Act out a scene from The Princess Bride?  As you wish..."},{"comment_id":"1028049810606008","commenter_b":"This evil witch should spend The rest of her life in a solitary jail cell without food or water for all the evil she has perpetrated on this country!!!","commenter_a":"Softball questions","post_message":"She's totally cooperative! And yet she won't talk to investigators. Why? Wait until you see how she tries to explain this one away."}]
