[{"comment_id":"1738783449718030","commenter_b":"Lmfaoooo she's just so fed up","commenter_a":"The teacher at 52 seconds hung her head low like \"these mfs here \" Ty1253184741396567","post_message":"Move over, #MannequinChallenge. The #TrumpsComingChallenge is sending students fleeing @webpagelink"},{"comment_id":"1588980671119277","commenter_b":"Agree all the way.the truth is black or white, can be proved.lies can not be proven.the cons get mad because facts on mostly on the liberal side. We can't help it if they love lies and are prejudiced to believe them.warped sub humans.","commenter_a":"Without fake news he and the GOP are dead in the water. Then all they have left is election rigging, voter suppression, and Gerrymandering. Oh yeah, and help from COMMUNIST Russia! And that just ain't enough!! #GOPTraitors","post_message":""},{"comment_id":"969542393176866","commenter_b":"these woman being paid by Hillary..it took them all 30 years to come out...they want their 15 minutes of fame...wonder if they'd like it if someone did that to their Dad or brother...?","commenter_a":"I think his own recording is pretty factual","post_message":"\"He has been nothing but completely respectful.\"  Chelsea Cooley Altman, who was Miss USA 2005, gave her assessment of Donald J. Trump in the wake of multiple women accusing him of sexual misconduct."},{"comment_id":"10155018116889371","commenter_b":"She broke the Law, simple as that","commenter_a":"Wait, did Kelleyanne get a new job? Is she now a spokeswoman for Ivanka? 45 will have to fire her. She can't do two things at once. Especially since at least one would be illegal.","post_message":"This is completely unethical and may even violate federal law. Kellyanne Conway—counselor to the President of the United States—just went on live TV to urge people to \"go buy Ivanka's stuff.”"},{"comment_id":"10153665573326077","commenter_b":"Yep bet you never did anything wrong in your life","commenter_a":"Wth is wrong with kids nowadays... Everyday they are up to something crazy !! Yesterday was drinking fuel with soda , today is this , tomorrow?? What??","post_message":"Have you heard of the \"duct tape challenge?\""},{"comment_id":"10153680967462577","commenter_b":"These migrants have been through much and they should be afforded more rights than everyone else. Don't wanna get attacked by a Muslim migrant? Stay inside. A Muslim migrant broke into your house and attacked you? Should have gone outside.","commenter_a":"The world is a sick place where everyone's rights are being removed under the guise of equality. Everyone has the equal right to shut up and lick big government's boots while footing the bill. Fuck this bullshit.","post_message":""},{"comment_id":"675287475916889","commenter_b":"so we don't need Muslims, Blacks, Hispanics, French or England immigrants here.....Missing anyone?","commenter_a":"We are having the same problem here with blacks, Hispanics, and muslims. They do not want to assemilate into the American society. They want their old country here with American benefits. Wake up America. We don't need a France or England here... or Sharia Law!","post_message":"Thankful hostages in France have been freed the terrorists have been brought to justice. A valiant and heroic performance by the French police.  UPDATE: Sadly, early reports hostages had been freed were premature. Our prayers are with victims and their families and our thanks with the police."}]
