[{"comment_id":"10153389055716770","commenter_b":"Wow is she stupid or what. Racist pig.","commenter_a":"Sure we can play with a bad bad boy and you will get bad results","post_message":"A CNN guest argued that her ex-CIA panel-mate was unqualified to talk about ISIS because he's white."},{"comment_id":"10153369157063984","commenter_b":"Fire them all and make new hires sign a contract that if they are caught stealing anything they will pay back double the amount of the theft. The citizens work hard for their money and it is the taxes they pay that keeps those in Washington working.","commenter_a":"Hey, as long as they're paying for their gambling and \"adult entertainment\" out of their own pockets, well..... that's between them and God! But, if I'm paying for any part of it, then \"nail them to the wall\"!!!","post_message":"This has got to be a big embarrassment, and they probably thought they'd gotten away with it..."},{"comment_id":"897196563636468","commenter_b":"Nailed it! Being as, I saw this last night and asked, who is this woman!","commenter_a":"Funny how Kelly Clarkson's known over a couple of continents, yet what's her face has never been heard of over here.","post_message":"Some people wait a lifetime for a comeback like this  well done, Kelly Clarkson."},{"comment_id":"10153740988490530","commenter_b":"This Bi..ch ran him over!! WITH HIS OWN TRUCK!!! She must pay!!!","commenter_a":"wow that's just a tragedy all over... All those lives destroyed forever","post_message":"Police say addiction led a suburban mom to carjack and run over a senior citizen in a Burger King parking lot."},{"comment_id":"10156156980300615","commenter_b":"You think most women are going to wear a gun strapped to their hip or chest so that it is visible? Are you serious?","commenter_a":"Open carry idiots should connect with this, since they are such dickheads.","post_message":"What's wrong with this picture? In Texas it will soon be legal to carry a gun on campus but not a red plastic penis."},{"comment_id":"636643946488247","commenter_b":"WHY DON'T YOU JUST SHUT UP-SAVE YOUR MUSLIM THREATS FOR THE MUSLIMS ! LONDON SURE SCREWED UP WHEN THEY LET SO MANY OF YOU MOVE INTO LONDON-AMERICA WILL NOT MAKE THAT MISTAKE !","commenter_a":"They will try to attack us anyway so if we don't allow them in it will be easier to contain the ones who are here already.","post_message":"The new Muslim mayor of London has issued a warning to Donald J. Trump: Moderate your stance on Muslims, or they will launch more attacks against America."},{"comment_id":"10153727923344153","commenter_b":"Leave them where they are at!!! Fix their country!!! Build camps at their country, protect their country and teach them to protect themselves against their issues as we still have to learn to deal with ours and protect our people and shelter our vets and homeless and dude in 30 more years I better have my social security I put into that pot religiously for me not for them !!!!!!!","commenter_a":"I still feel the same way : JUST SAY NO TO SYRIAN \"MIGRANTS!!!!\"","post_message":"Has your opinion on taking in Syrian refugees changed since the Paris attacks?"}]
