[{"comment_id":"924673837566701","commenter_b":"I meant divided we fall","commenter_a":"At least learn how to spell 'Missile' Then you can be an educated bigot!","post_message":"I have joined with a bipartisan group of 16 senators to introduce legislation that would impose economic pressure on Iran if international negotiations do not yield a final nuclear deal by June 30, 2015. This is the most important foreign policy issue facing our country. A nuclear Iran will threaten the security and safety of the United States and send a message of weakness to our allies and partners in the Middle East. This legislation is an important signal to Iran and the entire international community that the current negotiations are not endless and the Iranians cannot continue their dangerous nuclear activities."},{"comment_id":"652024288284285","commenter_b":"I'm so glad.","commenter_a":"Yes","post_message":"Muslim Miss USA Chooses Jesus Over Mohammed... Islamic Community FURIOUS  She has the right to believe whatever she wants to believe.   Do you support her choice?"},{"comment_id":"10152942568911636","commenter_b":"She has to Post some Nudes on the Internet for the People to Comment about Her Sexuality! :D","commenter_a":"I love yo voice","post_message":"Michelle Rodriguez praises Cara Delevigne"},{"comment_id":"1490217797705011","commenter_b":"She's not a Christian,the BIBLE says we will know them by their fruits , her fruit is rotten !!!","commenter_a":"That is because liberals are REALLY, REALLY STUPID!!!","post_message":""},{"comment_id":"10155107547054258","commenter_b":"Crooked Donald! Lock him up!","commenter_a":"CNN stopped covering the rally and MSNBC with Greta from FOX ran the picture only but had a white House speaking on behalf of Trump. So, on TV we missed Warren , Bernie and others, Corporate controlled media. again ! Thank goodness for social media !","post_message":"WATCH LIVE: Democrats in Congress hold a protest at the Supreme Court against President Trump's immigration executive order."},{"comment_id":"10158325140525725","commenter_b":"Yea !! Thank god that I wouldn't waist my time on those losers !!","commenter_a":"If they gave them to me I wouldn't go !!","post_message":"Looking to get out of last-minute Christmas shopping or away from your in-laws? Then Saturday's Chicago Bears home finale could be your answer."},{"comment_id":"10154623133343812","commenter_b":"maybe you cheat a wife","commenter_a":"Bill stated how wonderful a wife Hillary is...question...why did you have all those affairs then Bill???","post_message":"JUST IN: Tim Kaine officially wins the Democratic vice presidential nomination. @webpagelink"}]
