[{"comment_id":"1002821876430463","commenter_b":"There it is. He's going to protect her lying corrupt butt.","commenter_a":"They will only indict her if she losses Iowa and New Hampshire to Bernie then Bloomberg will join. Politics are so filled with crime it's sickening 🇺🇸","post_message":"FUBAR."},{"comment_id":"1080774725297647","commenter_b":"Given the history of Egyptian-Israeli relations it doesn't seem at all out of place","commenter_a":"We salute Egiptian people. This reminds us of GEORGE W. BUSH lrt him try to fly to Iraq there will be rain of rotten shoes on him","post_message":"An Egyptian lawmaker has been attacked with a shoe in parliament after he invited the Israeli ambassador to Cairo for dinner."},{"comment_id":"10153766656618984","commenter_b":"Get off your asses bitches you will have a better view !","commenter_a":"Absolutely, they need to be respectful. They believe they are special and above the law...they deserve to fold. Maybe they will be humble in their next job!!","post_message":"I did NOT see this coming, and I don't think the women of \"The View\" did either. They had just apologized for their controversial comments about the Miss America contestant who is a nurse when they got blindsided by some very bad news...  Do you think \"The View\" deserves what it's getting?"},{"comment_id":"10154101943008984","commenter_b":"@username , Why do you people who support only Trump find it necessary To call people names simply because they don't agree with you? Are you that insecure?","commenter_a":"Now do not get me wrong! I am for Trump 100%, think he'll be awesome BUT leave George W. Bush out of it! Take it out on Jeb because he deserves it but I don't think George does, at all!","post_message":"Donald J. Trump railed against George W. Bush for 9/11 at the last GOP debate. It got messy, and now \"W\" has responded like only he could..."},{"comment_id":"10156410644080725","commenter_b":".... And thats why im voting for Bernie Sanders and not a wealthy racist biggot like yourself.Mr. Trump our country doesnt need you.. you talk about about immagrants but all your wives were immagrants? What are you but an immagrant to this country yourself! Unless your native but that would be news to us! What tribe you belong to?? I.D cards to all the muslims in this country? Is this Nazi Germany???","commenter_a":"Trump is like a pre-PC candidate! So refreshing!! I remember feeling just a leetle bit awkward at first. That made me realize just how far we've fallen! #TeamTrump2016 #MakeAmericaGreatAgain #DitchAndSwitchNow","post_message":"People have got to stop working to be so politically correct and focus all of their energy on finding solutions to very complex problems!"},{"comment_id":"10153263682739342","commenter_b":"Bill I don't want white people dead I want bush dead","commenter_a":"Good now hang him","post_message":"Former President George W. Bush surprised a crowd at a Dallas courthouse Wednesday when he appeared for jury duty."},{"comment_id":"10153181342983812","commenter_b":"I do agree not to go looking for trouble. Often times, ya get more than ya bargained for ;)","commenter_a":"You can not go looking for trouble, find it, then decide you don't want said trouble. Its already too late!","post_message":"Relatives held a candlelight vigil to honor the life of Tammy Meyers. @webpagelink"}]
