[{"comment_id":"10153995516108854","commenter_b":"What a dumb whore weasel","commenter_a":"She's an STD waiting to happen.","post_message":"Lena Dunham Compares Rape Allegations Against Bill Cosby To The Holocaust…"},{"comment_id":"10153333221058984","commenter_b":"illegals cant vote and thats a fact","commenter_a":"yes especially with this crap happening in europe w radical muslims id say def close the borders latin americans dont want that crap either","post_message":"If you don't believe immigration is going to be THE issue in 2016, read this. My eyes were opened in a big way.  Do you support securing our borders?"},{"comment_id":"10154256296041130","commenter_b":"is she for Citizens United? how about the ACA? How about Roe v. Wade, what's her position there? Now compare Republican's position on these...","commenter_a":"Only further proving that Hilary is a Republican, but delusional liberals will still vote for her","post_message":"\"This is not a traditional race, and these are not traditional times.\""},{"comment_id":"10154601974052690","commenter_b":"Could it be that she is still here illegally","commenter_a":"The other problem people need to understand is everyone that is Spanish is not from Mexico. This woman is from San Salvadora. Everyone automatically thinks Mexico. I wonder why? Could it be ignorance taught to them by ignorant people. There are so many \"illegal immigrants\" here that people assume are from Mexico when in fact they are not. Stop stereo typing and get educated.","post_message":"An undocumented woman in need of surgery to remove a brain tumor is being held at a North Texas Immigration and Customs Enforcement detention center, her attorney says."},{"comment_id":"10152824464986680","commenter_b":"Its always been a problem, but its never been so widespread and in our faces. Without Snowden we would still think this was a big conspiracy.","commenter_a":"He will force the end of the PATRIOT Act then blame Obama when we are attacked.","post_message":"“I don’t agree with Sen. Paul on this issue, but I think he’s been a constructive guy,” Senate Majority Whip John Cornyn of Texas said just before the week-long recess."},{"comment_id":"10153078341498812","commenter_b":"Can't we just all agree that Muslims should just be wiped off the face of the earth?","commenter_a":"\"Not afraid.....hey America you guys are still coming right????\"","post_message":"\"NOT AFRAID\" - Thousands in France gather to a send message after Charlie Hebdo attack: @webpagelink"},{"comment_id":"903935252988832","commenter_b":"That strategy has never once worked. In fact, we created ISIS by doing exactly that to Iraq.","commenter_a":"Just another reason to bomb them into little pieces. If done correctly, these vermin could be wiped out in a matter of weeks.","post_message":"\"Since ISIL declared a caliphate in Iraq and Syria in July 2014, the group has become one of the world’s most well-financed terrorist organizations.\""}]
