[{"comment_id":"1384042331652908","commenter_b":"Good on ya.","commenter_a":"I stopped looking twenty years ago and saw my best friend and \"soul mate\" even though I know that souls are just a fantasy, right in the mirror. So me and my self became best friends and I haven't needed anyone in my life since then. I've been happier, I bought two homes in the last twenty years, and the freedom from the male drama is the best feeling in the world!!!","post_message":"As one writer points out, we spend endless hours wishing for, praying for, begging for our soul mates – that person who will finally make all the suffering worth it. But I’m here to tell you a little secret."},{"comment_id":"480862922104288","commenter_b":"Let them go swim in there on country. We dont need them polluteing our pools.All that goat hair will mess the pool up.You want be able to drain it.","commenter_a":"Send these people packing","post_message":"A judge just ruled that public pools must allow Muslims to swim in 'Burkinis'.  We're tired of Muslims infiltrating our country. This stops now.  Do you agree that 'Burkinis' are WRONG?"},{"comment_id":"1756356877909889","commenter_b":"Go Trump!!","commenter_a":"Trump winns","post_message":""},{"comment_id":"10152746929711167","commenter_b":"Name a lie, Grace? You've apparently chosen to forget the lie about \"sharia no-go zones in France!!!!\" that Fox had to retract. Of course you forgot it--you wipe your brain before turning on Fox News, don't you?","commenter_a":"You've got to love the weasel attempt by the corporate media to create a special category of \"non-journalism journalism\" for Fox News and Bill O'Reilly, whereby they get to brag about being \"Fair and Balanced No-Spin Zone\" news reporters and join the White House press corps, but get a free pass to lie to their audience.","post_message":"Normally, you can't get this many Americans to agree what color the sky is."},{"comment_id":"875157552546363","commenter_b":"This is going to happen in every state these Illegas are in!!! Will there ever be a way to get them out of this country.. We need a great Wall of the United States just like the great wall of China!!","commenter_a":"who could have seen that coming? Not Obummer. He's got blinders on.","post_message":"Texas Man Murdered Execution-Style By An Illegal Immigrant Who Had Already Been Deported  @webpagelink"},{"comment_id":"1906450522914712","commenter_b":"Also, men have their own issues. To claim that MRAs are bad people is simply a generic shaming tactic often employed by feminists. Reminds me of the White feather movement...","commenter_a":"Pretty discouraged reading many of the comments to this post. Fellow Bernie supporters, it would be great if you stopped living up to the misogynist label Clinton supporters have put on us as a group. Piling on here to deny that the wage gap exists is not helping.","post_message":""},{"comment_id":"10154572108529087","commenter_b":"She should put on her fake Indian outfit on.","commenter_a":"WARREN IS A BRAIN DEAD DUMBACRAT !!!","post_message":"Elizabeth Warren: \"Congress must pull its head out of the sand and launch a real, bipartisan, transparent inquiry into Russia. Our national security is at stake.\""}]
