[{"comment_id":"10153721547731378","commenter_b":"Says a skinny woman","commenter_a":"Life is short. Eat the cake.","post_message":"Are \"Cheat Days\" helpful or harmful to your diet? Some say giving into cravings can decrease your appetite. What do you think?"},{"comment_id":"938381199514967","commenter_b":"Take the bitchs baby she don't need it jus like her other ones","commenter_a":"We need to all really start to focus on the hard truth of meth and the sickening epademic that is in almost every big and small town across America . I'm tired of all of the meth head thieves , I can't even imagine how many children across America are going through the same life endangering situations becouse of the parents being hooked on meth .. don't spend the tax payers money on jail , send them to treatment for several months . I'm sure these parents were decent human beings before meth took over . Unfortunately now they have like all meth heads done sinister,and incomprehensible acts . It's good to see these kids have survived when so many others don't .","post_message":"Bond's set at $100,000 for each parent after they allegedly abandoned their three young children in a house that neighbors call a mess and fire hazard.   \"Rats that were running in and out of the garage. I mean, it was horrible.”"},{"comment_id":"10154259788063797","commenter_b":"Omg lol","commenter_a":"@username looollllllll whaaatttt","post_message":"ATTN NEW PARENTS: The perfect solution to a crying infant is every parents dream. One doctor claims he has a technique that can quiet any baby.  WATCH THE FULL VIDEO: @webpagelink"},{"comment_id":"10153076463414753","commenter_b":"If a woman in a bikini top was eating, would you also become this aggressive and immature ?doubt that very much. Grow the hell up.","commenter_a":"and why should we have to move our seat, or \"look away\"? we pay our money for a peaceful meal, not a side show!!!","post_message":"A woman in a cafe was nursing her child when she was approached by a man who asked her to cover up. That's when the cafe owner stepped in and had a few choice words to say."},{"comment_id":"10154092848234087","commenter_b":"A special letter to Republican nominee Donald J. Trump: Dear Sir, In a way, you are no better than your narcissistic alter ego. When told what you say is considered sexist, racist, classless, hurtful, and you say it more, you are a self-centered narcissist. Speaking off the top of your head, yelling hurtful insults, slinging mud, your unsophisticated intellect comes as somewhat surprising. It is apparent there is no limit to what you will say. For starters you are unapologetically low class: women ooze blood Hillary cofounded ISIS \"Hillary Clinton is a bigot!\" punish women for abortions kill terrorists and their families proposed mass deportation force African Americans use food stamps extreme vetting of Muslim immigrants if Ivanka wasn't daughter, he'd date her Mexican immigrant murderer rapists cancel Obamacare (offers no alternative) \"you have to be wealthy in order to be great\" \"putting a wife to work is a dangerous ...","commenter_a":"WE ARE CONCERNED ABOUT YOUR QUESTIONABLE BUSINESS DEALINGS OVERSEAS AND YOUR FINANCIAL TIES TO THE MOB AND OTHER COUNTRIES 1.\\tWill you sever ties with your company linked to foreign leaders, questionable organizations, and criminals if you become president? 2.\\tHow will you handle non-cancelable contractual obligations with parties whose interests conflict with those of the United States? 3.\\tWhile refusing to release your tax returns, how will you confirm that you do not have dangerous financial ties to bad actors abroad? 4.\\tIf you were willing to work with Qaddafi known terrorist and dictator there anyone you aren't willing to make a deal with? Who? 5.\\tHow can you be tough on Iran, given your business partnership with someone connected to Iranian money laundering? 6.\\tGiven that you've already questioned our commitments to NATO allies, what is your answer to this? For example, how would you handle the millions of dollars flowing into your organization ...","post_message":"Bernie Sanders ripped the media for letting itself be manipulated so easily by Trump."},{"comment_id":"10153032098202483","commenter_b":"The same move is taught in the military to subdue someone not to injure them.","commenter_a":"The officer gave him an order it was not obeyed. Act first and ask questions later. If you wait to see if he has a weapon you end up shot.","post_message":"Have you seen the entire video?  Do you think it should be shown in court?"},{"comment_id":"10153574207499641","commenter_b":"And they are mostly Muslims !!","commenter_a":"that's because indians are breeding like rats","post_message":"If every candidate were granted an interview, the hiring process could take four years to complete, officials said."}]
