[{"comment_id":"10154048392259087","commenter_b":"Mexicans might cross a border but not a fucking ocean.","commenter_a":"\"The Wall\" is just what he said to get racist white votes. You're a fucking moron if you think a wall would be built. Let alone be efficient. There's OTHER ways in!","post_message":"\"We didn't discuss who will pay for the wall,\" Trump admitted."},{"comment_id":"1806351676274393","commenter_b":"My body is mine Mario, and a pregnancy I would carry, would also be my decision. You get no say. Your ignorance proves you shouldn't have any. You think no women in your country get abortions? No, they get unsafe back-alley or home abortions. Men should absolutely not get to make legal decisions over what occurs within a woman's body.","commenter_a":"Your body is your choice only when your body will have 2 heads 4 arms 4 legs..if you want a choice you should buy a pack of condoms or close the oval tubes..stop abortion in Gods name.","post_message":"In Mike Pence's name"},{"comment_id":"10154075665287377","commenter_b":"Denounce your US Citizenship,,proclaim illegal alien status anf receive FREE Medical from the Government!!!!","commenter_a":"Can't repeal it fast enough for me! My own insurance costs went up 700 bucks once Obamacare kicked in. Seems I'm paying for some family that can't afford their own insurance. Well... I can't afford their insurance either!","post_message":"Sen. Rand Paul slammed the Affordable Care Act, also known as Obamacare, saying Congress will, \"as its first course of action, vote to repeal Obamacare. It cannot happen soon enough.\""},{"comment_id":"918281018215139","commenter_b":"All depends on how many illegals are allowed to vote!","commenter_a":"Nobody","post_message":"We’re now a little more than a year away from the 2016 presidential election and Hillary Rodham Clinton, long-time Democratic front-runner, has set her sights on the Oval Office. Who in the potential Republican field can beat her? Take our poll. @webpagelink"},{"comment_id":"10153355238128984","commenter_b":"They love talking about themselves. Bunch of dumb thugs. God make them go back under the rocks they crawled out of.","commenter_a":"A is A. (Aristotle)","post_message":"Both Obama and Baltimore's mayor have called the rioters by a one-word name that has generated controversy..."},{"comment_id":"1051602538269331","commenter_b":"STFU!","commenter_a":"Obama is one of them! The blood of those in Paris rests on him. \"The greatest threat is global warming....\" Obama caused those deaths in Paris.","post_message":"UPDATE"},{"comment_id":"10152757562815950","commenter_b":"Who really gives a fuck!! Fuck em both bitches!!!","commenter_a":"Kind of skips the part where police tell the suspect to comply . On the other hand ,it avoided death by cop gun.","post_message":"The police chief said the officer who hit the suspect with his car at full speed made a \"tough, tough, tough decision\" that probably saved lives."}]
