[{"comment_id":"1062159727157832","commenter_b":"If that were to happen then only the criminals will have guns.","commenter_a":"Aaw Fuck, here we go. Egotistical morons doing \"research\" and thinks their Right. Others just making shit up, then there's the name caller who judges everyone else..No One has a Fuckin Solution?! Then don't write Anything","post_message":"Karl Rove had a unique idea during a Fox News interview: The only way to stop people like Dylann Roof is to completely repeal the Second Amendment."},{"comment_id":"10153477334723984","commenter_b":"She doesn't care , she just wants the money,","commenter_a":"Go die you ugly whore what a fucken disgrace","post_message":"Pop star Miley Cyrus just said something highly disturbing about Christians. It's especially sad when you consider where she came from..."},{"comment_id":"10157053250220354","commenter_b":"She can't keel over soon enough. Evil beast!","commenter_a":"She's choking on all her lies!","post_message":"“You all right? Any mouth to mouth CPR?” one of the hosts joked, trying to lighten the mood.  “Senator, you coughing like you have something medicinal,” another host said.  LISTEN:"},{"comment_id":"10153794621104726","commenter_b":"Thats the REAL ISSUE here..PRAYER and FAITH ..these guys are so far remoived from G-d its pathetic..This all has to do with the men in POWER.....has been since the beginning....even satan wanted to be above our creator..these followers of satan are no different","commenter_a":"Still another reason I'm a pub!","post_message":"Democrats come out against God"},{"comment_id":"10153132008994497","commenter_b":"Conceded bitch... this shit practically writes itself. Lol","commenter_a":"This sick beat. Oh no!! Now what? Gimme a break. Never heard something so idiotic. A phrase? Boooooo!! :)","post_message":"From our sister publication:  The A.V. Club: \"From this day forward, any and all sick beats belong to Taylor Swift, under penalty of law.\""},{"comment_id":"10153763916386320","commenter_b":"Who cares? All cops should spend one day arresting all the illegals in NJ and we wouldn't have this problem. All illegals should be made uncomfortable by cops and regular citizens alike.","commenter_a":"and again until you've walked in a cops shoes you don't know what it's like! They deal with scum of the earth a lot and there hands are basically tied. It's a shame and it's frustrating. I did not watch the video and I don't plan too. I'm Sick and tired of orople picking on the cops. Yes I'm sure there are some that aren't the best but most of the cops are good. Start celebrating the good cops for a change!! But sadly no one seems to be recording when they are doing something good","post_message":"A New Jersey cop goes off and is caught on video saying racial comments to three Latinos. Watch here: @webpagelink"},{"comment_id":"858172280911557","commenter_b":"We'd be better served to ban the Muslims from our country period!","commenter_a":"Stick to your guns. We support you","post_message":"UPDATE: Gun Range Ban On Muslims Draws Fire  In the five months since Jan Morgan banned Muslims from her gun range in Hot Springs, Ark., business has boomed and predictions of a lawsuit brought by federal civil rights enforcers have so far proved inaccurate. Morgan, who claims keeping Muslims out of her Gun Cave... #guns #islam #shootingrange  @webpagelink"}]
