[{"comment_id":"10156189535540354","commenter_b":"@username you do know that Sharia Law requires gays to be destroyed?","commenter_a":"I can't imagine any conservative/Republican not standing with Dr. Carson on this.","post_message":"\"Sharia law is so inconsistent with the US Constitution Ben Carson could not be more right.\""},{"comment_id":"10153974696736943","commenter_b":"Double talk.!","commenter_a":"This is how you stand for law in government?","post_message":"Wednesday, June 01, 2016 Judicial Watch Director of Research and Investigations Chris Farrell appeared on\"America's Newsroom\" on Fox News Channel to discuss the latest developments in the depositions of Former Secretary of State Hillary Clinton inner circle regarding her use of private email while serving at the State Department."},{"comment_id":"10153187072706107","commenter_b":"How about a constitution change that says if both of your parents are illegal then you're illegal even if you're born here. No more anchor babies. No dream act, no in state tuition, nothing. The illegals are a slap in the face to the people who are legally trying to immigrate.","commenter_a":"Good Paul!","post_message":"Just minutes ago, on Fox News' On the Record, I announced I will introduce legislation this week to cut off ALL federal taxpayer funding for so-called \"sanctuary cities\" -- until they start abiding by federal law.  For taking this stand, I know I'm going to be attacked like never before.  But I think it's high time someone did something!  The truth is, for years politicians in BOTH parties have promised you and me secure borders.  But all we have to show for those promises is sheer lawlessness.  This President has time and again sought to go around Congress with illegal and unconstitutional executive actions regarding immigration.  And now many American cities are following in lockstep in open defiance of federal law!  These so-called \"sanctuary cities\" prohibit the use of funds to enforce federal immigration law, usually banning officers from even asking about a person's immigration status.  These cities become magnets for illegal immigrant criminals and gang members who have been deported multiple times, but know they're safe if they can just stay within a city's borders.  This can't be allowed to stand.  Not when we know terrorist organizations are looking at our porous southern border as a way to gain entry into the United States.  Not if we are to save the concept of rule by law.  My bill would end all federal taxpayer funding for these cities until they start ENFORCING federal immigration law.  I know these cities will shriek and moan that there shouldn't be any strings attached to all of your tax dollars.   They'll say they're entitled to pick and choose what laws they recognize.  And you can bet our national media will be on their side, and come after me with everything they have.  But it's time politicians cared more about keeping their promises to the American people than what our national media says.  If you agree, I need to hear from you right away.  Please sign your \"Enforce Immigration Law\" petition and agree to your most generous contribution of $20.16 IMMEDIATELY: @webpagelink"},{"comment_id":"659550864214259","commenter_b":"#lastword","commenter_a":"@username @username This is so true!","post_message":"How true is this?  Thanks to www.republicandirtytricks.com"},{"comment_id":"1251187991558679","commenter_b":"And a woman who should be in jail should disqualify to...","commenter_a":"This alone should disqualify this poor excuse for a human being from ever getting close to the White House.If I was the parent of that reporter who was mocked I would hurt down Trump and slap the shit out of him.And you can take that to the bank.","post_message":"This tells you everything you need to know about Donald Trump."},{"comment_id":"543745795816000","commenter_b":"We need to start carrying bacon with us and when they disrespect an American Bitch slap them with the bacon.","commenter_a":"Yes,yes! Or send their butts back! We don't want them here!","post_message":"This Fox News reporter was absolutely disrespected by these Muslims.  They are out of control. If Muslims are going to live in our country they need to learn some manners.  Do you agree Muslims have to assimilate or get out?"},{"comment_id":"10153093955378487","commenter_b":"One lady in particular..","commenter_a":"He only knows war and how to use military might .... nothing more. He is the same type of person as McCain.","post_message":"Netanyahu wants a role in shaping the Iranian nuclear agreement, should one materialize. His recent actions suggest that he doesn't quite know what he's doing."}]
