[{"comment_id":"559381210853585","commenter_b":"You only opt in because the choice is an illusion. Who reads the terms and conditions on anything online these days? Very few. I haven't thought of a solution re advertising, and the way things are going its only going to become more intrusive. The advent of neuromarketing is already upon us. The introduction of the 'reactions' facility on FB not excluded.","commenter_a":"I would try and read the enclosed article but the bombardment of ads, some obscuring the text, in the first 10 seconds put me off.","post_message":"Hint: it has nothing to do with preventing terrorism."},{"comment_id":"10152701811618067","commenter_b":"What about Asians! We have more wealth than whites! ;)","commenter_a":"CNN thought process: Pot? Check. Ladle? Check. Add racial mixture. Add perceived racial sleight. Stir vigorously. Serve on CNN Special, \"[fill in gap] in America\"","post_message":"The latest report about financial inequality makes for uncomfortable reading... @webpagelink"},{"comment_id":"1048601445225209","commenter_b":"I know... she has effectively modeled pant suits for old bags of dirt","commenter_a":"So tell me and please be honest what has Hillary done for America like a policy or a law or something that has benefited us you know she's been in politics for over 25 years been the first lady and a senator and Secretary of State what actually has she done for us and don't use her as an example.","post_message":"What our president says matters. We can't let Donald J. Trump's hateful words speak for us."},{"comment_id":"1047811211942074","commenter_b":"I love her and some woman here are simple misogynists!..bitter woman! GO HILLARY!","commenter_a":"Look Hillary, no one likes Lena Dunham.","post_message":"Follow along as Lena Dunham takes over Hillary’s Instagram account today from the trail in New Hampshire: instagram.com/HillaryClinton"},{"comment_id":"10154970022528690","commenter_b":"The world and so call United Nation have no interest in alepo people just because they are muslim, if its christian region this is happening the UN will have take action, but we the muslims are just folding our arm doing nothing, the only thing is to back to Allah, by saying; HASBUNALLAHU WANI'IMAL WAKIL, WANI'IMAL MAULA WANI'IMAL WAKIL,","commenter_a":"there is tubelight, internet, electricity bla bla. it seemed she is speaking from hotel pan pacific Singapore. we didn't heard even a sound of bullet fired. weird.","post_message":"Residents of East Aleppo are giving their final messages to the world."},{"comment_id":"1394765567230964","commenter_b":"Because they enjoy it. They love to rape. That's it.","commenter_a":"Im still confused. Why does it seem that boys need to be educated against forcibly sexually attacking a woman? Like, hey! You shouldn't hurt that girl! Why is that something they need to be taught? Its like saying boys are rabid animals that need to be trained or something. Maybe they are, but why??!! I guess in the case of Nairobi born boys, if one in 4 women have been raped, perhaps they witness a lot of those attacks and it normalises the behaviour. But still. I am struggling to comprehend how a boy in ANY country comes to believe that raping a girl and causing her harm is normal. 😕","post_message":"In case you missed it: Take a look inside Kenya's successful rape prevention program."},{"comment_id":"10154641460388734","commenter_b":"Where there is smoke. There is fire. Only the individuals involved will ever know the truth.","commenter_a":"Hi Tony","post_message":"A woman accusing Republican Presidential nominee Donald Trump of ‘of victimizing her with inappropriate sexual conduct’ is speaking with the press for the first time."}]
