[{"comment_id":"1042991895769865","commenter_b":"Assholes","commenter_a":"The WORST representation of what New Yorker are really LIKE! He's a Schmuck","post_message":"Let's try this again.  (And hey, while you're here, make sure to RSVP for our \"Vote against Trump\" page, and let the world know you are going to vote against him:  @webpagelink/ )"},{"comment_id":"1068442033272574","commenter_b":"If they don't like this country they should leave. Why don't they each donate a couple of million each to some of these black communities that need the money to make things better. They won't because they are talkers not doers.","commenter_a":"If the Giants do this I will give up my Tickets","post_message":"#BoycottNFL is gaining MASSIVE momentum online. Fans are FED-UP and FURIOUS with the anti-American hatred NFL players are increasingly showing.  Let's get 5,000 SHARES and LIKES to Boycott the NFL!!!  @webpagelink"},{"comment_id":"10156261922235354","commenter_b":"Time to go home.","commenter_a":"Don't know Trevor ...M and glad of it.","post_message":"Nevertheless, Trevor Noah still trashed Dr. Ben Carson for being \"callous.\"   No joke."},{"comment_id":"10156048486720389","commenter_b":"Anyone is smarter than she is!","commenter_a":"YES!!! She knowingly wiped her server clean or had someone way smarter than her...do it for her!!!!","post_message":"Question of the Day: Do you think Hillary Clinton knowingly wiped her server clean?"},{"comment_id":"10153196939420047","commenter_b":"Remove yourself from The United States of America. You Don'T America's Ways. LEAVE!!!","commenter_a":"It probably should be removed. Does a nation that promotes the murder of the unborn and celebrates a counterfeit\"marriage\" trust in the one, true God who has revealed Himself in Scripture? Nope. Meaningless words that don't impress the God of all creation at all. Repent and believe the Gospel.","post_message":"Avowed atheist Michael Newdow is at it again.  He's just filed a federal lawsuit demanding that \"In God We Trust\" be removed from U.S. currency.    We must remain vigilant in defending the Constitution from yet another assault on our religious heritage."},{"comment_id":"649524331880703","commenter_b":"She and Bernie are behind these riots. Why do we listen to her? She is a liar!","commenter_a":"You got that all right. Randy Webster","post_message":"Disappointing to hear."},{"comment_id":"10153448946523984","commenter_b":"We have a process for people to come this country and become citizens. These illegals should should not be put ahead of the people who are doing it the legal way.","commenter_a":"I'm not a crook","post_message":"Barack Obama’s bad week just got even worse...  Are you glad to see this happen?"}]
