[{"comment_id":"10153435939769087","commenter_b":"@username Sorry you feel that way. She'll cheat and lie to you also.","commenter_a":"Who cares anymore what Bill Clinton has to say? He has no influence anymore. Why doesn't Bill & Hillary Clinton follow the law? why are they exempt from following the law?","post_message":"\"It's important that we not be chumps when we decide what security provisions should be employed to check people's background,\" former President Bill Clinton said. \"America is a place that welcomes all people who are willing to treat people the way they want to be treated, willing to follow the law, willing to create a common community.\""},{"comment_id":"1238637239481907","commenter_b":"ugly ungrateful woman -","commenter_a":"He better say that. Else Lady Chewbacca would beat his ass.","post_message":"Michelle Obama just brought down the house with a passionate speech at the Democratic convention. It's safe to say President Obama was a fan of it:"},{"comment_id":"10153564661133837","commenter_b":"If they are illegal then yes deport them and yes build a wall preferably with large guns","commenter_a":"He just wants to deport them all, and thinks they're all criminals, and wants to build a wall!!","post_message":"TRUMP LOVES HISPANICS!  Presidential candidate Donald Trump tweeted out this afternoon, \"I love Hispanics!\" to help celebrate Cinco de Mayo.  THOUGHTS - THAT'S SO NICE or THAT'S SO WEIRD?"},{"comment_id":"10153442792427232","commenter_b":"Have you seen all the arrest of that originations leaders?","commenter_a":"Much like their spoksperson...LoL","post_message":"The civil rights group approved the measure Saturday at its national convention in Philadelphia to end the boycott of tourism and other economic activity. STORY HERE: @webpagelink"},{"comment_id":"10153320570936509","commenter_b":"The $2.1 billion isn't what I'm talking about...., keep reading.","commenter_a":"Tax break? He promised not to raise taxes on anyone making less than $250,000 then slams Obamacare down the throats of every American which is one of the largest tax increases in the history of our country aimed directly on the shoulders of the \"middleclass\".","post_message":"Many in the middle class, particularly the single and the elderly, won't see any tax breaks under Barack Obama's Middle Class Economics plan: @webpagelink"},{"comment_id":"10153739265778984","commenter_b":"No need to wonder what you are, being from Liberfornia and all.","commenter_a":"I 100% support her staying in jail until she agrees to do her job as ordered by a federal judge.","post_message":"For Kim Davis, this is Day 5 of her incarceration - but her lawyers just made an announcement that could turn things around.  Do you support Kim Davis?"},{"comment_id":"703956159761577","commenter_b":"this universe. She is vermin! Excuse me vermin.","commenter_a":"NOTHING is too horrible to say to her. She embodies every disgusting thing wrong in thi","post_message":"Ann Coulter wasn't the star of the roast, but she took a lot of the heat."}]
