[{"comment_id":"998546203523695","commenter_b":"when i ask, it's bengazi","commenter_a":"No president has ever endured the disrespect that President Obama, has. If there are people out there, that say that race has nothing to do with it. then they are the ones that are doing it.","post_message":"Sign your name if you're still standing with President Obama → @webpagelink"},{"comment_id":"10156385367815354","commenter_b":"Stop the influx NOW!!! It's sheer INSANITY!!!","commenter_a":"how do we stop Obama from doing this?","post_message":"“President Obama and Hillary Clinton’s idea that we should bring tens of thousands of Syrian Muslim refugees to America is nothing less than lunacy...I recognize that Barack Obama does not wish to defend this country, that he may have been tired of war, but our enemies are not tired of killing us, and they’re getting stronger....\""},{"comment_id":"10153264748117690","commenter_b":"I Hope she gets fired! She obviously can't do her job.","commenter_a":"Why does she still have a job? Bottom line she should of been fired end of story.","post_message":"A Kentucky courthouse clerk who refuses to issue same-sex marriage licenses is scheduled to appear before a federal judge Thursday. @webpagelink"},{"comment_id":"1705131916440587","commenter_b":"Hillary has a mouth just like her, ask Hillary sec service or help!! She is no lady","commenter_a":"Dr. Ben Carson is a class act, the women of the view are an embarrassment to women everywhere & the show should be taken off the air!!!","post_message":"Whoopi Goldberg is just plain GROSS...   I hope this means the end of The View!"},{"comment_id":"608866065958951","commenter_b":"Yes!!!","commenter_a":"@username :O","post_message":"Dangerously adorable."},{"comment_id":"10153847623528812","commenter_b":"Na u should go back to Europe and take inbred fascist friends with u","commenter_a":"Beat it and take Obama too","post_message":"14-year-old arrested after a homemade clock he brought to school was mistaken for a possible bomb will be attending school in the Middle East."},{"comment_id":"1097246043649586","commenter_b":"@username @username - that is still land grabbing of a different sort. Basically they can't use it for their cattle if it is protected for other wildlife. And they can't shoot the wolves that might harm their cattle because it is public land. (or they should not be allowed to). The deal is - for any business (including ranching and farming) there is risk for loss. The ranchers just don't want there to be any loss for them. But that is tough. That is life and that is business.","commenter_a":"Seriously amazing. .. I don't understand why they are so hell bent on getting rid of wild horses. . They are beautiful and majestic animals ... and for this woman to try to recreate that atmosphere for these rescue horses is astounding! !","post_message":"A sanctuary in Oregon lets rescue horses live our their lives in comfort. (via Places To See Before You Die)"}]
