[{"comment_id":"10154557773663203","commenter_b":"Its like sayin that one is born an alcoholic or a chain smoker... It is a LEARNED action","commenter_a":"Uh...no, most Americans don't say that!","post_message":"Are gays ‘born that way’? Most Americans now say yes, but science says no"},{"comment_id":"1199350936785736","commenter_b":"How much is she paying herself","commenter_a":"Woman has mental health issues. I believe it is called hallucinating. She also has a friend that is also dropping the same acid and she just got smashed in the presidential election!!!","post_message":"CNN HOST To Jill Stein: “Have You Seen Any Direct Evidence That Anyone Hacked The Voting Systems In MI, WI And PA?”…”Um…no” [VIDEO]"},{"comment_id":"10152777705324877","commenter_b":"not true.","commenter_a":"True. And she knows and will continue to go along with... People like them are ALL ABOUT money, and will do ANYTHING to keep it coming in their accounts!","post_message":"Mike Huckabee: Jay Z Is Crossing The Line Of Husband To Pimp. Read more of the conservative's tirade on Beyonce and Jay Z.   Grio fam, read his words and sound off with your thoughts."},{"comment_id":"1793816267524585","commenter_b":"Amy you should be ashamed for trying to get people to vote for that criminal!!! The things she's going to do to our country aren't going to effect you because you have money !!!","commenter_a":"I'd be much more concerned if I voted for someone who was indited and convicted of high crimes against the United States and humanity!","post_message":"\"Your voting history is public record.\""},{"comment_id":"1042027782504360","commenter_b":"Bitch would've been sucking soup out of a straw...","commenter_a":"This warms my soul.","post_message":"This is some serious racism. Would you have slapped her after she spit on you?"},{"comment_id":"10154559910664087","commenter_b":"@username: Are Christian refugees beheading non-Christians?","commenter_a":"They can rewrite it. However, they still have the footage of Trump calling for a Muslim ban on the campaign trail.","post_message":"BREAKING: White House attorneys are working on rewriting the language of President Trump's immigration ban following yesterday's dramatic defeat in the appeals court."},{"comment_id":"1000833706595553","commenter_b":"Too bad we can't deport people who desecrate our flag, but hey, this is America and they have rights! Too bad they can't send these idiots to live in Iran, North Korea or Russia!! Let them try that there and they'll find themselves in front of a firing squad!","commenter_a":"They would","post_message":"Obama's America  Air Force Veteran arrested at Valdosta State University trying to stop Black Power group from desecrating American Flag."}]
