[{"comment_id":"10153880758701337","commenter_b":"Lesbians","commenter_a":"Who the fuck cares..","post_message":"Justin Bieber has more than 50 tattoos yet this one fit perfectly in an unexpected spot..."},{"comment_id":"1301566109863416","commenter_b":"~ Peoples personas don't change without great effort, just ask any addict. ~ Why is it always the retarded republican that thinks they can tell people what to do? Can't quite quantify and validate your reasons for voting for the Trump tard?? ~ Let me help you. Trumps tax plan is a joke that gives radical tax breaks to the rich, while promising 0% tax for people making under 25K. People who make under 25K already don't pay any taxes, and the rich already have enough tax breaks and loop holes. @webpagelink ~ Trump says he wants to stop outsourcing, yet his clothing line and make America great hats are made in China. @webpagelink ~ You might think he's good with money, but Trumps companies filed for bankruptcy 4 times in recent history. @webpagelink ~ Trump wants to build a wall to keep criminals and drugs out, Yet criminals are ...","commenter_a":"Very good & funny","post_message":""},{"comment_id":"1080503548665334","commenter_b":"Fry that evil cow!","commenter_a":"Liar liar North Korean Pants suit is on FIRE!!!!","post_message":"“Stunning”"},{"comment_id":"10154717381688128","commenter_b":"Liar, liar pants on fire! Immigration takes jobs from Americans and suppresses wages! Illegals have destroyed this country !","commenter_a":"Well Da, this country is made of immigrants","post_message":"A comprehensive study from the National Academies of Sciences, Engineering and Medicine shows that immigrants coming into the U.S. have helped the economy in the long haul and had little lasting impact on the employment levels of native-born Americans. The conclusion runs counter to a popular narrative suggesting that immigrants take the jobs of U.S. citizens."},{"comment_id":"948311541870934","commenter_b":"If they want to live in our country then they need to live by our laws. Things should not be changed to accommodate them! If they don't want to live by our laws they should live elsewhere! We have to abide by the laws...so should they!","commenter_a":"I don't think so .. Not in Fla","post_message":"This state is allowing burkas in driver license photos!  THIS SHOULDN'T BE ALLOWED IN AMERICA..."},{"comment_id":"10153740264340667","commenter_b":"This woman is unethical and unprofessional and immoral @webpagelink","commenter_a":"It's not just him who sees it. Many people see how biased and one-sided the media is. Very unprofessional. No shame left. I'm not against anyone here. I simply criticize the corrupt system.","post_message":"Not the first time it's happened this election cycle."},{"comment_id":"10152757562815950","commenter_b":"Who really gives a fuck!! Fuck em both bitches!!!","commenter_a":"Kind of skips the part where police tell the suspect to comply . On the other hand ,it avoided death by cop gun.","post_message":"The police chief said the officer who hit the suspect with his car at full speed made a \"tough, tough, tough decision\" that probably saved lives."}]
