[{"comment_id":"10153899711236509","commenter_b":"I'd hate to see when an STD breaks out lol!!!","commenter_a":"Mahalia","post_message":"Imagine living in a town where everything you need is under one roof. Welcome to Whittier: @webpagelink #GreatAmericanStories"},{"comment_id":"939197849433302","commenter_b":"The real issue is the @username illegals flooding the country.","commenter_a":"Dumba** parents for not vaccinating! Selfish way of thinking! What if others get sick because you don't vaccinate your kid(s)!?!?","post_message":"NEW THIS MORNING > One of the biggest autism advocacy groups in the country is telling parents \"vaccines do not cause autism.\" KIRO 7 has discovered which Western Washington school districts are especially at risk for a measles outbreak. Watch here: @webpagelink"},{"comment_id":"741587372614642","commenter_b":"Won what???","commenter_a":"You blind-hearted Zionists, you just can't bear it that the Iranians have won and you lost: can you; the barbarians!","post_message":"A year after war with Israel, Gaza rulers boast of revitalized efforts to prepare its fighters for the next round of violence."},{"comment_id":"10154551399261178","commenter_b":"Ummmmm I don't think so","commenter_a":"The roaches got away...Cleveland turned on the lights , Philadelphia turned out the lights...the roaches got away","post_message":""},{"comment_id":"822517567938820","commenter_b":"This woman is crazy saying Hillary is the most loved and respected woman in the world! She's been hanging around Hillary to much, and Hillary's lying is rubbing off!!","commenter_a":"Security should of threw her out on her ass. The demons must be running scared.","post_message":"Watch: Dem Chair Shows Up INSIDE GOP Convention Arena And Does The Unthinkable  It is amazing to see to what extent the Democratic party will try to derail Trump's campaign.  Do you stand behind Donald Trump?"},{"comment_id":"10153715209333984","commenter_b":"Build a wall and send them home.","commenter_a":"You know illegal Mexicans come in this country illegally the women wait till about a month before delivering their child snake in this country have their child hoping to get birth rights I think if you come in this country out of another country if you have a child here your child is from your country not mine god bless the United States and we're going to try to keep it that way","post_message":"These Texas counties are doing something that has earned them a warning from Mexico, but it doesn't look like they're letting that stop them!  Do you support what these counties are doing?"},{"comment_id":"10154982308074641","commenter_b":"The Russians did it!!!! #CNN the Russians did it","commenter_a":"Is global warming to blame?","post_message":"Avalanches have killed more than 100 people after days of heavy snowfall along the Afghan-Pakistani border @webpagelink"}]
