[{"comment_id":"918834358153905","commenter_b":"It's not liberalism it's victimism. Justifing everything you do and tring to force others to change by acting like everything that happens is victimizing you","commenter_a":"Agreed.","post_message":"The latest COMMENTARY from Matt Walsh:"},{"comment_id":"10153692790361323","commenter_b":"I have a rare photo of Barack Obama actually working as President instead of playing golf. Rarest thing around. Unfortunately, as with everything connected to Obama, it is worth SQUAT.","commenter_a":"lovely","post_message":"Henry McCarty, known in Wild West lore as Billy the Kid, lived a brief and violent life, stealing and killing before his death in a gunfight aged 21. He lived with a gun in his hand – and sometimes, it seems, a croquet mallet.  Read the extraordinary story of how only the second photo ever authenticated as showing Billy the Kid came to light: @webpagelink"},{"comment_id":"10154692047301037","commenter_b":"Guess she can dress anyway she wants. Is that a big deal?????","commenter_a":"Hillary is on heroin!She wears long sleeves always even when its 95° out.And she fell out at the 9/11 memorial. And she'd have to be on heroin to put a U.S.Ambassador in a war zone with a couple of bodyguards. The last one he may have had some info that could get her convicted and that was a way to off him.","post_message":"“He has delusions—I’m not talking about being crazy, but for example when he told everybody he was very smart not to pay taxes, then denied he said it in front of a hundred million people.”"},{"comment_id":"1082383445115167","commenter_b":"Looks like a Transvestite Alien. Brucelyn Jenner looks better","commenter_a":"A new level of trashy. Way to be a good role model (insert slow clap)","post_message":"DAMN, TAYTAY!"},{"comment_id":"10155581523315192","commenter_b":"Girl should be held responsible for her actions!!!","commenter_a":"Not news.","post_message":"This came to light when a mom received a nude picture of her daughter in a text message:"},{"comment_id":"422148361459748","commenter_b":"Disgusting 😡 Hope they lose their seats next election! #CrookedBastards","commenter_a":"Continued disappointment!","post_message":"Republicans just sold our public schools to the highest bidder.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153528631451955","commenter_b":"What a cunt! I hope she ends up in jail!","commenter_a":"She's been divorced 3 times. If god forgave her for that 3 times, he'll forgive her for issuing a gay marriage license once haha","post_message":"DEFIANT: Judge orders KY clerk to appear in court after she again denies gay marriage licenses..."}]
