[{"comment_id":"1816579521955760","commenter_b":"@username please explain since you are, \"so sure\". Provide facts. Also, a bit of advice folks, just because you believe it doesn't mean it's true.","commenter_a":"No matter the outcome, people who voted for him and constantly protect him with ignorant comments, will just keep saying \"we won, we won\". They aren't exactly sure what they won since their candidate keeps back peddling on his entire platform. They'll just know that they won. We all lost. Ignorance, racism, labels, anger, and an immature person won.","post_message":"Computer scientists spot voting irregularities in swing states two weeks on from Trump's election."},{"comment_id":"10152662360374117","commenter_b":"Trevor clearly you're an angry misogynistic ass with your little troll posts. Ha.","commenter_a":"What's really alarming is that around 1 in 3 women will be sexually assaulted in their lifetime.","post_message":"Well, this is alarming."},{"comment_id":"10154361925736336","commenter_b":"@username Post the video of your interview with Dr. Jasser!","commenter_a":"Thank you President Obama for speaking up on this issue. It's sad that this event had to happen during Ramadan. Something needs to be done about assault rifles now!","post_message":"“We know enough to say that this was an act of terror and an act of hate.”   Moments ago, President Barack Obama addressed the city of Orlando facing the tragedy of the deadliest shooting in modern U.S. history."},{"comment_id":"1130148643687222","commenter_b":"Never. Who would be stupid enough to want murderer Hillary to be over our beautiful nation and wonderful people.","commenter_a":"Utah vote TRUMP!","post_message":"**BREAKING**"},{"comment_id":"10153982625649087","commenter_b":"Nobody cares that she wants to redistribute their money to the millions and millions of illegal alien Freeloaders and refuess","commenter_a":"Trump needs to start hammering Hillary Clinton just like Bernie Sanders did","post_message":"Donald J. Trump lashed out at former CIA Director Michael Morell after he announced his support for Hillary Clinton and said Russian President Vladimir Putin \"played\" the Republican nominee."},{"comment_id":"10154322735965963","commenter_b":"Deport all illegals","commenter_a":"This is bull nothing but bull! I have family that works and pay taxes and just to renew the green card 💳 cost a lot of money","post_message":"LIVE: Minneapolis police are monitoring the Caravan of Love protest that started at City Hall and is heading toward the U of M. The estimated crowd of 2,000 is marching in support of immigrants and refugees."},{"comment_id":"1211081885612641","commenter_b":"It's been 20 years since we've had a caring honest president. The last 8 years have been Muslim run, no doubt. When a commander in chief refuses to acknowledge we have terrorist attacks within our USA...isis islamic terrorists","commenter_a":"Screw Obumer!","post_message":"95 YR OLD WWII VETERAN Writes Scathing Letter To Obama: “I can’t figure out what country you’re the president of”"}]
