[{"comment_id":"10153232403476323","commenter_b":"Because, you can fuck over your country. As long as your fucking bitches, smokin cigars, and drinking whiskey, like a man God damnnit","commenter_a":"Why is everything about being gay","post_message":"Gay-rights activist and award-winning author Larry Kramer is 79 and in failing health, but that won’t defuse the impact of his latest bombshell project: the first 800-page instalment of a two-part history of America that tells of the hidden sexualities of figures from Alexander Hamilton, George Washington and Abraham Lincoln to Mark Twain, Herman Melville and Richard Nixon."},{"comment_id":"1430637223901951","commenter_b":"Does anyone think she is intelligent or this helps the women's cause?","commenter_a":"I'm sure her mother is very proud.","post_message":"Classy!"},{"comment_id":"470357549819863","commenter_b":"Another Blind Bitch!!!!!","commenter_a":"Wow. How sad he has really done a lot to get us back on track after what GW bush left him with and am sorry that all these post are being done by redneck asshole","post_message":"How would you define President Obama in one word?"},{"comment_id":"10154182389496337","commenter_b":"I would totally argue your point...but I have a rule about never arguing with beautiful girls!","commenter_a":"How is that a surprise? He's the most amazing character of all time! The little man casts a very big shadow.","post_message":"THE REAL \"MAIN CHARACTER\" ON Game of Thrones might surprise you..."},{"comment_id":"488243741366206","commenter_b":"Hell no don't mess with our children!!!","commenter_a":"I thinks it's wrong for Muslims to even to be on our soil!!!!!!","post_message":"American students are being forced to dress like Muslims.  This is absolutely unacceptable, we need to spread this and show Muslims we are not going to stand for this.  Do you think it's wrong for Muslims to force their beliefs on our children?"},{"comment_id":"10153233939551130","commenter_b":"Shame on you, damned sexist!","commenter_a":"\"Just to hold it in your hand\"... Yeah, that's not how tampons work >;)","post_message":"The best way to bring a tampon to the bathroom is just to hold it in your hand."},{"comment_id":"10154498468358690","commenter_b":"Julia I was having discussion with other posters in the same tone.. You should be ashamed that you cannot tell the difference . Who do you think you are to tell others ? Get off my post ! Then hit the block button . Theres a good little troll.","commenter_a":"What nonsense. The trouble began when Islam became the majority religion. ISIL is just a mixture of many Islamic terrorist organizations. The mistake the US made was leaving all the weapons and armory behind thinking Iraq would use them to fight them , instead a lot of the Iraqi army used them against eachother.","post_message":"The Iraqi town of Saadiya's problems began after the 2003 US invasion."}]
