[{"comment_id":"1726486197616166","commenter_b":"She needs a male beside her. They wont vote for","commenter_a":"Love my Senator, Tim Kaine. But Elizabeth Warren should be the Veep pick. Please make it happen, Madame Secretary!","post_message":"Watch live as Hillary and Senator Tim Kaine take the stage in Virginia ⬇️"},{"comment_id":"10153273654150329","commenter_b":"I can't stand feminists.","commenter_a":"Feminist are so fucking annoying.","post_message":"\"Meghan Trainor needs to take a women's studies class at the Taylor Swift school for pop stars who can't feminist good.\""},{"comment_id":"10153956190753797","commenter_b":"She better go to juvenile....period.","commenter_a":"those other kids should be charged also for not stopping it and cheering it on! makes me sick!","post_message":"UPDATE:  Last week, a controversial video went viral that shows a 3-year-old child being dragged and beaten by two young girls. Over the weekend, officials identified the girl and brought her in to custody. The shocking details involving the attack, here:"},{"comment_id":"922507297858399","commenter_b":"Ms. Miller, I'm a proud supporter of Mr. Trump. I'm so concerned that with Ms. Clinton's ability to \"Fix\" things she may have the ability to fix the election. I'm a true believer that this also happened in the current Pressident's second election. I am afraid that the Dem party will be in place for many years to come with the young and uninformed youth being targeted supporters through free things offered to them as well as dead people and illegals voting. . I'm hoping I am very wrong though. God help us.","commenter_a":"Wow!! While speaking on fox news live right now Mr trump actually seems presidential. This is the tone and demeanor we, the people have been asking you for. Let hillary bury herself. She will!!!! Be a better man. Be the man America needs. We want to believe that you can lead us but not unless you can start to act and sound like a good president.","post_message":"Radical Islamic terrorism threatens our world. Anyone who cannot name the enemy - cannot fix the problem!"},{"comment_id":"10153554692703984","commenter_b":"There's whores in all races, and drug dealers don't going stereotyping with that bullshit!!!","commenter_a":"A American should have right before any one from another country, should speak English and love the American way it's not just Mexican it's all.trying to bring their laws. Sorry America needs to stand up and fight for what's right.","post_message":"Hispanic employees were furious after this employer implemented this new rule, so they decided to sue.  But the employer won't be stopped. He says he has a good reason for doing this and they need to get over it...  Do you support the employer's decision?"},{"comment_id":"970899619630870","commenter_b":"Deport ALL MUSLIMS everywhere!!!!!!!","commenter_a":"FULL CASTRATION!!!!!!!!","post_message":"Top Muslim Imam: \"We shall breed with Europeans to conquer their countries!\" (Video)"},{"comment_id":"10153649615904199","commenter_b":"The employee aint do nuthin wrong. she got hit. ole white girl lucky she didnt get stomped harder.","commenter_a":"The employee should be fired. People need work ethics. Call for the customer to be removed!","post_message":"Warning this video contains graphic language."}]
