[{"comment_id":"10152996938497293","commenter_b":"Sorry you can't understand science. Maybe you should go back to high school.","commenter_a":"So the WaPo says evolution is fact, even though it's theory that can't be demonstrated? Bias is a wonderful thing.","post_message":"This can go down as one of the best examples ever of why it's downright impossible to convince someone who's \"opposed\" to evolution that it's a basic fact."},{"comment_id":"1619826891648925","commenter_b":"@username Killary's hips are evidently widening. Must be all the hot sauce and watermelons she stashes in her pants.","commenter_a":"Why I'm backing D.T., he's against the establishment, can't stand Obama & Hillary, called out lying Cruz, wants America first, he doesn't come from a political family, treats his 30,000 employees with respect, supports law enforcement, will put a border up, deal with illegals & radical muslims, doesn't act like a scumbag politician, he's not part of the \"Good Old Boys\", helps military and families, great family man, very passionate about this country & the citizens, doesn't take BS from anyone and wants to Make America Great Again! #VoteTrump2016","post_message":"FLORIDA -- THANK YOU --- WE CAN WIN! Lets MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153735112473984","commenter_b":"No joke you heathen bitch.","commenter_a":"Let's make an example of liberals and nonChristians by getting rid of them permanently. Bullets are cheap.","post_message":"For Kim Davis, this is Day 5 of her incarceration - but her lawyers just made an announcement that could turn things around.  Do you support Kim Davis?"},{"comment_id":"535259990005462","commenter_b":"I wish Dr Carson was our nominee! However, Trump is and he must win or our nation is doomed. Clinton has proven to be the most corrupted, evil lying politician ever!! It's beyond me that anyone in their right mind could support her!","commenter_a":"How can you defend this man?","post_message":"It's a shame that The New York Times and the media are on an all out witch hunt against Donald J. Trump. The media should be fair and balanced, not biased."},{"comment_id":"10152949649721378","commenter_b":"I don't use any drugs...yet your comment is still incomprehensible.","commenter_a":"Disturbing and sinful....","post_message":"IRELAND  MARRIAGE VOTE NUMBERS: 62.1% of voters in Ireland were in favor of same-sex marriage in the world first national vote on the issue.   Ireland's deputy prime minister, Labour Party leader Joan Burton, said Ireland was becoming \"a rainbow nation with a huge amount of diversity.\""},{"comment_id":"524375314431275","commenter_b":"She is a disgusting human being.","commenter_a":"Lord what a pig.","post_message":"President Bill Clinton's accusers are publicly condemning Joy Behar for calling them \"tramps.\" @webpagelink"},{"comment_id":"1851225291776966","commenter_b":"well said ,","commenter_a":"Trump's Victory, in another term (American people's Victory) has proven that the good citizens of the USA are great at determining their future, and changing the game and the whole regime for a better living and even world because America has a big influence on the whole world. Despite the massive media war that had been trying and pushing hard to find a way to put Mr. Trump aside or down to fail him by any dirty politics, means and ways... BUT they couldn't do you know why? Because he is capable and honest and most of all I believe that the church of humble believers everywhere have had an input in this victory asking the Good Father for this amazing nation to shine His face upon America again as He did in the past...!","post_message":"Former President George W. Bush had this message for President-elect Donald J. Trump."}]
