[{"comment_id":"10154139052147869","commenter_b":"Yes, she should move to Berkeley!","commenter_a":"Backward looking. When was the last time she looked in a mirror ...","post_message":"Another thing noticed in the Wikileaks release of the full transcripts Hillary Clinton’s paid appearances for Goldman Sachs: she described Republicans as “backward-looking” and fundamentally un-American.”  So in addition to being rednecks (according to Bill), people who don’t support her politically are racists, sexists, homophobes, xenophobes and Islamophobes; a “basket of deplorables” who are backward, irredeemable and fundamentally un-American.    So I have to wonder: why does she want to be the leader of all us horrible people?  If she hates everyone who disagrees with her that much, instead of running for President, why doesn’t she just run for mayor of Berkeley?"},{"comment_id":"10153765423589170","commenter_b":"@username you are spot on 100%. You don't allow a foreign entity into your country and let them have an area nor let them \"work it out\". Because that area gets a little bigger then a little bit more before soon they are running the country.","commenter_a":"Rahm assisted his Muslim brother Obama in degrading the police when they did do their job. Now the police are afraid to do their jobs.","post_message":"The irony here is that it's HIS ideology that has cops afraid to do their jobs.  His ilk spent the last eight years calling everyone racists.  Now he has the nerve to complain about the outcome?"},{"comment_id":"10153564661133837","commenter_b":"If they are illegal then yes deport them and yes build a wall preferably with large guns","commenter_a":"He just wants to deport them all, and thinks they're all criminals, and wants to build a wall!!","post_message":"TRUMP LOVES HISPANICS!  Presidential candidate Donald Trump tweeted out this afternoon, \"I love Hispanics!\" to help celebrate Cinco de Mayo.  THOUGHTS - THAT'S SO NICE or THAT'S SO WEIRD?"},{"comment_id":"500328103497004","commenter_b":"@username your mom is another uninformed voter. Now I'm voting for Trump just so you and your mom get hassled by immigration.","commenter_a":"Let me get this straight. Trump can beat Hillary, but he can't beat Bernie? So by voting for Hillary...you're basically voting for Trump?","post_message":"Is Bernie Sanders harming Hillary Clinton's chances against Donald J. Trump? Here's what he has to say about it. via Today Show"},{"comment_id":"1171128359565299","commenter_b":"How's he going to pay for the bloody wall????","commenter_a":"Showing a total and complete ignorance of understanding of the root of the problem.","post_message":"A big wall is the Swiss Army Knife of Republican politics."},{"comment_id":"10155232882540093","commenter_b":"I'm speaking about illegals, from 3rd world countries coming over our border and infecting the liberals who love them with diseases. There is a reason the government won't allow the American Citizen know where all those illegal kids and familes went to in OUR country. I'm sure the CDC would show there is a correlation between this outbreak and where these illegals settles. Look to those liberal states that have santuary cities.","commenter_a":"Funny we had nothing like this going on until illegals flooded our border.","post_message":"For many conservatives, resolving issues of faith and science can be tricky. What excuse do Democrats have?"},{"comment_id":"484244465097180","commenter_b":"Why does anyone listen to her?","commenter_a":"PIG","post_message":""}]
