[{"comment_id":"10154389152146955","commenter_b":"It's just what she does","commenter_a":"Its not like she left 4 people to die in Benghazi, Blamed a terrorist attack on youtube video, deleted 33,000 emails and Lied to congress,, accepted money from terrorist countries, or called millions of Americans Deplorable, this was just a small Lie about her health. At this point, What Difference does it make.","post_message":"FLASHBACK: SCARY COUGHING FIT AT BENGHAZI HEARING..."},{"comment_id":"10153382120572293","commenter_b":"They are not the same at all","commenter_a":"Deidri","post_message":"Why the analogy is important."},{"comment_id":"10153979603521509","commenter_b":"Time for all illegals to go home","commenter_a":"Rather have trump in kkk then black panther party","post_message":"Former Ku Klux Klan leader David Duke said Donald J. Trump is the \"best of the lot\" -- but didn't endorse him for 2016: @webpagelink"},{"comment_id":"10156744379040093","commenter_b":"@username Have you SEEN Trump on the debate stage? He doesn't know policy, he doesn't think ahead, and he stumbles when it comes to content. Add to that the media penchant for tailoring questions to compliment the dem candidate, and <bam> Hillary looks like a freaking scholar on the stage. The thought makes me physically ill. On top of that, Trump has considerable damning words and actions the media and dems (but I repeat myself) will toss like confetti upon constituents. In multiple polls, Trump sits in the mid-30s, without waver. This is going to suck.","commenter_a":"Do the right thing and vote for Cruz. I write such because the thought of Trump facing Hillary in debate makes me cringe. Kasich, the newest favorite of the GOP, cannot win. I love my home state, but Ohio doesn't save Kasich from toppling.","post_message":"Not budging."},{"comment_id":"10153621420851045","commenter_b":"Uncle had custody of her, I don't think it's what it sounds like. Parents don't just lose custody.","commenter_a":"🙏🙏🙏","post_message":"We have some fantastic news to share with you. Carlie Trent has been found safe and her uncle is in custody! #BringCarlieHome"},{"comment_id":"10153384887696491","commenter_b":"Forget you guys, she doesn't go out with peasants from the first lion order..","commenter_a":"@username yo daisy might be there when it opens","post_message":"Prepare for a smaller world at Disneyland"},{"comment_id":"10153387140986323","commenter_b":"How did the chicken cross the road? Roads, where we're going we don't need roads.","commenter_a":"Go Peter Rabbit!! (Y)","post_message":"Is this rabbit really scurrying across an avalanche?"}]
