[{"comment_id":"10154004285427061","commenter_b":"She is so ugly put a sack over her face","commenter_a":"I tried a similar comment above in my own post. Ppl are to busy thinking they are better or truly know or believe in the government to see the truth right in front of them. A little less attacking the comments of others on Fbk, an you could be smart enough to see the truth. Sure everyone deserves to dress lovely; however people continue to starve. Until you have walked a mile as I have struggling to feed your family/children; enjoy your fancy clothes. I will enjoy feeding my family!","post_message":"WATCH: Fashion forward First Lady Michelle Obama stuns at last night's White House State Dinner: abcn.ws/2ejwQwD"},{"comment_id":"10153083234283837","commenter_b":"What does sleeping have to do with a woman running over someone with her car?","commenter_a":"Thus is why elderly should not be sleeping","post_message":"APPALLING ACCIDENT - An elderly woman accidentally ran over a man, believed to be her husband, in the driveway of their Fort Lauderdale home."},{"comment_id":"10153798375353984","commenter_b":"She looks like saying anything about anything .she's a criminal herself.","commenter_a":"She has been untruthful about alot. Wonder about the taxes for them. Why is the government supporting their foundation. Need to separate them from government.","post_message":"Hillary just got caught admitting she would do something BIG to guns in America and the NRA if elected, and it's going to have conservative's heads spin.  Do you think a Hillary Clinton presidency would be one of the worst things that could happen to America?"},{"comment_id":"937143676339798","commenter_b":"And deport a politician who supports closed borders for every American murderer.","commenter_a":"Excellent .","post_message":"LIKE and SHARE if you agree...  100percentfedup.com"},{"comment_id":"10153851364301336","commenter_b":"Women and small children only.","commenter_a":"Look at all of those men! Able bodied men not fighting to defend their own country! Cowards!!!!","post_message":"The bill would require the FBI director to certify a background investigation for each refugee – and several top security officials to certify that each refugee is not a security threat to the U.S."},{"comment_id":"582952285239212","commenter_b":"Vote Trump! Not crooked Hillary","commenter_a":"Trump is nothing but a narcissistic coward. He likes to dish it out but he can't take it. Semper Fi","post_message":"Watch: POWERFUL and MOVING... This WWII Veteran and former POW is literally brought to tears in this impassioned plea to Americans to keep Donald Trump away from the presidency. Let's make this brave veteran go viral.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1338478099545268","commenter_b":"I really hate that women","commenter_a":"Like that's a surprise. ..Not at all..","post_message":"Is this how Casey Anthony paid for her defence?"}]
