[{"comment_id":"10154450153734411","commenter_b":"@username Is there a government on this planet that is not - up to no good - ?","commenter_a":"Why are they bombing their own airport... ISIS Turks are weird","post_message":"BREAKING - #ATATURK #BLASTS:  - at least 50 dead - about 60 wounded - 2 explosions"},{"comment_id":"10157633958190389","commenter_b":"@username IDIOT.","commenter_a":"I'm voting Donald Trump and I will not let the media influence me. Yes he has made some clear mistakes in his campaign with \"words\" but, Secretary Clinton has made clear mistakes multiple times with ACTIONS. She's a politician, getting paid by Saudi, Benghazi, getting paid to speak, email server, the list goes on. BUT, Trump showed more heart last night then any candidate I have seen; not because he wants power but because he cares for you & me. After seeing Lester Holt TRY to demolish trump, it did hit me, that the media does have power, and will do anything it takes to get what they want.","post_message":""},{"comment_id":"10154284155303908","commenter_b":"Alexandria Lindquist Larry bought the lease for 14 million, Bumped up his policies just prior and netted a 4.5 bn dollar payout. Funny that!","commenter_a":"Tallest structure in the world. Located in the middle of one of the largest and most populated cities. And you're telling me that the developers didn't take into account the possibility of the structures collapsing? I think they did. And in the midst of a terrorist attack, the split second decision had to be made; whether or not to take down the Structures in a controlled explosion ( which was probably designed during conception ) How would they have known whether or not any more explosives were going to go off? Tough call","post_message":"Were the twin towers, and more specifically, building 7 blown up by bombs on 9/11? Researchers at the University of Alaska are about to find out."},{"comment_id":"10153287109127629","commenter_b":"Yep, big whore, along with the rest of them!","commenter_a":"so what..she looks beautiful!","post_message":"All the times the Kardashians pretended Kylie Jenner's big fake lips were real."},{"comment_id":"10154985023891192","commenter_b":"Because life on Earth is the only life we can observe and study, so it makes sense to look for other life within the scope of life as we know it. How could we even begin to look for other forms of life if we don't have a clue what to look for?","commenter_a":"I really don't understand the definition of \"alien life\" and why scientists think the environment needs to be remotely similar to ours to support \"life\". HUMANS need the right temperature and water.... \"aliens\" may not....??!","post_message":"BREAKING"},{"comment_id":"10154563720189087","commenter_b":"Religion and government is intertwined...Muslim ban that include pushing Christian refugees to the top of the list. Unconstitutional violates church state seperation however her trump wanta to also allow tax exempt churches to be allowed to donate to politicians. And if you don't understand why that's wrong please re-read your constitution.","commenter_a":"I am so proud of Muslims, Hispanics & Women. To be abused and treated so badly by Mango Mussolini, and to still hold their head so high, is truly wonderful!\"","post_message":"President Donald J. Trump: \"I am so proud of my daughter Ivanka. To be abused and treated so badly by the media, and to still hold her head so high, is truly wonderful!\""},{"comment_id":"975822185786810","commenter_b":"@username...I never have been a democrate I'm an independent. I chose the best man/woman for the job. And without the independent vote...hrc will lose. So...tell me again HRC is gonna be Prez, cuz it's not gonna happen without us and my fellow Bernicrates","commenter_a":"Yet you lose to Trump. All numbers say he will wipe the floor with you! BERNIE is the only one to Win against all GOP. Numbers show it. And he's winning national polls. I WILL NEVER CAST A VOTE FOR YOU...EVER","post_message":"Know someone in South Carolina who’s not sure who to vote for today? Share this."}]
