[{"comment_id":"958028154307215","commenter_b":"@username bitch!","commenter_a":"Does she realized she joined the military to defend the constitution....if she is that ashamed of America, she should request a dishonorable discharge.","post_message":"A sailor refused to stand for the National Anthem. She might be in big trouble over the protest. Should she be punished?"},{"comment_id":"10153075013704342","commenter_b":"And then she'll leave...","commenter_a":"idiots, so the what are they going to pay for their new animal sanctuary now that the livestock are not bringing in enough money to feed or maintain the ranch? oh yeah, they'll just do another gofundme scam and a bunch of idiots will pay their bills for them. crap like this is getting ridiculous","post_message":"CATTLE RANCHER GOES VEGAN: For four generations, cattle have been raised on the Sonnen Ranch in Angleton. A few months ago, that tradition ended when the current rancher got back together with his ex-wife, and she pressured him to go vegan."},{"comment_id":"10154669913269843","commenter_b":"Well some of those people must be women with phones.","commenter_a":"Yay! Maybe traffic will be better!","post_message":"\"A Day Without Immigrants\" actions are planned across the U.S. in cities like Dallas, Austin, Philadelphia, Washington and Boston... bit.ly/2kz5UXf"},{"comment_id":"10152754691111051","commenter_b":"It's wonderful to know he has an optic nerve and so may one day be able to see!","commenter_a":"Why did they lie to her to start with !!!!!!!!","post_message":"This mom repeatedly asked why her new baby wasn’t opening his eyes. Doctors said his face was just a little swollen. Two weeks later, she found out the truth."},{"comment_id":"909598592517510","commenter_b":"what a load of crap get off facebook,snapchat,instagram, pintrest,tumbler and go to sleep before 1am then see what happens and u are up at 630 because it u move so slowwwwwww be organized :) and btw u start at 9am","commenter_a":"@username Dannii Leask","post_message":"We might as well be sending teens to school in the middle of the night."},{"comment_id":"1647473612211471","commenter_b":"Trump has done nothing against the law and if he did why didn't they file charges or even report it....This is just bull and not important...but on the other hand Hillary can and will be in trouble with these email leaks...statue of limitations is not up on her...so there can be charges brought up on her","commenter_a":"The fact is, that you people have lost all credibility with anyone with the ability to think for themselves...Your obscene bias, is so obvious, it's not even funny anymore....The NY Times has even less credibility, and is viewed as even more bias and corrupt than @username or People, because the previous allegation the Times made a few months ago, was **proven false by the \"victim\" herself**. And you have to understand that the election is *temporary*, and after the election is over, your ratings will still be at records lows, except your reputation/credibility will have been permanently shot, permanently destroyed. This is the price you, your producers and executives have paid to try and skew this election towards Hillary at any and all costs...","post_message":"Ex-beauty queen says it was humiliating for Donald J. Trump to be backstage, \"before you could put a robe or kind of dress yourself, he walked in. Some women were half naked, others were in the process of changing.” @webpagelink"},{"comment_id":"1364153086957478","commenter_b":"Let's hope NOT. NO MORE COMMON CORE! NO ON ROMNEY! KEEP your PROMISES!","commenter_a":"I agree.","post_message":"I wonder if Conway is behind the \"new\" Trump?  The whole \"lets leave Hillary alone\"... and \"lets talk to Mitt about being Sec of State\"... and \"lets hire a pro-common core Sec of Ed.\".....  It's getting harder to stay smiley faced.  We can only be pushed so far.  Enough of Mitt.  Dump him.  Give Rudy G. the job of Sec of State TOMORROW. Not only is he talented, but show some loyalty to the guy who stuck his neck out.  Stop making the man sweat it out, and start supporting the platform we voted for.  Walk the walk already.  @webpagelink"}]
