[{"comment_id":"1174478745905487","commenter_b":"The hormonal teenager that's checking people's bags is supposed to make us feel secure?","commenter_a":"I would rather be inconvenienced than shot why I watched a movie","post_message":"The chain said the procedure would inconvenience guests but provide better security."},{"comment_id":"10153734321486350","commenter_b":"You guys have kickass daughters :)","commenter_a":"Last year my daughter heard a football coach at my sons practice tell the boys they were playing like a bunch of girls. This year she is showing them how girls really play. Team captain and can take down every boy, she is playing on the line for both offense and defense. #girlscanplayfootballtoo","post_message":"\"The boys on the team were apprehensive at first, but then she laid a hit on someone and they realized she's just another player with a ponytail."},{"comment_id":"10154075062351037","commenter_b":"And she banged Frank enough to make Dutch jealous, and to tell him to eff off. 😘","commenter_a":"one classy Lady that loved her husband and her country","post_message":"“She totally saw her role as supporting and defending her husband.”"},{"comment_id":"1457146887628950","commenter_b":"She's singlehandedly responsible for the murder of countless unborn babies! She can burn in Hell!","commenter_a":"Rest In Peace Norma. God bless you","post_message":"Norma McCorvey, 'Jane Roe' of Roe v. Wade, dies at age 69"},{"comment_id":"10156221471665725","commenter_b":"Trump is only enforcing a fedral law, by deporting illegals !!! This is already the law !!!","commenter_a":"I am inviting all of TRUMP FAN to PRAY , from the HEART everyday and all the time, he need it and we need him, please let get together , for our country and for our new president TRUMP, TRUMP 2016, AMEN !!!!","post_message":"I will be hosting Saturday Night Live on November 7th. Looking forward to it!"},{"comment_id":"10154404205156130","commenter_b":"Holy crap, what a bunch of drama queens.","commenter_a":"Done","post_message":"It's a tiny gesture, but it speaks volumes."},{"comment_id":"10154180246323984","commenter_b":"Ha ha bitch you lost .........","commenter_a":"This is why they Hate Donald Trump, He is upsetting the SCheme they have in PLACE! @webpagelink","post_message":"Many are predicting that Marco Rubio is going to lose his home state of Florida in tonight's primary. Rubio has a plan if that is the case, and it's going to surprise a lot of people.  Is it over for Rubio if he loses Florida?"}]
