[{"comment_id":"10153176907066130","commenter_b":"And not be forcibly altered. Don't circumcise babies!","commenter_a":"Before picture or nahhh","post_message":"\"We need to remove the stigma. We should be able to alter whatever we please, free of the judgment of others.\""},{"comment_id":"1003873189632434","commenter_b":"When you take into account what these 2 young men did taking beer from a grocery store well there's going to be consequences plus swinging a skate board well the Police have to do something...I wish I were standing holding a sign I Support the Police Department !!","commenter_a":"I hate to say this but the store video does not lie. Now hopefully they'll release the bodycam video too. Now would be a great time to prove just how successful those are.","post_message":"The Olympia police officer who shot two men last week has given his account of what happened to investigators, and the department isn't releasing information.   More than 100 people packed city hall tonight demanding immediate changes in police accountability >> @webpagelink"},{"comment_id":"958116217578241","commenter_b":"Hillary had two terms (8) years in the White House. Hillary was involved in everything bill Clinton did!! Hillary had two terms (8) as a New York senator. Hillary had a term (4) years as Secretary of State. Yet, the old girl thought she could have her own server and NOT be held accountable for classified emails... When are Americans going to get pissed enough to hold the shrew responsible?? Hillary left four AMERICAN men to be tortured until dead in Benghazi. Could this be what she and her aids are hiding? As of Friday, as per a JUDGES order nothing has been turned over. The two aids hide behind an attorney and Hillary just never answered... Monday such be very interesting!","commenter_a":"She needs to STOP Monsanto instead of defending them. We all have a right to know what is in our food.","post_message":"Join Hillary's fight to build an America where we don't leave anyone out or anyone behind: @webpagelink"},{"comment_id":"1002821876430463","commenter_b":"There it is. He's going to protect her lying corrupt butt.","commenter_a":"They will only indict her if she losses Iowa and New Hampshire to Bernie then Bloomberg will join. Politics are so filled with crime it's sickening 🇺🇸","post_message":"FUBAR."},{"comment_id":"10153257325640950","commenter_b":"Quit smoking dumb ass broads or don't get pregnant!!!","commenter_a":"Smoking while pregnant should be child abuse. The reason it is not is that Planned Parenthood and the rest of the abortion industry wants no rights assigned to kids when they are in utero, because doing that would admit that they are a person.","post_message":"Smoking during pregnancy can lead to complications including sometimes dangerous premature births and sudden infant death syndrome."},{"comment_id":"684786888378556","commenter_b":"everyone has a right to their opinion, some are better than others, Go Clint","commenter_a":"He is furious with Clint but LOVES all the celebrities that pander to him........","post_message":"Obama wants Clint Eastwood finished, but he is holding his ground. H's in trouble. Let's show him our support. Can we get 100,000 'LIKES' for Clint Eastwood?"},{"comment_id":"911367582233916","commenter_b":"If she was, she wouldn't have been fired, period.","commenter_a":"I wouldn't give her a job, she will steal me blind.","post_message":"The Lead with Jake Tapper host said it is his favorite \"live TV\" moment of 2015."}]
