[{"comment_id":"10153055647952235","commenter_b":"oh shut up Sarah !","commenter_a":"I'm more left leaning and I know she's a joke.","post_message":"Pass the popcorn!"},{"comment_id":"1338478099545268","commenter_b":"I really hate that women","commenter_a":"Like that's a surprise. ..Not at all..","post_message":"Is this how Casey Anthony paid for her defence?"},{"comment_id":"10154595808829445","commenter_b":"Pot head moms, guiding their children. What a joke ........","commenter_a":"Craig Roberts Me as a parent.","post_message":"This mom clearly thought it was high time for the kids to go back to school @webpagelink"},{"comment_id":"10153897957233352","commenter_b":"Stfu","commenter_a":"He was a menace to the world. He destroyed so many lives so that he can so call keep the children of Columbia to stay away from drugs. What a bum. He destroyed lives right here in the USA., way too many.","post_message":"My life with the world’s most infamous drug lord: Pablo Escobar’s son reveals the heartbreak, fear of violence and how his father once burnt $2MILLION in cash to keep warm one night on the run"},{"comment_id":"10153490575133854","commenter_b":"Can some one just shut her up for a year or two ? Talk about a bullshiter.","commenter_a":"Take the guns from her handlers!","post_message":"Hillary Clinton Denounces White Privilege, Calls for Taking Guns From ‘Those Whose Hearts Are Filled With Hate’"},{"comment_id":"1239279662765353","commenter_b":"Judi you are correct about Obama, good for you.","commenter_a":"These little things they bring out about Ben Carson are all they can find. It's all they've got! They've got nothin'!","post_message":"#BenCarson should ask the media:  Where are Obama's grades and transcripts? And who checked out the lies in his autobiography?"},{"comment_id":"10153811362959087","commenter_b":"She's too busy partying","commenter_a":"Dean Forest: your party is losing what it needs more of. Susana Martinez will seitch to the Dems if trump isn't careful.","post_message":"A Hispanic official with the Republican National Committee is resigning after telling coworkers she is uncomfortable in a job where she has to work to elect Donald Trump."}]
