[{"comment_id":"524518094380814","commenter_b":"Planned parenthood another way of saying murderous selfish bitch, or greed doctor. I think both. Revoke the doctors licences, and any woman getting an abortion gets a hysterectomy too. If you're willing to murder your own child once you don't deserve the privilege to have any at all.","commenter_a":"Hillary’s claiming credit for Planned Parenthood’s selling of fetal body parts. She says it’s a real money maker, and the only way she’s able to afford Starbucks....","post_message":"The top Planned Parenthood doctor whose face is all over the Internet because of an undercover video otherwise has left little mark on social media or elsewhere on the Web."},{"comment_id":"458392787682348","commenter_b":"I dont think they have been treated bad enough...kick em out of the White House and Ill be happy!","commenter_a":"POS","post_message":"Seriously..."},{"comment_id":"10154414773758279","commenter_b":"@username what makes you think that? Drones ARE killing civilians. Listen to the video again.","commenter_a":"A few more of this resignations and Obama would be forced to admit that he is on the immoral side of history. This could be an effective form of civil disobedience.","post_message":"Watch: U.S. Army Reserve Chaplain Capt. Chris Antal reads his resignation letter to President Obama."},{"comment_id":"10154558437983645","commenter_b":"Oh Gabrielle you maam are the main reason racism still exist!","commenter_a":"Had to be white. He should of been charge with murder","post_message":"Dennis Meers faces 11 months in prison if he fails his probation. His granddaughter Cadence Orcutt died in a November 2015 rollover crash where she was behind the wheel."},{"comment_id":"10154235206604203","commenter_b":"Black girl magic. Fucking lol.","commenter_a":"Kathryn, guuuurl. You can find me runway-walking down the street to your house with a bottle and a mission to witness this black girl magic. Let me stop by Red Lobster real quick, tho.","post_message":"Wow."},{"comment_id":"1361756670528336","commenter_b":"Vengeance is mine saith the Lord.","commenter_a":"Disgusting and low class","post_message":"More tolerance from our friends on the left."},{"comment_id":"10152758056381051","commenter_b":"In her own bed? I would've picked something heavier than a shoe! Id burn the bed.","commenter_a":"He is scum her bed he needs to loose his penis cause hr is thinking with his small head","post_message":"When this wife got home and found her husband in bed with another woman, she decided to teach him a lesson."}]
