[{"comment_id":"10153967377745894","commenter_b":"She has some fat tits. Lets be real","commenter_a":"I don't know why she feels the need to show her tits Wherever She Goes.","post_message":"See how Mariah Carey's relationship with billionaire James Packer began to fall apart on Mariah's World."},{"comment_id":"1238709539473364","commenter_b":"You are one disturbed individual...","commenter_a":"That is a symbol of bigotry and hatred towards gay people, and Chris Pratt should know better than to insult an entire sexuality with this stunt.","post_message":"Actor Chris Pratt spent Easter building a giant cross."},{"comment_id":"10153308382443145","commenter_b":"How sad ! Ban the Frat !!","commenter_a":"Two bills allowing guns on college campuses are about to be introduced. Alcohol, hubris, testosterone, guns. What could go wrong?","post_message":"The UCF chapter of the Sigma Nu fraternity was suspended after a video surfaced of a member chanting the word \"rape\" and encouraging sexual violence toward women, the university said. The organization will have a formal hearing Thursday. #wftv"},{"comment_id":"685505648280301","commenter_b":"@username don't worry, she'll deny, lie and get out of it. Doesn't she always!","commenter_a":"They say truth is stranger than fiction but this is ridiculous. We now have a presidential candidate running for office under investigation by the FBI and she is allowed to continue her campaign?","post_message":"BREAKING NEWS: New emails that prompted the reopening of the Hillary Clinton investigation came from devices owned by Anthony Weiner and Huma Abedin, according to an FBI source. @webpagelink"},{"comment_id":"1542774025748103","commenter_b":"As usual women come ro the rescue","commenter_a":"What kind of crap insinuating Hillary in this???","post_message":"YES!"},{"comment_id":"1056445444376466","commenter_b":"Happy International Women's day.","commenter_a":"A woman got recognition in the late 1800s? Wasn't the womans rights movement kind of non existent at that point? Wouldn't she have just been laughed out by any male doctor of the era without a chance to prove herself","post_message":"#womenyoushouldhaveheardof"},{"comment_id":"10153045514858908","commenter_b":"Wrong. Anti-vaxxers allow a disease to evolve and make said vaccinations useless. If we ALL got vaccinated, the disease is wiped out and it can't evolve or spread. Science.","commenter_a":"So I go to read the article, and directly above it is a fear mongering advertisement with a link...don't catch shingles. Get your vacination now. SMH If you don't want vacinations dont get them. If you want vacinations get them. If you believe vacinations work then you are in no danger of catching the diseases from the people you are bitching at and preaching to. Mind your own business like people did in the old days before Facebook.","post_message":"Many important points made here are not to be ignored...."}]
