[{"comment_id":"10153128305820933","commenter_b":"Kasich and Taylor can't be responsible when a trusted employee breaks rules behind their backs. Taylor has come out strong against the actions and has expressed deep disappointment that the Trust of the people was broken... as for Spencer (Tim) Balls crazy assertions. Kasich had nothing to do with the ordeal. Spencer (Tim) Ball has a vendetta against Worthington Christian Schools. Kasich's daughters attend the school. That is the only connection between the 2.","commenter_a":"Today's Columbus Dispatch (newspaper) had a good article revealing problems in the Lt. Gov.'s house.","post_message":"Gov. Kasich stopped to greet a small group in beautiful Peterborough, New Hampshire to end the week. See you again soon, New Hampshire! #nhpolitics #fitn"},{"comment_id":"10153061361762235","commenter_b":"Actually, she's not a Texan... she's a writer from Michigan... and she can take I-35 North and get her ass outta my state!","commenter_a":"Think this is the Wicked Witch of Texas!!!! She is mean and crazy!!!!!","post_message":"American Taliban."},{"comment_id":"1286858341353620","commenter_b":"who cares !!! no one !!! let that bitch fall !!!!","commenter_a":"She is sick. She was having a seizure. She is lying about her health. She was the only one wearing sun glasses and I thought it strange. She is a basket case.","post_message":"BREAKING:  HILLARY HAS MEDICAL EPISODE AT 9/11 CEREMONY in NYC.  Swept away by security detail.  VIDEO  @webpagelink"},{"comment_id":"10154704030031323","commenter_b":"@username Or you could just admit that you are fundamentally incorrect. That would be the mature thing to do here. You can't just use the serious topic of misogyny and sexism as an argument whenever you like. It plays a great disservice to the genuine areas where such a discourse is absolutely valid. This is about holding a proven heavily corrupted, belligerent war-mongerer to account, who happens to be a woman. End of story.","commenter_a":"Sorry Guardian, but no one actually buys the 'its because she's a woman' argument when it comes to Clinton. There are actually legitimate reasons why many do not like her. You're wasting your time.","post_message":"\"Hillary Clinton irritates people not just because of her gender, but because we simply can’t process her narrative. There are no stories that prepare us for her trajectory through life and, therefore, we react to her as if she’s a disruption in our reality, rather than a person. We love public women best when they are losers, when they’re humiliated, defeated, or (in some instances) just plain killed. Yet Clinton, despite the disapproval that rains down on her, continues to go out there and chalk up wins.\""},{"comment_id":"10152728783180950","commenter_b":"No China, it comes from China !","commenter_a":"Florida.. of course..","post_message":"\"We're starting to see a rash of cases of a syndrome referred to as excited delirium.\""},{"comment_id":"1673203152922095","commenter_b":"Fucktards.","commenter_a":"Oh come on....we have laws for a reason..I don't care what color your skin is...if you urinate in public..you need to be arrested!!! What is this world coming to???","post_message":"New York City’s city council is set to dilute a host of criminal laws including laws against public urination and excessive noise because council members believe too many members of minorities are getting arrested."},{"comment_id":"913510862078500","commenter_b":"This women is a idiot and if she thinks that these charges are going to stick she is crazier than hell.. She is a real nut job.. Glad she is in Baltimore hope the hell that is where she stayed..","commenter_a":"She's doing a great job and that's a signal for critics and whiners to just move along!","post_message":"Competing interests?"}]
