[{"comment_id":"10153881396091336","commenter_b":"It doesn't take rocket science to figure out the motive","commenter_a":"But it was probably just workplace violence.... We just don't know...","post_message":"According to police, here’s what we know about the #SanBernardino shooting: @webpagelink • 12 pipe bomb type devices were found in the home at the center of investigation • All four guns were legally purchased • The motive has not been determined • There are no credible threats at this moment   According to the FBI, here's what we know about the suspects: •  Male came back into the U.S. in July 2014  •  Female came to the U.S. on a K-1 visa under Pakistani passport"},{"comment_id":"1076811719002844","commenter_b":"If this does not prove they are out to destroy America I do not know what will. they succeeded divding this country now they want to conquor it.","commenter_a":"Impeach all of them !","post_message":""},{"comment_id":"1415709005136234","commenter_b":"And that makes you a sissifed bitch punk your mom is more of a man","commenter_a":"Here is your first lady wanna be conservatives. #REPUBLICANFORSALE #NeverTrump.","post_message":"They REALLY think they have her here. But here’s the thing…"},{"comment_id":"845673835565796","commenter_b":"@username - As usual, the liberal fails to consider the unintended consequences of their actions. Transgenders make up only .3% of the population so the threat from them is minimal. The threat from perverts who will abuse this decision to commit assaults will far outnumber the Transgenders who simply want to go pee. It will be the innocent among the majority of Target's customers that will face the consequences of Target's liberal, feel good decision.","commenter_a":"Well I guess my kids will not be using the fitting rooms. I to will be reconsidering using their bathrooms and even shopping there. This country has lost it's damn mind!","post_message":"Are you kidding me?!"},{"comment_id":"1253236361399557","commenter_b":"This is how much hillary hates women. Hillary wants to bring in illegals who hate women. @webpagelink","commenter_a":"Trump is afraid of Hillary for one good reason and that is why he constantly threatens her with assassination. Hillary can win over Trump by force of argument rather than by force of fear. You Trump supporters aspire to fear and violence. We Hillary supporters to free speech and Civil Rights.","post_message":"On this day in 1973, tennis champion Billie Jean King defeated Bobby Riggs in the “Battle of the Sexes.” King went on to found the Women’s Tennis Association, the Women’s Sports Foundation, and Women’s Sports Magazine to support women athletes on and off the court."},{"comment_id":"617790755078170","commenter_b":"She a geto gutter hoe send her back","commenter_a":"I agree with Brooks.And Steven Joseph Sr.God bless that soldier .And thank you for your service","post_message":"Michelle Obama wanted this army staff sergeant to do this, but he refused.  This is amazing. We stand behind this soldier 100%.  Do you support this war hero stand against Michelle?"},{"comment_id":"1190297117696296","commenter_b":"What did she do ? Omg we're in trouble with these idiots able to vote.","commenter_a":"Shut up Bob Marlee's sister!!! BLM lol","post_message":"Let's Talk... tonight's debate. We're live at Union Square asking people to sound off.  Be sure to watch The Countdown: Hofstra Debate at 8pm here on Facebook and @webpagelink/  We'll have live coverage of the debate at 9pm here: @webpagelink"}]
