[{"comment_id":"10152900862242061","commenter_b":"Sounds awesome! This is funny. Did you post this recipe because he's/she's a fruit?","commenter_a":"I can't think of anything to comment so I'm just going to post a Blueberry - Strawberry Pancake recipe. 1 1/4 cups all-purpose flour 1/2 teaspoon salt 1 tablespoon baking powder 1/2 teaspoon baking soda 1 1/4 teaspoons white sugar 1 egg 1 cup milk 1/2 tablespoon butter, melted 1/2 cup fresh or frozen blueberries, thawed 1 cup of fresh or frozen Strawberries 1. In a large bowl, sift together flour, salt, baking powder, baking soda and sugar. In a small bowl, beat together egg and milk. Stir milk and egg into flour mixture. Mix in the butter and fold in the blueberries and Strawberries Set aside for 1 hour.A 2. Heat a lightly oiled griddle. or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve. EnJoy","post_message":"Caitlyn Jenner unseats Pres. Obama to become fastest Twitter user to hit 1,000,000 followers: @webpagelink"},{"comment_id":"10153396046867452","commenter_b":"what if they didn't do it... cut it off anyway????????????????","commenter_a":"Thats the best freaken law ever. Pass it nation wide","post_message":"\"They have marked this child for life, and the punishment should fit the crime.\"  If an Alabama lawmaker gets his way, part of the punishment for people who commit sex crimes against children will be castration."},{"comment_id":"10153370313159071","commenter_b":"Elaine Daly 😂😂","commenter_a":"Excel is childish approach towards industry of information and finance. Furthermore the database tools it offers is fluid and prone to human mistakes.","post_message":"Mastering Excel puts you way ahead of the competition."},{"comment_id":"10154113431396037","commenter_b":"Wolves in sheep's clothing","commenter_a":"...sickos for 'god'...","post_message":"The Christian Prayer Center website not only charged consumers $9 to $35 for prayers but also \"deliberately\" confused some consumers into signing up for recurring monthly payments, according to authorities."},{"comment_id":"10154734900826509","commenter_b":"U know muslims r gangraping british girls in UK","commenter_a":"RIP europe, immigrants will destroy europe, it has started from turkey , so i request all people to visit europe before it gets turn into europistan , after there would be many restrictions of burqua etc. And be ready to see ETHNIC EUROPEAN MIGRANTS LEAVING EUROPE FOR ELESWHERE.","post_message":"Terror suspect Salah Abdeslam has been extradited from Belgium to France, Belgian authorities say. The Belgium-born French citizen faces prosecution there in relation to the Paris terror attacks in November."},{"comment_id":"10152987943491636","commenter_b":"We all foreigners no one stay for ever on this big country called earth.","commenter_a":"She's not banning foreign students only getting them to leave after they have qualified. It's not part of the deal that they can settle in The UK","post_message":"It's not a very popular decision"},{"comment_id":"10154364606704445","commenter_b":"Guns didn't kill these poor girls their mother murdered them!!! That was her intent!","commenter_a":"Glad she was able to protect....oops, kill her family with her guns. Just another \"legal good gurl\" gun owner turned murderer after her latest hissy fit.","post_message":"Two sisters shot and killed by their mother in Texas are being remembered by friends and neighbors."}]
