[{"comment_id":"1140950715967044","commenter_b":"Lying two faced cutthroat hag.","commenter_a":"If mouth is open lies are being told.","post_message":"BOOM! Coal Miner Calls Out Hillary to Her FACE! Watch her try to \"umm umm babble babble\" a way out of it VIDEO  The entitled hag gets slapped with karma! WATCH!"},{"comment_id":"502105753294821","commenter_b":"Leave bitch!!!","commenter_a":"Trump for president!","post_message":"We'll pay for your ticket..."},{"comment_id":"1824785004425894","commenter_b":"Women who support Trump have severe Stockholm syndrome and suffer insecurity","commenter_a":"Three times divorced, womanizer dares to talk about morality.","post_message":"Let's talk about the debate...what just happened?"},{"comment_id":"824943850887973","commenter_b":"What dumb a holes. They can't destroy anyone. The U.S. Would squash them like a bug.","commenter_a":"Someone shoot this idiot......he is the problem.","post_message":"Warns that \"Tehran will set fire to every military base from which a hostile U.S. plane takes off for bombing Iran.\""},{"comment_id":"1221087354570479","commenter_b":"It is French and Spanish ancestries some of the women probably do have more hair than the guys... I should know I was one pretty hairy teenage girl growing up in New Orleans!","commenter_a":" school board has a policy that does not allow any facial hair on male students, Tangipahoa Parish school superintendent Mark Kolwe told ABC News. So female students can have facial hair? Seems sexist to me.","post_message":"The school told all students with facial hair that they had to shave before the ceremony, but the rule was not enforced during the school year."},{"comment_id":"10154089965446336","commenter_b":"Yeah, lice likes very clean hair. If you put products in their hair it's likely they won't get it. Oily hair care products are","commenter_a":"It's not super lice it's called...ignorance. Schools inform by sending a note that lice has been found in the classroom. The person is not identified at all..not even to the parent. Infested child goes untreated. Why? The same reason some are abused and some are not, the same reason some parents care about their children and others don't. Children are going untreated and/or not treated properly. This has been going on for years.","post_message":"What can you do if your child is affected?"},{"comment_id":"10153468728217507","commenter_b":"By RIGHTS she should be arrested, Constititutionally tried on TV and executed for TREASON. The first woman","commenter_a":"Hillary is a disgrace","post_message":"47 more states to go!"}]
