[{"comment_id":"683462628486873","commenter_b":"Thank you for sharing!!","commenter_a":"Every time I attend a sporting event in our great country it infuriates and saddens me at how many \"Americans\" won't remove their hat or stop what they are doing while the National Anthem is played. Well done Mr. Bolt! Thank You for your great respect!","post_message":"A great American..."},{"comment_id":"687362974730217","commenter_b":"It is spelled you're... You are. Your denotes ownership","commenter_a":"What! Let's see Hilary was a lawyer, First Lady, senator, Secretary of State, married to the president of the world and your comparing homes? YUP comical","post_message":"LOVE THIS!!!!"},{"comment_id":"10153075277316770","commenter_b":"This hag is despicable,","commenter_a":"anything that comes out of this woman's mouth is bullshit just saying","post_message":"Debbie Wasserman Schultz says Republicans \"alienate women, alienate the LGBT community... [and talk] about it at their debates. Kicking immigrants out of this country, talking about taking away healthcare from Americans, talking about which candidate is worse for women and take their healthcare away, deny their rights, oppose equal pay for equal work.\""},{"comment_id":"10154630388634877","commenter_b":"why is anybody still giving Conway any attention at all, unless it is because she is an alien from another planet?","commenter_a":"Ummmm, maybe because she hasnt done anything","post_message":"Is Melania Trump not getting enough attention for being an immigrant herself?"},{"comment_id":"1566280200058671","commenter_b":"@username stop arguing with fools...","commenter_a":"It is being stolen. We have a President that won a large majority, that has high approval from Americans, and the GOP says it should be up to the guy that won a minority in an incredibly low turnout election.","post_message":"\"It's being stolen from the Obama administration and the construct of our Constitution. And it's being delivered to an administration that has no right to fill it.\""},{"comment_id":"1046343315386679","commenter_b":"Can two women already have a baby? I mean in a biological way of course...","commenter_a":"Wow","post_message":"No women required."},{"comment_id":"2029120557147682","commenter_b":"Thanks, Candice......I didn't know about Cooper.","commenter_a":"I feel badly for the cast of Moonlight! They missed out on having their movie called, and all the fan flair that accompanies an Oscar win! Shame in you PWH!","post_message":"Emma Stone: 'It was one of the most horrible moments of my life'"}]
