[{"comment_id":"1283819971638030","commenter_b":"She's a disgusting wombat","commenter_a":"Looks like big bird. We paid over 2 grand for that dress?","post_message":"The Narciso Rodriguez dress sold out online before the president had even finished speaking."},{"comment_id":"944012942300794","commenter_b":"I definitely would pitch in for her ticket BACK to HER country. If she said this crap in HER country, she'd have her tongue cut out or be-headed, or better yet killed . Get the blank blank outta MY country. Thank you to all our service men who give their lives for OUR COUNTRY.......","commenter_a":"Don't like it leave !!!!","post_message":"A Muslim woman confronted a female cashier about her flag pin... What happened next is going VIRAL!"},{"comment_id":"1301581083201877","commenter_b":"This guy is pushing an agenda !!!! Creepy","commenter_a":"Mercy","post_message":"Really? Maybe if Christians had more walls, the Muslims wouldn't have conquered the Middle East and large parts of Europe from the 7th to the 10th centuries."},{"comment_id":"469971939860053","commenter_b":"look its him the bitch","commenter_a":"No way Michelle we have the right. Guns don't look for people to shoot look and see who are the vandals and thieves that are doing the shooting killing their own people","post_message":"Michelle Obama just made a major move on gun confiscation.  This is ridiculous, restrictive gun laws cause HIGHER murder rates.  Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10156528431575354","commenter_b":"Screw her","commenter_a":"Boo-fucking-hoo! Lifes tough on EVERYBODY! And not everyone drives their car up on the sidewalk! Now the media will make her out to be the victim! Put her ass in prison and throw away the key!!","post_message":"Changed Name from ‘Lakeisha Holloway’ to ‘Paris Paradise Morton’…"},{"comment_id":"1731050200496998","commenter_b":"Some mothers eat their young!","commenter_a":"Typical!","post_message":""},{"comment_id":"10154995182613812","commenter_b":"All the liberal whiners calling racist. Typical","commenter_a":"its a trump or Hilary is American citizens decision no other nation have right to comment any thing about it...stop spreading hate","post_message":"On Wednesday morning the world will wake up to a new American president. Here's what news outlets across the globe are saying."}]
