[{"comment_id":"516357545155952","commenter_b":"I'd be pissed,then sue everybody.Which I'm sure she'll do.","commenter_a":"How did they get the right to determine her mental state?","post_message":"Via Filming Cops -- How would you feel if within 24 hours you go from being a successful corporate executive to being forced to become a patient at a mental ward, stripped naked, where no one believes you? It feels straight out of a psycho thriller, but this is what cops did to her."},{"comment_id":"10152631358675779","commenter_b":"He's hip pop. And of course they do numbers most ppl think the radio is all there Is to offer. And I'd say 3 ouuta 4 drake fans r girls. Drake can go hard but he chooses not to cuz that don't sell albums to women...so instead he's like \"long as my bitches love me\" lol","commenter_a":"It's funny how people who don't like hip-hop or don't like Drake's music post derogatory comments .If you don't like it don't post it,I think music like Young Thug(or when Gucci Mane was hot) & HALF of what I hear on the radio is trash lyrically but perfect for a party,but I don't sound off on it b/c the numbers that these songs/mixtapes/albums do,speak for themselves regardless of what we as neigh-sayers,b/c it's not our cup of tea,may say about it.Although I am biased to Drake's music,I love music period so why don't we all just take a lil advice from a19 year old(myself) & actually be grown about what we post instead of being ignorant cause honestly,8 times out of 10,nothing we say is taken into major consideration by the famous.In the words of Kevin Durant,\"Why do you tweet?\" lol...dang","post_message":"Is it an album? Is it a mixtape? Who cares? The 17 tracks Drake released at midnight last Thursday hit harder and hold together more cohesively than most big-budget event albums. Click through for our full review of ‘Too Late.'"},{"comment_id":"10152782566181051","commenter_b":"I hope the next time Kanye storms the stage whoever is up there just decks him. What a POS!!!","commenter_a":"I thought west was leaving the USA. What happened? We'll help pack you up and get you out of here!","post_message":"Beck just issued a response to Kanye West’s rant about him not deserving a Grammy."},{"comment_id":"10153542134849753","commenter_b":"She needs to get away from his crazy abusive ass!","commenter_a":"Lmfao fuck her and he a dick for doing it","post_message":"A man from Harlem, New York has forced his wife to walk down the street naked as a punishment for talking to other men. Jason Melo recorded the incident, hurling insults at her the entire time. The video was uploaded to Youtube, but has since been taken down. However, an edited version that blurs out his Melo’s wife’s naked body has surfaced and shows the humiliating situation unravel. The video has sent outrage across the internet, causing people to wonder how such an embarrassing form of... @webpagelink"},{"comment_id":"10158374477135093","commenter_b":"Furthermore he did write an executive order which took guns away from Social Security recipients","commenter_a":"The morning after the 2008 Obama election I was not nearly as upset as liberals are now. Because unlike Trump who said exactly what he planned to do during the campaign, Obama said he was not trying to take our guns away, was not going to make us lose our doctors, and believed in traditional marriage. Obama lied in order to get elected then began do all the things he planned to do but didn't tell the truth about. Liberals are upset because Trump said exactly what he planned to do and they know exactly what he plans to do.","post_message":"But we didn riot, punch people, block traffic, take a day off school, or go on a fast."},{"comment_id":"1322936927726334","commenter_b":"Shariko ... I did call you Racist .. That has no bearing as to whether or not you attended college","commenter_a":"They are trying so hard to find him connected to that murder while they have him on some B.S. Making themselves look foolish.","post_message":"Multiple law enforcement sources explained to NBC News why a knife found on land where O.J. Simpson once lived does not appear to be connected to the murders."},{"comment_id":"10152918122661336","commenter_b":"we cant have a female for president ever, do u know wtf is gonna happen when they hit there monthly period, there gonna be droppping bombs everywhere for no reason","commenter_a":"Omg pls no","post_message":"Former Alaska Gov. Sarah Palin says she is \"seriously interested\" in running for president in 2016."}]
