[{"comment_id":"760411690754543","commenter_b":"We have enough oil in this country for the next 400 years but John Bush wants arab oil imported not american oil","commenter_a":"We've had enough of oil energy and oil families like yours. Get lost. You're not welcome on this planet anymore.","post_message":"If we embrace our energy revolution, we can create millions of jobs and higher wages: @webpagelink"},{"comment_id":"10153806862081167","commenter_b":"Maybe the whole NRA could be recalled.","commenter_a":"The Cash Box Rules! \" Let's Make America Great Again\" yeah right!","post_message":"After we called them out yesterday, Bud Light seems to realize that Ted Nugent's hate is bad for business."},{"comment_id":"495634957263126","commenter_b":"u get the fuck away from us first we will leave ur shit","commenter_a":"Muzzies. This is why these scum don't belong in the West, they refuse to assimilate.","post_message":"\"We've kind of been forced back to the primitive ways of schooling.\""},{"comment_id":"10153315866223812","commenter_b":"Still none of this warrants being shot in the back...","commenter_a":"The officer has the suspects identification so was a foot chase even warranted since his address is on the ID...this man could have been picked up at anytime...seems like the officer used extremely poor judgement.....","post_message":"WATCH: Newly released dash cam audio and video shows Ofc. Michael Slager and Walter Scott before fatal shooting: @webpagelink"},{"comment_id":"1645030555784057","commenter_b":"Every woman who wants an abortion should see this. Children are truly gifts from God!","commenter_a":"If everyone showed that much love for their mother and all their family. This world would not be in the shape its in today. Most beautiful example for everyone!, thanks","post_message":"Incredible."},{"comment_id":"10156046538185389","commenter_b":"Sorry , but I don't think women belong in combat ! I am old fashion , I still believe in Chivalry ! :D","commenter_a":"Time to retire this so called..\" Top Admiral \"..too many PC types in the military now, arm chair leaders..!! Desk jockies..!!","post_message":"The U.S. Navy's top admiral said he believes female sailors should be welcome to join the service's elite SEAL teams, provided they can pass the training regimen."},{"comment_id":"10154140456978256","commenter_b":"Sara Califf.....Illinois doesn't have a taxing problem... They have a spending problem.... Bloated government is Illinois problem.... Too bad the pensioners are the ones who will suffer","commenter_a":"Democrats need to raise taxes to keep Illinois, and Chicago government revenue stream to maintain the bloated government.... Probably need to build a wall around Illinois first, to keep resident's from leaving for other states","post_message":"Election-seeking Illinois Comptroller Leslie Geissler Munger plans to delay monthly paychecks for lawmakers and statewide officials, saying there isn't enough money to pay the state's bills and other services should go to the front of the line."}]
