[{"comment_id":"10152918751311336","commenter_b":"Because there wasn't technically a government and laws like European style governments didn't give the European invaders the right to grab the land and kill the people that were already living here my ancestors didn't welcome yours","commenter_a":"If you are in a country without the required paperwork, you are an illegal. Check the dictionary please.","post_message":"\"We don't believe in capitulating to people who are going to tell us how to run our newspaper,\" said Scott Steepleton, city editor of the Santa Barbara News-Press on FOX & Friends Weekend."},{"comment_id":"1081030328612686","commenter_b":"Go bang your mother with a mace","commenter_a":"All you people saying taxation is theft are such complete morons. Taxation is a membership fee to live in the USA where we have benefits that greatly outweigh the cost. Why don't you renounce your citizenship and gtfo out of the USA and move to Antarctica if you don't want to be taxed. Bunch of unpatriotic pieces of human garbage in here.","post_message":"Wouldn’t it be great if you could refuse to pay your taxes until you decided your tax rate was “fair”?"},{"comment_id":"10153092087111438","commenter_b":"Ha! You said it before I finished my statement.","commenter_a":"It's very obvious what happened here, it has been right from the start. This plane was intentionally driven into the ground by one of the pilots on the plane. This was very clearly a suicide/mass murder. Sadly, this is not the first time a pilot on a major airline has done this either. We are going to need to start doing a FAR better job of digging deep into the backgrounds of the pilots that we entrust to fly our major airliners going forward now. Or, we are going to have to start piloting these planes remotely from the ground and only using on-board pilots as a back-up in case the remote piloting system fails for some reason.","post_message":"A bit of eerie evidence has turned up on the cockpit voice recorder from the Germanwings flight that crashed into the French Alps this week."},{"comment_id":"1089862507690725","commenter_b":"NO!!! Girls are NOT Intelligent enough, Athletic enough, Independent enough, Mechanically minded enough, Wood Working enough, Outdoors enough, Tough enough, Strong enough, Brave enough, Work Hard enough AND are Too clean, Too emotional, Too femine, Too Goofy PLUS don't like Spiders, Roaches, Vermin , nor Bats. Need any other reasons?? Let's stop being so PC and keep the girls where they belong, in the House, Kitchen, Laundry Room, barefoot, definitely barefoot and making babies. That's GOD'S will!!! If you don't agree, we can just have the BOYS join the GIRLY Scouts. BTW, I'm a LIBERAL, oSCUMa, Kerry and HITLERy lover!!! Can't you tell.","commenter_a":"No-they have girl scouts.","post_message":"Should girls be allowed to join the Boy Scouts?"},{"comment_id":"10153690719066130","commenter_b":"Andrew Ritchie","commenter_a":"Woof, there are some dumbass people on this feed. The benefits outweigh the risks.","post_message":"This vaccine is drastically reducing HPV cases in teenage girls, but some parents can't get over the stigma."},{"comment_id":"969542393176866","commenter_b":"these woman being paid by Hillary..it took them all 30 years to come out...they want their 15 minutes of fame...wonder if they'd like it if someone did that to their Dad or brother...?","commenter_a":"I think his own recording is pretty factual","post_message":"\"He has been nothing but completely respectful.\"  Chelsea Cooley Altman, who was Miss USA 2005, gave her assessment of Donald J. Trump in the wake of multiple women accusing him of sexual misconduct."},{"comment_id":"10154229049319369","commenter_b":"Being against Christians isn't a religion.","commenter_a":"I am against Christianity so that means I can not serve Christians in Mississippi because it goes against my beliefs?? This law is stupid.","post_message":"The measure allows churches, religious charities and privately held businesses to decline services to people whose lifestyles violate their religious beliefs."}]
