[{"comment_id":"1114818335281084","commenter_b":"Go, Hillary! #I'mWithHer","commenter_a":"Democrats who support Hillary have the same mental disconnect as Republicans who deny climate change","post_message":"Sanders was shelling out more than Clinton on Nevada airwaves just a week ago."},{"comment_id":"10153974959029087","commenter_b":"@username I would be suprised if you cared.","commenter_a":"Funny to read some of the Trump supporters defenses that show they didn't read the article. First, the pictures weren't taken outside of the US, they were taken here. So the argument that they \"could have been taken outside of the country\" doesn't hold weight. Second, yes, models come here and do photoshoots \"all the time\", however, as the article states, there is a way to do it legally, and a way to do it illegally/fraudulently. From her own statements, it seems there might be a case where it was done wrong. And lastly, it does matter because Trump's platform is \"do it the right way, she did it the right way\", and if she didn't do it the right way, then it is yet another lie and makes them hypocrites. I realize she isn't running, but he is so he made this an issue. If this were the Michelle ...","post_message":"Melania Trump has said she first came to the United States in 1996 on a short-term visa, which wouldn't have allowed her to work as a model. But a recently published nude photo shoot shows that she was working in the country in 1995."},{"comment_id":"801271216730122","commenter_b":"This piece of garbage needs to go ahead and leave our country and take Kanye with her far far away","commenter_a":"Your the problem,and your friend obummmmer pos.","post_message":"Oprah Claims White People Are The Cause Of Racism In America. She's lost it. What a hypocrite. Do you think Oprah is the racist?"},{"comment_id":"1722289054713180","commenter_b":"notice how she talks about white man?","commenter_a":"@username Former foreign minister , has failed in its mission and has caused much of the confusion the US administration @username was not calling things by their names correct .. for example, terrorist organizations ( liberation movements ) , states that support extremism ( our friends ) , dictatorships ( our partners ) @username win means that a disaster occur American nation","post_message":"Women across the country lose out on every paycheck—and women of color feel it the most. Our families can’t wait: It’s time to ensure equal pay for women. hrc.io/EqualPayDay #EqualPayDay"},{"comment_id":"763624153793368","commenter_b":"@username..Bye Felicia, go suck an egg","commenter_a":"I would waited until he falls asleep, and pull me a loreana bobbitt ...get a Surgical scapple do a nice clean quick slice, get me some tweezers and carry it and throw it on the freeway, and let someone run over it. it ain't big anyway. second scenario, get some super glue and glue his little hands to his little tilwinkle!","post_message":"Did you catch this moment from Melania Trump at the inauguration?  Via In The Know"},{"comment_id":"10153994126946337","commenter_b":"Loved it!! These \"Million Moms\" need to stop clutching their pearls & promptly remove the sticks wedged up their tight asses.","commenter_a":"What do you think about the show Lucifer?","post_message":"NOT HAPPY! One Million Moms is beyond ticked at Lucifer and Olive Garden..."},{"comment_id":"1415272741824926","commenter_b":"If I was as ugly as her I wouldn't be calling attention to my stupidity too !!","commenter_a":"sounds more like Eva Braun more and more!","post_message":"Less than 30 minutes after Donald J. Trump was sworn in as President, MSNBC's Rachel Maddow was calling him Hitler."}]
