[{"comment_id":"10150612418424999","commenter_b":"A hoe is a garden tool, ferchrissakes.","commenter_a":"Being a hoe ain't new or modern..No matter how many flowery. Words u use.","post_message":"\"If an open relationship was necessary to prove how well I loved my boyfriend, I was happy to comply.\""},{"comment_id":"1021126491243474","commenter_b":"And yet a student did intervene verbally and is still alive.","commenter_a":"Shame on that teacher for not standing up for that student. Even if she was being disruptive in class she still deserves to be protected and treated with decency.","post_message":"When a white Spring Valley cop brutally assaulted her classmate, Niya Kenny sprung to her defense.  How could she have known what would happen to her next  just for speaking up? #AssaultAtSpringValleyHigh"},{"comment_id":"10154856564546438","commenter_b":"Fake IDs fake visas...so why are we sure illegals never voted?? Illegals pose threat because of how much they owe coyotes that families back in Mexico maybe threatened if they dont run drugs for cartels...Trump is right to close this border.","commenter_a":"Ooooo","post_message":"\"You notice the Republicans are not saying, 'Hey, those aren the facts,' or 'something has changed,' or 'he did all these other things afterward.' No, what they saying is, 'You don get to talk about that.'"},{"comment_id":"10153480904281162","commenter_b":"I just would like to know, how much money has she spent in tanning salons...","commenter_a":"i've been black since I was 5 yrs. old. look at my pic.","post_message":"BREAKING: Did Rachel Dolezal lie about her race? Dolezal, the woman at the center of the race controversy, has resigned as the president of the Spokane NAACP @webpagelink"},{"comment_id":"10154014383211636","commenter_b":"hmmmmmmmmmmmmmmmmmmm, she needs to be hanged.","commenter_a":"good! even the uk police can be corrupted.","post_message":"She was shot in the stomach, but not by the man she claimed"},{"comment_id":"10157011618750354","commenter_b":"Would someone please tell me why these THUGS have not been arrested or gased?","commenter_a":"Dumb ass negros !","post_message":"WATCH the insane footage of the BLM radicals...  \"I will f*ck sh*t up!\""},{"comment_id":"10153060626041162","commenter_b":"I'm gonna jump a girl I see walk passed me Jk","commenter_a":"Notice how these kids are not American...Im sure it would be a different video here","post_message":"VIDEO: In an experiment designed to explore violence against women, young boys were asked to slap a girl.   Watch how they responded: @webpagelink"}]
