[{"comment_id":"10153173606151602","commenter_b":"Hartford rules, its a silly name just like every other name in the minor league. The only difference is that its unique and stands out a bit because it's so absurd. I'm still going to have to fun.","commenter_a":"I feel like I am constantly defending Hartford - telling people how far the city has come, and all of the neat things there are to do here. But this? This, I cannot defend. I was super excited for this stadium, and now, for the first time, I am truly embarrassed for and by this city that I have grown to love. Temporary attention that derives from a stupid name doesn't breed long term community commitment. It just gives jaded locals more things to complain about, instead of taking pride in their city. Such a shame.","post_message":"After weeks of waiting, we now know the name of Hartford's baseball team."},{"comment_id":"10154727514062235","commenter_b":"Between crooked Trumpkin and crooked Hillary I'm going to vote for Hillary.","commenter_a":"A vote for Donald Trump or any politician who supports his candidacy is a vote for discrimination. Period. No exceptions. No excuses. You might as well tell your Black, Latino, Asian, LGBTQ, Muslim, Jewish, Native American, non-Christian, disabled and woman fellow Americans they are not welcome in the U.S.","post_message":"Okay, Mr. Trump adviser, there is a big difference between a fact and just something you wish was true."},{"comment_id":"693308824147234","commenter_b":"and being hoes..laaag","commenter_a":"This shit here is crazy. All week we been talking bout Kylie like she beyond famous. Her family is known for fucking and being hoes. Malala opens up a school and nobody don't say nothing the worlds view point on things is fucked up.","post_message":"Quit making stupid people famous."},{"comment_id":"1053645448090460","commenter_b":"Jihad Malik ..get off this post ..your mama was stupid for making you","commenter_a":"Why don't you post a story of the anti Semites throwing people off of buildings in the countries surrounding Israel....they are the people you should be fearing and writing about ...The JP has joined the Shrillary camp","post_message":"Schmitz has called the accusations defamatory, but reports of anti-Semitic tendencies at the top of the Trump team reinforce the narrative."},{"comment_id":"10153289786066491","commenter_b":"Here's the thing. You need to go # 1? You need to go # 2? Go to bathroom of your current sex. Drop the bomb, Cut loose, wipe clean, get out. That simple. Bathroom is not social grounds It's not grounds to dispute how you feel as gender. Do your business, in out less than 2 minutes..... WTF is wrong with the world today. Everyone wants to be special.","commenter_a":"Are we that far gone from reality that we want to make bathrooms for the trans in our society. Im sorry you were born as a boy or girl. How about you just stick with that while you are in public. Problem solved and no money spent on suppling a unneeded bathroom","post_message":"\"Before the 5th grade, my classmates were able to accept and be friends with me.\""},{"comment_id":"10153226873549170","commenter_b":"Wrong. BOTH parents have to be citizens at time of birth. His father didn't become a citizen until 2005. If I go around the world getting women pregnant, those children are NOT citizens of the USA.","commenter_a":"First I like Cruz. There is no question he is a citizen. The real question is he a natural born citizen. Back in the day when I was in grade school (before history was re-written on the issue) we were taught that you had to be born in the United States to be president.","post_message":"There's plenty to debate about the race for the nomination, but folks, can we please put this question to rest?"},{"comment_id":"865416670223607","commenter_b":"Your mother is a dumb fuck you ignorant whore.","commenter_a":"WW3","post_message":"Turkish F16s warned the jet over the airspace violations before shooting it down, the military official said."}]
