[{"comment_id":"952953064797748","commenter_b":"She needs to be deported to Alaska. Just like her mother, she does not know what the are talking about!","commenter_a":"Bristol Palin should keep both her ignorant mouth and her legs closed.","post_message":"Apparently, a kind gesture towards a scared teenager is grounds for a political attack these days."},{"comment_id":"597841083739804","commenter_b":"OBAMA IS THE SAME ALL ARE THE SAME CORRUPTS AND CRIMINALS WHAT HAPPEN IS PEOPLE WANT'S TO BE CORRUPTS AND HAVE POWER AND ABUSE OF POWER THAT IS WHY THEY LIKE THEM CONGRATULATION LOOK AT THE WORLD HOW IT LOOKS AND THINK A LITLE NOT TO MUCH AND SEE WHAT IS GOING ON","commenter_a":"Damn right!","post_message":"George W. Bush was right, there were weapons of mass destruction.  We always had his back. He is a great man, and a true patriot.  Do you support George W. Bush?"},{"comment_id":"1380514481968578","commenter_b":"You're way too late. It's all Hillary now #imwithher","commenter_a":"If you live in a state that has yet to hold a primary, join with Sanders and stop both Hillary and Trump. #nevertrump #neverhillary","post_message":"Ohio Gov. John Kasich will suspend his presidential campaign on Wednesday, a senior campaign adviser tells NBC News."},{"comment_id":"10153706069823717","commenter_b":"Best part about this is her age, she's not an 18 or 20 year old like most ad models.","commenter_a":"Oh thank heavens. The world is a safer place.","post_message":"People magazine has named Jennifer Aniston the \"World's Most Beautiful Woman\" for 2016."},{"comment_id":"10153398198117377","commenter_b":"Trump will never win. A vote for trump is a vote for Hillary..","commenter_a":"why wasn't Priebus fired after Obama won re-election? It was unreal that Obama wins re-election and the RNC looks the other way. Priebus will be gone after Trump becomes President.","post_message":"Reince Priebus is an amateur and lightweight who has been a \"disaster\" as chairman of the Republican National Committee, says Christopher Ruddy, CEO of Newsmax. “We never would've been in the situation we're in today,” if the RNC had a strong leader Ruddy told Newsmax TV. Read the full story: @webpagelink"},{"comment_id":"1800960313527053","commenter_b":"She should wait till 2024 after Trump can't beat her again...","commenter_a":"She can't even walk right. Go to you jail cell and rest.","post_message":"Did I ever tell you the definition of insanity?"},{"comment_id":"481936961966259","commenter_b":"He was the saviour of Manchester last season You fickle lot Haha","commenter_a":"When i read what those nukes are capable of,and that there are people who'd use them,I honestly despair for the human race...","post_message":"Each warhead has an explosive power about 22 2/3 times larger than the Hiroshima blast."}]
