[{"comment_id":"1011356012327296","commenter_b":"The lady must go to prison","commenter_a":"Looney toon","post_message":"Should the Hillary Clinton investigations continue?"},{"comment_id":"1194642483887307","commenter_b":"Still need to deal this evil bitch a Blow","commenter_a":"easy defense... animal was not collared, violated leash laws, and was a threat to their own pets and property.","post_message":"She killed the cat because she believed it was a stray and became a nuisance, but a couple who testified in court this week said “Tiger” was their pet."},{"comment_id":"10153372391166509","commenter_b":"Chris? Am I? Interesting. Here I thought I was just pointing out the facts! :)","commenter_a":"Gotta love Global Warming!","post_message":"It's so cold, #NiagaraFalls froze. Photographers were drawn to the breathtaking icy formations: @webpagelink via CNN iReport"},{"comment_id":"10154334992691130","commenter_b":"Hillary claims to be for equal rights and pay for women and care for womens rights but she still pays men more than women. She does not care about women it`s only money she cares about .. abortions save money ,that is why she is for abortion..","commenter_a":"Note to these kids: Don't bother asking Trump. He has no answers for you that are going to give you hope. He'd probably tell the children that they need to be vetted first to see if they love American values, even though they're only children.","post_message":"Ahead of tonight's debate, the children of Aleppo ask Hillary Clinton and Donald J. Trump the questions THEY would like to see answered."},{"comment_id":"10154974610048896","commenter_b":"Lets make this clear Theres only to genders And youre born with the parts youre supposed to have Fucking millineals","commenter_a":"Ah just give him some money. He wont shut up until they do. Maybe he'll use it to treat his mental illness.","post_message":"\"I'm not unique in all of this — this upheaval happens to trans people all the time.\""},{"comment_id":"10154429082261378","commenter_b":"Yes...fix her a$$...so she can't bring any more babies in the world...","commenter_a":"Yes","post_message":"A judge ordered a drug-addicted mother of 4 who has worked as a prostitute not to get pregnant again. Is this order fair?"},{"comment_id":"1031268323551304","commenter_b":"Why is it OK for transsexuals to lure gays into gay bars and not women to attract straight men into a restaurant?.........libtards double standard!","commenter_a":"Uhhh.. What's the problem?? We know this... They know this.. They know that we know this.. Who's getting hurt by this? Do much for women being empowered. They're not helpless..You can't have it both ways.","post_message":"This leaked memo says it all"}]
