[{"comment_id":"458537397670174","commenter_b":"NO She can Stick it !!!","commenter_a":"No way and the kids are not going to either.","post_message":"Will You Cave To Michelle And Only Eat Where She Wants?  Comment 'yes' or 'no'."},{"comment_id":"10154061349648352","commenter_b":"Sick woman you are","commenter_a":"He is taking care of both of them and about to marry her so what. If it works for them who cares. And if your in the church every last prophet had more than one wife. Having only one wife is a western and new thing.","post_message":"‘I try not to get jealous’: Pastor, 60 marries his pregnant girlfriend, 19, with the blessing of his wife, 44, with both women to live in different wings of Ohio home"},{"comment_id":"10153922572740950","commenter_b":"No she was saying don't do it Keith.","commenter_a":"Dummies... she was telling the cops, \"Don't do it\". Did you not hear her NUMEROUS TIMES say, you better not shoot him. Don't do it. HE DOESN'T HAVE A GUN. I suppose she changed her mind halfway through. Smh","post_message":"Warning - Graphic Content: The Charlotte-Mecklenburg police department just released the officers' body cam footage taken during the shooting of Keith Scott: @webpagelink"},{"comment_id":"729100880559027","commenter_b":"Damn right! Put that bitch in office and watch what \"We the people\" do!","commenter_a":"If Hillary wins, it will be because the electoral college was bought out!! The government has already bought the media and they are lying about the margin between Trump and Hillary---Trump is way ahead. The American people are fed up!","post_message":"“I am winning. I am beating everybody and, in my opinion, beating Hillary is easier than beating [my Republican adversaries],\" GOP front-runner Donald J. Trump said."},{"comment_id":"1202982936435126","commenter_b":"I agree fuck him he got that light skin nigga syndrome straight bitch","commenter_a":"That's what he gets","post_message":"Thoughts? Is this fair punishment for the crime? #KevinGates #Jail #WSHH"},{"comment_id":"10153374746118812","commenter_b":"Reality check she removed all courage and self respect leadership. What is he but a man in training....... Whites love when we humiliate each other to protect the massa. She need to know she planted a seed that will resp bitter fruit","commenter_a":"Asllan Kacanolli Flamur Kacanolli","post_message":"He's the boy seen around the world being forcefully pushed from the Baltimore riots by his mother. And this is what he has to say about it..."},{"comment_id":"10153179631761833","commenter_b":"lots of canadians too,,but they have to do it ILLEGALLY,,,lol..","commenter_a":"The enemy fears us does not matter if they are in Washington or are muslim extremists the end results will be the same. We will protect our 2nd Amendment rights.","post_message":"John Lott: Terrorists can strike anywhere and at any time, giving them a huge strategic advantage.Unfortunately, too many politicians around the world are refusing to admit this.  In the U.S., over 12 million American civilians are licensed to carry concealed handguns.  These Americans save lives."}]
