[{"comment_id":"10153861060719411","commenter_b":"what i see is a dead pussy just blown up.","commenter_a":"terrorist*, not jihadist... jihad is a good thing","post_message":"Video shows Jihadi hit by mortar shell mid-interview"},{"comment_id":"654971807960745","commenter_b":"Fake fugly whore.","commenter_a":"can she get her face redone?","post_message":"This woman wears a corset for 23 hours a day. She has also had 4 breast enhancements, a gastric bypass, and two nose jobs. She says she finally has the most perfect body in the world.   Do you think she has a perfect body?"},{"comment_id":"1156907360996940","commenter_b":"That's a huge bitch!","commenter_a":"DAYUM!","post_message":"This is one of the largest black holes ever discovered. It is 7 BILLION times the mass of our sun."},{"comment_id":"603381206519125","commenter_b":"Miley is a nasty skank!","commenter_a":"get rid of miley.","post_message":"Miley attacked Christian conservatives, but Bristol had an epic answer for her.  Good. We support Bristol 100%.  Is Bristol Palin a better role model than Miley?"},{"comment_id":"10152993326411336","commenter_b":"bahahaha hahaha........I love your comment....exactly","commenter_a":"So we agree....no gun is responsible for a crime.","post_message":"“No religion is responsible for terrorism. People are responsible for violence and terrorism.”  Moments ago, President Barack Obama delivered remarks at The White House Summit on Countering Violent Extremism. @webpagelink"},{"comment_id":"10154982308074641","commenter_b":"The Russians did it!!!! #CNN the Russians did it","commenter_a":"Is global warming to blame?","post_message":"Avalanches have killed more than 100 people after days of heavy snowfall along the Afghan-Pakistani border @webpagelink"},{"comment_id":"10154724995284197","commenter_b":"Good dog. Take a bite out of crime!","commenter_a":"Another morning of bumper to bumper. And another police chase. Thank goodness no innocent people involved.","post_message":"JUST IN: #Milford police said they were pursuing shed burglary suspects down I-95 when it resulted in a crash with one of their own cruisers: @webpagelink"}]
