[{"comment_id":"951265721580953","commenter_b":"She's is a fat suit. Skinny is the new fat","commenter_a":"The air brusher worked overtime on these pics.","post_message":"Model Ashley Graham has been incredibly vocal about seeing more diverse body types in the media, and she's made huge strides with this Sports Illustrated ad."},{"comment_id":"1548076978821767","commenter_b":"@username Illegals are already criminals by definition.","commenter_a":"These liberal are making more and more people want to vote for Trump.","post_message":"Top progressives are terrified the Democrat mob attacks on Americans will send millions of voters running to Trump."},{"comment_id":"1758501704379005","commenter_b":"That cow can't just shut up can't wait till she moves to Canada","commenter_a":"yes she is","post_message":"Whoopi Goldberg Insults TV Host For Being White, See What Happens Next. She is the biggest hypocrite. What a bigot. Do you think Whoopi is a racist?"},{"comment_id":"1067809293363821","commenter_b":"Trump is sending all illegal aliens to Mexico even if they are NOT from Mexico?","commenter_a":"Lets see now which border are they coming over? Oh that would be the Mexican border you say. So if they are detained at that border, no matter where they come from, why shouldn't they be sent right back over that border? It should be Mexico's responsibility to police those that are breaking their immigration laws and not letting them flow freely over our border. What is so funny and absurd about this?","post_message":"\"See? Justice isn't blind, she just can't tell Hispanics apart.\""},{"comment_id":"10158374477135093","commenter_b":"Furthermore he did write an executive order which took guns away from Social Security recipients","commenter_a":"The morning after the 2008 Obama election I was not nearly as upset as liberals are now. Because unlike Trump who said exactly what he planned to do during the campaign, Obama said he was not trying to take our guns away, was not going to make us lose our doctors, and believed in traditional marriage. Obama lied in order to get elected then began do all the things he planned to do but didn't tell the truth about. Liberals are upset because Trump said exactly what he planned to do and they know exactly what he plans to do.","post_message":"But we didn riot, punch people, block traffic, take a day off school, or go on a fast."},{"comment_id":"1083781141676265","commenter_b":"It has proven once more that U.S are serving the Wahhabism in the region in return it get many from the Saudi Royal family. no matter to U.S how dangerous the wahabi are what extreme threat poses to civilization.","commenter_a":"Muricaaaa","post_message":"The Russian foreign ministry said the attack had jeopardised the US-Russia agreement on Syria."},{"comment_id":"894715537301698","commenter_b":"The best thing you are doing, Mr. Trump, is weeding the un-Americans out from our society. You are already making the change for America being great.","commenter_a":"@username how was your preteen sexparty with you friend Epstein. It sound s you got a problem dude. Defloration of a 12 year old girl is not ok, if you know what I mean","post_message":"The \"protesters\" in California were thugs and criminals. Many are professionals. They should be dealt with strongly by law enforcement!"}]
