[{"comment_id":"10153255421196028","commenter_b":"AMERICA IS MY COUNTRY AND I SPEAK ENGLISH!!!!! ENGLISH ONLY IN AMERICA. NOT SPANISH. I have nothing against latinos BUT come here and get legal.. speak English.. STOP HAVING BAMBINOS IN AMERICA SO WE PAY FOR IT.","commenter_a":"@username, I hope one day you decide to go home as well. Maybe to your own country? Thank you.","post_message":"\"I feel hope again.\" Lorenza Cardenas and her two daughters were living in a small storage unit in a San Diego junkyard -- until things finally turned around for the family: @webpagelink"},{"comment_id":"10154273015234205","commenter_b":"@username you are so right ! And I'm glad I'm not the only one seeing this woman's racist side. @username you aren't from here your European American ! This isn't your merica it belongs to all the people ! No matter what your ancestors were once undocumented immigrants so don't speak as if you are a true American because a true American would realize that America isn't just for legals. If so you should of been long ago with the Damn mayflower.","commenter_a":"On October 22, 2016 Trump said that we would pay for it and Mexico would reimburse us. Check your facts people. We will get reimbursed through tariffs on anything that has to do with Mexico. Brilliant!!! That's why we hired you president Trump.","post_message":"Will Congress pay for Trump's border wall?"},{"comment_id":"10153584523586336","commenter_b":"I'm not an Alabama fan, but if I was, I'd be truly upset with this video..... Not one time did those girls say \"roll tide\".... I'd ban it too!! GBO #rockytop","commenter_a":"I just love when someone judges something they know nothing about.","post_message":"The recruitment video has been criticized for lacking diversity and objectifying women."},{"comment_id":"10154048567109203","commenter_b":"She's a turd","commenter_a":"Hillary 2016","post_message":"How could you, Will Ferrell??"},{"comment_id":"1736968439901263","commenter_b":"@username - nobody in this world is a bigger liar than Hillary. Period.","commenter_a":"Why is it when her lips move my first thought is liar liar pants on fire...when will she tell how much she took from foreign governments - oh well, what difference does it make anyway","post_message":"Watch: Hillary Clinton suggests Donald J. Trump hasn't paid his taxes."},{"comment_id":"10154769699754486","commenter_b":"STOP THESE TWO IDIOTS...............WHY CAN'T YOU UNDERSTAND WHAT ILLEGAL MEANS? YOUR A DISGRACE TO THE OFFICE YOU HOLD........ALL ILLEGALS AND REFUGEES SHOULD BE DEPORTED AT ONCE.........STOP THE ATTACK ON AMERICA...............","commenter_a":"What stupid Fools!!","post_message":"They want to make Obama's Executive Order amnesty for millions of illegal immigrants the law of the land."},{"comment_id":"10155220975479218","commenter_b":"@username tell that to a nun","commenter_a":"You wouldn't need to be pro choice or pro life if people were just responsible when it comes to their sex lives. Both men and women, responsibility!","post_message":"Thousands of people demonstrated in the annual March For Life, marching from the Washington Monument to the Supreme Court, advocating the right to life >> @webpagelink"}]
