[{"comment_id":"10153204698059712","commenter_b":"It looks like the New Anti Gun Laws are working for the Criminals. It's taking Guns out of the hands of the Law Abiding Citizen and putting them in the hands if the Criminals because Criminals Don't Follow the Law. Good Job Liberals for putting Maryland back at #1 for Murders.","commenter_a":"Violence in Baltimore, gee would neva had thunk that!!","post_message":"Baltimore has had 54 homicides in 2015 — 8 more than at this time last year. Nonfatal shootings are also up 40%."},{"comment_id":"10154796294188256","commenter_b":"Hahaha poor Kellog was trying to introduce cereal to inbreds that eat steaks and drink Budweiser for breakfast. I bet they realized that was a wade of money!","commenter_a":"That will not bring in any more business, only lose customers..","post_message":"Kellogg is pulling its ads from the website Breitbart News, the right-wing news organization whose former chairman Steve Bannon was tapped as a top adviser to President-elect Donald Trump ."},{"comment_id":"911760225550393","commenter_b":"and she's just ugly","commenter_a":"Gabbie Dib","post_message":"One Direction's Zayn Malik  spotted holding hands with girl who’s NOT Perrie   (Via Daily Mail Celebrity)"},{"comment_id":"1004293156333603","commenter_b":"Truth hurts if ou weren't an illegal you wouldn't have taken offense.","commenter_a":"Keep them out the US we have enough problems with illegals already. Deadbeats sucking the economy dry","post_message":"This year, nearly 200,000 people have landed on Greek shores, another 110,000 have arrived by sea to Italy and more than 120,000 by land to Hungary. Germany has just announced that it expects to receive 800,000 asylum applications in 2015."},{"comment_id":"591748790988611","commenter_b":"She is such a lying two-faced b**** and anybody that believes anything that she says is a moron! That woman has more money and more houses and more luxury than anyone. Everytime she opens her mouth she's lying","commenter_a":"Pot calling the kettle? Except for Trump never having killed anyone","post_message":"Is this hypocritical?  WATCH: Hillary Clinton called out Donald J. Trump for his lavish lifestyle, despite living in luxury herself."},{"comment_id":"1849193665299183","commenter_b":"White people are the biggest thieves known to man","commenter_a":"@username. as u know donny is completely unfit ...u dont care about your grandchildren smh sad","post_message":"WATCH LIVE: Electors are casting their ballots — will Donald J. Trump get the 270 he needs?"},{"comment_id":"10153058052287452","commenter_b":"Scum bags","commenter_a":"Trump be like \" bet they were Mexicans \"","post_message":"Gone in 90 seconds!   A burglary crew crashes an SUV right into a clothing store and dashes off with thousands of dollars in merchandise.  Not even steel security gates could stop this crew. Tonight, the hunt to catch the cunning crooks who knew exactly which designer threads to grab. Tonight at 11 from ABC7 Eyewitness News. abc7.la/1FenO5y"}]
