[{"comment_id":"10155794432670354","commenter_b":"she'll never get that stink off her!","commenter_a":"What was that idiot doing there anyway.","post_message":"What was she thinking?"},{"comment_id":"10153767217919497","commenter_b":"Let's really make a team effort to versnitchinize the fizemignots.","commenter_a":"Area intern tells employer \"I'm more into first person shooters, than platforming\" is fired on the spot","post_message":"The buzzword has yet to be expounded on or put in context by anyone at the company."},{"comment_id":"10152630103907894","commenter_b":"Ladies love you to death but clearly you are being unfair in this matter 70 to 80 percent of custody battles in this country land in your favor whether the father is fit or not whether he is financially stable or not so for you guys to be sitting here some type of quote unquote outraged about this is ridiculous. knock it off.","commenter_a":"Some women needs to be careful who they sleep with","post_message":"Ludacris Wins Primary Custody of His Daughter"},{"comment_id":"10155341100780725","commenter_b":"So put that bitch down","commenter_a":"Obviously she has mental and emotional illness. Maybe people shouldn't be so quick to throw her to the firing squad.","post_message":"The woman accused of viciously cutting open a mother-to-be's womb to steal her fetus was apparently faking her own pregnancy, which gives a clue as to why she committed the horrendous crime, according to a police affidavit ----> @webpagelink"},{"comment_id":"826344630889447","commenter_b":"We are sick and ;tierd of feeding these lazy women who just keep laying on their backs , letting free loaders get them Pregnant. We need to sterilize these women. We should pay to get them sterilized.","commenter_a":"Get a JOB, leeches.","post_message":"They are losing it. That's what happens when you mooch for your entire life.  Do you think this was a long time coming?"},{"comment_id":"10153386538275326","commenter_b":"How is he going to run his hotels,if he reports all illegals??","commenter_a":"He mean kill them.","post_message":""},{"comment_id":"1131957863541988","commenter_b":"Anti-Gun people are ALWAYS the least EDUCATED when it comes to firearms. The AR is light, easy to aim, and in a situation when multiple armed people are invading your home, it's the ideal tool of choice for protection. About 3 Million home invasions happen each year. How do you Anti-Gun sheep suggest people defend themselves from MULTIPLE ARMED criminals? A handgun with 5 or 6 round won't help much with 3 guys breaking into your house","commenter_a":"A killing machine? Some people really do think that if a person has a gun they are going to use it for killing people. That they are and the weapons are evil. Stupid and clueless","post_message":"It only took us 38 minutes to walk out of an Orlando gun shop with a killing machine. See for yourself."}]
