[{"comment_id":"10153381284694087","commenter_b":"And until tools are in place, ban all Muslim immigration!","commenter_a":"Bubio is a big money lobbyists puppet! Vote for Trump!","post_message":"\"How many attacks on the homeland will we have to endure before the president understands that lawful intelligence tools subject to judicial review are necessary to win the long war against radical Islamic jihadism?,\" Sen. Marco Rubio wrote in a scathing op-ed along with Sens. Tom Cotton and Joni Ernst."},{"comment_id":"10153768350172452","commenter_b":"It's not when you split lanes... it's when traffic is going about 30mph, motorcycles are going 60, and we in larger vehicles try to switch lanes. A small bike going twice our speed appears almost out of no where.","commenter_a":"We split lanes for one main reason: Safety! In a world with endless distractions, the rear ending of motorcyclist almost always ends up with a fatality.","post_message":"Gov. Jerry Brown has signed legislation that moves California toward condoning the practice of lane splitting, in which motorcyclists drive between two lanes of cars."},{"comment_id":"993982434028144","commenter_b":"That's my girl.","commenter_a":"Aarøn Andersøn","post_message":"\"The Seniors and Veterans Emergency Benefits Act would give about 70 million seniors, veterans, people with disabilities, and others an emergency payment equal to 3.9 percent of the average annual Social Security benefit, about $581 – the same percentage raise as the top CEOs got last year.\"  Read more here: @webpagelink  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1765714417015228","commenter_b":"You girls sound like that reporter that went over there to prove her point and got killed by them. LOL","commenter_a":"Totally believe women should be able to wear burkas as part of their religious dress, same for the Jews and their hats, etc. This is disgusting.","post_message":"The bill wouldn't just prohibit Muslim women from wearing burqas or veils in state driver license photos, it would also ban them from covering their faces while driving and possibly while on any public property."},{"comment_id":"10154217299006350","commenter_b":"Praying for yall","commenter_a":"This is my daughter dressed for the winter formal, I am proud of who she is inside and out. She loves school, sports, and her church. I don't care who she decides to love or what she wears as long as she does it with all her heart and as long as she knows me and Jesus love her.","post_message":"\"I think God accepts me for me.\""},{"comment_id":"1619826891648925","commenter_b":"@username Killary's hips are evidently widening. Must be all the hot sauce and watermelons she stashes in her pants.","commenter_a":"Why I'm backing D.T., he's against the establishment, can't stand Obama & Hillary, called out lying Cruz, wants America first, he doesn't come from a political family, treats his 30,000 employees with respect, supports law enforcement, will put a border up, deal with illegals & radical muslims, doesn't act like a scumbag politician, he's not part of the \"Good Old Boys\", helps military and families, great family man, very passionate about this country & the citizens, doesn't take BS from anyone and wants to Make America Great Again! #VoteTrump2016","post_message":"FLORIDA -- THANK YOU --- WE CAN WIN! Lets MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10155543749229778","commenter_b":"Perhaps she is the right choice since we'll be obstructing the GOP for the next four years...","commenter_a":"Things are going great. More of the same!!!","post_message":"Rep. Nancy Pelosi won another term Wednesday morning as the leader of House Democrats, turning back calls from some in recent weeks who said it was time for a change."}]
