[{"comment_id":"10153239420904087","commenter_b":"WooHoo - I'm stupid as hell says Trumpette fool hoping to be wife #4.","commenter_a":"Woohooo! #Trump2016","post_message":"“I think Donald J. Trump changed the opinions of the African-American pastors that were in the room,” Pastor Darrell Scott told CBN News. “They saw a side of him outside of the media depiction, and that they would give strong consideration in regards to supporting his presidency.\""},{"comment_id":"10158074030495206","commenter_b":"Take the appearance fee and go home","commenter_a":"Has she claimed racism yet?","post_message":"JUST IN:"},{"comment_id":"525854287602864","commenter_b":"Send them all back to whatever country they come from. America has no room and not enough air for any of them. They are poisoning our good air.","commenter_a":"Why should he care she is a rent a kid not even his.","post_message":"Malia Obama at Center of Damming New White House Scandal"},{"comment_id":"10153047601521336","commenter_b":"how many lawyers have been sent to \"find dirt\" on her, like they did with Sarah? can you imagine Sarah debating this heifer on live t.v.?","commenter_a":"Well of course they didn't find anything. You never had anything interesting to say.","post_message":"\"Will they put the same effort into her emails as they did mine?\"  Former Alaska Gov. Sarah Palin thinks the media should hold Hillary Clinton to the same standard to which they held her over access to emails. What do you think?"},{"comment_id":"1832391937045878","commenter_b":"Don't tell Muslim terrors because all Christian terror everyday kill 1000 children in Syria and no body have tell about that..again I said that don't tell Muslim terror","commenter_a":"I would like to hug this peoples","post_message":"BREAKING NEWS: Berlin terror attack... At least 12 dead as truck ploughs into Christmas market  Full story: @webpagelink"},{"comment_id":"1196992380374839","commenter_b":"Too bad all his accusers wernt nasty enough!!! .lmao...","commenter_a":"Not going to happen!","post_message":"We're in Raleigh, North Carolina where Elizabeth Warren is campaigning for Hillary Clinton. @webpagelink"},{"comment_id":"1537745596485739","commenter_b":"Got it STOCKINGS !!!!!!","commenter_a":"salt","post_message":"Riddle of the day! What is it?   Quiznatic Media"}]
