[{"comment_id":"1785965414966824","commenter_b":"Ancient celts had hair like dreads as well. This is her putting a modern spin as an absolute.","commenter_a":"My life my world my rules. You dont tell me what to do","post_message":"It's everyone else's fault!"},{"comment_id":"10155217921896320","commenter_b":"she looks like my dust mop!!","commenter_a":"I love it when their hair gets like that. It's so pretty.","post_message":"Halle Berry showed off her new hairstyle at the Oscars, many on Twitter didn't like it.  What do you think?"},{"comment_id":"10153174046691336","commenter_b":"Then stand up and stop him!","commenter_a":"Annddd. What do you intend to do about it? We're waiting.","post_message":"\"Presidents have the ability to take executive action, but they don’t have the ability to change the law.\"  House Speaker John Boehner said that President Obama clearly overreached with his executive action on immigration and changes to ObamaCare on Sunday Morning Futures with Maria Bartiromo."},{"comment_id":"10153329101624087","commenter_b":"Shut em down and bulldoze em!","commenter_a":"HAHAHAHAHAHHAHAHAHAHAH HE HAS 0% CHANCE TO WIN!! WORRY NOT NON- RACISTS!!!!!","post_message":"\"You're going to have to watch and study the mosques, because a lot of talk is going on at the mosques,\" Donald J. Trump said. \"I would hate to [shut down the mosques], but it's something that you're going to have to strongly consider because some of the ideas and some of the hatred, the absolute hatred, is coming from these areas.\""},{"comment_id":"10154162076211943","commenter_b":"@username IF 60 % of conservatives and church goers stay home and do not vote. She will win. In 2012 they did not want to vote for a Mormon. SO they allowed a muslim sympathizer to stay in the White House.","commenter_a":"Lold she will just put it in Chelsea's name......","post_message":"The Boston Globe Wednesday demanded that Hillary Clinton shut down her family foundation if she wins in November because the entity \"will always look too much like a conflict of interest for comfort.\"  \"The Clinton Foundation is also clearly a liability for Hillary Clinton as she seeks the presidency,\" the newspaper said in an editorial. \"The foundation should remove a political  and actual  distraction and stop accepting funding.\" - via Newsmax"},{"comment_id":"10155773912215093","commenter_b":"So republicans in the 1950's can change the national motto of our country and put it on our money but in 2015 we can't have a woman on a bill? Ok then.","commenter_a":"The government takes all our money through taxes and health care se we won't ever see it anyway. Bummer","post_message":"An absolute outrage -- and here's why."},{"comment_id":"10154283827397014","commenter_b":"Milita Military Milita Military those two words don't sound the same","commenter_a":"A collection of dudes with short man complex playing army man and pretending to be \"patriots\"....awwwwwww, you guys run along and have fun now, don't get anyone or yourselves killed","post_message":"The group said they'll vow to protect the Second Amendment, even under Trump."}]
