[{"comment_id":"10153689476229411","commenter_b":"^your a dumb bitch lol","commenter_a":"Neo nazi sentiments are riseing in europe includeing islamaphobia and alittle anti semetic retoric. This is a reality. I dont care if u agree or dont its happening. People say get rid of the immigrants that have refugee status and those fleeing war zones and this intolerance will end. No it wont. This is a deep rooted problem of european ethnic supremacy masked. Its disguised well and they sure convince alot of people of there philosophy from people like madam blavatsky. And her race based ideology. Whats fueling race and ultimately religious intolerance is low birth rates from the native peoples of europe so they blame immigrants even tho the state subsidizes births in europe. Neo fascism is gaining ground because of this wacky race based fear and economic troubles. So the nazis are mixing both messages pointing it at immigrants and they do get violent. They dont only want ...","post_message":" is disrespectful is the political reality in Europe that people, suffering so greatly hand, over thousands of euros and must take such unsafe routes while for the rest of us Europeans it is so easy  to travel in the other direction\""},{"comment_id":"516357545155952","commenter_b":"I'd be pissed,then sue everybody.Which I'm sure she'll do.","commenter_a":"How did they get the right to determine her mental state?","post_message":"Via Filming Cops -- How would you feel if within 24 hours you go from being a successful corporate executive to being forced to become a patient at a mental ward, stripped naked, where no one believes you? It feels straight out of a psycho thriller, but this is what cops did to her."},{"comment_id":"1833505306896062","commenter_b":"Oh good....another ignorant ass showing her prejudice for all to see like it should be something to be proud of.....it just shows how utterly stupid she is......but then again by hearing her accent I could have figured that out all by myself.....hey sea cow......why don't you go back to the ocean where you belong???","commenter_a":"Surely someone knows who she is and all of these comments should be sent to her. Sorry excuse for a human being!","post_message":"Ugh... welcome to Trump's America."},{"comment_id":"1254836874556782","commenter_b":"@username vote blue no matter who.","commenter_a":"Don't forget he also enjoys killing animals in Africa for fun, like elephants! And proudly posing for a picture with severed trunk. If that's not a dick, I don't know what is.","post_message":"Wow. Just wow."},{"comment_id":"1563876947236715","commenter_b":"She a crook herself","commenter_a":"Sarah, go walk to the end of that bridge in your yard and ask Vlad of he is afraid of Trump...","post_message":"Sarah Palin called out Mitt Romney on Facebook for attacking Donald J. Trump."},{"comment_id":"10153171665732235","commenter_b":"LMAO!","commenter_a":"you know who else loves snow days? SATAN.","post_message":"Good grief."},{"comment_id":"1671785493043668","commenter_b":"Bitch..... Get a life. Stop using racism.","commenter_a":"Tactical shit is racist... says the man who uses \"Redneck\" over and over and over and then blankets all veterans as being PTSD, drunks, llamaphobes, ect. the ignorance level is... OVER 9000!","post_message":"What he says about Red White and Ben is priceless."}]
