[{"comment_id":"10154087270880047","commenter_b":"Oh hell no - the responsibility lady falls on the dingbats having unprotected sex for hell sakes...","commenter_a":"Wonderful.... Just incredible how everyone is so consumed with life at conception. I have yet to hear a plan from the Pro-Life movement that will ensure these \"life begins at conception\" babies will receive all of the necessary love and care that a child so rightful needs & deserves. This becomes YOUR responsibility!","post_message":"VICTORY: The U.S. House of Representatives passed the \"No Taxpayer Funding of Abortion Act\" by a vote of 238-183.        This is a significant, bipartisan step forward for the pro-life movement."},{"comment_id":"10156981662980603","commenter_b":"She's a stripper, no joke.","commenter_a":"Obviously this woman is so used to wear no or very little clothes that she sees nothing wrong with that \"outfit\" she wore.","post_message":"Do you think her shorts were inappropriate?   A. Yes B. No C. I don't know"},{"comment_id":"10153352781442217","commenter_b":"Haha She will never take any more selfies in life","commenter_a":"Pauline Mcgovern","post_message":"An Austrian tourist has had to be rescued from a well, after she fell into it while taking a selfie."},{"comment_id":"10154105448940950","commenter_b":"@username So many foaming at the mouth racists until he will need them. He will need them in heaven.","commenter_a":"This \"news\" is like a week old. Why do I care if she wants her son to finish school with his classmates this year? Most parents would do the same.","post_message":"Melania and Barron Trump plan to remain in New York City until at least the end of the school year."},{"comment_id":"10153138369757293","commenter_b":"freedom of religions","commenter_a":"Delaney Lynch","post_message":"“To be the first person to touch something that’s been lost for 300 years is a magical experience.”"},{"comment_id":"10155066550807994","commenter_b":"White racist people that's who.","commenter_a":"This is how they return the favor for his dream","post_message":"I HAVE A DREAM. Before Martin Luther King Jr. gave his speech in front of 250,000 in Washington, DC - the great American delivered a very similar version right here in Detroit two months earlier. READ & LISTEN:"},{"comment_id":"10153130295584726","commenter_b":"Very ugly stupid moron subhuman unamerican criminal creature","commenter_a":"You know when Hillary was running against Obama they tossed Hillary aside, I wish they woudl do the same think now. Doesn't integrity and honesty mean anything.","post_message":"WATCH: Rachel Maddow Defends Hillary From 'Nonsense' Media Scrutiny!"}]
