[{"comment_id":"934295046610968","commenter_b":"Run Sarah RUN!! President Palin has a certain \"RING\" to it !!!","commenter_a":"SHE IS OK WITH TORTURE. REMEMBER?","post_message":"When Sarah Palin posted a picture on Facebook bragging about how her son used their family dog as a \"stepping stone,\" she proved once again that animal abuse doesn't bother her at all, and animal rights groups are now slamming her for it."},{"comment_id":"10152833385031749","commenter_b":" .","commenter_a":"You are right Brent!","post_message":"\"America’s resurgence is real. And now that we’ve got some calmer waters, if we all do our part, if we all pitch in, we can make sure that tide starts lifting all boats again. We can make sure that the middle class is the engine that powers America’s prosperity for decades to come.\" —President Obama  Watch the weekly address: @webpagelink"},{"comment_id":"10153186802728203","commenter_b":"\" \"There is very little in the Bible which reflects the modern idea of one man and one woman united by love, Jimmerson said explaining her support for gay \" \" Let's see Genesis 1 & 2 gives us the pre-fall structure of marriage. This was reiterated by JESUS in Matt 19 and Mark 10. There is no higher attestation then that.","commenter_a":"That's not up for contemplation if they did be sure to expel them right away","post_message":"Southern Baptist affiliate may expel church for performing same-sex ‘wedding’"},{"comment_id":"1407285352638546","commenter_b":"Mama and papas feathers are probably nice and toasty.","commenter_a":"There it is","post_message":"CHIILLLLYYYY! Let's see what our favorite eagles are up to today, hopefully they're staying nice and warm! The little eaglet is getting big(ger)! For more: @webpagelink #HatchWatch2017 (Video courtesy of Dick Pritchett Real Estate)"},{"comment_id":"1134738373236015","commenter_b":"Actually female secretions do have some nutritional value. And ok, and maybe you should suck some more dick.","commenter_a":"Ha! Says a study funded by the patriarchy and trying to get women to scientifically be cool with swallowing men's Semen. If you're gonna be anti media, don't be pro patriarchy. It's all a part of the same machine. It's all part of the same manipulation. Fuck the patriarchy.","post_message":"And now you know..."},{"comment_id":"10153046924231519","commenter_b":"@username, when has Ann Coulter ever told the truth?","commenter_a":"I cannot stand the mind of Ann Coulter or the things that she says. But the personal attacks don't add anything to the argument. There's plenty of solid evidence to dispute among the things she says and has written. \"Old and sad,\" \"horse face\" and other things don't contribute to the discussion. They make the left look as bitter and unreasonable as the extreme right.","post_message":"This debate is a perfect example of how right-wing \"facts\" make their way though the delusional echo chamber..."},{"comment_id":"1873334889566400","commenter_b":"I'm thinking entertainment value. After he leaves office, it will be obvious what a loser he is.","commenter_a":"Idiot","post_message":"President Barack Obama plans to speak out when he believes he needs to during the presidency of Donald Trump."}]
