[{"comment_id":"1442368625820278","commenter_b":"@username maybe they would consider it if people would stop coming here illegally !! If America is not such a coveted place to be then stay in your country and deal with the shit you are handed !! It's quite simple ! But come here and mooch, steal, kill, sodomize , rape and terrorize then there will be action !! I'm not condoning it who likes war it's ugly but it is what it is !!","commenter_a":"The chinese & north koreans have killed millions, the russians and so on why just nail the USA? Ask China & Russia what their ammo is made from! Chocolates & jelly bean? Really, wake-up!","post_message":"People don't understand how bad this really is."},{"comment_id":"10152691528182293","commenter_b":"Shocking","commenter_a":"The poor isn't merely poor in finance & chance; more problematically, they are poor in thinking & vision making them poor all in their life.","post_message":"There is little empathy at the top."},{"comment_id":"10154331327221320","commenter_b":"Sounds like Jane is drunk. See Jane get drunk.","commenter_a":"The Dad was making a legal turn on red. The child didn't understand that this was a legal thing to do. I know plenty of kids who have become upset, because their parents take a sip of a soft drink while driving. They take \"don't drink and drive\" literally.","post_message":"A little boy rats his dad out to 9-1-1. Listen to the call: @webpagelink"},{"comment_id":"10154666429943258","commenter_b":"Go back to France, sing a song and appease all the Muslims......","commenter_a":"Immature. You should do what your customers ask of you.","post_message":"James Taylor wanted Fox News changed at Boston Logan International Airport. Here's what Bill O'Reilly had to say about that."},{"comment_id":"10154823170036162","commenter_b":"That is what I called the good work","commenter_a":"@username dammm","post_message":"WOW: Have you seen this? Loyal Cubs fans in Nebraska knocked it out of the park with their Halloween decorations this year, honoring the team! Their decorations include a \"Go, Cubs, Go\" light show!!!  Thanks to Sabrina and Paul Faire for sharing their video with #abc7chicago."},{"comment_id":"10154592299555579","commenter_b":"this woman is about one thing only………money and power and fame………….she has sold her soul…...","commenter_a":"WATCH CSPAN!!","post_message":"Laura Ingraham says to \"all you boys with wounded feelings and bruised egos must honor your pledge to support Donald Trump now. Tonight.\" Watch full speech here: @webpagelink"},{"comment_id":"10156268992405093","commenter_b":"What is it..?...A Witch would go down nice.","commenter_a":"She is just ordinary folk like us. See, she can laugh at herself (not really) and wants everybody to see how much she is like us and SO down to earth. Oh my how have we misjudged her all this time?! What a fraud!!!!!","post_message":"It's just.... It's just too easy."}]
