[{"comment_id":"10153825781392522","commenter_b":"There goes the fake Native American vote!","commenter_a":"Another documented lying Democrat fanning the flames. STFU Pocahontas","post_message":"\"We will fight harder, we will fight longer and we will fight more passionately than ever.\""},{"comment_id":"10153284422191323","commenter_b":"White people are often unaware of their privilege as it is invisible a lot of the time. Happened to me when I got pulled over by a cop for cutting in front of them. I got an angry warning. If I were black, there's a better chance I would have gotten a ticket. I'm not 100% white, but eh, close enough in terms of looks to get the benefits of privilege most of the time. Except at hoity toity Connecticut country clubs.","commenter_a":"Do you understand now white folks?? Its not about you as a person but the system that programs these prejudice biases into you without you knowing consciously.... So when we speak out about institutional racism and bias...its not a direct knock against you as ppl but the fabric your ancestors created and is still maintained today.....","post_message":"Racism is a business. Its marketing is so successful that even Akala looks sideways at a young black man holding a lot of cash"},{"comment_id":"10152916992026749","commenter_b":"stfu","commenter_a":"Horrible man!!!!!!","post_message":"First Steps."},{"comment_id":"10153199106634071","commenter_b":"Get her a group of body guards while you're at it","commenter_a":"M","post_message":"A $48.5 million diamond for a 7-year-old girl."},{"comment_id":"10153541764830779","commenter_b":"Lmao ugly her ugly ass","commenter_a":"Of course she feeling lemonade considering how many times Bill cheated lol @username","post_message":"Hillary Clinton visited 'The Ellen DeGeneres Show' for an interview that airs today, with the Democratic candidate discussing a variety of topics from potential vice president picks to her admiration for Beyoncés 'Lemonade.' Watch her play \"Who'd You Rather: VP Edition\" below, and see who she would choose as her running mate."},{"comment_id":"1307228812630479","commenter_b":"Yes! !!","commenter_a":"@username take Alice","post_message":"Thousands of purebred dogs from more than a dozen countries are competing at the annual Westminster Kennel Club Dog Show in New York.  See more photos here: @webpagelink"},{"comment_id":"10154062164657042","commenter_b":"Let's dip her legs","commenter_a":"Poor baby,, how can she be such a horrible person,, well prison will be her first hell, then when she die, her other REAL HELL IS WAITING FOR HER,, she have no place in heaven .","post_message":"A child has died after his stepmother dipped his legs into scalding hot water."}]
