[{"comment_id":"10153301251374087","commenter_b":"Jesse anderson, another perfect example of a bootlicking crypto fascist","commenter_a":"If police are doing nothing wrong they should have no problem being videotaped.","post_message":"The question of whether police are reluctant to enforce the law because they are afraid of being videotaped has become the subject of fierce debate, as experts struggle to explain an uptick in violent crime in some U.S. cities."},{"comment_id":"883740348483208","commenter_b":"Where are you FBI Ophry openly threatening to Murder White's. Do your duty and arrest her. Where did she get all her Million's from. She is a Racist herself.","commenter_a":"You mean all Blacks are full of hate for Whites including you get your facts straight from one generation to the next on and on forever it is taught to HATE all WHITES","post_message":"Do you think Oprah is a bigot?"},{"comment_id":"10155444032526509","commenter_b":"@username Hillary is a good start then! She devil in the flesh you're so smart","commenter_a":"How quickly we forget! If you over 35, take a walk with me down memory laneyou won believe what you have forgotten. If you under 35, read onI promise you that you will be amazed at what you missed! (By the way, sadly, this isn a joke. I wish it was.) REMEMBER WHEN BILL CLINTON WAS PRESIDENT? (January 20, 1993 to January 20, 2001two terms) When Bill Clinton was president, he allowed Hillary to assume authority over an attempt to reform health care. Her proposed plan was so bad that many Democrats came up with competing plans of their own in protest, and in spite of threats and intimidation, on September 26, 1994, the bill was declared dead. This fiasco cost the American taxpayers about $13 million for studies, promotion, and other efforts. Then, President Clinton gave Hillary authority over selecting a female attorney general. Her first two selections were ...","post_message":"The Donald J. Trump campaign issued a statement denying all the allegations, saying the reports were politically motivated."},{"comment_id":"1268420859891333","commenter_b":"Stfu lol","commenter_a":"Amanda merry christmas lmao","post_message":"Bruh!  #Gifts #WSHH"},{"comment_id":"10154255735864411","commenter_b":"It doesn't hurt to have sense of humour :)","commenter_a":"It's pretty stupid how media outlets are sharing such pathetic content. It's Obviously and clearly not a frikin time traveller. What's even more pathetic, is how the public seem so hooked onto such rubbish.","post_message":"'Time travel is real?'"},{"comment_id":"1563567157272928","commenter_b":"Stupid ass motherfucker","commenter_a":"way to go rosie, now evryone knows why trump treats you like he does. you usless POS. Done let the door hit you in the ass on the way out. if Canada doesnt want you, please dont come back","post_message":"Rosie O'Donnell just restarted an epic feud."},{"comment_id":"846208402083168","commenter_b":"Sounds like she has her head screwed on pretty straight !","commenter_a":"Amazing !!i am actually so happy for this girl... Finally, someone who I think really deserves and will truely appreciate what has just happened to her...","post_message":"\"I’m just grateful for this moment.\""}]
