[{"comment_id":"10156388159930294","commenter_b":"Racist white trash!!!","commenter_a":"Negro......you was a bad hood rat","post_message":"An Akron man learned his punishment for kidnapping and beating his ex-girlfriend. When the victim tried to escape, she broke her leg. More on the story here: @webpagelink"},{"comment_id":"1192440530796417","commenter_b":"She abstained from marriage and birth control","commenter_a":"I don't think abstinence means what she thinks it means.....","post_message":"Teen abstinence superstar Bristol Palin just gave birth to her second little bundle of hypocrisy."},{"comment_id":"1283819971638030","commenter_b":"She's a disgusting wombat","commenter_a":"Looks like big bird. We paid over 2 grand for that dress?","post_message":"The Narciso Rodriguez dress sold out online before the president had even finished speaking."},{"comment_id":"10153397291788984","commenter_b":"Couldn't agree more.","commenter_a":"Great message...lousy article.","post_message":"Famous actor Matthew McConaughey just spoke at a graduation, and he had a very blunt message for whiny college kids...  What he said is going viral... and it couldn't be any more perfect."},{"comment_id":"244406076005864","commenter_b":"@username drug cartels make millions on drug sales they will find a way around it but okay build a billions worth of wall that will stop evrything","commenter_a":"Thanks for the post, I knew he was good, but I didn't realize he was THAT GOOD!! Awesome! It's sad he has to mop up this big mess from Obummer before he can get around to some other great changes.","post_message":"Give Donald J. Trump a chance? Here's what he's done in the past 36 hours..."},{"comment_id":"10153184330157507","commenter_b":"Two people committing to care for each other for life serves society and is why government encourages it through 1100+ rights, privileges and responsibilities. If you think it's a hypocritical institution, the solution is simple. Stay out of it.","commenter_a":"Marriage is hypocrisy. The \"Government\" should have no part what so ever in it.","post_message":"That time Fox News forgot to reprogram Shep Smith"},{"comment_id":"10154203374126077","commenter_b":"Anita Mondragon I called 7 news, they immediately started investigating. Then once they had the tip everyone else ran with it.","commenter_a":"Oh so now 9 news wants to cover this. Tried to get ahold you guys and nothing. Guess now you'll pay attention when people try to get a hold of this station on news.","post_message":"Westminster Police believe 31-year-old Jarred Strenge killed a woman in her 30s last night. Anyone with information about his whereabouts is asked to call Crime Stoppers at 720-913-STOP."}]
