[{"comment_id":"10154772615548701","commenter_b":"Od the bitch","commenter_a":"U fux'n C U N T.... Let me c u any where... U will wish ur momma swallowed the load u were conceived...","post_message":"A Washington mother is accused of giving her three young children heroin to sleep. One of the children told investigators his parents gave him and his sisters the \"feel-good medicine.\""},{"comment_id":"1250451044993129","commenter_b":"Her supporters are indebted to her for what she has connected them with of course you're not going to spit in her eye the whole group including her supported just crave Power by any means necessary and feel they are much Superior to all other beings and should be allowed to run the world according to their plan blow them all out of the water please go vote for the one who loves his country it's the only hope we have","commenter_a":"The love of money is the root of all evil. They should be in jail. Anyone else who did this would be.","post_message":"This is important."},{"comment_id":"10154242349186336","commenter_b":"Darwin is going to get this woman one day soon.","commenter_a":"stupidity !!!!!!!!!!","post_message":"\"This woman is extremely lucky. We can’t explain why he didn’t get up.\""},{"comment_id":"10153240442411336","commenter_b":"incest with goats gross","commenter_a":"Guys u don't know abt islam, islam is one of the most growing religion. Coz every is's true and stay forever. People why insult 1/3 believers' religion? If again repeat such insult of us ,next time you will get ponish bY MUSLIC ACT.","post_message":"Four Egyptian kids who dared make fun of ISIS in a harmless video are headed for trial along with their teacher on charges of \"insulting Islam.\""},{"comment_id":"1331072000266602","commenter_b":"I guess it's just disappointing to think of anyone being THAT stupid . Smdh .","commenter_a":"Why make a video of this ? It has to be trolling .","post_message":"The teens said they will make Black people slaves, burn them, brand them and make them swim the Atlantic Ocean."},{"comment_id":"1297459886999211","commenter_b":"People, people, people, ain't nothing going to happen to this horrible, discussing bitch 🇨🇱","commenter_a":"Nasty woman.","post_message":"It's called \"Orgy Island,\" and there was already evidence linking Bill Clinton to it. Now, though, the FBI just dropped a bombshell involving Hillary Clinton and the sick island... and what agents are saying could turn the entire election in a VERY ugly way."},{"comment_id":"1661303277474551","commenter_b":"Municipalities the masses? Did you maybe mean manipulates? Lol","commenter_a":"The more bias tords trump just show how mutch media manipulates the masses and is shooting themselves in the foot","post_message":"\"On Feb. 9, we trust New Hampshire Republicans will send 'Biff Trump' back to somewhere — anywhere but on the road to the most important elective office in the United States at a most crucial time for this nation.\""}]
