[{"comment_id":"958150317529772","commenter_b":"The NCAA brass is a bunch of hypocrites.","commenter_a":"Oh Please this is 2015 people move on, get out of the dark ages.","post_message":"Recreational marijuana use is legal in Oregon"},{"comment_id":"10154082148493797","commenter_b":"Who cares. If they are here illegally they need to be gone!","commenter_a":"Tell them to show how they got the money to open their busines....... See fox should search before they put these articles. They did not pay taxes on one penny also they were on welfare so hmmmm think it through collecting welfare and saved a lot of money to open a business . That is fraud.......","post_message":"THE AMERICAN DREAM: Donald Trump's plan to end birthright citizenship is drawing fire from Republican challengers. In particular, one successful family from Little Village that would be torn apart if Trump got his way. That couple owns Los Mangos, which has been open since 2012 and is growing."},{"comment_id":"10157076549400354","commenter_b":"Does the rules say you can steal another candidates votes like he did with Ben Carson?","commenter_a":"Cruz is playing by the rules...PERIOD. Elections have been done this way your entire life. There is nothing different from other elections, with the exception of a whiny, sniveling, jealous loudmouth. Too bad Trump hasn't been paying attention to the rules.","post_message":"\"Ted Cruz has no chance of winning this without bribing the delegates. That’s his game at this point. He’s mathematically eliminated....\"  WATCH:"},{"comment_id":"10154294683907061","commenter_b":"Wow what a brilliant idea. Lets a build a wall to keep ILLEGAL people out! Sounds logical to me.","commenter_a":"We already have about 700 miles of border walls and fences. Maybe we should try actually enforcing our immigration laws before we go out and spend money we don't have on walls and fences that don't work.","post_message":"WATCH: President Donald Trump promises to \"build the wall;\" will take action on immigration this afternoon: @webpagelink"},{"comment_id":"10153854482548854","commenter_b":"She's shrewish","commenter_a":"I do not know why? But I do not like Fiorina...She looked like a teacher who is lecturing a student. She sound defensive as if she is always under attack.","post_message":"Carly Fiorina Calls Out Clinton And Obama For Politicizing San Bernardino Shooting"},{"comment_id":"10153673371886336","commenter_b":"Exterminate them all","commenter_a":"And they wonder why their lives don't matter?","post_message":"Scott Lattin and his family painted the words “police lives matter” on the back window of their truck.  Then, someone spray-painted obscenities about the police on their car and wrote “black lives matter” in spray paint across the side of the truck.."},{"comment_id":"1295164193914868","commenter_b":"Then her skin is too thin. I'm sure she's seen and heard much worse. Does she know what Muslims do to women?! And she wants them here sooooo bad.","commenter_a":"She is selling her soul to the devil. She can push the likes of Clinton on us. You can't be gone soon enough!","post_message":"First Lady Michelle Obama says the revelations about Donald J. Trump's treatment of women have “shaken me to my core.”"}]
