[{"comment_id":"1304805006248280","commenter_b":"That's what he wants beware","commenter_a":"They try to do anything they can to make his life more miserable-how petty!!!!!","post_message":"TRUMP WON'T BE ABLE To Use Oval Office For A Year Have To Use Nixon's Old Office Across Street"},{"comment_id":"10153553750251051","commenter_b":"You are a sneaky bitch that can not fool me you brought up color stop with the bullshit. @username","commenter_a":"What do you expect from a repeat offender? Hey justice system you spineless useless system! It's because if your stupidity and loop holes that got that child a life sentence. Those children were given a death sentence by this useless pos. This vile inhumane waste if life still breathes because of your inept logic. If that were my child, I'd hunt that diseased vile pos down and set his black ass on fire...","post_message":"It was already bad enough that this man raped a 14-year-old and a baby. Then it got even worse."},{"comment_id":"10154217299006350","commenter_b":"Praying for yall","commenter_a":"This is my daughter dressed for the winter formal, I am proud of who she is inside and out. She loves school, sports, and her church. I don't care who she decides to love or what she wears as long as she does it with all her heart and as long as she knows me and Jesus love her.","post_message":"\"I think God accepts me for me.\""},{"comment_id":"10154789513347908","commenter_b":"Bernie concede and join forces with Hillary. We all know this is what will happen anyway. We have to start now if not we will be wishing so if trump wins!","commenter_a":"Thank you, Bernie Sanders.","post_message":""},{"comment_id":"10153085333861336","commenter_b":"Go back in the basement and smoke another duby.. This is an adult conversation sight.","commenter_a":"If Israel has nukes Iran should be able to as well. However, in a perfect world neither country would have them, as Israel has threatened to use them and Iran is a loose cannon.","post_message":"CIA Director John Brennan discusses ISIS, Iran’s nuclear program and Putin’s global ambitions, this week in a 'Fox News Sunday' EXCLUSIVE!  Check your local listings and tune in to Fox News Channel at 2p and 6p ET."},{"comment_id":"1147448235275205","commenter_b":"Isn't it wonderful how they know everything even you personally. The caps are supposed to be gone according to gore. You can go to nasa and and other gov weather sites and look at the charts. There is nor a warming trend. But when they don't know just guess the insult. Just shows there ignorance","commenter_a":"Climate change happened with or without fossil fuel use. Isn't that interesting?! Well unless dinosaurs and such drove gas guzzling SUVs","post_message":"\"The message to society is clear: Prepare now, or be prepared to face the consequences.\""},{"comment_id":"938211592934866","commenter_b":"Kick His Ass Anyway, besides it was one of Jesus's Crew","commenter_a":"Jesus says an Eye For an Eye. Someone down there kick his ass Please and Thank You","post_message":"Remember, nothing says \"Soldier for Christ\" like giving a child a black eye!"}]
