[{"comment_id":"10153033146442439","commenter_b":"Sorry Drew but I've no interest in that racist bitch & her rantings! regardless of any 'truths' in there! She's fookin rancid and oozes hypocrisy!","commenter_a":"More hot action from pallywood Glen","post_message":"This is rich. You must watch this -- although we have seen it over and over and over again. Every Islamic attack has two prongs. The first is the violence and slaughter, the second is the propaganda of victimhood and chares of 'islamophobia', …"},{"comment_id":"875517669161528","commenter_b":"Well here's the problem because of women like you these little Angel can't even make to birth how disgusting!","commenter_a":"The American dictionary says it's a human embryo, human fetus, human unborn baby. Common sense says it deserves human rights.","post_message":"Tell Congress to protect the unborn! Sign your Life at Conception Act petition today!  CLICK HERE to sign! @webpagelink"},{"comment_id":"10153220581496336","commenter_b":"And the rap sheet of those deceased are mind blowing. Sad to be in A profession where u care so much but the ones u protect care so little.","commenter_a":"A bad situation when police are persecuted for doing their jobs. The whole force should resign. I would.","post_message":"The booking photos of the six Baltimore police officers charged in the Freddie Gray case have been released."},{"comment_id":"1059213794114079","commenter_b":"You look like my next door neighbor. No seriously! My next door neighbor wears a hijab. She's one of the sweetest people we know. Even brought us cookies for Christmas!","commenter_a":"Islam is the best","post_message":"She stood up in an incredible way."},{"comment_id":"1225927100760651","commenter_b":"@username And this from the person from Farmville?","commenter_a":"When do we decide that our gun culture is not worth another child dying? What a sad story. Prayers for her family.","post_message":"\"She's not going to first grade, because he made a choice to pull out his gun,\" Lilly's mother said. Read more: @webpagelink"},{"comment_id":"10156977022535354","commenter_b":"Lookit that uglyass bitch!","commenter_a":"And here I thought money laundering was illegal. Huh.","post_message":"“Hillary Clinton running for President in 2008, if you’re a foreign oligarch, you can’t give to her campaign, but you can have Bill Clinton give a 20-minute speech for half a million dollars, or you can make a $5 million donation to the Clinton Foundation, and you’ve got access every bit as much as if you had raised money for their political campaign. That’s really what the Clintons have done.”"},{"comment_id":"1201785943175748","commenter_b":"The unvaccinated will always be a problem...you know why? Because you're all fucking dumb as shit! That's why.","commenter_a":"From another article. It's not the unvaccinated that started this. It's the vaccinated. \"The WHO said the two cases were in the southwestern part of the country -- bordering Romania, Hungary, Slovakia and Poland -- and that the strain responsible, vaccine-derived poliovirus type 1 or cVDPV1, may still be a threat to the region.\"","post_message":"Vaccinate your kids folks."}]
