[{"comment_id":"614337382087891","commenter_b":"you people get ready for WW 3 because that's where this is heading","commenter_a":"Hillary not trump","post_message":"Join Ohio State students on their ride to vote early LIVE with Jo Ling Kent.   Get all your election coverage here: @webpagelink"},{"comment_id":"10154736947540575","commenter_b":"Ignorant bitch. You voted hate. You liberal clowns","commenter_a":"Were was Meryl Stereo about the man that was attached and tortured. Oh yes, he was White.","post_message":"BOOM! Kellyanne Conway Schools Elitist Meryl Streep... ---VIDEO"},{"comment_id":"902141793237008","commenter_b":"She didn't deserve this. She was a good hoe...","commenter_a":"@username it appears that maybe, a hoe can get cold","post_message":"Elizabeth Luebke died in Wisconsin after going outside in temperatures as low as as -27.5 degrees with the wind chill."},{"comment_id":"452202411637006","commenter_b":"There here in the us feed them pork to hell with them if they don't want to eat pork go back where they come from keep the. Lunch day she should not of been fired that bull shit vesta","commenter_a":"pork them all!!!!!","post_message":"Lunch Lady Fired For Serving Pork To Muslim Student.  'LIKE' if this is WRONG!!!!!!"},{"comment_id":"1561423844160413","commenter_b":"@username 😜","commenter_a":"@username me","post_message":"One 38-year-old Liverpool man took 39 goes to pass. 🚙"},{"comment_id":"10153851364301336","commenter_b":"Women and small children only.","commenter_a":"Look at all of those men! Able bodied men not fighting to defend their own country! Cowards!!!!","post_message":"The bill would require the FBI director to certify a background investigation for each refugee – and several top security officials to certify that each refugee is not a security threat to the U.S."},{"comment_id":"875360339257302","commenter_b":"God did not allow it but there is also an evil force in this world called Satan. Satan was at work in the guy trying to take the child but God was working when he was stopped. Give evil the name that it has and that is Satan.","commenter_a":"All the comments are giving credit to the determination and strength of the mother and the officer for being on site at the right time. Why is it so difficult for everyone to see it is the hand of God that gave the mother strength and put the officer exactly where he needed to be. We are not victims we are conquerors. We can do all things through Christ Jesus.","post_message":"Video captured a Florida mother wrestling her own daughter from the arms of a would-be kidnapper inside a store. The suspect ran out of the store but was quickly stopped by an off-duty police officer at gunpoint. @webpagelink"}]
