[{"comment_id":"10152776744107217","commenter_b":"Vicki Wray better start thinking of other names 😂😂😂😂","commenter_a":"Beautiful names xxx","post_message":"#RoyalBaby: Introducing Charlotte Elizabeth Diana - she'll also be known as HRH Princess Charlotte of Cambridge"},{"comment_id":"10153856538795575","commenter_b":"Great post😀","commenter_a":"People say that Mr Trump doesn't have a platform, that he just wants to make America great again. I have something to say about that, Donald Trump is not telling you his plan he's giving you an outline. Why? Every time he brought something to the table, the other candidates take it and run. Such as immigration, the wall and other issues. I can guarantee you that he won't give you his full plans in detail until he standing at the podium next to one of the Democrats. That is when he will reveal everything. He doesn't need to do that now. Donald Trump is a visionary. He doesn't go into business without a strategy, and a form of negotiation already set. This man is prepared in business and it will be prepared when the time is right in a debate. He is a brilliant man, and he will not ...","post_message":"CHAOS in Alabama --  20,000 EXPECTED AT TRUMP RALLY!"},{"comment_id":"10154046625596051","commenter_b":"Furthermore what rights will trump take? The right for illegals to get more welfare then born americans? The right for illegals to start a business 7 years tax free and hand it of to their cousin for another 7 years?? I'm hoping for hard labor and prison time for desiccating the American flag on American soil.","commenter_a":"Since when did women become thinkers with their vagina's? Surely not many women are this dumb.","post_message":"With women voters, Clinton is leading by double digits. Why do you think that is?"},{"comment_id":"602448696614153","commenter_b":"Racist pigs","commenter_a":"@username CHILD RAPIST LOVER!","post_message":"President Obama holds his first news conference at the White House following the election of Donald Trump.  @webpagelink"},{"comment_id":"959204997435717","commenter_b":"Well.... sometimes women are raped...","commenter_a":"Will this decision really stand? Don't get my hopes up.... Can it be vetoed? Will it stand? (I hope it stands but We the people have been asking them to defund PP for a long time and they haven't listened!)","post_message":"This Congress and its relevant committees must complete a thorough investigation of the disturbing accusations evidenced in the Planned Parenthood videos before another taxpayer dollar goes to this controversial organization. These funds can be better used providing legitimate health services for women in places like North Dakota"},{"comment_id":"1219402711410410","commenter_b":"i did not know we had 18000 + illegals in our country keep signing and we can take the list and round them all up and send them all home illegals NO legals YES if any one wants to come live in the U.S.A do it right by the law and we will embrace you any thing illegal in America will be prosecuted to the full existent of the law Americans don't care where you are from just do it wright","commenter_a":"Likely, they/#SNL have to give \"equal time\", since the top candidate from the other party was prominently featured.","post_message":""},{"comment_id":"1005311662842639","commenter_b":"I would have kicked her in her taco real good!","commenter_a":"Damn what a sicko.","post_message":"This nun decided that students needed a hardcore lesson in Jesus' suffering -- so she stabbed a kid in the forearm."}]
