[{"comment_id":"10152997147654411","commenter_b":"All the western puppets are traitors,DIVIDING AND CONQUERING USING IMMIGRATION AS A TOOL TO PUT THERE SOCIALIST POLICIES THROUGH.","commenter_a":"wheres ya burka merkel,traitor bitch","post_message":"Angela Merkel has accused leaders of Pegida anti-Islamic movement, which is gaining popularity in Germany, of hijacking the slogan of 1989 Berlin Wall demonstrations,  sind das Volk ( are the people) for their xenophobic purposes."},{"comment_id":"1429758383703081","commenter_b":"Drain the swamp!","commenter_a":"If this is true the whole bunch including the Obamas need to be in prison. All the laws from the last 8 years need to be scaled back, especially the executive orders. So ridiculous that a birth certificate isn't presented before even running for president. So sick!","post_message":"You already know that Barack Obama's \"birth certificate image\" has been demonstrated to be fake. But now, the trail into the deception goes deeper, as the investigator handling the case has concluded that government officials were involved in the fraud that transformed America ..."},{"comment_id":"10153317110562377","commenter_b":"Illegals work to build the wall with fair pay. They can stay. No brainer.","commenter_a":"They will pay.","post_message":""},{"comment_id":"10154015419833869","commenter_b":"Having a hot flash doesn't mean she is not qualified!","commenter_a":"Yup","post_message":"The Borowitz Report: The same poll revealed that a broad majority of voters found an unconscious Donald Trump more fit to be President than a conscious one."},{"comment_id":"1227725310657052","commenter_b":"Please don't reproduce.","commenter_a":"Trump incites violence. He is bringing the racists out in droves and he is dividing this country. Since he came on the scene, there has been more hate crimes than I've ever seen. Wake up people!","post_message":"The sniper attack on Dallas police officers now ranks among the deadliest against U.S. law enforcement since 1900."},{"comment_id":"10154189751584062","commenter_b":"Whiney tail! That's what my mother would have called him. Shame!","commenter_a":"He sounds like he needs a pacifier and a security blanket. ..","post_message":"Garnet Coleman is defending his claims that he felt mistreated during this traffic stop last month, despite what the video shows. Some law enforcement groups are demanding an apology - hear what he has to say about that tonight at 10. You can see video of the entire stop here: @webpagelink"},{"comment_id":"729424187224050","commenter_b":"@username , The Refugees and Illegals are Already receiving benefits. THEY ALL have more benefits and Rights than the average American Citizen does!!!","commenter_a":"You want your kids seat taken at school? You want grants and scholarships used and sucked up dry by illegals and refugees? There are terminally ill, Vets, single mother and fathers and maybe you someday may need those welfare and social security benefits..but its not going to be there because of illegals, refugees, mouches and leeches will suck it all up dry...VOTE #TRUMPPENCE","post_message":"The apple doesn't fall too far from the tree..."}]
