[{"comment_id":"1172654749497442","commenter_b":"I don't get the talk of someone \"forced\" on us . She has millions more votes , sorry but except in the final Presidential election (ala 2000) the person with the most votes wins .","commenter_a":"Screw @username","post_message":"The numbers are revealing a slow but steady climb for Hillary Clinton"},{"comment_id":"10153722774708984","commenter_b":"God's Son, Jesus, was sent to Earth as a baby. Grew to be a man, ministered to people healing the sick, performing miracles, teaching about God's Kingdom. Was rejected by His own Jewish people, suffered and died on a cross. Arose from the grave the 3rd day, talked and ate with His disciples, talked to 500 people before ascending into Heaven to sit at the right hand of God, and to prepare a place for us. If we accept Jesus as the Son of God, repent of our sins, God is gracious to forgive us and save us from eternal death. We will live in peace and love and joy in our eternal life. Jesus said \" I am the Way, the Truth, and the Life, and no one comes to the Father God but by Me.\" As for me, David, I KNOW He lives in my soul. Also, I ...","commenter_a":"There is a little truth in all religion so who is to say what is right or wrong but no one's have any biasness at work or in or government god is only a word that represents all religion. Leave it in your heart's and at home or where ever it is that you warship. We are all equal no matter what I don't want any of them I have my own. No one or nothing can take that from me. Try believing in that.","post_message":"Boom! Mike Huckabee just dropped one EPIC line about Hillary Clinton and Kim Davis that will have liberals absolutely livid. He is putting himself on the line big time for this county clerk, and many are joining him in it.  Do you support what Mike Huckabee is doing?"},{"comment_id":"10153105510381336","commenter_b":"I elected Obama twice. You wingnuts act like Hillary did some sinister dastardly deed that caused 4 people to die at Benghazi.Not true..The US lies and spies and tortures and misleads as a matter of policy.J ust like Bush Rumsfeld and Cheney did. I will never vote for a conservative. Politic is a tough business. acvtually governing is something the GOP has forgotten about.","commenter_a":"What truly amazes me is that State Communications Security let her first use a personal e-mail for government business and second they let her keep an unsecured server at her home. This is a complete violation of all government communications security regulations and practices. There is no way possible that she did not send classified e-mails during her entire tenure as Secretary of State and there is no way possible that they can say that unsecured server was not hacked by outside sources. What kind of a moron would think that? The idiots that are defending this woman are absolutely CLUELESS as to the magnitude that this Security Breach is. People go to jail and/or get fired for much less than this. It is absolutely mind boggling and staggering to me that this server was not turned over and now has supposedly been wiped. This server should be confiscated and ...","post_message":"Rep. Trey Gowdy said the former secretary of state has failed to produce a single new document in recent weeks and has refused to relinquish her server to a third party for an independent review."},{"comment_id":"1051057634970056","commenter_b":"Poor woman","commenter_a":"Pro choice equals anti Christ. Stop having sex tie your tubes. No need to kill","post_message":"This is a win for women's reproductive rights."},{"comment_id":"10154416362313984","commenter_b":"It's so so wrong these thugs get by with this lawless This is Obamas America If it were white folks going against ANY minority's you can believe the law would be doing there job . But this is what Obama wants anything to keep Trump shown as the one causing all the trouble . Loretta Lynch is his puppet ( what can I do to please you master Obama? ) All Americans should be outraged at this complete lawless . I pray Trump can win.Not because he republican but Hillary will carry out this lawless policy . She wants Power folks power over you great Americans that work so hard to support your families and give to every illegal that comes in our country She wants 65,000 Muslims in without vetting them . It's all about votes","commenter_a":"SHERRIF CLARKE!!! YAGOTITRITE!!!! STICK TO YOU GUNS!!!! We are all PROUD OF YOU!!!!!","post_message":"Sheriff Clarke just took down the United States Department of Justice and Barack Obama in one fell swoop...  Do you agree with what Sheriff David Clarke just said?"},{"comment_id":"895449430498298","commenter_b":"Both are DICKS!","commenter_a":"A shame that both our prez and attorney general drew the guilty card before any investigations. Instigators to anti-police sentiment? Comments like Paul's are simply deniers to the findings of two separate independent investigations that produced identical findings. That is, Brown never had his hands up, was never surrendering and he was the aggressor.","post_message":"The Justice Department has finally confirmed what many of us were certain was the case: Ferguson police officer Darren Wilson told the truth about what happened when he said he shot Michael Brown in self-defense. After a six-month investigation, the DOJ concluded that Brown, allegedly a thug and a thief, was not trying to peacefully surrender when the incident occurred. He did not hold his hands up and say, “Don’t shoot.” And he was not shot in the back, as some alleged. @webpagelink"},{"comment_id":"1017008728310597","commenter_b":"The imaginary kind.","commenter_a":"Just what kind of Christians are they ?","post_message":"\"Poverty and joblessness are not indicators of bad character\""}]
