[{"comment_id":"10153487799954087","commenter_b":"This was Trumps plan the hole time.... They followed like a bitch in heat... And she did.... Trump just out smarted them again... We will see him on TV along with the debate","commenter_a":"Little baby Trump can't handle having Megyn as a moderator. What a sorry excuse for a presidential candidate.","post_message":"#BREAKING: Donald J. Trump accused Fox News of \"playing games\" and said he would skip Thursday's Republican debate in favor of an event to raise money for Wounded Warriors."},{"comment_id":"10152961909207894","commenter_b":"Jessica Denise u got the good job, penis all day like that? Well dammmmm","commenter_a":"It was a little 🍆🍆🍆🍆🍆 but I seen it.","post_message":"Woah! LeBron James Accidentally Flashes His Penis on Live Television [Video]"},{"comment_id":"897196563636468","commenter_b":"Nailed it! Being as, I saw this last night and asked, who is this woman!","commenter_a":"Funny how Kelly Clarkson's known over a couple of continents, yet what's her face has never been heard of over here.","post_message":"Some people wait a lifetime for a comeback like this  well done, Kelly Clarkson."},{"comment_id":"1266650310018983","commenter_b":"@username so a WOMAN RAPED HAS MENTAL DEPRESSION FROM THE INCIDENT CANNOT NOW BUY A GUN TO FEEL SAFE AND ALL THIS WITHOUT A JUDGE OR DUE PROCESS???","commenter_a":"Meh, I'm glad he's trying something, anything to try and save one child. Better than 7 years of NRA owned congress not even acknowledging the Sandy Hook children. I'm a responsible gun owner that likes the idea of strong background checks and licensed gun dealers.","post_message":""},{"comment_id":"10154031990961636","commenter_b":"Yusuf Saleh shut up","commenter_a":"It disturbs me that people have used the laughing response to this. Because domestic violence and child abuse (not to mention sheer ignorance and sexism) is just hilarious(!)","post_message":"He's on the run"},{"comment_id":"1201058653247496","commenter_b":"@username Yeah get rid of all laws because you don't like them, shoplifting, welfare and insurance fraud, ect... Do you even know what Jaywalking is where you live it why its a law?","commenter_a":"How about telling the entire story how he ran from the cop and tried to board that red bus in the picture while the cop was writing him a ticket... Also how you can hear the cop tell him to stop resisting while the kid was grabbing his baton. Oh because he doesn't feed your anti cop agenda?.","post_message":"Nine officers can be seen in the video, as an onlooker pleads 'He's just a kid!'"},{"comment_id":"10153982553531955","commenter_b":"Fire her!","commenter_a":"Where is this? Chicago..oh yeah..that crime riddled LIBERAL MESS..that place where there are 100's of black on black murders each week..that place where black lives matter the LEAST...that place where this ignorant fool of a so called teacher is. SAD AND IGNORANT.","post_message":"Public School Teacher Preaches \"Fuck The Police\""}]
