[{"comment_id":"1886511228246156","commenter_b":"Illegal aliens.","commenter_a":"What your liberal brains are to small to realize is there is no defending illegal immigrants. They have no right to a trial. They have no right to a defense. They are automatically guilty and only entitled to deportation. If you want to be American there is a legal way. It is not easy nor will it be quick. But if you are willing to do it the legal way then you get to become an American and stay without fear of deportation.","post_message":"Janet Napolitano says the University of California will vigorously protect illegal immigrants."},{"comment_id":"10154102515036409","commenter_b":"She knows how to promote something unreal as real!","commenter_a":"Yes! Prepare to have big business be hit with a steel chair! Bring Main St back to America!","post_message":""},{"comment_id":"854121244730702","commenter_b":"No need to fear - strong, intelligent, powerful women can purchase their own contraceptives or better yet save something special for marriage and then raise the next generation of Americans.","commenter_a":"Dumbass use your butt.Save a child from being liberal.","post_message":"Lena Dunham is absolutely terrified of Trump and his views on abortion."},{"comment_id":"10154339020461729","commenter_b":"Can that woman ever give a straight answer?","commenter_a":"She sucks! Just not Bubba...","post_message":"This woman...SMH"},{"comment_id":"10152914795481336","commenter_b":"Women, in particular, need to be observant, especially at night! Plus, they would be well-served to get their CCW and learn how to use their weapon---proficiently...!!!","commenter_a":"One of us would not have left there.","post_message":"Police in Texas are searching for a man seen on surveillance video forcing a woman into the trunk of her car at an ATM."},{"comment_id":"10157445323790093","commenter_b":"Because they wanna control things...U know the hands on your mind effect","commenter_a":"REMEMBER THE REPUBLICANS WARN US ABOUT AFFORDABLE HEALTH PLAN.","post_message":"Thanks Obamacare."},{"comment_id":"10152955984226130","commenter_b":"Lesbians STINK","commenter_a":"The image of God is both male and female and is reflected in a godly union between male and female where the creative power of God, His life-giving, His self-giving and His moral nature are perfectly expressed. This is only possible in a heterosexual union. When God created a partner for Adam He created Eve—not another Adam. This means that perfect partnership requires some level of difference as well as a level of similarity so great that Adam could cry out loudly, ”This is now bone of my bones and flesh of my flesh”. Sexual intimacy between a man and a woman is the normal method of male/female bonding (emotionally and physically) because it corresponds to the design of our bodies and because it is the normal means by which offspring are created. If God had intended the human race to be fulfilled through both heterosexual and homosexual marriage, He ...","post_message":"“As long as anti-gay legislation exists in any state, I strongly believe big events such as the Final Four and Super Bowl should not be held in those states’ cities.”"}]
