[{"comment_id":"10154258976231770","commenter_b":"@username and for the record we did do something about, we went after the people responsible for it! It just took 10 years because these animals lives in caves, and theses lots of caves over there!","commenter_a":"Trump said he will take care of America first and he is he said he will deport Illegal aliens and he is he said he will bring back jobs to America and he is and he said he will build a wall on our southern boarder and he will !!! AMERICA FIRST !!!","post_message":"\"There are lots of constitutional questions that reasonable people can disagree about. Whether the president can exclude foreigners from seven terror-prone countries is not one of them,\" writes Ann Coulter."},{"comment_id":"10158086481670389","commenter_b":"Good! She needed ti be fired!","commenter_a":"Glad that person was fired.","post_message":"In Case You Missed It"},{"comment_id":"1082109501809405","commenter_b":"Illegal refugee returns?","commenter_a":"what about the human rights of the children and women raped and molested by islamic immigrants ??","post_message":"Amnesty Secretary General Salil Shetty said that short-term national self-interest and draconian security crackdowns had led to an \"unprecedented assault on human rights\" in 2015. Read more: @webpagelink"},{"comment_id":"10153755960426101","commenter_b":"Your mother gives rimjobs","commenter_a":"9/11 was an inside job","post_message":"EXCLUSIVE VIDEO: A massive residential Dubai skyscraper was engulfed in flames as authorities rushed to evacuate hundreds during New Year's Eve celebrations. At least a dozen people are injured, primarily due to a stampede rushing to escape the growing fire. Updates from Newsweek Middle East: @webpagelink"},{"comment_id":"10154308160836509","commenter_b":"Shes done far worse with all the deleted emails and benghazi blood on her hands","commenter_a":"She doesn't have room to talk","post_message":"Will Hillary Clinton give Bernie Sanders a pass on the data breach or will she tear into him during tonight’s #DemDebate? @webpagelink"},{"comment_id":"10152906075606336","commenter_b":"@webpagelink In case you wanted to read the rest of what Seth Rogen had to say, not just the original tweet that was blown WAY bigger than it needed to be.","commenter_a":"Well said craig","post_message":"Country music singer and military veteran Craig Morgan fired back at Seth Rogen for his American Sniper comments. @webpagelink"},{"comment_id":"10152774777037293","commenter_b":"Really????!!!haha...yeah thats funny.Is that why he cherishes illegal aliens more than Americans?","commenter_a":"I believe Giuliani is incorrect....I think Obama would like to see a better America....as many Americans would as well!","post_message":"\"I know this is a horrible thing to say,\" he commented."}]
