[{"comment_id":"585591074975467","commenter_b":"He must be some form of illegal alien. Where do orange people come from?","commenter_a":"Prepare for 4 years of unrelenting mocking until you take this job seriously and treat people with respect","post_message":"Trump is such a crybaby..."},{"comment_id":"10153240911786491","commenter_b":"Women spend 25 percent of their lives menstruating. That is the biggest reason we spend more time in the bathroom.","commenter_a":"The only way to have bathroom equality is for women's toilets to have the same turnover rate of women coming out of the bathroom as men. Just because it's the same physical size restroom doesn't mean it's an equal situation.","post_message":"\"Many public restrooms continue to be facilities that are equal in physical space, while favoring men’s bodies, experiences, and needs.\""},{"comment_id":"10153169803431336","commenter_b":"She put her hands on her kid. I would of laid her flat too.","commenter_a":"every single student involved should be place in juvie. If the teacher isn't given justice she should sue the school for a million. no teacher should put up with that kind of sh&& from a parent or students. School's do not give teachers the support they need when the students act like animals","post_message":"Annika McKenzie allegedly put the teacher into a headlock and threw her on the ground. Then, several students reportedly began kicking and punching her while she laid unconscious."},{"comment_id":"976218969153516","commenter_b":"I hope she gets life in prison! She is a twisted individual! The other prisoners know how to handle child killers. She woo get what's coming to her then rot in hell!","commenter_a":"They all should die the very same way he did!!!!!!","post_message":"Rachel Bostian, one of three women charged with savagely beating five-year-old Alexander Stephens to death during a 22-hour abuse and torture marathon — one of the accused women the little boy’s own mom — pleaded guilty to murder and several other charges in an Ohio courtroom last Friday, according to a report in The Cincinnati Enquirer. But what led Bostian, 29, and allegedly her 26-year-old friend and Alexander’s mom Theresa Hawkins-Stephens, as well, to tie the little boy up for what... @webpagelink"},{"comment_id":"10153266860506167","commenter_b":"No, there is something very seriously wrong with the people who think he could run the country and vote for him","commenter_a":"There is something seriously wrong with Carson.","post_message":"A CNN host shuts down Ben Carson's complaints about the media: \"Journalists ask questions. That's the process. And if you don't like journalism, we should talk about that with presidential candidates.\""},{"comment_id":"10155094370524329","commenter_b":"That is why we need physical borders to cut down on illegals crossing the borders.","commenter_a":"I waited in line for 2 years in South Africa to immigrate legally to join my husband. Why is it acceptable for anyone to enter the US illegally just because they have a geographical advantage?","post_message":"Dr. Sebastian Gorka: “When you go to bed at night do you lock the front door?”  Sean Hannity: “Yeah, and then I put my gun next to my bed and I go to sleep.”  Dr. Gorka: “If you do that, then surely the border is our front door. Surely we should have a control as to who enters our house. This is the House of America.”"},{"comment_id":"10153469864552144","commenter_b":"Damn illegal immigrants voting illegally!","commenter_a":"His mother is on the voting rolls in Canada in 1974. You cannot have dual citizenship and vote in Canada. The question becomes, when did she renounce her American citizenship to vote in Canada? Or did she vote illegally?","post_message":"Hahahaha."}]
