[{"comment_id":"10154522973374102","commenter_b":"She may be the lesser of two evils, a female, a scapegoat, but she's still a nut job.","commenter_a":"I'm not saying she doesn't deserve disciplinary action, because she does. But I find it disgusting that they are targeting ONLY her, and not Trump's tweets against Nordstrom. I get that she's an easier target for the GOP, but grow a pair of balls, please.","post_message":"BREAKING: The Republican chairman of the Oversight Committee is recommending disciplinary action against Kellyanne Conway for promoting Ivanka Trump products from the White House, including \"reprimand, suspension, demotion, or dismissal.”"},{"comment_id":"1030700923658691","commenter_b":"Muslim invaders go back to your own country your not wanted here !!!!","commenter_a":"And just what the hell have you Muslims done to get rid of Isis who hijacked your religion?","post_message":"UNREAL: Dearborn Muslims Protest In Support Of Syrian  And Against  In America  @webpagelink"},{"comment_id":"10154221702747629","commenter_b":"I'm sorry about your kitty.","commenter_a":"Donald will make America great again! Even if he has to do it all by himself! This is what REAL LEADERSHIP looks like libturds!","post_message":"Donald J. Trump promised to “do it by myself” if squeamish party elders refused to get a grip on the hard job ahead."},{"comment_id":"826951857397870","commenter_b":"Don't listen to all the crap! Half of it has been proven a lie and who knows about the rest? What kind of woman has these accomplishments? Surely not the ones they're talking about! @webpagelink","commenter_a":"too much baggage for me","post_message":"You know what to do!  Thanks to Liberal And Proud Of It."},{"comment_id":"1604805479806565","commenter_b":"millions ,,,makes a star,,,,i like her,,she is a sweet little woman,,,,i am very thankful her husband had millions ,,,to get her where she is,,,she dont need of nothing ,,to even had started singing.............it was a joy seeing her perform","commenter_a":"@username you may need to read this","post_message":"YES!!!  We support you Shania Twain."},{"comment_id":"455979541241733","commenter_b":"Get a life, lady!","commenter_a":"how many illegals have we settled in nh that are on medicaid using this? what towns are they in, do we have a sanctuary city in nh or are we planning to?","post_message":"Good to see that more than 41,000 Granite Staters have signed up for coverage under Medicaid in the first year of the program. While I continue fighting to improve the Affordable Care Act, I'm glad to see health care reform moving in the right direction in New Hampshire."},{"comment_id":"934836243223515","commenter_b":"Take the cop dick out of your mouth, June. It's not a good look for you.","commenter_a":"This is ridiculous! Officers, please forgive the Mayor for having a more \"balanced\" perspective, because of the diversity of his family. He is in a unique position to be able to \"see both sides.\" It would behoove you, officers , to learn something from him and his family!","post_message":"America has told the NYPD in no uncertain terms that using a funeral to make a political point is not okay, and they just did it again."}]
