[{"comment_id":"1833117833414623","commenter_b":"Migrants coming in to work for the NHS?","commenter_a":"its only going to get worse with all the immigrants coming in","post_message":"Worst NHS week in 15 years"},{"comment_id":"10154125168701770","commenter_b":"Oh I see how he filled the room he was in Chicago hahaha the city of thugs","commenter_a":"Can't wait for him to be gone!!!!!!!!","post_message":"Democrats really don't want Obama to leave the White House..."},{"comment_id":"1285291914863987","commenter_b":"Another Muslim bites the dust !!!","commenter_a":"Thank you sir","post_message":"The police officer who shot and killed The Ohio State University attacker has been identified as Alan Horujko. @webpagelink"},{"comment_id":"10153560278573188","commenter_b":"Legitimate question, Glenn. I am a blood-bought, evangelical Protestant, holy-rolling Right-Winger. I am a Trump supporter. Trump is not a conservative as I am. And yet, he has said enough things that I agree with. And then his approach seals the deal. He is pro-life now and believes Planned Parenthood's recent atrocities warrant a government shutdown. Yes, he did say in the future he would consider looking into the \"good\" things that Planned Parenthood does for women's health. This tells me two things: he doesn't have a clue who or what Planned Parenthood really is now but would make sure he did before supporting their refunding and he's a business-minded man, who when put between a rock and a place he knows nothing about (PP), he's not going to burn his bridges- at least until he's sure about what he's talking about. Trump is spot on when it comes to ...","commenter_a":"No candidate is perfect. Trump comes as close that can be done. Support your new President. May God in 2016 replace Obama with a man that knows how to get things done and not one that takes years to figure it out. Trump 2016 may the Lord guide and strengthen you and give you wisdom to do your job. Peace be with you.","post_message":"I really want to understand."},{"comment_id":"554226841431375","commenter_b":"Hillary is the dispicable one calling Millions of Americans all kinds of names that do not want her for President . So save all your outrage for Hillary , oh that's right . You hypocrites don't have a problem with Hillary doing it and yourselves as well . Shame on you Debbie and all like you .","commenter_a":"The nasty, inconsiderate, unemphatic comments are disgusting & shame, shame on everyone making them. Hillary has run herself ragged & not surprised she's got pneumonia. Coughing a lot lately. She's exhausted. No wonder. Be careful what you say because it'll come back to you tenfold. #KARMA","post_message":"JUST IN: Hillary Clinton was diagnosed with pneumonia on Friday, her doctor says. The doctor revealed the condition hours after Clinton stumbled while leaving a 9/11 event. @webpagelink"},{"comment_id":"10153837028166130","commenter_b":"I have a right NOT to have a gender confused individual peeing next to me ! What about MY rights as an average Joe peeing in \"comfort\" like I have my entire life . Yes, peeing next to a drag queen is disturbing - no difference in my mind .","commenter_a":"For all you folks who think people just wake up and decide to become a different gender just to be a pervert - think about this: why would anyone want to put themselves through all of that ...hormones, family dynamics, ridicule from idiots, discrimination? Just for fun? Because they are some sort of sexual deviant? For all of you who say women should be women and men should be men because that's what God created...he created us all as individuals with our own thoughts and feelings - and yes, he even created those who feel trapped in the wrong body. Respect people for who they are, not where they came from, or who they become. Discrimination disgusts me.","post_message":"Yep, this pretty much says it all."},{"comment_id":"1104163209700456","commenter_b":"Is she as dumb as a rock or what ?","commenter_a":"Just take this ignorant ass in jail.... Trump!!!!!!!","post_message":"Even after being caught cheating in elections, check out Democrats' excuses."}]
