[{"comment_id":"10153906190670667","commenter_b":"Neither Chelsea, Hillary, or Bill receive a salary from the Clinton Foundation.","commenter_a":"Clinton Charitable work done in house? Don't you mean Charitible to the Clintons, with Chelsea receiving hundreds of thousands of $$ as an administrator? Gee Ya got me there Sparky!","post_message":"Mike Pence claimed that “less than 10 cents on the dollar in the Clinton Foundation has gone to charitable organizations.” That’s misleading. @webpagelink"},{"comment_id":"1097693670320210","commenter_b":"Triple gross, have their hair all over my sheets, NO WAY!!!!","commenter_a":"Gross","post_message":"One New York couple has successfully acquired a bed large enough so that they and all 8 of their rescue pups can sleep comfortably. \"They love to just be near us. So however we can make that happen, they're happy.\""},{"comment_id":"10153861210290950","commenter_b":"You kiss your Moms with that nasty mouth?","commenter_a":"Here is my thought. Don't show him on TV!! Focus on the team, the stands, and the rest of the stadium and to hell with him. If everyone stops making him big news, maybe we can all go back to watching football and the rest of the players on the field. Make him prove he even deserves to be out there, and sorry 49er fans, but before all this crap by him became news, I couldn't even tell you who he was. Maybe this is his way of getting some publicity because he ain't no Tom Brady or Peyton Manning!!! Let him sit, he may just earn the right to sit there all season!!!","post_message":"A veteran who supports the San Francisco 49ers quarterback tweeted: \"Don't use my service--or that of any veteran--to justify the silencing of black Americans.\""},{"comment_id":"10154239882011509","commenter_b":"So is everyone just supposed to sit back and watch how ISIS does whatever the hell they want? I think not. War is a terrible thing, innocent peolle die just like they did in France and just like they did in other wars. It can't be justified, but if nothing is done about the situation we will all be required to memorize the Qu'ran soon, not to mention have our way of living destroyed by these pigs.","commenter_a":"French warplanes take off from an aircraft carrier,killing #InnocentChildren in #Syria and #Iraq","post_message":"French warplanes take off from an aircraft carrier, attacking #ISIS in #Syria and #Iraq.   The latest: @webpagelink"},{"comment_id":"879835912051831","commenter_b":"I wish her big mouth would go away ; what a disgusting woman","commenter_a":"A message for Rosie. It is one thing for people to think you ignorant and it is another for you to open your mouth and prove it.","post_message":"Tom Selleck is awesome!"},{"comment_id":"10153337035811756","commenter_b":"I was watching a girls lacrosse match the other day and was puzzled as to why they weren't wearing more gear. Then I came to the realization by what was happening. Damn it, I just wanna see women knock the shit out of each other and get fucking pumped up.","commenter_a":"It's about time! Why do girls have to play softball instead of baseball in the first place? And while we're at it, why are girls expected to play that sissy version of lacrosse?","post_message":"“There would be nothing that would bring me back to softball because that’s not my love. Baseball’s my love.”"},{"comment_id":"10154506279023812","commenter_b":"Lana Mushamel Rico","commenter_a":"Rip Rico!","post_message":"Marine combat dog that served two tours in Afghanistan and went on 240 missions is laid to rest. RIP Rico."}]
