[{"comment_id":"10153111204826680","commenter_b":"The paper of choice for Fox News viewers","commenter_a":"What was curious about the Democrat primary Debate selection pool is all Old White people — No Blacks No Hispanics -diversity?","post_message":"The National Enquirer is fixated on Hillary Clinton's mortality."},{"comment_id":"370743173113977","commenter_b":"Should have thrown the book at her!!!","commenter_a":"Hell yes she deserved it!","post_message":"Did she deserve that?"},{"comment_id":"1755557531334252","commenter_b":"I love how the racist cunt doesn't realize Africa isn't a country lol","commenter_a":"Good. GTFOut. Go to Africa where it's guaranteed you'll have a black president. This half white didn't work out so well.Alec baldwin made the same statement. Liberals whine and cry when they don't get their way. About time to unleash that Trump ttain.","post_message":"\"The View\" host Raven Symone says she's leaving America if a Republican becomes president. Will you miss her?"},{"comment_id":"392884667560081","commenter_b":"Bitch!","commenter_a":"He certainly does, and the GOP deserves a kick in the ass!","post_message":"President Obama deserves a HUGE thank you!"},{"comment_id":"10154999014692891","commenter_b":"Wow you are stupid @Cynthia Madison. It was a child!! Sorry he wasn't White!","commenter_a":"For walking in his lawn I'm going to have my dog💩law","post_message":"Protesters in Anaheim are blocking streets to demonstrate against an off-duty LAPD officer's confrontation with a teen in which he fired his gun. @webpagelink"},{"comment_id":"10154087462891813","commenter_b":"Maybe after they have this 200,000 woman march on Washington Saturday for women's rights then maybe we'll finally get a female: Ambassador to the United Nations, Secretary of Education, Secretary of Transportation, Senior adviser to the President and first female to successfully run and win a Presidential campaign, female Director of small business affairs..preferential hiring for females and federal laws mandating all government workers and state workers and military personnel get the same pay for the same rank and experience? Oh and abortion on demand.....wait...","commenter_a":"powerful and mighty statement","post_message":"Today and every day, dissent is patriotic. #WomensMarchonWashington"},{"comment_id":"10153315866223812","commenter_b":"Still none of this warrants being shot in the back...","commenter_a":"The officer has the suspects identification so was a foot chase even warranted since his address is on the ID...this man could have been picked up at anytime...seems like the officer used extremely poor judgement.....","post_message":"WATCH: Newly released dash cam audio and video shows Ofc. Michael Slager and Walter Scott before fatal shooting: @webpagelink"}]
