[{"comment_id":"852438651458224","commenter_b":"She's an idiot!","commenter_a":"AS. THE REAL Castro DID FOR THE USA. SEND THE BOAT PEOPLE. RETURN THE FAVOR. SEND OUR BOAT PEOPLE LET THEM SEE HOW THE REAL CUBANS ARRE BEING TREATED THE NUT. JOB IS TALKING. REVOLUTION.ARESST IT PUT IT IN JAIL. THE SCHOOL KNOWS ALL ABOUT HER AND DID NOTHING.INVESTGATE THE SCHOOL THEY HAVE MORE LIKE her","post_message":"Look kids, this is what #liberalism does to the brain!  Pray you're never on a plane with someone like this! You have to see it to believe it:"},{"comment_id":"692662477538954","commenter_b":"This American Woman supports Trump and I feel more comfortable just thinking about Trump being the POTUS, then I have ever felt the whole time Obama has been POTUS","commenter_a":"As a woman, I wouldn't trust Obama unless I was armed. As a woman, I wouldn't vote for Hillary unless I was voting to send her to the nearest blackhole. Trump is not perfect, by any means. But he's infinitely better than what's currently fouling up the White House.","post_message":"What do you think about President Barack Obama's statements regarding Republican women and Donald J. Trump?"},{"comment_id":"10153666093873132","commenter_b":"Please!!!! She is a rapist!","commenter_a":"Nik Gudel","post_message":"Altice's lawyer described her as a woman who was trapped in a bad marriage, saying she is \"troubled\" and \"has problems with viewing her own worth.\""},{"comment_id":"10153447455781051","commenter_b":"Trash get class Ur pregnant!","commenter_a":"Well if there married its her car too sucks to be him hopefully the baby in her tummy is ok","post_message":"When passersby saw this pregnant woman smashing a car in the parking lot, they ran outside to stop her. As soon as they learned why she was doing it, they let her continue"},{"comment_id":"10152880521321051","commenter_b":"What did this person drink in her baby bottle??","commenter_a":"I would trip if my kids rode with strangers even if they were cops. I don't trust anyone with my children. You can't trust anyone today.","post_message":"This woman is outraged that the police gave her daughters a ride to school."},{"comment_id":"10154181766797093","commenter_b":"It's non violent offenses .","commenter_a":"What about victims? Can you erase their memory?","post_message":"If you have a criminal record, a group of Dallas county judges will help people with criminal records get their lives back on track. bit.ly/2li0sJ9"},{"comment_id":"10153486419716680","commenter_b":"Yeah, see you at the polls.","commenter_a":"Only because he has not been Vetted by the Media he's a very flawed man mean and nasty. He's not well like in the Senate he was not an effective Senator! once he is fully Vetted those numbers will go down! for those who are members of his Cult why don't you do more research on him? You all have that Jim Jones Mentality and are drinking his Kool Aid! You may not know who Jim Jones is? because again you know nothing about Politics or Math or Civics! You seem not to have Jobs and Mommy And Daddy never said No to you! The old goat s a lying Fraud and you believe his BS! Those are also his Initials!","post_message":"Bernie Sanders now has 48 percent support nationwide, putting him in a virtual tie with Hillary Clinton, who is at 50 percent."}]
