[{"comment_id":"1789900814667772","commenter_b":"She needs to leave this country ....POS !!!","commenter_a":"Idiot!","post_message":"Actress and activist Ashley Judd delivered harsh words aimed at President Trump from a poem written by a 19-year-old girl from Tennessee."},{"comment_id":"10153394285461336","commenter_b":"We love them white girls","commenter_a":"All you Mexican ' s love Mexico so much why did you leave ???","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"750259701739305","commenter_b":"Until the GOOD cops police OUT theBAD COPS, these arrogant ignorant asshats will continue to terrorize our citizens. NO EXCUSE!!","commenter_a":"I wish he'd get fired!!!!!","post_message":"His tirade was caught on tape."},{"comment_id":"10154003948143812","commenter_b":"I know it's late but does anyone have her address?","commenter_a":"Thanks to all that helped i know she was happy","post_message":"8-year-old girl who survived a fire that killed her family receives more than 700,000 Christmas cards from around the globe. \"It really moved a whole community.\""},{"comment_id":"1588980671119277","commenter_b":"Agree all the way.the truth is black or white, can be proved.lies can not be proven.the cons get mad because facts on mostly on the liberal side. We can't help it if they love lies and are prejudiced to believe them.warped sub humans.","commenter_a":"Without fake news he and the GOP are dead in the water. Then all they have left is election rigging, voter suppression, and Gerrymandering. Oh yeah, and help from COMMUNIST Russia! And that just ain't enough!! #GOPTraitors","post_message":""},{"comment_id":"10153906940493812","commenter_b":"Are you American? If your pro bringing terrorists into the country and giving them free benefits like Medicaid etc. while American citizens starve, how about we send a few to stay with you? Wait... I get it... 'Nuff said!","commenter_a":"After all, some Americans do have a heart. Way to go Pres. Obama.","post_message":"\"Apparently, they are scared of widows and orphans coming into the United States of America.\""},{"comment_id":"974047066004855","commenter_b":"These tanks could easily create the blast heard around the world. Should that take place, this nation will erupt in a revolution unseen for hundreds of years. The resident of the white house should have his escape plan worked out because We the People will coming to evict him and his whole family .....and his mother in law too......!!!!","commenter_a":"Be afraid, be VERY afraid!!!!!","post_message":"FBI ON ALERT: Theft of dozens of propane tanks, purchase of 150 prepaid cell phones  [READ MORE]"}]
