[{"comment_id":"341937372643300","commenter_b":"Do you consider such hate to be Godly?","commenter_a":"It simply explains our Republic ...For which it stands....We are one Nation under under God...ALWAYS....OUR GODFATHERS KNEW THE MEANING OF REPUBLICS...Look it up...The American Flag is Our heritage....Obama is illegal trash....his followers as well...Demorats.s have sunk lower every year...This Obama is a bottom scraper...Clinton And Sanders are also bottom feeders.They NEED to be removed from office ...Ungodly monsters...","post_message":"I agree!"},{"comment_id":"10153429657851323","commenter_b":"You are the ugliest woman I have ever seen","commenter_a":"My biggest headache: is being a gay a choice or disorder? Please someone help me out.","post_message":"\"Marriage equality is just one front for LGBT rights: full LGBT equality, which includes economic justice, gender identity, immigration rights and racial liberation, is far from assured. [...] But today, one chapter in our fight is closed. Love has triumphed.\""},{"comment_id":"10153962696310950","commenter_b":"Seriously?? You are part of the problem! What she is wearing is irrelevant! She shouldn't have to wear a turtleneck to keep creeps from thinking they have free reign. Just because a woman wears sexy clothing it is not an open invitation. You still have to have permission period end of story!!!!","commenter_a":"She needs to get some self-dignity and wear something that covers her breasts.","post_message":"The soap star notably did not mention the GOP candidate in her statement."},{"comment_id":"10155232882540093","commenter_b":"I'm speaking about illegals, from 3rd world countries coming over our border and infecting the liberals who love them with diseases. There is a reason the government won't allow the American Citizen know where all those illegal kids and familes went to in OUR country. I'm sure the CDC would show there is a correlation between this outbreak and where these illegals settles. Look to those liberal states that have santuary cities.","commenter_a":"Funny we had nothing like this going on until illegals flooded our border.","post_message":"For many conservatives, resolving issues of faith and science can be tricky. What excuse do Democrats have?"},{"comment_id":"10153563258578812","commenter_b":"they can have as many wives as they want!","commenter_a":"Consenting adult and there should be a limit .... of wife's for sure .. and later polyandry limit the husbands too","post_message":"Polygamous Montana man seeks legal marriage license with 2nd wife following Supreme Court same-sex marriage decision: @webpagelink"},{"comment_id":"10154221052787869","commenter_b":"Immigrants aren't spending money with local businesses, if they aren't getting paid welfare checks. You're idea would only hurt the citizens of those cities. I agree that the federal funding needs to get cut for processing illegals, but lack of tourism would be cutting jobs, and hours for legal, working citizens that have nothing to do with it. Trust me, the working people in \"sanctuary cities\" want them gone, too.","commenter_a":"Not only should these cities lose their federal dollars, but people should not visit these cities and they will also lose their tourism dollars. Maybe they will cooperate then!","post_message":"One of Donald Trump’s most popular campaign promises was to end “sanctuary cities,” where local officials refuse to cooperate with federal immigration agencies on deportations.  This refusal to enforce the law makes these cities magnets for criminal illegal immigrants seeking to evade arrest and deportation and puts their citizens at grave risk (like Kate Steinle, the young woman allegedly shot to death in front of her family in San Francisco by an illegal immigrant who would have been in custody if local authorities hadn’t released him from jail instead of turning him over to the feds as the law required.)    Trump isn’t even in office, and already, some city leaders are having the same kind of tantrum we’re seeing from protesters in their streets.  The Democratic mayors of Chicago, New York and Los Angeles all defiantly declared that they’ll never give up their “sanctuary” policies and cooperate with federal immigration authorities.  L.A. police chief Charlie Beck also announced that his force will never work with Homeland Security to deport criminal illegal immigrants.  He said, “That is not our job, nor will I make it our job.”   Memo to these mayors and to the L.A. police chief:  As law enforcement officers, your job is enforcing laws, not protecting criminals.  If it takes cutting off your federal funds to force you to do your jobs and put your citizens’ safety first, then maybe that should be the very first cost-cutting measure President Trump takes to reduce the deficit."},{"comment_id":"453827754807805","commenter_b":"HELL YES!!! NOW THEY TRYING TO TAKE THE ONLY. GOOD FAMILY ORIENTED. ON T V TRYING TO GET GOD OUT OF EVERYTHING. THESE. PEOPLE ARE NUTS","commenter_a":"Yes","post_message":"Do You Support Keeping Duck Dynasty On TV?  Comment 'yes' or 'no'."}]
