[{"comment_id":"10153451405011336","commenter_b":"The sooner the better. We're going to need them to bail us out.","commenter_a":"When are we joining the European Union?","post_message":"JUST IN: The Confederate flag will be taken down Friday. @webpagelink"},{"comment_id":"10153896425024330","commenter_b":"Some women are idiots. Victim blaming is a disgusting habit.","commenter_a":"Some women are saying , what did he do to deserve that ...","post_message":"This woman is accused of setting her boyfriend on fire and police are searching for her. Warning, the details are disturbing. ---> @webpagelink"},{"comment_id":"1100128256666646","commenter_b":"The refugees are not the terrorists. As more information becomes available, the assumption that they are looks more and more ridiculous. Also, the vetting for the small percentage of refugees the US has been willing to accept is much stronger than anything happening in Europe at this time. Shame on our Governor. She is smart enough to know better.","commenter_a":"Governor Baker of MA has stated they're not accepting Syrian refugees. When will we hear this from you, Governor?","post_message":"President Obama has issued a proclamation ordering the lowering of flags on all public buildings and grounds to half-staff immediately and until sunset, Thursday, November 19, in honor of the victims of the terror attacks in Paris.  Governor Maggie Hassan has issued the following statement:  “I continue to join all Granite Staters and all Americans in mourning with and sending our thoughts and prayers to the people of France following these horrific terror attacks. State emergency management officials and the State Police will continue working with national Homeland Security, the FBI and local police departments to exercise extra vigilance and ensure that all necessary security precautions are taken in New Hampshire. As people across the country and the world stand together in support of the French people and one another, these heinous acts of terror will only strengthen our collective resolve to rid the world of violent extremism.”"},{"comment_id":"10153728493184203","commenter_b":"No average, healthy adult woman should really be under 100 pounds!!","commenter_a":"What is their definition of fat?","post_message":"Body-shaming."},{"comment_id":"10156901332200192","commenter_b":"Roxann Bracken ,you are above this EVIL woman ,you do not need to justify yourself ,YOU ARE AN AWESOME MOM , I don't know how someone like this @username sleeps at nite !!!! when she has such evil thoughts , Maybe if she would have raised a better Son he wouldn't be an abuser and in Jail ....just sayin ......I love you and am praying for you","commenter_a":"Just because you live in a nice house doesn't make you a good mother Robert Jennings is the father of Clayton there's a lot of facts people don't know I just hope they keep the investigation up this is no accident this is neglect","post_message":"BREAKING: Pasco deputies found the body of a missing 2-year-old Hudson boy Wednesday night in a pond near his home."},{"comment_id":"10152583869080779","commenter_b":"Dig this ditch. Now fill it back in. We'll print some money and pay you with it. Now bread is more expensive for everyone. Brilliant. The New Deal kept my grandfather a hungry child.","commenter_a":"Does Bob Dylan not remember the US government creating the Works Progress Administration (WPA), Federal Project Number One, or the Civilian Conservation Corps? Which created jobs for millions of unemployed Americans? The New Deal? FDR? No?","post_message":"Bob Dylan has a solution for unemployment: Let the billionaires step up. \"The government's not going to create jobs. People have to create jobs, and these big billionaires are the ones who can do it,” he says."},{"comment_id":"1044302852275608","commenter_b":"Trump wouldn't smoke a joint like billy tho","commenter_a":"@username. @username we will work on your wall mr trump","post_message":"Outstanding! A top priority- so we can MAKE AMERICA SAFE & GREAT AGAIN!"}]
