[{"comment_id":"10153106076119255","commenter_b":"We have so many publications on both side that are mudslingers with out facts--about time both sides clean up their act and print thing to promote and support","commenter_a":"@username only wants to stir the pot recently!","post_message":"They were insiders. Home grown. Godly. Our neighbors, friends, and kin. People like us.  By Bill Moyers"},{"comment_id":"1729422480677478","commenter_b":"I'm for the wall. Now!","commenter_a":"Immigration across the southern boarder is at an all time low level. President Obama has deported more illegals than any other president.","post_message":"Donald Trump says a border wall is a common sense way to slow the flow of illegal immigration at the border. Are you for or against his plan?"},{"comment_id":"10154467991806162","commenter_b":"Put down the pipe lady.","commenter_a":"And I am so tired of the argument that white America doesn't understand the history of slavery, or they are so \"ignorant\" about the contemporary machinations of racism. The claim of ignorance is part of the diabolical ruse but this mess is all cooly calculated and designed to preserve the racial hierarchy, which these days is often called \"racial disparities.\" Which I say is a bureaucratic term used to obscure the genocidal potential of white supremacy. How could a culture of people who have so meticulously sought to prove their superiority in all things, be so intellectually dense about how racism works? Slavery is well understood by white America because for the past 150 years it has ingeniously recreated it over and over again and called it by another name while playing dumb. FOH!","post_message":"The store owner, Abdullah Muflahi, released a video that he said he shot from a slightly different angle. He said Sterling was not holding a gun during the shooting but that he saw officers remove one from his pocket afterward. His video shows an officer reaching into Sterling's pocket to grab an object."},{"comment_id":"10153114585296130","commenter_b":"but feminism isn't about equality or justice.. it is about hatred for males and the destruction of the family..","commenter_a":"a male feminist.. wouldn't that be a bitch boy?","post_message":"Mark Ruffalo takes the (feminist) cake."},{"comment_id":"1704157759871336","commenter_b":"Hate the show.Bitchy women!!","commenter_a":"Let's hope so","post_message":"The View makes me SICK.   Take Joy Behar off the air NOW!"},{"comment_id":"1538102683151787","commenter_b":"What a bitch","commenter_a":"That was totally uncalled for she was just trying to start trouble!","post_message":"RACIST: Welfare Queen Attacks Man For Being White, Watch What Happens Next [VIDEO]  Racebaiters will never say anything about this.  What would you do in this situation?"},{"comment_id":"10156133513175389","commenter_b":"No!!!!! They want to change our culture to theirs, we shouldn't allow that!","commenter_a":"We should allow Christians in.","post_message":"Question of the Day: Do you think America should be taking in refugees from the Middle East?"}]
