[{"comment_id":"10153679733478967","commenter_b":"People really do get butt hurt in SF","commenter_a":"Carlos Salazar","post_message":"Well this didn't go very well."},{"comment_id":"10152980541131336","commenter_b":"These creeps need to be exterminated.","commenter_a":"Islam is winning...","post_message":"German police canceled a popular carnival street parade less than 90 minutes before it was set to begin, because of fears of an imminent Islamist terror attack."},{"comment_id":"10152778117529117","commenter_b":"Don't bother putting on those slippers, Princess. Instead, let's get men to carpet the whole fucking world for you.","commenter_a":"Let's stop men's definition of consent, because all rape laws were designed to help men get away with the crime. Electronic devices on the male penis, if he gets out of control ZAP--- might be effective. Hey if women controlled technology what kind of world would we have?","post_message":"The reality of campus rape cases is more boring than Rolling Stone's story of ritualistic gang rape at UVA: Alcohol abuse is almost always the real culprit, and the problem for which there is an obvious solution."},{"comment_id":"10154892441134312","commenter_b":"Shes hot","commenter_a":"And the mother of the year award goes too...","post_message":"The toddler was found inside suffering from hypothermia and frostbite."},{"comment_id":"1003724273013669","commenter_b":"This woman is dumber than a box of rocks!","commenter_a":"freaking nut case!","post_message":"Dems know where to get their votes..."},{"comment_id":"1026833867373308","commenter_b":"We don;t want or need your amnesty, illegals are criminals.","commenter_a":"If he's all smiles with those morons, he can't be trusted. TRUMP.","post_message":"Sen. Rubio co-sponsored the gang of eight amnesty bill in 2013 that would've granted amnesty to 11 million illegal aliens, weakened border security, weakened interior enforcement, and TRIPLED immigration."},{"comment_id":"10153268633329197","commenter_b":"They are all dangerous!","commenter_a":"She was a nurse and still went tanning? I'm confused. Surely she knew it was bad","post_message":"This Alabama nurse was an avid user of tanning beds, sometimes going 5 times a week! Now, she has developed skin cancer and she wants to help stop others from getting the disease. See the graphic way she shared her story --->  @webpagelink (WARNING: this story contains graphic content)"}]
