[{"comment_id":"547039675478904","commenter_b":"trump is not going to build a wall or deport. sorry","commenter_a":"Make America great again build that wall","post_message":"\"I want America First - so do voters!\"  Hear from Donald J. Trump tonight on protesters, the Indiana primary and more at 10p ET. #Hannity @webpagelink"},{"comment_id":"1746066945644780","commenter_b":"Sickening","commenter_a":"If Hillary wins we are fucked. All will end for this once dear nation. Adios America this nation is now a dump China & Russia are the leading nations now. Deceiving Hillary is going to backstab everyone. She will do anything to get your vote but at the end you will see her lies.","post_message":"Does Trump's violent rhetoric and bigotry remind you of something? Let's take a look back at history and find out...  Big thanks to Marianne DeMarco for making this video."},{"comment_id":"884938878291056","commenter_b":"I'll fuck her up","commenter_a":"@username let matce do this she won't ever have that boy again!!!!!! I'll do everything in my power to get him from her","post_message":"Woman Checks A Mother Abusing Her Autistic Son At A Wafflehouse!"},{"comment_id":"10152694433051045","commenter_b":"twatwaffle.","commenter_a":"Melissa YES HE DOES! Can you imagine just how i said that, YES HE DOES!!!!","post_message":"Alabama Chief Justice Roy Moore sent a letter to probate judges Sunday evening ordering them to refuse to issue same-sex marriage licenses."},{"comment_id":"10153262591601051","commenter_b":"Hahaha, what the hell are you? Nothing but a Hispanic niigger. But you think you're better.","commenter_a":"Fu¢k niggas","post_message":"Here's what these protesters chanted while they were being escorted by police."},{"comment_id":"673468959486383","commenter_b":"Can't run from jail...better hope Obama pardons her","commenter_a":"I do not think she will run in 2020, nor will the DNC even consider her after the whooping they took, she is too toxic.","post_message":"Trump-Clinton rematch for 2020?"},{"comment_id":"977678122350240","commenter_b":"Hillary is NOT with us, we are NOT with her.","commenter_a":"The Revolution!!!!! Bernie !!!!","post_message":"Bernie or Bust rally in downtown Philadelphia"}]
