[{"comment_id":"10154245909881130","commenter_b":"Oh, better step back, she threatened him with the janitor!!!!","commenter_a":"Suzane Al Ahmad","post_message":"Boy, bye. 😂"},{"comment_id":"10154555374851337","commenter_b":"She's a big mouthy bitch lol","commenter_a":"Angie Hoekema","post_message":"WATCH Nancy Grace argue that Brendan Dassey's conviction shouldn't have been overturned..."},{"comment_id":"10155794432670354","commenter_b":"she'll never get that stink off her!","commenter_a":"What was that idiot doing there anyway.","post_message":"What was she thinking?"},{"comment_id":"10155461378486509","commenter_b":"trump Come clean , admit your a Rapist and we will feel sorry for you and vote for Hillary ,","commenter_a":"I'd love to see Trump supporters try to deny he said the things he was filmed saying.","post_message":"Watch Anderson Cooper repeatedly ask Donald J. Trump about sexual assault at the last debate. @webpagelink"},{"comment_id":"1179430858762542","commenter_b":"@username what an a**","commenter_a":"Not even the president yet, and already proving himself to be the leader we so desperately need!","post_message":"As soon as Donald J. Trump heard the news that 1.5 million people are being asked to leave their homes, he knew exactly what to do..."},{"comment_id":"535989533241343","commenter_b":"Stop hating Racist women !","commenter_a":"3 Muslims just went into a Canadian city and opened fire in a bar on innocent people. Canada's Muslim appeaser ignoring it. This is on his shoulders. Trudeau's headline today? Liberal mp going to detox. Watched Obama. Muslim crimes are shush shush. White criminals get detroyed by Obama, cries 'racism' and moves his gun agenda forward. The double-standards by these leaders is taking democracy down a precarious path. Sad.","post_message":"President Barack Obama at State of the Union: \"When politicians insult Muslims, whether abroad or our fellow citizens, when a mosque is vandalized, or a kid is called names, that doesn’t make us safer... It diminishes us in the eyes of the world.\"   #SOTU updates: @webpagelink"},{"comment_id":"10154373142406509","commenter_b":"It's bc she's white and rich.","commenter_a":"When you have money the law work for you and when you're poor it don't","post_message":"Tonya Couch, the mother of so-called \"affluenza\" teen Ethan Couch, had her bond lowered from $1 million to $75,000 at a hearing on Monday."}]
