[{"comment_id":"685418174982094","commenter_b":"Why don't they take those liberal bitches off the air","commenter_a":"These women need to think before they speak","post_message":"The View is going to be taken off the air after host says this about candidate on live TV. This show is disgusting liberal trash. Put an end to the show already. Can we get 100,000 'LIKES' to have The View cancelled?"},{"comment_id":"1091281260931621","commenter_b":"False? He plead guilty and was a registered sex offender.","commenter_a":"Best known for being a paedophile.","post_message":"RIP Jackass star Vincent 'Don Vito' Margera"},{"comment_id":"471302453029710","commenter_b":"Shut up bitch","commenter_a":"Lovely comments. Your humanity cards should be revoked. Two pilots died. They weren't bombing anyone. They didn't authorize an invasion. They may have left families. They made modest incomes. Let's hope we can oppose Russian foreign policies without celebrating the deaths of two everyday Russians. Condolences to their families.","post_message":"This is the sixth military aircraft accident in the country in just under six weeks."},{"comment_id":"10153974959029087","commenter_b":"@username I would be suprised if you cared.","commenter_a":"Funny to read some of the Trump supporters defenses that show they didn't read the article. First, the pictures weren't taken outside of the US, they were taken here. So the argument that they \"could have been taken outside of the country\" doesn't hold weight. Second, yes, models come here and do photoshoots \"all the time\", however, as the article states, there is a way to do it legally, and a way to do it illegally/fraudulently. From her own statements, it seems there might be a case where it was done wrong. And lastly, it does matter because Trump's platform is \"do it the right way, she did it the right way\", and if she didn't do it the right way, then it is yet another lie and makes them hypocrites. I realize she isn't running, but he is so he made this an issue. If this were the Michelle ...","post_message":"Melania Trump has said she first came to the United States in 1996 on a short-term visa, which wouldn't have allowed her to work as a model. But a recently published nude photo shoot shows that she was working in the country in 1995."},{"comment_id":"10153254996144099","commenter_b":"Darlene is just another brainwashed white women who think all blacks are \"misunderstood\"","commenter_a":"with all the training they get they can not subdue a guy with a hammer???","post_message":"UPDATE: Police and multiple sources initially said the man was dead, though authorities later said he was hospitalized in extremely critical condition.  #BREAKING: Hammer-wielding suspect shot dead after trying to hit officer, police say @webpagelink"},{"comment_id":"10153881194507464","commenter_b":"My FB wall today is swamped with nothing short of filthy dirt on Cruz, thanks to a handful of Trump supporters. Just how ugly will this get?","commenter_a":"absolutely right, @username is the only consistant conservative in this race. CRUZ missile to the White House 2016!","post_message":"Rush Limbaugh: \"If conservatism is the dominating factor in how you vote, there is no other choice for you in this campaign than Ted Cruz... this is the closest in our lifetimes we have ever been to Ronald Reagan.\""},{"comment_id":"941291755930573","commenter_b":"Women are just as bad..","commenter_a":"Men are pigs","post_message":"She reported them to police because she said it made her walk to work an 'awful experience'"}]
