[{"comment_id":"10154645130189062","commenter_b":"Woman should be lucky for not being arrested ,for interfering with \"police business \".","commenter_a":"So he was a really nice guy she said. But, let's post this to social media to ensure really nice guy loses his job instead of giving him the opportunity to learn from his mistakes.","post_message":"\"The reason I pulled you over today...I just want to know, what's the emergency?\" said the woman."},{"comment_id":"1711261402459148","commenter_b":"Hilly would be in the slammer if she wasn't in the cartel","commenter_a":"BERNIE","post_message":"Chaos on the convention floor as the Stop Trump delegates chant for a \"roll call vote.\" RNC officials officials denied the roll call vote over the rules.  Fuill convention coverage: @webpagelink"},{"comment_id":"483283155193311","commenter_b":"Good ridance! Sorriest show on TV. Sorriest people on a show on TV. Both of the women above should be in a mental institution. Lock them two and Obama in a room together and let them live out their lives in peace. :)","commenter_a":"Hope so , it will be a blessing","post_message":"FINALLY!"},{"comment_id":"10153213932211051","commenter_b":"Dumb fucking bitch","commenter_a":"Tabby Witt This lion was in a protected park and was lured out by a dead animal carcus on a stic. Then shot by the dentist with a bow and arrow and after 2 days went by the dentist finally caught up with the lion and then shot him. If you can't see the problem here then you are part of the problem.","post_message":"The hits just keep coming for Cecil The Lion's pride."},{"comment_id":"572796029562276","commenter_b":"If Bernie runs as an independent Hillary is ******","commenter_a":"So much investigations can't you win any states without ppl saying you cheated must suck getting caught.... #stillsanders #hillarigged #tonedownforwhat #whichhillary","post_message":"It isn't enough to just say we support equal pay for women. We have to do everything we can to make it a reality."},{"comment_id":"946981455339195","commenter_b":"Lesbians...ya gotta love 'em, or give 'em to ISIS to be burned alive.","commenter_a":"Al Sharkton must go too!","post_message":"Well, that's one way to go out."},{"comment_id":"10152885514044342","commenter_b":"Ain't that the truth. These hoes need to held ACCOUNTABLE!!","commenter_a":"It's always a mental thing.. Always an excuse...","post_message":"MOTHER CHARGED: A 23-year-old mother has now been charged in a brutal attack on her 4-year-old son that left deputies responding to the scene shaken and disturbed --> @webpagelink"}]
