[{"comment_id":"891291447630577","commenter_b":"Turn the channel from Fox and get educated","commenter_a":"How anyone can back him after everything going on is beyond ignorant!!!! There r reasons he's the worst president ever!!!","post_message":"This one is HILARIOUS.   Thanks to Being Liberal."},{"comment_id":"426764770781451","commenter_b":"let the idiot walk home ! she does not deserve to be around others !","commenter_a":"Her Bus, Her Rules.","post_message":"This bus driver decided to teach a foul-mouthed teen some manners."},{"comment_id":"10152754691111051","commenter_b":"It's wonderful to know he has an optic nerve and so may one day be able to see!","commenter_a":"Why did they lie to her to start with !!!!!!!!","post_message":"This mom repeatedly asked why her new baby wasn’t opening his eyes. Doctors said his face was just a little swollen. Two weeks later, she found out the truth."},{"comment_id":"969542393176866","commenter_b":"these woman being paid by Hillary..it took them all 30 years to come out...they want their 15 minutes of fame...wonder if they'd like it if someone did that to their Dad or brother...?","commenter_a":"I think his own recording is pretty factual","post_message":"\"He has been nothing but completely respectful.\"  Chelsea Cooley Altman, who was Miss USA 2005, gave her assessment of Donald J. Trump in the wake of multiple women accusing him of sexual misconduct."},{"comment_id":"10153845298899753","commenter_b":"Can 't see what any young girl would see in that creep--what do they see in those guys?","commenter_a":"Doesn't this family have any self respect? Who really gives a crap?","post_message":"Do Kylie Jenner and Tyga have a sex tape to release? Although multiple reports have claimed the former pair starred in a series of explicit films before they split weeks ago, Kylie Jenner and Tyga weren’t planning to release one of their clips last month. Following a report earlier this week, which claimed Kylie Jenner and Tyga were about to become the next celebrity sex tape stars just last month, a second report has shot the idea down. According to a May 23 report by Gossip Cop, Kylie... @webpagelink"},{"comment_id":"10153864065907042","commenter_b":"Really 😂😩 home boy was like f that","commenter_a":"Angelo Djresearch Ravioli smh","post_message":"QUEENS 'GRINCH' STEALS CHRISTMAS: A postal worker in Ozone Park, Queens threw away 1,000 pieces of mail -- all because he was \"overwhelmed by the holiday season.\""},{"comment_id":"1077509702340944","commenter_b":"She's a vulture.","commenter_a":"She is disgracing American's right to vote. She is labeling anyone who is not a Democrat. In other words we are \"basket cases\"! It's one thing to bash Trump, quite another to degrade voters.","post_message":"Hillary Clinton is taking heat for saying \"you could put half of Trump’s supporters into what I call the ‘basket of deplorables’. Right? The racist, sexist, homophobic, xenophobic, Islamaphobic — you name it.\" What do you think?"}]
