[{"comment_id":"10154141723616509","commenter_b":"Just name a hotter chick","commenter_a":"Y'all tripping like Beyonce doesn't exist or something. Emilia is fine but sexiest woman alive?","post_message":"Who would you have picked? The Game of Thrones actress has been named  Esquire's \"Sexiest Woman Alive.\" @webpagelink"},{"comment_id":"1017389715024162","commenter_b":"@username Muslim terrorist ? Kill them simple.","commenter_a":"When you head to the polls in November, remember, Hillary Clinton tweeted this : \"Let’s be clear: Islam is not our adversary. Muslims are peaceful and tolerant people and have nothing whatsoever to do with terrorism.\" — Hillary Clinton (@HillaryClinton) November 19, 2015..","post_message":"Newt Gingrich said President Barack Obama and Hillary Clinton are \"misleading\" the American people about the #OrlandoShooting by refusing to say \"radical Islamic terrorism.\" @webpagelink"},{"comment_id":"10153598670708822","commenter_b":"Woman driving a junk Kia SUV","commenter_a":"Awesome driving right there!","post_message":"It was a shocking sight… and some tense moments for people inside the Greenfield Giant Eagle.  An out-of-control SUV ended up on the building’s roof this afternoon, leading to evacuations over gas leak concerns: cbsloc.al/1RQuE9o"},{"comment_id":"1552075435096764","commenter_b":"She is the queen of lies! Talk about incoherence!","commenter_a":"POT CALLING THE KETTLE..........(hiding fear and jealousy)","post_message":"Hillary Clinton went after Donald Trump's ideas, calling them \"dangerously incoherent\" and a \"series of bizarre rants, personal feuds, and outright lies.\" What do you think?"},{"comment_id":"10153790527131336","commenter_b":"Coming in your town soon.","commenter_a":"Beyond stupid","post_message":"Critics have pointed out that the Obama administration has taken a different position when it comes to defending Christians' religious liberties."},{"comment_id":"1361368557222876","commenter_b":"Toni, I never commented previously so I don't know what your delusion of reality is. Trump never banned all Muslims. My buddy Wayne Allen is very capable of comprehending what the fuck Trump said. He isn't an intellectually lacking derelict who has lost his way and found himself sucking Democratic titty. What Trump stated is that he would implement a vetting procedure to insure ISIS doesn't send men in with the hundred thousand other young refugees this piece of shit Democratic government is wanting to allow in. I fight for the people, brotha. Not the government. I protect this land we walk on from those who wish to impose radicalism here. Those people are our government. I am the mother fucker that will bleed on my home soil, for the real interest of our nation, not individual interests. As far as Native Americans suffering from our conquering; yeah, well, that's ...","commenter_a":"You people are the most ignorant people around. Your even more so then the Trump idiots. Leave these people alone. You should be more afraid of your neighbors. More Americans kill Americans then Muslims do. Watch the news.","post_message":"More than 20 people were stung by a swarm of bees outside a mosque in Phoenix, Arizona."},{"comment_id":"1132943900117478","commenter_b":"Knock that bitch down when he gets in your face. Trump 16","commenter_a":"What a bunch of disgusting, vile, ignorant, hypocritical, liberal scumbags!! Totally revolting behavior typical of the left with absolutely NONE of the \"tolerance\" they preach for anyone who disagrees with them!! Sickening!!","post_message":"Liberals try to portray themselves as the voice of \"tolerance.\" You'll realize just how \"tolerant\" they really are when you see this video, where they made a SICK move at a meeting that supported Donald J. Trump.  This is the REAL face of the left, folks... America needs to see this."}]
