[{"comment_id":"930066070388844","commenter_b":"ANd Every one seems to have forgotten the 11 airliners still unaccounted for close to a year now","commenter_a":"That means trouble","post_message":"UPDATE: Hundreds of TSA badges missing at airports (VIDEO)  @webpagelink"},{"comment_id":"1084762064867436","commenter_b":"Get your head out of your but she , started this joke !! May be you should pay for her education","commenter_a":"Looks like Fox found the dumbest person possible to ask questions to lol. Love how you're all thumping your chests cause Cavuto outwitted some dumb college girl.","post_message":""},{"comment_id":"10153092001211037","commenter_b":"Divina there must be some way around this.God it would be a sin to put an animal down for no good reason ! Some Humans are the worse I tell you. Try talking with her when ever she has her bouts. I had one like that too and then again for heavens sake if it's not often then what is the problem she is a dog and that's what they do. Ugg I hope something else gives them reason to move faraway from you.","commenter_a":"Naomi get a pellet/ BB gun pump it 3 times hit that dog a couple time it won't bark anymore. It doesn't break the skin nor leave marks ( I know this for a fact) but will shut them up.","post_message":"A North Seattle woman faced a lawsuit from a neighbor alleging her dog Cawper’s barking was intentionally causing him “profound emotional distress.” The neighbor wound up winning $500,000 by default because she did not challenge his claim.  Would you sue your neighbor over a disruptive pet?"},{"comment_id":"10153952866914726","commenter_b":"IN TODAY'S WORLD YOU CAN DO ALL KINDS OF THING LIKE MAKE UP POLL NUMBERS AND VOTES HELL I,M SURPRISED THEY DON,T HAVE BUSH IN FIRST PLACE THESE DUMB FUCKS KEEP TRYING TO PUSH BUSH IN A RACE HE DOES NOT BELONG THE ONLY WAY HE IS GOING TO WIN IS IF YOU JUST GIVE THE FUCKING THING TO HIM","commenter_a":"Don't look now people, but there may be a Clinton & a Bush in the 2020 or 2024 races. George Prescott Bush(Jeb's son) & Chelsea Clinton.","post_message":"The Bushes are back and looking for a big win — whatever it takes..."},{"comment_id":"10153071973637217","commenter_b":"Whats up with the broken leg? Haha random","commenter_a":"... well ... coulda been worse !","post_message":"24 unconscious, several dislocated shoulders and 1 broken leg"},{"comment_id":"10155047256148139","commenter_b":"Throw out the injunction & restore the ban","commenter_a":"this idiot can't even talk","post_message":"Listen: Oral arguments taking place regarding President Donald J. Trump's immigration executive order."},{"comment_id":"10153721851426178","commenter_b":"People are waking up. They don't need TV or papers anymore,until the net is more strangulation than it is now, serious voters make up their own minds and look at all sides of issues important to them. They are no candidates that one can agree 100% with but at least there are many out there there one can reconcile most of their views with and throw support that way.","commenter_a":"I have no use for the networks...","post_message":"Despite being the biggest story in the pro-life movement since Roe v. Wade, the networks couldn't care less."}]
