[{"comment_id":"1338680576172411","commenter_b":"Omg pathetic!","commenter_a":"@username, a good laugh.","post_message":"This is hilarious and sad."},{"comment_id":"916358841790504","commenter_b":"Gee Sara. you really ARE a blonde.","commenter_a":"Even religious organizations support planned parenthood. Your turn, republicans. Now you can't even use your Christian arguments...","post_message":"Fifty-six religious organizations are standing up in support of women's health and rights."},{"comment_id":"10153335574974384","commenter_b":"A complete waste of good female human flesh.","commenter_a":"Communist scum.","post_message":"Celebrating Women’s History Month by honoring women of \"Supreme\" achievements! Indeed, an inspiration to us all."},{"comment_id":"1900645696822355","commenter_b":"Fucking pigs!","commenter_a":"2seconds in & I can't even watch.","post_message":"His screams for helping are truly disturbing.."},{"comment_id":"1563692830591111","commenter_b":"@username We don't need to build a wall... we need to make all employers use E2Verify, get our Congress to quit allowing corporations to import H1b and H2b workers... Then move military bases from sanctuary cities and put them along the border...use the open spaces for war practice and bombing ranges to collapse the tunnels.","commenter_a":"Trump wants to build a wall on the border and make Mexico pay for it, deport illegals, cut taxes on the middle class and corporations, destroy Isis, take care of our veterans, strengthen our military, build the keystone pipeline, repeal Common Core, repeal Obamacare and replace it with a market based system, stop SS and welfare fraud, fight Mexico and China unfair trade and currency practices, preserve the sanctity of the unborn life, preserve the sanctity of the 2nd amendment ... that's conservatism ... that's patriotism ... that's what it will take to bring America back to greatness","post_message":"We cannot pretend the problem does does not exist. We need to build the wall- in order to make America safe now-- and for future generations!"},{"comment_id":"10153061361762235","commenter_b":"Actually, she's not a Texan... she's a writer from Michigan... and she can take I-35 North and get her ass outta my state!","commenter_a":"Think this is the Wicked Witch of Texas!!!! She is mean and crazy!!!!!","post_message":"American Taliban."},{"comment_id":"1339079532789860","commenter_b":"Yo she cheated she should be feed the next chick","commenter_a":"MAKE HER EAT A BAG OF THEM","post_message":"Chip Roulette: Who Will Eat The Carolina Reaper Chip, The World's Spiciest Tortilla Chip, First?"}]
