[{"comment_id":"10156246277170725","commenter_b":"But I don't support Trump's fantasy plan about deporting 11 million people illegals with criminal records should be deported immediately!!!...we should build a wall too....and we should give work permits, make them pay fines, and adopt an E-verify system. ....that's more realistic and rational. Switzerland has a population of 8 million people, according to Trump's plan, he would deport the equivalent of every single person living in Switzerland and then SOME not only it is CRAZY, it's impossible. ..for the sake of argument let's say it was possible, it would cost billions and billions of dollars and take decades to accomplish that.","commenter_a":"I think people are going to vote donald trump for president","post_message":"Saying goodbye to some of my great workers at Trump National Doral Miami."},{"comment_id":"10153882907494024","commenter_b":"The monkey bitch and her brood can't be gone soon enough for my taste.","commenter_a":"She complains about the \"house\" she lives in. Is she chained to the wall-?? Just move, bitch-!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10153523440189071","commenter_b":"You should always bet with Olly when he's had a few, he always loses.","commenter_a":"Olly Cairns @username","post_message":"It has a ton of benefits."},{"comment_id":"1068442033272574","commenter_b":"If they don't like this country they should leave. Why don't they each donate a couple of million each to some of these black communities that need the money to make things better. They won't because they are talkers not doers.","commenter_a":"If the Giants do this I will give up my Tickets","post_message":"#BoycottNFL is gaining MASSIVE momentum online. Fans are FED-UP and FURIOUS with the anti-American hatred NFL players are increasingly showing.  Let's get 5,000 SHARES and LIKES to Boycott the NFL!!!  @webpagelink"},{"comment_id":"890357731026345","commenter_b":"Sorry, but this is America. You want to live here you can follow American law. If you want to live by YOUR ethnic rules, head back to where you came from. Way to go Texas!","commenter_a":"As if Texas was ever going to let them take over and see they did it so covertly their government never even realised what was going on...Wake up Australia it is no different here","post_message":"TEXAS: Bad News For The Islamic Tribunal In Texas, Muslims Furious   There only room for one governing law in the United states, we will have no side show from the Islamist who want Shari. If you want Shari then...  @webpagelink"},{"comment_id":"10153206668181162","commenter_b":"I'm understand u Julie I feel the same sometimes I hate my own race the Humans!! I gonna try to adopt him.","commenter_a":"Are you kidding me??? I. HATE.HUMANS!!! Find the SOB who did this and shoot them! Disgusting! People make me sick. Praying for this poor dog <3","post_message":"\"SWEET SURVIVOR\": After being was shot twice, this dog will still survive. Police found her tied to railroad tracks and rushed her to the vet.   Once she is healthy, she will be up for adoption @webpagelink  Officers have named the dog R&R. (Photo via Twitter @TampaPD)"},{"comment_id":"10154350184251336","commenter_b":"She won the nomination because of Super delegates like Nancy Pelosi. Should have done in on pledged delegates only. The AP announcing her win the day before the final primaries didn't help, but that was her plan all along. How many Sanders supporters stayed home and didn't vote because of that well planned news flash. This woman will do ANYTHING to get her way. God help us all if this Country elects her as President.","commenter_a":"Killary is done and she knows it!!!","post_message":"“The stakes in this election are high, and the choice is clear. Donald J. Trump is temperamentally unfit to be president and commander-in-chief.”  Hillary Clinton took shots at Trump during her victory speech after clinching the Democratic nomination."}]
