[{"comment_id":"573149506180643","commenter_b":"They don't get nearly enough credit. Donald is right....stop them from entering the U.S. temporarily. We are in danger.","commenter_a":"Obama will probably have him fired for roughing up a terrorrist.","post_message":"Federal Agent Risks Everything To Stop ISIS Terrorist Disguised As Refugee From Setting Off Bomb In Texas  This man is a hero. Let's show him our support.  Can we get 50,000 'LIKES' for this federal agent?"},{"comment_id":"10155384832638132","commenter_b":"I wouldn't think a pregnancy so close after a tummy tuck would be good.","commenter_a":"Didn't she get a tummy tuck?","post_message":"Congrats to the Teen Mom 2 star!"},{"comment_id":"1724919811095083","commenter_b":"^^ for a woman that's a very clever reply","commenter_a":"I think a more interesting question would be, will women cycle differently on other planets? I'm no scientitian, but it seems to me it's a helluva coincidence (that we take for granted) that the female menstrual cycle is in line with the lunar cycle. Our bodies are 2/3rds water and the moon controls the tides. Am I talking out my ass if I suggest maybe the moon can can influence the fluids in our bodies? So on a dfferent planet, with different moons (and presumably after having been there for several generations), would women cycle differently?","post_message":""},{"comment_id":"430432623811698","commenter_b":"Soon Obama can seal the new border and Mexico can deal with these ingrates..LOL","commenter_a":"more obama (gov't) bullshit!","post_message":"BREAKING..."},{"comment_id":"10153641200792235","commenter_b":"Fame whores","commenter_a":"Take your pick...lol","post_message":"Petty, childish and HILARIOUS all at the same time!"},{"comment_id":"1176004315773372","commenter_b":"And make Texas pay for the wall","commenter_a":"I think we should just let all the gun nuts go to Texas and secede from the Union. They already have their own power grid, so we could build a bullet proof wall around the state and let them shoot all they want.","post_message":"Nugent's response to the San Bernardino shooting is to call for a new American civil war."},{"comment_id":"10153430518633445","commenter_b":"She is no friend of common Americans! This bitch is out for herself and her MIC handlers, fucking traitor!","commenter_a":"Hillary Clinton will say anything to get elected but she is no friend of Marijuana.","post_message":"#Trending - Hillary Clinton Suggests Rescheduling Marijuana, But Does Not Currently Support Like-Minded Legislation."}]
