[{"comment_id":"10153394886826336","commenter_b":"Mexicans run America now and there is nothing u can do about trump ur screwed...don't run for president no more there is no way ur going to win piece of","commenter_a":"Sue them to Mexico and back!","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"1250005395092512","commenter_b":"Damn, please fire her & throw her in jail.","commenter_a":"Ugh...","post_message":"Just another day in America."},{"comment_id":"10154293014660329","commenter_b":"That ugly ass bitch is a hater.","commenter_a":"Reyna Zavala Giovanna Siqueiros Princess Vespa No pues wow","post_message":"\"Swish!\" - Amber Rose, probably // Kanye West"},{"comment_id":"1473249136068163","commenter_b":"Men don't walk around campaigning for free the japs eye so why do women do this","commenter_a":"That's bold.","post_message":"Nude York City!"},{"comment_id":"1025129017543627","commenter_b":"Preoccupied? Can women still vote? $$ facebook doesn't want you to see this $$ As long as America's richest 1%, who now possess 70% of the wealth and don't bother to vote, have the Senators in their pockets the United States Government isn't representing the will of the people, it's the 1% that's running the show. I stand with Bernie Sanders, \"We're governed by an Oligarchy.\" The number of Americans living in poverty will continue to grow while the middle class will continue to shrink and working women will continue to enrich the wealthiest 1% for the next 20 years easily! (Able to afford the best and brightest, Hillary is a great political actor with a well rehearsed script.) Hillary Will make another Fortune!","commenter_a":"VOTEHfor both of US","post_message":"Women deserve access to the health care they need—without interference, intimidation, or violence. #StandWithPP -H"},{"comment_id":"10153993590153203","commenter_b":"Well, Sharon, I'll tell you what. I don't know a lot of women who regretted NOT aborting their baby. I know quite a few women who DID regret aborting their baby. And I know a lot of judgmental, intolerant women who pronounce when they think another woman SHOULD have had an abortion. That, and Margaret Sanger's avid stance on eugenics, says a lot to me about who is pushing the abortion agenda and who is falling for their bs.","commenter_a":"I was assaulted & I chose to keep my baby. For me I only had 2 choices either A. Keep her or B. Put her up for adoption. Killing my baby which is abortion never crossed my mind. Today she is almost 9 months and I thank God for her every day.. She is a blessing to me and God has a plan for us. I can't imagine my life without her. If your Pro-life you believe in LIFE No matter what.. So even in assault/rape or incest a baby should live. It's not the baby's fault what happened. No one knows how a baby was conceived.. God has a plan for ALL unborn babies.","post_message":"Christie and Bush attack Cruz, Rubio for being too pro-life"},{"comment_id":"10155384832638132","commenter_b":"I wouldn't think a pregnancy so close after a tummy tuck would be good.","commenter_a":"Didn't she get a tummy tuck?","post_message":"Congrats to the Teen Mom 2 star!"}]
