[{"comment_id":"380130102360204","commenter_b":"And how much are we spending on the illegals and the refugees?? Probably a lot more than the wall and the homeless combined. Let's take care of Americans and America's needs FIRST!! After we take care of our Veterans, our homeless, our children and build the wall we can consider helping those that want to come here legally!! Resources should not be going to illegals until all Americans are taken care of.","commenter_a":"I can buy a candy bar for a dollar or give the dollar to a homeless person. Wait! I can do both!!!","post_message":"We could Build a Wall, or End Homelessness... I know which one I'd Choose, Do You?  Join Us: The Free Thought Project"},{"comment_id":"10153882312643690","commenter_b":"Say this to naked girls and bars in japan .","commenter_a":"What a mistake","post_message":"Islam has never made more than a marginal impact on Japan, although the history of Japanese relations with Muslims stretches back further than most people imagine, the Japanese included."},{"comment_id":"10154265565576130","commenter_b":"@username ummm no! You assume we are stupid I guess because not voting is the equivalent to helping trump win! I might not like Hilary's ass either but I won't be sitting around wondering if the bitch is going to blow the country up like her opponent would if he doesn't get his way like a two year old!","commenter_a":"You realize the black vote is staying home right? Nothing screams white privilege more than hillary's ability to skirt laws and get away with it. A black man would be doing 25 to life for the crimes she has committed.","post_message":"Here are all the dumb things Donald J. Trump said about race at the first debate. Sorry in advance."},{"comment_id":"10152596926553067","commenter_b":"This is not going to hurt North Korean govt only the people","commenter_a":"Take this clown out already.,F ing joke.","post_message":"BREAKING: The U.S. is hitting North Korea with a new set of economic sanctions in response to the hacking attack on Sony. @webpagelink via CNN"},{"comment_id":"1016566111717194","commenter_b":"What a fucking hypocritic Bitch.","commenter_a":"Please don't accuse her for stealing a flag. She needed one to wear for a photo shoot to feel nostalgic about a time when she was a playmate.","post_message":"An enraged conservative attempted to steal an American flag from African-American protesters and fought with police, but was not arrested...at a demonstration regarding white privilege."},{"comment_id":"10154357156724062","commenter_b":"Short girls struggle too the regular is always too long😔","commenter_a":"Does she wear jeans & where does she purchase them? I'm nowhere near her height but have a helluva time finding them long enough. lol","post_message":"Who is the model with the longest legs in the world? Turns out a Houston girl can now claim that title..."},{"comment_id":"914685108573277","commenter_b":"Speaking of the specter of 72 virgins...I wonder if the aforementioned knuckleheads ever consider whether those promised virgins are male or female?","commenter_a":"Take off and landing from a carrier is inherently very dangerous. Glad the rescue folks did their job successfully as trained. Go Navy!","post_message":"The US Navy says one of its fighter jets has crashed shortly after launching from an aircraft carrier in the Persian Gulf."}]
