[{"comment_id":"1381800741835583","commenter_b":"Smart woman makes Hillary look like ??? 😝","commenter_a":"Obama couldn't stand her, or for that matter, none of the democrats.","post_message":"Let's go back to 1990, October 30th, 1990. It's in London, in Parliament, Margaret Thatcher, during a debate on rejecting a move toward a more closely united Europe.Let's go back to 1990, October 30th, 1990. It's in London, in Parliament, Margaret Thatcher, during a debate on rejecting a move toward a more closely united Europe."},{"comment_id":"548837575304535","commenter_b":"Bill Clinton could get away with anything.....all Hillary has ever cared about is \"power\". God forbid her from being President.","commenter_a":"Butch and Billy Americas First family good replacement for the Kennedys","post_message":"They can't cover this one up!"},{"comment_id":"1053358344760417","commenter_b":"shut our borders to any and all refugees ! whats wrong with you ?","commenter_a":"I'm seeing some really terrified Americans making terrible accusations about Syrian refugees .. people who are fleeing from terrorism themselves. I'm finding your people somewhat heartless and they sound from my perspective to be violent and racist themselves... No different in fact than the terrorists that have become their perpetrators. This is what fear does to people.. Aggressive behaviour .. We are so much more than this. I felt so sad when I read the response to Obamas humanitarian speech. So sad that you people have such fear and hatred inside you. This attitude of hatred and intolerance against people you don't even know personally will never make a better world. It just perpetuates the same old story. I feel Sad. Very very sad today.","post_message":"\"Many of these refugees are the victims of terrorism themselves – that's what they're fleeing. Slamming the door in their faces would be a betrayal of our values.\"  - President Obama  Watch more here: @webpagelink"},{"comment_id":"802131019879954","commenter_b":"Boom!!!!!........... bitches.......","commenter_a":"Karma's a bitch, Isn't she, John?","post_message":"Nice try, Johnny, but the American people are smarter than that.  Read more: @webpagelink Image by Occupy Democrats."},{"comment_id":"1180918395297096","commenter_b":"@username you come from immigrants, you really believe they should be sent out or kept out. Start packing. Show just how much you believe in this wall.","commenter_a":"Yes","post_message":"Agree or disagree: It's time to build Trump's wall at the border."},{"comment_id":"1733272846942683","commenter_b":"Girl bye! Ain't nobody listening to your BS. Ms Lori.","commenter_a":"Poof Obama creating race card and divide.... Michelle just made it clear she lives in the house built by slaves! REALLY?! A spokeswoman for the first lady says that Michelle Obama currently has a staff of 24. So, she has slaves using taxpayer money too, huh?! You have done nothing but create racial divide while in that house! Nothing deserving or anything to brag about....You could have gone down in history as a great black leadership in that house. Instead, you have did the biggest disservice to people of color by creating the deepest racial divide I have ever witnessed in my well over 50 years of life! You have weakened our country security and will go down in history as one of, if not the worst President in USA history!","post_message":"\"Don’t let anyone ever tell you that this country isn’t great.\" - Michelle Obama delivers an emotional testimony to the greatness of the United States of America. @webpagelink"},{"comment_id":"10153488869101636","commenter_b":"I am nothing close to a conspiracy theorist, but doing what I did in the military, I seen how cut throat people could be. Especially if they are scared that information will get out there that will harm them. I'm not saying that anybody did tamper with his breaks, all I am saying is that it is possible. Nobody cut his break line obviously because he would of known, but had some drilled a pin hole in a brake line or reservoir, then sealed it to make sure it didn't leak out while sitting stationary. Then as he leaves the drive way he is still able to brake because there is fluid there to press the caliper in, but it breaks the seal and starts to leak out and he could use the brakes so long that the hydraulic fluid is still able to pressure the system. By the time ...","commenter_a":"I am just throwing it out there but Im pretty sure if his brakes had been tampered with he would have known it after the first stop sign or stop light after he started his car.... They dont pick and choose when to work and when not to work when tampered with","post_message":"Police say the data box from Aubrey McClendon's vehicle registered what was happening just seconds before the crash."}]
