[{"comment_id":"487985148058732","commenter_b":"Why hell no, is that why he wants all the illegals in the USA.","commenter_a":"I've wondered if he might arrange some kind of false flag in order to declare martial law and thereby remain in office. I think he knows he couldn't get elected again in a fair election. But then again his lips were moving so he's probably lying anyway.","post_message":"What Obama just said about running for a third term is shocking.  Spread this, Obama doesn't want the public to know what he's planning.  Should Obama be allowed to run for a third term?"},{"comment_id":"472935749563672","commenter_b":"Able bodied people that are on welfare should be required to work. Taxpayers have to work, why not the leeches on welfare.","commenter_a":"If they are able to work,then yes. They should have to work. Same as they should be drug tested.","post_message":"These free loaders just got some very bad news.  Awesome. It's about time these people are put to work.  Do you agree that people on welfare should have to work?"},{"comment_id":"1374679629226158","commenter_b":"No they are NOT normal. Maybe they are from his neck of the world but the Western world not so much. England needs to wise up and get rid of him and the rest of the muslims that are taking the country over before its too late.","commenter_a":"Can't stand this guy what is he doing in US???","post_message":"The new normal."},{"comment_id":"10152921412801051","commenter_b":"You go girl.only someone with a shallow mind and no heart would think such sick thoughts.fckn perverts.","commenter_a":"This woman is awesome! ^_^ <3","post_message":"When this woman saw a hungry baby animal, she decided there was only one thing to do: breastfeed it."},{"comment_id":"928522093922469","commenter_b":"The plans he has put in place, is FILL AMERICA WITH MUSLIMS AND ILLEGALS....\"GROWTH OF THE ECONOMY IS HIS MUSLIMS AND ILLEGALS IN PLACE FOR A WAR\" SO HE DOESN'T HAVE TO LEAVE THE WHITEHOUSE......WHY DO YOU THINK HE SAID HE WAS GOING TO STAY IN WASHINGTON FOR 2 MORE YEARS, SO \"SASHA\" COULD GRADUATE THERE? HE SURE IS NOT GOING TO PAY THE COST OF HER SCHOOLING OUT OF HIS POCKET....... WAKE UP, AMERICA....THE REASON HE IS NOT IMPEACHED, IS BECAUSE MOST OF THE ONES WHO WOULD HAVE DONE IT, ARE NOT AMERICANS, BUT ARE MUSLIMS.....","commenter_a":"To have a strong economy you need more Americans working and Obama's policies stand in the way of Americans going back to work again. Obama did place an incentive for employers to hire new workers BUT he also put a heavier tax burden on employers to keep their new hires.","post_message":"WATCH Obama:  is pretty darn great right now, and making strides right now...And I don expect that these facts and this evidence will convince some of the politicians out there to change their doomsday rhetoric"},{"comment_id":"10154985176733690","commenter_b":"He talk easily bcoz he live well but Philippine's nation will suffer .China will dominate Philippine.","commenter_a":"G","post_message":"Duterte said the Philippines could do without US aid, called Americans \"sons of bitches\" and \"hypocrites,\" and praised China for offering what he said was huge financial assistance."},{"comment_id":"911723728894896","commenter_b":"Witnesses lying on the police..glad there was camera...+1 for the good guys 😀","commenter_a":"All \"community leaders/organizers\" who make snap judgments about how an officer handled a situation should be made to go through a re-enactment of what the officer went through while making their decision. Maybe by walking a mile in their shoes they will have an inkling of an iota.","post_message":"Here we go! Witnesses say a white officer shot him in cold blood, this newly released video tells different story"}]
