[{"comment_id":"10153882688775736","commenter_b":"Freedom of speech!!! Gotta love it!","commenter_a":"Performers are there to perform, and that's all we're paying for. I believe an audience member sharing their political views during a performance stands a good chance of being asked to leave. Why is it ok for them?","post_message":"A cast member responded to Trump's tweet, \"Conversation is not harassment sir. And I appreciate Mike Pence for stopping to listen.\""},{"comment_id":"10153836657664714","commenter_b":"Sorry!!!!","commenter_a":"@username ...","post_message":"Pizza, chocolate and french fries all make the top 10."},{"comment_id":"10154513663831051","commenter_b":"A bitch will always be a bitch","commenter_a":"I am sorry, what is her position in the administration? Oh right nothing.","post_message":"This photo of Ivanka Trump is sparking tons of controversy after people realized something about what's right there in plain sight. Look closer."},{"comment_id":"10156920810200354","commenter_b":"Hey Cat, I have a dog that likes cats. She break their necks and use them as a dumnbwitted limp cat as skinny playboy. Maybe I could introduce y'all. Then you and Hillary will have a lot in common except for her long awaited prison cell....Gordon, most elections was closed primaries, which means Donald couldn't continue to empty the democratic party list of intelligent members which was leaving them with the African-Americans voters and dumb and moronic white voter in that party. Anyone who could vote for Hillary must not be capable of reading or hearing...or just hate America","commenter_a":"I'm very proud of my state of Arizona. On to the White House!","post_message":"#Election2016"},{"comment_id":"10154776330225831","commenter_b":"@john, Lets talk abt the difference please.....Lets talk abt the American Citizens who took a gay man, James Byrd Jr.....beat him...tied behind a truck, and then dragged him for miles until some of his body parts started ripping off of him....when they finally stopped to toss his body over a cliff....all that was left was his torso....all done by Americans.....Legal US Citizens, in 1998..... Or better yet......the Oklahoma bombings, in 1995, who was carried out by Timmothy McVeigh.....let me reminded you how this Legal American Citizen; bombed the Alfred P. Murrah Federal Building in downtown, Oklahoma City, killed 168 people, and injured more than 680 others ...here's another legal Citizen attack for you, since we Americans forget how we're our own enemies {but I guess thats okay}.....: Eric Rudolph carried out the Olympic Park bombing in Atlanta during the 1996 Summer Olympics.....that blast killed spectator Alice Hawthorne and wounded 111.....lets ...","commenter_a":"Instead of deporting \"illegal immigrants\" kick out all the Nazis skin heads KKK alt right Moran's and we shouldn't have any problems with the rest of the world","post_message":"The 9th U.S. Circuit Court of Appeals has refused to reinstate President Donald J. Trump's travel ban. In response, President Trump tweeted, \"See you in court\" and \"the security of our nation is at stake.\" Do you agree with the court's decision?"},{"comment_id":"10154949382818010","commenter_b":"Amen Danny. This Ed guy is Obamas gay boyfriend.","commenter_a":"Where do you think they learned that from? Very close ties to the Obama administration, and of course, \"we're with her\" too.","post_message":"You're not supposed to say, “I think we broke the law,\" even in internal emails, according to the lawsuit."},{"comment_id":"10153075277316770","commenter_b":"This hag is despicable,","commenter_a":"anything that comes out of this woman's mouth is bullshit just saying","post_message":"Debbie Wasserman Schultz says Republicans \"alienate women, alienate the LGBT community... [and talk] about it at their debates. Kicking immigrants out of this country, talking about taking away healthcare from Americans, talking about which candidate is worse for women and take their healthcare away, deny their rights, oppose equal pay for equal work.\""}]
