[{"comment_id":"10153640202729740","commenter_b":"check the last couple of videos I put up here.","commenter_a":"If cops weren't being abusive, murderous filth, then people wouldn't be this worked up...","post_message":"Protesters were captured on camera yelling \"pigs in a blanket, fry 'em like bacon\"."},{"comment_id":"1681074165464529","commenter_b":"All the deplorables need to donate a brick for the wall with their name on it for the illegals to see who wants them gone....","commenter_a":"NO REFUGEES AND SEND THE ONES THAT ARE HERE BACK!!!!!","post_message":"Donald Trump LIVE! WATCH NOW     Best Conservative NEWS-----> Freedom Daily LIKE OUR PAGE!  Donald J. Trump Donald Trump For President #maga"},{"comment_id":"1032855700144015","commenter_b":"No one is looking to take away your guns, just like no one is looking to take away your car.","commenter_a":"Taking guns away from citizens violates our rights. Criminals will be the ones with guns. I have a hard time understanding why the hell people dont get this!!!!","post_message":"Nearly 50 years ago, Robert F. Kennedy made an appeal for gun control in Oregon -- just miles from where the recent mass shooting at Umpqua Community College occurred."},{"comment_id":"967810213254438","commenter_b":"Phony bitch","commenter_a":"Good new Ian you can now give blood from your arm instead of your B-hole. Joe Mark and @username can give you a ride","post_message":"There's still a lot of controversy around this."},{"comment_id":"1632165196804485","commenter_b":"@username how are we snowflakes if we don't want to hear the opinion of some feminist being sad about a pipeline when there are thousands already in this country. To the other side of the wall for you.","commenter_a":"Unfollow.","post_message":":("},{"comment_id":"10153947614518855","commenter_b":"They have tiny dicks lol","commenter_a":"@username @username she was a grindho","post_message":"Surprised?"},{"comment_id":"1378443058862829","commenter_b":"SHES WAVING TO THE CROWD YOU ASSHOLES..","commenter_a":"Conservatives suck","post_message":"Wait till you see what she appears to be saluting."}]
