[{"comment_id":"10152859256761051","commenter_b":"Sick ! Needs the same done to her !","commenter_a":"They all deserve prison for life without parole!!!","post_message":"The judge looked this grandma in the eyes, called her the most evil person he had ever met and sentenced her to 4 life terms."},{"comment_id":"716711075186137","commenter_b":"Then go back home. Get out of America. We don't want you Islam or Sharia law.","commenter_a":"If that is what they want, I would assume they would be buying airline tickets for a flight back to a Muslims country.","post_message":"Muslims Try To Pass Sharia Law In Alabama So Citizens Do THIS.  We live under the law of the constitution. They are taking a stand.   Do you support these patriots?"},{"comment_id":"10154019133956045","commenter_b":"Ronald Collier","commenter_a":"They could have let this woman get a ride home,,, or even took her home.. she wasn't on the road at the time.. where is the love in this world? I bet she was writing an unbiased story about the council meeting discussions..","post_message":"A Franklin County teacher has been arrested while working at a second job."},{"comment_id":"10154568442846336","commenter_b":"Stupid","commenter_a":" him","post_message":"During a press conference, Secretary of State John Kerry suggested the media should stop covering terrorism \"quite as much.\" @webpagelink"},{"comment_id":"685418174982094","commenter_b":"Why don't they take those liberal bitches off the air","commenter_a":"These women need to think before they speak","post_message":"The View is going to be taken off the air after host says this about candidate on live TV. This show is disgusting liberal trash. Put an end to the show already. Can we get 100,000 'LIKES' to have The View cancelled?"},{"comment_id":"10152651937258067","commenter_b":"You're wrong. Red letters mean it was quoted, a parable told by Jesus. If you don't believe the Bible Stephanie Morris, that's fine. But you can't question why a church would make a decision if you don't believe in the book that the church is built around.","commenter_a":"Question is, why did that church invest in money-changers? What would Jesus think?","post_message":"A church in Indianapolis claims JPMorgan intentionally mismanaged church funds and only cared about maximizing fees. @webpagelink"},{"comment_id":"1204331449626601","commenter_b":"Lol","commenter_a":"I know I probably shouldn't but I find this diabolically hilarious.","post_message":"Someone sneaked up behind him  (via Daily Mail Australia)"}]
