[{"comment_id":"218545795283614","commenter_b":"Children in poor areas should not be doomed to poor schools.","commenter_a":"Yes, The GOP has lost every bit of self-respect they ever had. To vote Betsy DeVos in as education secretary with no educational experience is just irrational. If Betsy were smart she would decline the office and get the hell out of town now. She will not survive as educational secretary.","post_message":"Republicans just sold our public schools to the highest bidder.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"632098943657535","commenter_b":"Stank bitch","commenter_a":"Wow!","post_message":"Oh Really? Kim Burrell Preaches a Hateful Sermon About 'Perverted' Homosexuals -- Days Before She's Scheduled to Appear on Ellen DeGeneres [Video]"},{"comment_id":"10152584446122014","commenter_b":"No money for illegals!","commenter_a":"He's not an immigrant. He's a POS rock-throwing illegal alien coyote that's had 14 prior incidents with the border patrol.","post_message":"The judge ruled that the officer was not justified in opening fire on the immigrant who was crossing illegally into Arizona."},{"comment_id":"814364195330989","commenter_b":"Do that shit over here!","commenter_a":"and they wonder why most of Americans don`t want them here,Trump is right.Not all muslims are killers,but how would we know>?","post_message":"VIDEO: This is What Muslims Did in The Streets After Orlando Massacre…"},{"comment_id":"968324823259627","commenter_b":"Bitch please","commenter_a":"This is ridiculous! Trump can beat Hillary or Bernie with one arm tied behind his back. America has made their choice. No more corrupt, lying, manipulative, smooth talking politicians. We want our country back! We have a real shot with Trump, and we're not going to be tricked any more.","post_message":"“Let me be clear on one thing tonight. This campaign is just beginning,” Bernie Sanders said. “When we come together, and don't let people like Donald Trump try to divide us, we can create an economy that works for all of us and not just the top 1 percent.\""},{"comment_id":"10153651600041323","commenter_b":"Because she's British William!!!!","commenter_a":" for rent for the big fat cunt to have axcess to a private pool what other perks did the rest have its just away of mugging the goverment and dickheads for money charity begins at home.","post_message":"“I’m a mother. My heart bleeds. Just because we live in a poor area. Is this what they want to do with us? The government don’t care. Nobody will listen. They don’t care about us. Only God cares.”  It is six weeks since Kids Company abruptly closed its doors; since then several inquiries have been launched but little has been heard from the people who once relied on its services."},{"comment_id":"606361476221098","commenter_b":"WAKE UP AMERICA! The racists in our White House have no intentions of getting out. *Note* the race baiting going on now and the targeting of police departments. Obama is trying to start a race war so he can federalize law enforcement and declare Marshall Law so he can stay in office. Too many Americans are distracted by gay marriage and flags to pay attention to his real agenda. Look how he has the South stirred up... he knows that's his biggest problem, freedom loving, gun carrying Christens he knows will defend their rights! GOD HELP US ALL!","commenter_a":"Good grief! What do these people want! I have been picked on and had blacks make racist remarks to me all my life! I just keep on keepin on with the Lord! She only feels inferior because she wants to and as usual the whites get the blame!","post_message":"Controversial video just leaked that shows what Michelle thinks about white people.  This is extremely offensive. We need to spread this, and show the country she's a racist.  Do you agree Michelle Obama is the worst first lady ever?"}]
