[{"comment_id":"10154278123559497","commenter_b":"so sorry, I hate seeing girls do this to gay guys","commenter_a":"As a gay man, this was the majority of high school. Being dragged along by my female best friend. Apparently as a gay guy I was supposed to Enjoy whole foods, Bloomingdales, frozen yogurt and Mac lol. Also always being asked for advice by every girl on guy issues.","post_message":"\"You just never know where the day is going to go with Paul.\""},{"comment_id":"10153115741995950","commenter_b":"That is BULLSHIT there terrorist right now in AZ 1out of 4 children are starving obama cant feed and house. Ours so what the hell he is gonna feed and house them. You hate the US you love terrorist get the hell out of here","commenter_a":"Good!","post_message":"NEW: The U.S. is preparing to accept at least 10,000 Syrian refugees in the next fiscal year, which begins in October."},{"comment_id":"941978015839539","commenter_b":"I do like a chick with a beard...","commenter_a":"Hi I am Jessica. I am 17 years old. Inbox me and I'll compromise your account passwords and/or bank account.","post_message":"Penned on sheep skin, this document will have a major impact on the way we view Islam."},{"comment_id":"1801777286727036","commenter_b":"She won't get paid for this job","commenter_a":"Kellyane Conway you are a pollster and not a campaign manger and it is showing. You have never been part of a winning national campaign your whole political career, and with Donald \" The Crook\" Trump it looks like your record will be kept intact. Your only hope is that everyone has missed this army of Donald \" The Crook \" Trump supporters out there that just can't wait to vote from Donald \" The Crook \" Trump. But the only factual data that we have right now is early voting numbers,and so far Hillary Clinton is leading in the battle ground states including Florida,if Donald \" The Crook \" Trump looses Florida it is ball game over, he will never reach the 270 electoral votes to win the election. He has to win Florida, North Carolina, Colorado, Nevada, and turn a blue state or two red. I guess anything ...","post_message":"\"Apparently the Hillary Clinton team is playing follow the leader, with us in the lead.\"  -Kellyanne Conway"},{"comment_id":"10153540355058984","commenter_b":"It's not just abortion Drs. all Drs. Make obscene salary's. Abortion should only be for rape victims, incest victims !","commenter_a":"it wont do them any good in HELL!!!","post_message":"Here's something shocking that Obama and His Planned Parenthood cronies will not like.   Do you consider these outrageous abortion salaries \"blood money?\""},{"comment_id":"10153766225688132","commenter_b":"the laws about women showing constant pictures of themselves naked have to change, really sick of seeing all her plastic body parts.","commenter_a":"Please change yourself first phony woman","post_message":"\"These gun safety laws have to change!\" - Kim Kardashian"},{"comment_id":"965589516846855","commenter_b":"Rubbish. MUSLIMS are 90%terrorist","commenter_a":"If someone calls themselves a Christian and then goes and shoots people at a movie theatre, are you going to then say all Christians are bad? The thing is, all Muslims are not terrorists. My fiance is a Muslim his family are Muslim but they are not terrorists. Why should he have to wear a badge and be watched when he did absolutely nothing. Terrorists do not have a religion they don't have a \"look\" anyone can be a terrorist and saying we should badge all Muslims is just plain hate.","post_message":"\"Being Muslim doesn't make me any less American than you are,\" she wrote in a letter to Donald J. Trump that's now gone viral."}]
