[{"comment_id":"10153233984390950","commenter_b":"Did you think women are incapable of evil","commenter_a":"And the people who are saying the women and children are safe, check out who blew herself up with the suicide vest","post_message":"Police give update on raid near Paris: • Woman wearing explosive suicide vest blew herself up • 7 suspects taken into custody; 2 suspects dead • 5 officers reportedly injured; police dog killed"},{"comment_id":"10157525764140293","commenter_b":"These people need to back off, no one understands the loss of a child much less one that is missing and not knowing if the child is alive or dead...this is their way of dealing...let them alone..","commenter_a":"I can't imagine how you go on with the uncertainty of their situation. The banner isn't hurting anything. Empathy is what's needed here.","post_message":"FEEDBACK: The parents of a child that's been missing since 2011 just want her back, but their plea is apparently someone else's eyesore.  What do you think about the way this is being handled?"},{"comment_id":"10154054920697093","commenter_b":"Just let this crazy lady live in her imaginary world.","commenter_a":"I feel the closet racists gathering on this post.","post_message":"Small protest happening now at the old Tarrant County Courthouse in response to the Fort Worth viral video arrest. bit.ly/2hYduuA"},{"comment_id":"1335636243169794","commenter_b":"Im tired of this bitch","commenter_a":"Yaneka Davis @username @username 😂😂😂😂😂","post_message":"She's calling out Kylie Jenner!  #WSHH #CatchMeOutside #KylieJenner"},{"comment_id":"10154989881801037","commenter_b":"She's a douchebag!","commenter_a":"Lol good","post_message":"Do you agree with this university's anti-Kim Kardashian West request?"},{"comment_id":"796156163908294","commenter_b":"Yeah and make all those fat bitch bags move to another country","commenter_a":"No one watching it anyway put whoopi on a plane","post_message":"'The View' Made THIS One Fatal Mistake, And Will Likely Be Shut Down Because Of It  Good. Get this liberal trash off the air. We've had enough.  Would you be happy to see the View get thrown off the air?"},{"comment_id":"10153677619074641","commenter_b":"Radicalism is one of the biggest problem for all countries and all societies. If you say radicalism or terrorism is related to a religion, it is completely wrong . You can see a lot of samples from history. The important point here is why radicalism has raised within last ten-twenty years. One of the answer of this question is imperializm. USA has raised terrorizm and radicalism on the world , africa, middeeast. ( Iraq, Libya invasion , bombing , killing more than 1 million people ) . USA has really created huge chaos in middleeast and destoyed Iraq. So ISIS has came up there . Terrorizm in middleeast is not religion issue . If USA and other countries had did same thing ( bombing , invasion, killing , creating chaos continuosly) at another part of the world during years, you would see similar terrorist groups there. So in order to ...","commenter_a":"Why ISIS hates France so much ? @webpagelink","post_message":"French President Hollande: \"We are at war -- a war against terrorism.\"   More: @webpagelink"}]
