[{"comment_id":"10154487307161336","commenter_b":"Unfortunately, Hillary and company think they are above reproach. She is doing the \"granny good witch\" routine for awhile and the cutesy lovers are falling for it. Did they honestly forget that Bill is a womanizer and she has ruined the lives of the women he was involved with? Barbra Streisand made a comment, \"We didn't elect the Pope\" and that tone of morality has taken its toll,","commenter_a":"Amen to that!","post_message":"\"If they can't control their own email maybe they shouldn't be controlling the state secrets of the United States.\"  Today on \"FOX & Friends Weekend,\" Mike Huckabee talked about how the hacking of Democrats calls into question national security. @webpagelink"},{"comment_id":"10153543401066336","commenter_b":"You illegal aliens need to self deport along with your anchor babies!!! Get Out!","commenter_a":"\"Mr. Trump's statements are offensive to all Latinos, but especially to the undocumented community,\" said Bertha Sanles, who has lived illegally in Miami for 14 years. \"Trump is focused on promoting hatred and ignores the positive economic contributions we bring to this country.\" You know what, become a citizen so you can vote.","post_message":"A resolution to condemn Donald J. Trump's remarks about Mexican immigrants failed last night to win approval of the city council in Doral, Fla."},{"comment_id":"901951363197946","commenter_b":"Does this Kate Hopkins woman realize how ugly she is?","commenter_a":"i think thie so called woman shoudl keep her many nasty comments too her self ,she must have a very unfilled life ,becuase she comments and has ago at everybody ,stut up Katy Hopkins .","post_message":"Kelly Clarkson admits she didn't even know who Katie Hopkins was  (Daily Mail Celebrity)"},{"comment_id":"10152744813956094","commenter_b":"What is your alternative, Scott?? Just curious.","commenter_a":"Liz Warren is pissed off. Anyone who •isn't• pissed off, isn't paying attention!","post_message":"Yves Smith shreds the the Obama administration's rebuttal to Elizabeth Warren's critiques of the secret trade panels proposed in the TPP and TTIP treaties."},{"comment_id":"1211910735512691","commenter_b":"Duck you you racist old bitch","commenter_a":"Stop drinking you juice head.","post_message":"This racist woman went off on two Hispanic shoppers with a racist rant  and no one did anything to stop her.  More on this story here: @webpagelink"},{"comment_id":"726868034170441","commenter_b":"It's our Flag. If it offends someone they need to look the other way until they LEAVE OUR COUNTRY!!!","commenter_a":"Fly high Old Glory!","post_message":"Texas man ordered to take down American flag because it offends Muslims. In our country we fly our flag. This is absurd. Do you think this is ridiculous?"},{"comment_id":"10152808578696130","commenter_b":"Sadly, I could post these articles about pitbulls all day long and never be finished","commenter_a":"The purebreds are a very dangerous breed. Statistics do not lie.","post_message":"\"This bill would make Mississippi the only state in the nation with a statewide policy discriminating against a specific dog breed, and the impact on local communities, animal shelters, and law enforcement would be disastrous.\""}]
