[{"comment_id":"10154380401494071","commenter_b":"Uh oh, there it is again \"Nasty woman\". But she is right.","commenter_a":"Hannity. Your rating might be high among poorly educated Trump supporters who love seeing you licking his butt.","post_message":"Sean Hannity railed against Joe Scarborough in defense of top Trump advisor, Stephen Miller."},{"comment_id":"10154662205964575","commenter_b":"Good she needs to be arrested!","commenter_a":"Yes this girl has done this before. She willingly is w him! She needs to be charged for running away over and over again. And it's her mothers vehicle. Something needs to be done!","post_message":"UPDATE: The teen at the center of the Amber Alert has been found safe, according to police.  --------------------- An Amber Alert has been issued for a for a missing 17-year-old girl who authorities believe is in extreme danger.   Police believe an escaped convict out of Hancock County, Dustin Fisher, 20, abducted the teen. Fisher is also considered a violent sex offender."},{"comment_id":"422148361459748","commenter_b":"Disgusting 😡 Hope they lose their seats next election! #CrookedBastards","commenter_a":"Continued disappointment!","post_message":"Republicans just sold our public schools to the highest bidder.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153544457476509","commenter_b":"Thanks","commenter_a":"Why are animals doing what animals do all of a sudden national news?","post_message":"What a catch! Hear photographer John Bailey describe stumbling onto the powerful sight of a bobcat pulling a shark from the ocean: @webpagelink"},{"comment_id":"972624222819497","commenter_b":"Go get her!!! We cannot have another 8 years of Obama's disastrous policies and her stupidity!","commenter_a":"*WE THE PEOPLE* HAVE SPOKEN, VOTED FOR OUR NEXT PRESIDENT @username.. KILLERY CLINTON NEEDS TO GO TO #HILLERYFORPRISON2016","post_message":"I am the only one who can beat Hillary Clinton. I am not a Mitt Romney, who doesn't know how to win. Hillary wants no part of \"Trump!\""},{"comment_id":"10153694731231955","commenter_b":"Awwww so sad, GO BACK TO YOUR FUCKING COUNTRY ,","commenter_a":"Oh nowvthey care","post_message":"Muslims feel intense backlash..."},{"comment_id":"10154840580075695","commenter_b":"Go Hillary!!!!!! Vote blue!!!!!!","commenter_a":"#voteblue","post_message":"People fainting, 3-5 hour waits in line and it's only day 1 of voting. Local elections officials say today was the biggest turnout they have ever seen for early voting in an election. @webpagelink"}]
