[{"comment_id":"10153854891839032","commenter_b":"Get guns out of the hands of THUG CRIMINALS and TERRORIST and problem solved","commenter_a":"Being around guns isnt safe... who would have though","post_message":"The study also found that in many self-defense cases, use of a gun didn't lead to a better outcome for the victim."},{"comment_id":"939447022776130","commenter_b":"1 Muslim + 4 wives = 32 children!!","commenter_a":"Our country has so many homeless families and so of these people would be so grateful to be able to benefit from a number of these programs, and not not offered to them. If we have the housing and benefits for foreign refugees than we have the resources to help our own citizens first. And the positive side to this, we won't have to worry about any of these people killing other Americans","post_message":"Michigan Gov Snyder, Senator Peters And CAIR Pushing For Huge Influx Of Muslim Migrants...Don't The People Have A Choice?"},{"comment_id":"274535909638816","commenter_b":"You are a sick women!","commenter_a":"What's even scarier is Californians that elect her again and again. I was having a discussion with a gent on fb he stated he moved out of the northeast because we were stupid. He stated he moved to the 2nd most intelligent county in the country.I took a wild guess and asked if the state would be California? Bingo! See how these people think. Scary","post_message":"HOLY SMOKES! NANCY PELOSI: Orders People to Clap, Repeats Words Then Calls John Kasich The Gov. of Illinois [Video]  This is embarrassing! She scolds the audience!"},{"comment_id":"10153974974065329","commenter_b":"Bye bitch","commenter_a":"My belief she is every bit as responsible of what that animal inflicted on the child. As a mother, you are to protect your child by any means necessary. Battered or not she bought that animal in her baby's life and chose him over her child. Save your hate post siding for the battered women of the world the only person I care about that needed defending is the child.","post_message":"Tondalo Hall will not be released early from her 30-year sentence in Mary Fallin's Oklahoma for failing to protect her children from her abusive partner. The man who actually harmed her child got just two years. (via BuzzFeed News)"},{"comment_id":"10154805398708812","commenter_b":"Ha ha. That'll teach them.","commenter_a":"George R. Sadler DW Adams","post_message":"Police in Southern California on the lookout for brazen thief who broke into a YMCA and stole fake cash from a toy register."},{"comment_id":"10157848946740389","commenter_b":"The People Must Protect the Republic, since DOJ and FBI are MIA! Trump wins in a landslide; however, the polls are a lie, and her rigging election must prove the lie! It's up to us to stop it, or America becomes just another Brazil. Infowars.com","commenter_a":"By hook or crook, ain't nothing on the books that we can't cook!","post_message":""},{"comment_id":"10158601678305354","commenter_b":"And don't forget while wearing a vagina costume ......","commenter_a":"it'd be cheaper just to say \"get the fu_k out!\" stupid leftists just cant bring themselves to be rude or nasty ... unless they are being rude & nasty to conservatives.","post_message":"Desperate."}]
