[{"comment_id":"10154752399793598","commenter_b":"They should be called feminazists","commenter_a":"So true!","post_message":"200 Million Girls Killed in China, Where Are the Feminists?"},{"comment_id":"10153385478086756","commenter_b":"Real women do what they want to do. Feminism is about equality not which activity you prefer to do.","commenter_a":"real women go outside and play.","post_message":"Maddie found that in many video games, she could unlock the female characters by playing the game and amassing credit, but that could take hours. Or she could buy the character. On average, the female character cost $7.53."},{"comment_id":"1190989584254403","commenter_b":"Abortion is legal in this country. If you have to murder physicians who perform a legal medical procedure, heavily edit videos to try to discredit an organization that is doing nothing illegal and burn down their clinics, then who is really the violent killers and terrorists here? All in the name of Christianity? Not my Christianity certainly. Reminds me of the middle east, however. Islamic terrorists/Christian terrorists. There is no difference when you cross the line into violence.","commenter_a":"Damm","post_message":"\"It's deeply disappointing that we still see the kind of hateful rhetoric in our state that fuels this kind of violence.\""},{"comment_id":"836657323038276","commenter_b":"She didnt get in trouble for the see through top. She got in trouble for her shoulders. Even if she did wear a shawl over it, it would still show the see through part","commenter_a":"I agree with the school","post_message":"Take a close look."},{"comment_id":"1485464441513680","commenter_b":"ASICK woman needs to be jailed","commenter_a":"Hang them both!","post_message":"What kind of woman could do this to her own child?"},{"comment_id":"1563567157272928","commenter_b":"Stupid ass motherfucker","commenter_a":"way to go rosie, now evryone knows why trump treats you like he does. you usless POS. Done let the door hit you in the ass on the way out. if Canada doesnt want you, please dont come back","post_message":"Rosie O'Donnell just restarted an epic feud."},{"comment_id":"1187297661307572","commenter_b":"@username well, fair enough. Lol.","commenter_a":"The comments here have be idiotic, as I expected. Most likely, this was an attack due to their religious identification. I love how when the victim is not Muslim, these (commenters here) jump to radical Islam. However, when a Muslim is the victim, they want to wait for the facts and not jump the gun. Can't have it both ways.","post_message":"Shot in the back."}]
