[{"comment_id":"944224732371213","commenter_b":"Yeah, she didn't want to have sex with an Orange baboon.","commenter_a":"I guess Trump would know a lot about attitude. He has a very bad attitude and has the emotional age of three!","post_message":"\"She gained a massive amount of weight, and it was a real problem. We had a real problem. Not only that, her attitude,\" Trump said Tuesday morning."},{"comment_id":"575161529335569","commenter_b":"That sick women will never be fine ! Who you kidding !","commenter_a":"Why is this such a big deal? After some rest, and antibiotics she will be fine.","post_message":"Is Hillary Clinton just run down, or is it more serious?"},{"comment_id":"726868034170441","commenter_b":"It's our Flag. If it offends someone they need to look the other way until they LEAVE OUR COUNTRY!!!","commenter_a":"Fly high Old Glory!","post_message":"Texas man ordered to take down American flag because it offends Muslims. In our country we fly our flag. This is absurd. Do you think this is ridiculous?"},{"comment_id":"10153268633329197","commenter_b":"They are all dangerous!","commenter_a":"She was a nurse and still went tanning? I'm confused. Surely she knew it was bad","post_message":"This Alabama nurse was an avid user of tanning beds, sometimes going 5 times a week! Now, she has developed skin cancer and she wants to help stop others from getting the disease. See the graphic way she shared her story --->  @webpagelink (WARNING: this story contains graphic content)"},{"comment_id":"560732980781661","commenter_b":"GOOD, SHE IS SUCH A RACIST, GET HER OWN SECURITY.","commenter_a":"Good for them let her pay for the security and take a little less pay home...she'll get the message","post_message":"HAHAHA!!! THIS NEEDS 10,000 LIKES!!!"},{"comment_id":"10153376704131051","commenter_b":"Someone needs to beat her the same way","commenter_a":"Dear God in heaven. God bless this poor child.","post_message":"Officials couldn't believe that someone would treat a child like this."},{"comment_id":"10153185005136323","commenter_b":"@username how can you possibly call immigration colonisation? I am an immigrant to this country and I have no intention of imposing my way of life on every person living here or subjugating the \"indigenous\" people of this land. I think I can speak for the vast majority of immigrants in saying that they also do not intend to do so. Most immigrants integrate into society. Perhaps you just don't like the way they look like. As was stated before, Britain is 85% white. All these people fearing that this country is swamped by brown and black people, Eastern Europeans and other pesky foreigners need to get their facts together. Moreover, study after study has proven that immigration is indeed beneficial to the British economy. We may also not forget that Britons emigrate to other countries in large numbers. This is not a one way street. Immigration is part of ...","commenter_a":"For a country whose language is a mix of old german, latin and celtic language, i'm laughing. In the past, Brits never had any issue with colonizing Australia our the US and imposing their culture (or \"civilization\") to the native populations. That's so ironic !","post_message":"A quarter of Britons think the government should encourage immigrants and their families to leave. That's people like Mehdi Hasan. He argues that while hostility to outsiders may not be a new phenomenon, the so-called immigration debate is now toxically out of control. Anti-immigration sentiment isn't a result of increased immigration, but fear and prejudice  Meera Syal: Growing up between cultures is tough – until you realise it’s a creative blessing: @webpagelink"}]
