[{"comment_id":"614623428725949","commenter_b":"Should of shot the bitches in the fu$king faces, enough of this shit with these animals","commenter_a":"They are racist.","post_message":"Burqa-Clad Muslims Sue For “Racist” Treatment… Get a RUDE Wake Up Call"},{"comment_id":"1514259995548132","commenter_b":"... People do realize the article isn't about humans right? None among us can store the seminal fluid of various males and asses it for quality before choosing our baby daddy's, just FYI. ;)","commenter_a":"Rachel Pratt :)","post_message":"There's more to semen than just sperm."},{"comment_id":"1384042331652908","commenter_b":"Good on ya.","commenter_a":"I stopped looking twenty years ago and saw my best friend and \"soul mate\" even though I know that souls are just a fantasy, right in the mirror. So me and my self became best friends and I haven't needed anyone in my life since then. I've been happier, I bought two homes in the last twenty years, and the freedom from the male drama is the best feeling in the world!!!","post_message":"As one writer points out, we spend endless hours wishing for, praying for, begging for our soul mates – that person who will finally make all the suffering worth it. But I’m here to tell you a little secret."},{"comment_id":"10154997880686350","commenter_b":"Congratulations ...but women have babies every day...","commenter_a":"Kristen Howarth Scott","post_message":"Big sister-to-be Blue Ivy is just the cutest!"},{"comment_id":"10152619754670950","commenter_b":"So than move Israel and let him be your leader, see ya, we don't need ya!!","commenter_a":"The only backlash is from the white house... I welcome him anytime.","post_message":"Israeli PM Benjamin Netanyahu is going forward with plans to speak to Congress next month @webpagelink"},{"comment_id":"1137064162981260","commenter_b":"Mold on the apple","commenter_a":"Grrrrrreat. *head desk*","post_message":"A huge new study has confirmed that we are in the middle of an extinction event, the likes of which hasn't been seen since the dinosaurs went extinct."},{"comment_id":"1450281048346082","commenter_b":"@username why don't you then? Rather than complaining? You are angry because women are doing exactly that for themselves but they aren't doing it for you?","commenter_a":"Machism means feminism...no extreme is good...Breast cancer has 10x more funding and support than prostate cancer (for equal mortality), there are more men incarcerated than women, men spend more time in jail then women for the same sentences...Men also suffer from inequality and starts from birth: life expectancy is lower than females and seems to be genetically driven (extra Chr X seems to provide some protection)","post_message":"Do you know what machista means? The hashtag #EsMachismo started trending, and these 21 tweets explain a lot. - Alicia E. Barrón"}]
