[{"comment_id":"10153345798428717","commenter_b":"@username Sweet cheeks maybe you should learn about history rather than remaining ignorant @webpagelink","commenter_a":"Be happy Manchester, your taxes won't get raised beyond the cap.","post_message":"#BREAKING NEWS: The unofficial final results in the Manchester mayoral race are in. Incumbent Ted Gatsas defeats challenger Joyce Craig by 75 votes. -- @webpagelink"},{"comment_id":"10153384887696491","commenter_b":"Forget you guys, she doesn't go out with peasants from the first lion order..","commenter_a":"@username yo daisy might be there when it opens","post_message":"Prepare for a smaller world at Disneyland"},{"comment_id":"1001534043242046","commenter_b":"Nice thought but it's an AMERICAN FLAG on a WHITE MAN'S PROPERTY that's also a VETERAN. Need I say more Nick as sad as it is he is still defending his FREEDOM, his CONSTITUTIONAL RIGHTS, the AMERICAN FLAG and this ONE NATION UNDER GOD.","commenter_a":"I just hope he called the cops because it could be a hate crime, and its attempted arson,","post_message":"Marine Vet Who Flown an American Flag in His Front Yard for 15 Years Wakes Up to a Sad Sight:  Can They Do That? (VIDEO)  PROUD AMERICANS ARE UNDER ATTACK!   @webpagelink"},{"comment_id":"902522343195539","commenter_b":"Smart pooch 😂😂😂","commenter_a":"Krissy Maree","post_message":"This Great Dane's having a Great Time on a trampoline.  Video: Jukin Media"},{"comment_id":"10153553698421323","commenter_b":"I'd rather be surrounded by happy refugees , than miserable right wing morons.","commenter_a":"Have you seen most of these refugees? Not the kind of people you want living near you. They've already turned many areas into hellholes for the residents.","post_message":"\"Anyone who tells me Germany is full up, or that we can’t afford them, I say think of our past, and of the future. Of course we can afford them – we’re a rich country, and we have a duty to help those in need.”  The German mayor desperate to welcome immigrants to his town."},{"comment_id":"856127001183895","commenter_b":"Did Japan apologize for pearl Harbor, Bataan, and the rest of the atrocities committed by the Japanese military?","commenter_a":"Did Japan apologize foe pearl harbor","post_message":"Castro criticizes President Obama for not apologizing to Japan during a trip to Hiroshima in May."},{"comment_id":"838126822975658","commenter_b":"I think it is very interesting when you look closely at all the photos of the refugees....you men, military age. ISIS? Muslim Extremists? Frightening to say the least.","commenter_a":"It is with glee and satisfaction i'm watching Europe's descent ito Islamic morass.They want to replace 6 million killed Jews with 40 million Arabs. Europe's punishment is Islam.","post_message":"\"Generous welcome by Germany created a strong magnet to bring millions of migrants from Asia and Africa to Europe.  This is sheer madness and it is dangerous,\" says Daniel Grynglas."}]
