[{"comment_id":"786579818199262","commenter_b":"He SUCKS DICK..........","commenter_a":"Dangerous would be the truth.","post_message":"BREAKING: Obama Makes Sickening Announcement, This Will Cost Lives  He will ruin this country before his term is up.  Do you think Obama is reckless?"},{"comment_id":"10154034099273855","commenter_b":"I can't say anything to them they haven't already been told. I simply want to send them all a HUGE middle finger and kick in the ass!","commenter_a":"The sad face of intersectionality.","post_message":"Yes, Virginia, there ARE out Republicans."},{"comment_id":"1053358344760417","commenter_b":"shut our borders to any and all refugees ! whats wrong with you ?","commenter_a":"I'm seeing some really terrified Americans making terrible accusations about Syrian refugees .. people who are fleeing from terrorism themselves. I'm finding your people somewhat heartless and they sound from my perspective to be violent and racist themselves... No different in fact than the terrorists that have become their perpetrators. This is what fear does to people.. Aggressive behaviour .. We are so much more than this. I felt so sad when I read the response to Obamas humanitarian speech. So sad that you people have such fear and hatred inside you. This attitude of hatred and intolerance against people you don't even know personally will never make a better world. It just perpetuates the same old story. I feel Sad. Very very sad today.","post_message":"\"Many of these refugees are the victims of terrorism themselves – that's what they're fleeing. Slamming the door in their faces would be a betrayal of our values.\"  - President Obama  Watch more here: @webpagelink"},{"comment_id":"10153745171813837","commenter_b":"She lied. There's a difference.","commenter_a":"Far more honest about her mistakes than Hillary Clinton.","post_message":"MRS. TRUMP: Melania Trump announced Thursday that she took down her website, acknowledging that it contained inaccuracies."},{"comment_id":"10150875072404999","commenter_b":"Why should it always be hush hush? I was told by a lady that '' Your daughter loves to play sports. Make sure she doesn't mention her periods or say it hurts because her coach will kick her out especially in our school district.'' She will still participate no matter what ,but y the taboo?","commenter_a":"All power to her to be able to compete with period cramps.","post_message":"An Olympic commentator turned to Fu Yuanhui, who was grimacing in pain. “It’s because I just got my period yesterday, so I’m still a bit weak and really tired. But this isn’t an excuse for not swimming well.”"},{"comment_id":"10153642525234411","commenter_b":"Para estar en un paisaje tan encantador vale la pena.","commenter_a":"PROOF THAT RUSSIAN TROOPS ARE FIGHTING IN UKRAINE @webpagelink","post_message":""},{"comment_id":"10154448995838812","commenter_b":"@username what makes her uneducated?","commenter_a":"And people seriously want to elect him president?!? Get a clue!!!","post_message":"New York's attorney general says he won't be deterred in pursuing the state’s case against Donald J. Trump and Trump University, just because the defendant is campaigning to be President of the United States."}]
