[{"comment_id":"10153881396091336","commenter_b":"It doesn't take rocket science to figure out the motive","commenter_a":"But it was probably just workplace violence.... We just don't know...","post_message":"According to police, here’s what we know about the #SanBernardino shooting: @webpagelink • 12 pipe bomb type devices were found in the home at the center of investigation • All four guns were legally purchased • The motive has not been determined • There are no credible threats at this moment   According to the FBI, here's what we know about the suspects: •  Male came back into the U.S. in July 2014  •  Female came to the U.S. on a K-1 visa under Pakistani passport"},{"comment_id":"10152981477461717","commenter_b":"Sissy bitch is not a word used to just discriminate against gays. Sheesh. Stop trying to be a victim.","commenter_a":"Donald Trump for president! Fuck that sissy bitch Anderson.","post_message":""},{"comment_id":"1307228812630479","commenter_b":"Yes! !!","commenter_a":"@username take Alice","post_message":"Thousands of purebred dogs from more than a dozen countries are competing at the annual Westminster Kennel Club Dog Show in New York.  See more photos here: @webpagelink"},{"comment_id":"10155183488410725","commenter_b":"He's an idiot and so is she. Standing there looking at him talk his crap. It's ridiculous.","commenter_a":"He's a freaking moron","post_message":"Kanye West's rushing the stage at last night's Grammys wasn't a joke after all, it seems----> @webpagelink"},{"comment_id":"10157615901290389","commenter_b":"What about the arrests of all those that beat up and tried to burn people alive?????","commenter_a":"The reporters should have asked the protesters if they had a job etc.........","post_message":"Breaking News: A suspect has been arrested in the shooting death of a protester during rioting Wednesday, Charlotte's police chief says."},{"comment_id":"10152961247876680","commenter_b":"That's you and your crowd... Dead and cut up babies sold for the meat market !","commenter_a":"I proudly stand with Planned Parenthood.","post_message":"The move dramatically increases the chances of a government shutdown fight in the fall."},{"comment_id":"1099626483393732","commenter_b":"RINO revolt began with Romney. We shall soon see a series of similar dogs.","commenter_a":"Ventura is a jackass!","post_message":"Someone other than Michael Bloomberg is considering a run for president.  Could this controversial figure make an impact on the 2016 race?"}]
