[{"comment_id":"1343888468964236","commenter_b":"What's Columbus Day? Idk that dude.","commenter_a":"Possibility of a historic windstorm close to the 54th anniversary of the Great Columbus day storm? Wow. The weather here just keeps getting crazier!","post_message":"There is a one in three chance of a “historical windstorm for nearly all of Western Washington that would be long remembered.”  Take today to prepare for possible power outages and have some extra supplies on hand."},{"comment_id":"10153396450126336","commenter_b":"So...?? How long will the free world tolerate this... We don't need another barbaric Nazi aggression...","commenter_a":"disgusting","post_message":"A worker at a U.S.-based chemical company in France was beheaded by terrorists bearing ISIS flags early Friday, authorities said."},{"comment_id":"10152852795208717","commenter_b":"@username -- if this Somersworth Daycare is any indication - its quite close to $5/hr over a week -- even for infants at 214/week divide by 5 = ~43/day, and more than likely >8 hr day in daycare as the parents have to work 8+hrs plus travel... @webpagelink","commenter_a":"Daycare rate in nh is $5 per hour. Google it and check the rates. Which I did a pathetic rate.","post_message":"Do you think $13.44 is a fair rate for babysitters?"},{"comment_id":"10152803478324877","commenter_b":"And so are you......","commenter_a":"Cosby is guilty.","post_message":"Malcolm-Jamal Warner Breaks His Silence On The Bill Cosby Rape Allegations. Read what the 'Theo' actor had to say about his TV dad.   Grio fam, is this a fair comparison for him to make? Sound off."},{"comment_id":"10153309653924614","commenter_b":"She doesn't love him if she's trying to take off his mask","commenter_a":"About time.","post_message":"A Baltimore mother is being praised after cameras captured her berating and smacking her son after reportedly seeing him throw rocks at police during the city violent protests.   wish I had more parents that took charge of their kids out there tonight, the police commissioner said.   Nearly 200 people were arrested on Monday after more than 140 vehicles were set on fire and at least 15 police officers were injured during the protests.   Read KTLA story here: @webpagelink"},{"comment_id":"918430954940350","commenter_b":"Just another pussy!!!","commenter_a":"Hell! Any firearm can be used to hunt.","post_message":"Bernie Sanders Plans to Outlaw all 'Non-Hunting' Firearms!"},{"comment_id":"10153203365116615","commenter_b":"your right she shouldn't be. she should be just shot!","commenter_a":"Good. She shouldn't be.","post_message":"Her baby was just hours old and still had his umbilical cord when he was found by a church custodian who heard him crying."}]
