[{"comment_id":"1070322423019079","commenter_b":"She will drag him down.","commenter_a":"I really thought she'd go Cruz. Kinda disappointed. BUT, if Trump or Cruz is the nominee, I can vote for either without holding my nose.","post_message":""},{"comment_id":"10153428206108984","commenter_b":"She needs prison time!","commenter_a":"As far away as possible","post_message":"Looks like this is coming back to haunt her...  Do you think Hillary Clinton needs to stay far away from the White House?"},{"comment_id":"10154976296372789","commenter_b":"@username Wanting President Trump to fail is wicked. I don't ascribe to that just as I did not ascribe to it when the right vowed to block the former president and cause him to fail. But seeking truth and speaking truth to power is not wicked","commenter_a":"The left will fail. Wickedness will not prevail.","post_message":"'What I don't like about what is going on now, is there is an absolutely frenzied and concerted attempt to delegitimize, sabotage and destroy the Trump presidency before it even started.\"  Piers Morgan believes that the mainstream media is fueling \"hysterical\" attacks on President Donald J. Trump, and it's fundamentally \"un-American.\" What do you think? @webpagelink"},{"comment_id":"439739816151059","commenter_b":"Last election, I voted democrat, for the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the ...","commenter_a":"Why the fuck is UW Cali giving her money? Naughty naughty.","post_message":"Three of her top political donors are Goldman Sachs, Citigroup and JP Morgan. Is there anyone left that still believes the shit politicians say?"},{"comment_id":"886419331393489","commenter_b":"Blacks have been raping, stealing and destroying everything they touch as long as they have existed and are still doing it today but t hey also never create anything. If you don't believe it just look at Africa that they are so proud to be from it hasn't evolved much from cave man days. So STFU Othello you racist douchebag.","commenter_a":"First of all not all black people shoot police, you have a bunch of crazy white people you can include, and also rednecks or countrymen use foul language and abuse women so are they considered thugs considering he said what a thug is ?","post_message":"TRUTH"},{"comment_id":"10154082437051051","commenter_b":"As usual she is lying.","commenter_a":"Wrongagain.","post_message":"Hillary Clinton says there's no question Obama will go down in history as a successful president. Is she right?"},{"comment_id":"1267659423273512","commenter_b":"JUST SHOOT THIS BITCH==PLEASE.","commenter_a":"SOMETHING TO THINK ABOUT -- do you know that Hillary will be bringing into the USA thousand of Refugees and Illegals just within the first year. ISIS has told the US that they will be sending in ISIS men and Rascal Islamic's in with them. Do you want to keep your family safe from the Radical Islamic's and the Illegals along with the threat of Sharia Law . Also the threats that the BLM has made to all Americans and Hillary is behind them also. Then you need to put your family first and vote for TRUMP . Because if you vote for Hillary you might just as well kiss your ass and the USA goodbye. We need to take our Country back Hillary has already proven that she is trying to destroy us. Don't forget our men in Benghazi and all the Email scandal and the Clinton Foundation . ...","post_message":"It's even WORSE than you thought!! @webpagelink"}]
