[{"comment_id":"10154420026498984","commenter_b":"If the white house puts up another fence to keep people of its lawn then its only fitting to build a wall to keep people from coming into the country","commenter_a":"I grew up 30 miles from the border of Mexico. You need to be there to understand. Most Americans are clueless about the Southwest.","post_message":"This was NOT what the journalist expected...  Do you think America needs a president with a tough immigration stance?"},{"comment_id":"1744722422438798","commenter_b":"Fkn pussy","commenter_a":"BS!!!","post_message":"College Kid Demands Counseling After Being 'Traumatized' By Seeing The Confederate Flag Sticker  Our society is getting out of control.  Do you think this is ridiculous?"},{"comment_id":"823419914360098","commenter_b":"Never,never forget the countless acts of murder she committed by her acts against her brothers and sisters!","commenter_a":"I work hard at forgiving. I just can't forget. God told us in order for us to receive forgiveness, we must forgive. That is a tall order in this circumstance. I am trying. It is up to God to cleanse her of this deed. I had to turn it over to him. I still will not watch any movie or show she is on or in.","post_message":"Jane Fonda has changed her tune. She apologized for her Vietnam photos.   What do you think? Better late than never, or too little too late? Should she be forgiven?"},{"comment_id":"1049118838444933","commenter_b":"Ross I'm quiet familiar with what you and others want, but that's not the way it is,especially me. I served this country for my beliefs and I'll be damned whether people like you like my opinions or not. One day when the liberals get their way and all the refugees and ILLEGALS are let in this country then maybe you may see what I'm talking about. Either way its not my problem, I've served my time and paid a life time of taxes and still paying. No I think Ross today's society are out of touch with reality is the problem.","commenter_a":"As an older person I've come to the conclusion you can't blame these young snot nose, entitled brats. This is the environment that's been created by the liberals, so everybody can feel hunky dory.","post_message":"She probably won't be too pleased..."},{"comment_id":"10153389153527169","commenter_b":"Don't despair. I have a niece named Gretchen. You are not alone! ;)","commenter_a":"Try being a Gretchen. I was literally the only one in my entire school all through k-12. I NEVER encounter tiny Gretchens but I'm only 31 so maybe there's still time?","post_message":"Is Your Name Going the Way of the Dodo Bird? (From OZY)"},{"comment_id":"1078684138859436","commenter_b":"How far out to sea is that wall going to stretch? Must be like that wall in Game of Thrones that can keep all the nasty people from taking to boats. Once Trump develops this wall technology he will make billions selling the idea to Europe and I bet they let him put his name on it in big gold letters!","commenter_a":"There will be no wall","post_message":"Thank you for the incredible amount of support last night- San Jose, California. I love you all - we will deal with the thugs & criminals -- we will build the wall --- and Mexico will pay for it!"},{"comment_id":"10154440121543525","commenter_b":"ARE YOU WITH NO SIN, MAYBE YOU SHOULD NOT THROW STONES AT GLASS HOUSES. YES MICHAEL JACKSON AND PRINCE MAY HAVE BEEN DRUG ADDICTS, BUT THEY WERE BOTH AN INCREDIBLE TALENT, AS WAS WHITNEY HOUSTON ON THE FEMALE SIDE. SHE UNFORTUNATELY WAS A DRUG ADDICT. BUT SHE HAD AN INCREDIBLE VOICE. BUT ALL I AM SAYING IS LEAVE THE JUDGEMENTS TO GOD, BECAUSE I AM SURE YOU ARE NOT WITHOUT SIN.","commenter_a":"Who cares, he was a drug addict just like Jackson. Both were not exactly someone to look up to.","post_message":"Ten years ago today, Prince performed what's been called the greatest Super Bowl halftime show ever -- belting out \"Purple Rain\" amidst a driving Florida rainstorm. #RIPPrince  WATCH HERE: @webpagelink"}]
