[{"comment_id":"10154339068600399","commenter_b":"@username keep drinking the kool-aid, Ms. Deplorable.","commenter_a":"As Trump himself is a serial philanderer, I can't fathom how he figures the presence of Gennifer Flowers would hurt Hillary. To me, it just proves that the Great Orange Misogynist sees women as pawns and does not hesitate to try to use them to hurt each other. He is the textbook definition of a male chauvinist pig.","post_message":"\"If dopey Mark Cuban of failed Benefactor fame wants to sit in the front row, perhaps I will put Jennifer Flowers right alongside of him!\"  Cuban is the leading skeptic when it comes to Trump's claims about his wealth."},{"comment_id":"967905263263639","commenter_b":"She needs to be in jail!","commenter_a":"No just you","post_message":"EPA Chief Reveals Her 'Trashy' Upbringing And What She's Sure All Families Did Pre-EPA [Video]"},{"comment_id":"1439256216084684","commenter_b":"I ONLY HOPE FOR THE PEOPLE OF MASSACHUSETTS SEE WHAT A PHONY LIBERAL DOLT SHE IS.","commenter_a":"Caught Red-Handed! Elizabeth Warren's Big Secret Just Got Exposed for All to See... @webpagelink","post_message":"Is Elizabeth Warren in political trouble in Massachusetts?"},{"comment_id":"10153268885327452","commenter_b":"COWARDS","commenter_a":"Nancy, you cannot be serious surely...better for who? It's always been dreadful since the concept of Zionism reared its ugly head and will never be any better only worse until Zionism is banished totally and the Palestinian people allowed to dictate their own terms. Israel should have no say in the matter, only the people who lived in Palestine and can prove it, no matter what their religion, should have the say in the reconstruction of Palestine. If squatters are to be repatriated whence they came so be it including Government ministers down to the last one of them.","post_message":"Mahmoud Alayan was fatally shot by an Israeli soldier while carrying a stone in his hand"},{"comment_id":"10152848525036749","commenter_b":"Happy bday!!!","commenter_a":"Happy Bday!!!","post_message":"Happy birthday to an amazing, inspiring First Lady."},{"comment_id":"10154289975556336","commenter_b":"She agreed to follow the dress code if she was unable to wear heels then she should have asked for an accommodation.","commenter_a":"Dress code violation..if you don't like the dress code find another job. I'd rather not wear pants to work, but I have to anyway because it's the dress code. Suck it up.","post_message":"Dress code violation or sexism?"},{"comment_id":"890384730998868","commenter_b":"They need to be sterilized so they can't reproduce themselves!","commenter_a":"Obama and Sharpton seeing this would say \" these fine young gentlemen were just defending themselves from her whiteness. She was in the wrong place at the wrong time and they have a right to do this. They were the victims here for the media was recording them acting like a bunch of crazy violent animals. So, in self defense, they mugged her and her cameraman. It's only fair after all since the white man has being doing this forever. Isn't that right Mr President, the most powerful man in the world elected by these white oppressors to be so? At any rate we believe these fine young gentlemen, who could after all be our sons, all deserve scholarships for 4 free years of college, extra food stamps, and free cases of colt .45 malt liquor each.\"","post_message":"\"Stop!\""}]
