[{"comment_id":"10153580518686749","commenter_b":"@username The narrative BARACK HUSSEIN OBAMA has been pursuing is based on twisted facts and a long standard hatred against liberty and against our Republic', which he calls it America. HILLARY CLINTON being in lockstep with him, and just like him, she also felt the need to go around the world and apologize for all the things we supposedly did in the past. Never mind of all the aid and the freedom many Democracies are enjoying because of us and the blood we shed for them. We helped them and still helping them not because we but because is our duty to all the Millions of American citizens who came from those places and all their loved ones who are still living there! So, instead of leading from behind, when will our Nation have a pious and righteous President, a Constantine, a Theodosius, a Justinian, who will not be afraid, ...","commenter_a":"You're the best president, I'm from England but thanks for everything you have done Obama, especially for the LGBTQ+ community.","post_message":"President Obama's final State of the Union is on January 12. Say you'll be watching—and join the conversation. @webpagelink"},{"comment_id":"1026494337483744","commenter_b":"#MakeWhiteAmericaGreatAgain","commenter_a":"How about instead of protesting they work on getting jobs and off the system. I'd love to go to the inauguration but I have a job and millions of people on welfare are counting on me every day to work so they can freeload.","post_message":"Unbelievable..."},{"comment_id":"10153641823407217","commenter_b":"Inbreeding for centuries and lack of education. Most Middle Eastern People are genetically incapable of being anything more than what you are seeing. TRUTH. Which is why we MUST contain them. Putin knows....it's why he is working to get them back home to their litter box...I mean sand box Islam is a political movement designed to install Sharia Law...He doesn't want the creatures No-one does. There is NO such thing as a Moderate Muslim- And BTW Zionist Jews are JUST as Bad.","commenter_a":"That's a stupid question! It got that way because Dick Cheney ordered George Bush to depose Saddam Hussein. All HELL broke loose after that.","post_message":"BBC Middle East Correspondent Jim Muir explores the state of the region he's covered for decades."},{"comment_id":"10153188449234087","commenter_b":"Go to jail!","commenter_a":"You should have called it a sin. We readily forgive those, just not mistakes.","post_message":"\"That was a mistake. I’m sorry about that. I take responsibility, and I'm trying to be as transparent as I possibly can,” Hillary Clinton told ABC News's David Muir."},{"comment_id":"932314590139215","commenter_b":"She's definitely covering her butt! It's all about the $$$$$$$$$$!","commenter_a":"Her check book should get a lot smaller after her nasty comments to all Americans. She just sunk her ship. Remember the Dixie Chicks comment?","post_message":"After 24 hours, Ariana Grande has issued an apology for saying she hates America.  And it's very bizarre."},{"comment_id":"10153664912304726","commenter_b":"There are Syrian refugees already there!!","commenter_a":"Yeah, let the refugees all live at the vatican. they got lots of money and plenty of room.","post_message":"The Vatican keeps out the throngs while the Pontiff urges the U.S. to open borders."},{"comment_id":"609058575939393","commenter_b":"Not only is she a bigot but she is a lying murdering greedy bigot!!!!","commenter_a":"NO HIL LIAR EE!!!!!","post_message":"Join me in MISSISSIPPI for a few minutes! It is time to MAKE AMERICA SAFE AND GREAT AGAIN!"}]
