[{"comment_id":"10152912093186749","commenter_b":"PUKE.","commenter_a":"PUKE","post_message":"This Valentine's Day, Nicholas and Dylan are finally able to celebrate their legal marriage. This is progress. @webpagelink"},{"comment_id":"10153187905664087","commenter_b":"If posting in the comment section of a facebook page is being \"involved in politics\" then we really are in trouble.","commenter_a":"For better reasons why we should have retention elections of these SCOTUS. Congress can't be trusted to impeach these first year lawyers in black robes!!","post_message":"#BREAKING: Rowan County Clerk Kim Davis was released from federal custody today and ordered not to interfere \"in any way, directly or indirectly, with the efforts of her deputy clerks to issue marriage licenses to all legally eligible couples.\""},{"comment_id":"886419331393489","commenter_b":"Blacks have been raping, stealing and destroying everything they touch as long as they have existed and are still doing it today but t hey also never create anything. If you don't believe it just look at Africa that they are so proud to be from it hasn't evolved much from cave man days. So STFU Othello you racist douchebag.","commenter_a":"First of all not all black people shoot police, you have a bunch of crazy white people you can include, and also rednecks or countrymen use foul language and abuse women so are they considered thugs considering he said what a thug is ?","post_message":"TRUTH"},{"comment_id":"10154566492298812","commenter_b":"@username you keep drinking the kool-aid","commenter_a":"If you can't emotionally tolerate a black man reaching for his ID and you pee your pants like a 9 year old girl scout, and you shoot him without ever seeing a gun, it's time for you to take off the police uniform and get a job where you will not be harmful to human beings and to society.","post_message":"Pres. Barack Obama: Attacking police officers, even rhetorically, does \"disservice to the cause\" of criminal justice reform. @webpagelink"},{"comment_id":"1700232733582570","commenter_b":"Lose with Cruz.... I like it","commenter_a":"Having recently switched parties for \"one day\" Republican status I will vote cruise to stop Trump in April 26 Pennsylvania primary then probably vote for Hillary in November. Question: what is the brand of the dress Nicole Wallace wore today?","post_message":"Joe and Mika are here to discuss the state of the 2016 race following the Wisconsin primaries – and much more! #24Live"},{"comment_id":"1170305866326090","commenter_b":"@username you are the number one reason for birth control!","commenter_a":"I'm so glad they had a chance to speak about their loss. Some people don't care that lives were lost because they want to be so against a movement they can't possibly understand.","post_message":"These mothers who've lost their black children to police brutality and gun violence had a powerful moment at the DNC."},{"comment_id":"992964070763341","commenter_b":"well you know... some women have it...some don't... (but i agree with your message)","commenter_a":"She's got a boyfriend and I haven't","post_message":"She attacked her boyfriend in a drunken rage because he refused to have sex with her"}]
