[{"comment_id":"10150659306454999","commenter_b":"@username ..her lips not legs","commenter_a":"She is right, raising your arms doesn't mean a lot. Her getting multiple corporate donations to sway the way she passes bills does. U.S. Senator Bernie Sanders pointing out that every other politician does the same thing, and he is attempting to change the precedent does. What a lame attack from Clinton. This just made my opinion of her lower, not raise.","post_message":"Hillary Clinton also said that the candidacy of Donald J. Trump was a \"bad development for our American political system.\""},{"comment_id":"10153302071591051","commenter_b":"Sick bitch","commenter_a":"Make him a her!!!!","post_message":"First he raped a 10-year-old. Then he left her something to remember him by."},{"comment_id":"602448696614153","commenter_b":"Racist pigs","commenter_a":"@username CHILD RAPIST LOVER!","post_message":"President Obama holds his first news conference at the White House following the election of Donald Trump.  @webpagelink"},{"comment_id":"10152858682652411","commenter_b":"She should have been tazed!!","commenter_a":"I don't condone what the the officer did but the situation would've been completely different if the little brat did what she was told.","post_message":"Breaking News: The police officer whose video-recorded actions at a North Texas pool party have drawn national attention and comment has resigned from the police force."},{"comment_id":"10153596919524205","commenter_b":"Fuckdonaldbitchasstrump!!!","commenter_a":"Amanda Kovanis","post_message":"Donald Trump has been running a populist campaign, and during the Republican primary that has meant saying outrageous things to impress conservative voters. Will he change his positions when he becomes the Republican nominee?"},{"comment_id":"1231532310220572","commenter_b":"And male or not, you're a cunt","commenter_a":"The dirtbag can pick anyone he wants, Congress has no obligation to endorse the fascist's choice. Speaking of the Constitution. GOP won't be re-elected if they pass any nominee appointed by Ovomit.","post_message":"BOOM!"},{"comment_id":"10153478726962293","commenter_b":"Women don't drink beer?","commenter_a":"Cool, can they make beer tax free to even the score??","post_message":"\"Basically we are being taxed for being women.\""}]
