[{"comment_id":"10153812435979218","commenter_b":"Watch out these Fkn MUSLIMS WILL BURN THEY'RE WAY INTO TOWN!!!?? MAKW EVERYONE LEAVE!?? GOOD JOB SHO EVER LET THE BLOCK GET BUSTED !!!?? I'D LOVE TO KNOW HOW MUCH INSURANCE WAS ON IT!! POOR DAMM FIRE FIGHTERS FIGHTING FOR NOTHING!!! GOD BLESS THE AMERICANS. UNITED WE STAND!!??","commenter_a":"Yeah arson. Hmmm.","post_message":"UPDATE: More photos from SkyTeam 11 of a large fire that has engulfed the old Milford Mill Swim Club >> @webpagelink"},{"comment_id":"10153557846293984","commenter_b":"just leave her alone!","commenter_a":"For gosh sake's, get a life!","post_message":"Wow, just when you thought people forgot about Paula Deen's problems, this shocking photograph surfaces..."},{"comment_id":"1079209208779497","commenter_b":"She got them takin away bc of her psychological problems","commenter_a":"Run, mom, run. I was involved in a custody battle with my ex who had money and guess what? I lost!!","post_message":"Hillsborough Sheriff's detectives are asking for the public's help locating two missing twin girls who are believed to be with their biological mother who just lost custody of the girls."},{"comment_id":"10153664039221350","commenter_b":"Liz.....STFU!","commenter_a":"I am seriously sick of the name Caitlyn Jenner and anything with a Kardashian in it. How about reporting on something worthy or being considered interesting.. or a news story.","post_message":"\"I think about my life  and where I'm at in my life right now,\" Caitlyn Jenner told Matt Lauer. \"What a tremendous experience this is.\""},{"comment_id":"10154162076211943","commenter_b":"@username IF 60 % of conservatives and church goers stay home and do not vote. She will win. In 2012 they did not want to vote for a Mormon. SO they allowed a muslim sympathizer to stay in the White House.","commenter_a":"Lold she will just put it in Chelsea's name......","post_message":"The Boston Globe Wednesday demanded that Hillary Clinton shut down her family foundation if she wins in November because the entity \"will always look too much like a conflict of interest for comfort.\"  \"The Clinton Foundation is also clearly a liability for Hillary Clinton as she seeks the presidency,\" the newspaper said in an editorial. \"The foundation should remove a political  and actual  distraction and stop accepting funding.\" - via Newsmax"},{"comment_id":"10153773357374877","commenter_b":"WTF... Where I live... White people be blasting they music so cut the crap!","commenter_a":"Ugh","post_message":"Driving While Black: Cops drag black man from his car and Taser him for playing loud music.   Grio fam, this is wild!"},{"comment_id":"1032417423454977","commenter_b":"Plenty of bullets in Texas","commenter_a":"I have some extra rat poison","post_message":"After the state's next two executions, Texas will be completely out of its lethal injection drug."}]
