[{"comment_id":"1655285394531583","commenter_b":"Salty tears are most delicious. Is it January yet??","commenter_a":"A BIG thank you to the 53% of American registered voters who chose NOT to vote; because of YOU and only YOU, Donald J. Trump will be our next POTUS.","post_message":"This is the real reason Barack Obama is going against Vladimir Putin, two weeks before he leaves. This is what the mainstream media won't tell you. Make sure every American knows the truth."},{"comment_id":"10154323044371545","commenter_b":"I don't need to march with a bunch of femanazis' I'm fully aware of my rights as a woman and my freedoms as a US citizen - no one has tried to take any of those away from me except the last administration so I'm good MAGA","commenter_a":"I wonder how many women signed up to go to these marches thinking that they were supposed to be empowering women when it turned out just to be an anti Trump rally- so I would say that at least half of the women may be there for totally different reasons - which means the people who organized these marches were completely disingenuous","post_message":"Any DFW women make the trip to Washington for the #WomensMarch? If you did, Hannah Davis wants to hear from you. Share your pictures here."},{"comment_id":"1716977158581874","commenter_b":"You are a troll. Won't work here. Illegals will be deported en masse.","commenter_a":"@username I've been saying this for years. NOW, USE THIS INFO! If you state this info you will find more acceptance from the immigrants and especially the children who are now protesting you. For you will enlighten them and show them that they are being taken to the cleaners. The illegal immigrant is enticed to the USA. Have your people look this up.. The immigrant is being used and abused. The very children you see protesting you have no idea that the WELFARE they are receiving (and their parents are spending) is to be PAID BACK. Poof can be seen by how SSA is now taking retirement benefits from people (up to 15%) to pay back college loans. Loans that were taken out years upon years ago. Also if citizens received SNAP, TANF, Medicaid, or SSI they are paying back that money they received before retirement age by a lowering ...","post_message":"When illegal immigrant households receive far more in federal welfare benefits - than \"native American households - there is something CLEARLY WRONG with the system! Continuing this track will NOT MAKE AMERICA GREAT AGAIN! I will fix it, Crooked Hillary will not!"},{"comment_id":"1183433338419583","commenter_b":"@username Because they prefer her to Trump-- which is good.","commenter_a":"#HillaryClinton4President Bill Clinton's Presidency brought prosperity and economic stability leaving for the first time a projected surplus. George W Bush came along and reaped havoc on every financial sector, leaving millions losing their homes, Savings depleted and left America in the worst economic crisis since the great depression. Barack Obama won the Presidency and without any help from obstructionist Republicans, Obama saved America from another Depression and stabilized America's financial sectors. We need to Support and Vote Hillary Clinton for President of the United States to continue President Obama's Legacy and Policies, building on his successes and making America even greater than what it is. Republicans have been and continues to be America's Greatest Enemy! Twitter @sheriffali","post_message":"Bernie Sanders closes the gap slightly with Hillary Clinton this week following his victory in the Indiana."},{"comment_id":"10153057043503984","commenter_b":"Kick her dumb ass out of office!","commenter_a":"NO!!!!!! We the people need to come together and figure out what to do about these people. No one in Washington is.","post_message":"I guess she's revealing her true intentions behind becoming someone in power... I wouldn't want to live under her rule.  Do you think this new mayor should be allowed to put restrictions on the Constitution?"},{"comment_id":"904971426268782","commenter_b":"If they are illegels they can't vote cause they,are not citizens","commenter_a":"They most definitely, without a shadow of a doubt should not now or ever be able to vote! ONLY citizens of these great United States of America have the honor and privilege to vote in elections! Period! End of story!","post_message":"Last I checked illegal means illegal and you have no rights in America!"},{"comment_id":"10155029420463690","commenter_b":"Because women are more corrupt than men","commenter_a":"First Brazil female president now Argentina. Jealousy men and women hounding women for things they continue to let men get away with. Same with Imelda and Gloria from the Philipines and current S. Korea, India's Sonia Ghandhi, liberia's grandmother, Pakistan Benezir Bhutto female presidents/PM etc!","post_message":"Cristina Fernandez Kirchner, the former Argentine president, has been charged in a corruption case and slapped with a $630m asset freeze over public tenders awarded to a businessman friend during her administration."}]
