[{"comment_id":"10153541203558690","commenter_b":"She's a recovering alcoholic...... That says it all right there","commenter_a":"Living within your means should not mean living in a cardboard box or struggling to pay for minimum needs! What a selfish ignorant thing to suggest! Low wages determine the quality or lack of it in your life, it also means absolute lack of choice!! It absolutely sickens me to read the suggestion that if you are working and struggling it is automatically your own fault! Life happens and not always by our conscious choice! There are many many external influences that can alter your existence negatively! The American dream is a distant illusion for millions of people! In many instances through the greedy manipulation of conglomerates and the loaded banking system! Please don't give me the tired \" think and grow rich \" schemes! I am an old chook, I've known uber wealthy and the other end of poverty throughout my life! Wealth is mostly \" built upon the ...","post_message":"While the debate over minimum wage continues in the US, Emilia Stancati , a 50-year-old who has worked as a waitress for most of her life,  falls further into credit card debt as her  job fails to cover her bills.    Watch the latest episode of Hard Earned:   @webpagelink"},{"comment_id":"10154611725268445","commenter_b":"you are an idiot. I wish you were here right now bitch","commenter_a":"Natives don't want jobs just government hand outs","post_message":"Cannabis becomes the great equalizer and provides a level playing field for tribal nations, including those who did not benefit from casino's."},{"comment_id":"10154453619319030","commenter_b":"@username @username @username Kirsten Kolch Don't call her a bitch, but BUY YO BITCH SOME CHOCOLATE!!!","commenter_a":"Ching Lee Susan Ngo lmao so this is where I heard period sync","post_message":"Key & Peele is gonna teach you dudes something at Menstruation Orientation.  Watch the full episode: @webpagelink"},{"comment_id":"10153247400764614","commenter_b":"It's everyone's BUSINESS to make sure people like this Dispicable mother is prosecuted to the MAX extent.","commenter_a":"Mind your own god dam business people","post_message":"Disturbing video captures a woman hitting a crying 3-year-old in the face with what appears to be a tablet in a Victorville parking lot.  A man decided to film the woman, identified by police as 39-year-old Yvonne Camargo, after allegedly seeing her pull the child out of a Khol store by his hair.  The boy was examined for injuries by a sheriff deputy and officials plan to submit the case to the DA office.  Read KTLA story here: @webpagelink"},{"comment_id":"10153730746224087","commenter_b":"She oozes EVIL!","commenter_a":"He is right, nobody would accept this corruption if it was another man versus Bernie Sanders","post_message":"\"It’s not sexist. It’s true,” Donald J. Trump said, repeating comments he made Tuesday about Hillary Clinton. “If she were a man, she’d get less than 5 percent.”"},{"comment_id":"672876839554418","commenter_b":"@username that's a stupid comment. Hillary supports killing Gods baby's.","commenter_a":"Hillary would throw her own daughter under the bus to save her own skin! America look out cause Russia is getting pissed at her and sees Hillary as Obama as a white woman.","post_message":"\"11% of the American people say that [Hillary Clinton]'s honest and trustworthy. To compare that, the same poll found that 14% of Americans believe in Bigfoot. Now that's what kind of trouble she's in.\" – Mike Huckabee"},{"comment_id":"10153900355041378","commenter_b":"They are all crooked! This is what happens to women who try to play (and cause trouble) in the all boys club that is politics.","commenter_a":"Clinton should of appointed her to be her VP","post_message":"#BREAKING - One day after she was convicted of perjury and other offenses, Pa's Attorney General answers calls for her resignation. @webpagelink"}]
