[{"comment_id":"10153550726385575","commenter_b":"Idiots! !!!! GO TRUMP!","commenter_a":"Illegals have Togo . They drain our resources , disobey our laws , take our jobs. Trump is right. If you want to be in the USA do it right","post_message":"The Gateway Pundit - Jeb Bush Bashes Donald Trump After Debate – Defends Illegals (VIDEO)"},{"comment_id":"10155571867589062","commenter_b":"She's a thug communist married to a drug pusher.","commenter_a":"She's a Texan so I can't say anything bad about a fellow Texas gal.","post_message":"Beyonce will be performing tonight at the CMA Awards. Do you think she was a good choice?"},{"comment_id":"10154338923531955","commenter_b":"We need to send in our military to arrest these traitors in positions of authority who are completely ignoring the rule of law and committing treason in the process! This cannot be allowed To continue. Time for the people to raise our voices!","commenter_a":"Jury Nullification","post_message":"DOJ PROBE SHERIFF JOE..."},{"comment_id":"10153076244166336","commenter_b":"I could care less what that old cow at the head of the EPA says. Her job ends in a couple years. Clear out a stall.","commenter_a":"Pretty soon they'll be coin operated. $2.00 per 5 minute shower.","post_message":"The EPA wants hotels to start monitoring how long guests spend in the shower."},{"comment_id":"10154307345026729","commenter_b":"I am a liberal and I totally agree with the poster, so why are you irritated with liberals; your reasoning doesn't make sense to me.","commenter_a":"Or becoming traitors and taking over federal buildings!","post_message":"This will definitely irritate liberals and the \"coexist\" crowd"},{"comment_id":"10154024832271756","commenter_b":"Garbage men make a shitload of money. pun intended.","commenter_a":"I found a great way to pay off my student loans....after college I got a job","post_message":"The government estimates that some 41 million students together owe more than $1.2 trillion."},{"comment_id":"10154630388634877","commenter_b":"why is anybody still giving Conway any attention at all, unless it is because she is an alien from another planet?","commenter_a":"Ummmm, maybe because she hasnt done anything","post_message":"Is Melania Trump not getting enough attention for being an immigrant herself?"}]
