[{"comment_id":"10153209058106509","commenter_b":"Oooh looks like you are a dumb chick trapped inside human body. Go get an operation...free yourself ha!","commenter_a":"All the people who think he was a girl trapped in a boy's body are sick and have missed basic biology lessons. For that punk - rot in hell.","post_message":"Crossing out \"Josh,\" the 17-year-old signed \"Leelah\" in a suicide note.  @webpagelink"},{"comment_id":"1003873189632434","commenter_b":"When you take into account what these 2 young men did taking beer from a grocery store well there's going to be consequences plus swinging a skate board well the Police have to do something...I wish I were standing holding a sign I Support the Police Department !!","commenter_a":"I hate to say this but the store video does not lie. Now hopefully they'll release the bodycam video too. Now would be a great time to prove just how successful those are.","post_message":"The Olympia police officer who shot two men last week has given his account of what happened to investigators, and the department isn't releasing information.   More than 100 people packed city hall tonight demanding immediate changes in police accountability >> @webpagelink"},{"comment_id":"10153940708678690","commenter_b":"@haider ali what if bangalese ask the same about our PM or army chief then will you welcome their comment ? mind your own business,they are still better than us,we destroy our country on Islam but they dont want wahabi islam in Bangladesh....if our ISI stop exporting terrorism & wahabism to other countries,no one will blame us.","commenter_a":"Bangladash should change their pm. Hassena is worse lady i ever seen.","post_message":"Police said the seven men are linked with the banned armed group Jamaat-ul-Mujahideen Bangladesh.  The JMB members fought back as police raided the building, tossing a grenade at the security forces, but there were no reports of any injuries."},{"comment_id":"10154475125548812","commenter_b":"STOP GLORIFYING THIS RAPIST POS.","commenter_a":"I don't think it's real remorse probably embarrassment. Which is great. So it means that the power of social media is effecting thing Even the Vice President commented eloquently. So keep it up share this post pictures and sign the petitions","post_message":"Women who provided character witness statements for the Stanford University swimmer convicted of sexually assaulting an unconscious woman on campus are expressing regret for supporting him."},{"comment_id":"607285086107002","commenter_b":"I didn't know the definition of feminist included wanting to have sex with your daughter. @webpagelink","commenter_a":"idc. I would still rather have him as a president than Hillary","post_message":"Trump has been accused of sexism by his critics"},{"comment_id":"1031910293529802","commenter_b":"Stick to what u know lady. Some people don't much care for foreigners telling us what US values are","commenter_a":"She's a citizen by a marriage not by birth,besides she is just repeating what she hears loony clooney says","post_message":"DAUGHTER OF SUNNI MUSLIM, George Clooney Wife, Open Borders Activist And British Citizen Says Trump Doesn't Represent \"U.S. Values\""},{"comment_id":"1684551998460631","commenter_b":"I am not an American, but I and we all are interested in your politics. Because we other part of the world are concern for peace and prosperity. And Why so much hate? Why so many wars? Do you think that is the solution? What is the meaning of diplomacy for you guys? Is it only war? Do you think that in this 21st generation you are again doing politics for religion ? And certain race? Is that how you want to see American politics ? How come you think Obama foreign policy is miss leading you guys? Do you got the proper answer? He talks about climate change, which is happening and strongly scientist also believe that, he try to bring your army back in your country from Iraq and afganishtan, he shown us that diplomacy and foreign policy is not only about to hate and make enemy. He ...","commenter_a":"Trump doesn't back down from our enemies Obama. You are nothing but a coward. Your nuclear and foreign policy has only weakened us, and made it easier for Iran and ISIS to kill us.","post_message":"Speaking at the close of the Nuclear Security Summit, President Obama said Donald J. Trump's nuclear comments show he \"doesn't know much about foreign policy or nuclear policy or the Korean peninsula or the world generally.\" @webpagelink"}]
