[{"comment_id":"10153235865056680","commenter_b":"Ha ha ha!!! HEY, EVE, IF YOU WANNA WALK LIKE STEVE, YOU GOTTA TALK LIKE STEVE!!! WOMEN, STOP WHINING LIKE GIRLIEMEN. Stupid biatch.,😂😃😆😅😲😱😨","commenter_a":"TRUMP WINS ALL","post_message":"“She’s playing that woman’s card left and right.\""},{"comment_id":"10153150337159607","commenter_b":"He didn't live there 6 years. Stop believing everything you read, or make up in your head. Respect his family and friends right now and stop thinking this was a conspiracy","commenter_a":"Police did it he was going to expose the police for the dirty","post_message":"A Baltimore City police officer was found facedown in the water in South Baltimore Tuesday night. Officer Prashanth Davis, 34, was pronounced deceased at the scene."},{"comment_id":"10154602642789062","commenter_b":"They need to close all of them they are evil an come from tha devil","commenter_a":"I hate Walmart.","post_message":"Wal-Mart is closing 269 stores, more than half of them in the U.S. - YOUR THOUGHTS?  UPDATE: 2 Houston stores closing -> @webpagelink"},{"comment_id":"547039675478904","commenter_b":"trump is not going to build a wall or deport. sorry","commenter_a":"Make America great again build that wall","post_message":"\"I want America First - so do voters!\"  Hear from Donald J. Trump tonight on protesters, the Indiana primary and more at 10p ET. #Hannity @webpagelink"},{"comment_id":"969075749885792","commenter_b":"That was you , a hoe and a drug user","commenter_a":"Your corruption comes to an end today Hillary! You have stiffed this nation, you have deceived the American people. NO MORE CLINTONS, America will not let you disgrace this nation any more!","post_message":"Todo por lo que hemos trabajado se decide hoy. Comparte esto si apoyas a Hillary: hillaryclinton.com/buscador"},{"comment_id":"10153184330157507","commenter_b":"Two people committing to care for each other for life serves society and is why government encourages it through 1100+ rights, privileges and responsibilities. If you think it's a hypocritical institution, the solution is simple. Stay out of it.","commenter_a":"Marriage is hypocrisy. The \"Government\" should have no part what so ever in it.","post_message":"That time Fox News forgot to reprogram Shep Smith"},{"comment_id":"10153572834548132","commenter_b":"He fucked his sisters......BIG difference","commenter_a":"She's right. There was virtually no mention from the media of Lena Dunham's admission of touching her sister when her book came out. Complete double standard.","post_message":"Sarah Palin isn't too happy with what she calls \"obvious double standards\" between the Duggar family and actress Lena Dunham."}]
