[{"comment_id":"10156284616795354","commenter_b":"Lol, they weren't immigrants.","commenter_a":"Immigrants....","post_message":"What in the world is going on?"},{"comment_id":"1241639679186713","commenter_b":"What A Dumb Bastard !","commenter_a":"Without Freedom of and from Religion America is not a Free Country! Separation of Church and State! #VOTE The Republican #PARTYOFHATE out of local state and Federal Government #ENOUGH #VOTE #GUNSENSE #VOTE #Hillary2016","post_message":""},{"comment_id":"10154293014660329","commenter_b":"That ugly ass bitch is a hater.","commenter_a":"Reyna Zavala Giovanna Siqueiros Princess Vespa No pues wow","post_message":"\"Swish!\" - Amber Rose, probably // Kanye West"},{"comment_id":"10154978803416509","commenter_b":"@username even your pussy is ugly...","commenter_a":"Anyone who is upset, mad or sad about this, please evolve otherwise you are apart of the pedophile culture.","post_message":"In a nod to a more modern approach, the Miss Teen USA pageant is ending the swimsuit portion of its competition."},{"comment_id":"10154163706682908","commenter_b":"The insurance companies own half our congress. That's why. Obama had to settle for the ACA. Couldn'tget them to bring single payer to the floor.","commenter_a":"The reason we spend the most with the worst outcomes is because we save people who wouldn't have ever had a chance elsewhere in the world. Our 911 system is a model for the global community and have a lots of saves who would've died elsewhere. The people that we save and live often go on to live on ventilators and long term care. Ever been to sub-acute hospital? That's where all $ to outcome ratio goes out the window. Are you going to be the one to tell someone you're pulling the plug on their ventilator because they are costing too much?","post_message":""},{"comment_id":"516585565198690","commenter_b":"Leave America, why are you here? Go back where you belong, we don't want you.","commenter_a":"Ship them all back to the hell hole they came from. We don't need or want them.","post_message":"This state just voted to ban Islamic laws… Good.  We won't stand for Shariah in America and neither should you.  Do you support banning Islamic laws in all 50 states?"},{"comment_id":"10154249392839445","commenter_b":"date on picture is July 2008 took almost 8 years to figure out he was a fraud no wonder this country is going to SH-T","commenter_a":"Shame on him","post_message":"In his application for disability benefits, John Caltabiano claimed he couldn’t drive, cook for himself, exercise at the gym, move around his house or even shave without help."}]
