[{"comment_id":"1264994986901695","commenter_b":"I am for the national guard to start rounding up these illegal wetbacks.","commenter_a":"Yes!","post_message":"America's Freedom Fighters"},{"comment_id":"1207167835973058","commenter_b":"It's not true for entrepreneurs but workplace","commenter_a":"What if this statistic isn't true? Check out what John Stossel uncovered: @webpagelink","post_message":"Kristen Bell introduces Pinksourcing, where women are a bargain at the workplace, since you only have to pay them 77 cents on the dollar! It's the first episode of our new series, #CelebsHaveIssues."},{"comment_id":"10153143538491051","commenter_b":"How? A majority of liberal democrats are old rich white men todd","commenter_a":"Wrong... And you can bet the white scum liberal will go after the American Flag next... Americas biggest threat, the white scum liberal...","post_message":"The Confederate Flag's 54-year run at the South Carolina statehouse is officially over. Do you think that was the right decision?"},{"comment_id":"10153623447343352","commenter_b":"Girl that's what kids do they fight...they just need to teach her ass how to swing back next time.","commenter_a":"I feel bad for the little girl but kids get into fights all the time. If that was the case we'd all be rich!!! Including my mom!! But 10 million is extreme. I can see her doctor bills being paid (if any) and maybe her going to a different school but that's just a bit much.","post_message":"Family files $10 MILLION lawsuit after their 9-year-old daughter is beaten up on a school bus"},{"comment_id":"10152950210572169","commenter_b":"Clearly this woman lost her remote control long ago","commenter_a":"I will be glad when he is gone","post_message":"Saying goodnight to stupid pet tricks, top 10 lists and David Letterman (From PBS NewsHour)"},{"comment_id":"1168574929824833","commenter_b":"She's extremely wealthy, money buys votes!","commenter_a":"Wait...Hillary is still leading in overall polls? Americans in general really are stupid.","post_message":"I don't care whatever else you think of Donald Trump, but one thing Trump is doing is killing political correctness.  He's wiping it out.  He's leaving political correctness in a trail of dust.  He has violated tenets of political correctness from day one, and he is leading in the Republican polls and has pulled within six points of Hillary in a general."},{"comment_id":"976160855782499","commenter_b":"Oprah is racist trash.","commenter_a":"I hate Obama & I hate you to stinking race baiting pig","post_message":"Oprah threatens anyone who opposes Obama. Get that liberal trash off of TV. Do you think Oprah is the racist?"}]
