[{"comment_id":"10154843667759170","commenter_b":"I'd like to kick whoopi in her dick..","commenter_a":"Whoopi is downright rude to Conservative guests. She has no shame. Conway handled Whoopi's mockery and aggression with class.","post_message":"Oh yes. If you must go on The View, at least make the most of it and do this:"},{"comment_id":"10153526627596636","commenter_b":"She is full of hatred","commenter_a":"Burma/Myanmar is a country with many problems, including persecution of muslims. From what I've read of the interview the journalist only wanted to talk about the problems of the muslims and presumably that was not what Aung Suu Kyi was expecting since no one had bothered to tell her that the main topic of the interview would by the persecution of the muslim minority. No politician likes to go into an interview unprepared.","post_message":"According to the man who revealed it"},{"comment_id":"10153904128981336","commenter_b":"@username I'd rather my money go to vets than illegals.","commenter_a":"Oh man, companies supporting a competent and able workforce with bonuses. Conservatives will not like this one bit.","post_message":"Jeffery Hildebrand, the 56-year-old billionaire owner, will pay out more than $100 million in total and reportedly uses these bonuses to motivate his workforce."},{"comment_id":"1016519435107777","commenter_b":"Yes, and the idea that we should force women to wear a veil in the USA makes me physically ill. Women are NOT 3rd class citizens, which is what they are in strict Muslim households!","commenter_a":"There are many women who are voting republican because they are against abortions and they do not believe PP is anything other than there to do abortions. At age 72 I am with Stevie. I think we worked too hard to go backwards. I remember when I was first married there were states where it was against the law for a woman to use any form of birth control other than abstinence. If abortion is outlawed, how long before birth control will be outlawed.","post_message":"TRUTH."},{"comment_id":"1057065101012919","commenter_b":"Those camps are for the Ameriicans. The illegals are going to be slaves & the muslims will be living in your house.","commenter_a":"Not nearly enough room for all the democrats,liberals,communists ,illegals .ect....afterwe start to round them up.","post_message":"The 800 FEMA camps across the U.S. can only hold 16 million..."},{"comment_id":"10153577909221756","commenter_b":"And finally, Jesse Jackson IV, since I think he likes Kendrick Lamar too?","commenter_a":"@username Mata Though I'm sure you have seen this...","post_message":"High school teacher Brian Mooney used rapper Kendrick Lamar's latest album to teach a unit on Toni Morrison's novel, \"The Bluest Eye.\" Lamar found out about it, and decided to stop in for a visit. Full story here: @webpagelink"},{"comment_id":"10153148530580329","commenter_b":"It's not a fuckbuddy it's a weak ass pussy who ain't bout shit","commenter_a":"What is a f*ckboy? I must be getting old...","post_message":""}]
