[{"comment_id":"692204600931973","commenter_b":"RIGHTTTTT","commenter_a":"@username WHAT THE","post_message":"This robot wants a family...and to destroy humans."},{"comment_id":"10153148300259575","commenter_b":"You certainly are. \"Judge and be judged\" Crystal. I PROMISE you God is watching your actions as much as he's watching mine. Typing \" under a homosexuals death does not, in fact, secure your ticket to heaven babes.","commenter_a":"Let's see if she can have god change his mind","post_message":"A terminally ill woman whose desire to have her same-sex marriage recognized by Indiana before she died helped galvanize efforts to overturn the state’s gay marriage ban has lost her battle with cancer.  Niki Quasney died Thursday, gay rights advocacy group Lambda Legal said Sunday. She was 38."},{"comment_id":"1695225903839696","commenter_b":"Oh that won't be left leaning or anything....","commenter_a":"Didn't know 60 minutes was still on","post_message":"You get a story. And you get a story."},{"comment_id":"10155157643776162","commenter_b":"Someone needs to go in there and knock her in the head about 50 times","commenter_a":"OMG!!!","post_message":"HEARTBREAKING ABUSE! \"I told you to stop feeding the dog human food!\" Please share to help find the caregiver who was caught on video repeatedly hitting and swearing at a 94-year-old woman suffering from dementia. The victim son set up the surveillance camera after noticing bruises on his mom. @webpagelink"},{"comment_id":"917056878424478","commenter_b":"#fuckhillary she and the DNC planted this upon us","commenter_a":"#fucktrump","post_message":"Friday, January 20, 2017: Presidential Inauguration of Donald Trump & Mike Pence - LIVE on C-SPAN, C-SPAN Radio & @webpagelink"},{"comment_id":"1155392447817135","commenter_b":"Since she can't take the heat she gets out of the debate. (Kitchen).","commenter_a":"She knows she has already taken both sides of every topic. There's simply nothing left to lie about.","post_message":"Would Clinton benefit from another debate with Sanders?   She doesn't think so."},{"comment_id":"1695824464005067","commenter_b":"@username here I even did your researching for you but you can pick from numerous articles about him dodging the draft. @webpagelink","commenter_a":"Trump you spent all night at your rally tonight, calling Cruz a liar and cheater. Your supporters don't seem to concerned about your non polices and non plans. Keep dodging Cruz in a one on one debate, it just proves that you're the real liar! Since you said you wanted a one on one debate with Cruz, you're a dodger in every way.","post_message":"Donald J. Trump said he didn't call Ted Cruz 'Lyin' Ted' in his New York victory speech because \"I thought it would be very undignified for me to get up at that particular moment with ... pretty much the world watching.\""}]
