[{"comment_id":"10155076639181337","commenter_b":"@username Delete yours Racist POS","commenter_a":"How many time during his presidency was Obummer on Fox? So I don't blame trump for not wanting to deal with CNN and their fake reporting.","post_message":"Fox News defending CNN?? Donald J. Trump has inspired the impossible."},{"comment_id":"10153797502305779","commenter_b":"I wonder how people react to a naked hillary statue where you get to see that bitch in all her glory. Lol. Bet people would respond differently","commenter_a":"Gross!!!! The looks are uncanny!!!!!","post_message":"New naked Donald J. Trump statues appeared today, and now they're legal, backed by a mega-developer of their own."},{"comment_id":"10153541363403908","commenter_b":"Ass holes and sexism lol I understand!","commenter_a":"Kendrick- a small reference for the man haters in your life? Idk","post_message":"earlier this year, women were using the hashtag #WomenAgainstFeminism in order to set the record straight about their views on feminism. Here's a powerful response  for the \"not a feminist\" movement. What are your thoughts on this?"},{"comment_id":"908443172532257","commenter_b":"She should have NEVER been arrested to begin with !!!!! Anyone who would arrest an AMERICAN for carrying a firearm doesn't deserve to live in AMERICA !!!! PERIOD !!!!!","commenter_a":"Finally!!!","post_message":"Shaneen Allen, a Pennsylvania mother of two who didn’t know she was entering a “gotcha” zone when she drove across the New Jersey state line with a handgun in her purse, is clear of all charges following an 18-month legal ordeal in which a prosecutor had originally hoped to pursue harsh punishment as a caution to others. @webpagelink"},{"comment_id":"1055977171151281","commenter_b":"What do you expect from this Muzzie piece of shit.","commenter_a":"...and what did Obummer fight...Oh I know...golf par...didn't happen !","post_message":"***PATRIOT ALERT*** \"It is the inescapable duty of the Congress of the United States today to censure President Barack Obama for casting doubt on the sacrifices and motivations of the Americans who fought the Second World War—on the eve of Memorial Day, no less.\""},{"comment_id":"10153291024331509","commenter_b":"They are, dummy. You must be the next Nancy Grace.","commenter_a":"Fact is most of us don't drive around with hundreds of thousands in cash on us. The article barely mentions the fact that this program is geared towards getting drug dealers off the streets. Cops make mistakes because they're human but this article gives two examples that make it sound like cops are robbing innocent people daily of their cash. @username strikes again.","post_message":"You may have never heard of this program, but it's a widespread practice in which police can take your cash without any criminal charges: @webpagelink"},{"comment_id":"10154146066447623","commenter_b":"@username Im against this executive order because it wasnt thought out very well at all and is just a blanket order to block everyone that is a citizen of certain countries from getting into America, even if theyve been here for years and just happen to be out of the US at the time. Im all for protection, but Trump's actions are based on nothing but his ignorance and fear. That is no way to live and that is no way to run a country.","commenter_a":"If DHS doesn't support this, isn't that a sign that maybe it's not the right thing to be doing? I'm pretty sure they're not a liberal organization, so this isn't a partisan issue. If you're scared of terrorists, I get that. But wouldn't it be better to open your mind a little and try to understand why so many people are against this?","post_message":"The Department of Homeland Security said Saturday it has suspended all actions to implement President Donald Trump’s immigration order."}]
