[{"comment_id":"10154429812461051","commenter_b":"Damage fags","commenter_a":"Impeach Trump","post_message":"The World Bank claims Trump could be the best thing to ever happen to the American economy. Do you think they're right?"},{"comment_id":"10154266056696051","commenter_b":"She looks dreadful!!!","commenter_a":"the VALUES are no 'right' unless they are YOUR values?? I don't think so...........the American people have spoke. Donald Trump Is Our President","post_message":"Hillary Clinton made her first major appearance since losing the presidential election last Tuesday. Do you agree with what she's saying?"},{"comment_id":"678004185692498","commenter_b":"What self respecting woman wouldn't lash out at a woman trying to seduce her husband?","commenter_a":"“Bimbo eruptions.” “I would crucify her.” “We have to destroy her story.” These are just some of the things said and done by @username to undermine women who accused her husband, Bill Clinton, of infidelity and even assault. Hypocrites!","post_message":"\"This is not something that we can ignore. It's not something we can just sweep under the rug as just another disturbing footnote...this was not just a lewd conversation, this was not just locker room banter. This was a powerful individual, speaking freely and openly about sexually predatory behavior.\" —First Lady Michelle Obama on Trump"},{"comment_id":"10153540694723984","commenter_b":"It won't affect her she is like a cork she just keeps popping up! I am afraid women who are not paying attention will vote just because she will be the first women president! I hope we have enough smart women that understands our country is going down the tube. Also we have very little protection from the terrorist! We are like sitting ducks on a pond!","commenter_a":"There is an obvious method to keeping Hillary out of the White House. All we need is an alternative candidate. That's how Obama got elected... no strong alternative.","post_message":"Hillary has dug herself a hole so deep, it doesn't look like there's ANY way she's going to be able to crawl out...  Are you hoping Hillary Clinton's scandals sink her?"},{"comment_id":"1037202013040797","commenter_b":"@username oh go screw yourself you ignorant idiot i could care less about what you think ....arrogant pig","commenter_a":"Just goes to show what kind of trash is on trumps payroll he is nothing but a pig and so are his delegates OPEN YOUR EYES PEOPLE he is nothing but a piece of crap","post_message":"The Trump campaign said the man will be replaced immediately."},{"comment_id":"1077236902352732","commenter_b":"Ya \" maybe in Florida . You know were the Zika mosquitos were found!!!","commenter_a":"Yeah...but nevermind when democrats block Zika funding. @webpagelink","post_message":"How do they sleep at night?  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153671794761770","commenter_b":"Gross ! She's too fat ! Lol","commenter_a":"- Someone whisper in Dereks ear, ALL beauty is fleeting","post_message":"Derek Jeter clearly hit the jackpot."}]
