[{"comment_id":"979011448820924","commenter_b":"she would have just committed suicide another time someplace else","commenter_a":"Had her relatives posted bail, she would still be with us today. Shame!","post_message":"So close to the holidays...  A Texas grand jury has decided not to issue any indictments in the mysterious prison cell death of Chicago woman, Sandra Bland. Despite video evidence showing a display of excessive force from the arresting officer, the case now remains at a standstill.  MORE ---> @webpagelink"},{"comment_id":"10156451475900500","commenter_b":"Fire her","commenter_a":"So this woman or all the people she was ordering food for did not have a cell phone to order lunch? It should have never been done with a 911 phone.","post_message":"DANGEROUS SITUATION- What do you think of her punishment?  @webpagelink"},{"comment_id":"10152889447368837","commenter_b":"How about sending your black people to Africa forever ever, so they don't rob, kill , root and continue destroying this country!","commenter_a":"Since the US is working with Cuba, the government needs to eliminate the wet foot dry foot policy. Make sure any Cuban who comes here get citizenship so they can pay taxes versus living here off the grid and sending monies home to screw up the Social Security, retirement and Medicare funded programs built for Americans in this country. Black White Hispanic Asian Haitian alike.","post_message":"Dangerous Voyage."},{"comment_id":"10154167828886077","commenter_b":"Oh whoopee!! It will soon b n Indiana! 🙀 Where did June go??","commenter_a":"Kill it with fire!","post_message":"❄️☃"},{"comment_id":"10152578962070736","commenter_b":"Women don't have penises.","commenter_a":"If this woman was so uncomfortable being in a locker room with a transgendered person, would she be just as uncomfortable being in the locker room with another female? Because that is essentially what she is complaining about.","post_message":"LGBT activists have applauded the gym's decision, saying the 'no judgment zone' promotes privacy and safety."},{"comment_id":"1269577516395609","commenter_b":"So your saying CO2 is NOT a gas?? Where did you study chemistry?","commenter_a":"If that was gas.... the fireworks would have gone off as soon as the air was saturated enough to be visible.","post_message":"No, that's not fog. It's a gas leak.  @webpagelink"},{"comment_id":"1126887640660229","commenter_b":"If she's black, the barry is white !","commenter_a":"You will always be that lovable little fuzz ball, however you identify yourself!","post_message":"You know, I think I'm going to \"identify\" as skinny.  That way I will not have to ever go on a diet. I'm just gonna identify as skinny.  I just am.  You think I'm not?  Screw you!"}]
