[{"comment_id":"10155020907765329","commenter_b":"I mean fuck the patriarchy, but like FUCK the patriarchy... amiright?","commenter_a":"@username #17 please","post_message":"So your dirty mind can go back to school."},{"comment_id":"10152955984226130","commenter_b":"Lesbians STINK","commenter_a":"The image of God is both male and female and is reflected in a godly union between male and female where the creative power of God, His life-giving, His self-giving and His moral nature are perfectly expressed. This is only possible in a heterosexual union. When God created a partner for Adam He created Eve—not another Adam. This means that perfect partnership requires some level of difference as well as a level of similarity so great that Adam could cry out loudly, ”This is now bone of my bones and flesh of my flesh”. Sexual intimacy between a man and a woman is the normal method of male/female bonding (emotionally and physically) because it corresponds to the design of our bodies and because it is the normal means by which offspring are created. If God had intended the human race to be fulfilled through both heterosexual and homosexual marriage, He ...","post_message":"“As long as anti-gay legislation exists in any state, I strongly believe big events such as the Final Four and Super Bowl should not be held in those states’ cities.”"},{"comment_id":"10153076244166336","commenter_b":"I could care less what that old cow at the head of the EPA says. Her job ends in a couple years. Clear out a stall.","commenter_a":"Pretty soon they'll be coin operated. $2.00 per 5 minute shower.","post_message":"The EPA wants hotels to start monitoring how long guests spend in the shower."},{"comment_id":"766656443467536","commenter_b":"When the hell do CRIMINALS ABIDE BY LAWS????? Dumbasses","commenter_a":"Utterly completely fucking useless President. His brain =","post_message":"You have to see it to believe it."},{"comment_id":"912315142139160","commenter_b":"I saw this on Fox & Friends this morning. I am so saddened by what this hero went through. Glad Perry was there to help him. My heart goes out to Marcus and all who suffer without the help they should get for free, for serving our country. Obimbo's leave no soldier behind is such a lie.","commenter_a":"Rick Perry for President or maybe Rand Paul!","post_message":"Do you know the story of Marcus Luttrell and Rick Perry?"},{"comment_id":"10156234250125192","commenter_b":"Nope she belongs to a group.","commenter_a":"I think a gofundme acct should be set up for HER bravery for standing up for our children. (In my case grandchildren). This testing bs in today's teaching in beyond rediculous. The \"common core\" math is crazy. My 12 yr old grandson just got a low grade in math and son in law said he doesn't understand it. There are mire letters than numbers in his math class. He is getting what we had in advanced 12th grade and it is just too difficult for that age to understand and too busy testing for tests to see what he doesn't understand. I pitty Florida kids in public school. Something needs to change before we lose more teachers like this. Please start teaching our kids to love learning and let our kids learn to love learning.","post_message":"A Polk County teacher recently resigned, citing what she calls 'educational malpractice,' resulting from too much standardized testing:"},{"comment_id":"10154307345026729","commenter_b":"I am a liberal and I totally agree with the poster, so why are you irritated with liberals; your reasoning doesn't make sense to me.","commenter_a":"Or becoming traitors and taking over federal buildings!","post_message":"This will definitely irritate liberals and the \"coexist\" crowd"}]
