[{"comment_id":"10156714822180354","commenter_b":"I'm with you Francesca ! Beyonce is just trash !","commenter_a":"That was beautiful and classy from Lady Gaga. I will NOT be watching trashy Beyonce.","post_message":"Lady Gaga's performance of the National Anthem at the #SuperBowl lights up social media.  WATCH:"},{"comment_id":"10154316931887654","commenter_b":"it's with the thieves,rapists and murderers! this lady is a witch!","commenter_a":"It's hard to believe that she has enough brain to keep her breathing...........The woman is a grieving mother whose son was murdered by someone who should not have been here. Our borders are sieves because of failed policy and Pelosi says he was a \"law-abiding citizen\"???? Where is her soul? Her compassion? Her empathy?","post_message":"Democrat leader sides with illegal aliens over mom whose son was murdered by one."},{"comment_id":"10156716294680725","commenter_b":"Trump is a scum bag who steals from Veterans!!! @webpagelink","commenter_a":"Never liked Cruz and I thought Rubio seemed like a nice guy. Not anymore...give em hell @username, your the only man that can pull this off. You have had my vote from the beginning.","post_message":"THANK YOU #TrumpTrain! Lets make it a great day! Preparing now for rally at Macomb Community College- here in Michigan!"},{"comment_id":"10153195780106130","commenter_b":"I'd give her an orgasm!","commenter_a":"Who's the asshole out there denying women orgasms??? Selfish prick!","post_message":"\"Don’t not have an orgasm. Make sure he knows that you’re entitled to an orgasm.\""},{"comment_id":"1293729747316737","commenter_b":"God she's a rotten pos","commenter_a":"Oh stop the whining! Grow up. The people have spoken so move on!!","post_message":"Chelsea Handler and Sen. Barbara Boxer didn't hesitate to shed tears at the \"sexism\" of Trump's victory."},{"comment_id":"524146164440320","commenter_b":"Pos","commenter_a":"Why was he even there!!!! Ugh","post_message":"I don't even know what to say."},{"comment_id":"10152888898915496","commenter_b":"But... But... Gay marriage is destroying straight marriage! @webpagelink","commenter_a":"Brenda. I believe that you are right in some of your thoughts. I don't delieve we should judge people. However we are definitely called to judge actions. In the case of same-sex marriage to support same-sex marraige is to supoort something that goes against the Bible's definition of marraige. Same-sex marraige is social, cultural, and traditional. Social, cultural and traditional acceptance will change with time but Biblical truth does not. Therefore I believe that we are to love everyone but support what is right in the eyes of the Lord.","post_message":"Brenda Wood 11Alive looks back at the fast-moving and historic events of last week in Monday's Last Word -- \"Same-sex marriage: Judgement Day.\"  More Last Words: @webpagelink"}]
