[{"comment_id":"439880426200251","commenter_b":"Awesome we need more women like her.","commenter_a":"I would done same","post_message":"Don't mess with this mom..."},{"comment_id":"10153374957661051","commenter_b":"Of course, a common sense approach. All sales and transfers should be subject to a background check protocol. Keep up the rhetoric NRA, unless we see some common sense prevail among the gun lobby & gun nuts the eventual backlash is going to greatly affect responsible gun owners.","commenter_a":"To purchase any firearm there are already checks in place.","post_message":"Do you agree or disagree with America's police chiefs on this?"},{"comment_id":"10155902934120294","commenter_b":"I agree, if its fact its clearly ok to say it. That chick had no place in that store","commenter_a":"They said it loud enough for her to hear. She heard it and it hurts. Just be kind. If you can't say something nice don't say anything.","post_message":"This woman knew what she had to do after the hurtful conversation she said she overheard between a teenage girl and her mom at Old Navy."},{"comment_id":"840275132829730","commenter_b":"It took you people 8 years to realize that,lol He is a Muslim born in Kenya and should have never been aloud to run for President!! PERIOD","commenter_a":"Like it is a suprise Not . Fools at least over half of those that voted . Voted for at the least has sympathy . Sick the same people that killed thousands . Americans voted in one that was raised Muslim . Sad","post_message":"Damning new evidence has arisen regarding Obama. There is no question now that Obama is not who he says he is. Do you agree Obama is a Muslim?"},{"comment_id":"10153138744168487","commenter_b":"Criminals will find anything, they're criminals after all. If they could kill you with love they would do! More guns will never make any situation safer; regardless of the victim feels they would have been safer with a gun. Chances are a criminal will know how to use one and you won't. Guns should be outlawed on a whole not made readily available to whoever wants one.","commenter_a":"so does higher rates of car ownership.","post_message":"A reminder from 2014 that higher rates of gun availability correlate with higher rates of female homicide."},{"comment_id":"1089067221104747","commenter_b":"it's only good enough for those of us that don't pray to the gun god!","commenter_a":"Republicans; \"Carry a gun everywhere, except near us.\"","post_message":"If conservatives are so convinced that gun-free zones attract killers, then why do so many conservative places and events ban guns?"},{"comment_id":"415868471934780","commenter_b":"as soon as they put one foot on our soil we must be ready to drop bombs on them.","commenter_a":"I am ready for them arats.","post_message":"They're here!!"}]
