[{"comment_id":"10154142762821756","commenter_b":"Carol Andrews Wilfork ....\"Concerned about appearances?\" Good one! Hillary Clinton would never be allowed to be an angry, cantankerous revolutionary with wild hair like Bernie....she would not make it in American politics. Women have to play a completely different game...and look good doing it or they are toast!","commenter_a":"Perhaps true criticisms of Rubio, but along with Rand Paul find them to be the most rational and reasonable persons at the debates.","post_message":"Some say the first-term Florida senator is inexperienced. Some say he's inconsistent. And others question how his loss in Iowa is being spun into a quasi-victory."},{"comment_id":"630413113793105","commenter_b":"okay so heres why i still disagree, especially in regards to syrian refugees. the poison example is still not a good one, because no damage that isis can do to the country is comparable to the damage that poison will do to a persons body. it would be tragic to lose people in attacks, but it wouldnt be strictly \"devestating\" to the country. the united states stregnth and resolve would be largely unchanged. refuting refugees is stupid, and here is why i think so. for one, the refugee vetting process is the most extensive and thorough process that is in place, if any sort of check is going to detect a potential terrorist, this is the one. refugees take about two years to finish vetting and finally get relocated, and they dont even get to choose where they go! they get sent to a country that is assigned to them. ...","commenter_a":"@username thoughts","post_message":"Donald J. Trump tweeted about the case, saying Bonifacio Oseguera-Gonzalez \"should have never been here.\""},{"comment_id":"739998596133321","commenter_b":"Jesus Christ the arguments against guns here are fucking stupid. To fellow pro 2a people, don't play into their hands like this. Look. Let's pretend you were right. That the good guy with a gun scenario doesn't really deter anything. fine. Let's pretend you are right. That having guns so that people can defend themselves against tyranny isn't going to do anything. Fine. Let's pretend that we can depend on our government officials to protect us against foreign invaders 100 percent of the time without fail. Fine. Let's also pretend that you get all the gun control laws you want passed. Done. Now let's pretend that so far a vast majority of the recent shootings weren't perpetrated by individuals who up until the shooting had little to no signs of deteriorating mental health and zero criminal history. Let's also pretend that those same individuals did not purchase their firearms LEGALLY ...","commenter_a":"Liberal code. NEVER TAKE RESPONSIBILITY!!! Blame blame blame","post_message":"I know he's a grieving father but this is so WRONG."},{"comment_id":"10154295602821037","commenter_b":"Claude, women who use the term \"Feminist libtard\" are sexy.","commenter_a":"Good lord! If men couldn't get a job because they hit on a woman at one time or another throughout the years, there wouldn't be any in the workplace! Women like this give us all a bad name. She must me a feminist Libtard! I'm sorry....some people will do anything to get attention and they are coming out of the woodwork! She acts like he raped her! I'm guessing she's trying to make a name for herself through Trump since she couldn't with her writing skills.","post_message":"Our reporter attended a Donald J. Trump event in 1987: \"Trump said there would be an even better afterparty and I was welcome to join him, but only if I came alone.\""},{"comment_id":"383422335172981","commenter_b":"There are laws and then there is right and wrong. When you factor out people from the laws, you create an inequity that needs to be handled as Solomon did --- One case at a time. Many years of productive residency DOES erase the fruit of the poisoned tree --- that she came here against a statuary law. Laws were made to cope with inequity. We have immigration laws because we feared overpopulation by the poorest people in the world who would want to come to the \"land of opportunity.\" But, when someone comes and contributes to our fabric, we need to weigh that against a rule made to prevent, in her case, something that doesn't exist.","commenter_a":"The first step in holding conservative views on immigration is that they can't view anyone who might be affected by bad immigration policy as fully human. That's the problem. They've successfully dehumanized Hispanic people so they simply don't care.","post_message":"Now she has the opportunity to apply to stay here legally."},{"comment_id":"10153109103456636","commenter_b":"Shut our doors and keep them out","commenter_a":"Am I the only one disgusted by negative comments here? there is a big difference between migrants and refugees? if that was your child? seriously? and the fact that 99% of migrants pay a hell of a lot into society? that doesn't count? unnaceptable - we need to be helping now.","post_message":"'David Cameron’s muted response to the crisis is disgraceful"},{"comment_id":"10153830335904087","commenter_b":"Course they won't. They just coronated their queen.","commenter_a":"The most transparent \"administration\" in history.... LOL","post_message":"#BREAKING: The State Department is refusing to hand the House Oversight Committee any email messages as part of the panel’s investigation into eight deleted minutes from a 2013 press briefing video."}]
