[{"comment_id":"1370390752974540","commenter_b":"Please go after Hillary next.","commenter_a":"None of them in Washington are honest anymore. Only to themselves lining their pockets.","post_message":"We thought Democrats were supposed to be the honest ones!"},{"comment_id":"385075118347449","commenter_b":"She's not worth two cents the skank","commenter_a":"How about we take oboma's pay to pay for this.","post_message":"This is CRAZY..."},{"comment_id":"10152705409276051","commenter_b":"This scummy bitch deserves to die for what she did to that baby","commenter_a":"sorry sick people deserve the worse","post_message":"Officials couldn't believe that a mom would do this to her own child."},{"comment_id":"10153596919524205","commenter_b":"Fuckdonaldbitchasstrump!!!","commenter_a":"Amanda Kovanis","post_message":"Donald Trump has been running a populist campaign, and during the Republican primary that has meant saying outrageous things to impress conservative voters. Will he change his positions when he becomes the Republican nominee?"},{"comment_id":"1576560615982395","commenter_b":"Bitch needs to go away!","commenter_a":"The woman has been going way too much. She needs to rest. It's not exactly uncommon to get pneumonia when your constantly traveling doing events, and meeting with people on very little sleep.","post_message":"Democratic candidate abruptly left New York's 9/11 ceremony Sunday, raising questions about her health and campaign transparency."},{"comment_id":"1695494594049179","commenter_b":"And who's fault is it that the cartels exist ?? -- Your people! The youth in your country and their parents . The main fact that ignorant Americans either fail to realize or completely ignore is that America is the #1 drug consumer country in the world ! In order to be a business there needs to be a demand. Your society is demanding drugs you people are raised on terrible values and customs which is why you are heavily consuming drugs ! If your government could find a way to avoid that demand and necessity the business would cease to exist. Your people are indirectly the cause of the blood that sheds south of the border . Of course you didn't do your research properly! BITCH.","commenter_a":"#BringBackJonStewart ... Sorry, but you're misinformed and simply not funny Trevor. You obviously never visited a border town where cartels are actively kidnapping Americans. This is happening right now, while you attempt to make unfunny jokes about the problem","post_message":"Trevor unpacks Donald Trump's response to the mass shooting in Orlando. @webpagelink"},{"comment_id":"1803726116573607","commenter_b":"Graham disbrow are you on a loop?","commenter_a":"looks like more reporters the protestors.....","post_message":"HAPPENING NOW: Protesters plan to block the Mill Avenue bridge in #Tempe as part of a police brutality demonstration.  WARNING: This is a live feed. Viewer discretion is advised."}]
