[{"comment_id":"10154174806427293","commenter_b":"Girl...you need some self respect letting yourself get played like that How much are you getting paid.You ARE getting paid right?","commenter_a":"Basically she saying HE'S CLUELESS","post_message":"Donald J. Trump's campaign manager was pushed today on \"Morning Joe\" to explain some of his recent comments."},{"comment_id":"1017002171709344","commenter_b":"I would feel equally disgusted voting for either one.","commenter_a":"That's a Question ?","post_message":"Multiple Choice Quiz time, Republican kiddies! Which answer did you choose? A or B?"},{"comment_id":"1021881241225156","commenter_b":"@username bildim niye chocolate sevirsen :D","commenter_a":"Turkan M. Devrijova, @username duz deyirmish :D chocolate is good","post_message":"People who love chocolate are more likely to be clever"},{"comment_id":"367714146750213","commenter_b":"To win a war you have to call it war and fight it like a war.","commenter_a":"But Obama or any of his staff was there , how come ??","post_message":"More than 1 million people are marching in Paris to protest against Islamic terrorists"},{"comment_id":"10154528764136955","commenter_b":"TO ALL AMERICANS - PLEASE WAKE UP AND SMELL THE ROSES. Whether you like TRUMP or not, he is the only viable candidate. If you want all of the above to happen, the lost of 5 amendments to the Constitution that we all learned about in school and everything else she wants to do to put this country into the ground for her benefit only ( REMEMBER, SHE LIVES ON OTHER PEOPLE'S MONEY), we have to work hard for ours, then HILLARY is your girl. If you want the opposite, to save all our rights and freedom, more jobs, getting better and cheaper health insurance (UNLESS YOU WANT TO PAY REALLY HIGH PREMIUMS), a strong military should we ever need it, keeping the refugees out of this country (otherwise you will find them right in YOUR OWN BACKYARD), childcare for all working women (who make up 40% of the workforce), ...","commenter_a":"Lol Trump was winning anyway see yea dumas Hillary quacks","post_message":"PAPER: Dems should ask her to step aside..."},{"comment_id":"10152972266751051","commenter_b":"No, phuck you, Eric! Get out of my country if you can't respect it. And that stupid bitch is just another moron who probably thinks we have a black president, too. Can't have a white momma and be black........DUH!","commenter_a":"Go to a country who has a flag you like, BITCH.","post_message":"This American flag social media challenge has become increasingly popular over the past week."},{"comment_id":"418283194962942","commenter_b":"They are all criminals, that why they call them Illegals.","commenter_a":"So you want to prioritize sending back students & children before the criminals. I see.","post_message":"This Texas judge is boldly standing up to the White House. Should more follow his lead?"}]
