[{"comment_id":"838151202944602","commenter_b":"Perhaps she is trying to prove that while she is a Loser at every turn...she is no quitter. She enjoys Losing!","commenter_a":"Why do these people waste money to this degree ??? She's got no shot not even remotely possible . I'm just sayin ....what is the purpose of this ???","post_message":"Her presidential campaign just went down in flames."},{"comment_id":"1223870594319795","commenter_b":"What if he might win this time","commenter_a":"I honestly feel if Bernie and Jill teamed up they could win and the world would definitely be a better place. This needs to happen badly!","post_message":"Here's the Guardian article everyone is asking about.  Please read my clarifying statement about our offer to Bernie Sanders: @webpagelink"},{"comment_id":"1287351561304298","commenter_b":"Pneumonia?! Doubtful!!! Maybe her conscience raised its despicable, dishonest head and gave her a little peak at her destiny - a one way trip to spend eternity in Hell - now that ought to make her swoon!!! Still...Doubtful!!!","commenter_a":"Just another lie...","post_message":"New News Is Hillary has pneumonia.  FOR THOSE WHO WERE OFF THE GRID TODAY MOST, here is all you need to know about Hillary's \"medical episode\"  (aka fainting) during the 9/11 ceremonies in NYC.  All the videos you need to see:  @webpagelink"},{"comment_id":"1184326411634277","commenter_b":"Yup they deserve to go home and shouldn't think twice before shooting and it should be shoot to kill do the crime expect to pay the price I don't care what color your skin is point a gun at a cop expect to eat lead","commenter_a":"If you point a gun at anyone, expect to get shot.","post_message":"Do you agree?"},{"comment_id":"10155268022544411","commenter_b":"What a stupid bitch","commenter_a":"China honestly USA and South Korea will do for their security what they will - your threats are useless because guess what your citizens have had exposure to west and they will fight against you to keep their freedoms- your on the downward spiral of communism!!","post_message":"Beijing 'will definitely take necessary measures to safeguard its security interests'"},{"comment_id":"1157925847657525","commenter_b":"she should be charged with fraud.","commenter_a":"God please let this happen....she is evil as Hellary","post_message":"ClashDaily.com"},{"comment_id":"1593183134313238","commenter_b":"Lol, not true bitchhhhh.","commenter_a":"Jensen Beale","post_message":"\"5 minutes\" "}]
