[{"comment_id":"10150618266494999","commenter_b":"Benny no where have I said or implied \"let the floodgates open and let every single person just come on in\". If you read my 1st few words, you would see that just putting a concrete wall around the WHOLE country is not the answer. Take the opportunities away and well, you should be able derive the answer. The ones that are here, are, whether you believe it are not, contributing to society already. They cut your lawns, serve your food, make your sandwiches etc etc. Even work the farms. I am not for illegal immigration whatsoever but to say they who come over bring us problems!!...I think we have benefitted more from them than not. I am just saying not all illegal immigrants are Mexicans. As for your Chinese response, true they would love to come to America. A lot do make it here (illegally I may add). Have ...","commenter_a":"This is how people misinterpret words. Trump was talking about ILLEGAL immigrants. No offense was towards Bushs wife. Unless of course she is illegal.","post_message":"\"He’s not a stupid guy, so I don’t assume he thinks that every Mexican crossing the border is a rapist,\" Jeb Bush said of Donald J. Trump."},{"comment_id":"10154146066447623","commenter_b":"@username Im against this executive order because it wasnt thought out very well at all and is just a blanket order to block everyone that is a citizen of certain countries from getting into America, even if theyve been here for years and just happen to be out of the US at the time. Im all for protection, but Trump's actions are based on nothing but his ignorance and fear. That is no way to live and that is no way to run a country.","commenter_a":"If DHS doesn't support this, isn't that a sign that maybe it's not the right thing to be doing? I'm pretty sure they're not a liberal organization, so this isn't a partisan issue. If you're scared of terrorists, I get that. But wouldn't it be better to open your mind a little and try to understand why so many people are against this?","post_message":"The Department of Homeland Security said Saturday it has suspended all actions to implement President Donald Trump’s immigration order."},{"comment_id":"949029821890932","commenter_b":"@username Before you vote for Clinton remember this. a vote for her is vote for a another kilo of heroin across an open border polluting Americans and contributing to more crime.","commenter_a":"If you are privileged enough so that a Trump presidency doesn't matter to you, vote against him for the many people he will take advantage of if he wins.","post_message":"Most Americans, regardless of their political views, do not want to see us go backwards, and are not going to be supporting a candidate for president who has made bigotry the cornerstone of his campaign."},{"comment_id":"1644362728922565","commenter_b":"But haven't you heard....those votes are all from dead illegals","commenter_a":"Electoral College must do the right thing and prevent Trump becoming president. Now 2.5 million more people voted for Clinton than Trump!","post_message":"Were you wondering why Trump talked to Taiwanese President?"},{"comment_id":"10152997685931336","commenter_b":"Now we have the iic ( idiots in charge ) fighting the isis. Stop talking about it and just do it.","commenter_a":"I hope isis dont watch tv...","post_message":"A U.S. military official has outlined plans to retake the key Iraq city of Mosul from ISIS terrorists as early as April, but the move has swiftly drawn criticism that the Pentagon is revealing too much information. @webpagelink"},{"comment_id":"10153781983829062","commenter_b":"Yeah!","commenter_a":"Oscar","post_message":"Heads up Ariana, fans... she's coming back to Texas this summer! Did you see her at the rodeo?"},{"comment_id":"928522093922469","commenter_b":"The plans he has put in place, is FILL AMERICA WITH MUSLIMS AND ILLEGALS....\"GROWTH OF THE ECONOMY IS HIS MUSLIMS AND ILLEGALS IN PLACE FOR A WAR\" SO HE DOESN'T HAVE TO LEAVE THE WHITEHOUSE......WHY DO YOU THINK HE SAID HE WAS GOING TO STAY IN WASHINGTON FOR 2 MORE YEARS, SO \"SASHA\" COULD GRADUATE THERE? HE SURE IS NOT GOING TO PAY THE COST OF HER SCHOOLING OUT OF HIS POCKET....... WAKE UP, AMERICA....THE REASON HE IS NOT IMPEACHED, IS BECAUSE MOST OF THE ONES WHO WOULD HAVE DONE IT, ARE NOT AMERICANS, BUT ARE MUSLIMS.....","commenter_a":"To have a strong economy you need more Americans working and Obama's policies stand in the way of Americans going back to work again. Obama did place an incentive for employers to hire new workers BUT he also put a heavier tax burden on employers to keep their new hires.","post_message":"WATCH Obama:  is pretty darn great right now, and making strides right now...And I don expect that these facts and this evidence will convince some of the politicians out there to change their doomsday rhetoric"}]
