[{"comment_id":"10153361867349726","commenter_b":"He has no womb case closed Obummer has no morals or common sense","commenter_a":"The country is damn near in chaos and he takes the time to talk about this BS...","post_message":"WATCH: Obama: Caitlyn Jenner Showed 'Tremendous Courage'"},{"comment_id":"859693680734640","commenter_b":"That's definitely not how that works. She would have to legally be a woman with identification as a woman.","commenter_a":"totally disgusting, so any guy can say they are pretty sure they are a woman stuck in a man's body and will be welcome in locker rooms and bathrooms, oh come on!","post_message":"\"I was stunned and shocked.\""},{"comment_id":"10153312840067098","commenter_b":"My point is, YOU don't know what people do.","commenter_a":"How about we worry about our homeless vets and not other countries people.","post_message":"The results come amid a heated debate in the wake of the attacks in Paris..."},{"comment_id":"10153061426624411","commenter_b":"In prison in U.S. A child killer is gang raped and beat to death they hate child killers !","commenter_a":"Well it sparred prisoners a job of having to kill her. Deserves to die child killer!","post_message":""},{"comment_id":"760686517397260","commenter_b":"Stephanie Hathcox","commenter_a":"John Rivera","post_message":"In case training your dog to shake hands weren't impressive enough."},{"comment_id":"10154965744184641","commenter_b":"I would agree that would be a good reason to March however that March said absolutely nothing about this. As a matter of fact the lady running the March believes in Sharia law and in her belief system this is perfectly acceptable","commenter_a":"This why we march. This is not acceptable for ANY culture.","post_message":"When she was 12, she was sold into \"marriage\" with a 70-year-old man -- and there are hundreds like her."},{"comment_id":"10153700369301600","commenter_b":"Florence Colo is the federal supermax for the U.S.......","commenter_a":"HELL NO TAKE THEM TO WASHINGTON DC","post_message":"Republican Congressman Scott Tipton’s office said he believes the transfer of some of the world’s most dangerous terrorists from Guantanamo Bay to Colorado is “unacceptable.”  What is your opinion?"}]
