[{"comment_id":"10153409431986336","commenter_b":"Give it a rest ! Donald Trump has every right to his opinion. I agree that this country has had an influx of illegals for years. Be informed and know that Mexico and Guatemala have cut a deal to send thousands more to cross our borders illegally. The monies they send back to Mexico and Guatemala is $120 Billion dollars. This president wants to give them a free pass plus $35 thousand tax refunds? So they cross illegally, burden our health centers, schools, and oh only so you get my disgust! All I used to hear at the hospital is people telling other relatives of theirs to \"Come to the U.S., because this country is so stupid. They give you money for living, food stamps and oh if you have your babies in the U.S. , then they are citizens and you can stay\"... So these so called nice people ...","commenter_a":"Its a PR move. All they really care about are the $$$$$$ NBC and MSNBC are financially hurting. Low ratings low viewership.","post_message":"Breaking News: NBC is ending its business relationship with Donald J. Trump due to his \"recent derogatory statements\" regarding immigrants.   DETAILS: @webpagelink"},{"comment_id":"10152618671965950","commenter_b":"Don't care about that spoiled rich brat.","commenter_a":"Praying for her .. loved Whitney's music.still love her music.. such a sad time for the.family.. especially Sissy Houston.. God heal Bobbi Khristina.. play her MAMA music. They say that will help. To hear someone they loved voice.","post_message":"Despite mixed reports over Bobbi Kristina Brown's condition, family members ask the public to #StillPrayForBK."},{"comment_id":"10153214192574170","commenter_b":"Could care less what she thinks !!!! LEAVE AMERICA!!!!","commenter_a":"Her opinion is s💱t Like her music Ghetto monkey opinions on race is ignorant and illegitimate Black rap culture is immoral dishonorable and gross","post_message":"I know, I know. \"who cares about some rapper?\"  The sad answer is \"a lot of people.\"  Conservatives have failed to engage in the pop-culture space for too long. That needs to change."},{"comment_id":"868334796545922","commenter_b":"Heather go live in that cave","commenter_a":"If the public would STOP using Craigslist, it would shut down...as long as people continue using it they will stay open.","post_message":"Georgia police have confirmed that two bodies found Monday were identified as Elrey and June Runion. The elderly couple vanished last Thursday after they went to meet someone who had responded to a Craigslist ad they posted: @webpagelink"},{"comment_id":"1140671769377398","commenter_b":"This lady is such a trash!","commenter_a":"Why didn't they do this when Obama was in office?","post_message":"Thankfully we have Elizabeth Warren in the Senate to call him out.  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"386115264910101","commenter_b":"She needs to die. She would never have gotten any place in this country without white people. I hate that racist trash.","commenter_a":"She sounds like she is mad at the world .","post_message":"Oprah plays the race card again..."},{"comment_id":"493684487507628","commenter_b":"Keep em out our we go the way of Europe. No Trojan Terrorists!","commenter_a":"Vet everyone coming in","post_message":"“No. I would not allow people to come in from Syria. They’re not vetted properly. They’re moving in by the thousands.”   Donald J. Trump reaffirmed his commitment to a ban on Muslims immigrating to the United States, arguing that it is better to build \"safe zones\" in Syria. What do you think?"}]
