[{"comment_id":"10152868223844342","commenter_b":"You all ladies is nutts","commenter_a":"The mom went looking for trouble. This all would not have happened if she would have been the adult and just let it go, but she couldn't. She payed the ultimate price and now this teen is going to have to answer to a judge. No one wins in this situation. Two families lifes are forever changed. Smfh","post_message":"Police tweeted this photo of the suspect in a road rage case that left a #LasVegas mother dead  FULL STORY @webpagelink/  Photo courtesy Las Vegas Police Department"},{"comment_id":"10155285284005389","commenter_b":"This woman is deluded! I think our entire State Department is.","commenter_a":"What a dumb liberal idiot.","post_message":"“We cannot win this war by killing them [ISIS], we cannot kill our way out of this war.”  That is according to our very own State Department.  State Department Deputy Spokesperson Marie Harf told Chris Matthews that we cannot win this war against ISIS by killing them.   So what is her solution to stopping radical Islamic terrorists from murdering and taking over territory?   Job opportunities.  Seriously!?"},{"comment_id":"10155548661776509","commenter_b":"You are right, it isn't Trump supporters, this latest hidden Veritas video will give you a hint: @webpagelink","commenter_a":"I don't think it was Trump supporters who did this, everything is spelled correctly.","post_message":"Vandals set this black church ablaze and scrawled the words \"Vote Trump\" in crude, white spray paint. @webpagelink"},{"comment_id":"10154274349426051","commenter_b":"CAN I HELP AL , GET THE HELL OUT OF THE U, S, A, DUMB ASS","commenter_a":"He is ALL mouth--did anyone really think any of these ppl. were going to leave? WHO would want them?","post_message":"The Rev. Al Sharpton has finally decided if he'll leave the country now that Donald Trump is President."},{"comment_id":"1115311211854904","commenter_b":"We don't need more people coming here from anywhere. Immigration is to benefit the country not the immigrant. We gain nothing by allowing more here when we can take care of our own","commenter_a":"North Carolina here voting TRUMP 2016","post_message":"\"I'm the only one that speaks my mind and tells the truth and everybody knows I'm right.\"  Today on \"MediaBuzz,\" Donald J. Trump discussed his proposed temporary Muslim ban. @webpagelink"},{"comment_id":"1084559504898393","commenter_b":"It altars your natural hormomes! Explains why there are so many beta bitches running around. Wonder if the artificial hormones affect future children somehow too","commenter_a":"@username 😬","post_message":"Could the pill be altering your brain?"},{"comment_id":"10153967377745894","commenter_b":"She has some fat tits. Lets be real","commenter_a":"I don't know why she feels the need to show her tits Wherever She Goes.","post_message":"See how Mariah Carey's relationship with billionaire James Packer began to fall apart on Mariah's World."}]
