[{"comment_id":"10153370562061336","commenter_b":"Drugs are illegal. I bet you could buy all the drugs imaginable in an hour. Guns would be the same if outlawed","commenter_a":"He is such a big fat piece of trash !! He always point out stuff that is the most stupidest crap Iv ever seen !! That boy could have made a bomb or took a knife or a bat in there and killed people also ! So should we take away knifes and bats ! People around this guy didn't know he was crazy ? I feel like people are trying to set it up where they take away all guns then they could do what ever they want to to us ! Guns don't t kill people crazy people do and if it wasn't a gun itd been some thing else he'd killed people with ! I hate that this happened I'd never want any one to get hurt or killed we all need to be as one !! We are all Americans first !!!","post_message":"“We do know that once again innocent people were killed, in part, because someone who wanted to inflict harm had no trouble getting their hands on a gun.”  President Barack Obama spoke moments ago on the #CharlestonShooting: @webpagelink"},{"comment_id":"843353782366711","commenter_b":"Not soon enough I cannot stand she's a pathetic liar a disgrace to our country","commenter_a":"Oh please let it be! Haven't we suffered enough?","post_message":"Hillary EXPOSED!"},{"comment_id":"1202021696499916","commenter_b":"Whos paying her","commenter_a":"as your house comes crumbling down","post_message":"An open letter..."},{"comment_id":"1007821319338322","commenter_b":"She's a piece of work.","commenter_a":"She is nothing but a conceded witch, only standing by her unfaithful husband because he was the POTUS, and therefore a untrustworthy, spiteful person who only cares about herself. I see a demon in her when she laughs!!!","post_message":"The book claims she repeatedly screamed obscenities at her husband, Secret Service personnel and White House staffers — all of whom lived in terror of her next tirade."},{"comment_id":"662069217316990","commenter_b":"Sorry Bitches !!! Go to jail !!","commenter_a":"Yes!!yes!!!!!yes!!! that;s a shame!! just think?? if that was your mom! or dad????","post_message":"These thugs tortured nursing home patients for an insane reason.  These two are monsters. Let's lock them up and throw away the key.  Do you agree these thugs should do life?"},{"comment_id":"10153286809849726","commenter_b":"She is a racist","commenter_a":"What a loser ..Disgrace to the United States..","post_message":"WATCH: Ann Coulter Blasts Michelle Obama on Race: 'I Think She's Just Letting Out Her Reverend Wright Now'"},{"comment_id":"1740985292881312","commenter_b":"And the KKK was started by and always was....the militant arm of the Democrat Party.","commenter_a":"The KKK purports to be a Christian group and they have committed more acts of terrorism against American citizens than any Islamic group. The biggest terrorist threat is from white, Christian men.","post_message":"Food for thought!  Thanks to Help STOP Truth Decay."}]
