[{"comment_id":"10154899725050329","commenter_b":"All of those children have worked since before they were 16. A simple Google search would have told you that. I love how everyone assumes shit like this.","commenter_a":"I bet Ivanka or Donal Jr never humbled them selves like Sasha. It's obviously not about the money but about her learning the definition of hard work. @username Santiago Wolf @username","post_message":"\"You ain't lying around my house all summer.\" —FLOTUS"},{"comment_id":"10153016776944117","commenter_b":"Cause she was terrible. @webpagelink","commenter_a":"Because they are willing to sell out.","post_message":"From RUSH drummer Neal Peart to Rep. Paul Ryan to Uber CEO Travis Kalanick. Why do famous people deny that they admire Ayn Rand?"},{"comment_id":"10153471873556770","commenter_b":"@username - afraid your husband will be deported huh?","commenter_a":"These Clowns are hilarious Dracula aka Cruz and Cruella Devile aka Fiorina ....She was dying for some spotlight....Well she will get if for about another month...Then Bye Bye weirdos","post_message":"During Carly Fiorina’s acceptance speech for running mate with Sen. Ted Cruz, Fiorina sang a made up nursery rhyme to Cruz’s daughters."},{"comment_id":"1088078934585187","commenter_b":"She is a pest!","commenter_a":"Does she not realise that her actions will encourage pest infestation of insects & rodents, germs will have a field day, right next to where she's raising her child?","post_message":"Some people are just scum"},{"comment_id":"10154003941470950","commenter_b":"Elizabeth Lilly what a ignorant women you are","commenter_a":"His first 100 days will be tremendous. So tremendous and full of catering to Russia. Bigly. He will keep us in suspense as he plans to steal back the money he spent for the campaign. So many plans. Big plans. And we're gonna pay for it. Bigly.","post_message":"Trump is about to speak to a crowd about what his first 100 days in office will look like: @webpagelink"},{"comment_id":"741809245917684","commenter_b":"THOSE 3 BITCHES...ARE GETTING THE SHIT GANG BANGED OUT OF THEM NOW.","commenter_a":"IS is recruiting sluts for sex only son","post_message":"Aqsa Mahmood, 20, left her home in Glasgow in 2013, and married an IS militant in Syria."},{"comment_id":"1614898715485754","commenter_b":"No need to worry, Just Drink a Coffee ☕","commenter_a":"Brad Sherman","post_message":"Two days ago, an enormous asteroid flew past Earth. It was half as close as the moon. And we barely saw it coming."}]
