[{"comment_id":"10154996547968010","commenter_b":"Let the muther fucker SUFFER!","commenter_a":"Think he'll be well enough in time for Trump to appoint him to the SCOTUS?","post_message":"A source said Manson was seriously ill and it was unclear how long his treatment would take."},{"comment_id":"10154883119407969","commenter_b":"1. Asylum isn't the same status as refugee. 2. Kyrgyzstan isn't Syria Yikes.","commenter_a":"George. I hate to break it to you but your reporting is a little faulty! You said no Syrian Refugee ever did any harm to us? You clearly aren't familiar with The Boston Bombers. Both Syrian Refugees! BTW George, OBAMA BANNED MUSLIMS FOR 6 MONTHS IN 2011. ANY THOUGHTS?????","post_message":"WATCH: George Stephanopoulos interviews Kellyanne Conway about President Trump's immigration ban, countries not included and comments from Republicans on the order: @webpagelink"},{"comment_id":"10152980541131336","commenter_b":"These creeps need to be exterminated.","commenter_a":"Islam is winning...","post_message":"German police canceled a popular carnival street parade less than 90 minutes before it was set to begin, because of fears of an imminent Islamist terror attack."},{"comment_id":"1038590639515127","commenter_b":"Jennifer BTW how is that being a bitch. Bitch?","commenter_a":"And ALL of their body guards carry guns","post_message":"This video is packed with more celebrities than we could count — and they have one powerful message for the world."},{"comment_id":"992775434136459","commenter_b":"That is all these losers have.","commenter_a":"Screw that ignorant pido, GO TRUMP GO","post_message":"Here are the 6 TWEETS..."},{"comment_id":"1269577516395609","commenter_b":"So your saying CO2 is NOT a gas?? Where did you study chemistry?","commenter_a":"If that was gas.... the fireworks would have gone off as soon as the air was saturated enough to be visible.","post_message":"No, that's not fog. It's a gas leak.  @webpagelink"},{"comment_id":"1371582852881168","commenter_b":"She's definitely a weird bitch !","commenter_a":"Stein you lost by zillions go home and get a job","post_message":"JILL is just fishing for money is all...?  @webpagelink"}]
