[{"comment_id":"1417299944952004","commenter_b":"They are illegal immigrants. Reagan granted amnesty in the 80's and it was to be a one time thing for those already here. Settled once and for all. But they keep coming. And this problem is not just from Hispanics although they make up the majority of inflow. If they couldn't come legally then they shouldn't be here. People have been coming legally for 100 years (like my father and his parents). No excuses. They are breaking the law and need to be deported.","commenter_a":"All he has is big ego","post_message":"Dude! Really??!"},{"comment_id":"1115942415111321","commenter_b":"You are a woman, you are worthless, you shouldn't vote. See? That's how you sound. Btw, #hillaryforjail.","commenter_a":"I did not know Gov. Mike Pence. Thanks @username, I like his backbone. Voting Trump/Pence Donald J. Trump thanks for standing firm for the safety of America.","post_message":"If you ever had any doubts about Donald J. Trump sticking with his divisive and dangerous plan for America—say hello to his new running mate."},{"comment_id":"1224337737632979","commenter_b":"I thought it was absolutely hilarious. Maybe the hood rats should have a bit more respect rather than planning their next drug deal.","commenter_a":"If she can't handle her job and behave professionally, then she shouldn't be an educator. Period. Her being a teacher and all you would think she would be able to find another way to get her point across. The way she spoke and behaved was unacceptable. She grabbed that boy and then went on to say racially inappropriate things. She's a disgrace to teachers.","post_message":"Aren't teachers suppose to be the example?  #WSHH"},{"comment_id":"1173282172788559","commenter_b":"Sick sick woman","commenter_a":"How evil can these people be","post_message":"Oh. My. Gosh. Things just got weird really quick. @webpagelink"},{"comment_id":"10153076463414753","commenter_b":"If a woman in a bikini top was eating, would you also become this aggressive and immature ?doubt that very much. Grow the hell up.","commenter_a":"and why should we have to move our seat, or \"look away\"? we pay our money for a peaceful meal, not a side show!!!","post_message":"A woman in a cafe was nursing her child when she was approached by a man who asked her to cover up. That's when the cafe owner stepped in and had a few choice words to say."},{"comment_id":"10153888455618128","commenter_b":"That's what happens when power vacuums get filled.","commenter_a":"And how did they get so strong in Iraq while you are president?.....exactly","post_message":"President Barack Obama said Islamic State had lost about 40% of the populated areas it once controlled in Iraq. “And it will lose more,” he said."},{"comment_id":"10157696214715603","commenter_b":"Lol @username not gonna happen","commenter_a":"Don't believe the media...Hillary's poll numbers are falling faster than Bill Clinton's pants in an Arkansas trailer park...","post_message":"Hillary Clinton forcefully challenged the FBI's new email inquiry Monday, declaring during a campaign rally in battleground Ohio, \"There's no case here.\""}]
