[{"comment_id":"1094669133962671","commenter_b":"Well folks that's more reason that woman will never be president","commenter_a":"Alright, That's it!","post_message":"JUST IN"},{"comment_id":"1616274731928330","commenter_b":"Did you see where in California they are registering Illagals to vote, guess who they will vote for?","commenter_a":"Obama distracts us while he slips his executive orders by us with out much attention. Democrats weren't for gay and lesbian or transgender rights until Hillary needed more votes. Last election Hillary ran in, she is on video saying marriage is between a man and woman. She flip flopped and so did the party for more votes.","post_message":"Hey, Leftists: you want to stand up for LGBT folks? How about joining conservatives in speaking forcefully and honestly about the MURDER of gays and lesbians by MUSLIM terrorists inflicting SHARIA LAW?  Oh...that's right, Obama doesn't allow you to talk about that. So instead you \"boldly\" focus on men using women's changing rooms and bathrooms and ignore the DEATHS of hundreds of gays and lesbians, because identifying their killers would require you to utter the words \"Islamic terrorists.\"  Gee, how \"noble\" of you, how \"brave.\"  #phonies #poseurs"},{"comment_id":"10154263809393598","commenter_b":"A very sick lady, Murderer. Lier. Corrupt.","commenter_a":"SHE WILL EAT THOSE WORDS ONE OF THESE DAYS","post_message":"As the debate begins, remember.... Hillary Clinton: An Unborn Child Just Hours Before Delivery Has No Constitutional Rights"},{"comment_id":"1044864242277400","commenter_b":"@username Of course you haven't ever heard a group of 59 year old women bragging about \"popping a Tic-Tac\" so they could forcibly kiss a handsome man. And never have I heard this same age group say, \"grab'em by the d*ck\", nope, it doesn't happen...","commenter_a":"I am still trying to figure out how this man became a surgeon. Are you sure that his license and everything or legit cuz he is a total nut","post_message":"Ridiculous!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153375560764087","commenter_b":"\"We should let all the Muslims in or they'll kill us.\" -What Liberals actually believe","commenter_a":"Is rep McCaul suggesting that a large percentage of otherwise peaceful and law-abiding Muslims are ready to put that to one side and become violently active simply because someone like Trump says something outrageous? Why does McCaul place such low faith in the Muslim community? And if he is right then isn't he proving Trumps point?","post_message":"“Anytime somebody is making inflammatory statements about Muslims or whatever, they can take that and use it to their advantage for recruiting purposes,” House Homeland Security Committee chairman Rep. Michael McCaul. “They take things like this and they spin it, to inflame the Muslim world, to get more recruits to join the cause to fight in Syria.”"},{"comment_id":"10154449367595470","commenter_b":"Trump means GET RID OF MUSLIMS","commenter_a":"This is typical of the Hillary group","post_message":"Local republicans say they don't think the act of vandalism was done by a Trump supporter but they say they don't condone that type of behavior. They are hopeful it will stop and be replaced by actual conversations about opposing ideas."},{"comment_id":"462218217236106","commenter_b":"Transgender? It's a Guy who wears girl shit. That's no Transo, that's a stupid crossdresser who can't tell the difference between a P and a V. Sheesh! This country is Fucked up on this stupidass politically-correct bullshit. Wipe the makeup off and take the wig off or you'll get that shit Scraped off and that wig Split by angry parents and/or boyfriends.","commenter_a":"LET ME FIND OUT MY DAUGHTER, GRANDDAUGHTER HAD THIS FREAK WALK INTO THE SAME RESTROOM WITH THEM AND FOUND OUT THE SCHOOL OKed IT I`M GOING TO OWN A BIG PART OF THAT SCHOOL SYSTEM! THIS FREAK IS A MALE AND ALWAYS WILL BE ONE, HE HAS MALE DNA, MALE GENES MALE FINGER PRINTS A MALES RIB CAGE AND MALE PLUMBING NO SUCH THING AS A TRANS GENDER! THIS FREAK NEEDS TO STOP PLAYING DRESS UP AND PRETEND! HE MAY GET MORE THAN HE`S LOOKING FOR BY SOME DAUGHTERS DAD!","post_message":" girls have rights, and they shouldn have to share a bathroom with a boy, said a parent. See how this transgender student is causing a firestorm in a Missouri high school."}]
