[{"comment_id":"487670684715042","commenter_b":"because someone has to protect your pansy ass","commenter_a":"If these guys are so tough with their guns, why aren't they serving right now in The Middle East?","post_message":"Who will save us from tyranny in the produce section now? -Linda"},{"comment_id":"10155035981661159","commenter_b":"So I take it she does not plan to work in the near future, for she may not fit any parts with cropped hair.","commenter_a":"Who is she???","post_message":"This didn't work out very well..."},{"comment_id":"654997668024145","commenter_b":"WHAT a dumb bitch!!!","commenter_a":"Looks like she has eaten one to many spud herself!","post_message":"Michelle is now targeting a common supermarket food.  That's enough. We're tired of Michelle.  Do you agree Michelle should just go away?"},{"comment_id":"10154228719381545","commenter_b":"I, personally, am quite capable of disliking people of ANY color, @username, if the person deserves it. Stop with the cries of racism because somebody doesn't like a person born with more melanin. I would despise that woman if she'd been born gold-leafed. You're a relic. 'Cut it out.'","commenter_a":"I for one can't wait till they are gone. The money she spent from our taxes is overwhelming. And her lavish vacations are a discrase. I could go on bit I will stop there. Good bye get out!","post_message":"There are certain words that have been used to describe Michelle Obama: Open. Authentic. Unapologetic. It’s that last one that Oprah Winfrey zeroed in on."},{"comment_id":"10153550520716336","commenter_b":"Hillary might be in jail.","commenter_a":"It's obvious that @username wants Jeb Bush to be the Republican nominee. On the Debate last night, NO ONE received harder questions than Donald Trump. NO ONE! I don't want Jeb Bush or Donald Trump to be the nominee. @username you're NOT being Fair and Balanced.","post_message":"Which GOP presidential candidate do you think gave the most impressive performance during the Fox News-Facebook prime-time debate?"},{"comment_id":"1142218742523327","commenter_b":"No just Hillary now get back to your cat.","commenter_a":"They go together both fruit cakes","post_message":""},{"comment_id":"1766066213681675","commenter_b":"@username trophy wife No. 3 was a soft porn model who also lies like through her teeth. No wonder she squints so much, trying to find her sugar daddy's pee pee!","commenter_a":"\"Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s.\" --Melania Trump","post_message":"\"Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s,\"  Charles Harder, a lawyer representing Trump, said in a statement."}]
