[{"comment_id":"10154796667456037","commenter_b":"#NeverTrump #MakeAmericaGreatAgain","commenter_a":"LMFAO Surprise Surprise !!!!!!!","post_message":"“Why should he get part of my rent, and why should his name be on there?”"},{"comment_id":"10153922572740950","commenter_b":"No she was saying don't do it Keith.","commenter_a":"Dummies... she was telling the cops, \"Don't do it\". Did you not hear her NUMEROUS TIMES say, you better not shoot him. Don't do it. HE DOESN'T HAVE A GUN. I suppose she changed her mind halfway through. Smh","post_message":"Warning - Graphic Content: The Charlotte-Mecklenburg police department just released the officers' body cam footage taken during the shooting of Keith Scott: @webpagelink"},{"comment_id":"2071257249766331","commenter_b":"Only American enemies would want to remove it!","commenter_a":"Like","post_message":"There is no reason whatsoever that justifies removing this picture. Can we get 5,000 'LIKES' to keep it in the Museum?"},{"comment_id":"10155662877255354","commenter_b":"She is f#$%&@+ stupid.","commenter_a":"Fucking stupid liberal fuckers","post_message":"And look how much the fine would be if you didn't."},{"comment_id":"10153240747000326","commenter_b":"anything to keep a woman from being elected President!","commenter_a":"#feelthebern !!","post_message":""},{"comment_id":"10153492850468984","commenter_b":"Tear them down! Burn them - just get rid of them and start a mass deportation of Muslims!!!","commenter_a":"First time I see one I am going to the ACLU and sue Islam is a dangerous cult and it offends me...","post_message":"Some of these claims seem quite bizarre. I wonder how this will be received by the American public.  What do you think?"},{"comment_id":"1796926360545603","commenter_b":"I well tell you some thing... The isis was made by usa","commenter_a":"Vote Trump. .... what's the matter killary fans u guys worried. ... U should be","post_message":"We are going to get rid of ISIS! America needs real leadership. #MakeAmericaSafeAgain"}]
