[{"comment_id":"952491891550656","commenter_b":"It's CA...go figure...N CA that is which is even worse","commenter_a":"Too bad there is not a \"Dislike\" button","post_message":"JUSTICE."},{"comment_id":"997942853639367","commenter_b":"Shut up ! this is ridiculous ! I refuse to allow illegal immigrants to pour into this country.","commenter_a":"Yes","post_message":"Seattle Mayor Murray, officials and advocates are holding a press conference in response to President Trump's executive orders on immigration.  Do you think Seattle should remain a sanctuary city?"},{"comment_id":"1658721937683357","commenter_b":"It is a machine for women. Google it.","commenter_a":"Who's Sibian?","post_message":"This may be  to a beach near you!  @webpagelink"},{"comment_id":"554155158094381","commenter_b":"Christie is killing ittonote! I'mactually a Cruz supporter. Sorry Ms. Pendleton but u cant have 15 people on the stage and get anything worthwhile discussed. I like Mrs. Fiorina,I think she is brilliant, but she didnt get enough supporters. Sorry for that cause I think she would be a great first woman president. However, we have to end with an electable candidate that will beat the demo candidate, cause we dont need another Obama presidency. Electing Clinton would be electing another Obama.","commenter_a":"ABC is doing a horrible job of not including Ben Carson in any of the debate questions since the question of Senator Cruz cheating him out of votes in Iowa.","post_message":"WATCH LIVE: Republican presidential candidates face off in the ABC News #GOPDebate in New Hampshire. Watch all of our debate coverage right here! @webpagelink"},{"comment_id":"1208908179197618","commenter_b":"Who do any of these \"woman\" think they are? The show SUX Whoopie go eat another side of beef!!!!","commenter_a":"They are both empty headed idiots!","post_message":"Loud mouth Whoopi and her co-hosts are making serious unfounded accusations and demanding Trump step down.  Let's get 5,000 'SHARES' & 'LIKES' to show that Whoopi is the one that America wants to see \"STEP DOWN!!!\"  @webpagelink"},{"comment_id":"10153181017133690","commenter_b":"Okay white terrorist","commenter_a":"Christian Terrorist","post_message":"\"This was not a dispute over a parking space, this was a hate crime,\" Mohammad Abu-Salha, the father of the two slain women, said. \"This man had picked on my daughter and her husband a couple of times before, and he talked with them with his gun in his belt. And they were uncomfortable with him, but they did not know he would go this far.\" @webpagelink"},{"comment_id":"943618162339946","commenter_b":"^ What an asslicking, apologist bitch.","commenter_a":"It's his fathers fault.... He had warrants and ran.... Then tried to run over police.... Look up the story before u believe this wack ass page- that boys father deserves to be charged with murder","post_message":"Courage, bravery, hero, protect, serve... These words are not affiliated with the cops who killed this boy.   Full story → @webpagelink Police The Police | Filming Cops"}]
