[{"comment_id":"10154345626992549","commenter_b":"First off Executive orders are largely symbolic. Building a wall will do absolutely nothing for illegal immigration and drug trafficking other than to satisfy the small minority of Americans who voted for Trump. The tax payers will have dole out billions to build this \"wall\" without benefit. You can't even call this a viable \"infrastructure\" project. I do agree with deporting illegal criminal offenders and would go even further by deporting criminals with legal but non-permanent status. Not only from Mexico but anywhere. Ireland, Israel, Africa, etc...","commenter_a":"Isolationism does have consequences.","post_message":"This afternoon, President Donald J. Trump is expected to order the construction of his long-promised wall along the U.S.-Mexico border and take other executive actions on immigration. @webpagelink"},{"comment_id":"1570583689633777","commenter_b":"There is no sense in even trying to reason with these people. They are a whole level of crazy I don't want to be around. Scary! I didn't see riots like this when Obama was elected-because we have class and integrity. Trump will lead this country like no other! I can't wait for the future of America!🇺🇸🚂❤️","commenter_a":"Our country is full of spoiled people who are so used to having things their way, they act like a class of 5 y/o kids who didn't get the green marker! Come on, this country has the same electoral system that has worked without problem for hundreds if years. No one rioted when any other person has been elected, altjpugh i am sure many people felt disappointment. And the democrats and supporters whole campaign slogan was \"stronger together, peace, love, equality\"......... Which all I'm seeing is a true fit being thrown by people who didn't get their way. Funny how true colors come shining out when the world they are used to getting their way in doesn't quite work out. Peace, love, equality, anti hate??? I think not supporters. Your example is clear.","post_message":"Protesters burned American flags and chanted \"not my president\" despite Democrats' calls for a peaceful transition of power."},{"comment_id":"10153141603253352","commenter_b":"Melissa shut the fuck up!","commenter_a":"Those Black Companies are NOT affiliated with ANY Black Supremacy Groups that's the BIG DAMN DIFFERENCE. WAKE THE FUCK UP PEOPLE.","post_message":"KKK erects billboard in Arkansas advertising local White Pride radio station featuring shows 'This is the Klan' and 'White Women’s Perspective'"},{"comment_id":"10152993021545667","commenter_b":"The Donald brings women to be his wives to the USA so they'll marry him and make them legal citizens, did it twice","commenter_a":"Support Donald Trump.","post_message":"\"I cherish women,\" Trump told Hannity on Tuesday night."},{"comment_id":"10155818308010354","commenter_b":"Black thugs.","commenter_a":"Idiots!","post_message":"It wasn't enough for the mob of 50 teens to ransack the Walmart.  When they saw the disabled man in the motorized wheelchair, they wasted no time..."},{"comment_id":"1383456038414113","commenter_b":"We got the house the Senate and the White House. LOL your liberal agenda happen no more.","commenter_a":"TWO YEARS...VOTE EVERY ONE OF THESE BASTARDS OUT!!! They have proven by pass this legislation that they are unfit and untrustworthy to serve the people that they purportedly \"represent!\"","post_message":"They're so brazen..."},{"comment_id":"1325725004111513","commenter_b":"They're both adulterers. Trump cheated on his first 2 wives","commenter_a":"It is actually possible for both to be true: Trump is a conniving, egomanical pig who won't stop at destroying others to get to the White House and Cruz is a lying adulterous pig who would also be a big hypocrite. Sigh. And all of it unfolding on Good Friday. You can't make this stuff up....","post_message":""}]
