[{"comment_id":"1032286876827841","commenter_b":"Yes most LEGAL immigrants do but not the illegal invaders.","commenter_a":"Immigrants pay more taxes and work harder than SOME AMERICANS.... i know some","post_message":"Most Americans agree: We must provide a path to citizenship for our immigrant families."},{"comment_id":"10154289975556336","commenter_b":"She agreed to follow the dress code if she was unable to wear heels then she should have asked for an accommodation.","commenter_a":"Dress code violation..if you don't like the dress code find another job. I'd rather not wear pants to work, but I have to anyway because it's the dress code. Suck it up.","post_message":"Dress code violation or sexism?"},{"comment_id":"1061797757169218","commenter_b":"Save Western Civilization? You mean save white people.","commenter_a":"And where was our so called president ??????","post_message":"The prime minister of Israel, Benjamin Netanyahu, gave an historically important speech. A speech that any previous American president could have and maybe would have made, a speech to rally and save Western civilization."},{"comment_id":"1136168619776218","commenter_b":"Now he knows what she's capable of. Either he dumps her now and risk her wrath, or stays on knowing he'll be culpable for any harm perpetrated against a woman he cheats with.","commenter_a":"Throw them both off, it takes two to tango, at the end of the day though its best you know sooner rather than later if he/she is a no good for nothing cheat, cheating on your partner is the worst kind of betrayal, you're better off without them","post_message":"Don’t mess with my man!"},{"comment_id":"10153328761996051","commenter_b":"Put her DUMB ASS in jail","commenter_a":"Meanwhile murders of innocent people take a backseat to this stupid ads story","post_message":"This woman vandalized the office of the dentist who killed Cecil The Lion. Here's how that worked out for her."},{"comment_id":"1699094263675768","commenter_b":"Let's review the facts: The shooter was a Muslim. He pledged allegiance to the Islamic State. He targeted people that patronized a gay nightclub in the U.S. Daesh executes homosexuals. Jihadis don't believe in coexistence and they don't spare pacifists. Oh, and you cannot reason with these savages. Questions?","commenter_a":"And Obama and Hillary want to disarm us and bring a hundred thousand of these kind of people over here","post_message":"Breaking News: Police say 50 people were killed and 53 were injured in the Orlando nightclub shooting and are asking the governor to issue a state of emergency.  Fox News can confirm that the gunman is Omar Mateen, 29, of Port St. Lucie County, FL, a US citizen of Afghan origin. @webpagelink"},{"comment_id":"602032646612178","commenter_b":"It's a very very last resort. We would have to live with it for the rest of our life. I am a responsible gun owner. Guns are meant for hunting and in case of a immediate threat on your or someone else's life only. #Berniesanders","commenter_a":"The guns themselves don't worry me. It's the people who demand having them that worry me. They never have legitimate reasons. It always boils down to paranoia and delusions of grandeur based on violence. Not the kind of humans I want to see armed.","post_message":"Multiple other vehicles were hit by gunfire, too. How many other angry Little Fellers are out there with guns?  -Conover"}]
