[{"comment_id":"10152692514188299","commenter_b":"All this talk...............start calling your congressmen, bombard them with calls until they DO something....................","commenter_a":"What the hell is wrong with this guy? Most Americans are against this.","post_message":"Five More Terrorists Transferred Out of Gitmo … @webpagelink"},{"comment_id":"10153063599505950","commenter_b":"Hope they change the entire show. Take both women off tv and replace with meaningful entertainment.","commenter_a":"So nice","post_message":"Kathie Lee Gifford returned to TV for the first time since Frank Gifford's death: \"He passed away instantly that morning, all dressed in what he knew was my favorite outfit -- white shirt, very tight black jeans -- having his coffee, watching his TV, getting ready to go, ready for church, and excited about what we were gonna have for lunch.\""},{"comment_id":"497892010370754","commenter_b":"I should be arrested for the nuclear bomb I just dropped in the women's bathroom at my work. You'll never take me alive!","commenter_a":"I hope his family sues the shit outta that school so his entire future is paid for, Racists fucks","post_message":"\"Cool clock, Ahmed. Want to bring it to the White House? We should inspire more kids like you to like science. It's what makes America great.\"  - President Barack Obama"},{"comment_id":"439739816151059","commenter_b":"Last election, I voted democrat, for the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the ...","commenter_a":"Why the fuck is UW Cali giving her money? Naughty naughty.","post_message":"Three of her top political donors are Goldman Sachs, Citigroup and JP Morgan. Is there anyone left that still believes the shit politicians say?"},{"comment_id":"10153610090283598","commenter_b":"But everything is wrong with killing someone to gain at their expense!","commenter_a":"Wow. So you can't be \"successful\" without birth control? Women can't be successful if they become mothers? Women can't be successful unless they're childless? This modern feminist movement is ridiculous. It tells women they can't have a life if they have kids. True feminism teaches that women can do anything they set their minds to because they are strong and capable. And another thing, Miss Lawerence. You have access to condoms and birth control through many other outlets that do not kill innocent children for profit. It is delusional to believe otherwise.","post_message":"Hunger Games Actress Jennifer Lawrence: Thanks to Planned Parenthood I’m a Successful Woman"},{"comment_id":"1177607535665632","commenter_b":"That is sickening! Who are these wild, viscious, beasts that we allow to walk our streets with a loaded weapon \"in the name of the LAW\"? They are just low life sub 60 IQ, sociopaths. They are over paid and forget who signs thier paychecks. Wake up Americans!","commenter_a":"That poor soul...you can see his body struggling to stay alive. I sure hope these fuckin cops don't get away with this...disgusting!","post_message":"There was no reason to kill him."},{"comment_id":"10152849864834342","commenter_b":"Woman can be evil also.","commenter_a":"Sad.","post_message":"Rebekah Holly Speer, 36, is charged with cruelty to animals after authorities say they found several dead dogs -- at least one shot and stabbed -- at a home in the 3500 block of Deep Anchor Way"}]
