[{"comment_id":"1162468617182722","commenter_b":"The magic number is 2026, half of 4051 . Bernie gets to that number the superdelegates have to support him.","commenter_a":"Bernie could win every state from here on out and Hilary would still be leading in the polls and delegate count. ..","post_message":"Hillary Clinton's margin narrows to just 6 points over rival Bernie Sanders."},{"comment_id":"10153232997868352","commenter_b":"Serve her right she should have been in her house doing house work or school what the hell she doing out in a battle field throwing stone, lack of parenting","commenter_a":"that is horrible. This needs to be told all over the news. Sounds like something SA would do instead of Israel.","post_message":"Palestinian girl, 14, locked up in Israeli prison for two months for throwing rocks"},{"comment_id":"10155234645559199","commenter_b":"Kerri Andreson","commenter_a":"Janie Marsh","post_message":"A man in his 30s drowned at the Wild Waves theme park in Federal Way."},{"comment_id":"10156236766360354","commenter_b":"WHAT??? It doesn't designate the Black Lives Matter and the Black Panthers as terrorist organization for constantly calling on blacks to kill cops and white people and CAIR, but they want the NRA designated as one even though they threaten no one? This is absolute bullshit & I'm so tired of the attack on our 2nd Amendment rights!!! We MUST stand against this!","commenter_a":"NOT","post_message":"Here's how far the Left is going with this..."},{"comment_id":"902219749819813","commenter_b":"Mad gangs are those who want to draw another map. If a woman doesn't want you will you force matters. Ukrainians and other countries don't want Russian. For then to survive they want a friend indeed to protect them to the aggressor. PUTIN","commenter_a":"NATO is the biggest ever gangster-organ./ bunch of WARCRIMINALs.. existed on earth.. and as such.. the biggest threat to world-peace of our time..","post_message":"A top Russian military commander says Moscow considers NATO missile installations in Eastern Europe “priority targets.”"},{"comment_id":"10154186163347483","commenter_b":"Are there illegals enrolled at AU?","commenter_a":"They get lot more money from those students. It's about money","post_message":"A statement from the university said: \"Auburn is an international university. Students, faculty and staff from all backgrounds strengthen our campus, and we remain committed to fostering an environment that upholds our values of inclusion and diversity.\""},{"comment_id":"498847790306569","commenter_b":"Scott, the guy was born and raised in New York City, the \"Wall\" you speak of would ideally be built to keep Mexican citizens from illegally entering the U.S. The \"Wall\"you speak of will not keep U.S born citizens off of the terrorist list, nor will it keep them from being bigoted disgusting pieces of shit who intentionally hunt down large groups of unarmed people and kill them because of their sexual orientation.","commenter_a":"I blame that peice of shit obama.stop letting in these fucking idiots. Build a fucking wall now! !!!","post_message":"Officials have started removing bodies from inside an Orlando nightclub where 50 people were shot and killed.  Sunday night, workers brought four bodies on stretchers out of club Pulse and loaded them into white vans. The action was repeated over and over."}]
