[{"comment_id":"10152804418020326","commenter_b":"Another FREAKING ASSHOLE. You repeat that comment you idiot after someone rapes you!","commenter_a":"what a sicko","post_message":""},{"comment_id":"10152776407520047","commenter_b":"Good someone see him for what he is , wake up. Before its to late .","commenter_a":"Thank you ACLJ","post_message":"Today, a federal appeals court upheld a previous ruling against the Obama Administration's unconstitutional Executive overreach.  Impatient Presidents don't get to change the law. READ MORE."},{"comment_id":"10153409033281833","commenter_b":"How is it racism the mulford act wasn't supported by the nra?","commenter_a":"In the 1960's when the Black Panthers were arming themselves and encouraging inner city blacks to arm themselves as protection from the government the NRA was an active advocate of gun control....and then they found they could make more money arming back woods, uneducated white guys. @webpagelink","post_message":"Amid a surge in violence in Milwaukee, the Republican-controlled Wisconsin Senate voted to repeal a state law that requires a two-day wait for handgun purchases. Just before the April 21, 2015, vote, the author of the bill, state Sen. Van Wanggaard, made this waiting-period claim: \"There no statistical evidence that it reduces violence whatsoever,\" the Racine Republican declared."},{"comment_id":"10153289541199614","commenter_b":"Thank God he blessed me! Don't gotta do that","commenter_a":"stupid is has stupid does! Forstes Gump","post_message":"A concerning new trend on social media shows young women trying to imitate the big-lipped pout of 17-year-old reality TV star Kylie Jenner of the Kardashian family.  The so-called #KylieJennerChallenge requires suctioning one lips into a shot glass or bottle. Some young women are ending up with painful bruises, photos on Instagram and Twitter show.  The challenge could result in injuries to nerves, muscles and trauma to the blood vessels, a plastic surgeon says.  Read KTLA's story here: @webpagelink"},{"comment_id":"10154441744191509","commenter_b":"WE STAND WITH TED CRUZ----WE WONT VOTE FOR JIMMY NUTS CARTER ENDORSE TRUMP OR ILLEGAL ALIEN AMNESTY PROMOTER RUBIO.","commenter_a":"Jessi Spires Ben Kraja Alex Gochis Tyler Teejay Chase","post_message":"Three white nationalist leaders have formed a super PAC for Donald J. Trump, even though Trump doesn't want their support.  #NewHampshire voters are getting a robocall with a simple, disturbing message."},{"comment_id":"1292924254103022","commenter_b":"RACISTS EVERYWHERE! SMDH! HILLARY DOESN'T have to PAY for the BLACK VOTE! RACISTS SHOULD KNOW that by NOW! Lol! She was under PRESIDENT OBAMA! The BLACK VOTE IS HERS from the beginning.","commenter_a":"lets see, hillary was SHOCKED at trumps language 30 years ago and then invites and praises someone who uses language that would even make a sailor blush......shame, shame, shame........disgusting is disgusting is disgusting and TRASH is TRASH no matter who is saying or singing the words.......and hillary not only apparently supports this type of language and music, but invites them to share her state.......so disgusting","post_message":"CROOKED Hillary Praises Cop Haters Beyonce And Jay-Z Who Drop N-Word Bombs All NIGHT! BOYCOTT!!!"},{"comment_id":"10152981477461717","commenter_b":"Sissy bitch is not a word used to just discriminate against gays. Sheesh. Stop trying to be a victim.","commenter_a":"Donald Trump for president! Fuck that sissy bitch Anderson.","post_message":""}]
