[{"comment_id":"10153814761109705","commenter_b":"So are fat chicks!","commenter_a":"It's always amusing when it's celebrated to mock some, but when it's other's it's called \"shaming\" and it's frowned upon. Looking forward to your next article on fat chicks saying fat is cool and healthy!!","post_message":"Twitter is calling it #YallQaeda."},{"comment_id":"508820039306289","commenter_b":"This should be in every state. Men that force themselves on a woman do not deserve to have the ability to rape again.","commenter_a":"I dont understand the verbiage \"violent sex offenders\". Isn't rape always violent, are their non-violent rapes I don't know about?","post_message":"This state did it, what about yours?"},{"comment_id":"10153301604366680","commenter_b":"Get OUT !","commenter_a":"NH. Nah. NH. It's ok. NH. Isn't IA. Don't worry. NH. I","post_message":"It was bad."},{"comment_id":"10152619754670950","commenter_b":"So than move Israel and let him be your leader, see ya, we don't need ya!!","commenter_a":"The only backlash is from the white house... I welcome him anytime.","post_message":"Israeli PM Benjamin Netanyahu is going forward with plans to speak to Congress next month @webpagelink"},{"comment_id":"10153216182159087","commenter_b":"Your FAILED IRAK WAR, for one, you stupid evil BITCH...","commenter_a":"Hey, Obama, WHY don't you have any decent responses on your EVIL warmongering failures around the world?... just cowardly U.S. policies... your shamed administration should at least stop being so hipocritical...","post_message":"“We can’t have no response,\" says Michael McCaul. \"And this administration has absolutely failed to put any sort of consequence on their actions.”"},{"comment_id":"452202411637006","commenter_b":"There here in the us feed them pork to hell with them if they don't want to eat pork go back where they come from keep the. Lunch day she should not of been fired that bull shit vesta","commenter_a":"pork them all!!!!!","post_message":"Lunch Lady Fired For Serving Pork To Muslim Student.  'LIKE' if this is WRONG!!!!!!"},{"comment_id":"1673051799421609","commenter_b":"WOW SHE'S AS DELUSIONAL AS HER WACO HUSBAND!","commenter_a":"she is nasty","post_message":"While speaking to a crowd recently, Michelle Obama suggested men viewed her as a sex symbol. She didn't anticipate the response. The video speaks for itself."}]
