[{"comment_id":"1134932883194388","commenter_b":"down, look at the squares on the sides","commenter_a":"I think up it is hard to say!!","post_message":"o.O"},{"comment_id":"906009439519420","commenter_b":"Sure, give 'em free food, free healthcare, free education, a driver's license, free housing -- am I missing anything. We can take in millions of refugees. Why not? Just because we're broke and have to borrow the money from China means nothing. Just cut the military and give the savings to the refugees. Bring in more and more. So what if some of them are terrorists who will kill and blow us up. Obama says they are like the Mayflower Pilgrims. Afterall, we're transforming America, right?","commenter_a":"fight it as long as possible, they don't deserve food stamps.","post_message":"Here it comes, gang..."},{"comment_id":"10152624556380667","commenter_b":"He was a true man in every word about iranian government. Thanks Mr President","commenter_a":"America gives you billions, trillions over time and when you include weapons, Iron dome, etc and America does it while American children and American poor struggle and as America infrastructure crumbles, really?????","post_message":"Israeli Prime Minister Benjamin Netanyahu pleaded with Congress  on Tuesday to take a harder line against Iran, saying the nuclear deal being negotiated \"doesn't block Iran's path to the bomb; it paves Iran's path to the bomb.\""},{"comment_id":"1052919424727810","commenter_b":"@username go ride your train off a cliff ya Californicator!","commenter_a":"I think we should ban people who wear socks with sandals next! They look even dumber than people using selfie sticks!","post_message":"Planning on going to the Evergreen State Fair in Monroe this year? Well keep your selfie sticks at home."},{"comment_id":"10156348163835354","commenter_b":"This is exactly what we need..someone to shake up the illegals..make them realize that they cant stay here..these officials are part of the problem ..trump isnt crapping on latinos..he jist wants them to be here legally..obama and past administrations have turned their heads and not dealt with..we have a big problem now...go trump","commenter_a":"Really that is a bunch of nonsense! They would only be fearful of someone enforcing the Rule of Law for ALL... IF they have broken any laws. Anyone here legitimately -- they have nothing to fear at all! This Hispanic Lawmaker is sounding a false alarm! Instead of defending illegal aliens he should be working to improve the lives of the citizens and legal constituients he represents. Why is he working so hard to help those who do not belong here but doing nothing for those leagally here that needs the job he's allowing the illegals to stay at?","post_message":"“Mr. Trump’s racist remarks and his continued rhetoric demonizing Latinos and immigrants has created fear within these communities around the country....\""},{"comment_id":"501432243350902","commenter_b":"The blood will be on your hands when the terrorists and illegal aliens kill American citizens, you child molesting PIECE OF SHIT!!!","commenter_a":"\"ELECTED\" enforcers for the largest criminal organization on the planet.","post_message":"BETRAYAL.  #RINOStampede"},{"comment_id":"10154830070756337","commenter_b":"I feel good Hillary is going to win","commenter_a":"I'm with her!","post_message":"We're counting down to Tuesday's election. Tell us how you feel..."}]
