[{"comment_id":"1000192243373586","commenter_b":"The little bitch should serve time.","commenter_a":"It's not white privilege. It's called \"daddy is connected\". Still doesn't make it right","post_message":"This girl had so many drugs that her sentence should be more than 200 years -- read on to find out what she's going to actually get."},{"comment_id":"10154522993923854","commenter_b":"She's a crazy idiot!","commenter_a":"TIME TO END THE CLINTONS POLITICAL CAREERS NOW..","post_message":"IT TURNS OUT HILLARY CLINTON IS THE ONLY PRESIDENTIAL CANDIDATE WITH TIES TO THE KKK"},{"comment_id":"10153425632179342","commenter_b":"Getting awfully tired of MEN telling WOMEN not to get pregnant. We can not without your sperm.","commenter_a":"This is a disgusting decision. Planned parenthood has done so much for women's health and to cut off funding will kill so many women. Short-sighted idiots. You are not pro life, you are pro birth, to hell with the before or after.","post_message":"Planned Parenthood affiliates statewide were told in a letter why they were being cut off"},{"comment_id":"470357549819863","commenter_b":"Another Blind Bitch!!!!!","commenter_a":"Wow. How sad he has really done a lot to get us back on track after what GW bush left him with and am sorry that all these post are being done by redneck asshole","post_message":"How would you define President Obama in one word?"},{"comment_id":"10153288827596523","commenter_b":"@username her momma should have taught her manners, and respect, you might consider doing the same.","commenter_a":"That poor little girl just learned she can cause problems, then ignore her teacher and the school administrator and the police. She really learned a lesson, didn't she?","post_message":"The South Carolina deputy who slammed a disruptive student on the floor and tossed her several feet has been fired."},{"comment_id":"501775896685267","commenter_b":"She is a POS!!!!!!!!LIAR too!!!!","commenter_a":"NO","post_message":"Hillary Clinton has been defying stereotypes about what women can accomplish her whole life. Would you like to see her do it again this November?"},{"comment_id":"10152664925256717","commenter_b":"A business that is open to the general public should not be allow to discriminate . If I knew she belonged to the southern baptist I would have never given her by business anyway. Too many businesses out there would have loved to cater to your wedding.","commenter_a":"She looks a bit of a lesbian herself. Maybe a frustrated one! But anyway.... take that mama!","post_message":""}]
