[{"comment_id":"928522093922469","commenter_b":"The plans he has put in place, is FILL AMERICA WITH MUSLIMS AND ILLEGALS....\"GROWTH OF THE ECONOMY IS HIS MUSLIMS AND ILLEGALS IN PLACE FOR A WAR\" SO HE DOESN'T HAVE TO LEAVE THE WHITEHOUSE......WHY DO YOU THINK HE SAID HE WAS GOING TO STAY IN WASHINGTON FOR 2 MORE YEARS, SO \"SASHA\" COULD GRADUATE THERE? HE SURE IS NOT GOING TO PAY THE COST OF HER SCHOOLING OUT OF HIS POCKET....... WAKE UP, AMERICA....THE REASON HE IS NOT IMPEACHED, IS BECAUSE MOST OF THE ONES WHO WOULD HAVE DONE IT, ARE NOT AMERICANS, BUT ARE MUSLIMS.....","commenter_a":"To have a strong economy you need more Americans working and Obama's policies stand in the way of Americans going back to work again. Obama did place an incentive for employers to hire new workers BUT he also put a heavier tax burden on employers to keep their new hires.","post_message":"WATCH Obama:  is pretty darn great right now, and making strides right now...And I don expect that these facts and this evidence will convince some of the politicians out there to change their doomsday rhetoric"},{"comment_id":"1164340116952083","commenter_b":"That is the stupidest thing I ever heard. Why don't she give up here ARMED BODYGUARDS.","commenter_a":"Never ever going to happen!!!","post_message":"She must have PTSD from all that sniper fire in Bosnia...."},{"comment_id":"1742501459315047","commenter_b":"SORRY HILLARY IS PRISON BOUND.MAYBE YOU CAN WRITE HER.","commenter_a":"Just like she took care of the Benghazi situation?","post_message":"\"I’m afraid because these motherf—kers are coming for us, y’all.”"},{"comment_id":"10153182951850950","commenter_b":"Oh, just stop with the outrage already. African countries sell these permits for more than the price of the average house in the USA, and only allow hunters to take the old males that have already reproduced. The people in the communities get the meat, sometimes by the ton.","commenter_a":"Sad. Money wins","post_message":"Though Zimbabwe's national parks authority said the shooting of a massive African elephant was legal, some conservationists said it's unethical."},{"comment_id":"511120385679668","commenter_b":"Our government pushes meth, heroin and every other drug, but its OK because they say it is?","commenter_a":"Let's not forget that a large portion of the prison population in the U.S. has been incarcerated because of nonviolent drug charges.","post_message":"Listen here: @webpagelink"},{"comment_id":"1194513290647275","commenter_b":"Yep and a drunk driver that got behind of the wheel of a car but didn't hurt anyone should not be taken away from their family and put in jail when they were caught????","commenter_a":"She's a threat to no one. They just took a mother from he children who were born in this country!! We are the one's who are threatening the lives of people who trusted us and came here to make their lives better, just like Trumps mother did. Just think, if they had sent her back we wouldn't be dealing with this heartless man! What a blessing that would be. He's done more damage in less than 3 weeks than Nixon did in about 6 years and he wasn't this bad!!","post_message":"Immigration agents “said she’s a threat, but my wife isn’t a threat,” her husband said in an interview."},{"comment_id":"10152955356009071","commenter_b":"I know I said LMAO, but really hit me up... could use the help. ;-)","commenter_a":"Dear anyone... please contact me if you're up for some pro bono work to sharpen your skills! Lmao!","post_message":"It's a known fact that hacking makes money. But how much money?"}]
