[{"comment_id":"1175628809124795","commenter_b":"Geena -_- those jerks","commenter_a":"Leave it to the u.s to ruin this cool idea!","post_message":"Why are people such assholes?!"},{"comment_id":"10153318281418984","commenter_b":"Racist and Illegal!","commenter_a":"Not very inclusive.","post_message":"Imagine a \"whites only\" field trip. Al Sharpton would be licking his chops and hopping on the first plane to Indiana.  Do you think what this school did is wrong?"},{"comment_id":"1558544671099313","commenter_b":"Go to hell","commenter_a":"He is such a joke ! I wish he would go back to where he came he's not even an AMERICAN !!!!!","post_message":"This makes my blood boil!"},{"comment_id":"10155893621460231","commenter_b":"That's her prerogative ....","commenter_a":"Take it are leave it! but get a life.","post_message":"The singer—along with a lot of other people—isn’t buying it."},{"comment_id":"10153987081447894","commenter_b":"D muthafucka!!! Learn to speak English!! Well Muthafuck you!!!!","commenter_a":"My condolences to his family and friends 🙏🏽😔","post_message":"Actor Bill Nunn, Best Known as Radio Raheem in ‘Do the Right Thing,’ Dead at 62 [Photos]"},{"comment_id":"1051057634970056","commenter_b":"Poor woman","commenter_a":"Pro choice equals anti Christ. Stop having sex tie your tubes. No need to kill","post_message":"This is a win for women's reproductive rights."},{"comment_id":"1482796298404171","commenter_b":"@username that's such a nice thing to say","commenter_a":"As an Asian non-American, I have a lot of similar feelings with people from the video. However, one thing I do not share is the that even I am not American, not born here, you still don't get to say \"go back to China\" to me. I go where I want and I came here legally. America could be more friendly.","post_message":"An editor for The New York Times wrote an open letter to a woman who told him to \"go back to China.\" Asian-Americans responded by sharing their own racist moments using #thisis2016. Here are some of those moments.  Warning: This video includes racial slurs and vulgarities."}]
