[{"comment_id":"10153471873556770","commenter_b":"@username - afraid your husband will be deported huh?","commenter_a":"These Clowns are hilarious Dracula aka Cruz and Cruella Devile aka Fiorina ....She was dying for some spotlight....Well she will get if for about another month...Then Bye Bye weirdos","post_message":"During Carly Fiorina’s acceptance speech for running mate with Sen. Ted Cruz, Fiorina sang a made up nursery rhyme to Cruz’s daughters."},{"comment_id":"712674415565701","commenter_b":"Fuck off you nasty hoes.","commenter_a":"Her tale is just the beginning...there's getting ready to be an avalanche of women coming forward...","post_message":"\"His hands were all over me. It was an assault.\" Here, Jessica Leeds of New York tells how a three decades ago Trump raised the armrest separating their seats on a plane and reached up her skirt.  Video by Occupy Democrats, LIKE our page for more. Credit: New York Times."},{"comment_id":"10154884706896729","commenter_b":"She wasn't worthy to be a. Olympican","commenter_a":"Then she gets disqualified and out of the Olympics!!! Send her home!","post_message":"Islamic anti-semitism on full display, folks..."},{"comment_id":"10153752964580575","commenter_b":"I'm ashamed of you Mary, rape is rape. Lord help you if you ever get in that situation.","commenter_a":"I don't doubt Bill Clinton and Bill Cosby were with these women. My doubt comes from what is rape. When a woman wants something from a man and is willing to give sex for it , is that rape ?","post_message":"Bill's past is coming back to haunt Hillary. . . ."},{"comment_id":"10152944576132061","commenter_b":"Good thing they aren't dogs- the barbarians would skin them alive and eat the,.","commenter_a":"@username I want one for my birthday!!!","post_message":" China debuts its newborn panda twins: @webpagelink"},{"comment_id":"10152778117529117","commenter_b":"Don't bother putting on those slippers, Princess. Instead, let's get men to carpet the whole fucking world for you.","commenter_a":"Let's stop men's definition of consent, because all rape laws were designed to help men get away with the crime. Electronic devices on the male penis, if he gets out of control ZAP--- might be effective. Hey if women controlled technology what kind of world would we have?","post_message":"The reality of campus rape cases is more boring than Rolling Stone's story of ritualistic gang rape at UVA: Alcohol abuse is almost always the real culprit, and the problem for which there is an obvious solution."},{"comment_id":"930066070388844","commenter_b":"ANd Every one seems to have forgotten the 11 airliners still unaccounted for close to a year now","commenter_a":"That means trouble","post_message":"UPDATE: Hundreds of TSA badges missing at airports (VIDEO)  @webpagelink"}]
