[{"comment_id":"1171553619565468","commenter_b":"I can't even watch the View. Those women are bullies and *itches and make me want to slap them.","commenter_a":"Whoopie and Joy make me sick. They are so rude and disrespectful that I'm amazed they still have jobs.","post_message":"Whoopi and Her Liberal Hacks at 'The View' Tried to Bully Trumps Manager, But She Knocked Them The Hell OUT in Front of MILLIONS! (VIDEO)  Everyone's SICK of Hillary's scandals! Lets get 4000 SHARES if you are too!!!"},{"comment_id":"10157473875275354","commenter_b":"The fact that he is pledging his support after this email scandal, proves that he is now being bought by Killary!","commenter_a":"A leaked memo shows the Bernie Sanders campaign considered asking the Democratic National Convention for a private plane as part of his endorsement of Hillary Clinton to help his movement energized. Feel the burn of corruption!","post_message":"WATCH the mass march and see just how \"united\" Democrats are...against Hillary Clinton!  \"Hell No, DNC, We Won't Vote for Hillary!\" #DNC"},{"comment_id":"537705639687363","commenter_b":"@username you are wrong ! All the other religions follow AMERICA Laws!! Only Muslims want to bring in their Sharia laws for their JUSTICE , and their law on us and they can't , because Our Constitution, And We As Real American Citizens Will not change our Laws of Justice, for their BARBARIC 7th century murderous, degrading practice!!! Ship you are a bleeding heart Liberal!! Trump is not trying to divide us , He is trying to save this Country from people like you, Hillary, Bernie and that kiss ass Muslim OBAMA!!","commenter_a":"American Muslims are American. Just like American Catholics. Just like American Jews. Just like American Methodists. Just like American Presbyterians. And all the other Americans of various religions. Stop trying to divide us. Trump wants to secure our borders. Why is that wrong? Trump wants to end ILLEGAL immigration. Why is that wrong? Trump wants to verify that legal immigrants are not here to harm our citizens or create havoc. Why is this wrong?","post_message":"This is what American Muslims think about our presidential candidates. You might not be too surprised by what they had to say."},{"comment_id":"10154113431396037","commenter_b":"Wolves in sheep's clothing","commenter_a":"...sickos for 'god'...","post_message":"The Christian Prayer Center website not only charged consumers $9 to $35 for prayers but also \"deliberately\" confused some consumers into signing up for recurring monthly payments, according to authorities."},{"comment_id":"10153083814076051","commenter_b":"Americans! Utilitarians. They have no use for you unless they can use you.","commenter_a":"@username said it all.","post_message":"This dog has one little deformity. Still, his owner decided it was just too much to deal with and opted to get rid of him."},{"comment_id":"916716405122968","commenter_b":"@username your name says it all!","commenter_a":"someone needs to mention the senior citizens in this country. We have not had a COLA raise for two years. BS. We might be old, but WE VOTE!","post_message":"Miners have one last shot in this election - the coal industry will be nonexistent if Crooked Hillary Clinton wins the presidency this fall. It is time to MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1425549500793527","commenter_b":"I hope Ellen tells them all to eff-off. America needs to take a stand against these whiney brats.","commenter_a":"It's hilarious not racist!!!! Come on!!!!","post_message":"People are not happy with Ellen DeGeneres' Usain Bolt photo."}]
