[{"comment_id":"1092094194179315","commenter_b":"Because I have read other shit she has posted and the BITCH talks crazy THAT'S WHY @username!!!!","commenter_a":"Wondering, where are the people saying, \"he should've complied with police orders?\"","post_message":"Protesters in Fresno, California, waved the Confederate flag & signs that read “White Lives Matter” to express outrage over a local unarmed white man’s police-involved shooting death.   Several shouted “f**k the police” and threw water bottles and glass toward a line of policeman gathered near the crime scene. DETAILS ---> @webpagelink"},{"comment_id":"841387199293221","commenter_b":"Lol bitch ass no life","commenter_a":"Who cares about a road named after we want justice for her and her killer or killers in jail for murder so sad hoping we get justice sad it takes this to game a road names after you praying for your family and friends rip Sandra justice 4 Sandra","post_message":"It is the same stretch of road on which she was arrested."},{"comment_id":"10153567353788984","commenter_b":"I will have one long after your ass is gone","commenter_a":"that just show the driver of the truck isn't paying attention what is going around his ride. That ass hole would be wearing salt rock in his britches","post_message":"I don't care what your opinion on the Confederate flag is, there's no denying that what this guy did is truly insane..."},{"comment_id":"1252197194828825","commenter_b":"One of the 2 things I don't like","commenter_a":"Smokers are disgusting","post_message":"WARNING TO PET OWNERS: It's not just second-hand smoke that's harmful for your four-legged friends. Pets are also at risk for being exposed to residue that lingers on skin, clothes, carpets, and other household items."},{"comment_id":"2088211734736585","commenter_b":"Stupid cow!","commenter_a":"Your a stupid person","post_message":"Cokie Roberts called supporters of Donald Trump \"morally tainted\" on MSNBC's \"Morning Joe,\" then received a heavy dose of push back."},{"comment_id":"10152777121252217","commenter_b":"Lots of girls called Charlotte if u want to call her it then do nobody will care","commenter_a":"Well we are due a girl in 6 weeks and charlotte was on our list of names 🙈 Well thats not going to happen now because there will be thousands choosing it because of the princess lol","post_message":"#RoyalBaby: Introducing Charlotte Elizabeth Diana - she'll also be known as HRH Princess Charlotte of Cambridge"},{"comment_id":"730431657058963","commenter_b":"Stupid ass talk to text I sent hats off to Mr Gilbert who donated 10.5 million to Toys for Tots you can say what you want about these new country singers but I like mr. Gilbert's music and a bunch of the other ones and if you don't like that you kiss my ass","commenter_a":"You can say what you want but these new country singers other not countries in a sucker most of butter how many people you know to get stoned.5 million for toys for tots hats off to mister yogurt hold a good man and a good singer and if you don't like it like that you kiss my ass","post_message":"“Whether a kid is into Barbie or Star Wars, I hope we’ve given a bit of fun and inspiration.”"}]
