[{"comment_id":"10153806670970329","commenter_b":"No. I'd rather have this Screw spiders","commenter_a":"THIS IS WORSE THAN 100 SPIDERS","post_message":"Always look under your bed! (via BuzzFeed Trending)"},{"comment_id":"10156742074775354","commenter_b":"the millennials need to really research socialism & check out the countries that have it now & they are worse off than ever ...want to wait in lines for food? be lucky to get a loaf of bread, some milk & maybe a little veggies or fruit...guess they would change their minds if they really knew what that would do to this country....jobs worse, financially drained families from such high taxation etc...healthcare would be ...forget it...more deaths ...socialism is plain & outright destruction & more misery than this country could stand....then we'd have bigger problems with the refugees forcing their crap down our throats...is that what you want you idiot millennials?","commenter_a":"This millenial would like to thoroughly dissociate himself with most of the rest of the generation.","post_message":"GENERATION SANTA CLAUS?"},{"comment_id":"10153132244251037","commenter_b":"she lived until she was 86.","commenter_a":"Never smoked a day in my life and never will. I saw my great grandmother suffer for other a year from emphysema that killed her very slowly. She started smoking at age 11 and didn't stop when she was 86 and still had O2 strapped to her face. Her lungs were almost solid black due to all the years of smoking. Its heartbreaking to have to watch your loved one suffocate in their own fluids all because of cigarettes... Seeing that I promised mysf I would never smoke, and I never have. Maybe I will get sick anyway, but at least I know I have the choice whether or not to expose myself to such a horrible toxin ridden thing. I still font understand why people ever pick one up knowing the effects on the body","post_message":"America's biggest #tobacco companies say they are ready and willing to pass along factual public health information about cigarettes."},{"comment_id":"797236390409541","commenter_b":"Stfu no one wants to hear your mouth.","commenter_a":"Donald Trump is a BIG Government Authoritarian and progressive fraud from New York City He's NEVER been a conservative, and he NEVER will be conservative -- he's an actor, a phony, pretending to be what he's not.","post_message":"I'm getting really tired of this."},{"comment_id":"486046958252551","commenter_b":"What gets me though is why are these atheist bitches so offended by something they don't even believe exists Just proving their true ignorance I guess...!","commenter_a":"GOD BLESS AMERICA!!!!!!!(keep it going!)","post_message":"This student was told not say 'God bless America', but he's not backing down.  Amen. We stand strong with this student and his flag.  Do you support 'God bless America' staying in schools?"},{"comment_id":"10153780723343984","commenter_b":"the Muslim parents could have kept their brats at home that day and celebrate their butts off.","commenter_a":"Yes","post_message":"Tempers flared after this city's board of education refused to take a day off of school in observance of an Islamic holiday, and these Muslim parents were NOT happy about it.  Do you agree with the decision these school officials made?"},{"comment_id":"648946631962582","commenter_b":"NO. This will never happen to me.","commenter_a":"No","post_message":"Every single American is to be microchipped within the next year.  This is a violation of our rights.  Will you let them do this to you?"}]
