[{"comment_id":"10157928279665500","commenter_b":"Why did they have babies to begin with? People like them have no business having babies - period. Don't believe in birth control - don't have sex.","commenter_a":"This makes me sick! The parents don't look like they missed any meals! Lock them up and throw away the key!","post_message":"The nurse also told police there were feces in one of the child ears and that the child looked  a skeleton. @webpagelink"},{"comment_id":"10154129546231545","commenter_b":"Romo a true gentleman and it took alot for him to do that, better to be up and walking than being in sever pain the rest of your life. Thank you for being a model for the younger players! A true Cowboy. ..","commenter_a":"Luckily, he has someone very close by to talk to about the benefits of being a backup QB on a Super Bowl quality team.","post_message":"Today wasn't easy for Tony Romo.  He's not the starting quarterback for the Dallas Cowboys anymore.  But he handled the situation with dignity:"},{"comment_id":"10152884468574877","commenter_b":"Happy birthday you beautiful queen","commenter_a":"Happy Birthday!!!!!","post_message":"We are wishing Lupita Nyong'o HAPPY BIRTHDAY today!!  The Academy Award winning actress received her masters degree in acting in 2012 from the Yale School of Drama and in 2014, she was named \"The Most Beautiful Woman\" by People and \"Woman of the Year\" by Glamour.  LIKE and SHARE to celebrate!! >>>@webpagelink"},{"comment_id":"10154070103774916","commenter_b":"Shillary can't beat Dumper because she can't hold on to the Bernie followers who will leave the DemoRatic Party as soon as she gets the nomination. We aren't Democrats and we won't vote for her. #MassExodusOfTheDNC","commenter_a":"Hillary Clinton and Demographics and the American people will CRUSH Racist Republican Lying Cowards Donald Trump or Cruz.Who are vile bigoted ignorant chicken hawks warmongers un-American racist hateful assholes. HILLARY 2016.","post_message":""},{"comment_id":"10154133413586350","commenter_b":"Not cow milk. We are the only species who drinks another animals milk. You've been sold to drink milk because it gives you calcium but it does the complete opposite. It's all about $$$ Do your research, people! Cow's milk is not good for us.","commenter_a":"My siblings and I were fed carnation milk from a can and then whole raw milk from the bulk tank in the barn We're are all healthy and allergic to nothing.","post_message":"Is nonfat, low-fat, reduced-fat or whole milk best for your children?"},{"comment_id":"1139906406032404","commenter_b":"you are an idiot!! AND STOP KILLING ANIMALS!! They have souls too you creep!!","commenter_a":"Ok. So release the previous 5 years. That will provide an accurate picture of what to expect when the audited returns are ready for release.","post_message":"Donald J. Trump's son thinks that his tax returns should stay private."},{"comment_id":"10153264678366336","commenter_b":"98 percent of the illegals don't show up for their hearing.","commenter_a":"All future liberals lol.","post_message":"Some judges believe the backlog is expected to get worse."}]
