[{"comment_id":"10152733465191051","commenter_b":"Karma is a ×itch!","commenter_a":"What goes around, come around. Can't feel sorry for a woman who screwed up her own life, and took it out of a child.","post_message":"A woman who killed her daughter and never served any jail time for it has just been found dead."},{"comment_id":"1097784373632154","commenter_b":"He always stands up... Except for when it's time to bend over for Trump.","commenter_a":"I have never stopped liking Cruz...He always stands up for what he believe in...Sometimes that puts him at odds with other Republicans.","post_message":"Excellent question..."},{"comment_id":"2033407076758008","commenter_b":"Ghetto Trash !!!!","commenter_a":"Why would the \"demoncrats\" dump Brazil's ... nah ... to start with she's black like ODUMBER and after all she fits right in with CROOKED KILLERY ...","post_message":""},{"comment_id":"10152807177319753","commenter_b":"There's a lot that factors into our timely death. We can decide to die early. I.e. Suicide. And we can die cus of our own stupidity... Jumping off a building without a parachute. It can be because of health problems. But even with all these possibilities God is the one who truly decides when we go. That's why we have so many stories that are miracle stories. Ppl surviving when they shouldn't. And sometimes unfortunately we are taken so soon. The reason being that we are all here to serve a purpose on this world for God. And when we have done such... Then God brings us home. If you read her nieces comment she lived a fulfilling life. And what ever the reason may be she completed her life. Losing a loved one is hard. I have lost a dad, and seven friends and my own kid being 23. ...","commenter_a":"GOD MAKES NO MISTAKES. SHE DIED 7 DAYS LATER. THE NUMBER 7 MEANS COMPLETION. HER LIFE WAS FULFILLED. GOD MADE THIS DECISION. I SYMPATHIZE WITH THE FAMILY, HOWEVER GOD WILL MAKE SURE THOSE CHILDREN ARE LOVED THROUGH FAMILY AND ALL THAT LOVE HER. HER LEGACY CONTINUES THROUGH HER SONS.","post_message":"After 20 years of being unable to conceive naturally, the mother had spent a decade going through various fertility treatments in hopes of having children. After 30 long years, Lisa’s dream came true and she found out she was not only pregnant, but pregnant with twins. Unfortunately, the joy was short-lived, as she passed away just seven days after her babies’ births."},{"comment_id":"10153519151958984","commenter_b":"Leave the park alone, it should be a safe haven for enjoyment; TAKE THE BLACK BITCH DOWN, she has no business being there with that attitude.","commenter_a":"There is so much STUPIDITY in the world anymore. I don't think we should discriminate by race or religion but could we just get rid of the stupid people!","post_message":"A white woman was holding her toddler and minding her own business... but then this black teenager saw her and did something awful.  The entire scene was caught on video... can you guess why Al Sharpton isn't saying anything about this?"},{"comment_id":"1647473612211471","commenter_b":"Trump has done nothing against the law and if he did why didn't they file charges or even report it....This is just bull and not important...but on the other hand Hillary can and will be in trouble with these email leaks...statue of limitations is not up on her...so there can be charges brought up on her","commenter_a":"The fact is, that you people have lost all credibility with anyone with the ability to think for themselves...Your obscene bias, is so obvious, it's not even funny anymore....The NY Times has even less credibility, and is viewed as even more bias and corrupt than @username or People, because the previous allegation the Times made a few months ago, was **proven false by the \"victim\" herself**. And you have to understand that the election is *temporary*, and after the election is over, your ratings will still be at records lows, except your reputation/credibility will have been permanently shot, permanently destroyed. This is the price you, your producers and executives have paid to try and skew this election towards Hillary at any and all costs...","post_message":"Ex-beauty queen says it was humiliating for Donald J. Trump to be backstage, \"before you could put a robe or kind of dress yourself, he walked in. Some women were half naked, others were in the process of changing.” @webpagelink"},{"comment_id":"10154369349733812","commenter_b":"Take your hate, elsewhere, lady.","commenter_a":"Big f'n deal","post_message":"Pres. Barack Obama and First Lady Michelle Obama announce their daughter Malia will attend Harvard University in the fall of 2017, taking a gap year after her high school graduation next month."}]
