[{"comment_id":"1266165143423955","commenter_b":"This woman is such a moron. Send that lunatic Syria then see if she still thinks they ate doing gods work what an idiot","commenter_a":"Your kidding right ? Sick out of it, to hate that much.","post_message":"HOLY F*CK!"},{"comment_id":"10152926851271336","commenter_b":"My God leave the Good Doctor alone. Don't see you going after those that treat patients in their mammogram buses and doing blood and plasma draws that happen to be far more dangerous. Give the guy a break. He is licensed to practice in that state, the entire state. Can you blame the Dr. after what Obamacare has done to folks. Jesus Lord...go after POTUS for putting people in this position in the first place, without healthcare, sucking what was left of Medicare that the elderly needed and driving up healthcare coverage so govt gets a buck.","commenter_a":"Need more like him and fewer like Obama.","post_message":"Mississippi health officials are threatening to revoke the medical license of an 88-year-old doctor because he treats patients out of his Toyota Camry. Dr. Carrol Landrum says his patients are too poor to travel to him, so he goes them."},{"comment_id":"869042603191993","commenter_b":"Good! Then STFU you two!","commenter_a":"So they jab him when they invite what's his face to address the congress, now they jab him with this letter to Iran. I mean are you kidding me?","post_message":"\"The letter sent on March 9th by forty-seven Republican Senators to the Islamic Republic of Iran ... is beneath the dignity of an institution I revere.\"  - Vice President Joe Biden"},{"comment_id":"1560863080640101","commenter_b":"Moron! She got what she deserved.","commenter_a":"VERY SAD","post_message":"This craze is out of control.  (From Elite Daily)"},{"comment_id":"10154142695231378","commenter_b":"Jesus for president!!!!","commenter_a":"This loser is not my President !!!","post_message":"#LIVE: President Obama holds first news conference since election."},{"comment_id":"1025607307502400","commenter_b":"@username do you not understand what rape is? Many women are unintentionally impregnated by a RAPIST. Involuntarily having sex is what rape is, if you didn't catch that. A women's should be able to choose if she wants to have an abortion, with advanced technology we can safely perform these procedures. Abortion is NOT A contraceptive, it is a last resort and if you wanna take the baby and provide for it along with the thousands of other rape victim babies then go ahead.","commenter_a":"Look I'm not all for abortion, nor all against it, let me just say my peace like everyone else has, and that we are all entitled to.. A females choice about her body, is exactly that, her choice. I'm not saying abortion ahould be used for a form of BC or a contraception, there are other ways, educate your children, its not just the girls in this that need it. All children need to be educated. But lets get surreal, how or what do u know about that female walking in to planned parenthood, little to nothing about her story. How do u know she didn't get raped, or isn't going thru some kind of abuse (whether it be physical or emotional) u don't know. We cannot judge people, who gives another that right, and all I have to say is those doing the judging I hope to hell u ...","post_message":"Hillary's Hypocrisy is Astounding www.eaglerising.com"},{"comment_id":"10153881107946680","commenter_b":"Another Misogynist","commenter_a":"\"I'd grown up fearing the lynch mobs of the Ku Klux Klan; as an adult I was starting to wonder if I'd been afraid of the wrong white people all along - where I was being pursued not by bigots in white robes but, by left-wing zealots draped in flowing sanctimony.\" -- Clarence Thomas Vote Trump. He's easier to impeach.","post_message":"\"Long overshadowed by Scalia, the quiet radical is poised to shape his legacy.\" Via POLITICO Magazine"}]
