[{"comment_id":"10153727792982217","commenter_b":"Written by a 14 year old, no doubt!","commenter_a":"300 times more massive??? Someone needs sacking and a lesson in English 😂😂","post_message":"After a five-year journey, NASA's Juno Mission to Jupiter is ready to apply the brakes.  #BBCGoFigure"},{"comment_id":"10153844148480579","commenter_b":"Only when they try to use it as the basis of their platform or legislation. Then it is a big negative.","commenter_a":"Media Silent As Muslims Ethnically Cleanse 60,000 Christians In Philippines By: Daniel Greenfield When thousands of Muslims become refugees, then you can’t get the media to shut up about it for weeks. Thousands of Muslim migrants... jewsnews.co.il","post_message":"Do you consider religion when evaluating a candidate?"},{"comment_id":"10153301053671770","commenter_b":"What do they call a female dog ?","commenter_a":"He wants back in the white house so he can shame us again.","post_message":"Clinton let out her inner dog during a speech Monday."},{"comment_id":"10153315672229091","commenter_b":"It's not cheap, it's very expensive. the apartments on either side, below and floors above have to be treated to truly eradicate the pest from the building. All that cost big $$$$ It's not funny. I don't blame her for looking for an inexpensive way to kill them. She should have done more research tho","commenter_a":"Theres people laughing and then I'm reading \"Stop being cheap and call an exterminator...... Who knows if this woman call an exterminator for an estimate and it was way above her budget none of us know that everyone go through different things I wouldn't recommend dousing yourself in rubbing alcohol but I'm sure if she would have looked on line she could have found a more better way. I don't understand how people can sit here and judge the next person like as if their better than the next. At least she apologized if that's the case and if thats how you feel then you should reach out and help her afford an exterminator","post_message":"The woman said doused herself with rubbing alcohol before it was ignited by a stove and oven. She said she had turned on the stove and oven the previous day to heat up her apartment, on advice from a neighbor, as part of the effort to kill the bedbugs."},{"comment_id":"10153292055736367","commenter_b":"This is the problem with the Left: too dogmatic, judgmental and lacking in imagination. There is more than one way to think about this and more than one way to vote one's conscience... @webpagelink","commenter_a":"I'm voting for Stein if Sanders loses the nomination. Here's why... @webpagelink","post_message":"\"It is time to stop playing the game.\""},{"comment_id":"692144217642823","commenter_b":"A lesbian trap in a mans body...say what.","commenter_a":"How can Caitlyn get the award for woman of the year if she still has a dick ????","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award.  This is what our world has come to. It doesn't get more absurd than this.  Do you think this is wrong?"},{"comment_id":"1750223515225265","commenter_b":"The other video was funnier and because you didn't get as many likes as her shes a dumb bitch. That's what made this video suck","commenter_a":"She had fun so you call her a dumb bitch. This kinda attitude is what gives pro 2a a bad rap. That and the stupid shit the NRA says.","post_message":"Remember that dumb bitch who went viral for laughing at herself?  @drewhopkins has outdone her.  Shop.TacticalShit.com"}]
