[{"comment_id":"651668038332170","commenter_b":"And the idiots will vote her in.","commenter_a":"Thats true Mr President! A lot of unfair things are happening. Please take control of this country.","post_message":"The system is rigged. General Petraeus got in trouble for far less. Very very unfair! As usual, bad judgment."},{"comment_id":"10154064486021509","commenter_b":"Sure they alienate all woman","commenter_a":"A lot of you folks are so quick to follow the narrative. There has not been a debate in years. Just mud slinging and popularity contests. One thing is true though, the only thing the Clintons should be doing is life in prison. What a dirty dirty dirty duo.","post_message":"Could the GOP's opposition to Planned Parenthood at the #CNNDebate be a general-election vulnerability? Hillary Clinton's top aides seem to think so: @webpagelink"},{"comment_id":"10152955099256336","commenter_b":"They sound like a bunch of babies saying the same thing over and over again. Do it don\"t just say words.that mean nothing. You are not scaring these animals do something.","commenter_a":"Lt. Col. Peters ,just another fool on FOX, Susan Rice.... heads the NSA.","post_message":"“Secure, expand, defend, leverage – her four points. Bill, that’s not a strategy, that’s a bumper sticker. The yogurt I had for breakfast had more intellectual structure.\"   Lt. Col. Ralph Peters slammed National Security Advisor Susan Rice’s speech on the United States’ national security agenda."},{"comment_id":"10156207727725354","commenter_b":"another fucking scumbag please americans this has 2 stop we need term limits or our country is going down the tubes","commenter_a":"We want Trey Gowdy","post_message":"He's the odds-on favorite, but will likely face a strong and credible challenge..."},{"comment_id":"10154524570660579","commenter_b":"IS THAT A BED SPREAD KILLARY IS WEARING. MY GOSH THAT WOMEN IS SOOOOOOOOOOOOOO UGLY","commenter_a":"I am with her","post_message":"Senator Elizabeth Warren campaigns with Hillary Clinton in Ohio.  Watch the complete video here: @webpagelink"},{"comment_id":"1708394149424069","commenter_b":"@username these people spoke in opposition to Trump's Muslim ban by indicating that Muslims are not all terrorists just like all Republicans are not all terrorists. By the way you know the US will never enforce a religious test for immigration NOR will be build a big beautiful wall....that Mexico will pay for :)","commenter_a":"What a wonderfully empathetic understanding and patriotic party the GOP followers now seem to be..to actually disparage this woman is one of the worst things ever...what in the hell is the matter with ALL of these inhuman people?","post_message":"The mother of a service member asked Mike Pence why he continues to stand by Donald J. Trump after his comments about the Khan family.   Many Trump supporters at the rally did not take kindly to her question.  Coverage: @webpagelink"},{"comment_id":"1729114903976145","commenter_b":"Every country in the world should sink down these illegal Chinese fishing vessels wherever they are out of their rightful jurisdiction or territorial waters.They are becoming nuisance to every country's territorial water.","commenter_a":"GOOD, THEY ABUSING ALL THE COUNTRIES TERRITORY AND NOT RESPECTING THEM, THEY THINK THEY CAN JUST COME AND TAKE ANYTHING, LIKE WHAT THEY ARE DOING IN THE PHILIPPINES AND NEIGHBORING COUNTRIES.","post_message":"The Argentine coast guard says it chased, opened fire on and eventually sank the Chinese vessel."}]
