[{"comment_id":"976551429087752","commenter_b":"She is a pathetic little girl who wants to be relevant. Too bad that will never happen.","commenter_a":"Who cares what she says????","post_message":"\"Pop-star' Calls Christians \"F*****g Insane\" and \"Conservative-A** MotherF****rs\"!"},{"comment_id":"1235443589809328","commenter_b":"With any luck they'll find a a way to kill that Russian lapdog Erdgoan. Kurds have a right to exist without fear of those Muslim camel f**kers the Turks. Turkey was helping ISIS, buying their oil, and should pay for it.","commenter_a":"Long live Erdogan (y)","post_message":"Turkish President Tayyip Erdogan accused the United States of supplying more weapons to Kurdish fighters in northern Syria this week, delivering two plane loads of arms to what Ankara says is a terrorist group."},{"comment_id":"1152891968103883","commenter_b":"She is very cute and beautiful little baby but don't present her like,\" world's most beautiful girl\". You are ruining her childhood, i guess it's already been ruined but better late than never. Let her live her normal life please. I could see her turn into justin bieber like child in the future. He was no doubt blessed child but what media attention has done to him?? Spoliled him forever. One thing more how can you claim WORLD'S most beautiful child? World means 200 countries and over 7 billion human beings! Have you seen all of them?","commenter_a":"Not being funny but kids are cute not beautiful..that really sounds wrong unless it's you perents saying it.","post_message":"The controversial ten-year-old has been dubbed 'the most beautiful girl in the world'"},{"comment_id":"1141429345895300","commenter_b":"Why doesn't he close the border and escort all of the illegals & especially Muslims out of our country?","commenter_a":"TIME TO DOWNSIZE DHS. Secret police full of pussies. The whole thing is useless.","post_message":"BREAKING NEWS:"},{"comment_id":"685645904949943","commenter_b":"Go fuck your sister","commenter_a":"59% don't care to show his taxes!!! But I put money on that same percentage CARED about his birth certificate!!!! People of this country make me sick!","post_message":"The Rachel Maddow Show is right –– this is an \"unimaginable corruption scandal.\"  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153227586230047","commenter_b":"He did the right thing","commenter_a":"No","post_message":"While serving overseas, Sergeant Martland intervened to protect a child from sexual abuse.  He deserves to be honored for this heroic action, not punished.     Sign and Share our petition to fully reinstate Sergeant Martland: @webpagelink"},{"comment_id":"920923791276376","commenter_b":"She is a scandal ridden low life scum.","commenter_a":"What does this say about Hillary Clinton?","post_message":"BREAKING - Hillary Clinton's Sex Scandal"}]
