[{"comment_id":"10155018116889371","commenter_b":"She broke the Law, simple as that","commenter_a":"Wait, did Kelleyanne get a new job? Is she now a spokeswoman for Ivanka? 45 will have to fire her. She can't do two things at once. Especially since at least one would be illegal.","post_message":"This is completely unethical and may even violate federal law. Kellyanne Conway—counselor to the President of the United States—just went on live TV to urge people to \"go buy Ivanka's stuff.”"},{"comment_id":"10153737877981409","commenter_b":"What a jerk!!! He thought what he did was a start for his 2020 presidential run. After tonight, he'll never be elected. He shot himself in the foot and his chances for 2020.","commenter_a":"Unfortunate choice. He committed political suicide and will take the name \"Lyin' Ted\" to his grave.","post_message":"Former Trump rival Cruz met with boos during GOP convention speech."},{"comment_id":"939197849433302","commenter_b":"The real issue is the @username illegals flooding the country.","commenter_a":"Dumba** parents for not vaccinating! Selfish way of thinking! What if others get sick because you don't vaccinate your kid(s)!?!?","post_message":"NEW THIS MORNING > One of the biggest autism advocacy groups in the country is telling parents \"vaccines do not cause autism.\" KIRO 7 has discovered which Western Washington school districts are especially at risk for a measles outbreak. Watch here: @webpagelink"},{"comment_id":"1250738951649087","commenter_b":"Only women to ever get you to take your bandana off","commenter_a":"@username when meg would come help you","post_message":"Oh boy!  #WSHH"},{"comment_id":"579776192190480","commenter_b":"Leave now bitch","commenter_a":"Good Bye.","post_message":"Whoopi Goldberg Says She Might Leave The Country If Trump Is Elected. Well I guess she's going to say goodbye. Will you happy to see her go?"},{"comment_id":"10153700669189586","commenter_b":"I think you are an idiot. Zoos are bad conservation centres are good! You want to show your children animals in far too small spaces and teach them this is acceptable? Why don't we then put our toddlers in gages where we can keep better eye on them.","commenter_a":"That's totally insane! BAN ZOOS!","post_message":"The kids' faces say it all."},{"comment_id":"10153617966566051","commenter_b":"Becky Jensen sorry but you are a dumb bitch","commenter_a":"Thank God","post_message":"The man noticed that a woman was crying next to him in line. When he asked her daughter what was wrong, he knew he had to take immediate action."}]
