[{"comment_id":"496037443910043","commenter_b":"MR TRUMP WHEN YOU BECOME PREZ> HANG A FEW DRUG DEALERS ON COURT SQUARE THEN THEY WOULD THINK TWICE ABOUT SELLING DRUGS TO YOUNG CHILDREN AND DESTROYING ENTIRE FAMILIES!!!!!!!!","commenter_a":"Get them out!!!!!!!!!!!!!!","post_message":"Drug dealers are pouring in from the southern border. We will build a wall on time and on budget. #GOPDebate"},{"comment_id":"667515520077863","commenter_b":"I hope she killed herself!","commenter_a":"Terrible","post_message":"This Texas mother and vocal gun advocate snapped and took the life of her own two children over a simple family argument after spending years criticizing Democrats for \"wanting to take her guns away\":  \"A family spat started inside the married couple’s Houston-area home and spiraled into gun violence that spilled out onto their street.  “It was a family argument that turned into a shooting,” Fort Bend County Sheriff Troy Nehls told the Houston Chronicle. “But we’re still trying to put the pieces together.”   Read more HERE: @webpagelink  Thanks to Point Counter Point."},{"comment_id":"1157175910989546","commenter_b":"Why would ANYBODY admit they were a Republican after this years parade of idiots, never mind vote for them?","commenter_a":"Assholes are use of SHIT !!!!","post_message":"Three Republican presidential candidates befriend a pastor who just went on stage and gave the most bizarre anti-gay speech ever."},{"comment_id":"1788538208028189","commenter_b":"those look hellllllla good 😍😍😍","commenter_a":"@username LOL DUDE","post_message":"Insanely delicious."},{"comment_id":"10153233984390950","commenter_b":"Did you think women are incapable of evil","commenter_a":"And the people who are saying the women and children are safe, check out who blew herself up with the suicide vest","post_message":"Police give update on raid near Paris: • Woman wearing explosive suicide vest blew herself up • 7 suspects taken into custody; 2 suspects dead • 5 officers reportedly injured; police dog killed"},{"comment_id":"10153047231286615","commenter_b":"Dogs are innocent. At least a human can report what happens to them and make the choice who they stay with","commenter_a":"But you are all ok with James Harrison? He beat his girlfriend. Vick never harmed A HUMAN BEING.","post_message":"DEVELOPING: Quarterback Michael Vick is on his way to #Pittsburgh to meet with the Steelers, according to ESPN's Adam Schefter..."},{"comment_id":"10154323426879778","commenter_b":"Sad!! Rip LP","commenter_a":"Prayers to the family.","post_message":"The 80-year-old may have been found dead, police said Monday."}]
