[{"comment_id":"1521903891446834","commenter_b":"Oei. Big mothafucka😕","commenter_a":"Oh ooh @username","post_message":"We could be about to witness something enormous."},{"comment_id":"10154129058346509","commenter_b":"Please stay the f**k in Africa!","commenter_a":"With 18 proven ways on overcoming Homosexuality, George's Diary presents to you words of life relevant to this present generation. Homosexuality is not the worst and unbeatable lifestyle, God doesn't hate gays and lesbians. That understanding alone brings hope of overcoming it! You may not be a lesbian or gay but so many people around you are homosexuals, some are secretive about it while some are not! Some wants to change their lifestyle while some doesn't. Your next of kin or even close friend may be a victim of Homosexual without you realising it. Read this article and learn to overcome or help others overcome homosexuality. You can as well do your neighbour good by passing on this article to him or her...... OVERCOMING HOMOSEXUALITY.... Read now!!!!! @webpagelink Or download George's Diary on your Android device @webpagelink","post_message":"Like it wasn't scary enough already. This glass walkway hangs more than a half-mile up a mountain and the glass panel cracked, sending visitors fleeing and screaming. @webpagelink"},{"comment_id":"10153430601099255","commenter_b":"Proving again that ALL FOOLS AREN'T DEAD YET","commenter_a":"Evil attention seeker. Jealous of President Obama.","post_message":"This guy seems so pleasant."},{"comment_id":"536114256579154","commenter_b":"the only thing she needs to do is run straight out of this country.....begone.","commenter_a":"I thought Its name was Michael","post_message":"Michelle Obama could be running for president.  This is a joke. She needs to keep her mouth shut.  Do you agree Michelle Obama is a joke?"},{"comment_id":"10153255421196028","commenter_b":"AMERICA IS MY COUNTRY AND I SPEAK ENGLISH!!!!! ENGLISH ONLY IN AMERICA. NOT SPANISH. I have nothing against latinos BUT come here and get legal.. speak English.. STOP HAVING BAMBINOS IN AMERICA SO WE PAY FOR IT.","commenter_a":"@username, I hope one day you decide to go home as well. Maybe to your own country? Thank you.","post_message":"\"I feel hope again.\" Lorenza Cardenas and her two daughters were living in a small storage unit in a San Diego junkyard -- until things finally turned around for the family: @webpagelink"},{"comment_id":"10156147874195725","commenter_b":"YES AND TAKE GLENN BECK WITH HER.......","commenter_a":"Agreed.","post_message":"I think Megyn Kelly should take another eleven day \"unscheduled\" vacation."},{"comment_id":"1145471005491134","commenter_b":"This woman is dangerous to the American people as are Barbara Boxer and Nancy Pelosi! All 3 of these women have helped over the years to set Americans back 30-40 years. They are simply useless Politicians!! I agree with @username, Diane Fierstein and everyone who voted in favor of her proposed bill should be thrown out of office for violating their Oath of Office. This Bill had it passed would have been in violation of the 2nd and 5th Ammendments, and to attempt to pass such a law is clearly a failure to \"protect and defend the Constitution of the United States.\" Enough of this Liberal Politically Correct BS. Time for change and Hillary and Bernie clearly are not the answer.","commenter_a":"Time to vote the senile out of office or just plain remove them!! How do you prove innocence if you haven't done anything? So they could just accuse you of something and then make you prove you \"didn't\" do it?????? And in the meantime you couldn't get a gun!! Is she for real??","post_message":"You won't believe that Democrat Senator Diane Feinstein just said about due process.  The Democrats are finally unmasked for who they really are, and this is chilling."}]
