[{"comment_id":"1194642483887307","commenter_b":"Still need to deal this evil bitch a Blow","commenter_a":"easy defense... animal was not collared, violated leash laws, and was a threat to their own pets and property.","post_message":"She killed the cat because she believed it was a stray and became a nuisance, but a couple who testified in court this week said “Tiger” was their pet."},{"comment_id":"1123039051096182","commenter_b":"@username Y u so MAD!","commenter_a":"Everyone who verbally attacks BLM are silent supporters of the kkk!! Show me why u hate BLM so much. Show us pics of the smiling around a dead white person or any other ethnic groups body!!! U can't so fuck u","post_message":"Lol: #Virginia #police pulls a woman over for driving without an ice cream cone!  #WSHH"},{"comment_id":"472935749563672","commenter_b":"Able bodied people that are on welfare should be required to work. Taxpayers have to work, why not the leeches on welfare.","commenter_a":"If they are able to work,then yes. They should have to work. Same as they should be drug tested.","post_message":"These free loaders just got some very bad news.  Awesome. It's about time these people are put to work.  Do you agree that people on welfare should have to work?"},{"comment_id":"10154985295149614","commenter_b":" this woman is simply amazing","commenter_a":"This story is inspirational n definitely tells us never to give up no matter what!!","post_message":"Karen Klein walked through 26 freezing miles, subsisting on just twigs and her urine, in order to get help for her husband and 10-year-old son after their car fell in a ditch off a secluded road.    kept her going ... is she didn want her mother to bury her daughter. She didn want her son to be without a mother, Klein's twin sister said."},{"comment_id":"392258217629139","commenter_b":"Does that mean old fat women can go to a strip club and ask for a job when there is an opening and sue if they are turned down?...","commenter_a":"No it's not \"fair\"...she should conform like the rest of us. What the heck is she doing in the \"fashion world\" in the first place? There is absolutely no fashion in wearing a hijab. NONE.","post_message":"Is it fair that this Muslim girl sues for not being able to wear her headscarf when it goes against company's policy???"},{"comment_id":"10153912824075579","commenter_b":"This women reminds me of what I leave behind in the toilet!!!!! And It really stinks! FLUSH!","commenter_a":"Whatever her stylist is doing, keep doing it. Love that green leather jacket!","post_message":" had a pretty long day yesterday. Hillary Clinton addresses the DNC Women Leadership Forum.  Watch complete video from the event here: @webpagelink"},{"comment_id":"1198334626915656","commenter_b":"Bitch","commenter_a":"@username u need this","post_message":"'Bout time."}]
