[{"comment_id":"10154653842272639","commenter_b":"No they don't, they just have a problem with a stupid woman lying and telling everyone it's Alternative Facts..... You are a White Neo Nazi KellyAnne and that is what the problem is.....You don't have power, you have NOTHNG!!!!!","commenter_a":"No we have a problem with fact challenged people","post_message":"“It turns out that a lot of women just have a problem with women in power,\" Kellyanne Conway said about the historic Women's March on Washington."},{"comment_id":"726552340811280","commenter_b":"this female is an ignorant scumbag","commenter_a":"I guess that means yes....","post_message":"I'm not afraid to say these are FAKE TEARS!"},{"comment_id":"10153724968418598","commenter_b":"She must have been taught by Satan himself.","commenter_a":"Who taught her about Jesus? Wow.","post_message":"Abortion Clinic Owner: “The Jesus I Was Taught Would Hold Women’s Hands” as They Abort Their Baby"},{"comment_id":"1239847632704451","commenter_b":"Hillary is the Unindicted Felon!","commenter_a":"That is exactly what pisses me off the most, to see the wealthy paying zero taxes! I pay taxes so I make my contribution to our government just like millions of Americans do! It sucks, really sucks! And then to say it is smart not to pay taxes on National TV? That is an insult to the American people! Bragging about it makes me think that those who support this clown have something wrong in their heads, period! Is this the kind of Commander in Chief we want?","post_message":"There it is, folks!"},{"comment_id":"10153801088312690","commenter_b":"But that's just it. It's not about the transgender. In fact its nothing against them. It's about the fact that it now opens the door to any man out there. How do they want to strip women who were born women from there rights??? How do they want to take our safety and security. And yes a sexual assault can happen anywhere. We get it.","commenter_a":"Show me one article where a transgendered person assulted someone in a bathroom and I'll show you 10 where a priest, football coach, or teacher did the same thing.","post_message":"President Obama will issue an executive order that public schools must permit transgender students to use bathrooms consistent with their gender identity. Who should make that decision?"},{"comment_id":"10154553793429712","commenter_b":"They work harder, are ambitious, and always have the American Dream end goal in mind to own a business. If there are all these loop holes and advantages that a non-native English speaking LEGAL immigrant can utilize, how the hell can a English speaking American familiar with the system not be able to take advantage? The answer is some do and the others complain. Want a hint? Take a job in a profession like trade work, food, cleaning, retail, etc work there for years to establish yourself financially and become experienced. Take a calculated risk in opening up your business with all your set up in mind, keep working your butt off and you've done it. People say ohhh ILLEGAL not legal immigrants, as if a lot of Trump don't already see anyone darker than Macklemore as an illegal immigrant, terrorist, or possible threat.","commenter_a":"Lazy entitled Trump voters think it's unfair how immigrants do better than them by working smarter and harder and willing to be entrepreneurs.","post_message":"In Baltimore, foreign-born residents make up 9 percent of the city's population but own nearly 21 percent of the city's businesses, according to a 2012 report from the Fiscal Policy Institute."},{"comment_id":"10153097133433271","commenter_b":"Better relocate. .. drunks and moosee don't mix well..... drunk will loose","commenter_a":"@username this would've been amazing:)","post_message":"A young female moose wandered into downtown Boulder Sunday night, strolling down the Pearl Street Mall. On the advice of a state wildlife officer, police fired some bean-bag rounds at the moose's backside and eventually shooed it away from the populated area.  More details: @webpagelink"}]
