[{"comment_id":"10155021026963984","commenter_b":"You are so full of life, Tom, your birds, your cats, your home, Butch, your family, your love of antiques and craftsmanship, your sense of fun, on and on. Just don't want you to let what is beyond any our control override the richness of all you have in your life. Isn't it amazing how much we reveal about ourselves in little vignettes of our lives. Called sharing, and all of us as your Facebook friends enjoy your posts very much.","commenter_a":"Judge Pirro comments were so articulate, to the point, and crystal clear honest evaluation of exactly what has happened to our wonderful country in the last eight years. I remember so clearly Michelle's remarks at 44 years of age saying it was the first time she had been proud to be an American, I was shocked beyond words! To accept so much as we are given as Americans and not to be thankful and proud of our country and our fellow everyday wonderful citizens, Americans! Color or religion are immaterial, Americans and I for one am so thankful for being one and never fail to appreciate what it is to be American. Thank you Judge Pirro for your concise evaluation of Michelle Obama.","post_message":"In the final days before the Obamas leave the White House, Fox News' Judge Jeanine Pirro just gave Michelle a parting gift she'll NEVER forget."},{"comment_id":"1242469175793552","commenter_b":"Righto. Execute the little bitches! That will teach them a lesson!","commenter_a":"Sorry. If you watch the news you cannot just let things go with kids anymore. This time it was pepper that choked the teacher, who knows what would have happened in a few years if another teacher pissed them off........rat poison?? Good lesson to learn early.......being a little psycho bitch is not going to pay off.","post_message":"Three 12-year-old girls have been charged with first-degree felonies in the latest example of America’s insane rush to criminalize children."},{"comment_id":"10153869953961680","commenter_b":"I'd rather see him on the Supreme Court.","commenter_a":"My dream for \"O\" is that he picks up where MLK left off. That he becomes a source of moral courage and reconciliation and justice for all of us here in America and around the world.","post_message":"President Obama: “He knew better than the cynic that if you look at the arc of history, human beings should be filled not with fear but with hope.\""},{"comment_id":"10153332153777377","commenter_b":"But yet Megyn cried otherwise. Such a Bimbo.","commenter_a":"BBB gave Trump an A on his Trump University, so Cruz needs to hit the unemployment line","post_message":"Ted Cruz hammered Donald Trump on Thursday, tweeting out what he called a \"Certificate of Deception\" for Trump's now-defunct Trump University."},{"comment_id":"10153011614414586","commenter_b":"Yes!!! Yaay! Way to go Peta!!!","commenter_a":"Amen","post_message":"KORA NEEDS A HOME!  #PETA fieldworkers found Kora tied outside 24/7 with little shelter or water. Her chain was so tight that it had become partially embedded in her skin. :( She is now in foster care & looking for her FOREVER HOME.  SHARE to help her find one: @webpagelink"},{"comment_id":"10153087285766491","commenter_b":"Hilarious female!","commenter_a":"Stop talking about her. Shes not funny get over it. Stop trying to make her famous by shoving her down our throats","post_message":"Interviewers, beware: do not mess with Amy Schumer."},{"comment_id":"475250429347483","commenter_b":"Everybody in this country already is lying each other up every day!! Just BIG LIARS!!! So what's the big issue with her hidden lies!! OOOOPS!!! I forgot... it's because she is from another country and had way more passion and enthusiasm to drive her to be smart and do well and two other things she a female and of a different skin tone in RACIST, SEXIST AND BIGOTED ALONG WITH ALL SYMPATHIZERS; AMERICA and hell across the world!! AND HELL YEAH I SAID WHAT TOO MANY DON'T HAVE THE HEART ARE SPINE TO SAY ESPECIALLY ALOT OF THE ONES THAT GOT WEALTH, PROFESSIONS, RICHES, POSITIONS, MATERIALISM, FAMILY AND ESPECIALLY MOST THAT ARE MIXED RACED RELATIONSHIPS; AND YOU KNOW WHAT I'M SAYING... BUT IF YOU DON'T THEN: JELLY SPINE OR SPINELESS, WEAK, TAIL TUCKED BETWEEN THE LEGS, GUTLESS YES MEN/WOMEN SUGAR COATED AND WATERED DOWN COWARDS THAT FEEL THEY GOT TOO ...","commenter_a":"How is her schooling funded?","post_message":"This 4.95 GPA student revealed her status as undocumented immigrant during her graduation speech.  #MicBrights"}]
