[{"comment_id":"10153619308152235","commenter_b":"@username a racist comment about baking!?? Okay, surely you jest. You don't know what you're talking about so you're automatically excluded. @username I agree it could be seen as sexist except I am a female and bake all the time, but MORE IMPORTANTLY Men are known to be the best chefs😉. @username she didn't make any valid point when she stated \"nothing new, threats made against students daily\" She's out of touch with the article and with reality if she is trying to compare unspecified kids being threatened to a RACIST threatening to kill only BLACK KIDS posing with ak47 on the school grounds!! ARE YOU FREAKING KIDDING ME!??? The generalization she attached to this comment is uncanny, disturbing, and I'm sorry RACIST in an of itself. Because the DENIAL of racism IS racism also.","commenter_a":"This is nothing new. Threats are made against students daily! We went through this last year and most kids were kept at home until the instagram poster was identified.","post_message":"Another effing beautiful day in post-racial America."},{"comment_id":"635288009979398","commenter_b":"How silly. Some people will sign anything.","commenter_a":"idiot","post_message":"An online petition to remove all air conditioning from Department of State property has gotten more than 1,800 signatures since it was posted online Sunday."},{"comment_id":"933218310052361","commenter_b":"So how many snipers are needed to guard them from poachers?","commenter_a":"There's a herd in Florida too.","post_message":"Well, would ya look at that! (via TakePart.com)"},{"comment_id":"10153877177851162","commenter_b":"Get raped to death","commenter_a":"I'm not sure if they deserve death or to get raped everyday. Tough call.","post_message":"JUST IN: Two men have been charged with murder in the fatal shooting of a pastor's pregnant wife during a home invasion.  Amanda Blackburn was raped and shot in the head during the attack at the couple's home. She died the next day.  NEW DETAILS: @webpagelink"},{"comment_id":"10153311050083037","commenter_b":"Just remember these are people fleeing terrorism NOT terrorist! Living breathing people who are desprete. THEY HAVE NO LESS RIGHT TO DO THAT THEN YOU DO... just because an accident of birth MADE YOU AN AMERICAN","commenter_a":"That is assault, and the spitter better be charged.","post_message":"\"It sickens me to know that no matter how hard I try, there still exists a blur between myself and the decency a human life entails,\" said the student."},{"comment_id":"10153680967462577","commenter_b":"These migrants have been through much and they should be afforded more rights than everyone else. Don't wanna get attacked by a Muslim migrant? Stay inside. A Muslim migrant broke into your house and attacked you? Should have gone outside.","commenter_a":"The world is a sick place where everyone's rights are being removed under the guise of equality. Everyone has the equal right to shut up and lick big government's boots while footing the bill. Fuck this bullshit.","post_message":""},{"comment_id":"10154373369462042","commenter_b":"I like Hillary. Good luck Hillary","commenter_a":"Love and support my President and #ImWithHer...","post_message":"President Barack Obama and Hillary Clinton make their first joint campaign appearance in North Carolina."}]
