[{"comment_id":"10153377125868984","commenter_b":"This administration doesn't WANT to bring people together. They constantly pit people against each other with inflammatory, insulting rhetoric - while involving themselves with the worst of the worst (like Al Sharpton). The entire world is up in flames and it's getting worse and not better.","commenter_a":"She's just pathetic.","post_message":"Michelle Obama just issued a message to black America about what white people do to \"folks like you and me.\"  This woman needs to be exposed for what she is telling our youth... spread this everywhere so Americans know who's REALLY trying to divide the country."},{"comment_id":"10153391344478352","commenter_b":"Crazy mother sucker","commenter_a":"Oh boy! Here we go! Before it starts, dont blame nothing on Islam.They went blowing up people out of their own desires.Islam had nothing to do with it.","post_message":"Car-jacking victim of Boston bombers tells court how they admitted to terror attack, demanded GPS to get them to New York and played CDs of ‘religious music’"},{"comment_id":"10153248545727217","commenter_b":"The smog isn't real. It's just a liberal conspiracy. Keep on polluting.","commenter_a":"And yet wherever they go they reply their failure productive system: massive production and consumption with no protection of the environment....","post_message":"Smog \"red alert\" in Beijing"},{"comment_id":"1209775645709130","commenter_b":"I vote they electrify the fences and start allowing the military to shoot them. Let those ragheads stay in their sandboxes.","commenter_a":"It is an invasion!","post_message":"\"This is not a refugee crisis or a migrant crisis, it's a mass popular movement with an unlimited supply of people.\""},{"comment_id":"450286948495219","commenter_b":"Jo Jo What ever bitch, I have never called the cops and never will when I wish to commit suicide I'll call the pigs. You are a statist bitch.","commenter_a":"Whats the difference? Police are thugs.","post_message":"Do You Support Our Police Over Thugs?  Comment 'yes' or 'no'."},{"comment_id":"1195382713852612","commenter_b":"Okurumoniwonba Orimekunluyi, you are an idiot. None of what you say is even remotely true. Please pay attention.","commenter_a":"If Elizabeth Warren called me she would certainly get an earful of how despicable she is. She would hang up on me but I wouldn't hang up on her.","post_message":"When Elizabeth Warren isn't busy holding special interests accountable, she finds the time to make some calls for Hillary. Join her: hillaryclinton.com/calls"},{"comment_id":"10152693166980047","commenter_b":"Get out of our lives and leave us alone you can not even run your own country leave our children alone also","commenter_a":"No way","post_message":"Schools are forcing our children to \"pretend\" to be Muslim for a day?  We must stop Islamic indoctrination in our schools.   Sign and Share the petition to defend the religious liberty of our students:  @webpagelink"}]
