[{"comment_id":"10152578499710950","commenter_b":"Sore ass losers.","commenter_a":"Redonkulous !!!","post_message":"\"Uh, excuse me?\"  LISTEN: Reporters ask New England Patriots coach Bill Belichick about \"Deflate-Gate,\" and he is not amused: @webpagelink"},{"comment_id":"913240742032115","commenter_b":"this is not true...try 99999999x","commenter_a":"When you stand 10 x","post_message":"You Know You’re In A Black Church When…"},{"comment_id":"1030591920403417","commenter_b":"Sorry, obama was a bad idea, and hillary was worse.","commenter_a":"Of course it's not. We knew what he was going to be, but his voters were too stupid to listen. They refused to heed either his own goddamn words, or the words of anyone else saying \"THIS IS A BAD IDEA.\"","post_message":"Trump is assembling the wealthiest cabinet in history — so wealthy that its members have more money than the bottom 1/3 of American households combined. That does not sound like an \"anti-establishment\" administration to me."},{"comment_id":"10153475535382894","commenter_b":"She is the epitome of dumb!","commenter_a":"Kids are getting arrested for sexting, why is this not considered pornography and why isn't she being arrested.","post_message":"Kim Kardashian Pens Essay on Empowerment After Nude Selfie Backlash: ‘I Will Not Live My Life Dictated by the Issues You Have With My Sexuality’"},{"comment_id":"1569451360020943","commenter_b":"It's called treason, hang her.","commenter_a":"ABSOLUTELY NOT!!!!! We need to MOVE ON!!!!!!! Stop beating this DEAD horse and help the people, NOT YOURSELF INTERESTS!!!!!","post_message":"“I talk about the emails all the time and what can you say, does it get anymore corrupt or crooked than that?”  Donald J. Trump argued that Hillary Clinton is being protected from prosecution relating to her private email server. Do you agree with him?"},{"comment_id":"10153022135468635","commenter_b":"The Jesus I know of hung around with prostitutes, drunks and gamblers. I imagine he certainly wouldn't have used social media to put down homosexuals because he would have been too busy loving them.","commenter_a":"The strong homosexual, transgender movement today is not surprising. It is a sign of how there will be a new world order. It is disturbing but it also points closer to our seeing Lord Jesus.","post_message":"\"Vines argues that while the Levitical code forbids homosexuality (Leviticus 18:22) it also forbids eating shellfish (Leviticus 11:9-12). Yet, he says, Christians no longer regard eating shellfish as wrong — so why can't we change our minds on homosexuality? Here Vines is rejecting the New Testament understanding that the ceremonial laws of Moses around the sacrificial system and ritual purity were fulfilled in Christ and no longer binding, but that the moral law of the Old Testament is still in force.\""},{"comment_id":"873492039433845","commenter_b":"make all the illegals-legal so thats 10 million persons paying taxes. we could sell the republicans to the dog eating festival. thats say 100 dollars.","commenter_a":"cool give them texas. that would be hilarious!!!!!!","post_message":""}]
