[{"comment_id":"10153792604111746","commenter_b":"Two fools!","commenter_a":"Not at all. I love them both and i hope they are the host on 10/19 which is my Birthday.","post_message":"People on both sides of the aisle thought the two were biased."},{"comment_id":"1323090797735546","commenter_b":"Woman in prison","commenter_a":"Drain the swamp","post_message":"WATCH LIVE: Bernie Sanders speaks at rally here in Phoenix, Arizona at Central High School."},{"comment_id":"830478970320859","commenter_b":"Send them all back to where they came from.","commenter_a":"Well Rush what about the Amish kids that started it in Ohio?","post_message":"Rush is right: Obama’s amnesty is a serious national security issue!"},{"comment_id":"10153882814429916","commenter_b":"You can tell she loves BREAD, not that she's inbred.","commenter_a":"Well just look at her, you can tell, she is inbred.","post_message":""},{"comment_id":"1137213316374919","commenter_b":"I'm loving it. Turn it Megyn Kelly. you'll enjoy her hate.","commenter_a":"WHY is @username giving stage to these Republican pundits all the time?? Its disgusting! This network has become a pro-Trump propaganda and pro-Repub stage! Two thumbs DOWN!!","post_message":"JUST IN: John Kasich is the projected winner in the Ohio GOP primary.   More: @webpagelink"},{"comment_id":"1004207899725254","commenter_b":"Nasty woman","commenter_a":"Vote the issues!!! Main stream media has succeeded in blinding and brainwashing its people, spinning half truths and omitting important truths. You will NEVER GET REAL NEWS FROM MSM. Go to TRU NEWS, InfoWArs, and many other investigative journalists who are not afraid to tell the truth or worry about losing their jobs. If you are Gay, Why are you voting for Hillary when she wants to bring in thousands of refugees that believe all Gays should be executed? If you are Black, Why are you voting for Hillary when she admires Margaret Sanger and defends Planned Parenthood who want to abort as many black babies as possible? Exterminate the black race because they are like \"weeds\". (Margaret Sanger quote) Most of those clinics are in Black neighborhoods. If you are a Christian, Why are you voting for Hillary Clinton when she wrote her Senior thesis on Saul Alinsky who ...","post_message":"\"I'll do the very best I can if I am fortunate enough to win today,\" said Hillary Clinton after casting her vote today @webpagelink"},{"comment_id":"1151935354873218","commenter_b":"Nasty hoe","commenter_a":"Some people are seriously fucked up! Mad, evil with a shot of mental illness.","post_message":"Damn  #WSHH"}]
