[{"comment_id":"10153486672691336","commenter_b":"What do we have in place for allowing Muslims into the United States? I would like ALL OF THEM to be on a watch list. Same with anyone else coming here to settle. Also, what are we going to do with these illegals coming over our borders?? Until you are a United States citizen you should not be receiving benefits!!","commenter_a":"Why aren't race crimes punished on both whites and blacks? I know this question will not make it due to the fear of what will be said but it needs to be asked.","post_message":"What is YOUR one question for the candidates? Fox News and Facebook are teaming up to bring you the first GOP presidential debate. Submit your question in the comments below or click here: @webpagelink to upload a photo or video. It could be featured in the debate August 6th on Fox News Channel!"},{"comment_id":"10155770026010354","commenter_b":"She would England better than America.","commenter_a":"And I will remember not to vote for you!","post_message":"Facebook pool: how long until there's a hunting photo op to show how much Hillary understands sportsmen?"},{"comment_id":"493684487507628","commenter_b":"Keep em out our we go the way of Europe. No Trojan Terrorists!","commenter_a":"Vet everyone coming in","post_message":"“No. I would not allow people to come in from Syria. They’re not vetted properly. They’re moving in by the thousands.”   Donald J. Trump reaffirmed his commitment to a ban on Muslims immigrating to the United States, arguing that it is better to build \"safe zones\" in Syria. What do you think?"},{"comment_id":"10153836803272623","commenter_b":"Good players But it's another\"L\"","commenter_a":"Ga...NO ....Riverboat must have sank and Cam Ain't ..... stupid Panther Fans","post_message":"The New Orleans Saints beat the Carolina Panthers in a 41-38 victory Sunday in New Orleans."},{"comment_id":"843332055796851","commenter_b":"CRIMINAL","commenter_a":"LIAR","post_message":"Hillary Clinton doubled down on her assertion that the FBI declared her public remarks on the email scandal “consistent and truthful,” despite independent fact-checkers concluding otherwise. @webpagelink"},{"comment_id":"10153357300516051","commenter_b":"@username what part of illegal don't you get! They come here illegally & then have anchor babies which the government pays for & that includes the whole family while the father works under the table! We are spending millions of dollars on illegals & not just Mexicans when we have our own US Citizens who need our help!!! They are breaking the law! Period! CAN'T WAIT FOR A NEW PRESIDENT TO CHANGE THIS ONCE & FOR ALL!!!!!","commenter_a":"If they are born in USA, they deserve their birth certificates. TEXAS, the most ass backwards state there is!!!","post_message":"Right decision or wrong decision?"},{"comment_id":"10155447745046509","commenter_b":"HAHAH NNeta Fitria","commenter_a":"She works at Comcast now and has hung up on me 7 times.","post_message":"\"Ain't nobody got time for this.\""}]
