[{"comment_id":"1247572008614366","commenter_b":"Her pants should have caught fire. She needs a choke collar.","commenter_a":"Yes","post_message":"Surprised? Neither are we."},{"comment_id":"10153689476229411","commenter_b":"^your a dumb bitch lol","commenter_a":"Neo nazi sentiments are riseing in europe includeing islamaphobia and alittle anti semetic retoric. This is a reality. I dont care if u agree or dont its happening. People say get rid of the immigrants that have refugee status and those fleeing war zones and this intolerance will end. No it wont. This is a deep rooted problem of european ethnic supremacy masked. Its disguised well and they sure convince alot of people of there philosophy from people like madam blavatsky. And her race based ideology. Whats fueling race and ultimately religious intolerance is low birth rates from the native peoples of europe so they blame immigrants even tho the state subsidizes births in europe. Neo fascism is gaining ground because of this wacky race based fear and economic troubles. So the nazis are mixing both messages pointing it at immigrants and they do get violent. They dont only want ...","post_message":" is disrespectful is the political reality in Europe that people, suffering so greatly hand, over thousands of euros and must take such unsafe routes while for the rest of us Europeans it is so easy  to travel in the other direction\""},{"comment_id":"10153494156593352","commenter_b":"Good story. Bitch is a lying though. I don't know one woman that would've let that bullshit go down...","commenter_a":"Why was she so close to a canal going downhill with her kids? This is a sad story but seemed like she made some careless mistakes.","post_message":"Mother was fighting off a BEE when she let go of her twins’ stroller and they rolled into canal and drowned"},{"comment_id":"1184948411561852","commenter_b":"FOREIGN WORKERS MEANS TAX BREAKS FOR THE COMPANIES AND LOWER WAGES..... ALSO MEANS NO JOBS FOR USA CITIZENS!!!!! TRUMP FOR POTUS - DEPORT THE ILLEGALS AND STOP WORK VISAS !!!!","commenter_a":"In my lifetime, I have been through 3 amnesties. Each was promised to be the last. Does anyone in the Congress, who made this promise to the American people, have enough backbone to honor their word? Seems not. Why believe anything they tell us?","post_message":"Not good."},{"comment_id":"1142853059119585","commenter_b":"So's my father. Personally, I served a three year tour in the US Army.","commenter_a":"No! George Bush was in the service. But no one knows how he got out.","post_message":"Don't you EVER forget this... nor let these Republican chicken-hawks send your children off to die in wars for profit."},{"comment_id":"1145540435508072","commenter_b":"No job , 6 kids , no husband . Stop !","commenter_a":"Waited in line for six hours if you would've been working kids would've ate","post_message":"Entitlement Mentality: Welfare Recipients React to Food Stamps Being Cancelled.  This shows everything wrong with the entitlement mentality."},{"comment_id":"10156255899575147","commenter_b":"I agree with you. It could have went awry. Maybe the mother has some mental issues. Only God knows what was in her mind. One thing for sure though, its alive n has chance to be somebody. Not just an aborted baby thrown in a trash can or its innocent body parts sold on the black market. Evil comes in all shapes n sizes. One of them is planned parenthood.","commenter_a":"I'm glad she didn't abort the baby, but this is still a sad story. Calling it a \"selfless\" act, as this article does, is a head scratcher. \"Desperate\" maybe, but if anything, abandoning a baby without notifying anyone is exactly the opposite of selfless. There are safe havens in NY where she could have turned over the baby to actual people","post_message":"\"I followed the cries. I walked to the little nativity home we had installed inside the church… I couldn’t believe my eyes.\""}]
