[{"comment_id":"1389869284386873","commenter_b":"Nothing, absolutely nothing. Vote them all out, they deserve to be jobless.","commenter_a":"They took a lot of time off, which means they weren't doing even more stupid hurtful stuff.","post_message":"We'll wait.  Like Addicting Info for more great content!"},{"comment_id":"10152967828847061","commenter_b":"Yes legal immigrants ma'am","commenter_a":"I am ashamed at the negative narrow minded comments. Check your heritage. We are all immigrants","post_message":"America Ferrera to Donald Trump: Thanks, your comments will send more Latino voters to polls: abcn.ws/1Iw7NNn"},{"comment_id":"218545795283614","commenter_b":"Children in poor areas should not be doomed to poor schools.","commenter_a":"Yes, The GOP has lost every bit of self-respect they ever had. To vote Betsy DeVos in as education secretary with no educational experience is just irrational. If Betsy were smart she would decline the office and get the hell out of town now. She will not survive as educational secretary.","post_message":"Republicans just sold our public schools to the highest bidder.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"667824530017395","commenter_b":"THROW them out of the country after incarceration. This disgusting behaviour does NOT belong here","commenter_a":"Yet no justice for the douggler girls.......","post_message":"GROSS."},{"comment_id":"10154698288912178","commenter_b":"If anyone would like to help the family they do have a gofundme account .","commenter_a":"They did do a GREAT job...we were actually driving by when all this was happening.","post_message":"Emergency workers were able to rescue a dog trapped inside an Aberdeen home that caught fire this afternoon. Story>> wral.com/@username/"},{"comment_id":"1250171008375949","commenter_b":"NO She is a BAD EGG!!","commenter_a":"No I detest liars. I don't know how she gets away with all the junk that she's done.","post_message":"Hillary Clinton was voted the most admired woman in America in a Gallup poll. Do you admire her?"},{"comment_id":"1287351561304298","commenter_b":"Pneumonia?! Doubtful!!! Maybe her conscience raised its despicable, dishonest head and gave her a little peak at her destiny - a one way trip to spend eternity in Hell - now that ought to make her swoon!!! Still...Doubtful!!!","commenter_a":"Just another lie...","post_message":"New News Is Hillary has pneumonia.  FOR THOSE WHO WERE OFF THE GRID TODAY MOST, here is all you need to know about Hillary's \"medical episode\"  (aka fainting) during the 9/11 ceremonies in NYC.  All the videos you need to see:  @webpagelink"}]
