[{"comment_id":"699361250167548","commenter_b":"Terrorist and traitor!!! And an illegal!!","commenter_a":"The Wall of China has worked tremendously for China. Id expect the same results here","post_message":"“Good luck with that…We’ve got serious problems here.”  President Barack Obama addressed Donald J. Trump's plans to build a wall and get Mexico to pay for it."},{"comment_id":"10153496846973132","commenter_b":"I highly doubt they kept having them JUST to have a girl.","commenter_a":"How selfish, to keep having kids only hoping for a gender. That 13th boy will someday realize he was only born because his parents hoped he'd be a girl.","post_message":"Maybe the 14th time's the charm?"},{"comment_id":"10153441968716756","commenter_b":"Then by your logic no couple on the street should be holding hands or kiss, or hug. You can't just say keep it to yourself. That has been the norm for years. They are tired of hiding. They want to be free like you and me. They want to walk down the street holding hands, they want to marry and they want you to keep your personal preferences to yourself.","commenter_a":"I don't care who you marry Just don't shove it down my throat.","post_message":"The briefs against bans on gay marriage come from the traditional allies -- and some surprising ones: small businesses, law enforcement officers and some Republicans."},{"comment_id":"1094669133962671","commenter_b":"Well folks that's more reason that woman will never be president","commenter_a":"Alright, That's it!","post_message":"JUST IN"},{"comment_id":"10157286687695093","commenter_b":"The same FBI that said Hillary Clinton was to dumb to be prosecuted? Gmafb dude. I tell you what why don't all of the uneducated whites thank think their better than blacks go, than not only will the crime rate be lower but the racial tension will be too.","commenter_a":"I guess they're gonna condemn violence against police when white folks stand and condemn police violence against blacks. Until then we'll continue to lie to one another.","post_message":"Must-see!"},{"comment_id":"10152946649009641","commenter_b":"While I despise Islam I don't hate Muslims.. At all! It's not their fault if they're born in it. But I agree with letting no more immigrants into west! None!!","commenter_a":"allTerrorists should be killed to make the world better","post_message":"Gunfire echoes from two police raids ending terror sieges around Paris. One witness says: \"It's like a war.\" Another describes how a suspect told him: \"Go, we don't kill civilians.\" @webpagelink"},{"comment_id":"10152596926553067","commenter_b":"This is not going to hurt North Korean govt only the people","commenter_a":"Take this clown out already.,F ing joke.","post_message":"BREAKING: The U.S. is hitting North Korea with a new set of economic sanctions in response to the hacking attack on Sony. @webpagelink via CNN"}]
