[{"comment_id":"404253609734988","commenter_b":"FEDERAL LAW says they shouldn't be here","commenter_a":"Sheriff Joe should deport himself.","post_message":"Judge blocks sheriff Arpaio's workplace raids of undocumented workers"},{"comment_id":"1371941172817349","commenter_b":"TRUMP AMERICAS WELFARE QUEEN!","commenter_a":"Bahaha, looks like your corrupt Hildabeast hasn't paid em either. Oh and why don't you ask the Haitians how much of that Clinton Foundation windfall made it to the Haitians. You liberals are absolute blind sheep. Don't you think if Trump broke any tax laws that Obozo's IRS henchman Koskinen would have taken him down already? Can't you leftist idiots run a campaign on pressing issues of the day rather than ad hominem attack and character assassination? Oh, I forgot you can't cause you fools have nothing other than soap opera drama. Hey, did ya hear Kardashian got jacked in France today? Bwahaha, such useless idiots, the lot of you!","post_message":"Contrary to Trump's claims, undocumented immigrants contribute roughly $11.64 billion in taxes every year."},{"comment_id":"10153649297241756","commenter_b":"William, the real shame is that this woman has likely already procreated or will procreate and pass on her low level of intelligence and ignorant, backwards redneck beliefs onto her offspring.","commenter_a":"As a historical relic, it belongs in a museum. The Confederates lost the war. The only flags that should be flying at the South Carolina Capitol are the United States & South Carolina flags.","post_message":"The crowd chanted \"USA! USA!\" as the flag was lowered."},{"comment_id":"807543922769518","commenter_b":"SHOWS HOW GHETTO AND STUPID SHE IS","commenter_a":"Uneducated today's schooling.","post_message":"Racist Black Girl Assaults White Students For Enslaving Her Ancestors [VIDEO].  This is unbelievable. Where's the media outrage?  Do you think this is a hate crime?"},{"comment_id":"10153394561766336","commenter_b":"Only one I see judging is you","commenter_a":"Her Christian mother must be so proud. This is why you don't preach and judge. Once you put yourself out there, you are now the target to being judged.","post_message":"Bristol Palin, daughter of 2008 GOP VP candidate Sarah Palin, has announced on her blog that she is pregnant with her second child.  “I know this has been, and will be, a huge disappointment to my family, to my close friends, and to many of you,” Palin said. @webpagelink"},{"comment_id":"10157349438290354","commenter_b":"She needs to shut up! We don't care!","commenter_a":"Rosie needs to check in at the local mental health clinic ASAP","post_message":"And that's not all Rosie O'Donnell said about Donald Trump either..."},{"comment_id":"10153785606781636","commenter_b":"@username it is illegal for a felon to be around a gun. Which means a felon shouldn't ever enter a gun range or be able to rent a gun!!!","commenter_a":"So wait?? You can just walk into a gun range and with no background check just \"rent\" a gun? How does the gun range owner know that a person is legally able to possess a gun? How do they know the person isn't a felon or barred from possessing a gun??? Wth?","post_message":"Authorities say the gun range owner had no indication the man was suicidal."}]
