[{"comment_id":"10153968461605579","commenter_b":"Absurd! There are 50 muslim countries to accept muslim refugees!","commenter_a":"You know why I support the Syrian refugees coming to America? Because I'm not going to let the terrorists dictate my beliefs, ISIS doesn't scare me. What scares me is that we, Americans, are losing our sense of direction. I've thought about this refugee crisis for for quite some time now, if you don't believe me ask the Marines who I taught about the Syrian civil war in 2012. I've been aware of this conflict for quite awhile now, while the rest of the world turned a blind eye. Islamic extremists aren't going to scare me and they are not going to change my way of life or thinking. I am an American and I cower to nobody. When I see people fleeing danger I want to help, we as Americans want to help. If you turn away women and children fleeing death and destruction because of terrorist attacks then ...","post_message":"Should the U.S. accept Syrian refugees?  WATCH: U.S. House debate on #SyrianRefugees  LIVE on C-SPAN @webpagelink    WATCH: House Judiciary Committee SubCmte hearing on #SyrianRefugees,  LIVE on C-SPAN3 @webpagelink    Senate Homeland hearing on #ParisAttacks  LIVE at 2pm ET on C-SPAN3 @webpagelink"},{"comment_id":"10152833310366051","commenter_b":"She prostituted herself out for the Republican party without thinking of the fall out from orally satisfying the president. He never did anything with her. He allowed her to get on her knees and prostrate and prostitute herself. She and the ugly woman with her ruined their own lives, not his.","commenter_a":"Good job Mr. Shanks. The worst part is that he carelessly wrecked the life of a young vibrant Monica Lewinsky. What a man! What a man! Jerk!","post_message":"The man who created Bill Clinton’s official portrait hid something in plain sight – and the Clintons aren’t happy about it."},{"comment_id":"1042887679092881","commenter_b":"Democraps Are The Cronies....","commenter_a":"What bunch of pussys, liberal Socialist progressive cry babies","post_message":"Democrats are staging a sit-in for gun control measures on the House floor, led by Congressman John Lewis. Congressman Beto O'Rourke is streaming the sit-in from the floor @webpagelink"},{"comment_id":"969122396467721","commenter_b":"i wasnt created to have babies..a lot of women arent..","commenter_a":"God created us to have babies, not kill them he doesnt like it","post_message":"And abortion is NOT healthcare!"},{"comment_id":"1091280717559605","commenter_b":"@username, are you really that concerned this man will not reach his full potential of sexual pleasure!? He's a man for christ sake! The last thing he needs is anymore reason.. I don't miss the excess skin they removed from vag after giving birth. Wasn't doing me any good, and it would've been in the way. You still got the umbilical cord hanging out of your puss or what!? Never know, you might miss it..","commenter_a":"I knew it caused both my boys pain, but I still had them both circumcised. Haven't regretted the decision at all.","post_message":"Maybe that circumcision was a bad idea after all, huh?"},{"comment_id":"10153596460999486","commenter_b":"She needs to be in prison for it!!!!","commenter_a":"Funny how that works for a lying, cheating,sneaky,and generally lousy human being!!! She needs to apologize to the 4 families for their murder in Benghazi!!!","post_message":"Talk about a flip-flopper..."},{"comment_id":"10153202858353352","commenter_b":"Nigger Bitch??? Hahaha So Original","commenter_a":"Only because he was a black cop..... If he was a white cop that cracker would be locked up..","post_message":"Gun enthusiast who shot police chief four times during raid walks free because cops 'didn't have enough evidence to charge him'"}]
