[{"comment_id":"1830025417217655","commenter_b":"Maybe he was looking at her pussy to grab it.","commenter_a":"Maybe he needed help figuring out how to fill out the ballot","post_message":"LOL!  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153148530580329","commenter_b":"It's not a fuckbuddy it's a weak ass pussy who ain't bout shit","commenter_a":"What is a f*ckboy? I must be getting old...","post_message":""},{"comment_id":"1257645944292548","commenter_b":"Why doesn't FR just end this problem by STOPPING all Muslims from entering EU, no pain no trouble--just say NO! Muslims just cant integrate into civilized society.","commenter_a":"Our law is for everyone: no showing of religious appurtenance in schools or public places. That includes Catholics as well. I was not allow to show my catholic cross at school. And I am French. Our country, our laws. France did not became a country of human rights at no cost. If they are not happy there, they can go back in their country. They might remember why they left in the first place. Plus, no one in France is allowed to cover their face expect during winter: it was for security reason, long before Muslims came in France. Women in France fought for their right of Freedom, coming here and wear the veil is an insult to all woman who died for our freedom. The veil or any coverage is not religious, but cultural.","post_message":"It is argued that the ban on head-coverings is unfair because it encroaches the individual freedom to remain covered for religious purposes."},{"comment_id":"10153147008285950","commenter_b":"I love a drink but when I got pregnant I stopped and even though I am dying for a cold one in the warm spring sun it has to wait until bub is out and I am not breast feeding. I am due in oct. woman need to realise it isn't about them anymore.","commenter_a":"I remember my Dr saying a drink would be fine","post_message":"Slightly more than 3 percent of pregnant women admitted that they binge drink, consuming four or more alcoholic drinks at a time, according to the report from the U.S. Centers for Disease Control and Prevention."},{"comment_id":"10153316007267144","commenter_b":"Why doesn't she ever just answer the questions and stop telling everyone everything else!! Oh yeah, because she is the biggest liar ever!!!!!","commenter_a":"Way to go Hillary Clinton!","post_message":"The whole room joined her. Watch."},{"comment_id":"1354400067935066","commenter_b":"Just try it you fucking bitch! Just try it!","commenter_a":"PRESIDENT TRUMP, PRESIDENT TRUMP, PRESIDENT TRUMP!!!! WE THE PEOPLE SAID SO!","post_message":"Discuss.   SHARE THIS and FOLLOW US at Reverb Press and Stories That Resonate for progressive news and opinion that you can trust."},{"comment_id":"10154454599501162","commenter_b":"That lady is an idiot","commenter_a":"What the f @username Angela Lemonjello Caringella Care Re","post_message":"Harbor seal pup euthanized after being carried off a beach in a plastic shopping bag."}]
