[{"comment_id":"1713379888949123","commenter_b":"Then resign and get her out of the White House!","commenter_a":"I would like to know why people push like on these kind of post? I don't get it! Are you stupid??","post_message":"Are you... KIDDING ME!?   So sick of Barack Obama & Michelle Obama..."},{"comment_id":"1158653037490292","commenter_b":"HOW can he be such a hypocrite??? His companies ship jobs overseas, and he ships in illegals to work for cheap saying Americans won't do the jobs","commenter_a":"When his ties are made in China really dude???","post_message":"Donald J. Trump lamented Nabisco's decision to move jobs to Mexico, then pointed to Chris Christie: \"You're not eating Oreos anymore, are you?\" @webpagelink"},{"comment_id":"10153509704082452","commenter_b":"So she sees a medieval torture device in her snatch, boy that's a bright one right there. I feel sorry for whoever got that scag pregnant.","commenter_a":"LOL........","post_message":"A pregnant woman said she saw an image of the crucifixion of Jesus Christ during her ultrasound."},{"comment_id":"635910406556387","commenter_b":"Go away stupid black man","commenter_a":"Always has the Muslims in the forefront of his talks before even condolences ... God forbid we upset the Muslims because they practice the religion of peace!","post_message":"President Barack Obama addressed the horrific terror attacks in Nice, France and called suggestions to target Muslims in America \"repugnant.\""},{"comment_id":"10153075013704342","commenter_b":"And then she'll leave...","commenter_a":"idiots, so the what are they going to pay for their new animal sanctuary now that the livestock are not bringing in enough money to feed or maintain the ranch? oh yeah, they'll just do another gofundme scam and a bunch of idiots will pay their bills for them. crap like this is getting ridiculous","post_message":"CATTLE RANCHER GOES VEGAN: For four generations, cattle have been raised on the Sonnen Ranch in Angleton. A few months ago, that tradition ended when the current rancher got back together with his ex-wife, and she pressured him to go vegan."},{"comment_id":"1442259229136366","commenter_b":"tell me what he lied about?","commenter_a":"Trump has NEVER had a alcoholic drink in his life ,you idiot.","post_message":"His Fakeness speaketh."},{"comment_id":"10152691502210927","commenter_b":"I agree they are just like his kids - Brats who think they deserve everything on a silver platter.....Put them back on the top of train cars headed for Central America","commenter_a":"Y r yall so against latinos/ mexicans last i checked they were here n mingled with natives b4 many of urs ancestors, when did they push, steal, lie, march families out of their lands","post_message":"Illegal aliens are just like our kids according to Obama."}]
