[{"comment_id":"864626500338540","commenter_b":"God says we must forgive the ones who ask forgiveness. We all make mistakes nobody is perfect. Mr Trump for you to come forward God sees and forgives you! I pray that everyone sees and not to judge it was very wrong what Mr Trump said. God sees his heart remember Saul who did horrible things. God forgiven him and turned him into Paul! Pray for America that our country changes for the better. Pray for our new President that he is on the right path makes the right decisions! We must pray for Mr Trump to show the women that he will help them in every way! For our children to have God back into schools no more hate but love one another in Jesus name!","commenter_a":"Who believes her empty words?","post_message":"On Donald J. Trump's campaign website, Melania Trump released a statement addressing her husband's controversial comments from 2005."},{"comment_id":"10152775428266051","commenter_b":"Tell the Moms to buy it themselves.","commenter_a":"How low can you get.","post_message":"These moms decided to e-mail their daughters’ class and ask for everyone to pitch in for their birthday gifts. Here’s how one mom responded to that."},{"comment_id":"700735873407794","commenter_b":"No you dumb whore check history That would be the other dumb whore Hillary","commenter_a":"Why don't you just sit down and be quiet, because you haven't a clue hat you are talking about. You never experienced a thing of what you suggested, and doubt you know that history!","post_message":"According to the great celebrity-turned-philosopher Cher, Trump is now a genocidal murderer..."},{"comment_id":"856127001183895","commenter_b":"Did Japan apologize for pearl Harbor, Bataan, and the rest of the atrocities committed by the Japanese military?","commenter_a":"Did Japan apologize foe pearl harbor","post_message":"Castro criticizes President Obama for not apologizing to Japan during a trip to Hiroshima in May."},{"comment_id":"10154244033251519","commenter_b":"So @username does not use gas. Good for you.","commenter_a":"Hey they lost a war. Get over it. Ppl been fighting ppl over land since the beginning of our time, even animals do it. What makes Indians so special?","post_message":"Salon's Charlie May was at Standing Rock as protesters celebrated the recent #DAPL news. Veterans, including Wes Clark Jr., bowed and asked Native elders for forgiveness.  Read more: @webpagelink"},{"comment_id":"10156981805725725","commenter_b":"Someone should exterminate these lowlifes","commenter_a":"You sorry protesters making violence! Mr. Trump paid for that rally in Cali you only making yourself look bad @username will even make America great for you guys. Stop making yourselves look like fools!! Thanks Bernie for the awesome soundbite!! I think that is personally the best campaign slogan to help @username. \"Hillary Clinton had bad judgement.\" @username 2016!! MAGA! Get out and vote Indiana and California!!! We are behind you 100% Mr. Trump in Mississippi!! My in laws in California are voting for @username!! Across the nation Trump 2016!! Your vote matters love America and vote Trump!","post_message":"Thank you Costa Mesa, California! 31,000 people tonight with thousands turned away. I will be back! #Trump2016"},{"comment_id":"1388976751118684","commenter_b":"STOP KILLING BLACK PEOPLE","commenter_a":"معقول يصير بامريكا","post_message":"Courtesy: Ruptly"}]
