[{"comment_id":"1516900544996637","commenter_b":"And crooked lying hellary deleted 33,000 incriminating emails. That's why 5 people were given immunity so they wouldn't be prosecuted. Now why would they need that??? Here's the definition of immunity: Law. exemption from criminal prosecution or legal liability or punishment on certain conditions. Did hellary ever find the 6 billion $$$ that has been missing while she was SOS??? It's most likely in the clintons Swiss bank account! Wake up liberals!!! @webpagelink","commenter_a":"Trump is nothing but a CRIMINAL.. A FRAUD... CON ARTIST.","post_message":"City of Phoenix to Trump: Our cops didn't endorse you."},{"comment_id":"1108095542598003","commenter_b":"@username please lady shut the hell up!","commenter_a":"O'Reilly won't stop spewing rubbish. He expected Obama to make same mistake like Bush and Blair by drafting thousands of troops to Syria like Iraq. If Obama has made that misstep, more than a thousand of finest American soldiers would have been killed there by now. Bill needs to be grateful to Obama by not being a blood thirst. There are more than 12,000 gun violence related death in America annually, he won't even address that. Funny old man!","post_message":"\"There's no question the Obama administration's greatest failure is allowing the Islamic terrorist group ISIS to run wild.\"  Bill O'Reilly criticized President Obama's response to the terror threat, adding he doesn't \"define the ISIS threat accurately.\""},{"comment_id":"1002745926520222","commenter_b":"HITLERY, MURDERS AMERICANS IN THE WOMB!!!!","commenter_a":"Stop Hate Dump Trump","post_message":"WATCH LIVE: Donald Trump speaks at his second campaign event, this time in Eau Claire, Wisconsin. Earlier in the day, he spoke to supporters in Valley Forge, Pennsylvania."},{"comment_id":"1003834523018162","commenter_b":"Fuck her she hates white's. She only hires blacks.","commenter_a":"she had made millions off the white people and i do mean millions.let her take some money and give it to street people or vets which i doubt she will she would only let them starve!!!!opra disappoints me as i thought she wouild be the last person to say something like that!!!!!!","post_message":"Oprah Claims White People Are The Cause Of Racism In America.  What a hypocrite, she is the racist.  Do you think Oprah is bigot?"},{"comment_id":"10153891687451782","commenter_b":"And what of Betty Shelby??? When will they lock that monster up? When will her day come?","commenter_a":"It is not over he may not but I saw a tweet today by a new elect and NY police are ready for several charges including the spirit dinners were those poor children are molested and then killed!! It may take time but all of them will be charged! Trump will be too busy to do it but their day will come!!","post_message":"President-elect Donald Trump's aide is suggesting that he will not pursue a probe of Hillary Clinton private email server in an effort to help her ;  @webpagelink"},{"comment_id":"10152938461282293","commenter_b":"GOOD. We need less politics. Clinton's and Bush's destroy this country. Carson is an actual person, not a career politician. Wise people WANT someone who is not a politician, unless you would prefer to stick with the status quo.","commenter_a":"Gifted hands, doesn't mean meant for politics...","post_message":"In Opinion, Dana Milbank writes: \"Carson has little in common with the political class but for one thing: his absolute confidence in his own greatness.\""},{"comment_id":"10153533392786337","commenter_b":"You wish you were a woman","commenter_a":"Bruce Jenner has 0 murders. Caitlin has 1","post_message":"MUST SEE MOMENT: Caitlyn Jenner gave a graceful speech while accepting ther Arthur Ashe Courage Award at the ESPY awards..."}]
