[{"comment_id":"1141758235909203","commenter_b":"Bucket of losers and needy Mexicans. She was right.","commenter_a":"Actually, The founding fathers were rich aristocrats who valued property rights at a premium, so much so that they limited the right to vote to land owners, who at the time were the billionaires of their day. It isn't right that billionaires can buy elections, but that probably would have been the intention of the founding fathers.","post_message":"When the Founding Fathers wrote the Constitution, I’m pretty sure they weren’t thinking “Let’s make sure billionaires can buy elections.”"},{"comment_id":"1000192243373586","commenter_b":"The little bitch should serve time.","commenter_a":"It's not white privilege. It's called \"daddy is connected\". Still doesn't make it right","post_message":"This girl had so many drugs that her sentence should be more than 200 years -- read on to find out what she's going to actually get."},{"comment_id":"902473139819442","commenter_b":"Even woodpeckers for fucks sake. If they're damaging your house, or your property, guess what, you can shoot it","commenter_a":"Bring back fox hunting - look at the state of this fox -","post_message":"Fox Busted In The Hen House Literally!"},{"comment_id":"552487634912815","commenter_b":"Your racist dumb fool he's not understanding the concept on the purpose for building the wall","commenter_a":"your not going to stop drugs coming in with a wall, they have already proven that for the last 20 years. there are inventions like aero lights, tunnels, submarines. and boat. not to mention all the ways they catapult drugs over already. your all stupid for supporting this waist of tax payer money. not forgetting all the jobs they do that you office pussys wont and can't do because you have no back bone.","post_message":"Do you agree with Bill O'Reilly here?"},{"comment_id":"404934952964433","commenter_b":"We will be screwed with either of these two jackasses!","commenter_a":"I hope I never hear of either ever again","post_message":"Will Jeb Bush face Hillary Clinton in next year's race for president?"},{"comment_id":"10153544166434024","commenter_b":"NY is the capital of THE WORLD! If you don't want to spend money LIVE SOMEWHERE ELSE! As far as Cruz goes I thought Republicans want smaller government. ??? Good get out of our marriages and get out of our doctors offices. (Women's Drs offices)","commenter_a":"Freedom of speech... He's right about the liberals in NY. Who cares. NY is insanely wrong when it comes to taxes and wages... The truth hurts.","post_message":"WATCH: Ted Cruz slams Gov. Cuomo and Mayor de Blasio when asked about calls for an apology for his remarks on \"New York values.\"  Your reaction to Cruz's latest comments?"},{"comment_id":"10153757809364877","commenter_b":"She wouldn't even have had the chance to do that to me, once I saw the knife in her hand it would be over for her with the quickness! I hope she gets arrested and that boy leaves her high and dry if he hasn't already!","commenter_a":"He should run and never look back","post_message":"Woman holds knife to boyfriend’s throat, forces public apology for flirting on Instagram.   Grio fam, how would you react if your son or daughter was in this relationship? Please be advised that this footage shows graphic imagery."}]
