[{"comment_id":"578880512291528","commenter_b":"I have a daughter and if she decided to not wear a bra, and wore clothing appropriate for that. Obviously not some plunging v neck cut out, crop top but a shirt sure. Bras are a cause for back pain and unless it's comfortable for the woman to wear it she shouldn't have to. If you insist we wear bras, I insist that your man boobs must also be held with a wire bra. You're pecks offend me!","commenter_a":"If I had a daughter ain't no way she going to school with no bra on. So I think the parents are to blame also. What are they teaching her letting her go to school like that??....that's tacky and careless parenting in my opinion..","post_message":"These high school students brilliantly stood up against sexist dress codes."},{"comment_id":"10153992150958854","commenter_b":"Who's next to meet Satan their Allah. Satan's impatient, don't keep the Virgin hags waiting.","commenter_a":"no more little asshole","post_message":""},{"comment_id":"503579846468637","commenter_b":"Why argue with this man child?","commenter_a":"Remember the outrage over the clock kid? Let us see if libtards and media worry so much about Christians being singled out to die.","post_message":"\" He seemed skittish, always looking over his shoulder to see if anyone was watching.\""},{"comment_id":"801468519888245","commenter_b":"The female judge is pathetic.","commenter_a":"Wow....","post_message":"The cop sexually violating her body is evil enough, and to see the judge's reaction is absolutely chilling. Watch now (WARNING: GRAPHIC): @webpagelink  -Via Filming Cops flashback files."},{"comment_id":"10156528431575354","commenter_b":"Screw her","commenter_a":"Boo-fucking-hoo! Lifes tough on EVERYBODY! And not everyone drives their car up on the sidewalk! Now the media will make her out to be the victim! Put her ass in prison and throw away the key!!","post_message":"Changed Name from ‘Lakeisha Holloway’ to ‘Paris Paradise Morton’…"},{"comment_id":"455025114688069","commenter_b":"yes","commenter_a":"CNN sucks","post_message":"Should Networks Like CNN Be Shut Down?  Comment 'yes' or 'no'"},{"comment_id":"10153906452296409","commenter_b":"Hahahah This is all she has. Anger lies and name calling. She would make a horrible leader. Sorry it wasn't a poll. This is the article. Trump lies more than Hillary. So what. He still will not be the next President I can't wait for you to make America Great/Safe again!! These attacks have to stop taking the lives of innocent Americans. We need a Leader that will call the enemy by name! Trump2016!!! Is there an actual plan as to where all this extra revenue will go towards? Will our personal taxes and property taxes go down? I am a deplorable TRUMPAZEE and love every moment of it. ANOTHER NO pic, NO history and NO friends TROLL - F/B is being flooded with these locally and from FOREIGN countries And why would he? He has made it this far and hasn't released them yet? It's an unnecessary risk to ...","commenter_a":"Are they crazy? Trump has had same platform and mantra since day 1. Hes not the one who bleached his servers and beat them with a hammer AFTER being subpoenaed. That was hillary","post_message":""}]
