[{"comment_id":"10153847766591336","commenter_b":"That's Air Craft Carriers in english.","commenter_a":"So let's tell everybody what our Navy is doing!! Stupid media.","post_message":"On Monday, the aircraft carrier USS Harry S. Truman departed Naval Station Norfolk to head to the Middle East to combat ISIS. (Credit: U.S. Navy)"},{"comment_id":"10154602642789062","commenter_b":"They need to close all of them they are evil an come from tha devil","commenter_a":"I hate Walmart.","post_message":"Wal-Mart is closing 269 stores, more than half of them in the U.S. - YOUR THOUGHTS?  UPDATE: 2 Houston stores closing -> @webpagelink"},{"comment_id":"10153540589586323","commenter_b":"Oh my god did you even read the article!! The number ending up at Calais is miniscule, the article also states most don't even know about our benefit system so maybe we left behind a massive impression after colonising half the world they figure we are the country they admire or can relate to, to be honest i don't care, if its they live or die then they should live here","commenter_a":"Those people in calais are not true refugees or asylum seekers, if they where, they would claim fir asylum in france. EU law says that they should claim asylum in the first safe country they arrive in. Last time I checked, france is a safe country, so is spain, italy, germany, and many other eu countries. What I don't understand is why there are over 5,000 of these so called asylum seekers camping in calais trying to get into the uk. If you are a genuine asylum seeker, you don't get to pick and choose where you want to live.","post_message":"When you’re facing the world’s biggest refugee crisis since the second world war, it helps to have a sober debate about how to respond. But to do that, you need facts and data – two things that the British migration debate has lacked this summer.  These, in the clearest terms, are the 10 key facts."},{"comment_id":"10152910071581130","commenter_b":"@username, cry me a River. You don't see that those women keep on having babies that they can't take care of and are sold into prostitution. Oh, but im wrong for believing in controlling the problem. And no bitch, I got my tubes cut and burned, because I dont believe in having more then what I can take care of.","commenter_a":"Since they don't have protection & clearly can't afford children why not find alternatives to intercourse? Or maybe idk use some self control & abstain from sex altogether? They are consenting adult women fully aware of the possible outcome/consequences of their choices. Only people I feel sorry for are those babies born into a piss poor life because they have SELFISH parents.","post_message":"“Sharing a bed is fine, it’s okay to share and be all together. But it’s tough because what if the person next to you is sick? What if they pass that illness on to you and your baby?”"},{"comment_id":"1087900891233676","commenter_b":"The country would be safer if deported the republican/Tea Party.","commenter_a":"Thats why this year to come. I invite all registered voters to hit the polls. So this son of biatch don't win.","post_message":"After seeing Trump on TV, 8-year-old Sofia was terrified that the army was coming to take her away."},{"comment_id":"731521210341165","commenter_b":"You mean the Wars the Bush started and Obama ended? Also James now that you've mentioned hospitals, in Syria we as a country have never bombed a hospital, it was Russian and Syrian Regime bombs that caused those explosions. Banning or restricting the immigration from certain countries has been happening for as long as the United States had borders. But this is the first time we have banned people of a certain religion from entering the country. Even though these Muslim men, women and children are suffering just as much as their next door neighbors who are Christian or Jewish.","commenter_a":"Where were these people when Obama was bombing the countries the refugees are fleeing from?","post_message":"Americans across the country protested against Trump's travel ban."},{"comment_id":"472031482987432","commenter_b":"If this is the way she believes then she should go to a country that believes in that kind of stupidity. Piss on the rag heads","commenter_a":"Yes the officer was right, keep up the good work.","post_message":"A woman is suing the police department... over a hijab?  This woman broke the law, the police are completely in the right.  Do you support our police?"}]
