[{"comment_id":"10153981290586519","commenter_b":"@username The war was based on a racist desire to see Arabs burn. That's why the American people wanted it. The goal was simply to slaughter a few hundred thousand of \"them\" after 9/11, and that racism is something Clinton and half her fellow elected Democrats knowingly pandered to.","commenter_a":"The ideological purity of the Left gave us 8 years of Bush while sitting out the midterms. Sanders and his dead-enders repeat every bullshit right wing talking point. Tired of him and then.","post_message":"Establishment liberals have an unhealthy relationship with the left."},{"comment_id":"10152829771848271","commenter_b":"But she's a good girl out to hurt no one. I call BS!","commenter_a":"For all you saying \"She didn't deserve to die.\" So it would have been better if the police office was killed!? Where are your morals people. But when that thug comes knocking on your door who are you calling?","post_message":"The Denver medical examiner's office said Jessica Hernandez also had marijuana and a small amount of alcohol in her system during the Jan. 26 shooting that sparked protests and calls for an outside investigation. DETAILS:"},{"comment_id":"10153567910251130","commenter_b":"I think you're Ricky Gervais pretending to be a guy a named @username! (Please do not take that as an insult! You look like an incredibly fun dude)","commenter_a":"Kid admiring hard working men before society pollutes his brain with the sad gift of being judgemental. Future empath right there. Well done son.","post_message":"Starstruck!"},{"comment_id":"1117162291652524","commenter_b":"Get over it she is covered in the right places and so what if she wasn't. Are you ashamed of your body so let's slam others?","commenter_a":"She is such a skank!!","post_message":"WOAH!"},{"comment_id":"10153223251130329","commenter_b":"What a nasty bitch.","commenter_a":"Wow that Katie chick is a bitch.","post_message":"Awesome."},{"comment_id":"996595140397015","commenter_b":"These gun nutters are too chicken to go fight a REAL threat, so they try to intimate normal people. You freaks are just trying to intimidate people. Red beck, Inbreeds!","commenter_a":"You don'y have to give up your guns, and no one is proposing that (I'm a gun owner and a vet), to have sensible regulation.","post_message":"“I grew up in Tucson, Arizona, and I live there now. And I'm a gun owner and a supporter of the Second Amendment. But I couldn't give you more credit that we need to deal with the wrong people getting guns, especially with mental illness. As you know, in Tucson we had a person who had all kinds of trouble and was able to buy a gun. In Virginia Tech. In Louisiana… So from a gun owner, from a reddest of red states, and a person who owns guns, more power to you.” —an attendee at Hillary’s town hall on gun violence prevention in Manchester, NH"},{"comment_id":"1212344615481226","commenter_b":"WHAT THE HELL IS WRONG WITH THIS WOMAN?????","commenter_a":"Another sold out politician who went off the deep end...","post_message":"Goodness gracious..."}]
