[{"comment_id":"216170728787107","commenter_b":"She is a dried up piece of human flesh!","commenter_a":"This is a crazy idiot sue her but her out of business","post_message":"The heck!"},{"comment_id":"10154116667236002","commenter_b":"If this is true (drowning and family defense) she and her family need to be removed from the gene pool","commenter_a":"If people witnessed her letting her children drown, why didn't they help them?","post_message":"The family of a Texas woman accused of allowing three of her children to drown in a swimming pool is defending her."},{"comment_id":"10155057562030725","commenter_b":"\"Bu-but! If we ban guns evildoers would be unable to buy them!! Rig-Right?\"","commenter_a":"you are so right MR, TRUMP ,","post_message":"If the people so violently shot down in Paris had guns, at least they would have had a fighting chance."},{"comment_id":"957930547633333","commenter_b":"If she finds it so offensive get another job quit inflicting her stuff on us","commenter_a":"Let her rot there.","post_message":"Some people just never learn."},{"comment_id":"10153126250487452","commenter_b":"But she could've let the staff know so they wouldn't bother her. Or find a private, cleaner place than the toilet to do it. Why do people feel so goddamn entitled? People relieving their bladders are important, too, and they can't do that at their seats. Some people need to grow up and realize the world doesn't revolve around your areola","commenter_a":"I have one kidney and would hate to have to sit and wait and wait and wait to use the restroom because she wants the bathroom for an extended period of time. This has nothing to do with breastfeeding and everything to do with being inconsiderate.","post_message":"An Arizona mom claims she was reprimanded by a flight attendant for pumping breast milk in an airplane bathroom."},{"comment_id":"10153076463414753","commenter_b":"If a woman in a bikini top was eating, would you also become this aggressive and immature ?doubt that very much. Grow the hell up.","commenter_a":"and why should we have to move our seat, or \"look away\"? we pay our money for a peaceful meal, not a side show!!!","post_message":"A woman in a cafe was nursing her child when she was approached by a man who asked her to cover up. That's when the cafe owner stepped in and had a few choice words to say."},{"comment_id":"1527023290939672","commenter_b":"@username Jesus Christ, woman....","commenter_a":"well, Oprah, I didnt hear you claiming racist when all us white people were watching your shows and buying your magazine, and saying how great we thought you were,now u got a big bundle of money and suddenly we are racist.....well, thanks a lot for the truth of how you really feel, we will be sure not to bother you with watching your shows or buying your magazine or singing your praises anymore....what an idiot","post_message":"Oprah Claims White People Are The Cause Of Racism In America. She's lost it. What a hypocrite. Do you think Oprah is the racist?"}]
