[{"comment_id":"1121854401168903","commenter_b":"Stfu fat bitch","commenter_a":"Is it because they're assholes?","post_message":"They spend their lives eating rotten meat - so why don't they get sick?"},{"comment_id":"10153176859780667","commenter_b":"Yep..that's what it comes down too. Ungrateful brat & worse money hungry parents !!! Deport them now...but demand payment for his education& for being allowed to live in this great land of opportunities !!! Seriously !!!","commenter_a":"It figures about the money ,but they won't even get 10,000","post_message":"\"The school and city officials involved knew what they needed to do to protect Ahmed's rights. They just decided not to do it.\""},{"comment_id":"572505492946269","commenter_b":"If we could just get a forty hour work week and more than minimum wage so we dont have to work 2 or 3 jobs, life would be a little easier. But the government keeps bringing in illegals and sending our jobs to other countries and we cannot get away from living paycheck to paycheck. It is disguting that the most advanced country makes it citizens live like this. We know it is to control the population.","commenter_a":"Well Hillary is done if she does not win. Without her the path to a 2020 boderless world is stopped dead in it's place. Why oh Why do you think both the Republican and Democratic Party and all the World Cartel Leaders have done everything they can to get rid of Trump for a year? Jeb Bush, the heir apparent is a globalist and so is Hillary. So were the past 5 presidents. With both Jeb and Hillary running, it did not matter who won, the road to globalization was on tract. Enter Trump! Boy did he screw up their plans! No matter what they tried he did not go away! No globalization of America for him! Now as their last hoorah, most all of the newspapers have come out for Hillary and are printing every lie they can about Trump. It is only going to get worse the closer ...","post_message":"This is crucial progress in the push for better workplace policies."},{"comment_id":"10154637985014614","commenter_b":"This is not ordinary little sedan, ya know, lady!","commenter_a":"if they wanted to stop him they'd of poped his tires already","post_message":"Update: California Highway Patrol officers were in pursuit of a stolen big rig on the eastbound 10 Freeway in Riverside County early Tuesday afternoon, authorities said. @webpagelink"},{"comment_id":"1136168619776218","commenter_b":"Now he knows what she's capable of. Either he dumps her now and risk her wrath, or stays on knowing he'll be culpable for any harm perpetrated against a woman he cheats with.","commenter_a":"Throw them both off, it takes two to tango, at the end of the day though its best you know sooner rather than later if he/she is a no good for nothing cheat, cheating on your partner is the worst kind of betrayal, you're better off without them","post_message":"Don’t mess with my man!"},{"comment_id":"10153243418332411","commenter_b":"That's one ugly sumbitch!","commenter_a":"will someone puuulease show this guy the Gates of Hell !","post_message":"North Korean dictator Kim Jong Un used his annual New Year's speech to warn that his country is ready for war."},{"comment_id":"1144395032262257","commenter_b":"there you go with that section 8 typing again, you must have failed computer class terribly lmao","commenter_a":"All people Trippn over a nigga who didn't stand for the pledge of allegience. And y'all got Nazi's on the mo fucking police force. OPEN y'all damn eyes","post_message":"And the police union says it's no big deal 😠😠"}]
