[{"comment_id":"10152877015584071","commenter_b":"Yvon Fugère ton iPad et nos iPhones vont pouvoir avoir iOS 9. Ils l'ont fait beaucoup moins gros, il ne va prendre moins de 2g de place.","commenter_a":"Step 1: Get an Android Step 2: Get Cyanogenmod 11 Step 3: ???? Step 4: $$profit$$","post_message":"Is your device upgradeable?"},{"comment_id":"10153325376679091","commenter_b":"Send these terrorists back to where they came from","commenter_a":"Coming from the idiot that wants to let all these refugees into our country... pfffft","post_message":"\"Once again we have seen an outrageous attempt to terrorize innocent civilians... We send our deepest condolences, offered our full support to the French people\" - President Obama."},{"comment_id":"10152853063786748","commenter_b":"Know what, dude, if you and Obama went to a lunch counter in the deep south in the '50s, you would both stand an equal chance of getting abused and assaulted. And if the right wing scum you shill for ever get back in power, you'll find yourself right back in the 'separate but equal' category tout suite. :P","commenter_a":"right. cause Alan West is the epitome of \"blackness\"","post_message":"Right-wing pundits claim Obama isn't *really* a black American"},{"comment_id":"10154414118997042","commenter_b":"Exactly, she's just a trophy Wife to Donald anyway.","commenter_a":"Mealania Trump's If she only had a brain","post_message":"Melania Trump is being accused of plagiarizing from Michelle Obama's 2008 Democratic National Convention speech.   Judge it for yourself:"},{"comment_id":"521952154659744","commenter_b":"When pigs fly, I'll believe it when I see it!","commenter_a":"Thank you for finally thinking of Americans and our safety !","post_message":"BREAKING..."},{"comment_id":"875517669161528","commenter_b":"Well here's the problem because of women like you these little Angel can't even make to birth how disgusting!","commenter_a":"The American dictionary says it's a human embryo, human fetus, human unborn baby. Common sense says it deserves human rights.","post_message":"Tell Congress to protect the unborn! Sign your Life at Conception Act petition today!  CLICK HERE to sign! @webpagelink"},{"comment_id":"1179430858762542","commenter_b":"@username what an a**","commenter_a":"Not even the president yet, and already proving himself to be the leader we so desperately need!","post_message":"As soon as Donald J. Trump heard the news that 1.5 million people are being asked to leave their homes, he knew exactly what to do..."}]
