[{"comment_id":"1576560615982395","commenter_b":"Bitch needs to go away!","commenter_a":"The woman has been going way too much. She needs to rest. It's not exactly uncommon to get pneumonia when your constantly traveling doing events, and meeting with people on very little sleep.","post_message":"Democratic candidate abruptly left New York's 9/11 ceremony Sunday, raising questions about her health and campaign transparency."},{"comment_id":"10153350973886051","commenter_b":"She lost !!","commenter_a":"that Aunt is a brain dead moron. She doesn't deserve to have any family members.","post_message":"This aunt is suing her 12-year-old nephew for $127,000 over a hug."},{"comment_id":"10154726138223812","commenter_b":"Fact for cowards. Unlike political girly men now. ENFORCE LAW and ORDER--GO TRUMP. Law and order will be immediately restored. Immediately Trump start Rounding up, deporting illegal swine criminals, illegal swine drug dealers, illegal swine drug cartel members. This will solve a lot of the problems.","commenter_a":"How many clowns can you fit in your trunk Mr, King?","post_message":"Rep. Steve King, a conservative immigration hawk who has expressed skepticism about Donald J. Trump's shifting tone on immigration, says at Joni Ernst's Roast & Ride: \"I'm not only going to go into the polls and vote for Donald Trump in November, but I'm going to bring everybody I can with me.\" @webpagelink"},{"comment_id":"10153557938016438","commenter_b":"That woman is a criminal with a capital C.","commenter_a":"This is why I love Hillary Clinton!","post_message":"Clinton knows the only word a politician enmeshed in scandal needs."},{"comment_id":"1673100576267383","commenter_b":"Happy Birthday Goldie, what a delight you have been over the years!","commenter_a":"Yep, gotta love our girrrrrl....","post_message":"Happy birthday, Goldie Hawn!"},{"comment_id":"10156572511460725","commenter_b":"You just hit a grand slam Ron! Trump 2017-2025","commenter_a":"Donald Trump - Think about it... will they stop him, Democrats and Republicans alike? This affects all Americans who get the short end of the stick Democrats and Republicans and Independents. Interesting take on Donald Trump Former U. S. Secretary of Education , William J. Bennett's frankly candid and shocking observations of Donald Trump's impact on the behavior of the entrenched Washington D. C. bureaucrats in both parties -- and the risk The Donald faces in so doing. William J. Bennett, Host of Bill Bennett's Morning in America Show, is one of America 's most important, influential, and respected voices on cultural, political, and education issues. He has one of the strongest Christian world views of any writer in modern times. What I See Happening In a Trump Presidency By Bill Bennett They will kill him before they let him be president. It could be a Republican or a Democrat ...","post_message":"What a great honor- the Reverend Jerry Falwell Jr. of Liberty University, one of the most respected religious leaders in our nation, has just endorsed me!"},{"comment_id":"480250615511785","commenter_b":"she is a lier","commenter_a":"She's teflon!","post_message":"It really doesn't make any sense... www.eaglerising.com"}]
