[{"comment_id":"10153236028424087","commenter_b":"Oh @username, beautiful, sexy, intelligent. You're a dream girl, woman.","commenter_a":"Exactly! Time to move on. Love wins errrr maybe","post_message":"“We've got to keep striving every day to treat each other the way I believe God sees us, as equal in His eyes,” Barack Obama said."},{"comment_id":"1084090904983990","commenter_b":"TheresaStephens I don't know how you can say that. The police might have something on him and if they have he should be charged and locked up for life. And all the tax payers money your going on about let Cliff Richard pay for it if he's guilty, let the police seize all he's wealth and money and all go in police funds. If he is guilty he's nothing else but a dirty old C@@@ I don't care about he's Christian lifestyle if he is guilty he should go away. After all Theresa God hates sexual immortality","commenter_a":"Oh for goodness sake leave the man alone. I'm not a fan but, your innocent till proven guilty. So far they haven't proven a thing. I am sure there are plenty of unturned stones in the police force that need investigating?!","post_message":"Just in...."},{"comment_id":"10153213932211051","commenter_b":"Dumb fucking bitch","commenter_a":"Tabby Witt This lion was in a protected park and was lured out by a dead animal carcus on a stic. Then shot by the dentist with a bow and arrow and after 2 days went by the dentist finally caught up with the lion and then shot him. If you can't see the problem here then you are part of the problem.","post_message":"The hits just keep coming for Cecil The Lion's pride."},{"comment_id":"10153354234326336","commenter_b":"Women should only be allowed to make the sandwiches.","commenter_a":"Females should not be prison guards for male prisons. And I don't want to hear from all the feminist. That is my personal opinion.","post_message":"BREAKING NEWS: New York state prison employee Joyce Mitchell has been arrested on felony charges for providing material assistance to prison escapees, state police say. @webpagelink"},{"comment_id":"839838619485613","commenter_b":"this is as serious as it gets , shes going to bring muslims to America whose religion dictates they rape women and behead the men ,NOT A JOKE","commenter_a":"your listening to the woman that will destroy America , its NO JOKE , ITS NOT BULL CRAP wake up this crook doesn't care about you , MONEY AND POWER that's all shes after","post_message":"WATCH LIVE: Hillary Clinton speaks at an organizing event in Florida — will she bring up Donald J. Trump's tweets?"},{"comment_id":"10153860133856336","commenter_b":"He just figured this out LOL i knew ever since he took office.","commenter_a":"Absolutely.","post_message":"Do you agree with Mike Huckabee?"},{"comment_id":"1079846958771328","commenter_b":"redneck racist are that way","commenter_a":"wtf happened in just 4 years","post_message":"LULZ."}]
