[{"comment_id":"1234498396590570","commenter_b":"Carole, keep your day job and drop the politics. You're a suffering liberal.","commenter_a":"This is big news because conservatives want you NOT to notice that the economy is way up, the deficit is way down, unemployment claims are at a 42 year low, and Obama has unprecedented world approval. So Obama has almost rescued us from the disaster the Republicans left us when Bush was in office. But don't notice that stuff, focus on bathrooms and what Muslims are doing in countries you can't even find on a map.","post_message":"#BoycottTarget  #PRDisaster #TalkIsCheap"},{"comment_id":"1137481012959422","commenter_b":"Get the hell out, asswipes!","commenter_a":"I wish Scottland would welcome me in. I've had it with the states.","post_message":"In case you missed it: Syrian refugees arrived in Scotland this week. This is how they were greeted."},{"comment_id":"10154339330179087","commenter_b":"@username, who is afraid of immigrants? There are laws. Laws need to be followed to become a citizen. Do you want a POTUS ignoring federal laws?","commenter_a":"The left just can't help themselves. They have to cast this Trump... They have to portray him as somebody that's a walking mental midget, that literally has no idea what he's done here by winning the presidency, that has no idea how to talk, has no idea how to behave. They continue to make the mistake of plugging him into their model. They're plugging him into what they think an accomplished politician is, and he's not that, he's never been that, and he's not going to be that.","post_message":"“Trump and Pence, they pulled a dog and pony show on the numbers. I almost threw up in my mouth.”"},{"comment_id":"1570583689633777","commenter_b":"There is no sense in even trying to reason with these people. They are a whole level of crazy I don't want to be around. Scary! I didn't see riots like this when Obama was elected-because we have class and integrity. Trump will lead this country like no other! I can't wait for the future of America!🇺🇸🚂❤️","commenter_a":"Our country is full of spoiled people who are so used to having things their way, they act like a class of 5 y/o kids who didn't get the green marker! Come on, this country has the same electoral system that has worked without problem for hundreds if years. No one rioted when any other person has been elected, altjpugh i am sure many people felt disappointment. And the democrats and supporters whole campaign slogan was \"stronger together, peace, love, equality\"......... Which all I'm seeing is a true fit being thrown by people who didn't get their way. Funny how true colors come shining out when the world they are used to getting their way in doesn't quite work out. Peace, love, equality, anti hate??? I think not supporters. Your example is clear.","post_message":"Protesters burned American flags and chanted \"not my president\" despite Democrats' calls for a peaceful transition of power."},{"comment_id":"913542928735066","commenter_b":"President Barack Obama saved America while dealing with racism, hate and obstruction.... @webpagelink","commenter_a":"Look at his eyes. He's not just low energy. He's medicated.","post_message":"Ben Carson thinks being called out on homophobia is what's destroying America."},{"comment_id":"1069048556481240","commenter_b":"Really, how is this possible!!! Illegal immigrants are cover in the Constitution???","commenter_a":"NO they do NOT","post_message":"Incredible!"},{"comment_id":"10153336997560927","commenter_b":"What about the perverts that are wide open now to expose themselves? Are bathrooms their safe place now to sexually harass the opposite sex? What are libtards going to do when they become victims of their own lunacy?","commenter_a":"We truly need to abolish the ACLU they are bad news for America","post_message":"ACLU: \"By requiring people to use restrooms that do not correspond to their GENDER IDENTITY, this policy not only endangers and discriminates against transgender people  it also violates federal law ...\""}]
