[{"comment_id":"1600782096895914","commenter_b":"Well yeah that's because she'd probably have a bomb, so...","commenter_a":"if she was wearing hejab, the story will definitely be different. meanwhile continue laughing.","post_message":"\"I've flown all over the world and I've been on lots of really long flights and I've never experienced anything like this,\" a passenger said"},{"comment_id":"10154040256123132","commenter_b":"Take her AWAY","commenter_a":"She probably asked for an extension so she could take off far away....","post_message":"The Dance Moms star faces up to 5 years in prison if convicted."},{"comment_id":"10153179691834091","commenter_b":"Hmm...not as bright as WE thought, are you???","commenter_a":"See there, its already fixed. I'm sure it's not the first time this has happened. Everyone have a great night.","post_message":"YIKES!!!"},{"comment_id":"762694963873496","commenter_b":"STFU","commenter_a":"STFU UP","post_message":"Mitt Romney needs to _______________."},{"comment_id":"10155005314954062","commenter_b":"@username Gale Adams @username @username Christina Marie 👀😒😔","commenter_a":"Justin Irwin","post_message":"Please be careful to all of our friends in the Conroe area. This was shared by Heather Dungan from Conroe 105 and I45 near Home Depot.  If you encounter high water, turn around. @webpagelink"},{"comment_id":"1262038440498279","commenter_b":"I don't. Some women do.","commenter_a":"As a man, I have to ask, what is it that you women want from me? More of my money in divorce court? You want me to stop holding the door open for you? Maybe I should stop fixing your car or the plumbing in your home. In combat, maybe you should \"take the point,\" would that make you happy? Centuries have passed since Adam & Eve and the world is still asking, \"what do women want.?\"","post_message":"Huge crowds are marching worldwide for women's rights."},{"comment_id":"1145897778760904","commenter_b":"I have the same solution no matter the skin color......shot them, protect the population from killers.","commenter_a":"Throw him in a cell with a bunch of big angry sex offenders.","post_message":""}]
