[{"comment_id":"10154058218236770","commenter_b":"Procecute this women she just as dishonest as Hillary","commenter_a":"Obama tossed her under the bus. So much for loyalty.","post_message":"Attorney General Loretta Lynch is defending the FBI against allegations that the bureau mishandled investigations of email hacks of Democrats and focused too much attention on Hillary Clinton’s private email server."},{"comment_id":"10153030490451800","commenter_b":"Pageants are Insults to women and we should be past these DOG and PONY shows by now.","commenter_a":"Evidence That Beauty Pageants are Epic failures \" SARAH PALIN\". VAPID AS ANY CANDIDATE FOR ANY OFFICE ANYWHERE ANYTIME THE ONLY BIGGER IDIOTS ARE HER DONORS AND PERSONS STUPID ENOUGH TO BUY HER BOOKS. When I find one of her books for 15 cents at a Thrift store I will shred it and use it to Line my cats Litter BOX. ( If i don't find a Donald trump book first)","post_message":"\"Good for Miss Lebanon and Israel for rising above your countries' political squabbles to say to the world that on the inside, we're the same. And also on the outside, apparently they're the same. They're almost completely identical, it's really inspiring.\" -- Jon Stewart @webpagelink"},{"comment_id":"1195181073877040","commenter_b":"Kick her ass out","commenter_a":"What does Jesus tell us about judging others. I get what your saying, but look in the mirrior and pull the plank out of your own eye before pulling the spec out of anothers. Peace","post_message":"Do you think she should be KICKED OUT of the Olympics??"},{"comment_id":"10153644045081037","commenter_b":"Democrats do not want her. She can go away now.","commenter_a":"It's mean she's a Democrat, Yahoo.","post_message":"Should the candidates be concerned that a large portion of the “people” reading their tweets are fakes?"},{"comment_id":"10154272601268525","commenter_b":"How stupid are those girls...their on camera now...lol","commenter_a":"Shane Ornelas","post_message":"HULK HOGAN ROBBED: Not even the iconic wrestler's home is safe from holiday package thieves!  STORY: fox10phoenix.com/entertainment/@username-story"},{"comment_id":"1619415335012246","commenter_b":"Who do they think they are that they can come over to our country and try to change it? When they come here they have to obey our laws! This is our country not there we were to go to their countwe would have to obey their laws!","commenter_a":"Love the US & abide by our beliefs & the law of our land. Under God we trust & our constitution. Or GET OUT period.","post_message":"Here response is sickening.  These radicals must be stopped."},{"comment_id":"594411744025341","commenter_b":"You probably have one between your legs Shannon!","commenter_a":"Who cares! It's an inanimate object! Ever heard of idolatry? This is it!!!! True followers of Christ don't kneel before a statue, they kneel before the one true God.","post_message":"What does sheer animalistic Muslim hatred against Christians look like? Story below."}]
