[{"comment_id":"908720232539273","commenter_b":"Oh Mr Trump , I personally can not wait for you to be our New PRESIDENT! All these people saying they are going to leave, I sure hope they do , to bad you can not make it a law that they have to, American might just be s better place without these people. You raised 6 million for the vets what did these people do ??? Besides complain they need to put their energy towards something positive instead of trying to find negativity. Great Job Mr further PRESIDENT TRUMP","commenter_a":"idiot,trump cant do any worse than dumb obama n our stiupid ripoff goverment'get real","post_message":"A majority of people said they would go to Mexico."},{"comment_id":"1732731136976178","commenter_b":"@username STFU","commenter_a":"No one will care! Liberals will vote for this criminal no matter what she does!","post_message":"New details about the investigation into Hillary's pay-to-play scheme while she was Secretary of State."},{"comment_id":"10153737198202235","commenter_b":"Fucking dumb women.","commenter_a":"Carson will never be elected because the majority of American women will never vote for this clown","post_message":"What a horrible person he is. Just awful."},{"comment_id":"10153352212341162","commenter_b":"So, Michael \"TheArtist\" Louis, what you're saying is- the young man in the meme isn't \"black\" enough for you? That only people who subscribe to the stereotypical depiction of how black people dress and behave are \"real\" black people? If that's not racist against African Americans, I don't know what is... Smh. And isn't the point of ending racism getting AWAY from stereotyping based on the color of a person's skin? The funny thing is, the meme maker -who is presumably black based on what the meme says- is *trying to* say that white people are racist, when in reality - they have such deeply rooted issues of their own that they didn't even realize their meme was racist against themselves. Start with yourself...","commenter_a":"Looks like she for sent home for having a black date nothing's wrong with her dress","post_message":"TOO REVEALING? A girl was sent home from prom because school officials thought her dress showed too much skin. What do you think?   PHOTOS: @webpagelink"},{"comment_id":"984804904949095","commenter_b":"They had the taser pointed at him which caused him to panic most likely why not use the taser??? The other 2 cops didn't shoot and did not feel they were endangered.","commenter_a":"@username keeps stirring the pot against cops. I hope one day, you folks need a cop. Crickets is all you'll hear.","post_message":"In 2013, Officer Randal Kerrick shot former Florida A&M University football player Jonathan Ferrell, who was unarmed, 10 times."},{"comment_id":"565700806961575","commenter_b":"Don't they get it! We don't want her!","commenter_a":"Hillary will probably die before then of karma and natural causes!","post_message":"Trump-Clinton rematch for 2020?"},{"comment_id":"10154691366756130","commenter_b":"She should be ashamed of herself!","commenter_a":"Funny and sadly accurate","post_message":"She got answers all right."}]
