[{"comment_id":"10153339835009087","commenter_b":"Does this apply to Christian refugees too ?","commenter_a":"youtube title; William Blum - CIA murder and torture of Hundreds of thousands of people...use transgenders & lesbians deuteronomy 22:5 man should not wear the headdress of a woman & a woman should not wear the headdress of a man... youtube title; Collapse of Europe and the United States Of America ...vengence is mine say the living god psalms 104:16 of israel who's name is JEHOVAH deuteronomy 32:35 & romans 12:19-21..john hopkins mount sinai nyu medical bellvue hospital fraudulet med scam bill penis breath clinton irish shit god of luck death trap robert & patrick kennedy section 508 mental illness research nazi's... article title; The Clinton Crime Family...vengence is mine say's JEHOVAH the god of israel deuteronomy 32:35..bill penis breath clinton irish god of luck death trap section 508 disability... article title; Willie Lynch letter: The Making of a Slave...bill penis breath clinton great white satan irish god of luck ...","post_message":"“[Refugee children] are indistinguishable from any child in America,” President Barack Obama said. “The notion that we should somehow be fearful of them, that our politics would somehow leave them to turn our sights away from their plight, is not representative of the best of who we are.”"},{"comment_id":"657878574399677","commenter_b":"Shame should be heaped on this persons head. Open your mouth and sing HIS praises..not for Trump but to glorify His name. Shame on you lady!! :-(","commenter_a":"The member states that \"she could never throw roses to Hitler\" code for she supported Stalin 😉 she's irrelevant...","post_message":"More pre-inauguration insult and upset from progressives — 'I could never sing for him.'"},{"comment_id":"10153117500629342","commenter_b":"#seriously what woman wants to see a man in tight shorts? #smh","commenter_a":"Jenn Nunez I will be going to Dallas soon","post_message":"The restaurant says it offers something for both girls and boys."},{"comment_id":"10153030983541051","commenter_b":"I would sue tjat fucking bitch and that guy","commenter_a":"Soooooo?! Why was that day different from any other?","post_message":"This woman turned to the Border Patrol officers and said: What are you going to do, arrest me? Turns out, they had something else in mind."},{"comment_id":"10152984956631378","commenter_b":"Alan. Yes, it is murder. Abortion isn't done at 8 months.","commenter_a":"If abortion is totally banned, get prepared for this kind of thing to happen far more often.","post_message":"POLICE: TEEN BEATEN TO ABORT BABY: Police say four family members were arrested after a 14-year-old girl impregnated by a relative was beaten in order to induce an abortion: 6abc.cm/1Q7wchn"},{"comment_id":"10153643322467434","commenter_b":"@username, I am an actress...I can rip you apart in iambic pentameter. Words do matter and so do definitions. In order for RAPE to occur, SEX has to happen...or it is considered MOLESTATION...","commenter_a":"Wow...semantics. Yes, Brock Turner DID have sexual relations...or else he couldn't have RAPED her. Sex is kind of a requirement...the headline does NOT say \"consensual\". #GoodGrief","post_message":"Just because the law smiled upon a man who had sex with an unconscious woman behind a dumpster doesn’t mean this group of angry, armed protesters will do the same."},{"comment_id":"1587581361533554","commenter_b":"Can we let her off with this one? I think it's in the public interest if we don't see that. The photographs of her having sex in a field were enough.","commenter_a":"I protest to this, I wouldn't wish that sort of cruelty on any sausage. Plus lets face it there would be no room for the sausage when her head is so far up there..","post_message":"On 4th May Hopkins tweeted \"If Sadiq Khan wins London, I will run naked down Regent Street with a sausage up my bum in protest #LondonMayor2016.\"  She later tweeted: \"I'm a woman of my word.\""}]
