[{"comment_id":"10153256753408445","commenter_b":"All I know is I'm gonna smoke so yea u can lick my ass crack","commenter_a":"yea lets kill all those smokin weed dumb fkin pigs lay em all down permanently","post_message":"#NEW - Hundreds of Local Cops Are Requesting Armored Trucks To Fight War on Weed"},{"comment_id":"465878743536720","commenter_b":"Wake up lady.","commenter_a":"if you think Trump loves America, why does he insult everyone and everything??? And Obama has done more for the middle class than many previous presidents.","post_message":"U.S. Democratic presidential candidate Hillary Clinton says she's \"appalled\" after Donald Trump declined to correct a man who called President Obama a Muslim and non-American during a town hall event. Was she right?"},{"comment_id":"10153739704671051","commenter_b":"Dumb ass","commenter_a":"For recreational usage YES, only and dope does dope for no reason other than to escape reality. For MEDICAL use, HELL NO, it should be 100% illegal. BUT, that is not the real issue here..... the REAL issue is, THE LAW Follow it, or pay the price, SIMPLE","post_message":"Do you think marijuana usage should be illegal?"},{"comment_id":"1013476458674427","commenter_b":"It was a lady Marine, she could have kicked his tear","commenter_a":"There are not enough words to describe what a worthless piece of crap this man is & idiots voted for him twice.","post_message":"I'm sure he's really proud of himself."},{"comment_id":"500239630100631","commenter_b":"Hopefully that little girl will hold a pillow over grandma bitches head later that night! Mean old bitch!","commenter_a":"What kind of monster does this ? I would kill the son of a bitch. Rot in hell !!!!","post_message":"This was too heartbreaking to watch all the way through. What kind of animal does this to a little child?"},{"comment_id":"1282426895139188","commenter_b":"Build That Wall","commenter_a":"So sad! Blue lives matter","post_message":"LIVE NOW: Procession now underway in the LA area, for an officer who died in a shooting there this morning. FULL STORY: @webpagelink"},{"comment_id":"10152705409276051","commenter_b":"This scummy bitch deserves to die for what she did to that baby","commenter_a":"sorry sick people deserve the worse","post_message":"Officials couldn't believe that a mom would do this to her own child."}]
