[{"comment_id":"750991365034044","commenter_b":"Ok idiot if you want to require those mothers on welfare to work \"chain gangs\" to \"earn\" their food stamps does this mean you're willing to pay their childcare while they do so? You think most young mothers WANT to live on assistance you're a bigger Tard than you sound! The only way this maybe possibly would fly is if you held the FATHERS accountable too!!!! Duh.....sorry it's obvious you barely made it through ninth grade TROLLER","commenter_a":"I've been saying this for years, they say our roads suck well get the freeloaders on welfare to go fix them, instead of chain gangs picking up trash make them do it. It's no ones fault but your own if you want kids, make sure you can support them! Welfare should be a times thing like a year after that your done. If you think flipping burgers is beneath you guess what if it means you have food, shelter and clothes it beats nothing at all if you have to work two jobs that's on you, maybe you should have made something of yourself! No more giving illegal aliens good stamps or any kind of government handout. You want to be an American go get a job and pay taxes like everyone else!","post_message":"Take note.....it's damn brilliant."},{"comment_id":"1082049255206943","commenter_b":"\"Claim to be Muslim\"??? Muslims marry 6 year old girls! Muslims think that women are 2nd class citizens! Muslims believe that women shouldn't be allowed to drive or leave the house alone! Muslims believe that the punishment for being gay is DEATH! Their culture and our culture can't coexist peacefully! Is there some part of that that you can't understand?!?!?!?","commenter_a":"It reminds me of Sodom and Gomorrah. The whole group would not allow the police to get to the BOY...What the fuck is wrong with these sick Bastards, that claim to be Muslim? Raping of young boys and girls is okay? I ned to re-read the Koran...","post_message":"Some of Obama's Muslim \"refugees\" were raping a 10-year-old boy when the cops were called.  The police arrived, but what they did once they got there has left the country furious.  It's time America learned the WHOLE truth..."},{"comment_id":"10153859068156955","commenter_b":"Leave the mug and leave her alone.","commenter_a":"She didn't like the interview either, (\"Not one bit\"). Did they ask Ms Flossie if & when SHE wanted to be interviewed? It was all very awkward. They gave her a station coffee mug (shameful)... Put flowers on her lap that she can't hold... The kicker to me was the opening where the interviewer held up the newspaper RIGHT IN FRONT OF HER FACE!!!! The whole thing was disrespectful.","post_message":"BEST INTERVIEW EVER"},{"comment_id":"10154009209659087","commenter_b":"@username if they were legal the kids would be citizens","commenter_a":"I don't know how much credence we can give any of the polls after they caught Reuters \"cooking\" that poll a few weeks ago. It goes without saying the media bias has never been this strong ever.","post_message":"CNN anchor Brianna Keilar is challenged by Donald Trump's lawyer Michael Cohen to identify which polls show his campaign losing. Her response stuns him."},{"comment_id":"1782129738697799","commenter_b":"She doesnt know, she just wants to bash him because shes a Kate fan.","commenter_a":"Shameful that these girls have been brainwashed.....the mother is more responsible for the marriage breakup. She treated the father horribly. TLC destroyed this family. Just as you have one mother young ladies; you also have one father. He nurtured you as well when you were babies up to the point your mother ran him off. Look at your old pictures and first episodes of your show. Your father was pretty much left with nothing.","post_message":"“He doesn’t even know us”"},{"comment_id":"455406524619303","commenter_b":"And guess what... that girl who got pinned to the ground.....yeah she has a pass to the pool.","commenter_a":"I love kicking people out from our community Pool. They are not allowed because of \"race\" but because they don't own a house in our \"Gated\" community and pay HOA fees.","post_message":"\"The officer never asked any questions. He jumped out of the car and immediately started running to the black kids.\""},{"comment_id":"889054771211302","commenter_b":"It doesn't happen to muslim women because they are all fugly uckers..","commenter_a":"Go fuck yourselves, dune coon","post_message":"ClashDaily.com"}]
