[{"comment_id":"10153362031969087","commenter_b":"BAN ISLAM! BAN MUSLIMS! CLOSE THE MOSQUES NOW!!!","commenter_a":"I see we owe the NRA and Republican a big thank you for allowing another mass shooting DROP DEAD YOU MOTHER FUCKERS","post_message":"\"Upwards of 14\" people are dead and \"upwards of 14\" people are injured after \"up to three people\" opened fire at a holiday party inside the Inland Regional Center building in #SanBernardino, California. WATCH LIVE:"},{"comment_id":"10153697360054091","commenter_b":"Relax...pretty sure she won't get a welcoming party in jail...LOL","commenter_a":"Really? So now taxpayers get to pay to house her, feed her, clothe her, get her medical attention when needed. Who wins? This woman should just be drawn and quartered after a long term of suffering torture. A mind like hers should never be able to influence others in prison. Maybe they will put her in a dark place alone and forget about her.","post_message":"A Colorado judge sentenced the woman who cut a baby from a stranger womb to a century behind bars."},{"comment_id":"1201199053280181","commenter_b":"For them girls that gotta get from one dick to the next real quick😭😭😂","commenter_a":"Rebecca oh lawwwd no😭😂","post_message":" "},{"comment_id":"10153396046867452","commenter_b":"what if they didn't do it... cut it off anyway????????????????","commenter_a":"Thats the best freaken law ever. Pass it nation wide","post_message":"\"They have marked this child for life, and the punishment should fit the crime.\"  If an Alabama lawmaker gets his way, part of the punishment for people who commit sex crimes against children will be castration."},{"comment_id":"10156410644080725","commenter_b":".... And thats why im voting for Bernie Sanders and not a wealthy racist biggot like yourself.Mr. Trump our country doesnt need you.. you talk about about immagrants but all your wives were immagrants? What are you but an immagrant to this country yourself! Unless your native but that would be news to us! What tribe you belong to?? I.D cards to all the muslims in this country? Is this Nazi Germany???","commenter_a":"Trump is like a pre-PC candidate! So refreshing!! I remember feeling just a leetle bit awkward at first. That made me realize just how far we've fallen! #TeamTrump2016 #MakeAmericaGreatAgain #DitchAndSwitchNow","post_message":"People have got to stop working to be so politically correct and focus all of their energy on finding solutions to very complex problems!"},{"comment_id":"10153541850619712","commenter_b":"It's Bush's fault, and you're a Racist. Let's audit the EBT accounts of people to ensure that they are not out selling 2 for 1 groceries, to get their Malt Liquor and Newport's. There is no Free Ride, you Generational Welfare Leeches. Some people shouldn't Breed!","commenter_a":"that what they do","post_message":"Despite calls for his ouster after making controversial comments about lead poisoning, Gov. Larry Hogan's housing secretary will keep his job."},{"comment_id":"1287419524611131","commenter_b":"Lefty lady","commenter_a":"My peeps","post_message":"It's National Left Handers' Day! Did you know only 10% of the U.S population is left-handed? Comment below if you're a lefty like these celebrities. >> kiro.tv/Famous-Lefties"}]
