[{"comment_id":"10152589003412894","commenter_b":"That bitch got implants","commenter_a":"I agree with C completely. He has God given talent. She has what God and cosmetic surgery gave her. She has no talent. She did not invent big, voluptuous butts.","post_message":"Charlie Sheen Pops All the Way Off on 'Zero Talent' Kim Kardashian: 'Go F Yourself'"},{"comment_id":"888422501286356","commenter_b":"I feel bad for whoever votes for Hillary!!! You are asking for our country to be taken over and also death for America!!!! I guess Muslims get there wish of destroying America if Hillary is elected into the White House!!!! She is a traitor just like Obama is!!!!","commenter_a":"Hillary will probably just let me and my brothers die without any help. I trust trump fully.","post_message":"Who do you trust more to protect the American people: Hillary or Trump?"},{"comment_id":"10153223168071509","commenter_b":"The Christ is real but Roman Catholicsm is a Pagan Religion I think","commenter_a":"Hopefully they are totally different from the other out of touch cardinals we now have .","post_message":"For the second time during his papacy, Pope Francis has announced a new group of bishops and archbishops set to become cardinals -- and they come from all over the world. @webpagelink"},{"comment_id":"10157007310710354","commenter_b":"Arrest her. There is no such Allah.","commenter_a":"Could she be a worse POS?","post_message":"Here's the deleted TWEET..."},{"comment_id":"10153314769416491","commenter_b":"We Aussies don't want this xenophobic, racist bigot back","commenter_a":"I think we should deport Rupert for being UN-AMERICAN.","post_message":"Rupert Murdoch: \"Maybe make special exception for proven Christians.\""},{"comment_id":"10153709197621336","commenter_b":"Was he having a stroke?","commenter_a":"Billynyvy Martinez","post_message":"WATCH: One Southwest Airlines employee could barely get through his safety spiel without nodding off and slurring his words."},{"comment_id":"853431768039181","commenter_b":"I notice that there were over 5,000 views I'm sure with the government controlled internet that is about 5,700 over raided so like no one cares.... BUT more scandals and more lies... she will be just like obama,,, she wants to take your right's away just like obama... and she will win by the votes of all the illegals that MUSLIM obama let in..","commenter_a":"Scandal after scandal after scandal from the early years until now. No wonder 57% of all of American's find her untrustworthy !!! The other 43% are Liberal morons.","post_message":"New York Times reporter Maggie Haberman says that Hillary Clinton looked “very defensive” answering questions."}]
