[{"comment_id":"1203191243053664","commenter_b":"Fry the bitch!!!!","commenter_a":"She's as much of a terrorist as he is because she knew and said nothing!!! Life in prison or deport and never allow her back in our country.","post_message":"WIFE PLAYED A ROLE:  @webpagelink"},{"comment_id":"10153159608716833","commenter_b":"Took out the trash.","commenter_a":"The guy with the gun did the right thing!","post_message":"Armed Citizen: Video has been released showing a man armed with a machete kicking in a Pocatello, Idaho, apartment door last year, then getting shot by the apartment resident."},{"comment_id":"10153552105389087","commenter_b":"What an undemocratic woman.","commenter_a":"I can't stand her. She had no ideas other than the ones she stole from Sanders.","post_message":"Jeff Johnson, the head of the Washington State Labor Council, was scheduled to speak in at a pro-Bernie Sanders rally, but a pro-Hillary Clinton union affiliated with AFL-CIO threatened to take away funding from Johnson's group if he spoke at the event, forcing him to back out."},{"comment_id":"1071843699548997","commenter_b":"Lol stfu","commenter_a":"God Bless you Donald Jesus has CHOSEN you to lead our country !","post_message":""},{"comment_id":"1765122613748965","commenter_b":"NO YOU SHOULD SHUT THE F UP","commenter_a":"#Podesta should stfu...","post_message":"\"I think the men and women of the FBI are doing a tremendous job out here across the country. But the leakers should shut up,\" Podesta said"},{"comment_id":"1512686248764628","commenter_b":"Oranges are offensive, they resembles balls, likes men's balls! such a coincidence that white males eat oranges?! patriarchy for sure","commenter_a":"This article is very misandrist and perpetuating the matriarchy. All men are handsome inside and out. Try being more accepting, less shallow, and do less femsplaining UGG #triggered","post_message":"\"If someone was quite a weird child, he tends to be a great date.\""},{"comment_id":"1384042331652908","commenter_b":"Good on ya.","commenter_a":"I stopped looking twenty years ago and saw my best friend and \"soul mate\" even though I know that souls are just a fantasy, right in the mirror. So me and my self became best friends and I haven't needed anyone in my life since then. I've been happier, I bought two homes in the last twenty years, and the freedom from the male drama is the best feeling in the world!!!","post_message":"As one writer points out, we spend endless hours wishing for, praying for, begging for our soul mates – that person who will finally make all the suffering worth it. But I’m here to tell you a little secret."}]
