[{"comment_id":"10154033715125329","commenter_b":"Chop chop woman haha","commenter_a":"@username Brittany Suzanne Pink","post_message":"Gilmore Girls could be getting new episodes on Netflix!"},{"comment_id":"1571786566441790","commenter_b":"What good will it do, congress passes these laws.","commenter_a":"These people make me sick.","post_message":"These welfare abusers need to be taught a lesson.  Way to go Judge Judy!"},{"comment_id":"1809742349269568","commenter_b":"IF YOU CAN DUMP TRUMP OVER SOMETHING HE DID YEARS AGO IN PRIVATE LIFE. THEN HILLARY SHOULD BE IN PRISON NOW.LOOK AT 5HE TREASONOUS ACTS AGAINST AMERICANS. THIS IS ALL SHE CAN COME UP WITH TO DEBATE TRUMP SHE HAS LOST ALREADY.","commenter_a":"It's not happening folks, he IS our next president !!!! He has done nothing most guys haven't done around a bar table or a camp fire with their friends, and most girls have done talking to their girlfriends and men, his words can't even come close to what that female has done, so get over it he is the only smart choice !!!!!","post_message":"Lawyers at the Republican National Committee are assessing what legal remedies, if any, could allow the committee to remove Donald Trump as the party’s standard bearer."},{"comment_id":"957822790936024","commenter_b":"Let's get all them bitches","commenter_a":"👌👍👊","post_message":"Human excrement gets flushed! Australia's most wanted ISIS terrorists just got smoked in Iraq. ~Will"},{"comment_id":"10152961247876680","commenter_b":"That's you and your crowd... Dead and cut up babies sold for the meat market !","commenter_a":"I proudly stand with Planned Parenthood.","post_message":"The move dramatically increases the chances of a government shutdown fight in the fall."},{"comment_id":"540837429437883","commenter_b":"They reap what they sow ! Don't allow them in your country. Deport the ones there .","commenter_a":"Lets not allow these problems with muslim REFUGEES in europe keep us from doing our duty for the safety of america. Our president asked that we turn in our guns so we really need to get moving and take care of that!","post_message":"COMING SOON in your city and town..."},{"comment_id":"979819422085921","commenter_b":"@username don't curse Canada with the likes of people like her. Send them to mexico!","commenter_a":"Just because a person is an actor/actress does not mean they know their head from their a$$ ... proof right there in that statement","post_message":"Americas Freedom Fighters"}]
