[{"comment_id":"1121854401168903","commenter_b":"Stfu fat bitch","commenter_a":"Is it because they're assholes?","post_message":"They spend their lives eating rotten meat - so why don't they get sick?"},{"comment_id":"10153580814197235","commenter_b":"Lizzie, abortion is totally legal in the case of danger on the mother's life, no matter how old the fetes is","commenter_a":"Mike Huckabee reminds me of fundamentalist Muslims.","post_message":"Horrific."},{"comment_id":"10154345294706002","commenter_b":"We are fat enough. Plus the ratio is already perf","commenter_a":"No thanks Hershey can choke on there candy When they stop making it in USA like they used to we stopped buying it. We are so done.","post_message":"Hershey's says it will start selling Hershey's Kisses Deluxe in the United States beginning Nov. 5."},{"comment_id":"865998906849825","commenter_b":"godless atheists,satanists THIS FUCKIN FUSE OF LOWLIFES WILL END SOON","commenter_a":"When we start seeing these statue like this around America , that means the devil have claimed this land, God is coming back soon ppl be warned","post_message":"Florida Agrees to Distribute Satanic Temple Materials To School Children"},{"comment_id":"1069048556481240","commenter_b":"Really, how is this possible!!! Illegal immigrants are cover in the Constitution???","commenter_a":"NO they do NOT","post_message":"Incredible!"},{"comment_id":"10153217644964411","commenter_b":"Lmfao ro. What about the natives in Mexico? Forget about them you spaniard?","commenter_a":"Fuck off back to America - youu are needed there to fight the police!","post_message":"'The whole purpose  is to assure those allies that live closest to the Bear that we are here,' Lt. Gen. Ben Hodges, commanding general of US Army Europe said."},{"comment_id":"10153365058753984","commenter_b":"Absolutely! They are bully cowards! It's going to be like exterminating roaches! We've let them go way too long!!!","commenter_a":"Yes","post_message":"This is scary. I pray America doesn't see further acts of terror from this group, but it sounds like these jihadists have something else in mind...  Would you support wiping out ISIS?"}]
