[{"comment_id":"10154173951544199","commenter_b":"I agree.....and you know that kind of thing is coming....gender nutral bathrooms.","commenter_a":"I think this is just another poor choice.If I am going to buy a toy for a child its helpful to know where I'm going.If I want one for my grandson or grand daughter it saves me time knowing which section to go to.Kind of like going to grocery shop and trying to find a specific item but every aisle just says \"Groceries\".","post_message":" change is a step towards removing gender limitations in childhood, but when one of the world largest retailers does this, the ripple effect will be significant."},{"comment_id":"1746288005610861","commenter_b":"Women do not get kicked out of restaurants because their children cry. What world do you live in ?","commenter_a":"Whatever. If that kid was crying in the middle of some restaurant & the owner told the mother to leave for the sake of the rest of the patrons he'd be applauded. Taking a baby to a political rally is as foolish as taking a baby to a Slayer concert. The exception being Slayer fans are far more courteous than the average politcal junky.","post_message":"\"I think she really believed me that I love having a baby crying while I'm speaking. People don't understand.\""},{"comment_id":"535259990005462","commenter_b":"I wish Dr Carson was our nominee! However, Trump is and he must win or our nation is doomed. Clinton has proven to be the most corrupted, evil lying politician ever!! It's beyond me that anyone in their right mind could support her!","commenter_a":"How can you defend this man?","post_message":"It's a shame that The New York Times and the media are on an all out witch hunt against Donald J. Trump. The media should be fair and balanced, not biased."},{"comment_id":"983450188381396","commenter_b":"Sal khan would you stop blaming anyone appart from your pals?!?!? Europe did this, US did that. Wake up.","commenter_a":"Islam for you. Peadophile third world cult. Enough said","post_message":"Sickening."},{"comment_id":"10154635792157599","commenter_b":"The GOP is better than this. The USA is far better than this. Be bold, represent your district, and stand against the unconstitutional, corrupt administration that has taken office. The administration's actions should be leading Republicans and Democrats in Congress to work closely together and assert power as the legislative branch, rather than acting as an extension of the executive branch. #NoBanNoWall","commenter_a":"Congressman Reichert, I believe it is important to remember that the United States of America is a REPRESENTATIVE republic. As our elected REPRESENTATIVE, please REPRESENT the people of your District. You were elected to REPRESENT the people of the 8th Congressional District of the State of Washington (NOT Donald Trump).","post_message":"Careful vetting to ensure the safety of the American people is the responsibility of the federal government and one I take very seriously. Unfortunately what we saw this past weekend was mass confusion and miscommunication between government agencies and the improper apprehension of people legally allowed to be in the US. I urge the administration to work with Congress on solutions that protect our borders while maintaining our nation's dedication to compassion and religious freedom."},{"comment_id":"1227346897337998","commenter_b":"Idiot sick woman","commenter_a":"Good thing we have wikileaks and Project Veritas for the truth. Trump/Pence 2016 #draintheswamp #hillaryforprison #spiritcooking","post_message":"JAY Z said he doesn't have any \"ill will\" toward Donald J. Trump, but he \"cannot be our president.\" Before introducing Hillary Clinton onstage with Beyoncé at the Cleveland, Ohio, rally, Jay Z repeated this twice: \"Once you divide us, you weaken us. We're stronger together\" @webpagelink"},{"comment_id":"10153762341043869","commenter_b":"look in g good.","commenter_a":"legend cinemas click the here ..... do not insult before trying X-Men: Apocalypse Full Movie @webpagelink Rangoon 2016 @webpagelink All Ladies do it (1992) @webpagelink Monella @webpagelink captain-america-civil war @webpagelink The Jungle Book Full Movie @webpagelink Batman v Superman: Dawn of Justice Full Movie @webpagelink Barbershop: The Next Cut Full Movie @webpagelink London Has Fallen Full Movie @webpagelink zootopia Full Movie @webpagelink Central Intelligence Full Movie @webpagelink deadpool movie 2016 @webpagelink ride-along @webpagelink The legend of Tarzan @webpagelink fifty shades2016 @webpagelink","post_message":"Like most of his predecessors, Barack Obama used the bombing as a generic invocation of the nuclear age—past tense, passive voice, Alex Wellerstein writes."}]
