[{"comment_id":"1371649186228159","commenter_b":"There's a Q now, what does that stand for?","commenter_a":"They absolutely deserved it. As a proud member of the LGBTQ+ community I am shocked at half of these comments. You show that crown off with pride honey because you really deserved it.","post_message":"Hateful backlash from jealous female classmates angry at being beaten by a 'boy'"},{"comment_id":"1324679534258458","commenter_b":"The women who aren't giving it up are defending her.","commenter_a":"She might be asexual.","post_message":"'I love my husband ... I just don't want to have sex with him'"},{"comment_id":"1073989012671274","commenter_b":"LOCK HER UP !!!!!! LOCK HER UP!!!!!!!!!! LOCK HER UP!!!!!!","commenter_a":"Yea to Iran and Syria to send there trash here while our jobs and wealth leaves while you trash the country to get rich???? Yea ok...#TRUMP2016","post_message":"\"Next week in Philadelphia, we will offer a very different vision for our country, one that is about building bridges, not walls.\"  In introducing her running mate U.S. Senator Tim Kaine, Hillary Clinton promised the DNC would look quite different than the RNC. bit.ly/2a3iybw"},{"comment_id":"1035291306577703","commenter_b":"Science does trump random personal stories. (pun intended)","commenter_a":"I live in Savannah Georgia the South Carolina border is 10 mins away from me, 9 out of every 10 people I meet regardless of sex color sexuality or background supports trump, most support him silently they are not going to run around screaming that they support trump they are not participating in polls their voices will be heard at the ballots","post_message":"Hillary Clinton and Donald J. Trump are tied in South Carolina according to new polling. Rachel Maddow breaks down the surprising development.  More analysis on the latest polling from The Rachel Maddow Show: @webpagelink"},{"comment_id":"10153881107946680","commenter_b":"Another Misogynist","commenter_a":"\"I'd grown up fearing the lynch mobs of the Ku Klux Klan; as an adult I was starting to wonder if I'd been afraid of the wrong white people all along - where I was being pursued not by bigots in white robes but, by left-wing zealots draped in flowing sanctimony.\" -- Clarence Thomas Vote Trump. He's easier to impeach.","post_message":"\"Long overshadowed by Scalia, the quiet radical is poised to shape his legacy.\" Via POLITICO Magazine"},{"comment_id":"10153629866881336","commenter_b":"She is pathetic and out of control.","commenter_a":"Miley is a marginally talented girl with very little respect for herself. Billy Ray should be ashamed.","post_message":"What did you think of Miley Cyrus' barely-there ensemble?"},{"comment_id":"505124579675835","commenter_b":"Kiss my ass!!","commenter_a":"You have no rights!","post_message":"The most chilling and honest interview about Islam you’ll ever watch…"}]
