[{"comment_id":"703956159761577","commenter_b":"this universe. She is vermin! Excuse me vermin.","commenter_a":"NOTHING is too horrible to say to her. She embodies every disgusting thing wrong in thi","post_message":"Ann Coulter wasn't the star of the roast, but she took a lot of the heat."},{"comment_id":"10154074344751336","commenter_b":"You're an idiot.","commenter_a":"It looks like the liberal PC police culture have hit the Miami police department. Their feelings are hurt so they will be boycotting Beyonce by not doing their job. We need to make sure to send enough panties for them to wear so they can cry comfortably at the boycott. Our officers used to have thicker skin than this. This is a sad day in America when our police officers are crying and boycotting for hurt feelings.","post_message":"Usher, Demi Lovato, Yolanda Adams and The Band Perry are among the contemporary artists heading to The White House to celebrate the late Ray Charles."},{"comment_id":"10152872037516316","commenter_b":"YES! I don't understand some of my friends who like her. She's evil.","commenter_a":"As gratitude my wish is that she receives a free year supply of GMO foods! :)","post_message":"Hillary Clinton continues to dodge the press after being revealed as the Bride of Frankenfoods: @webpagelink"},{"comment_id":"10153035284712434","commenter_b":"Go move to syria ...bitch","commenter_a":"It is inhuman to turn these people away. The terror experienced in Paris for one night is what they go through on a day to day basis and you want to send them away? Have some empathy, what if it was you and your child fleeing this barbarism? Turning them away is no better than away Jewish refugees during WW2 (see SS St. Louis). How anyone can see their suffering and simply ignore it or tell them to leave defies any and all tenants of a Christian faith, humanity, and what America stands for.","post_message":"How very Christian of them."},{"comment_id":"1171664359552992","commenter_b":"Idiots...they should be training Americans how to protect themselves from Muslims","commenter_a":"Hahahahahahahah very funny","post_message":"@webpagelink"},{"comment_id":"10153178385132061","commenter_b":"Cheesy come back. You dumb blond.","commenter_a":"She's beautiful. I hope she still likes boys. Maybe she's transgender. Not that I care lol","post_message":"\"She's not a girl playing football; she's a football player that's a girl. She plays the game hard, she plays the game tough.\" Meet the teen who was only girl, and a co-captain, on her football team: @webpagelink"},{"comment_id":"10156205227255354","commenter_b":"ALL yes ALL of them...with the illegals! !!!!!!","commenter_a":"I would support someone who wants to deport all Muslims.","post_message":"Guess what percentage said they would..."}]
