[{"comment_id":"10154399256191162","commenter_b":"@username you're an illegal immigrant you can't vote","commenter_a":"I bet she's a Trump supporter .Maybe that thin skinned racist will pay her legal fees .","post_message":"Woman from Humboldt Park charged in Evanston Target bathroom explosion: @webpagelink"},{"comment_id":"10154266644379087","commenter_b":"@username news flash f*ck face, when he is in office in january, he will cut off 12 billion in aid to Mexico and hence they pay for the wall, stfu and deal with you LOST, LOST,LOST","commenter_a":"Not very Presidential attacking the Press that is protected by the 1st amendment. Can you imagine the Right Wing outcry if Obama had tweeted about the negative coverage he was receiving from Foxnews?","post_message":"Trump's tweet comes just days after telling \"60 Minutes\" he would be restrained on Twitter as president."},{"comment_id":"10153835564541002","commenter_b":"@username, LEAVE then!","commenter_a":"What happen to \"Land of the free\" ?","post_message":"President Barack Obama suggested maybe it's time to make voting a requirement.  Share your thoughts on this idea -- good idea or bad idea?"},{"comment_id":"10153667597986770","commenter_b":"She belongs in prison!","commenter_a":"Prison","post_message":"Hillary Clinton thinks she should be president. But does she really belong in prison? @webpagelink"},{"comment_id":"10153442882309087","commenter_b":"@username No Edna is the one with the brains, you however should go get and education and then come back to the table. Nevermind don't bring that stupidity back, you may let the men in your family rule your body but they definitely will not rule mine. Whether you like it or not abortion is legal in this country ..... why would any self respecting woman let any GOP teabagger try and rule their bodies....,.I just don't get it and never will. If you won't vote for the women in your lives I certainly will !!","commenter_a":"Obama is ISIS! That's why he didn't cry before!","post_message":"“I was affected by [President Obama crying during Monday's gun control speech] but I thought we should’ve had the same kind of reaction when James Foley was beheaded, when San Bernardino and Paris occurred,\" Speaker Paul Ryan said. \"That’s the kind of reaction I had when those occurred.”"},{"comment_id":"10154264763012452","commenter_b":"You aren't immigrants, you're illegal aliens. What idiot feed you the line you belong here? Oh yeah, ofailma and Jerry Brown. Remember, when you break into my house, it doesn't make you part of the family it will make you leave on a stretcher.","commenter_a":"And no one missed any of them 😂","post_message":"Immigrants skipped out of shopping and stayed home from work and school as part of \"A Day Without Immigrants\" protests that happened across the nation.  Businesses in Los Angeles closed in support of the protests, which were a response to President Donald Trump's immigration agenda."},{"comment_id":"672161809583667","commenter_b":"This gal is a piece of .......","commenter_a":"Nothing quick about judging this one. It's been years in the coming","post_message":"I'm sorry....I'm not a fan."}]
