[{"comment_id":"1675805602436783","commenter_b":"Wicked prick!","commenter_a":"That is what happens when you try to work \"across the aisle\" with a group of people that have no desire to work with you.","post_message":""},{"comment_id":"10153310022881051","commenter_b":"Why is this vermin still alive?","commenter_a":"Blow him off the face of this Gods earth!","post_message":"Al Qaeda's leader just called for a 'lone wolf' terror attack on the United States - and that's not even the worst thing he said. (via VICE News)"},{"comment_id":"1100928479922812","commenter_b":"Do you even beleive in smart women?","commenter_a":"Maybe compared to all the stupid people who support them they seem smart. The one eyed man is king in the land of the blind !","post_message":"I am not one of these people that thinks Hillary Clinton is The Smartest Woman in the World.  I don't think Elizabeth Warren's The Smartest Woman in the World.  What happens here is that whatever liberal female rises to prominence, it's just standard operating procedure that the media and everybody's gonna refer to them as The Smartest Woman in the World."},{"comment_id":"10153569375843203","commenter_b":"Unless Rosie O'Donnell is raping you, she isn't forcing herself on you. I know many gays and I must be lucky to have escaped their revenge and then forcing their lifestyles on me since I'm still straight. Rosie O'Donnell is and always will be a loudmouth and a celebrity. Don't like it? Don't watch her.","commenter_a":"..Many of them are miserable, intolerant people hellbent on revenge ,forcing their lifestyles on others, and making everyone else miserable also.....Example : Rosie O'Donnell - one of the most miserable, intolerant people forcing herself onto the public...","post_message":"Study finds homosexuals less healthy, happy than heterosexuals    @webpagelink"},{"comment_id":"1424826404224494","commenter_b":"Evil creeps just like their daddy.","commenter_a":"Assholes someone needs to hunt them down !!","post_message":"Madonna just called out Donald Trump’s privileged sons and it’s EPIC."},{"comment_id":"1641330872574045","commenter_b":"His payment for the presidency","commenter_a":"I just love hearing you babies cry. 8 years of total bullshit from your man Obama, and we never rioted, burned down neighborhoods, dressed up as vaginas and marched (like a bunch of embarassing idiots), destroy businesses, drag old men out of their cars to beat the shit out of them for an Obama sticker, and the list of shame goes on. Trump hasn't been president for 90 damn days and you crybabies are already curled up in the fetal position, sucking your thumbs, squealing and kicking like little piglets. You guys make me smile real big. You're the biggest pile of disrespectful pussies on the planet! Suck it up buttercups, TRUMP IS YOUR PRESIDENT! AND GOD BLESS DONALD TRUMP!","post_message":"This isn't a joke."},{"comment_id":"443733605833672","commenter_b":"Mr. Trump, Your idea of building a wall to slow / prevent illegal immigration is far too narrowly focused. Here is what I think a solution to the problem could be. No matter where the immigrate is coming from. Though not my original idea it is a workable one - All immigrate males between 18 & 50 to be immediately inducted into the military to receive basic training, After completion, sent back to their country of origin, then given their weapons and told to defend and reclaim their own country. After they accomplish that we send them their families because they would have no excuses to come here. If they refuse to do this then they and their families can find another country that will take them because they would never make an AMERICAN anyway. We should not have to send OUR military to their country to fight and die ...","commenter_a":"We don't need 1,400 years of cosanguineous brain damage. We have enough of our own in the Republican Party.","post_message":"Our country is in trouble. We’re going to stop people from coming into our country illegally. #GOPDebate"}]
