[{"comment_id":"10154148707777994","commenter_b":"I'm more scared of a white maniac than some isis rag head sitting in a cave.","commenter_a":"They did it in response to capturing the guy behind the Paris attacks. You have to hunt them down and destroy them ruthlessly and make them fear you otherwise they will continue","post_message":"Here are some photos from the scene in #Brussels. The latest -- at least 26 people have been reported dead in the blasts. Dozens of others have been injured. Continue reading about what happened here: @webpagelink"},{"comment_id":"1110789318977717","commenter_b":"Why didn't this administration just tell the truth in the first place. If the President or Hillary would from the beginning, just tell the People the truth, that they screwed up. Most Americans will probably forgive, (But not forget) But Now we have to spend time and millions of dollars to do an investigation Same goes for President Clinton, just admit you got a blow job in the oval office and the American people would of probably forgave you. Nixon same thing, why can't they just do the right thing and tell the truth from the beginning. Friggin Politicians, I'm so sick of being lied to.","commenter_a":"I used to have hope that you were going to get the job done, @username but after all this time, I have lost faith in you and your committee. I think you are now part of the cover-up and just playing along to make it look like something is being done.","post_message":"It is deplorable that it took over a year for these records to be produced to our committee, and that our Democrat colleagues never lifted a finger to help us get them. Shame on them and everyone else who has demanded this committee to give up before gathering all of the facts. This investigation is about a terrorist attack that killed four Americans, and it could have been completed a lot sooner if the administration had not delayed and delayed and delayed at every turn. For example, the #Benghazi committee still does not have records we requested over a year ago, and we are still waiting for some witnesses to be made available for interviews. As soon as possible, we will release our report and interview transcripts so everyone can see the evidence for themselves, and I’m confident the value and fairness of our investigation will then be abundantly clear to everyone."},{"comment_id":"10153770178735736","commenter_b":"Hillary is Hillary, not Bill. Duh!","commenter_a":"She should resign.","post_message":" Trump comments in 2005  11 years ago were made when he was a Democrat. The hypocrisy of Hillary Clinton to say Trump does not belong in the White House when her husband defined this behavior."},{"comment_id":"463096490547598","commenter_b":"Yes","commenter_a":"yes, yes","post_message":"Should This Family Be Taken Off Welfare?  Comment 'yes' or 'no'."},{"comment_id":"918090094974937","commenter_b":"Unless you make over 12 million dollars a year then you'll probably get a big tax break and a yearly stimulus for being a small business","commenter_a":"I'm a proud Tennessee woman, I've never been disappointed in my beautiful state, today is the first. Trump is not for the people. #FeelTheBern","post_message":"Thank you Tennessee! #Trump2016 #SuperTuesday"},{"comment_id":"10152926851271336","commenter_b":"My God leave the Good Doctor alone. Don't see you going after those that treat patients in their mammogram buses and doing blood and plasma draws that happen to be far more dangerous. Give the guy a break. He is licensed to practice in that state, the entire state. Can you blame the Dr. after what Obamacare has done to folks. Jesus Lord...go after POTUS for putting people in this position in the first place, without healthcare, sucking what was left of Medicare that the elderly needed and driving up healthcare coverage so govt gets a buck.","commenter_a":"Need more like him and fewer like Obama.","post_message":"Mississippi health officials are threatening to revoke the medical license of an 88-year-old doctor because he treats patients out of his Toyota Camry. Dr. Carrol Landrum says his patients are too poor to travel to him, so he goes them."},{"comment_id":"1247078658692220","commenter_b":"Bitch no it ain't, ole flat volleyball shaped head ass","commenter_a":"John H. Gonzales III this is @username hair style rn","post_message":"He needs a fitted cap asap!  #WSHH #Haircut"}]
