[{"comment_id":"10157076549400354","commenter_b":"Does the rules say you can steal another candidates votes like he did with Ben Carson?","commenter_a":"Cruz is playing by the rules...PERIOD. Elections have been done this way your entire life. There is nothing different from other elections, with the exception of a whiny, sniveling, jealous loudmouth. Too bad Trump hasn't been paying attention to the rules.","post_message":"\"Ted Cruz has no chance of winning this without bribing the delegates. That’s his game at this point. He’s mathematically eliminated....\"  WATCH:"},{"comment_id":"10153724329286336","commenter_b":"How about all countries fight isis and then the refugees CAN STAY HOME !","commenter_a":"The last time Russia was in the battle with the Muslim''''''''''''''''s they lost. They run back home and was broke after a decade. I say let them do it again while we rebuild our defense up again.","post_message":"\"If he wants to fight ISIS, let him fight ISIS – why do we always have to do everything?\"  Donald J. Trump told Bill O'Reilly that the U.S. has invested trillions of dollars and thousands of American lives in the Middle East, and he thinks it’s great that Vladimir Putin wants to take over what America has started. @webpagelink"},{"comment_id":"1692723517682991","commenter_b":"One of you crazy ladies is from Texas.","commenter_a":"Realism is not what I see coming from most of HRC's supporters. There are some extremely hard to admit, and in fact, frightening facts that I think we have all tried to glaze over for years. In Bernie Sanders we have got a candidate that is addressing those facts. Climate Change is real, most democrats are no longer climate change deniers, but I feel like the real threats are being overlooked. For example, droughts are happening all over the United States. We are quickly depleting our fresh water aquifers. When one factors Fracking into this, we are willfully allowing our government to destroy more of our fresh water systems. HRC cannot denounce Fracking. Now, before you think that article that spells out how much HRC is taking in campaign contributions from the fossil fuel industry is another Republican smear tactic, note that it is by Greenpeace. She has to go. ...","post_message":"\"We can open the door to every person in this country again.\" —President Bill Clinton"},{"comment_id":"1070107396359933","commenter_b":"She would have to drug me like Bill Cosby does his women","commenter_a":"This gal needs to get laid.","post_message":"“Her conduct and behavior are appalling, and I am not only disappointed, I am angry, that a member of our faculty acted this way.\""},{"comment_id":"1886511228246156","commenter_b":"Illegal aliens.","commenter_a":"What your liberal brains are to small to realize is there is no defending illegal immigrants. They have no right to a trial. They have no right to a defense. They are automatically guilty and only entitled to deportation. If you want to be American there is a legal way. It is not easy nor will it be quick. But if you are willing to do it the legal way then you get to become an American and stay without fear of deportation.","post_message":"Janet Napolitano says the University of California will vigorously protect illegal immigrants."},{"comment_id":"10153551927158352","commenter_b":"Kill this bitch","commenter_a":"An eye for an eye!!! Babies are innocent little gifts from God!!!!! There are no excuses!! I have no pity for her!!! She will answer for it!!!!","post_message":"Woman, 22, gave birth in tub in secret then dumped her baby in trash compactor – and was only caught because nosy janitor opened suspicious box"},{"comment_id":"10153689211286438","commenter_b":"Are uggos ugly women who like to hire pretty secretaries for pay raise kitty chow.","commenter_a":"Lesbians can rape just as easily as men.","post_message":"It’s time to stop pretending that only men perpetuate violence and women are only victims of it."}]
