[{"comment_id":"712967945491547","commenter_b":"Gals, you are missing the point.The birds ARE god","commenter_a":"Tom Beyer","post_message":"One of the prettiest scenes we've ever seen: A flock of starlings form spectacular flyover in Israel's sky (Video: Reuters)"},{"comment_id":"1198210753566421","commenter_b":"She's a hack","commenter_a":"This isn't right. What is wrong with her?","post_message":"CNN HOST To Jill Stein: \"Have You Seen Any Direct Evidence That Anyone Hacked The Voting Systems In MI, WI And PA?\"...\"Um...no\" [VIDEO]   And then there's that whole issue with one of the states that only uses paper ballots...."},{"comment_id":"558942897646607","commenter_b":"If killery wins we WILL NOT HAVE A COUNTRY! !! ...NWO...WILL SUCK!!!!","commenter_a":"@username, Hermain Cain is a staunch supporter of the Second Amendment!","post_message":"Live Now: Donald J. Trump's running mate Mike Pence addresses supporters at a rally in Atlanta, Georgia."},{"comment_id":"1056816484380468","commenter_b":"Islam, by law, is prohibited from US immigration The Immigration and Nationality Act passed June 27, 1952 revised the laws relating to immigration, naturalization, and nationality for the United States. That act, which became Public Law 414, established both the law and the intent of Congress regarding the immigration of Aliens to the US and remains in effect today. Among the many issues it covers, one in particular, found in Chapter 2 ACT 212, is the prohibition of entry to the US if the Alien belongs to an organization seeking to overthrow the government of the United States by \"force, violence, or other unconstitutional means.\" This, by its very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House.Islamic immigration to the US would be prohibited under this law because the Koran, Sharia Law and the Hadith all require complete submission ...","commenter_a":"Don't waste tax dollars with a trial, start setting an example of what happens to terrorest who murder.","post_message":"BREAKING: Muslim Teen Refugee Charged With MURDER For Beating 97-Yr-Old WWII Veteran To Death  These refugees can not be trusted with freedom... give an inch they take a mile.   Http://woundedamericanwarrior.com/breaking-muslim-teen-refugee-charged-with-murder-for-beating-97-yr-old-wwii-veteran-to-death/"},{"comment_id":"10154898999434705","commenter_b":"Michael MacLeod are you kidding? Who says they are not. They have the most amount of refugees.","commenter_a":"Snowflakes and Hollywood dummies....read the executive order....no mention of Muslims any where. Still trying to figure out how so many of you could support muslims...they have no respect for women, queers, children, Christians and idiots like you.","post_message":"Helberg and wife Jocelyn Towne sent a clear message to Donald J. Trump."},{"comment_id":"10154048575244456","commenter_b":"Joke","commenter_a":"Prayers for Gunn's mom and prayers for Officer Smith. I pray that the whole truth be revealed and this young man will be safe.","post_message":"\"MPD supports their men and women in blue. #it'sok2hitthelikebutton,\" the post on a MPD Facebook page stated.  Here's what we learned today:"},{"comment_id":"1602419506718167","commenter_b":"Ah yes blame everything on women. Typical","commenter_a":"Maybe because women control everything and dont put out these days unless you're a fucking broke ass bum loser with no future","post_message":"So higher house prices, higher tax, higher tuition AND less sex??"}]
