[{"comment_id":"10150859556744999","commenter_b":"Did she calll Monica Lewinsky ? It is only a mediocre actress and above is false as it was her husband","commenter_a":"Only in America is it possible that the president of the state --otac son candidate second son, husband and wife ..","post_message":"President Barack Obama: “We’re going to carry Hillary to victory this fall, because that’s what the moment demands.”  More photos: @webpagelink  Photo: Doug Mills/The New York Times"},{"comment_id":"10153607644803984","commenter_b":"Vote all those dirt bag's out we need people with balls not vagina2","commenter_a":"Now how does everyone feel about this 'War Hero'?","post_message":"BREAKING: John McCain's secret move against arming our troops here at home just got exposed, and what he did is absolutely sickening.  McCain hoped this would never come out, but we're not going to let him get away with this.  If you want to hold McCain accountable for his deplorable actions that endangered our innocent troops, be sure to share this article."},{"comment_id":"902522343195539","commenter_b":"Smart pooch 😂😂😂","commenter_a":"Krissy Maree","post_message":"This Great Dane's having a Great Time on a trampoline.  Video: Jukin Media"},{"comment_id":"10153663594614160","commenter_b":"You've Been Blamed because you brought us down to our Knees but we'll fix it all under Trump and wipe away ALL traces of your rotten deeds against our Beloved America--now go kiss some more Muslim butt and bring in more Illegals you only have 7months left ---","commenter_a":"Of course he is trying to deflect blame.","post_message":"\"I have been blamed by Republicans for a lot of things\""},{"comment_id":"10153869731497042","commenter_b":"These animals with guns","commenter_a":"This this is an open and closed case? And the guy is just lucky that he wrestled the gun from his father, and killed him, before his father could kill him first? Or maybe, just maybe, he was the shooter, and he is just telling police a story. Just sounds a little fishy, don't you think?","post_message":"QUADRUPLE FATAL SHOOTING: Police are investigating after they received a call from a man saying he killed his father — but only after the father allegedly shot and killed his bedridden mother, girlfriend and friend at a home in Rowland Heights, California."},{"comment_id":"966202806772801","commenter_b":"#dumbasses","commenter_a":"Robbie Raul Markosyan","post_message":"Kate Upton among scores taking part in #HoldACokeWithYourBoobsChallenge for breast cancer... unaware the trend ISN'T raising money"},{"comment_id":"10154608447428690","commenter_b":"@username - Did I hurt your feelings? While you're defending her she's planning on how she'll enjoy all her wealth somewhere in the world while you'll be paying taxes up the wonker. It's called Sod's law.","commenter_a":"She is every color on the a--hole rainbow.","post_message":"\"I am innocent, I am an honest person and I have never committed a crime.\" @webpagelink"}]
