[{"comment_id":"416896861831941","commenter_b":"I do not think Hillary will win (fairly anyway).","commenter_a":"The even bigger issue is that 46% of people still think he's a good president.","post_message":"I am ONE of them...do you?"},{"comment_id":"1169322949765857","commenter_b":"I understand that the left hates and has an unnatural desire to control everyone around them. It's just what they do; and it's the reason they should never be allowed to hold any position of power. To hate for no good reason is insane. Obviously none of the people here who hate Trump have no idea WHY they hate him except maybe that they were manipulated to do so. You don't have to like him; you're not hiring someone to be your friend (although that might be the only way you can get friends); you're hiring a POTUS so vote with honest logic. Not feelings.","commenter_a":"There's no denying the fact that he's more wealthy than even the elitists in Washington can hope to be; AND it's obvious that if you're that wealthy; the IRS has already seen your taxes so there's nothing hidden about his returns except just like yours; they're not PUBLIC knowledge. The only ones who want to make a big deal about them are the people who are scraping the bottom of the barrel trying to find something they can twist into a questionable issue that the most ignorant of voter will be swayed with.","post_message":"“There’s nothing to learn from them,” said Donald J. Trump."},{"comment_id":"507737642755232","commenter_b":"Hillary has a list of wars that she provoked go take care of your wives, she be to dangerous for you, she be a backstabbing. Learn to read.","commenter_a":"This man trump will be too dangerious for the oval office he will lead america to another third world war so to all you red necks supporting he's cause do the right thing before you unleash hell on earth","post_message":"Every day I wake up determined to deliver a better life for the people all across this nation that have been ignored, neglected and abandoned. -DJT"},{"comment_id":"1057273917621602","commenter_b":"No lol","commenter_a":"One world order ?","post_message":"You can't possibly understand America's greatness if you look at this country as nothing more than a series of grievances that need to be addressed.  You can't see greatness at the same time you see that."},{"comment_id":"10153632198263908","commenter_b":"These girls suck. There's no way around it.","commenter_a":"So enlightened yet judging girls because they take a selfie..","post_message":""},{"comment_id":"10155034112494445","commenter_b":"She's nervous he may grab her by the pussy!!!","commenter_a":"She looks nervous as would I this has been a big day for them, STOP THE HATE, she is a beautiful woman... let's be real how would you be if the entire world was watching you!?","post_message":"President Donald Trump and First Lady Melania Trump share their first dance as the First Couple.  @webpagelink"},{"comment_id":"924477534340446","commenter_b":"@username your mother should have swallowed","commenter_a":"If she really wants to make America whole again, she should do the right thing, and GTFO of politics altogether. It's a start at least.","post_message":"Do you agree with Hillary Clinton? #SCPrimary"}]
