[{"comment_id":"10155065453241323","commenter_b":"You still refuse to answer the question.","commenter_a":"An admirable academic for sure . But; one line in the video had me chuckling \"And then population growth will stop\". Naive to think population growth will ever stop. Deluded dreamy lefty thinking.","post_message":"\"Let me show you the world\", said Swedish academic Hans Rosling, who has died aged 68.   Here he demonstrates the dynamics of population growth, child mortality and carbon dioxide emissions. The challenge for the world is to get everyone out of extreme poverty and get the richest people to use less fossil fuels, he said."},{"comment_id":"804744199625733","commenter_b":"The Progressive white wash is to say \"America did this\" No You Progressives did this!!!","commenter_a":"BOOM!!!!","post_message":"Watch me take down Cenk Uygur from The Young Turks LIVE at Politicon! Cenk should be a little less smug after this debate. #Politicon2016  Learn more about Hillary's America, in theaters on July 22: hillarysamericathemovie.com."},{"comment_id":"10153294608621051","commenter_b":"There are bad waitresses too!! I don't treat one bad because another was bad!!","commenter_a":"All human life is sacred. But I work at a restaurant down the street from the county sheriff's department, and the boys in blue that come in are often disrespectful and rude, and act entitled to walk all over us because they're cops. They once refused to leave after we closed, even though they were done eating. I'll start respecting the blue more when the good ones start publicly, and loudly denouncing the ones who aren't.","post_message":"This officer had just finished a nice meal and was preparing to pay his bill when he noticed something written on the receipt."},{"comment_id":"10154045995555329","commenter_b":"@username No Danie, they're too scared to do anything because FEMINISTS THREATEN TO KILL THEM.","commenter_a":"As a man who would literally NEVER talk to a woman like this, I'm ashamed and embarrassed that men actually do. Makes me sick. I was always taught to treat women with respect. Guess that doesn't apply to my fellow man...","post_message":"ICYMI"},{"comment_id":"10154121579688132","commenter_b":"Kendra Hill Graham..she was crazy like a fox and a filthy pig to boot!","commenter_a":"Wow! Mental illness is real. She is disgusting! May God bless the children involved.","post_message":"Police officials are calling it \"one of the worst neglect cases\" they seen in Concord, California."},{"comment_id":"10153475535382894","commenter_b":"She is the epitome of dumb!","commenter_a":"Kids are getting arrested for sexting, why is this not considered pornography and why isn't she being arrested.","post_message":"Kim Kardashian Pens Essay on Empowerment After Nude Selfie Backlash: ‘I Will Not Live My Life Dictated by the Issues You Have With My Sexuality’"},{"comment_id":"810146635842580","commenter_b":"Aye.","commenter_a":"now they need to lock him and the rest that have been letting him get away with everything.","post_message":"Supreme Court Strikes Down Obama's Executive Immigration Order  This is huge. Finally the Supreme Court does something right.  Do stand behind their decision?"}]
