[{"comment_id":"1247572008614366","commenter_b":"Her pants should have caught fire. She needs a choke collar.","commenter_a":"Yes","post_message":"Surprised? Neither are we."},{"comment_id":"10153470437544726","commenter_b":"Send her ass packing!!!!!!","commenter_a":"She's from florida and hates america. Go away!","post_message":"WATCH: Ariana Grande: 'I Hate America, I Hate Americans'"},{"comment_id":"10152884101260950","commenter_b":"Day. I love all animals.....and the nice part is.....nobody can stop me.","commenter_a":"Burn her ass. Grrrrrr. My compassion for animals is soooo much stronger than it is for humans.....karmas a bitch","post_message":"The woman allegedly set a terrier mix named Brownie on fire; the dog's burns were so bad, he had to be euthanized."},{"comment_id":"10153628847251336","commenter_b":"Shes so nasty","commenter_a":"She is a disgusting person trash","post_message":"What did you think of Miley Cyrus' barely-there ensemble?"},{"comment_id":"10153474188676350","commenter_b":"But they can't make babies it takes a man and a woman to have s baby","commenter_a":"So wrong","post_message":"#BREAKING: Supreme Court makes same-sex marriage legal nationwide in landmark decision."},{"comment_id":"1385834498103243","commenter_b":"Lmao!!!! BUSTED!!!","commenter_a":"TRUMP 2016. Only liberals make excuses for crime. You do the crime you do the time cause its that simple. Trumps the man thats gonna bring back real punishments for all these thugs than thinks they can mess with other folks belongings. Trumps the man thats gonna bring back real law n order and get our country built back up.","post_message":"The West, Texas, fertilizer plant blast killed 15 people and injured 160 others."},{"comment_id":"10154536419509087","commenter_b":"Jolie should worry about fixing her house first..","commenter_a":"Some day in history Freedom of Religion will meet the crossroads. How will America defend itself from enacting Shari Law?","post_message":"“Shutting our door to refugees or discriminating among them is not our way, and does not make us safer,\" Angelina Jolie said. “Acting out of fear is not our way. Targeting the weakest does not show strength.\""}]
