[{"comment_id":"679238678931090","commenter_b":"I have been drinking Pepsi since 1966! I will NEVER BUY IT AGAIN, not because of what she said , but because TRUMP HAS SAID FROM THE BEGINNING , This country has sold out to foreign countries that hate us AND PEPSI HAS THIS WOMAN IN CHARGE OF AN AMERICAN COMPANY!!","commenter_a":"When will they ever learn.. Boycotts work..","post_message":"INSTANT JUSTICE... Let's get 5,000 SHARES for TRUMP!"},{"comment_id":"10153114585296130","commenter_b":"but feminism isn't about equality or justice.. it is about hatred for males and the destruction of the family..","commenter_a":"a male feminist.. wouldn't that be a bitch boy?","post_message":"Mark Ruffalo takes the (feminist) cake."},{"comment_id":"530286710492597","commenter_b":"When are we going to smarten up and deport Muslims and ban Islam once and for all.","commenter_a":"The Quran says it's ok to lie to the infidels . Can't believe anything they say","post_message":"\"How would you stand before God and answer to your crimes against… thousands of innocent people – Muslims, Christians and other minorities? You do not speak for us. You do not represent us. You are an aberration. You are an outlaw.\"  The CAIR  national director condemned ISIS and their supporters in the wake of the #OrlandoShooting."},{"comment_id":"10153387140986323","commenter_b":"How did the chicken cross the road? Roads, where we're going we don't need roads.","commenter_a":"Go Peter Rabbit!! (Y)","post_message":"Is this rabbit really scurrying across an avalanche?"},{"comment_id":"10154614899766729","commenter_b":"The woman is already bought and paid for, she is an insult to any decent woman!","commenter_a":"Bitch please!!!!!!!","post_message":"Where is the mainstream media on this? Complete silence..."},{"comment_id":"549294818565391","commenter_b":"Its not a womans choice to kill an unborn child if you dont want a child dont have sex its that simple","commenter_a":"It's each woman's choice.","post_message":"Today marks the 43rd anniversary of the Supreme Court's decision in Roe v. Wade. On this somber day, I know it's difficult not to be discouraged that the Supreme Court's decision in Roe still stands. But now is not the time to give up. We must work together to continue promoting a culture of life in Arkansas and America. Read more:"},{"comment_id":"1180631801992422","commenter_b":"THE wall is necessary","commenter_a":"Hell no!!! I don't want to see a big freakin wall between my state (Texas) and Mexico (with whom we've been friendly for a LONG time). Way to go, Trump...maybe you can start a war with Mexico 😠 Brilliant!","post_message":"Agree or disagree: It's time to build Trump's wall at the border."}]
