[{"comment_id":"375119059510655","commenter_b":"This woman is very wicked. You can see the evil spirit in her face. She is a demon from \"hell\"!","commenter_a":"Worst people you can meet in your life are LIARS! This administration is full of them!😏","post_message":"CNN has HAD it with Conway and her lies."},{"comment_id":"870392283014938","commenter_b":"Just deport them","commenter_a":"Let them starve","post_message":"ILLEGAL ALIEN CRIMINALS ON HUNGER STRIKE IN AZ PRISON Give List Of Demands Including Removal Of Threat Of Deportation"},{"comment_id":"10153598049151336","commenter_b":"Kill her","commenter_a":"Molly, America loves you.","post_message":"Former Baltimore Ravens cheerleader Molly Shattuck was sentenced to two years of probation after pleading guilty to raping a 15-year-old boy at a vacation rental home in Delaware."},{"comment_id":"10155247808221729","commenter_b":"Jill stein was just in it for the money! She pulled one over on her own people.","commenter_a":"When will these #NOTMYPRESIDENT jerks learn. Get over it. If Hillary would've won we would be over it and preparing for all the bad she'd unleash on the USA!","post_message":"EPIC FAIL."},{"comment_id":"10153188549718812","commenter_b":"Why don't they beat men cuz the guy cant","commenter_a":"Good","post_message":"JUST IN: NASCAR says driver Kurt Busch has been suspended indefinitely: @webpagelink"},{"comment_id":"10153169789203855","commenter_b":"She's a self-hating traitor.","commenter_a":"I thought Caitlyn was a Republican -- not at all a liberal. I'm sure I read that. Maybe Rush thinks party change is part of gender reassignment.","post_message":"A hateful man."},{"comment_id":"1528246223862069","commenter_b":"@username Pink pussy bow","commenter_a":"I am so glad that someone finally said all of those things directly to her smug, lying, corrupt, evil face!!!! That was awesome! All of us \"deplorables\" wish we could have the opportunity to do exactly the same thing!","post_message":"A notable percentage of voters changed their mind on Trump's attitudes toward women after the latest scandal."}]
