[{"comment_id":"10152845458146336","commenter_b":"you must be of yourr meds you moronic female","commenter_a":"A million and a half babies aborted each year in the United States and we are horrified by this?","post_message":"Zookeepers were horrified to discover 5-week-old cubs had been killed and eaten by their mother."},{"comment_id":"10156563653020652","commenter_b":"Man, my dog is always happy. I learn from my dog, so now I am always happy. “We understand how dangerous a mask can be. We all become what we pretend to be.” ― Patrick Rothfuss,","commenter_a":"@username - gedink jy sal ook hierdie interessant vind :)","post_message":"What can we learn from how animals cope?"},{"comment_id":"555875991245538","commenter_b":"Finally a person with some brains","commenter_a":"We should not have even been considering it in the first place. When other muslim nations refuse to take refugees because of the fears of terrorism, why should we take the risk? There's lots of room at the White House- let them stay there.","post_message":"Official Statement from Dr.Ben Carson:  Today, I am asking Congress to stop the Obama Administration’s plans to bring in up to 45,000 Syrian refugees. There is currently no ability to vet these people.  By letting refugees into our country without vetting we are putting America at risk. If our President cannot see the risk, then we must rise to the challenge and protect our country. This morning President Obama announced at his press conference that it was our responsibility to accept these refugees. He is wrong. He took an oath to protect and defend this country. There is simply not a way to vet these refugees.   We should do everything in our power to help these men, women, and children who have been forced to flee their country, but until we can sort out the bad guys, we must not be foolish. I call for increased aid to the refugees. We can and should do more to feed the hungry and shelter the homeless. We must also protect them from being attacked by implementing immediately no fly zone over these camps.  President Obama said this morning that it would be a mistake to send more ground troops. I think plenty of mistakes have already been made. As President, I would give the mission to the Pentagon, and ask them what they need to accomplish the mission. The right number of boots on the ground is whatever number the Pentagon says they need to accomplish that mission and not a single person less. The error of armchair quarterbacking our military will end in my administration. They will get the support they need and nothing less. Both the FBI and former Intelligence Committee Chairman, Mike Rogers, have indicated that it is not possible to fully vet these refugees as there is no Syrian list to vet against. Allowing these refugees to enter our country without knowing who they are is foolish. I am talking to many experts as I can, and I have yet to find one who thinks that the Obama Syrian/ISIL strategy is anything but a failure. The only thing that President Obama seems to have contained is this foolish policy inside his government.   We need to offer more than empty tough talk. We need to say what we mean, and most importantly mean what we say. When we draw a line in the sand or boundary in the air, the world needs to understand that we mean it. Too many people across the world today think that we don’t."},{"comment_id":"10155124264189679","commenter_b":"Lock this old hag up....","commenter_a":"No No No","post_message":"LIKE to support, comment to discuss."},{"comment_id":"10152879286473961","commenter_b":"Only ridiculous and delusional if you think like a liberal Democrat.","commenter_a":"We've had 6 years of progressive liberal foreign policy. It can be summed up as alienate our allies, embolden our enemies, abandon our gains and weaken American prestige throughout the world. Obama has managed to squeeze this in between rounds of golf.","post_message":"It’s time for progressives to outline a coherent, proactive foreign policy vision. Check out my op-ed on Medium where I share my ideas and add yours at www.chanceforpeace.org."},{"comment_id":"10153611499316955","commenter_b":"Dumb broad should have to eat it herself before feeding the garbage to our kids.","commenter_a":"Good! If you eat what she eats you might end up looking like her!!!!!","post_message":"Students celebrate as school drops Michelle O lunch rules..."},{"comment_id":"10152729868175667","commenter_b":"Oh calm yer tits..it's just fun","commenter_a":"I may stop following USA Today because of this specific post. The guy isn't even old enough to run and you're reporting it like its important, which just means you made a joke out of yourself.","post_message":"President Flame would be a pretty epic name. Just saying."}]
