[{"comment_id":"852438651458224","commenter_b":"She's an idiot!","commenter_a":"AS. THE REAL Castro DID FOR THE USA. SEND THE BOAT PEOPLE. RETURN THE FAVOR. SEND OUR BOAT PEOPLE LET THEM SEE HOW THE REAL CUBANS ARRE BEING TREATED THE NUT. JOB IS TALKING. REVOLUTION.ARESST IT PUT IT IN JAIL. THE SCHOOL KNOWS ALL ABOUT HER AND DID NOTHING.INVESTGATE THE SCHOOL THEY HAVE MORE LIKE her","post_message":"Look kids, this is what #liberalism does to the brain!  Pray you're never on a plane with someone like this! You have to see it to believe it:"},{"comment_id":"1781336095483197","commenter_b":"She is so darn crooked!","commenter_a":"OMG!!! How terrible......the next thing you know he'll be selling uranium to the Russians, or discussing Top Secret programs on his personal e-mail...or selling influence to the moslems.....","post_message":"Trump has also praised Vladimir Putin, Kim Jong Un, and Benito Mussolini."},{"comment_id":"10153002903836323","commenter_b":"Aaaw u want him to suck your lil prick?","commenter_a":"Fuckin Jew cock sucker","post_message":"Rupert Murdoch has been strongly criticised after tweeting that “most Muslims” – even if peaceful – must be held responsible for the religion’s “growing jihadist cancer” in the wake of the terror attacks in France."},{"comment_id":"2071257249766331","commenter_b":"Only American enemies would want to remove it!","commenter_a":"Like","post_message":"There is no reason whatsoever that justifies removing this picture. Can we get 5,000 'LIKES' to keep it in the Museum?"},{"comment_id":"10154379213963812","commenter_b":"Go back to Europe. Lol","commenter_a":"Go TRUMP build the wal!! Deport illegal all of em Ban muslims Lets make america great again! !!","post_message":"Donald J. Trump announced on Good Morning America that he \"probably will take small contributions.\""},{"comment_id":"1071143486278732","commenter_b":"Good point kind sir haha","commenter_a":"Lmao Joshua this would be you...","post_message":"Husband practically demolishes house to build massive fish tank"},{"comment_id":"10153698610918132","commenter_b":"She is a jerk","commenter_a":"Yeah, God forbid anyone may ever be inconvenienced. Typical Americans -- it's all about ME ME ME. \"Oh my gawd! My dinner was ruined because a toddler was crying! I want my money back! Boo hoo!!!!\"","post_message":"Nope, not sorry."}]
