[{"comment_id":"10156224607550354","commenter_b":"Thought she was an illegal immigrant.","commenter_a":"Is it any surprise she is black","post_message":"The Obama Administration continues to deny the food stamp fraud crimewave exists.   Instead, it continues to balloon the already exploding program. Check out the numbers..."},{"comment_id":"238735813255041","commenter_b":"And to think....they probably had children","commenter_a":"When the defendants were acquitted and they were just sitting back in their chairs with cigars in their mouths and everyone was just congratulating them on beating the case they had no remorse for what they did and it's terrible how could you be ok with kidnapping a 14 year old and just dismantle his face and then dump his body in a swamp that was pure evil and hate they had in their souls to just do that to him it's sad.","post_message":"The story behind the photo that exposed racism in America and helped spark the Civil Rights Movement. @webpagelink"},{"comment_id":"10153503112318812","commenter_b":"Stephanie is a dumbass.","commenter_a":"STAGED!","post_message":"UPDATE: Dallas police: Sniper shot driver who opened fire on officers from armored van; unable to say whether he was killed: abcn.ws/1KNBxWA"},{"comment_id":"10153765573361336","commenter_b":"ISRAEL WAKE UP FOR EVER Israel must wake up, get up, 90% Arab are Terrorists !! ISRAEL Must Destroy your enemies, terrorists and traitors in your country and out, do not sleep, do not sleep !! Palestinians & Obama are the Biggest Lie in History ! Jerusalem Never mentioned in the Muslim Koran !! Jerusalem is written thousands of times in the Torah, Jewish Bible !!! No loyalty = no citizenship !!!! Israel You are Lucky !I the Arab leadership Started today to murder Jews.!! in 2020, then the Jews would have found sleeper, wake up ! Never were Palestinians ! tribals killers today call themselves Palestinians ! Different tribes of killers arrived in Israel since 85 years and they want a country !? Please Supreme Power Main, Creator of All the worlds & Souls, please GOD Bless the IDF and ISRAEL for Good. Destroy all the enemies of Israel ...","commenter_a":"It's absolutely BS that I had to go to Afghanistan twice in order to afford college. Making public higher education institutions tuition free isn't a bad idea at all. If we can pay for a war in Iraq then we can definitely pay for college. It's an investment in America. That's the first step on how you make America great again. #feelthebern #bernie2016","post_message":"President Barack Obama's message to U.S. troops in Afghanistan: \"I do not send you into harm’s way lightly… but as your commander in chief, I believe this mission is vital to our national security interests.\" @webpagelink"},{"comment_id":"895664467159698","commenter_b":"Elinor, cite your source. As recently as 2010, the Democrats made a former member of the KKK President pro Tempore of the Senate. Shawn, who these people may have voted for is irrelevant. A lot of Obama supporters are criminals. Does that mean they all are? Do you judge an entire group by the behavior of a few?","commenter_a":"I can explain it easily. THEY'RE NOT CONSERVATIVES!!! Liberals and conservatives aren't the only labels that exist to identify people. If you're claiming that they represent conservatives, you are at best, a cherry picker. But liar is the more appropriate label.","post_message":"Conservatives welcomed President Obama to Twitter in the only way they know how: By calling him a \"n*gger.\""},{"comment_id":"10156618428550354","commenter_b":"And why wouldn't he? His father and step father were Muslim...Is it beginning to make sense?","commenter_a":"They will have to air the whitehouse when they finally get because of the smell he will leave","post_message":"The worst terrorist attack in America since 9-11 and what does Obama do?"},{"comment_id":"10153632735051636","commenter_b":"@username typical this comes out after assignment submission","commenter_a":"Just wondering how many u turns this is now ?","post_message":"A good day to bury bad news"}]
