[{"comment_id":"10153882688775736","commenter_b":"Freedom of speech!!! Gotta love it!","commenter_a":"Performers are there to perform, and that's all we're paying for. I believe an audience member sharing their political views during a performance stands a good chance of being asked to leave. Why is it ok for them?","post_message":"A cast member responded to Trump's tweet, \"Conversation is not harassment sir. And I appreciate Mike Pence for stopping to listen.\""},{"comment_id":"1158653037490292","commenter_b":"HOW can he be such a hypocrite??? His companies ship jobs overseas, and he ships in illegals to work for cheap saying Americans won't do the jobs","commenter_a":"When his ties are made in China really dude???","post_message":"Donald J. Trump lamented Nabisco's decision to move jobs to Mexico, then pointed to Chris Christie: \"You're not eating Oreos anymore, are you?\" @webpagelink"},{"comment_id":"1383799158379801","commenter_b":"I hate that little bitch","commenter_a":"Omg I can't stand her, I saw her the first time (and the only time) on one American news network, I guess she's not on there anymore. Good, she's awful, she's uneducated, and that voice omg....id rather jam an ice pick in my temple than listen to her.....who decided she had a brain or talent was sorely mistaken......oy.......","post_message":"Your move, Tomi Lahren!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1071843699548997","commenter_b":"Lol stfu","commenter_a":"God Bless you Donald Jesus has CHOSEN you to lead our country !","post_message":""},{"comment_id":"10153394437991336","commenter_b":"Illegal aliens aint welcome to merica deport them back!!!","commenter_a":"Univision responds to Mexico or the US? These guys are wrong. AMERICA first! If you dont like it, go back.","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"1195742003797367","commenter_b":"Nothing, they won't do anything to her. She is above the law.","commenter_a":"What difference does it make? It's only the law for everyone else, well non-liberals anyway.","post_message":"This literally just happened, folks!"},{"comment_id":"697700797087165","commenter_b":"No refugees, there only intent to come here is to bring harm to us and destroy our country.","commenter_a":"Yes..... Take care of our own homeless people","post_message":"The refugee program has resulted in the death of two American soldiers. This is sickening. Should the US deny access to all refugees?"}]
