[{"comment_id":"10154998158283734","commenter_b":"She needs to be only allowed to Work at a Garbage Dump!! No Place else as long as she's alive!!","commenter_a":"She should get three to fives years of community service clean up","post_message":"According to police, the woman pictured below is accused of putting menstrual blood and saliva on a customer's burger."},{"comment_id":"10153005003572377","commenter_b":"Obama in the Alaskan wilderness? Ha, Grylls will be smothered by the Obama entourage!","commenter_a":"Guess I won't be watching that show any more unless. .......Obama doesn't make it!","post_message":"President Obama will soon be running wild Bear Grylls in the Alaskan wilderness."},{"comment_id":"10150722681504999","commenter_b":"@username It seems to me that you are the uneducated one, very stupid also!","commenter_a":"Bringing a knife to a gunfight, no sane individual would attack a police station full of armed police with a knife. Religion really plays no part in this. Surely the man needed mental health treatment?","post_message":"Officers fatally shot a man who was wielding a knife and yelling “Allahu akbar” as he tried to attack a police station in Paris on Thursday."},{"comment_id":"1843443299266966","commenter_b":"Yet recent college grads have to have 3-4 years of experience to get a damn job with their field. This lady is straight unqualified for this position.","commenter_a":"Handle ya bizness AL!!!! Yasssss!!!!","post_message":"Al Franken is stunned to learn that Betsy DeVos is unfamiliar with the difference between proficiency and growth."},{"comment_id":"10155080825746037","commenter_b":"Andrea ... it is scientific fact that bees couldn't fly without wings, but, pull the wings off of that bee and it is still a bee ! Semper Fi","commenter_a":"There is a scientific basis for being transgender. The brain's gender identity and the genitals develop at different times in utero. So mismatches due to hormones are possible. If God knits these children together in the womb, He must do some transgender knitting. A boy who goes through a phase of wearing a dress is entirely different than a boy who persistently and insistently over a number of years says he is really a girl. Psychologically, it is best for these kids to use modern medicine to enable their outsides to match their insides.","post_message":""},{"comment_id":"1861987967361615","commenter_b":"This woman is sick!","commenter_a":"PLEASE FRY THIS RAPPER!","post_message":"*** Sarah Palin is About to Teach Rapper Azaleia Banks the Lesson of a Lifetime ***"},{"comment_id":"10153066527856336","commenter_b":"Please woman go troll somewhere else","commenter_a":"Poor guy","post_message":"Bristol Palin is engaged to Medal of Honor recipient Dakota Meyer – the Kentucky native is credited with saving the lives of 36 Marines, Army soldiers and Afghan soldiers."}]
