[{"comment_id":"10153280384163812","commenter_b":"Stfu bitchass","commenter_a":"Time to eliminate this threat to life.","post_message":"He's back, but this time, instead of just going for a leisurely stroll, Goliath the massive alligator is spotted trying to eat an entire turtle on his Florida golf course: @webpagelink"},{"comment_id":"10153973009181409","commenter_b":"Considering Hillary shouldn't even be allowed to run she should be the one stepping down","commenter_a":"Then he should step down from running ... it's the right thing to do","post_message":""},{"comment_id":"1244573758893966","commenter_b":"I Absolutely agree! A party of the people. Even a small number of seats in the Senate will be very influential. This would apply to the House, state governors, all the way through to mayors and local city counsels are all controlled by big money politics. We must stop trans-national corporations, and their billionaire owners from sucking the life out of us! STop the vampire billionaires!","commenter_a":"There IS at least one viable and active third party, progressive and non-corporatist: The Green Party. but pundits don't like to acknowledge they exist. It's a weird denial-fetish.","post_message":"\"We need third parties in this country. And by that I don't mean another third party supported by billionaires, that centrist, you know, in the sort of Ross Perot manner. I mean parties that represent different opinions on the spectrum in the manner of the populist party in the 1890s which was really the last time we saw a third party movement, that contested the ballot from the bottom all the way to the top and they were a real political party.   Unfortunately the techniques that the populists used are against the law in most states. If we were to repeal those laws you might have a vibrant third party scene again.\" - Thomas Frank, author of the new book \"Listen Liberal\" in a 2012 conversation with Bill Moyers."},{"comment_id":"10152967093391051","commenter_b":"Your a heartless bitch","commenter_a":"Waaahhh","post_message":"Since school officials refuse to do anything about her bullies, this teen is now turning for help elsewhere."},{"comment_id":"1169322949765857","commenter_b":"I understand that the left hates and has an unnatural desire to control everyone around them. It's just what they do; and it's the reason they should never be allowed to hold any position of power. To hate for no good reason is insane. Obviously none of the people here who hate Trump have no idea WHY they hate him except maybe that they were manipulated to do so. You don't have to like him; you're not hiring someone to be your friend (although that might be the only way you can get friends); you're hiring a POTUS so vote with honest logic. Not feelings.","commenter_a":"There's no denying the fact that he's more wealthy than even the elitists in Washington can hope to be; AND it's obvious that if you're that wealthy; the IRS has already seen your taxes so there's nothing hidden about his returns except just like yours; they're not PUBLIC knowledge. The only ones who want to make a big deal about them are the people who are scraping the bottom of the barrel trying to find something they can twist into a questionable issue that the most ignorant of voter will be swayed with.","post_message":"“There’s nothing to learn from them,” said Donald J. Trump."},{"comment_id":"1353532451354276","commenter_b":"Said the blond headed, blue-eyed white woman.","commenter_a":"I am so sorry if this happens, your fear, only because your skin is darker than mine. But I kinda think all of this has happened to white skinned people as well. If we could all walk argh nd inside out we would see assholes right up and recognise good when we see it. Its not about race for everyone. Some of us see us all as people!!!","post_message":"This man shares his haunting testimony: He too is afraid of being killed by the police. (via KevOnStage)"},{"comment_id":"10154201657127541","commenter_b":"White terrorists","commenter_a":"When we figure out that words isn't going to change minds of white people best believe if they knew there would be retaliation then they will think twice.","post_message":"Because federal terrorism statutes almost exclusively focus on foreign extremists, he won't face terrorism charges, but he could face 10 years in prison."}]
