[{"comment_id":"432908550224359","commenter_b":"She is soooo very off base!!","commenter_a":"Trollette.","post_message":"This woman wants to be President. #NeverForget"},{"comment_id":"1095394503811232","commenter_b":"sounds racist to me. peggy pauley.","commenter_a":"I am so tired of people saying, we're going to take this country back, it's not been anywhere but here! Give it a break !!!!!!!!!!!","post_message":""},{"comment_id":"802416633249035","commenter_b":"Trump supporters do not listen to reason or facts.. Exhibit A above","commenter_a":"Shameful. Was it a DNC rally??All of those actors from other countries that she showcased... They are not illegal immigrants!!! There's is a huge difference.","post_message":"What did you think of Meryl Streep speech?"},{"comment_id":"10154498468358690","commenter_b":"Julia I was having discussion with other posters in the same tone.. You should be ashamed that you cannot tell the difference . Who do you think you are to tell others ? Get off my post ! Then hit the block button . Theres a good little troll.","commenter_a":"What nonsense. The trouble began when Islam became the majority religion. ISIL is just a mixture of many Islamic terrorist organizations. The mistake the US made was leaving all the weapons and armory behind thinking Iraq would use them to fight them , instead a lot of the Iraqi army used them against eachother.","post_message":"The Iraqi town of Saadiya's problems began after the 2003 US invasion."},{"comment_id":"10154243110114228","commenter_b":"I would of peed on that mf","commenter_a":"@username is it wrong that I laughed 😅😂😅😂","post_message":"Wait  it gets worse."},{"comment_id":"10152609113745950","commenter_b":"Those \"children\" walk around with ak-47's and would not hesitate to kill an American or any other national that isn't one of their own upon first sight. They are bred with hatred from birth. Sad to say they are already tainted. BOMB THEM ALL! What do you do when roaches run rampant in your house? You call an exterminator correct? Do you take the baby roaches into consideration simply because they're innocent? It's still a roach. BOMB THEM ALL!","commenter_a":"When we get a President with a backbone to go into these countries and bomb the hell out of them, we will continue with these problems....Clean house no matter if there are innocent people or not....Get the Job Done Now...","post_message":"According to a CIA insider, it would take 100,000 ground troops to effectively respond to ISIS."},{"comment_id":"899130260122396","commenter_b":"Eat what we or go back to your own country.","commenter_a":"Just go away.","post_message":"OUTRAGE"}]
