[{"comment_id":"949147745161454","commenter_b":"Nancy Pelosi said on the House floor that 30 million people were uninsured in the United States. After Bummercare, we were told that 40 million Americans were still uninsured. One year later, we were told that 55 million Americans were either uninsured for under insured. Islamic religion prohibits insurance because they claim it's gambling and are exempt from getting insurance. With the current influx of refugees and people sneaking into our country and getting free medical, welfare and food stamps, how many millions are now in this country unisured or under insured? Why would anyone bother to get insurance? Hospitals still take patients, doctors still see patients, and medicine is still sold at the pharmacies. If no one has insurance, costs will immediately be adjusted and negotiated at a lower cost. People will stop running to a doctor for every sniffle.","commenter_a":"amazed it lasted as long as it did, now the states are left holding the bag right along with those folks who tried to abide by that totally damaging obummercareless law.","post_message":"Oh Not Again! 400,000 Americans Enrolled In Obamacare Need To Find A New Plan"},{"comment_id":"490645967790363","commenter_b":"Trump thought better of it and he was invited in. Jorge Ramos is a U.S. Citizen, a gentleman and a great reporter for Univision. Shame on Trump!","commenter_a":"trump was right","post_message":"He just got SCHOOLED!"},{"comment_id":"10153437815231680","commenter_b":"She is worthless!!","commenter_a":"Hillary... Who DA feck Cares!!!","post_message":"Hillary Clinton: \"Well, as one of the more than 65 million Americans who voted to reelect Barack Obama, I’d say my voice is being ignored right now because of their obstructionism.\""},{"comment_id":"10153829312141162","commenter_b":"Yes. Don't trust females","commenter_a":"I hope he learned a valuable lesson from this experience.","post_message":"BREAKING: Patrick Kane will likely NOT face charges for an alleged rape this past summer, according to the Buffalo News: @webpagelink"},{"comment_id":"10152792831586130","commenter_b":"Nasty booby feeders??? Really thats ignorant! Howbabout you eat on a damn toilet and tell us how that goes","commenter_a":"Do that in private...how is that difficult?! Restrooms...everywhere!","post_message":"In a time when women are often shamed for nursing their children in public, it's good to know that one of the world's most influential leaders is in support of breastfeeding mothers."},{"comment_id":"10155114776336509","commenter_b":"Yes lets look at all those years Hillary has been in office but she doesn't handle classified information. So what does she do??? Trump has declared bankruptcy 7 times out of over 500 businesses. Pretty good success rate. I would like to see you try and run two businesses and see how you do. NEVER HILLARY!!!!!!","commenter_a":"Let's compare resumes, shall we? Hillary Clinton: 9 years, First Lady of Arkansas 8 years, First Lady of the United States 8 years, U.S. Senator 4 years, U.S. Secretary of State Donald Trump: At least 15 failed businesses Owns casinos that have filed for bankruptcy no less than 4 times 0 years in public service Now, if you were looking at those numbers, who would you hire? Who would you trust?","post_message":"While introducing Hillary Clinton at an appearance in Omaha, Nebraska, billionaire Warren Buffett challenged Donald J. Trump to release his tax returns: \"I'm under audit too. I would be delighted to meet him any place, any time. ... I'll bring my tax return, he can bring his tax return.\" @webpagelink"},{"comment_id":"544054039123949","commenter_b":"Drain the SWAMP","commenter_a":"President TRUMP 🇺🇸","post_message":"REPLAY: Republican presidential nominee Donald Trump at a rally in Tampa, Florida."}]
