[{"comment_id":"10153227457334170","commenter_b":"Rush says Ted Cruz is one of the most intelligent people he's ever talked with.thats good enough for me.so tell old has been Pete go jump and take all the other old pretenders with him.if we r only left with the tea party just think what we could do!!!","commenter_a":"Please do.","post_message":"Pete King says he may \"jump off a bridge\" if Ted Cruz is nominated...."},{"comment_id":"10153909569808717","commenter_b":"Horrible! That poor man and his patient! Dam it!!!! This IS disgusting!","commenter_a":"The cop should be fired and imprisoned","post_message":"The caretaker was trying to get his patient back to a facility from where he had wandered: @webpagelink"},{"comment_id":"10152829771848271","commenter_b":"But she's a good girl out to hurt no one. I call BS!","commenter_a":"For all you saying \"She didn't deserve to die.\" So it would have been better if the police office was killed!? Where are your morals people. But when that thug comes knocking on your door who are you calling?","post_message":"The Denver medical examiner's office said Jessica Hernandez also had marijuana and a small amount of alcohol in her system during the Jan. 26 shooting that sparked protests and calls for an outside investigation. DETAILS:"},{"comment_id":"849701391772757","commenter_b":"No more Somalis","commenter_a":"Part of barack islama's let everybody from any country come in when they want. No bg checks.","post_message":""},{"comment_id":"10154141723616509","commenter_b":"Just name a hotter chick","commenter_a":"Y'all tripping like Beyonce doesn't exist or something. Emilia is fine but sexiest woman alive?","post_message":"Who would you have picked? The Game of Thrones actress has been named  Esquire's \"Sexiest Woman Alive.\" @webpagelink"},{"comment_id":"10153580364618797","commenter_b":"Lol @username she's definitely stupid and disgusting. ..","commenter_a":"Nothing racist about my comment! i simply wouldn't have called anyone to help. Now be mad if you like so what because","post_message":"WOW! A police officer collapsed on the job. The teen in handcuffs whom he arrested was sitting right there.   What the teen did next saved the officer’s life. See here:"},{"comment_id":"1259466750760461","commenter_b":"@username=republitard shitbag","commenter_a":"Really? Last I checked, this is still Obama's America...... Next year you can call it Trump's but for now it's ALL Obama......","post_message":"Welcome to Donald Trump’s America."}]
