[{"comment_id":"10153722267976509","commenter_b":"The Duggars are not Christians. They are members of a sex cult","commenter_a":"Your son molested four of your children and you tried to keep it secret? Disgusting! I'm going to pray for you when I take my birth control.","post_message":"Four of the five girls #JoshDuggar molested were his sisters, their parents said in an interview with Fox News anchor Megyn Kelly. @webpagelink via CNNMoney"},{"comment_id":"10153365058753984","commenter_b":"Absolutely! They are bully cowards! It's going to be like exterminating roaches! We've let them go way too long!!!","commenter_a":"Yes","post_message":"This is scary. I pray America doesn't see further acts of terror from this group, but it sounds like these jihadists have something else in mind...  Would you support wiping out ISIS?"},{"comment_id":"10154425089776509","commenter_b":"Shut up you feminine POS","commenter_a":"Classic example of a Bernie supporter","post_message":"\"Bernie's like a kush, like the best kind of weed you can get,\" Tommy Chong said of Bernie Sanders."},{"comment_id":"1203426363052812","commenter_b":"@username AND SHE WANTS TO BRING THOUSANDS MORE INTO THIS COUNTRY' WAKE UP PEOPLE","commenter_a":"The cop should have called for backup and arrested the whole lot of them for inciting a riot. They should have been told it was none of their business what the woman was wearing. If they can't live by the laws of the countries they are in, they should be sent back home where their laws are enforced.","post_message":"WATCH This Muslim Scumbag Harass Women or Wearing Jeans Deemed too Tight By Islamic Standard! Then The POLICE Show up and teach him a lesson on Freedom! (VIDEO)  This is the problem with islam, they believe EVERYONE is subject to their bullsh*t!"},{"comment_id":"10155312985958132","commenter_b":"They are at 20.. they adopted a relatives child.","commenter_a":"@username are they your Laredo neighbors lol","post_message":"Jinger is the first member of the Duggar family to permanently relocate."},{"comment_id":"1372039169498167","commenter_b":"Illegal aliens out of my health care","commenter_a":"Politics is what got you your \"free\" healthcare. We the people are tired of being forced to pay for it, So please feel free to sit down and STFU.","post_message":"HERE IT IS!"},{"comment_id":"1131958793506245","commenter_b":"What did you expect from a trash bitch","commenter_a":"Sad, Sad, Sad. How dare you bring a child into this earth, if you do not plan to put them before yourselves. I imagine this is an ongoing problem and I truly hope that child is taken from them and placed in a loving home. If only I had the space, time, and money. I would rescue all children in a heart beat. :(","post_message":"Police want you to see these viral images of what heroin is doing to families."}]
