[{"comment_id":"10154282422068128","commenter_b":"\"So Veli, I saw an article about you in the WSJ today...\" Haha, but my only interactions with him were over email, so as far as I know...","commenter_a":"@username veli?","post_message":"“Just when I wanted to nominate Jill Watson as an outstanding TA,\" it turned out she was computer."},{"comment_id":"10153596385394740","commenter_b":"She lied on the form. If she is able to pass a background check she is going to pass a background check. It's not going to stop her from buying it for someone who can't legally buy it. Criminals will get guns no matter what laws are passed.","commenter_a":"This can't be! Everyone knows that background checks stop gun crime!","post_message":"Prosecutors say her boyfriend, a convicted felon, gave her money and told her what to buy."},{"comment_id":"1214715148582648","commenter_b":"That IS NO lady!","commenter_a":"This is one sick lady","post_message":"WHOOPIE GOLDBERG: Right To Abort Baby Same As Right To Celebrate Birth Of Jesus Christ [VIDEO]"},{"comment_id":"10156397990805354","commenter_b":"Maybe one testical...he is a RINO.","commenter_a":"At least he has balls to stand up to Obama","post_message":"Which do you want: a \"pause\" or an \"immediate halt\"?"},{"comment_id":"10153326495519714","commenter_b":"Yeah a little weird but seriously.\"omg he got a picture of my butt.\" so what?","commenter_a":"If I were the girl in the picture, I'd send a thank you to him for making my derriere famous. We should embrace curves! I'm sure he's just goofing around. People need to stop being so sensitive.","post_message":"Do you think Michael Bublé crossed the line with this Instagram post?"},{"comment_id":"460098450844429","commenter_b":"Idiot, cite a source.","commenter_a":"Homicide and violent crime rates are down, twats. They're lower than they've been since the early 90's-you focus on \"gun murders\" instead of all murders because the facts don't back up your propaganda.","post_message":"America's big problem is lethal violence  and that's driven in large part by guns."},{"comment_id":"798452466914476","commenter_b":"thank you againe Mr President for saving your citizens from the corporate wolves","commenter_a":"Question: wasn't the FCC suppose to have public comments?","post_message":"BREAKING: This is a huge victory for American consumers.  Share the good news!  Read more: @webpagelink Image by Occupy Democrats."}]
