[{"comment_id":"593410574181627","commenter_b":"Ex hoe for first lady wtf","commenter_a":"I wish my middle class friends a I could afford to buy that, oh, I forgot, there is no middle class","post_message":"Melania Trump, the first-lady-to-be, wore a $4,000 Ralph Lauren silk crepe jumpsuit  made in Italy on election night. #Election2016"},{"comment_id":"697111387146106","commenter_b":"Go get them","commenter_a":"Unleash the Donald","post_message":"Donald Trump says he would bomb the sh*t out of ISIS during speech.  You have to watch this. He is absolutely right.  Do you support Donald Trump?"},{"comment_id":"10154135870346336","commenter_b":"@username OMG---More Trump Fabricated LIES!!!Trump Played Everyone Like A FIDDLE With Those TRUMP Planted PAID Protesters, Trump Now Has 20 Secret Service Guys Guarding Him At His Rally, EGO IS THE WORD...He Really Knows How To Play the Media & Followers *NEVER TRUMP* TRUMP Wants to TURN Our Military INTO ZOMBIE TeRRORIST Animals To Beat ISIS...BUT OUR MILITARY IS AN ELITE GROUP & Has Rules & Morals.... ISIS is A BAND Of MURDERS & CRIMINALS.... TRUMP Wants A WAR $$.....People Are Blinded by Trump's Rhetoric and can't SEE Trump Sending Our Young Adults To Fight An All OUT WAR AGAIN! Government Welfare KING DUMP Trump doesn't need anyone's HELP exposing His LIES Trumps own EGO Is His Own Nemesis.. ??Has Trump Gone From Selling Realestate Properties To Selling Our Whole Country!TRUMP wants to Do Away with Social Security & Medicaid For Our ELDERLY!!! HOW is Trump Helping American JOBS when ...","commenter_a":"Typical Trump...talking about anything other than specifically HOW he is going to make AMERICA great again!! Just saying it won't make it so!! Maybe that's why he gets no more than 35% of the vote. The other 65% are on to his BS...He only cares about Trump not one of his supporters! Wake up people!!!","post_message":"\"[Marco Rubio] made a statement that I had small hands. He made it up. He's a politician. Politicians lie.\"  Today on \"MediaBuzz,\" Donald J. Trump talked about the \"hands\" story."},{"comment_id":"1291146050978446","commenter_b":"I really like this nasty woman VOTE BLUE>","commenter_a":"I love Senator Warren! She is a ball buster and has no problem getting her point across. We need more like her in the Senate. Go Elizabeth.","post_message":"She's had it with the hypocrisy and double standards..."},{"comment_id":"1732731136976178","commenter_b":"@username STFU","commenter_a":"No one will care! Liberals will vote for this criminal no matter what she does!","post_message":"New details about the investigation into Hillary's pay-to-play scheme while she was Secretary of State."},{"comment_id":"10154585681040329","commenter_b":"Dan Mulligan","commenter_a":"Alan Baird","post_message":"This is how you get strong enough to crush a guy's skull. // Game of Thrones"},{"comment_id":"10157235838770231","commenter_b":"Because they are white? And black thugs will get arrested because they are black very simple?","commenter_a":"Privileged, yes. I'm not convinced about the White part. Jameis Winston was accused of a much more serious crime but because he is an athlete he was shielded from those repercussions. And let's not even get into Bill Cosby.","post_message":"It must be nice to be white and entitled."}]
