[{"comment_id":"912315142139160","commenter_b":"I saw this on Fox & Friends this morning. I am so saddened by what this hero went through. Glad Perry was there to help him. My heart goes out to Marcus and all who suffer without the help they should get for free, for serving our country. Obimbo's leave no soldier behind is such a lie.","commenter_a":"Rick Perry for President or maybe Rand Paul!","post_message":"Do you know the story of Marcus Luttrell and Rick Perry?"},{"comment_id":"10155862004711038","commenter_b":"That is impossible. Teenage girls take up the entire bathroom so you can't share it with them.","commenter_a":"Yeah, teenage boys are gross...but have you ever shared a bathroom with a teenage girl? It's fucking nasty.","post_message":"You love him, of course, but COME ON."},{"comment_id":"937869812915107","commenter_b":"I hope they suspend her license and hope the liar loses her job!","commenter_a":"She should loose her job & be required to stand on corner with sign showing what she is","post_message":"Our favorite ‘just deserts’ of the week!"},{"comment_id":"10154725067651341","commenter_b":"Now I wonder which side is truly the terrorist nation","commenter_a":"\"Netanyahu Warned New Zealand It Was Declaring War\" - what, by adhering to international law which was administered to PREVENT war?? Repeatedly violating resolutions and stealing land on some warped justification of ancestors IS a declaration of war!!! Thanks Israel for finally showing your true colours to those who remained unsuspected and blind to your callous actions.","post_message":"EXCLUSIVE: New details on Israel's last-ditch scramble to stop the UN settlements vote"},{"comment_id":"1220607601313429","commenter_b":"Lena Al","commenter_a":"Sinéad check this out","post_message":"Sounds about right."},{"comment_id":"1715971748670504","commenter_b":"@username is not clearly thinking. What the soldiers need and what is spent, often wastefully, through our War budget are two separate things.","commenter_a":"Increase. I bet everyone saying to decrease posts those names on veterans day saying how you support the military. Obama cut meals for troops in a war zone. SMH","post_message":"U.S. Military Size: Increase, Decrease or Stay the Same?"},{"comment_id":"546309585494081","commenter_b":"Another scenario: Let's raise minimum wage and keep everyone else's the same. That way their money is worthless and means less, as opposed to this minimal skill havin high school dropout with 6 kids with 4 different fathers/mothers so the price of goods will rise and you'll be in the same poverty stricken boat as you were but now you've lowered the entire middle class in it with you. And people can we get over the race thing? It's very tiresome and down right comical.","commenter_a":"This is complete and utter FAIL. If you work hard and make smart life decisions, you absolutely can succeed. What idiot came up with this B.S.?","post_message":"Seems legit."}]
