[{"comment_id":"10158911278605206","commenter_b":"@username, would you feel that way too if you were on an airplane and didn't like the pilot? According to you lilies Trump will destroy America. You might want to hold off on purchasing any party supplies. According to you dandelion's Putin will take over America because of Trump. You daffodils won't be allowed to throw any party's if that's true...","commenter_a":"The world deserves Donald Trump. No doubt about it.","post_message":""},{"comment_id":"10154969261539575","commenter_b":"That's supposed to be the case","commenter_a":"I was once told that the firechief is boss of a fire what he said goes","post_message":"The Cannelton Fire Department chief was arrested after police say he shoved an officer multiple times at the scene of a fire."},{"comment_id":"10152742802465950","commenter_b":"How come them crazy coloradians cant just flush them like the new yorkers with their alligators.or the floridians with their boas!! Lol","commenter_a":"Time for some catfish!","post_message":"Someone dropped a few goldfish into the water. Soon, those few fish spawned into thousands."},{"comment_id":"957930547633333","commenter_b":"If she finds it so offensive get another job quit inflicting her stuff on us","commenter_a":"Let her rot there.","post_message":"Some people just never learn."},{"comment_id":"960457477322681","commenter_b":"Hunt these cops! Good Germans would say this!","commenter_a":"police state","post_message":"Officer Thomas Webster was just found not guilty of assault... even though he was caught KICKING and UNARMED MAN IN THE FACE as he obeyed police commands.  This is America, 2015. Not the Jim Crow Era.  From (Y) Counter Current News - MBD"},{"comment_id":"1091142627573414","commenter_b":"You're a pussy","commenter_a":"Vaccines cause Autism. The risk of giving a few kids Autism outweighs the risk of the diseases vaccines prevent. The government will never admit this but it's the truth.","post_message":"How much more time and money do we have to waste investigating this?"},{"comment_id":"804306716336257","commenter_b":"I have no problem with that bitch being on Air Force one. If they are traveling for her campaign then she should be flipping the bill for the personnel onboard, food consumed and fuel. I would much rather see her ass sitting in a jail cell though.","commenter_a":"SCREW THEM BOTH","post_message":"Donald J. Trump's wondering why President Obama's allowed to hit the campaign trail with Hillary Clinton on Air Force One: \"Who pays?\""}]
