[{"comment_id":"1825547344399892","commenter_b":"Guess what? They don't want her in their sh*thole!","commenter_a":"Please stop telling them any different! We don't want them coming here!!","post_message":"More liberal condescension and arrogance."},{"comment_id":"10154323067108822","commenter_b":"Fourteen people are DEAD!","commenter_a":"So glad to see everyone is a judge!!! Are the kids wrong for what they did? Yes! Should they be punished for what they did? Yes! No one who made any of these comments could be their parents I'm sure or you wouldn't be saying such hate filled things. No one is going to win in situations like this, I pray all the families and businesses can come back from this, I pray something can be salvaged somewhere. And I pray everyone who has hate in their hearts can change. This world would be a much better place if people loved like they are supposed to, to much greed and hate now. How would any of you feel if they were your family members or if you lost someone. I'm sure some of you are christians?? Think about what you could do for someone instead of spreading hatred and negativity!","post_message":"JUST IN: 2 juveniles have been charged with starting the Tennessee wildfire that killed 14 people."},{"comment_id":"10153212913058145","commenter_b":"The problem is that She's an evil mean peace of crap, that should had never been born","commenter_a":"Everyone loves kittens so what is the problem?","post_message":"A north Florida woman is facing charges after deputies said she was seen throwing kittens out of her car window. @webpagelink #wftv"},{"comment_id":"10154724621788984","commenter_b":"Hey Walmart has glasses 2 for the Price of one One for your dumb Head and one for Your your brown spot","commenter_a":"Lady you need to get your head out!Quit your job cause you are not of sound mind like Hillary Clinton","post_message":"Attorney General Loretta Lynch just issued a message to Charlotte rioters - and something about it immediately raised eyebrows."},{"comment_id":"10154558437983645","commenter_b":"Oh Gabrielle you maam are the main reason racism still exist!","commenter_a":"Had to be white. He should of been charge with murder","post_message":"Dennis Meers faces 11 months in prison if he fails his probation. His granddaughter Cadence Orcutt died in a November 2015 rollover crash where she was behind the wheel."},{"comment_id":"10154229905709170","commenter_b":"Stop it. This kind of game playing makes you look more the fool. Most people today couldn't pick a transgender out of a line-up of people. They've been using our public bathrooms according to the sex they identify with, live and dress as, all these past decades to no uproar. Now all of the numskulls have come out of the woodwork claiming their women and children will be raped in the toilet stall because men are going to swarm into the ladies room because the law says they can. Get this: sexual predators don't follow laws in the first place and no law will stop them from getting their next victim be it in a bathroom or anywhere else.","commenter_a":"I will be packing better know what you are doing or you will be peeing like a girl for real !!!","post_message":"You want to try using the ladies' room, bro . . . the politicians and the media might be OK with you, but as for the ladies themselves, I wouldn't be so sure."},{"comment_id":"10155021026963984","commenter_b":"You are so full of life, Tom, your birds, your cats, your home, Butch, your family, your love of antiques and craftsmanship, your sense of fun, on and on. Just don't want you to let what is beyond any our control override the richness of all you have in your life. Isn't it amazing how much we reveal about ourselves in little vignettes of our lives. Called sharing, and all of us as your Facebook friends enjoy your posts very much.","commenter_a":"Judge Pirro comments were so articulate, to the point, and crystal clear honest evaluation of exactly what has happened to our wonderful country in the last eight years. I remember so clearly Michelle's remarks at 44 years of age saying it was the first time she had been proud to be an American, I was shocked beyond words! To accept so much as we are given as Americans and not to be thankful and proud of our country and our fellow everyday wonderful citizens, Americans! Color or religion are immaterial, Americans and I for one am so thankful for being one and never fail to appreciate what it is to be American. Thank you Judge Pirro for your concise evaluation of Michelle Obama.","post_message":"In the final days before the Obamas leave the White House, Fox News' Judge Jeanine Pirro just gave Michelle a parting gift she'll NEVER forget."}]
