[{"comment_id":"10153457931491130","commenter_b":"Zane Gutierrez","commenter_a":"The politics of this is, scandalously ,that its a way for the establishment to write people off , they do not want to understand., There is so much hypocricy on this particularly in relation to alcohol : whats wrong with wanting to feel good , which is why anyone tries to get high off anything ?How we try to achieve this might be questionable but anything can be abused, does not make it bad in itself . people would not do self-destructive things if they felt self-worth. As some people here have said in their comments here,learning to love themselves was key to giving up the addiction .(not read the article btw)","post_message":"\"We put people who are not well in a situation that makes them feel worse and hate them for not recovering.\""},{"comment_id":"10153504352285329","commenter_b":"She's been on hormones for years-that's where the breasts come from. And you can't see anything under the suit because it was removed. Think ya need your eyes checked","commenter_a":"Guys... Where did that breast come from so suddenly?","post_message":"The olympian and reality star has made her debut in the July issue of Vanity Fair)"},{"comment_id":"10157985698230594","commenter_b":"Hillsborough residents don't want the riffraff coming through their fancy neighborhood? Mountain lions can eat your pets.","commenter_a":"And the point is?","post_message":"Peter Rauenbuehler has posted video online showing a mountain lion attacking a deer and then dragging the limp animal away from his Hillsborough home."},{"comment_id":"10154263730768271","commenter_b":"Perhaps MaryAnn Kosimko would like to be grabbed by the pussy too and go to war while she's at it... what ever you're smoking STOP...","commenter_a":"Yes! We need him for president! Strong! Cares for this Counrty. He's not doing this for the money- he has Money. He can't be bought!! ( not like some one) He is doing this because he wants to make American strong. We have been brow beaten for 8 years. I'm tired of that, aren't you? We need to be Strong and Proud of who we are: Citizens one a great country. We need Trump as our Leader. We don't won't a dictator.","post_message":"JUST IN: Donald Trump will hold a campaign rally in Denver Saturday night as the cherry on top of a busy week in Colorado politics, filled with visits from both major campaigns."},{"comment_id":"10154207452564916","commenter_b":"Ever hear of Independents? You know, 45% of the voters.","commenter_a":"And just where are all you threatening to leave the Dem party going to go? Good luck with that one.","post_message":""},{"comment_id":"10152982491580927","commenter_b":"She is only interested in Pelosi.","commenter_a":"She wouldn't know, hers never started","post_message":"Pelosi:  think I know more about this subject than you, with all due respect."},{"comment_id":"902494896546891","commenter_b":"I told you I was going to get her out","commenter_a":"@username she's a chunk! Pictures were a lie! 😁 She's out @username lol","post_message":"Our camera caught the middle school teacher who reportedly got pregnant during an affair with an 8th grader as she left the jail. We had questions, but she didn't have any answers. Full video: @webpagelink"}]
