[{"comment_id":"1579733685658472","commenter_b":"But let's bring them here, and take our guns.","commenter_a":"If the FBI AND Homeland Security interviewed the shooter 3 times and still let him go, then with those standards how are we supposed to believe that Syrian Migrants are going to be properly vetted and America still be safe?","post_message":"American must now get very tough, very smart and very vigilant. We cannot admit people into our country without extraordinary screening."},{"comment_id":"10152944576132061","commenter_b":"Good thing they aren't dogs- the barbarians would skin them alive and eat the,.","commenter_a":"@username I want one for my birthday!!!","post_message":" China debuts its newborn panda twins: @webpagelink"},{"comment_id":"1055345397919589","commenter_b":"Natural selection for the girl that's in the bikini","commenter_a":"Wow","post_message":"LIVE FROM HOLLYWOOD BEACH - Take a look at LIVE video from our Hollywood Beach Cam where the outer bands of Hurricane Matthew are making their presence felt."},{"comment_id":"10153392650361536","commenter_b":"She will NEVER win the general. #NeverWithHer #BernieOrBust","commenter_a":"Hillary Clinton once again dominating the night showing that she is clearly more knowledgeable, articulate and experienced to be President and commander-in-chief. Ready or not, Madame President here she comes!!!","post_message":"Watch Sanders hit Clinton for her use of the term \"superpredator\" in 1996."},{"comment_id":"1151424271590993","commenter_b":"Hillary is a racist bitch.","commenter_a":"Sums up trumps campaign..... even his surrogates are full of shit.","post_message":"He walked out of his own church because of his lies! #DonaldTrump #MarkBurns"},{"comment_id":"10153580518686749","commenter_b":"@username The narrative BARACK HUSSEIN OBAMA has been pursuing is based on twisted facts and a long standard hatred against liberty and against our Republic', which he calls it America. HILLARY CLINTON being in lockstep with him, and just like him, she also felt the need to go around the world and apologize for all the things we supposedly did in the past. Never mind of all the aid and the freedom many Democracies are enjoying because of us and the blood we shed for them. We helped them and still helping them not because we but because is our duty to all the Millions of American citizens who came from those places and all their loved ones who are still living there! So, instead of leading from behind, when will our Nation have a pious and righteous President, a Constantine, a Theodosius, a Justinian, who will not be afraid, ...","commenter_a":"You're the best president, I'm from England but thanks for everything you have done Obama, especially for the LGBTQ+ community.","post_message":"President Obama's final State of the Union is on January 12. Say you'll be watching—and join the conversation. @webpagelink"},{"comment_id":"10154353544894228","commenter_b":"Middle aged white ladies also have much less to fear now don't ya? Or was there a string of incidents where the police killed a group of white women I didn't hear about? Common sense...","commenter_a":"I was always when pulled over by the police to put my hands on the steering wheel (10 & 2) until the officer approached you and asked for your information. Common sense people.","post_message":"The victim's name is Philando Castile"}]
