[{"comment_id":"1514026052232145","commenter_b":"Omg can you just shut it, you selfish brat!!!!","commenter_a":"Hey I thought he was leaving this country cause he did not like here. Well be gone with your bad self","post_message":"An expletive-filled clip of Kanye West's alleged tantrum has leaked."},{"comment_id":"10152692190456636","commenter_b":"Because of course it's the woman's fault! We are female, wear thongs and stiletto heels so obviously that translates to \"I want sex and will have it with anybody and my screams of no & stop obviously mean, yes!\" And if you go to court they ask questions about your underwear and what we're you doing out. Never ask the rapist what he was wearing or why he thought you walking down a street by yourself translates to brutally attack and rape me. It's 2015 the world has come far but on certain things importance ranks zero.","commenter_a":"road","post_message":"'I witnessed this years ago, after I was raped myself'"},{"comment_id":"10154496192470329","commenter_b":"Jools pls","commenter_a":"@username u at ginger boy","post_message":"Are hand jobs back and better than butt stuff? Is this 9th grade? LET THESE TWEETS DECIDE."},{"comment_id":"456287754495819","commenter_b":"She wil not get my vote, Trumps mine.","commenter_a":"I do not agree with old horse face at all.","post_message":"Carly Fiorina has vowed not to send 'boots on the ground' into the Middle East. Do you agree with this strategy?"},{"comment_id":"988837027845081","commenter_b":"It seems to be about control imo. Religion has had so much control in history that by taking a little bit away they think the world is persecuting them. In my opinion they should let gay people do what they want just like they think Muslims should mind their own business about others eatting pork.","commenter_a":"wow - I am honestly confused as to how gay couples marrying really affects your lives? whether it be against your religious beliefs or whatever your reasons are for hating these people, does it truly affect how your life is going? There are so many other things in this world that should be worried about, like how our veterans are being treated and cops being stalked and killed, does two people being in love and wanting to be married change your life? and btw, no, I am not gay. I would just rather see more love in this world than hate and violence.","post_message":"North Carolina and Utah Laws Allow Clerks to Refuse Same-Sex Marriages  More than 30 magistrates in North Carolina have legally refused to perform weddings for gay couples.  @webpagelink"},{"comment_id":"550023351824286","commenter_b":"Funny Denis.","commenter_a":"Good for North Korea, we have missiles why can't they","post_message":"The rocket was launched on a southward trajectory, as planned, passing over Japan's southern Okinawa islands."},{"comment_id":"1149825048400467","commenter_b":"Everybody is sick of her! She just needs to go away!!","commenter_a":"Fox and news should never be together! News is ok and fox is ok but fox and news makes no sense!","post_message":"Source: Fox is ‘Sick’ of Megyn Kelly; ‘Fox News Needs to Cut Her Loose’  @webpagelink"}]
