[{"comment_id":"927016837412270","commenter_b":"So therefore, our tax dollars wouldn't be an issue in that legislation.","commenter_a":"Donald Trump is smeared 24/7 by the media, so I'd say no. Probably the most unfair media coverage I've ever seen. Mainly because he's at odds with the globalists that own almost all the media outlets. Hell time warner owns cnn and they've given the Clinton campaign over $600K.. so what does that tell you.","post_message":"Has the media treated your 2016 candidate fairly?"},{"comment_id":"401829593338668","commenter_b":"How very sad to read this. Our vets are not being taken care of properly and it is a shame. The President cared more for illegals then he does our veterans. Shame, shame.","commenter_a":"Semper Fi marine R I P","post_message":"RIP Marine..."},{"comment_id":"1072715589511885","commenter_b":"I would call him much worse than a monkey.","commenter_a":"That's insulting to monkeys the world over!!! Ann PLEASE think before bad mouthing the monkeys...","post_message":"VIDEO: Ann Coulter Just Created A HUGE Firestorm, Outrage after Calling Obama A  On National TV Ann Coulter is under attack over this.  Can we get 5,000 'LIKES' for Ann Coulter?  @webpagelink"},{"comment_id":"10153354234326336","commenter_b":"Women should only be allowed to make the sandwiches.","commenter_a":"Females should not be prison guards for male prisons. And I don't want to hear from all the feminist. That is my personal opinion.","post_message":"BREAKING NEWS: New York state prison employee Joyce Mitchell has been arrested on felony charges for providing material assistance to prison escapees, state police say. @webpagelink"},{"comment_id":"10154329807781051","commenter_b":"These insecure women manage to chase away the good men...then end up with another POS and can't figure out why...imo","commenter_a":"Opps!","post_message":"This girlfriend really, really didn't trust her boyfriend, so she decided to send a porn star to test his fidelity while she watched it unfold on camera. She thought she was ready for anything - but she was definitely not ready to see what he did."},{"comment_id":"1256741554345872","commenter_b":"Says the guy who looks like Peter griffin....","commenter_a":"So, liberals are proud of the filthy mouthed losers who interrupted good people coming to hear a speaker? Makes sense - birds of a feather flock together and liberals are losers. That is why people who seek to succeed hang around republicans and others who are successful.","post_message":"Watch Donald Trump get interrupted by protesters during his North Carolina rally on Friday. By the end of the night, Trump was heckled 10 different times.  Read full story: @webpagelink"},{"comment_id":"10153840702631955","commenter_b":"No no, that's Bernie. Hillary is just a straight up thieving murderous cunt.","commenter_a":"And to think that there are idiots who say that she's a communist or a Marxist. What morons. After she gets so much $$ like Ted Cruz from Goldman Sachs","post_message":"HRC wore yellow debate jacket when meeting GOLDMAN SACHS CEO..."}]
