[{"comment_id":"793004177467954","commenter_b":"cuck","commenter_a":"Go take some selfies Obama you fucking disgrace","post_message":"Obama is a _______________."},{"comment_id":"1113200062092053","commenter_b":"Hillary is the bigger liar and has laundered millions for her own use through the Clinton Foundation. At least Donald actually worked for his money. She is a murderous also. Her stint as Secretary of State and her private e-mail server has put us in great danger from our enemies. If you plan to vote for Hillary raise your right hand and slap yourself in the face!","commenter_a":"I really like you Dr Carson but if this is true why do you support TRUMP, who lies, has no common sense and won't release his tax returns. He's hiding a lot and we all know it.","post_message":"People all over the nation are starved for honesty and common sense."},{"comment_id":"1721110158153806","commenter_b":"I wanna see this dumb bitch fight off an intruder in her home with a vibrator","commenter_a":"Pedro Tosta K. Nogueira","post_message":"These students are protesting open-carry laws by handing out dildos.  #Micbrights"},{"comment_id":"10153573077978352","commenter_b":"Christina you're dumb","commenter_a":"Te'ron Walker because most black people blame whites for everything. When no white people alive today had a damn thing to do with the past. Not all white people are racist. There are plenty of black racist people though because all whites \"owe\" blacks every damn thing when we're not the ones that had anything to do with anything that happened before. Y'all need to take that shit up with all the dead white people. Oh, and the blacks too since whites weren't even the ones to START damn racism. Ignorance is bliss people.","post_message":"High school principal fired after racist outburst at ‘all the black people’ leaving Georgia graduation ceremony early"},{"comment_id":"10154389152146955","commenter_b":"It's just what she does","commenter_a":"Its not like she left 4 people to die in Benghazi, Blamed a terrorist attack on youtube video, deleted 33,000 emails and Lied to congress,, accepted money from terrorist countries, or called millions of Americans Deplorable, this was just a small Lie about her health. At this point, What Difference does it make.","post_message":"FLASHBACK: SCARY COUGHING FIT AT BENGHAZI HEARING..."},{"comment_id":"507737642755232","commenter_b":"Hillary has a list of wars that she provoked go take care of your wives, she be to dangerous for you, she be a backstabbing. Learn to read.","commenter_a":"This man trump will be too dangerious for the oval office he will lead america to another third world war so to all you red necks supporting he's cause do the right thing before you unleash hell on earth","post_message":"Every day I wake up determined to deliver a better life for the people all across this nation that have been ignored, neglected and abandoned. -DJT"},{"comment_id":"10153067204246636","commenter_b":"Is she ? So sex with her is ok?","commenter_a":"Slaughter of the baby is hardly justice for the rape. Two wrongs don't make a right.","post_message":"He claimed there are always 'two victims' in an abortion"}]
