[{"comment_id":"1011632632284104","commenter_b":"yall nasty","commenter_a":"Emmanuel Esquivel @username","post_message":""},{"comment_id":"1664185713874789","commenter_b":"Mars, but unfortunately the earth will be trashed long before humans can get to it.","commenter_a":"Is there by any chance a spare planet any of you got around?","post_message":"This is not a drill – a bill has been drafted to “completely abolish” the Environmental Protection Agency before the end of 2018."},{"comment_id":"10153265527170950","commenter_b":"Oh stfu","commenter_a":"The blood is on their hands. This is a typical reaction from a Liberal Democrat.. Like a small child they point the blame on some one or something else.. The Democrats have made California a safe haven for Illegals, Criminals and Terrorist with their Sanctuary and open border polices.. The Blood is on your hands Moon-beam.. You and your Lawless Democrats. @webpagelink","post_message":"\"Increased surveillance, creating relationships with mosques in the Muslim American community across the country. We did that after 9/11 and prevented attacks in New Jersey and all across the country.\""},{"comment_id":"438573499666627","commenter_b":"@username. She's an idiot","commenter_a":"Another liberal sheep just voting for a female!","post_message":"Lena Dunham isn’t worried about Michael Bloomberg."},{"comment_id":"10153145019224205","commenter_b":"Honestly, she's a fucken hypocrite.","commenter_a":"Juliette Aguilar @username Melissa Amezola Hilda Llamas Navarro","post_message":"Caitlyn Jenner’s Opinion Of Gay Marriage"},{"comment_id":"10152781185011748","commenter_b":"A woman named Ann Coulter taught me to hate the republican party!","commenter_a":"Why is it still speaking?","post_message":"Ann Coulter slams college loans as a \"scam\" meant to make kids hate white people and Republicans"},{"comment_id":"1141429345895300","commenter_b":"Why doesn't he close the border and escort all of the illegals & especially Muslims out of our country?","commenter_a":"TIME TO DOWNSIZE DHS. Secret police full of pussies. The whole thing is useless.","post_message":"BREAKING NEWS:"}]
