[{"comment_id":"10150689045559999","commenter_b":"Ha, the wife and dog get all the ink.","commenter_a":"@username who's in the photo?","post_message":"Amazon.com is doing 2 predictably unpredictable things this week."},{"comment_id":"1059407147484519","commenter_b":"She is terrible!!! She never said how she would protect us. My dog can do better than her!!!","commenter_a":"Agree!","post_message":"Eric Trump criticized Hillary Clinton's foreign policy and said it should be a requirement for Americans to watch \"13 Hours: The Secret Soldiers of Benghazi\" before voting for president."},{"comment_id":"1015238835192369","commenter_b":"Not that she's seeming to give a flying bigoted spit spatter regarding the education of people in that group however. Still a power bred over privileged crusty plantation damsel. Like seven generations later. She still wants her back washed by the maid.","commenter_a":"Batshit crazy.","post_message":"Nancy Pelosi identified what she called the \"three G's\" – reasons why white males favor Donald J. Trump over Hillary Clinton. @webpagelink"},{"comment_id":"1707295909299362","commenter_b":"During WWII there was a very true saying: \"Loose lips sink ships.\"","commenter_a":"Nope","post_message":"This whole thing is ugly."},{"comment_id":"10154874338494641","commenter_b":"Make the wall will be turist attraction !! Turist will puy a lot for walking on the wall-))) US ern on it, every hotel and restaurant and gifts shops","commenter_a":"Una traduzione bizzarra","post_message":"The move would break a key campaign promise when Donald J. Trump repeatedly said he would force Mexico to pay for the construction of the wall along the border"},{"comment_id":"10154352617716880","commenter_b":"Yes. That's correct too. And once it's 10% conquest begins. Not sure if it's even possible to fix now.","commenter_a":"Could it be because there are too many Muslims in France?","post_message":"A French parliamentary report reveals its reasons."},{"comment_id":"10153764021131509","commenter_b":"And as far as white women go.... I've quite seen a few black women with arm pits and legs full of hair. Jus sayin..","commenter_a":"WHITE-WOMEN! Tryinna start a trend....","post_message":"What do you think about the growing trend? The \"free to be hairy\" notion has caught the attention of some of Hollywood's most notable stars, too. @webpagelink"}]
