[{"comment_id":"10153256663916770","commenter_b":"Another huge waste of tax payer money. There are so many departments in the WH, that do nothing, except, pad their pockets & suck America dry! A big majority of them need to be kicked out!","commenter_a":"Same accountant Obama has. It's just like dropping a billon here and here(like dirty socks).","post_message":"Department of Energy officials might want to take a few more accounting classes after they miscalculated their budgets by a few billion dollars."},{"comment_id":"516585565198690","commenter_b":"Leave America, why are you here? Go back where you belong, we don't want you.","commenter_a":"Ship them all back to the hell hole they came from. We don't need or want them.","post_message":"This state just voted to ban Islamic laws… Good.  We won't stand for Shariah in America and neither should you.  Do you support banning Islamic laws in all 50 states?"},{"comment_id":"1653212978299148","commenter_b":"You two bitches are so very stupid","commenter_a":"John. I agree with you.","post_message":"It's about time...  I'm tired of these two."},{"comment_id":"10153592600809607","commenter_b":"@username Many Americans want the wall. Unless they are not here legal ofc....","commenter_a":"#Trump2016 Trumping along and Making America Safe and Great Again #VoteTrump and vote often #Winning #WinningTeam #2A #Gunrights #Love #GOD #Family #TrumpTrain #FreeMarket #Religion #Veterans #Freedoms #BillIOfRights #Constitution #Liberty #FencePaidByMexico #TruthHurts #FreeSpeech and #RealJobs for Americans with a sweep in all 5 states!","post_message":"\"As far as I'm concerned, it's over,\" said GOP front runner Donald Trump. \"I consider myself the presumptive nominee.\""},{"comment_id":"783181045136903","commenter_b":"Because jerusalem is Israel. This fact will not change no matter what this president says.","commenter_a":"Why we should consult Israel? What you guys think you are? How many Palestinians have been killed in the holly land since creation of Israel? You got a country out of nothing and there is nobody who could satisfy you people.","post_message":"In new book, former ambassador and now Knesset legislator describes his impressions from when he was Israel's envoy in Washington between 2009-2013."},{"comment_id":"494982004030385","commenter_b":"The towers that Donald Trump built ... Border Patrol endorses you to build that wall too, Mr. Trump ... A BUILDER ... not a destroyer ... of American liberties/freedom FOR POTUS!!! @webpagelink @webpagelink #DONALDTRUMP #POTUS #REPUBLICANPARTY #GOP #2016ELECTION #BORDERWALL #BORDERPATROL #TRUMPTOWERS #PRESIDENTIALPRIMARIES #VOTETRUMP #TRUMPTRAIN #MAKEAMERICAGREATAGAIN","commenter_a":"7% lead is good but you know that you need to win by double digits to shut ted up. IF you have any last minute secret weapons or anything you haven't used now is the time. Win NY huge and then take Cali and then proceed to destroy the liar and the commie.","post_message":"Thank you, California! I will see you soon! Have a great day - and remember - - TOGETHER WE WILL MAKE AMERICA GREAT AGAIN! #TrumpTrain"},{"comment_id":"10154298505504411","commenter_b":"stfu goat lover","commenter_a":"Go police go, do not let bastards ruin the day!","post_message":"Police deployed tear gas to disperse some particularly hostile demonstrators"}]
