[{"comment_id":"1072716372784891","commenter_b":"You want \"the happy, secure, tested and moderate side of life every day\" ? Happiness? Even Russia is above the US : en.wikipedia.org/wiki/World_Happiness_Report Tested ? Europe says hi. Moderate ? Bernie is centrist left here.","commenter_a":"I read something the other day from my pal and it's stuck with me all week. I'm paraphrasing here but in a nut shell... He said \"I don't like extremes. We have one guy saying he's \"going to make America great again\" and on the opposite end of extremes we have another fella shouting for \"revolution\"!! \" I'll take the happy, secure, tested and moderate side of life every day. #ImWithHer","post_message":"\"The most qualified candidate, and someone who is, by all reality-based measures, progressive.\""},{"comment_id":"10154085235841717","commenter_b":"I believe two females can already, though not commercially available and always produces girls","commenter_a":"Perhaps a little off topic, but I wonder how long it will be- or indeed if it's possible now- for a same-sex couple to have a natural child using a similar method. I imagine it would be complicated, but not impossible for, say, two men to have a biological child using a \"blank\" egg cell.","post_message":"To help women with mitochondria problems from passing them down to their children, scientists remove the nucleus DNA from the egg of a prospective mother and insert it into a donor egg from which the donor DNA has been removed."},{"comment_id":"1073442816041814","commenter_b":"We all get there no matter who you are 4 days coming it will be so funny she doesn't know what she's talking about but you have to look at it he's an ignorant liberal socialist!!!!!!!! When she gets old just let her die!!!!!!!!! She is stuck on stupid!!!!!!!","commenter_a":"You will be old idiot","post_message":"Totally nuts!"},{"comment_id":"495256197331627","commenter_b":"She can't ban nothing she is just a picture hanging on the wall so tell her to stay out of Americans business","commenter_a":"So sad","post_message":"What Michelle Obama is banning now is just plain unacceptable.  The American people are tired and finally fighting back.  Do you agree Michelle Obama should mind her own business?"},{"comment_id":"863410587096986","commenter_b":"90% London is full of foreigners, loud mouth rude boys and junkies.","commenter_a":"But london will not make exception for trump","post_message":"London's new mayor will be an \"exception\" to his proposed ban on Muslims."},{"comment_id":"1195382713852612","commenter_b":"Okurumoniwonba Orimekunluyi, you are an idiot. None of what you say is even remotely true. Please pay attention.","commenter_a":"If Elizabeth Warren called me she would certainly get an earful of how despicable she is. She would hang up on me but I wouldn't hang up on her.","post_message":"When Elizabeth Warren isn't busy holding special interests accountable, she finds the time to make some calls for Hillary. Join her: hillaryclinton.com/calls"},{"comment_id":"1784031898507079","commenter_b":"She is a heartless bitch!","commenter_a":"She still hasn't gone to Louisana like she said she would after the devastation from the recent tropical storm that passed through there . And wasn't it her and her campaign who accused Trump of making Louisana a political stunt when he went to help after? Here she is making it political when it's time to focus on evacuations, preparation and people's well being.","post_message":"As Florida residents prepare for Hurricane Matthew's impact, Clinton buys ads on the Weather Channel."}]
