[{"comment_id":"1920123994941377","commenter_b":"Thought she was said she was leaving. Oh that's right she is an actress. Bad one at that.","commenter_a":"Hate to tell you this whippee but nobody really thinks you know anything you stupid bitch, and if you have any compassion for people at all, for God's sake cover your fugly ass face!","post_message":"Nobody saw this coming..."},{"comment_id":"10152872037516316","commenter_b":"YES! I don't understand some of my friends who like her. She's evil.","commenter_a":"As gratitude my wish is that she receives a free year supply of GMO foods! :)","post_message":"Hillary Clinton continues to dodge the press after being revealed as the Bride of Frankenfoods: @webpagelink"},{"comment_id":"10153179691834091","commenter_b":"Hmm...not as bright as WE thought, are you???","commenter_a":"See there, its already fixed. I'm sure it's not the first time this has happened. Everyone have a great night.","post_message":"YIKES!!!"},{"comment_id":"10153657681658984","commenter_b":"We have lost respect for megan and will not watch her show. I didn't think fox news would stoop to that level of questioning.","commenter_a":"What you call journalism, is piss poor.","post_message":"What Megyn Kelly just said may end the rowdy Trump/Fox feud...then again...  Do you think the Fox News personality did the right thing here?"},{"comment_id":"1609193876054360","commenter_b":"Karma has a lot of work ahead of her!","commenter_a":"Shame on all that participated! My thoughts and prayers are with you and your family. Thank you for your sacrifice and for your sons. He is a true HERO! I'm heart goes out to all of you. God bless!","post_message":"“When he made that announcement, there was some hissing and some booing behind us,” Stewart Perry, father of Sgt. John Perry, told the Army Times."},{"comment_id":"10157204409490206","commenter_b":"This chick is so full of crap.","commenter_a":"He makes John Lennon seem like a man and Ryan Leaf viable.\\b","post_message":"The disgraced quarterback allegedly hit his ex-girlfriend on the side of her face, rupturing her eardrum, and she's reportedly still unable to hear out of that ear."},{"comment_id":"10153663698070950","commenter_b":"I am not goin any where...I am a women of God and you need to read your bible,and as far as my gun,i carry it every where i have a permit and the right to carry it","commenter_a":"All of these peoplev are goin to hell if they dont frepnt,And im not giving my gun up for noone,im a responsable gun owner and its my right to carry a gun.....All these gay people need to repent cause he is coming back!!!","post_message":"Motorcyclists, parade-goers march on in L.A. march on during their annual gay pride parade:"}]
