[{"comment_id":"1201176699902507","commenter_b":"Beverly, there's already plenty of porn out there. I highly doubt anybody's going to get their jollies from our veiny mom-boobs. In all seriousness, though, in 99℅ of cases, you can't see any more breast than you would if wearing a bikini. And yet, we don't shun the beach for fear of perverts with cell phones, right?","commenter_a":"There is a big difference between how breastfeeding is depicted here and what the majority actually look while breastfeeding in society. , Here its done Discreetly and beautifully, If all women breast fed like this NO one would have issues with it,","post_message":"\"Let's support mothers to breastfeed anytime, anywhere.\""},{"comment_id":"10153640202729740","commenter_b":"check the last couple of videos I put up here.","commenter_a":"If cops weren't being abusive, murderous filth, then people wouldn't be this worked up...","post_message":"Protesters were captured on camera yelling \"pigs in a blanket, fry 'em like bacon\"."},{"comment_id":"1181915768493312","commenter_b":"This bitch is just flat out stupid.","commenter_a":"Die cunt!!!","post_message":"Hillary Clinton on Wednesday again criticized Sen. Bernie Sanders, for his stance on legal immunity for gun manufacturers."},{"comment_id":"523889751104313","commenter_b":"Ban muslims ? Better chance at banning tards first. Show me where islam justifies it. Quote the quran. If you have brain cells, lets discuss islamic facts.","commenter_a":"Where are the idiots who just a few hours ago were blaming gun laws for this? Where are they now?? Are they all shy and in hiding after it has been proven this was done by MUSLIM TERRORISTS? Muslim terrorists killed 150 people in Paris too, and they don't have the second amendment in France, how come??? #BanMuslimsNotGuns","post_message":"Authorities have named the two attackers suspected of carrying out the shootings before being killed themselves as Syed Rizwan Farook, 28, and Tashfeen Malik, 27."},{"comment_id":"10154973344274166","commenter_b":"@username my daddy would never. Then again he's only had one wife and never talked about groping his children.","commenter_a":"They about to get cozy. He is so in lust with her.","post_message":"Here's a look at Pres. Trump and daughter Ivanka as they departed Washington unannounced to honor slain Navy SEAL Chief Petty Officer William \"Ryan\" Owens. Read more: @webpagelink"},{"comment_id":"10153147008285950","commenter_b":"I love a drink but when I got pregnant I stopped and even though I am dying for a cold one in the warm spring sun it has to wait until bub is out and I am not breast feeding. I am due in oct. woman need to realise it isn't about them anymore.","commenter_a":"I remember my Dr saying a drink would be fine","post_message":"Slightly more than 3 percent of pregnant women admitted that they binge drink, consuming four or more alcoholic drinks at a time, according to the report from the U.S. Centers for Disease Control and Prevention."},{"comment_id":"10153141690015861","commenter_b":"@username she can ride that motorcycle off into the sunset away from here.","commenter_a":"Class act!! Thank you obama for showing Oklahoma some love... Unlike our governor.","post_message":"President Obama released a powerful statement to the friends and family of the people who lost their lives in the Oklahoma City Bombing, referencing the strength and unity of our community."}]
