[{"comment_id":"10153151656451336","commenter_b":"Prayers for our Country. This woman is a tyrant!","commenter_a":"The last person on earth we need as president.","post_message":"BREAKING NEWS: Hillary Clinton announces 2016 presidential campaign. @webpagelink"},{"comment_id":"869042603191993","commenter_b":"Good! Then STFU you two!","commenter_a":"So they jab him when they invite what's his face to address the congress, now they jab him with this letter to Iran. I mean are you kidding me?","post_message":"\"The letter sent on March 9th by forty-seven Republican Senators to the Islamic Republic of Iran ... is beneath the dignity of an institution I revere.\"  - Vice President Joe Biden"},{"comment_id":"10153615882695329","commenter_b":"Seriously. That woman should have said no or let's go home first. She's just as guilty! Time served smh. Bs","commenter_a":"And why is no one hating on the woman for this? MENISTS","post_message":"A Florida man was sentenced Monday to two and a half years in prison for having sex on a beach in front of other beachgoers, including children."},{"comment_id":"10153680141531077","commenter_b":"Safe.","commenter_a":"So sad that we need this kinda security for the Super Bowl.","post_message":"How would all this security make YOU feel?"},{"comment_id":"10154611725268445","commenter_b":"you are an idiot. I wish you were here right now bitch","commenter_a":"Natives don't want jobs just government hand outs","post_message":"Cannabis becomes the great equalizer and provides a level playing field for tribal nations, including those who did not benefit from casino's."},{"comment_id":"875517669161528","commenter_b":"Well here's the problem because of women like you these little Angel can't even make to birth how disgusting!","commenter_a":"The American dictionary says it's a human embryo, human fetus, human unborn baby. Common sense says it deserves human rights.","post_message":"Tell Congress to protect the unborn! Sign your Life at Conception Act petition today!  CLICK HERE to sign! @webpagelink"},{"comment_id":"1877645852479520","commenter_b":"Me thinks Conservatives protest to much! There was no outrage when Sen.Foley was exposed for pedophilia, in fact 36 other senators wrote impassioned letters begging for mercy for Foley. Trump bragged about oggling young girls naked at Teen Miss America and 46 million people didn't think it was a big enough issue to prevent a pedophile from becoming President. It is clear Conservatives sexual icing children is okay!","commenter_a":"Karma!","post_message":"BREAKING"}]
