[{"comment_id":"1155787421127301","commenter_b":"lmao ...#NeverCrookedHillary #JillnotHill","commenter_a":"Hillary for the love of God stop drinking!!! Your pandering is psychotic, you're losing touch with reality and becoming paranoid!!! You look old and tired!!! Put the vodka bottle down and go to bed!!! VOTE TRUMP MAKE AMERICA GREAT AGAIN !!! '","post_message":"A young girl asked Hillary, \"Do you think when you're president, you'll be paid as much as a man?\""},{"comment_id":"10153204205229087","commenter_b":"Dude....please, I had a lovely friend who died recently because she was too afraid of how much it would cost to go to the doctor. So, with all due respect, I don't think you know what you're talking about.","commenter_a":"No Bernie, we shouldn't. Healthcare is not a right, it is something acquired by honest toil, and it is NOT something everyone needs, shown by the IRS' discovery that people are paying the stupid tax penalty rather than buy something the government is telling them to buy but which they DON'T need. \"People should not be dying in the US because they're sick.\" They're not, Bernie. It's a myth from the ideology of myths you refuse to see have no basis in truth. @webpagelink","post_message":"“We are the only major country on earth that does not guarantee healthcare to all people as a right, and I think we should change that,\" Bernie Sanders said."},{"comment_id":"1777765929177182","commenter_b":"Hillary Clinton is pure evil! Most vile, lieing, thieving, corrupt witch on the planet!","commenter_a":"She lied and lied and has lied about her lies, all the while breaking the law, and half America still thinks she should be president. I would as soon a bank robber or one who had commited treason be president. Her lawbreaking and lying has been such a lifestyle for so long I can't imagine her being president no matter what skunk is running against her.","post_message":"An iconic photograph of Hillary Clinton using her BlackBerry while wearing sunglasses on a military plane prompted an official in her office to inquire about whether Clinton had been assigned a government email address...  The information came out in sworn testimony in a Judicial Watch deposition of Karin Lang, a former State Department official. Please SHARE!"},{"comment_id":"1249235748461513","commenter_b":"Hillary laughed after getting a child Racist off with 2 months served !!!","commenter_a":"In 1978, Bill Clinton violently raped Juanita Broaddrick in a Little Rock, Arkansas, hotel room, then, as he was leaving, looked at her bloody lip and said: \"Better put some ice on that. Corroborated by five contemporaneous witnesses Knowing full well about Bill Clinton proclivity to sexually assault women, about three weeks after that rape, Hillary Clinton cornered Broaddrick at a party and said, pointedly, just want you to know how much Bill and I appreciate the things you do for him. Do you understand? Everything you do. In the early 1990s, Bill Clinton invited a young female staffer to his hotel room at the Excelsior Hotel in Little Rock, dropped his pants and said, it. As CEO of an organization, Bill Clinton had a young female intern just months out of her teens, perform oral sex on him while he made business calls. That girl name was Monica Lewinsky. ...","post_message":""},{"comment_id":"1174568802605235","commenter_b":"They are not Isis,just Philly scumbags ,perpetrating a fraud. shoot them violent criminals have no place on our planet","commenter_a":"We are at war people. It's gonna be us or them, I'm stocking up, bigtime.","post_message":"In Philly,  this group of MUSLIM thugs ATTACK patrons and yell \"We Belong To ISIS\"  Obama has imported over 1 million muslims since he became president... 'FUNDAMENTALLY TRANSFORMING AMERICA!'  Let's GET 5000 SHARES if we should BAN Muslim Immigration!"},{"comment_id":"10154324969511729","commenter_b":"How are they terrorists again ? Becus your tv said so ? They were where they shouldn't have been ...if Iran had war ships on the American shores America would nuke that country please stop with that bull shit all of a sudden people care for their army but when they come back broke homeless and jobless no one bats an eye no one takes time out of their lives to do shit about it no one protests to get them help ...so please shut the fuck Up with this false emotion","commenter_a":"A real president would have removed any hope of sanctions relief upon hearing reports that a terrorist regime had abducted any of our service personnel and had a carrier group steaming its way to the gulf with an ultimatum that those sailors be released immediately or else. But instead we get incompetent pandering from Lurch and Oblivious.","post_message":"Quite possibly the most ludicrous thing yet we've heard from this White House..."},{"comment_id":"10153150995326051","commenter_b":"You see how gay women are not fully gay . They still want dick !!!","commenter_a":"Is it a dildo? I'm not clicking I want to guess","post_message":"The police here had seen a lot of strange things before, but even they had never witnessed something quite like this."}]
