[{"comment_id":"10154542886848984","commenter_b":"And Whoopie Goldberg and all those cackling The View women!!! BYE FLEICIA!!! Lol","commenter_a":"Gotta go with Ted on this one, but he left off Kanye West off his list. Maybe when West leaves the country, he'll take the Kardoucheians with him.","post_message":"Rock legend and conservative firebrand Ted Nugent has released his 20 reasons to vote for Donald J. Trump, and they've gone viral. No wonder. Look at what he's saying here.  Finally someone will tell the blunt truth about Trump versus the establishment. You've gotta love this!"},{"comment_id":"10153823979101107","commenter_b":"And then Hillary would be the next POTUS.","commenter_a":"Rand can still be nominated by the libertarian party and would be a viable third party to trump and Hillary...he could take at least 20 percent from the GOP and DEM... The sore loser laws in many states shouldn't apply to him because he dropped out after Iowa","post_message":"\"Sen. Rand Paul (R-Ky.) has put a hold on the plan, with the intention to protect the Constitution, American taxpayers, businesses, and the nation’s economic health by blocking these dubious treaties.\""},{"comment_id":"1238390432847651","commenter_b":"Shut up Head","commenter_a":"THE FACTS ABOUT MUSLIMS ------ MUSLIMS are not here to assimilate. Muslims have NEVER assimilated to any society. ... THEY COME TO: ... * Force THEIR\" traditions, beliefs & political system upon us. * Delete our Traditions, Beliefs, religions & political systems. TECHNICALLY SPEAKING: Islam is NOT a religion. Islam is a \"political ideology/government\" hell bent on erasing all OTHER religions & ruling the world. Islam is hell on Earth... Eradicate this so called religion. SPREAD THE WORD, COPY & PASTE!!","post_message":"Seven civilians, including three women and a child, have been beheaded by suspected ISIS-linked militants in southern Afghanistan."},{"comment_id":"10152955044437293","commenter_b":"The evangelical pastors insist that only God can change the climate and that is an affront to God to claim that Man can do so. The ideologues constantly scream that the scientists, left-wing and Al Gore are in a conspiracy to 'steal our liberty.' using climate change to bring about global government. --- BTW. I am GOP and have been for decades. I also listen to Rush Limbaugh and Mark Levin, but unlike --- what is the word? sheeple? --- I don't check my brain at the door and believe everything I am told, like someon who listens to that \"lamestream media.\" --- As for today's GOP, it is nothing like the one that Reagan led. He would not have tried to squash any talk about climate change, prevent any reference to it in schools, or cut funding for research into what is happening in our climate. But that is ...","commenter_a":"The deniers have wax in their ears and a blindfold over their eyes--because they prefer to think that their ideology or religion is under attack by all of this (and are encouraged by the oil and coal companies to believe just that).","post_message":"And scientists are concerned."},{"comment_id":"10153310022881051","commenter_b":"Why is this vermin still alive?","commenter_a":"Blow him off the face of this Gods earth!","post_message":"Al Qaeda's leader just called for a 'lone wolf' terror attack on the United States - and that's not even the worst thing he said. (via VICE News)"},{"comment_id":"681700478660950","commenter_b":"My life","commenter_a":"@username you","post_message":""},{"comment_id":"10153437491481130","commenter_b":"Arrogant bitch","commenter_a":"Hilary is a dumb lying bitch!!","post_message":"Sick burn, Hillary Clinton!  Video: NowThis"}]
