[{"comment_id":"10154562004884749","commenter_b":"How do you know it's a woman. Would she/he submit to a dope test?","commenter_a":"So she wears a body suit and that makes her special. I think not.","post_message":"She didn't win her race, but she did make history."},{"comment_id":"10152536717736680","commenter_b":"Stop marriages of terrorists n force","commenter_a":"Speaking out against, or killing? Those are two very different things.","post_message":"From POLITICO Magazine: Police risk their lives in service. Does that mean we shouldn’t speak out against them?"},{"comment_id":"1514959711853944","commenter_b":"This reminded me of The Series of Unfortunate Events .... But this way wayyy cuter","commenter_a":"Alicia Thomas","post_message":"This is so cute!"},{"comment_id":"1678495722420749","commenter_b":"She's a POS!","commenter_a":"Um Killery! Benghazi is in Libya!!! You are responsible (Culpable) for 4 Americans dying needlessly over there on September 11 2012! You are a Lying POS!","post_message":"Hillary Clinton did not mention the four Americans who were killed in the Sept. 11, 2012 terror attack in Benghazi."},{"comment_id":"10153817603534497","commenter_b":"Feminism isn't a hate group.... lol Some feminists are cunts, but you can find cunts in every group of people","commenter_a":"That sad moment that a funny article about the majority of TV shows predictably lacking in certain areas turns into a feminist women hate spree. Need for feminism reconfirmed.","post_message":" part of my brain will just be switched off."},{"comment_id":"10153254996144099","commenter_b":"Darlene is just another brainwashed white women who think all blacks are \"misunderstood\"","commenter_a":"with all the training they get they can not subdue a guy with a hammer???","post_message":"UPDATE: Police and multiple sources initially said the man was dead, though authorities later said he was hospitalized in extremely critical condition.  #BREAKING: Hammer-wielding suspect shot dead after trying to hit officer, police say @webpagelink"},{"comment_id":"1179483682071660","commenter_b":"And what is going to stop the criminals from getting guns????? All a gun ban would do is disarm us everyday, good citizens who want to protect ourselves from THE CRIMINALS with guns!!!!!!!","commenter_a":"Stop protecting guns over people. The NRA is laughing at you people every time you defend a gun over a life.","post_message":"A gunman opened fire on a reporter and cameraman during a live television broadcast in rural Virginia."}]
