[{"comment_id":"1196992380374839","commenter_b":"Too bad all his accusers wernt nasty enough!!! .lmao...","commenter_a":"Not going to happen!","post_message":"We're in Raleigh, North Carolina where Elizabeth Warren is campaigning for Hillary Clinton. @webpagelink"},{"comment_id":"10153670710614255","commenter_b":"Nitwit with not very many followers - whew!","commenter_a":"Check the 14th Amendment Mike - you are dead wrong.","post_message":"Facepalm."},{"comment_id":"10154101943008984","commenter_b":"@username , Why do you people who support only Trump find it necessary To call people names simply because they don't agree with you? Are you that insecure?","commenter_a":"Now do not get me wrong! I am for Trump 100%, think he'll be awesome BUT leave George W. Bush out of it! Take it out on Jeb because he deserves it but I don't think George does, at all!","post_message":"Donald J. Trump railed against George W. Bush for 9/11 at the last GOP debate. It got messy, and now \"W\" has responded like only he could..."},{"comment_id":"10155425708285354","commenter_b":"this.mother.fucker.die.when.does.it.end.helloooooo","commenter_a":"Clearly seeking a larger selection pool for White House jobs.","post_message":"Take a look at the rap sheets of the 22 convicted criminals Obama just pardoned..."},{"comment_id":"895085380544226","commenter_b":"she shouldn't be driving on suspended license and the police where doing there jobs","commenter_a":"go back to where you blong","post_message":"(Video) If she wins, it will place Sharia law above our own and above the safety of police officers.  It wouldn't be the first time this part of Michigan has seen Sharia law placed above the law of the land....  @webpagelink"},{"comment_id":"10154553649688812","commenter_b":"This is getting ridiculous... Killing them is not necessary..","commenter_a":"As for sending these animals to zoos sanctuaries, etc. That would be the best solution, but those places have limited space and resources. Sometimes there just isn't any option.","post_message":"Colorado officials euthanize baby deer that was picked up by people who likely mistakenly thought it had been abandoned."},{"comment_id":"833697490010213","commenter_b":"All babies are precious I guess your mother didn't think like you or you wouldn't be here idiot","commenter_a":"How but killing the mother so she can't have anymore kids","post_message":"How many of you would have been aborted under this perverted logic?"}]
