[{"comment_id":"557960721079763","commenter_b":"Put it in her butt and see if she still complains about size","commenter_a":"😂😂😂😂","post_message":"Size clearly matters to this girl! #WSHH"},{"comment_id":"997888900251582","commenter_b":"this lady is crazzy.","commenter_a":"The Amerikan Taliban.","post_message":"Hey you! You should go to church every Sunday! And the government should require it. Because America and morals and stuff."},{"comment_id":"1708394149424069","commenter_b":"@username these people spoke in opposition to Trump's Muslim ban by indicating that Muslims are not all terrorists just like all Republicans are not all terrorists. By the way you know the US will never enforce a religious test for immigration NOR will be build a big beautiful wall....that Mexico will pay for :)","commenter_a":"What a wonderfully empathetic understanding and patriotic party the GOP followers now seem to be..to actually disparage this woman is one of the worst things ever...what in the hell is the matter with ALL of these inhuman people?","post_message":"The mother of a service member asked Mike Pence why he continues to stand by Donald J. Trump after his comments about the Khan family.   Many Trump supporters at the rally did not take kindly to her question.  Coverage: @webpagelink"},{"comment_id":"611768719013707","commenter_b":"She's a piece of shit black bitch. That's all","commenter_a":"The Bitch is an idiot!!!!! Ignore her!!!","post_message":"Michelle Obama is trying to close all American museums for this absurd reason.  She is a racist. This is complete madness.  Do you think Michelle Obama is out of her mind?"},{"comment_id":"10152835488861051","commenter_b":"What a bitch","commenter_a":"What kind of a person hurts an old lady. Hope she is sued . She needs jail time","post_message":"This 71-year-old woman tried to park in a handicap spot in the Walmart parking lot. That's when all hell broke loose."},{"comment_id":"676190932571485","commenter_b":"She needs to be committed to a psychiatric ward for life","commenter_a":"OH Puke.","post_message":"Rosie O’Donnell wants to go head to head with Trump by wiping this on peoples' faces.  This is absolutely ridiculous. She should be ashamed of herself.  Do you think Rosie O’Donnell needs to keep her nose out of politics?"},{"comment_id":"926693817463797","commenter_b":"Fuck u bitch","commenter_a":"Good :) anything to make more conservatives whine and bitch like the petulant children they are.","post_message":"This is just plain sad..."}]
