[{"comment_id":"545790502236393","commenter_b":"Liberals are NOT PRO ABORTION! WE ARE ANTI RELIGIOUS FANATICS THINKING THEY CAN RULE OUR BODIES! We are also pro families once children are born. We are anti poverty and anti starving and neglected children. We are as los anti ignorance!","commenter_a":"You will Never be president of my country. Nor will you ever dictate what I can or cannot do with my body. You creep.","post_message":"Really? He thinks that alienating 51% of the registered voters in this country is the way to get elected?"},{"comment_id":"1139418446080798","commenter_b":"Cruz, your are lying conniving little bitch! Trump 2016","commenter_a":"Cruz is full of S&$t, they did not VOTE for him or anyone else. They were not allowed to vote.","post_message":"\"Donald Trump 65,000 people voted in the state of Colorado. They just didn’t vote for you. They voted for our campaign. Or to put it more simply, Donald Trump, it ain’t stealing when the voters vote against you.\""},{"comment_id":"10153476921072217","commenter_b":"^^ dumb feminist","commenter_a":"Merge the competitions. Let's throw them all together and give them all a shot at the big bucks!! You'd be lucky to see any women get past the first round. Different competitions = different money! Dry your eyes ladies 😬👍🏼","post_message":"\"Sport is not like most of the industries the rest of us work in.\" 🎾"},{"comment_id":"10152756329021615","commenter_b":"I hope she was telling him to go home!!!","commenter_a":"For sure","post_message":"This video showing a mother slapping her son during the Baltimore riots is going viral...we're hearing what the police commissioner has to say about it now on Channel 11 Morning News.  SEE FULL VIDEO: @webpagelink LATEST: @webpagelink"},{"comment_id":"10154253853418967","commenter_b":"The only reason I stay on with these garbage gawker pages is to see the awesome Hogan memes.","commenter_a":"One Hulkamania isn't enough, Gawk ?","post_message":"The absurdity of Charles Harder threats should not distract from the underlying mission of the man who pays him: To intimidate Gawker and its reporters from publishing true things about public figures."},{"comment_id":"1236561799702931","commenter_b":"No Samantha J Clifford The WAR has already been won. Satan and his followers those that follow unknowingly and those that follow blatantly have lost and satan God and us Christians KNOW this. There is NO HOPE without Christ.","commenter_a":"GOD is making gay marriage licenses invalid.","post_message":""},{"comment_id":"1311803105524589","commenter_b":"Bryan Gogg Citation? I didn't think so. The SS never comments on such things.","commenter_a":"I will not shed one tear for any faithless elector that ends up suffering grave consequences.","post_message":"This is about to be all over the news, folks."}]
