[{"comment_id":"854169234726517","commenter_b":"How about rapist?","commenter_a":"If trump is despicable, what does that make Hillary ?","post_message":"\"He’s just despicable,\" Letterman said, adding that Donald J. Trump may very well prove the saying that \"anyone can grow up to be president.\""},{"comment_id":"10153431181609497","commenter_b":"Get rid of her for your own future. You can never be president if you only eat pizza.","commenter_a":"Dad's girlfriend orders pizza every night.","post_message":"\"One time, she even let us get cheesy bread and watch an R-rated movie.\""},{"comment_id":"10153223168071509","commenter_b":"The Christ is real but Roman Catholicsm is a Pagan Religion I think","commenter_a":"Hopefully they are totally different from the other out of touch cardinals we now have .","post_message":"For the second time during his papacy, Pope Francis has announced a new group of bishops and archbishops set to become cardinals -- and they come from all over the world. @webpagelink"},{"comment_id":"10154292908136545","commenter_b":"That claim was bogus. She was an angry girl out to get him. There was supposedly proof of that.","commenter_a":"Seriously??!!! Pray he's ok. He needs to be in protective custody until game time","post_message":"JUST IN: Frisco police confirm Ezekiel Elliott was involved in a minor car crash near #Cowboys practice facility. No injuries were reported.   MORE: @webpagelink"},{"comment_id":"607613792773547","commenter_b":"If this does not touch your heart nothing will amen","commenter_a":"Get that rotten PIG .","post_message":"FALLEN - NOT FORGOTTEN: The community is gathering for a vigil honoring two fallen heroes - Master Sgt. Debra Clayton of Orlando PD and Deputy Norm Lewis of the Orange County Sheriff's Office.  Meanwhile, the search for Markeith Lloyd continues: @webpagelink"},{"comment_id":"10155108703501320","commenter_b":"Take a good look at the non Christians. What ever you do this the least of theas you do to me","commenter_a":"No one, has the right to decide about the live of a anborn child. Every one has the right to live and be loved","post_message":"WATCH LIVE: We're at the The March for Life where thousands of anti-abortion activists are marching on Washington."},{"comment_id":"1180631801992422","commenter_b":"THE wall is necessary","commenter_a":"Hell no!!! I don't want to see a big freakin wall between my state (Texas) and Mexico (with whom we've been friendly for a LONG time). Way to go, Trump...maybe you can start a war with Mexico 😠 Brilliant!","post_message":"Agree or disagree: It's time to build Trump's wall at the border."}]
