[{"comment_id":"10154002938919749","commenter_b":"Cindy Rhodes go do one stupid cow feminists are scum","commenter_a":"If your still hung up on feminism within the uk and the us then you need to develop your personality. Not your discrimination skills.","post_message":""},{"comment_id":"1010697719021125","commenter_b":"It must be true, it's on Facebook, Melanie. Facebook!","commenter_a":"Chris this was an op ed piece in a psych journal and not scientifically tested - don't tell me not to hug my dogs!😉","post_message":"Noooooo"},{"comment_id":"10154239643734411","commenter_b":"Evil Bitch","commenter_a":"That last one killed me, oh man","post_message":""},{"comment_id":"10154233423376179","commenter_b":"@username - He wants an empire. Fascism 101 lesson, from 1947: @webpagelink","commenter_a":"Wow, another white man! What could possibly be up with that?","post_message":"Trump #SCOTUS nominee revealed"},{"comment_id":"891987007503062","commenter_b":"Death row for that bitch!","commenter_a":"DEATH!!!!!!!!!!","post_message":"The trial has finally started for this officer, after witnesses say they saw him pull out a knife and slit the dog's throat open, even though the dog was already restrained.  If you were the judge in this case, what would you sentence him to?"},{"comment_id":"10154164608531438","commenter_b":"Can masculine looking lesbians use the bathroom in your world Dina? Doesn't sound so.","commenter_a":"I think this is a positive thing, but most people I've talked to that oppose that bathroom scenario is not from the perspective of the transgender, but from what harm could come from people abusing that system to gain access to bathrooms they wouldn't normally have access to. If there was a way to guarantee kids and women's and men's safety in the bathrooms, then I don't think people would mind..regardless, we should be teaching both genders to not be dick holes to other people, regardless of what bathroom they most identify with.","post_message":"This moving ad on transgender bathroom rights will air for Fox News viewers during the final night of the Republican National Convention."},{"comment_id":"1104831912912258","commenter_b":"Muslims are scum!","commenter_a":"Check google about this. On site it says mother told husband to hit 10 year old if she denied her husband sex. Under Yemeni law this is not rape, wife's duty. Most sickening nationality. Her own family says face up to her duty and honour families commitment, don't shame her family. One girl 10 years old got away, went to court and filed for divorce. She won, husband was not prosecuted for raping a child, he was paid $200.00 compensation. Many of these kids die from bleeding to death from sex or during child birth.","post_message":"Why isn't Barrack Hussein Obama talking about this???!!"}]
