[{"comment_id":"816614281820679","commenter_b":"You have got to be kidding 49. Unbelievable! Evil surely takes its toll. She looks horrible. I am older than her!","commenter_a":"Can you believe the skanky crack whore, also known as KellyAnne Conway, is only 49? She looks like she is late 60's or early 70's... This is the toll that selling your soul to the devil will take on you!","post_message":"She did sell her soul to the Devil, after all."},{"comment_id":"1074511882569822","commenter_b":"You cared enough to comment","commenter_a":"Needlessly inflammatory and untrue. Time to unlike.","post_message":"Nearly a century later, Einstein has been proved wrong."},{"comment_id":"846040542099954","commenter_b":"Women may not want to watch porn but they will read it all day long.","commenter_a":"Much truth to what is said in this article, having said that, it's all about the dollar, always the dollar.","post_message":"“Fifty Shades” isn’t harmless. It is actively poisonous. Toxic. A putrid lump of nothingness.\" - Matt Walsh"},{"comment_id":"10153220731196234","commenter_b":"She should be fired and thrown in jail","commenter_a":"Should have had her license taken away!","post_message":"The nurse who re-used syringes for the flu vaccine at a West Windsor company has agreed to a temporary suspension of her license."},{"comment_id":"1011526468943605","commenter_b":"That's what professional political tumors do!","commenter_a":"Good. Cruz wasn't there for Kim Davis. Ted was there for political purposes.","post_message":"Ted Cruz tried to get on the stage with Kim Davis in Kentucky ... only to be blocked by an event staffer."},{"comment_id":"608860039265106","commenter_b":"@username Beautiful? NO!! She's SICK!!","commenter_a":"So real girls will have their dreams of becoming prom queen crushed because this school will more than likely give the award to a man in a dress just so the school can appear to be progressive.","post_message":"\"I'm not going to let anyone discourage me from being who I am.\" 18-year-old Dakota is one of four finalists running for prom queen her Portage, Indiana high school. The transgender teen is becoming an unlikely hero for some."},{"comment_id":"10152979977382293","commenter_b":"go to hell sodomites","commenter_a":"Some will look at this map and say that the majority of the world has become enlightened. Others will look and say that Africa, the ME and the other countries in tan and brown are the righteous ones with their religious views. I think the map speaks for itself. Homosexuality is here to stay and someone needs to tell some of these countries what century they are living in. Killing people for being gay is a sick understanding of a religion.","post_message":"Many countries still punish homosexual acts with prison time, torture and even death."}]
