[{"comment_id":"1249235748461513","commenter_b":"Hillary laughed after getting a child Racist off with 2 months served !!!","commenter_a":"In 1978, Bill Clinton violently raped Juanita Broaddrick in a Little Rock, Arkansas, hotel room, then, as he was leaving, looked at her bloody lip and said: \"Better put some ice on that. Corroborated by five contemporaneous witnesses Knowing full well about Bill Clinton proclivity to sexually assault women, about three weeks after that rape, Hillary Clinton cornered Broaddrick at a party and said, pointedly, just want you to know how much Bill and I appreciate the things you do for him. Do you understand? Everything you do. In the early 1990s, Bill Clinton invited a young female staffer to his hotel room at the Excelsior Hotel in Little Rock, dropped his pants and said, it. As CEO of an organization, Bill Clinton had a young female intern just months out of her teens, perform oral sex on him while he made business calls. That girl name was Monica Lewinsky. ...","post_message":""},{"comment_id":"1589593461282497","commenter_b":"What a dork...........","commenter_a":"This guy is putting himself in the same catagory as Trump when he talks this way about anyone. He could have made his point without all the cursing.","post_message":"The very end is the best part.  Thanks to The Liberal Redneck. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1026093827483671","commenter_b":"Build big beautiful wall and put it inside Trump's Ass.","commenter_a":"Good idea!!!","post_message":"They recognize the danger that Trump poses to our nation."},{"comment_id":"10153738267915575","commenter_b":"Who cares about Christians,the Muslims are under stress .fix it now","commenter_a":"Same rules should apply to all. It's a work place. Screw their constant demands. Suck it up.","post_message":"Sharia Fail"},{"comment_id":"1712281645723927","commenter_b":"Ash Jesus another self righteous know it all illegal immigrant go back to your country bitch this is my country not yours","commenter_a":"Makes me laugh that those who are here \"legally\" think they are any better than those who cross the border. Yes deport those with criminal record, but why throw out hard working folks like my parents who come here for a better life and contribute to this country. They also pay their taxes. People screaming out CRIMINALS to immigrants as if US citizens weren't criminals. Instead of complaining about immigration, perhaps you should demand the government to stop exploiting other countries' resources and their people. Bring down your ignorance and arrogance down a notch. Seriously, who do you all think you are? When you die and rot in your tomb, you won't be needing your \"citizenship\".","post_message":"Do you agree or disagree with the majority of Americans on this?"},{"comment_id":"10153923340133635","commenter_b":"Vicki C: So true re immigrants across the border. They caused more than half our hospitals and emergency rooms to close in Los Angeles years ago!!! Now, it's difficult for REAL Americans to get care when they require it. Just disgusting! Add to that, the planeloads of moozies Ovomit has been bringing in for years and I'm surprised any healthcare is available at all! Even our Vets can't get care and they should be first!","commenter_a":"Border Patrol Agent Defies “Gag Order” to Expose Obama The massive exodus of illegals crossing over into Texas and other border states is becoming more than local communities can handle. This influx of illegal immigration is causing emergency shelters, areas typically designated for use during catastrophes, to overflow, leaving local government scratching their heads as to what to do with immigrants who have no place to go and can’t be deported back to their home country.... Border Patrol agent Hector Garcia accused the Obama administration of “aiding, abetting and facilitating the smuggling of illegal aliens across the border.” In an interview with CNN, Garza said the current influx of illegal immigrants is “organized” and “orchestrated” by the drug cartels. Additionally, he said the federal government is giving illegal immigrants a “free pass.” He said the feds are using the equivalent of the honor system in asking illegal immigrants to later ...","post_message":"#1 Republican President Teddy Roosevelt was also a proponent of eugenics theories by Planned Parenthood founder Margaret Sanger"},{"comment_id":"10154425900258366","commenter_b":"There is no wall","commenter_a":"Who f****** cares. Now it will be a party. They're gonna roast him like never before.","post_message":"BREAKING: President Trump has officially announced that he will not attend this year's White House Correspondents' Dinner."}]
