[{"comment_id":"10153880843542293","commenter_b":"Really? Because people can remember actual facts that happened 15 years ago. Right.","commenter_a":"@username you were right!","post_message":"New details emerge about Omar Mateen, including his strange reaction to 9/11."},{"comment_id":"647476645408815","commenter_b":"Please don't get me started on this WITCH","commenter_a":"HAHAHA Hillary blasts Trump for being a parent! Trump went to Scotland to support his son for building the golf course! He was being a father! Hillary is the one who can't handle business. She lost $6 billion on her watch.","post_message":"Hillary Clinton blasted Donald Trump, saying during this time the U.S. needs a leader that will \"put the interests of the American people ahead of their personal business interests.\" What do you think about this?"},{"comment_id":"1277154398974272","commenter_b":"How does she keep getting elected ??","commenter_a":"Liberal Ass Clown","post_message":"Remember that time Nancy Pelosi reassured us that Obamacare was going to be \"affordable?\""},{"comment_id":"1259153044105704","commenter_b":"You could try this? :) @webpagelink","commenter_a":"Judy Acres too bad we can't watch this :( UK only","post_message":"Absolutely spectacular footage from the BBC's latest nature documentary, #thehunt. Honestly, some of these shots look almost too perfect to be real.  \"Witness a polar bear sneak up on its prey using ice holes to surprise it. This is the first time ever this has been captured on film.\"  You can watch on iPlayer here: bbc.in/1j0xI5B"},{"comment_id":"1007362382702564","commenter_b":"That's uncle Ernie sitting on the eggs","commenter_a":"@username get off of here!","post_message":"ONE EGG IS HATCHING! Eaglet Watch 2016 continues as Harriet and her mate M15 wait for their two eaglets to hatch. One egg began to crack yesterday! Fingers crossed we get an eaglet today!   Once an eagle egg begins to crack, it can take 12 to 48 hours for the eaglet to fully hatch.   Live video: Southwest Florida Eagle Cam MORE: @webpagelink"},{"comment_id":"603381206519125","commenter_b":"Miley is a nasty skank!","commenter_a":"get rid of miley.","post_message":"Miley attacked Christian conservatives, but Bristol had an epic answer for her.  Good. We support Bristol 100%.  Is Bristol Palin a better role model than Miley?"},{"comment_id":"10153986219495950","commenter_b":"You must be getting paid a pretty penny, lady. #HillaryForPrison2016","commenter_a":"Wikileaks, Hitlery's thugs throwing bombs, stinking libtard filth?","post_message":"“I’m very excited to see Hillary become president,” gushed Natalie Portman."}]
