[{"comment_id":"10153773404108984","commenter_b":"You Gotta Love America !!! :) I Do !!!","commenter_a":"Go Obama.","post_message":"The head of the National Sheriff's Association just threw down and issued a blunt threat to Barack Obama. This cop isn't going to take Obama's anti-cop attitude any longer, and now he's going to do something about it. This is awesome."},{"comment_id":"431677547020539","commenter_b":"Filthy muslims ,deport or tag &bag'em .","commenter_a":"That is disgusting.","post_message":"This is disgusting — would YOU want to use a sink someone had washed their feet in?"},{"comment_id":"10157696214715603","commenter_b":"Lol @username not gonna happen","commenter_a":"Don't believe the media...Hillary's poll numbers are falling faster than Bill Clinton's pants in an Arkansas trailer park...","post_message":"Hillary Clinton forcefully challenged the FBI's new email inquiry Monday, declaring during a campaign rally in battleground Ohio, \"There's no case here.\""},{"comment_id":"805029612967642","commenter_b":"She knew and never said anything?? She's should be locked up smh","commenter_a":"So if she knew he scouted both places why didn't she report him?","post_message":"The gunman's wife said that he scouted both Pulse, the nightclub where the mass shooting took place, and Downtown Disney, recently renamed Disney Springs."},{"comment_id":"873720596067983","commenter_b":"Hey the Fuck out ugly bitch","commenter_a":"Good bye","post_message":"Well I guess she's going to say goodbye.  Will you happy to see her go?"},{"comment_id":"991088854247496","commenter_b":"It's about time we had somebody who will stand up and speak the truth!","commenter_a":"Who determines what is Polically Correct? The liberals trying to manage free speech.","post_message":"WATCH: The Donald gets into a heated exchanged with a member of the PC police at press conference."},{"comment_id":"10154088028351159","commenter_b":"I wouldn't trust her to clean my toilets !","commenter_a":"The same thing she did with Benghazi!","post_message":"In case you missed it..."}]
