[{"comment_id":"548856361983005","commenter_b":"Yes","commenter_a":"Yes","post_message":"The NFL, coaches, and fans are sick of him and his garbage. The league has had enough. Do you think Kaepernick should be ejected from the league?"},{"comment_id":"921197848005881","commenter_b":"Good Luck ! KILLARY sold out America to the highest bidders..several Muslim countries, big businesses, private persons gave millions to the made-up Clinton \"Foundation\". The Clintons PRIVATE SLUSH FUND. Only 10% is donated. KILLARY then sold 20% of America's uranium to Russia. OBUMMER Paid 400 Million to Iran in foreign currency , cash. That's not mentioning all the lies that has been told to the AMERICAN PEOPLE. The Democratic Party is now just socialists, communists. All of you need to see Clinton Cash. Many of top government positions or Muslims. If Hillary is the next POTUS, she'll be sending all of us a prayer rug, burqa's & hijab's for you female family members...now I expect you to call me a racist (against muslims) & bigot as that what you call anyone that disagrees..Pity for us all! 🇺🇸❤️🇺🇸❤️🇺🇸❤️","commenter_a":"With all the facts about this man being super unfit, I don't see how people still stand behind him. I guess they have no concerns for our future and the future of our children. If he gets elected I hope someone assassinate him.","post_message":"LOL! Spot on!  Made by Walt Handelsman, go give him a LIKE! Shared by Occupy Democrats."},{"comment_id":"1699015597030344","commenter_b":"A no vote IS a vote - for the candidate you least want.","commenter_a":"Adding or not adding the next Scalia to the Court seems like something that will have pretty wide implications for the next couple decades.","post_message":"\"I'm not interested anymore. I don't see any immediate, significant changes happening. I don't see voting as a means to an end.\""},{"comment_id":"10154562004884749","commenter_b":"How do you know it's a woman. Would she/he submit to a dope test?","commenter_a":"So she wears a body suit and that makes her special. I think not.","post_message":"She didn't win her race, but she did make history."},{"comment_id":"10153961213080579","commenter_b":"Right wing ammosexual Xtians kill more people in this country than Muslims.","commenter_a":"obama Will NOT FIGHT HIS BROTHER MUSLIMS.. BUT He WILL Help them.","post_message":"\"France is at war.\" French President Francois Hollande to Joint Session of Parliament.  Watch complete video here: @webpagelink"},{"comment_id":"947076032050956","commenter_b":"I agree @username. Just like the woman said about the women that doesn't help other women. Hillary thought that was cute.","commenter_a":"We need to come together against the Republican Establishment to deny Trump and Cruz of the nomination. Their strategy is despicable but simple, keep either candidate from garnering enough delegates and have a contested convention where they will steal the nomination from both men. We Trump and Cruz supporters are wanting an outsider to try to fix the corruption in the political parties and our government. We need to come together to deny the Establishment their strategy. In the meantime, have faith in both of our candidates....Trump and Cruz are both very smart men and understand exactly what the Establishmen plan is. I have hopes that within two to three weeks they will work out an agreement among themselves to make a clear pathway to victory for one of them...to help them do this we need to come together as conservatives who are sick and tired of the corruption and ...","post_message":"Shannon Bream here live from Detroit on the Fox News Facebook page! Hit 'subscribe' in the top right corner to make sure you catch all of our live videos. We'll talk to the moderators during tonight's #GOPDebate and you won't want to miss that!"},{"comment_id":"10154973344274166","commenter_b":"@username my daddy would never. Then again he's only had one wife and never talked about groping his children.","commenter_a":"They about to get cozy. He is so in lust with her.","post_message":"Here's a look at Pres. Trump and daughter Ivanka as they departed Washington unannounced to honor slain Navy SEAL Chief Petty Officer William \"Ryan\" Owens. Read more: @webpagelink"}]
