[{"comment_id":"10153541248725950","commenter_b":"Rape and borders. @webpagelink","commenter_a":"If it had been for Berniestan or Queen Hillary, then nobody would have noticed it and @username would not have written any articles on it.","post_message":"The Ohio University wall has been an outlet for free speech for more than 40 years. But some students say the latest Donald J. Trump-related message went too far, and they decided to do something about it:"},{"comment_id":"10153092087111438","commenter_b":"Ha! You said it before I finished my statement.","commenter_a":"It's very obvious what happened here, it has been right from the start. This plane was intentionally driven into the ground by one of the pilots on the plane. This was very clearly a suicide/mass murder. Sadly, this is not the first time a pilot on a major airline has done this either. We are going to need to start doing a FAR better job of digging deep into the backgrounds of the pilots that we entrust to fly our major airliners going forward now. Or, we are going to have to start piloting these planes remotely from the ground and only using on-board pilots as a back-up in case the remote piloting system fails for some reason.","post_message":"A bit of eerie evidence has turned up on the cockpit voice recorder from the Germanwings flight that crashed into the French Alps this week."},{"comment_id":"1676201889329258","commenter_b":"This is old news, these slimy pieces of shit should be behind bars!","commenter_a":"How is that a bombshell...? The whole thing was fishy from the beginning. It's like I fully expect more shit to come out about the Wall Street Bailout...","post_message":"They lied to us anyway."},{"comment_id":"10153907055674199","commenter_b":"She's a straight up hood rat.","commenter_a":"I normally don't comment on things like this, but she has to be very cold hearted to cheer the death of anyone. The actions of some do not represent all. #alllivesmatter","post_message":"\"This behavior is unacceptable & does not represent our brand's values & ethics. The franchisee has terminated the employee.\""},{"comment_id":"399694993488875","commenter_b":"You dumb fuck the president has nothing to do with gas prices.","commenter_a":"Ain't nobody complaining bout them gas prices though","post_message":"Ironically, Manning was imprisoned and nominated for the same act."},{"comment_id":"10150870773554999","commenter_b":"@username. And you vote for a killer and a rapist!","commenter_a":"It's become pure entertainment. At this point he's a side show. His numbers are falling. His lies are outright ridiculous. Enjoy that long, long vacation.","post_message":"Donald J. Trump is sticking to his style, even if it meant taking \"a very, very nice long vacation\" after Nov. 8."},{"comment_id":"10153727923344153","commenter_b":"Leave them where they are at!!! Fix their country!!! Build camps at their country, protect their country and teach them to protect themselves against their issues as we still have to learn to deal with ours and protect our people and shelter our vets and homeless and dude in 30 more years I better have my social security I put into that pot religiously for me not for them !!!!!!!","commenter_a":"I still feel the same way : JUST SAY NO TO SYRIAN \"MIGRANTS!!!!\"","post_message":"Has your opinion on taking in Syrian refugees changed since the Paris attacks?"}]
