[{"comment_id":"1559248597428498","commenter_b":"Trump is a friggen rapist!","commenter_a":"Donald Trump and Hillary Clinton walk in to a bar. Donald leans over, and with a smile on his face, says, \"The media is really tearing you apart for that Scandal.\" Hillary: \"You mean my lying about Benghazi?\" Trump: \"No, the other one.\" Hillary: \"You mean the massive voter fraud?\" Trump: \"No, the other one.\" Hillary: \"You mean the military not getting their votes counted?\" Trump: \"No, the other one.\" Hillary: \"Using my secret private server with classified material to Hide my Activities?\" Trump: \"No, the other one.\" Hillary: \"The NSA monitoring our phone calls, emails and everything Else?\" Trump: \"No, the other one.\" Hillary: \"Using the Clinton Foundation as a cover for tax evasion, Hiring Cronies, And taking bribes from foreign countries?\" Trump: \"No, the other one.\" Hillary: \"You mean the drones being operated in our own country without The Benefit of the law?\" Trump: \"No, the other one.\" ...","post_message":"A 36-foot model of Donald J. Trump holding Hillary Clinton's head was burned during annual bonfire celebrations in a British town."},{"comment_id":"1090355681009413","commenter_b":"IT'S CALLED CORPORATE WELFARE , and it's been going on for way tooooooo long , and it needs to STOP !!!!!!!!!!","commenter_a":"the republican way","post_message":"Congress continues to let billionaires slide and pats the back of the wealthy while every day Americans suffer. Sign your name to help raise the minimum wage →   @webpagelink  (Hat tip to The Other 98%"},{"comment_id":"10153273654150329","commenter_b":"I can't stand feminists.","commenter_a":"Feminist are so fucking annoying.","post_message":"\"Meghan Trainor needs to take a women's studies class at the Taylor Swift school for pop stars who can't feminist good.\""},{"comment_id":"1296306160407617","commenter_b":"I hope that VA dentist is in JAIL!","commenter_a":"No one at the VA loses a job; for any reason. The 2014 fudged wait list debacle resulted in no nurse or lying administrator losing a job or even pay. The VA is a corrupt leviathan in need of elimination. And with my first hand knowledge of the organization, I would put a bullet in my temple before becoming a patient in the system.","post_message":"Absolutely horrific! This department needs to be cleaned out top to bottom, and people need to be punished for letting things get this bad."},{"comment_id":"10153294058536336","commenter_b":"There was a lot of blood shed and that's why this is disrespectful to the country of the Red, white , and Blue","commenter_a":"An upside down flags indicates distress and with your country's (lack of) leadership.. You are in distress...","post_message":"Do you find PacSun's shirt that pictures an upside-down American flag disrespectful?"},{"comment_id":"10152983731016545","commenter_b":"Like all things. Just because it can be done, doesn't mean it should.","commenter_a":"What was he expecting? That's like going topless and wonder why people stare.. lol. People ask for attention only to flip once they get it.","post_message":"A Georgia man says he was harassed by police after openly carrying an AR-15 into an airport last week. Citizens are permitted to carry weapons in the open and public areas of the airport,  provided they do not move into the TSA-controlled secure areas of the airport property."},{"comment_id":"981019435266811","commenter_b":"she is an Idiot hussy","commenter_a":"That doesn't surprise me!","post_message":"This is SHOCKING!"}]
