[{"comment_id":"10154099091458984","commenter_b":"He is another politician and a big lier as well he cheated in the other debate with Ben Carson he will say anything to get a vote and he will owe a million favors for all the lobbyist sending him,all this money","commenter_a":"Why are people at war all the time with a Democrat or a republican let's change this to U.S. political leaders and vote for a person not a party. They always have to make people take sides and it needs to be changed.","post_message":"With the South Carolina primary right around the corner, Ted Cruz is doing his best to diminish Donald Trump's lead. Cruz's latest attack is getting a lot of attention, and it may cause some voters to ditch 'The Donald.'  Is Ted Cruz right about Donald Trump?"},{"comment_id":"533139670207659","commenter_b":"She can take her sorry ass over there and live bet they wouldn't let her stay long","commenter_a":"she is a complete WASTE AND NEEDS TO BE PUT IN JAIL ALONG WITH HER COHORTS..","post_message":"She is DELUSIONAL..."},{"comment_id":"10152996037727869","commenter_b":"Abortions are legal, fingerbanging little kids illegal. Change the law if you want to stop abortions and legalize kid screwing. Oh, but you have Christians like the Duggars fighting for you. Good luck with that. I'll pray that you elect pedophiles so you can pray away the sin and let the criminals walk around molesting new victims. Jesus forgives. but society should prosecute crimes. He admitted to committing CRIMES!","commenter_a":"you might wanna find out more about the Duggars before you endorsed supporting them today..this is why YOU WILL NOT BE PRESIDENT. america doesn't want a president who thinks sexual abuse of children is ok or normal.","post_message":"We’re headed into Memorial Day weekend.  That means more than just picnics and sales and the start of summer.  It’s a time to offer tribute, prayers and thanks to the heroic men and women of America’s military who for over two centuries have laid down their lives to protect our freedoms.    But we should also remember the many wounded warriors who survived the battles, but came home with deep and lasting scars.  They deserve the very best care we can give them.  Not only through the Veterans Administration, but through private aid groups, like K9s For Warriors.  It’s a non-profit group that provides service dogs to vets with PTSD, traumatic brain injuries and other disabilities, to help them return to civilian life with independence and dignity.  100 percent of individual donations go to the program.  And 95 percent of the service dogs they train are rescued from shelters.  So when you donate to them, you don’t just help a veteran, you save a dog, too. Talk about doubling your money!  To learn more, go online to K9sForWarriors.org."},{"comment_id":"1240263705993657","commenter_b":"@username Oh Dave, ad hominem?","commenter_a":"NBC's biased information. All gun injuries are required by law to be reported by Dr's and Hospitals. What is under reported is the number of fools believing NBC","post_message":"A researcher believes the number of unintentional deaths of children involving firearms may be under-reported. \"We make make it incredibly easy for anybody who wants a gun to get a gun. And, we don't store them safely,\" he said."},{"comment_id":"990898310953409","commenter_b":"\"Driving benzes with no benefits. Not bad huh, for some immigrants. Build your fences, we diggin tunnels. Can't you see we getting money up under you\"","commenter_a":"I don't know why they just don't put up No Trespassing signs and make it agasinst the law to cross the border, after all, it works so well for Gun Free Zones and keeping guns out of the hands of criminals..","post_message":"In response to a Senate inquiry on border security, the Department of Homeland Security recently revealed that 1,300 miles of the U.S.-Mexico border remains unprotected by a fence or some kind of barrier. The government has cobbled together various other types of fencing for border barriers — most of which are ineffective or hamper Border Patrol agents’ ability to spot illegal immigrants — to protect other areas.  @webpagelink"},{"comment_id":"10153387140986323","commenter_b":"How did the chicken cross the road? Roads, where we're going we don't need roads.","commenter_a":"Go Peter Rabbit!! (Y)","post_message":"Is this rabbit really scurrying across an avalanche?"},{"comment_id":"10153438263919087","commenter_b":"Lol what a pussy","commenter_a":"I a Democrat and everyone is making a big deal out of this. Give them their snacks and they will leave.","post_message":"Congresswoman Donna F. Edwards slammed the media for condemning activists protesting the deaths of unarmed black men at the hands of white police officers as “thugs, criminals and drug users” while \"a group of armed men illegally occupying a federal building have been referred to as an ‘armed militia,’ or simply ‘occupiers,’ as though that behavior is acceptable in a nation of laws.\""}]
