[{"comment_id":"495888253922598","commenter_b":"I don't know many people that leave the doors to their homes unlocked when they leave for the day, when they go to sleep at night or just go about living with their family and friends. Also I don't know anyone that does not ask guests to leave at some point after a visit. Additionally most people use common sense to screen individuals that enter their homes. If the individual being considered as a guest is affiliated with a suspect group we error in the side of caution to protect or family and do not invite that individual or their affiliated friends into our home. In comparison to legal and illegal immigration into the USA it seems like the Democrats are telling us to unlock your doors while you sleep, don't use the locks on your doors while you watch TV, and when you leave for the day leave your ...","commenter_a":"The parallel is Jews = Christians. Not hitler to trump. Hitler killed the Jews. Not the other way around. Radical Muslims are killing Christians and Americans. Get it ?","post_message":"It would not surprise me either! What I am seeing & hearing from around the country is disturbing. Time for us all to #MakeAmericaGreatAgain. Remember! We need to energize EVERYONE to get out and VOTE!#Trump2016"},{"comment_id":"10157618931615389","commenter_b":"And Hillary has never lied right? Are you serious right now? Hillary has been exposed for who she is and it's not looking good for her. For she is so squeaky clean, why does she keep hiding from the media? She is always at home resting. She used her position to grant favors to foreign governments and took millions from them when they abuse women. You are worried about Trump being exposed on that debate stage? What a joke!","commenter_a":"The snake oil salesman's chickens come home to roost Monday night. Hillary & moderators will quickly expose the lying fraud artist for the flip-flopping liberal he's always been.","post_message":"\"Because they can't attack him on policy, they try to make it personal. They appeal to the emotions and the sensitivities of not only the black community, but the foreigners and females.\"  Pastor Darrell Scott said the Democrats don't attack Donald J. Trump politically because personal attacks are \"all they have.\""},{"comment_id":"10157820905645389","commenter_b":"She can't be trusted","commenter_a":"God bless our first responders and their loved ones during this time of unspeakable tragedy. These premeditated murders were likely politically motivated acts of terrorism. This is the same stuff we saw when the American left attempted to impose their will on peace loving citizens through bombings, political assassinations, physical attacks on returning service members, and violent protests back during the 1960s. For those of us who were children at the time, watching this stuff on the nightly news became indelibly burned into our psyche. It was a scary time for our country. Terrorist groups like the Weather Underground were one of a number of groups that committed acts of terror against some of our most honored institutions. Bill Ayers was a member of the Weather Underground. The same Bill Ayers who was recently seen in attendance at a violent anti Trump protest in Chicago.which we now know via WikiLeaks ...","post_message":"\"Hillary Clinton has changed her story about the use of a private server so many times, how can you believe any of this?\" – Sean Hannity"},{"comment_id":"10153430098934342","commenter_b":"Lame","commenter_a":"Keep control of your dog. If your uncontrolled dog bites someone it is a felony.","post_message":"The dog darted between her owner's legs and out the door. Seconds later, the beloved pet was lying in a pool of blood."},{"comment_id":"10153216973363855","commenter_b":"Good let the idiots divorce","commenter_a":"overinflated sense of their own importance much? idiots","post_message":"Here's to a speedy divorce!"},{"comment_id":"1528246223862069","commenter_b":"@username Pink pussy bow","commenter_a":"I am so glad that someone finally said all of those things directly to her smug, lying, corrupt, evil face!!!! That was awesome! All of us \"deplorables\" wish we could have the opportunity to do exactly the same thing!","post_message":"A notable percentage of voters changed their mind on Trump's attitudes toward women after the latest scandal."},{"comment_id":"10153772364848132","commenter_b":"Such a strong woman...","commenter_a":"What a wonderful tribute to your husband this morning Kathie Lee... May God be with you and your family at this difficult time...","post_message":"This emotional tribute from Kathie Lee Gifford is so touching."}]
