[{"comment_id":"1195742003797367","commenter_b":"Nothing, they won't do anything to her. She is above the law.","commenter_a":"What difference does it make? It's only the law for everyone else, well non-liberals anyway.","post_message":"This literally just happened, folks!"},{"comment_id":"10153325376679091","commenter_b":"Send these terrorists back to where they came from","commenter_a":"Coming from the idiot that wants to let all these refugees into our country... pfffft","post_message":"\"Once again we have seen an outrageous attempt to terrorize innocent civilians... We send our deepest condolences, offered our full support to the French people\" - President Obama."},{"comment_id":"10153415357404486","commenter_b":"Deport illegals with a QUEER under each arm","commenter_a":"QUEERS WIN !","post_message":"The Supreme Court just changed everything - what do you think?"},{"comment_id":"10155087953524726","commenter_b":"wow. nice job ben, and that female twit is the typical young female know it all, what a fucking idiot, they actually think they have it all figured out.","commenter_a":"Ben Shapiro.... man, you're good.","post_message":"This is a must-watch."},{"comment_id":"10153050473569255","commenter_b":",,,a bit back he was sucking kochs and the bitch owes!","commenter_a":"And how much does Cruz personally have invested in Keystone?","post_message":"I do enjoy Senator Ted Cruz's consistency in fouling up his own party's messaging."},{"comment_id":"10152578962070736","commenter_b":"Women don't have penises.","commenter_a":"If this woman was so uncomfortable being in a locker room with a transgendered person, would she be just as uncomfortable being in the locker room with another female? Because that is essentially what she is complaining about.","post_message":"LGBT activists have applauded the gym's decision, saying the 'no judgment zone' promotes privacy and safety."},{"comment_id":"10153033146442439","commenter_b":"Sorry Drew but I've no interest in that racist bitch & her rantings! regardless of any 'truths' in there! She's fookin rancid and oozes hypocrisy!","commenter_a":"More hot action from pallywood Glen","post_message":"This is rich. You must watch this -- although we have seen it over and over and over again. Every Islamic attack has two prongs. The first is the violence and slaughter, the second is the propaganda of victimhood and chares of 'islamophobia', …"}]
