[{"comment_id":"10154038574341337","commenter_b":"Fuck, fuck, fuck a duck Screw a kangaroo Sixty-nine a porcupine And hope he blows you too....","commenter_a":"South Park did it best. See: Mystery of the Urinal Deuce","post_message":"MURDERED BY OBAMA? These Antonin Scalia conspiracy theories are insane..."},{"comment_id":"1234377609916581","commenter_b":"Euuuuuw you wouldn't bitch!!!!!!","commenter_a":"Shieeet om det här hade hänt... :S xD @username","post_message":"Just going to grab a nice handful of san - WHAT IS HAPPENING."},{"comment_id":"10153563758934607","commenter_b":"Are you a democrat? Yes you are. No thanks","commenter_a":"NO.. Cummings supports Clinton.. Anyone connected to her is a NO VOTE..","post_message":"Congressman Elijah Cummings, who announced Tuesday morning that he was backing Pugh, said she has a proven record of passing meaningful legislation not just in Annapolis but during her time on the Baltimore City Council."},{"comment_id":"980159212038244","commenter_b":"build a wall around this state.","commenter_a":"Hang the son of a B... Sheep F'r! Make an example of him!... we don't tolerate this crap in our Country!","post_message":"BREAKING: ISIS SUPPORTER Arrested In Michigan Before He Could Carry Out This Plan [Video]  “It is my dream to behead someone”"},{"comment_id":"10154169270413908","commenter_b":"Tony 'Osman' Andrews","commenter_a":"Ups, that was ,me...:)","post_message":"For those of you who are unaware of this observatory, it's captured some fascinating shots of unexplained aerial phenomena."},{"comment_id":"10154282425457439","commenter_b":"Pussy's","commenter_a":"They are clueless","post_message":"The Armenian and Greek genocide by the Muslim Turks is reason enough not to build such a mosque. And what makes these knuckleheaded officials so sure that the imam won't teach and preach jihad. The jihadic doctrine is a critical component of Islam."},{"comment_id":"10153035820806770","commenter_b":"she can't even lead her servants...","commenter_a":"now she wants to bring in people to vote for her......","post_message":"Democratic presidential candidate Hillary Clinton told “Face the Nation” host John Dickerson Sunday that she hopes the United States will “lead the world” and take in 65,000 Syrian refugees over the next year."}]
