[{"comment_id":"10153430639944255","commenter_b":"This woman wants us to return to the 1950s? I guess that means she's going to shut up and make me a sandwich.","commenter_a":"Around 70% of White America does not live in a diverse city as is, and this is the reason for so much suspicion about people of other races, and culture. I am not for this kind of self segregation, but at the same time I do not believe we should be about forcing people to live where they do not now live. Until we learn that people are people this will never change.","post_message":"Yes, this is a real post from a real elementary school teacher in Texas."},{"comment_id":"10154077757710575","commenter_b":"WOW WORLD LEADERS RATTLED BY TRUMP JUST LIKE THEY WERE WITH REAGAN I THINK IT'S A GOOD THING THEY ARE SHAKING IN THERE BOOTS NOW THE FOLKS THAT ARE ABLE TO WORK LET'S GET THEM OFF OUR DIME MAKE THEM WORK EVEN IF THEY STAY ON WELFARE LET'S MAKE THEN CLEAN THE STREETS WORK FOR THE MONEY","commenter_a":"world leaders have no respect for Obama.","post_message":"Obama wants to make headlines...  So he attacks Donald Trump while in Japan."},{"comment_id":"10152981477461717","commenter_b":"Sissy bitch is not a word used to just discriminate against gays. Sheesh. Stop trying to be a victim.","commenter_a":"Donald Trump for president! Fuck that sissy bitch Anderson.","post_message":""},{"comment_id":"10153249874686051","commenter_b":"Girl... You are so sooo wrong! I guess you think Hillary would have answered the question.. Lol","commenter_a":"Trump had NO intention of ever calling on this great reporter - his questions would have been too complicated for Trump to answer. Even later when the reporter comes back in after his \"time out\", Trump badgers him.","post_message":"Here's how Donald Trump responded when a reporter interrupted his press conference."},{"comment_id":"976551429087752","commenter_b":"She is a pathetic little girl who wants to be relevant. Too bad that will never happen.","commenter_a":"Who cares what she says????","post_message":"\"Pop-star' Calls Christians \"F*****g Insane\" and \"Conservative-A** MotherF****rs\"!"},{"comment_id":"1825652724337236","commenter_b":"Hillary's plan. More lies, more refugees, more illegals, more foreign enemy money for her favors and direct access to her etc more n more destruction of America. Bravo. TRUMPS PLAN Work with generals create plan within 30 days to defeat ISIS, Increase our military, increase our subs n ships by 350, raises for our military, 1200 more fighter aircraft, Securing our Mexican border, increase border patrol police, no more illegals, catch n release, vetting will be strict, restore our inner cities with jobs, 6 weeks maternity leave, deduct child care expenses n elderly that live in our homes, add incentives for employers t provide childcare, create new dependent savings plan, creating fair trade deals, tax reform and lower taxes for everyone and making corporate tax globally competitive, regulating reform for businesses and reviewing regulations that inhibit hiring in mining. He's for peace and us all banning together, Return our nation ...","commenter_a":"This man is a machine, he does like 16 events a day. If he works as President half as hard as he has campaigned he will be EXCELLENT!","post_message":"THANK YOU for your service and sacrifice, as well as your confidence in me to serve as Commander-in-Chief. #AmericaFirst!"},{"comment_id":"1114298202002104","commenter_b":"What do you mean? It's a horrible thing to say. But we have freedom of speech in this country. Her speech is protected by the constitution. She shouldn't get fired for it.","commenter_a":"So its only freedom of speech if it's against Republicans? If the Democrats played on a level field they would get destroyed even more!","post_message":"The director of a nonprofit agency who called Michelle Obama \"an ape in heels\" has been fired."}]
