[{"comment_id":"10153936558477144","commenter_b":"Oh for f* sake leave your vagina at the door please and REALLY look at her record.","commenter_a":"Clinton is a rich aristocrat white woman, check your privilege please, the only thing that she has in common with other women is a vagina. She was first lady, rising to power off her husband's victories she was lifted up to senator and paid well to do nothing, she then ran for President and lost to another man who then lifted her up to SoS, when she ran that office to the ground she left only to win by the efforts of the media and DNC who have a vested interest in seeing her high office. In doing so ruined the chances of America to regain control of our democracy.","post_message":"“That is how good you have to be if you’re a woman running for president. And she still might lose! To this, the least qualified candidate ever to lurch into the public spotlight and shit on Gold Star moms, while cradling Putin’s sweaty sack.\"- Samantha Bee"},{"comment_id":"10154592299555579","commenter_b":"this woman is about one thing only………money and power and fame………….she has sold her soul…...","commenter_a":"WATCH CSPAN!!","post_message":"Laura Ingraham says to \"all you boys with wounded feelings and bruised egos must honor your pledge to support Donald Trump now. Tonight.\" Watch full speech here: @webpagelink"},{"comment_id":"10153688828342014","commenter_b":"Is this a female prison?","commenter_a":"Enact everyone who knows our job, calls us all corrupt, tells us we're poorly trained, and blames us for the inmate's behavior in 5, 4, 3, 2, 1...","post_message":"ATTACKED: A PCSO officer is going to be OK after being violently attacked by two inmates STORY: @webpagelink"},{"comment_id":"10156742074775354","commenter_b":"the millennials need to really research socialism & check out the countries that have it now & they are worse off than ever ...want to wait in lines for food? be lucky to get a loaf of bread, some milk & maybe a little veggies or fruit...guess they would change their minds if they really knew what that would do to this country....jobs worse, financially drained families from such high taxation etc...healthcare would be ...forget it...more deaths ...socialism is plain & outright destruction & more misery than this country could stand....then we'd have bigger problems with the refugees forcing their crap down our throats...is that what you want you idiot millennials?","commenter_a":"This millenial would like to thoroughly dissociate himself with most of the rest of the generation.","post_message":"GENERATION SANTA CLAUS?"},{"comment_id":"10154233423376179","commenter_b":"@username - He wants an empire. Fascism 101 lesson, from 1947: @webpagelink","commenter_a":"Wow, another white man! What could possibly be up with that?","post_message":"Trump #SCOTUS nominee revealed"},{"comment_id":"10153469277832093","commenter_b":"You know right off the back it wasn't a girl bc the rims aren't scraped from the curb lol","commenter_a":"Jeffrey id say that his parking skills are top notch.","post_message":"File this under the 'smart criminals' tab. @webpagelink"},{"comment_id":"10152870861243837","commenter_b":"You guys are brainwashed.","commenter_a":"Shows were priorities are. You guys should some great stories about our fallen heroes soldiers and what the community is doing to help but let's trade BBQ ideas. But that's Florida for ya. I'm sooo happy I moved to TX were we are actually having memorials ,recreations, events, to show the generations what our soldiers went thru. Houses here show proudly displayed flags. Remember the fallen for if it wasn't for their sacrifice we wouldn't be the land of free.","post_message":"Tips for people looking to fire up the grill on Memorial Day @webpagelink"}]
