[{"comment_id":"10153439688411130","commenter_b":"You just got owned by said library bitch lol","commenter_a":"It's going to be called little Debbie","post_message":"YAY!"},{"comment_id":"10152820559047144","commenter_b":"To hell in a hand basket. The women will have to bale them out.","commenter_a":"Most of those pharma pain killers are just synthetic heroin.","post_message":"A recent study found heroin abuse was 19 times higher among people who had previously abused pain relievers."},{"comment_id":"1610722349214878","commenter_b":"wow beautiful.......","commenter_a":"Beautiful","post_message":"Wow. I've got chills.  God is so good."},{"comment_id":"10155598100226002","commenter_b":"Something white people started, after having intercourse with monkeys they would die from AIDS. Mosquitos was a bacteria form from their deceased corpes.","commenter_a":"Hmmmn,what's the next thing that will be killing us...SLEEP???????Always fear mongering and hysteria..","post_message":"Known to health experts as the most deadly animal on the planet, the minuscule mosquito, with its dreaded whine, is responsible for millions of deaths from multiple diseases each year."},{"comment_id":"10153245617818908","commenter_b":"So, let me get this straight, a man with his foreskin is unhygienic, but a woman with her parts all tucked away inside is hygienic? How does that logic make any sense? It's called basic hygiene practices. FYI, as men age (much older) their penis could fold inside of him and it will need pulled out to keep clean. This could be the issue your Family member was talking about. It's no different than when you wash your own genitals.","commenter_a":"I have 3 boys and all are circumcised. As a person that has family in the medical field it's for cleanliness when they get older. My mother worked in a nursing home and she has horror stories from having to bath uncircumcised men. It's gross not to be. Infection and bacterial growth is more common if the foreskin is still intact","post_message":"Why do Americans go out of their way to remove this part of human anatomy, when the rest of the world does not?"},{"comment_id":"1089996267688050","commenter_b":"A woman who is drugged won't remember being raped. Guess that makes it ok?","commenter_a":"at least we don't remember it","post_message":"Maybe that circumcision was a bad idea after all, huh?"},{"comment_id":"10154079684393812","commenter_b":"A bitter old lady move on. About as important as blm.... Next","commenter_a":"And I care what the stepsister of Ann Frank thinks????","post_message":"Anne Frank's stepsister: \"If Donald J. Trump became the next president of the U.S. it would be a complete disaster...I think [Trump] is acting like another Hitler by inciting racism.\""}]
