[{"comment_id":"807543922769518","commenter_b":"SHOWS HOW GHETTO AND STUPID SHE IS","commenter_a":"Uneducated today's schooling.","post_message":"Racist Black Girl Assaults White Students For Enslaving Her Ancestors [VIDEO].  This is unbelievable. Where's the media outrage?  Do you think this is a hate crime?"},{"comment_id":"1173282172788559","commenter_b":"Sick sick woman","commenter_a":"How evil can these people be","post_message":"Oh. My. Gosh. Things just got weird really quick. @webpagelink"},{"comment_id":"1793385047544902","commenter_b":"@webpagelink wrap.com/trumps-law-firm-won-firm-of-the-year-award-in-russia/","commenter_a":"How are we continuing to allow this to happen? How high a mountain of evidence must be built before someone in charge realizes something has to done to prevent his reign from commencing?","post_message":"You literally can't make this up..."},{"comment_id":"1004502652963001","commenter_b":"Better hope Hillary don't get to be President. This country will be a goner in 4 yrs. if she does.","commenter_a":"Oh, so Democrats are crossing over to vote for Trump. I see your game plan Dems. After Nov. gets here and if Trump is the nominee you all will turn around and vote Democrat.","post_message":"#FloridaPrimary"},{"comment_id":"175417336287166","commenter_b":"#ShesWithStupid","commenter_a":"Are so called democratic people stating that they only want decisions via a democratic process to agree with their views? Is the USA on the verge of Facism and is this coming from so called Democrats.","post_message":"Protesters gather in New York's Washington Square Park to rally against President Trump's policies. Watch on #FacebookLive."},{"comment_id":"10152760994092144","commenter_b":"That first comment wins stupid comment of the month on the internet. But you will call a cop who has a gun to save your sorry ass. You won't take any responsible actions to save yourself or family, but you will pay someone ELSE to put their life on the line to do it for you.","commenter_a":"Screw the nra.MELT THE GUNS!!!","post_message":"\"We're basically being forced to repeal these laws at gunpoint… Every local gun law must go!\""},{"comment_id":"10152869187276336","commenter_b":"Yes ... where ??...","commenter_a":"Islamic Cleric: \"Islam is Not a Religion of Peace!\" www,thetrumpet.me","post_message":"In Thursday’s Talking Points Memo, Bill O'Reilly asked: where is America's policy to fight the Islamic jihad?  Watch and weigh in: @webpagelink"}]
