[{"comment_id":"10153903054649753","commenter_b":"good ...she needs you to buy a ticket....unless she has already been forced to cancel all...","commenter_a":"of course she loves him....who ever heard of her before Blake....her new on tour being canceled for lack of sales suprise?????","post_message":"Blake Shelton started his 40th birthday celebrations with a cute note from Gwen Stefani. “Happy birthday to my favorite person I ever met @blakeshelton,” Stefani posted on Twitter. According to People, Stefani and Shelton’s PDA didn’t stop there. Stefani went on to share several messages to Shelton on Twitter and even changed her avatar to a photo of her country boyfriend. On Instagram, Stefani shared a photo of Shelton as a kid with the caption: “Happy birthday to @blakeshelton literally my... @webpagelink"},{"comment_id":"10154114787935329","commenter_b":"LOL Chad.... Mom I'd be so mad!!!","commenter_a":"Chad Stacy Mike Deb don't buy these for the girls!!","post_message":"\"Her butt-length hair is now chin length. I was lucky to save that much.\""},{"comment_id":"1714145238857650","commenter_b":"@username pull your head out of your buttocks. 99% of the terrorist are Muslim. Hillary wants to open up the flood gates so they can just stroll on in. Terrorism will be coming to America with them. Wake stupid!","commenter_a":"How about we stop all these moronic memes and make sure everyone is registered to vote, so he doesn't get elected!","post_message":"LOL! It's hard to disagree.  Image by Occupy Democrats, LIKE our page for more."},{"comment_id":"10154921930118690","commenter_b":"Karim Alyaa Dina","commenter_a":"Bal","post_message":"Integrating into a new country can be hard. That's why Horst Wenzel is teaching refugees the ins and outs of German dating culture."},{"comment_id":"10153950105412757","commenter_b":"Round them up and jail them. Find the illegals and deport them.","commenter_a":"Exterminate that vermin!","post_message":"Anti Trump showdown"},{"comment_id":"10153851827136336","commenter_b":"Deport. Muslin. And. Religion. Stop. Terrorist. America. Now","commenter_a":"Pretty sure there's a lot more than one already in the US.","post_message":"\"We know that ISIS is deliberately using the refugee crisis to insert fighters into Europe. Why wouldn't they do the same in the United States?\"  Tonight on \"The Kelly File,” Sen. Marco Rubio explained that if just one ISIS fighter manages to slip into the U.S. among the refugees, it's a big problem. @webpagelink"},{"comment_id":"1795749220655470","commenter_b":"The point is assult rifles are banned already....","commenter_a":"Too bad what you carried in Iraq was a selective fire M4, not a semi-auto ArmaLite rifle, you can't teach common sense, but you can at least know the difference between an Assault rifle and a AR-15","post_message":"I know assault rifles. I carried one in Iraq. They have no place on America's streets. #Orlando"}]
