[{"comment_id":"10153753535205695","commenter_b":"She should be impeached","commenter_a":"I don't think she should be jailed. They should just fire her.","post_message":"#BREAKING: Judge orders defiant Kentucky clerk to jail after she refuses to issue marriage licenses."},{"comment_id":"1811602825768086","commenter_b":"@username they voted for TRUMP because Hillary is lying criminal that should be locked up","commenter_a":"not surprising.... the KKK IS a dem organization so it makes perfect sense that they would be able to get the uniforms.","post_message":""},{"comment_id":"1405973546081315","commenter_b":"Trump by a Landslide","commenter_a":"and the subsidy goes up so the real cost is less. The cost of healthcare is going up for everybody for 25 yr and every yr so whats new here","post_message":"First, we were told we could keep our doctors, but that was a lie and now we discover that premiums will rise 25%..."},{"comment_id":"1051057634970056","commenter_b":"Poor woman","commenter_a":"Pro choice equals anti Christ. Stop having sex tie your tubes. No need to kill","post_message":"This is a win for women's reproductive rights."},{"comment_id":"10153320570936509","commenter_b":"The $2.1 billion isn't what I'm talking about...., keep reading.","commenter_a":"Tax break? He promised not to raise taxes on anyone making less than $250,000 then slams Obamacare down the throats of every American which is one of the largest tax increases in the history of our country aimed directly on the shoulders of the \"middleclass\".","post_message":"Many in the middle class, particularly the single and the elderly, won't see any tax breaks under Barack Obama's Middle Class Economics plan: @webpagelink"},{"comment_id":"1735699086698296","commenter_b":"HOW - F_N confused is she ---OMG.....totally the opposite.......","commenter_a":"\"Yes We Can\" :)","post_message":"\"'Diversity' has come to mean that you have to be accepting of every different thing but you cannot, in any way, celebrate a traditional viewpoint.\" – Mike Huckabee"},{"comment_id":"989615211072231","commenter_b":"Awesome","commenter_a":"WTG BOLTS! :-) :-)","post_message":"GO BOLTS! Tampa Bay Lightning wins Game 2 of the #StanleyCupFinal, ties series 1-1!   WOOOOOOO HOOOOO! Missed a moment? Check out the game details: @webpagelink"}]
