[{"comment_id":"1385834498103243","commenter_b":"Lmao!!!! BUSTED!!!","commenter_a":"TRUMP 2016. Only liberals make excuses for crime. You do the crime you do the time cause its that simple. Trumps the man thats gonna bring back real punishments for all these thugs than thinks they can mess with other folks belongings. Trumps the man thats gonna bring back real law n order and get our country built back up.","post_message":"The West, Texas, fertilizer plant blast killed 15 people and injured 160 others."},{"comment_id":"10154067221877464","commenter_b":"@username BUT OF COURSE YOU WOULD BRING UP CHILDREN..because you are filth. All Cruz people dumber than dirt.","commenter_a":"Keep on going Ted! The more you make Trump mad, the more likely it is you beat him.","post_message":"Read more: @webpagelink"},{"comment_id":"10153829711751523","commenter_b":"Eirik, shut up ya punk ass bitch","commenter_a":"I seen him, but I'm not saying nothing!!!!","post_message":"UPDATE: Donald Rozga has been found safe!"},{"comment_id":"10154689857838487","commenter_b":"What a complete idiot","commenter_a":"He gave his brain away, didn't he. That's got to be the reason. He was selfless and gave his brain away.","post_message":"Carson accused Kay of making him  bad guy, and asked Joe Scarborough, the show's host, to  her microphone off so I can talk."},{"comment_id":"1108095542598003","commenter_b":"@username please lady shut the hell up!","commenter_a":"O'Reilly won't stop spewing rubbish. He expected Obama to make same mistake like Bush and Blair by drafting thousands of troops to Syria like Iraq. If Obama has made that misstep, more than a thousand of finest American soldiers would have been killed there by now. Bill needs to be grateful to Obama by not being a blood thirst. There are more than 12,000 gun violence related death in America annually, he won't even address that. Funny old man!","post_message":"\"There's no question the Obama administration's greatest failure is allowing the Islamic terrorist group ISIS to run wild.\"  Bill O'Reilly criticized President Obama's response to the terror threat, adding he doesn't \"define the ISIS threat accurately.\""},{"comment_id":"1029260857170166","commenter_b":"What a crock of bull","commenter_a":"Because made in China is cheaper thanks to unions","post_message":"Financial setbacks hit the \"Made in America\" brand."},{"comment_id":"1757450071143314","commenter_b":"Get your foot off the furniture! What an embarrassment she is!!!","commenter_a":"Chewbacca!!!! Lol","post_message":"Are you proud to have Michelle Obama as America's First Lady?"}]
