[{"comment_id":"10153520854786519","commenter_b":"Religious fanatics are scarier than loudmouths like Trump . We don't need evangelical bigoted haters running our country.","commenter_a":"His campaign is using some of the same consultants for foreign policy as Hillary Clinton's campaign- now that is scary","post_message":"Ted Cruz never misses an opportunity to remind us it can always be worse..."},{"comment_id":"10154100013603598","commenter_b":"I have no more words to write about this witch","commenter_a":"Add murdering human life to the list of HER immorality!","post_message":"Hillary Clinton: An Unborn Child Just Hours Before Delivery Has No Constitutional Rights"},{"comment_id":"10153392413471748","commenter_b":"Abortion is safe cause ha aint getting in","commenter_a":"Historically, once extremism takes hold, it is very, VERY difficult to put the genie back into the bottle. As long as the extremists face no serious consequences, they will just get more and more radical in their pronouncements and actions. Only when there is a very strong backlash is there any chance of them backing down, as we saw when the anti-communist witch hunts were finally contained. But religious extremism like Huckabee's is much harder to deal with (as Goldwater presciently saw), because they regard all resistance as persecution and attacks by spiritual enemies. Sadly there is a chance, even if it is small at the moment, that America will ride the tiger of extremism to disaster. And unlike Germany after WW2, there would be unlikely to be any second chances, any opportunity for redemption, because a radical, apocalyptic, theocratic USA would almost certainly initiate WW3.","post_message":"Mike Huckabee thinks that as president, he could prevent literally all abortion."},{"comment_id":"10153397415338984","commenter_b":"Guess you are be careful about who you ask to suck your dick!","commenter_a":"Very old","post_message":"Watch what happens when this bully starts a fight with the wrong guy... he didn't see this coming.  The cameras caught this entire fight... Are you happy he got a giant slice of justice?"},{"comment_id":"730940317039149","commenter_b":"I agree this is by far the worst president ever as my father always said the day that America elects a Black President it will be the end of America's Freedom and safety and he was right Obama is a Muslim Terrorist and he had one plan and he's doing it we no longer are the Greatest Country in the world","commenter_a":"obama is muslim and islamic Copy and paste this on ALL muslim stories! Flood them with the truth! The Shoe Bomber was a Muslim The Beltway Snipers were Muslims The Fort Hood Shooter was a Muslim The underwear Bomber was a Muslim The U-S.S. Cole Bombers were Muslims The Madrid Train Bombers were Muslims The Bafi Nightclub Bombers were Muslims The London Subway Bombers were Muslims The Moscow Theatre Attackers were Muslims The Boston Marathon Bombers were Muslims The Pan-Am flight #93 Bombers were Muslims The Air France Entebbe Hijackers were Muslims The Iranian Embassy Takeover, was by Muslims The Beirut U.S. Embassy bombers were Muslims The Libyan U.S. Embassy Attack was by Musiims The Buenos Aires Suicide Bombers were Muslims The Israeli Olympic Team Attackers were Muslims The Kenyan U.S, Embassy Bombers were Muslims The Saudi, Khobar Towers Bombers were Muslims The Beirut Marine Barracks bombers were Muslims The ...","post_message":"Absolutely Sickening."},{"comment_id":"10153845298899753","commenter_b":"Can 't see what any young girl would see in that creep--what do they see in those guys?","commenter_a":"Doesn't this family have any self respect? Who really gives a crap?","post_message":"Do Kylie Jenner and Tyga have a sex tape to release? Although multiple reports have claimed the former pair starred in a series of explicit films before they split weeks ago, Kylie Jenner and Tyga weren’t planning to release one of their clips last month. Following a report earlier this week, which claimed Kylie Jenner and Tyga were about to become the next celebrity sex tape stars just last month, a second report has shot the idea down. According to a May 23 report by Gossip Cop, Kylie... @webpagelink"},{"comment_id":"1598931086790902","commenter_b":"The horrid hag hisses!","commenter_a":"The Blonde Deatheater attempted to weasel out of every single question. She couldn't even keep her lies straight (lies she was telling at the moment).","post_message":""}]
