[{"comment_id":"1139564849397858","commenter_b":"Well Brady, unfortunately they aren't going to kill poachers and they sure as hell aren't going to just up and kill buyers... So this is the next best thing.","commenter_a":"Science is kewl","post_message":"They plan to flood the market for rhino horn, selling the 3D printed version for 1/8th of the price of the real thing, and eventually force the poachers out of business"},{"comment_id":"10153337035811756","commenter_b":"I was watching a girls lacrosse match the other day and was puzzled as to why they weren't wearing more gear. Then I came to the realization by what was happening. Damn it, I just wanna see women knock the shit out of each other and get fucking pumped up.","commenter_a":"It's about time! Why do girls have to play softball instead of baseball in the first place? And while we're at it, why are girls expected to play that sissy version of lacrosse?","post_message":"“There would be nothing that would bring me back to softball because that’s not my love. Baseball’s my love.”"},{"comment_id":"10153273654150329","commenter_b":"I can't stand feminists.","commenter_a":"Feminist are so fucking annoying.","post_message":"\"Meghan Trainor needs to take a women's studies class at the Taylor Swift school for pop stars who can't feminist good.\""},{"comment_id":"1062158903821449","commenter_b":"And your a scrub. And Beyonce don't want no scrubs.","commenter_a":"Don't be scared of a bunch of freaking thugs, Beyonce is a thug herself .","post_message":"Tomi Lahren doubles down."},{"comment_id":"521579714699275","commenter_b":"She is like a pile of dung. Worthless!","commenter_a":"Yes","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way.  What a disgrace. She needs to deported to the Middle East.  Do you think Nicole Kidman is a sell out?"},{"comment_id":"10154539619803433","commenter_b":"he has never cared about facts, just rambles, surprised that so many people are taken in...oh wait many people were taken in by Hitler also, very similar","commenter_a":"Trump, pay attention; you are wrong!","post_message":"In an attempt to defend his recently linked offensive comments, Trump claimed Clinton laughed at a 12-year-old rape victim. False. @webpagelink"},{"comment_id":"10155382822311729","commenter_b":"Dumb ass","commenter_a":"What legacy?? Racial divide war on our police officers open our boarders to ever illegal and terrorist trillions of dollars in debt millions on vacations for him and his family no decent jobs no affordable healthcare despicable treatment of our military and veterans... shall I continue I say good riddance finally this country is going to get a leader who's for American and its people we have hope finally","post_message":"Yes."}]
