[{"comment_id":"897074360335805","commenter_b":"She is an creep and liar..NO FOR PRESIDENT..","commenter_a":"Treason :How about collecting those deleted e-mails .We know you can do it .Obama and few more need to go with her .Sheis not in the boat by herself .Communist","post_message":"Which Hillary Clinton scandal is bigger? Is it the one involving her likely illegal secreting and destruction of email records from her time as secretary of state, or is it the one involving the massive conflict of interest she wholeheartedly embraced by using her family’s nonprofit foundation to collect millions of dollars from foreign government donors — again, during her time as secretary of state? @webpagelink"},{"comment_id":"1364681343563732","commenter_b":"@username DA MAO POW!!!","commenter_a":"Kaaren Eric","post_message":"When a  meets a .   Check out more of our panda videos here: bbc.in/2hI4DPR"},{"comment_id":"10153333178554087","commenter_b":"Guess what Kerry illegals have no constitutional right to stay here either.","commenter_a":"Except for a little thing called the Constitution. And laws. I didn't notice the call to shut down churches after the white Christian kid walked into a black church and executed parishioners","post_message":"“Nobody wants to say this and nobody wants to shut down religious institutions or anything, but you know, you understand it, a lot of people understand it,\" Donald J. Trump told Sean Hannity. \"We’re going to have no choice. There's absolutely no choice.\""},{"comment_id":"10154757524712300","commenter_b":"booooooooooooohooooooooooooo","commenter_a":"Got eeeem","post_message":"Anti-Donald J. Trump protesters gather at Bayfront Park (may contain graphic language)"},{"comment_id":"238735813255041","commenter_b":"And to think....they probably had children","commenter_a":"When the defendants were acquitted and they were just sitting back in their chairs with cigars in their mouths and everyone was just congratulating them on beating the case they had no remorse for what they did and it's terrible how could you be ok with kidnapping a 14 year old and just dismantle his face and then dump his body in a swamp that was pure evil and hate they had in their souls to just do that to him it's sad.","post_message":"The story behind the photo that exposed racism in America and helped spark the Civil Rights Movement. @webpagelink"},{"comment_id":"10152849572156336","commenter_b":"Democrats have lost their minds .Send all illegals home.","commenter_a":"Ridiculous!","post_message":"Not only can illegal immigrants now pay in-state college tuition in at least 20 states, student activists and graduates of Smith College are actually raising money for a scholarship for undocumented students."},{"comment_id":"1256931770993517","commenter_b":"Shut-up... and please die!....","commenter_a":"No laws we have on the books would have prevented what happened.","post_message":"\"People on the No-Fly list can walk into a store and buy a gun. That is insane,\" the president said."}]
