[{"comment_id":"10154009646005695","commenter_b":"Add this to the list of reasons why #ChikFilA is so awesome","commenter_a":"That's bc CFL is a Christian company....no PB sandwiches....love it, gives u hope nation has not completely brought into 'crap on everybody while I make my millions' type of company.","post_message":"AWESOME! Volunteers delivered free sandwiches to first responders and victims of the storms."},{"comment_id":"1607872669509039","commenter_b":"All those white people in the crowd. Not enough Super predators. We need more super predators in the crowd please.","commenter_a":"killary for prison","post_message":""},{"comment_id":"515532941989754","commenter_b":"She so sickening","commenter_a":"And your high taxes and high minimum wage and Obamacare will put small businesses out of business so just stop. Americans can see through your BS .","post_message":"Hillary went off her rocker today. She is YELLING at voters. Very Bizarre."},{"comment_id":"603575639802390","commenter_b":"Dumb bitch but I completely understand there decision to shoot the Silverback.","commenter_a":"If you are such a negligent parent that you allow your 4 year old child to fall into the pen of a wild animal, you should have to descend into the pen yourself and fight the animal with your bare hands to show society that you are still fit to be a parent.","post_message":"The zoo's decision to kill a 17-year-old, critically endangered gorilla after a 4-year-old boy fell into the animal's habitat has sparked outrage."},{"comment_id":"723136044452880","commenter_b":"We've had enough of these bull Shite DEBATE CRAP!! Stop this insanity, who agreed to this shite?","commenter_a":"wont be watching","post_message":"The debate you can't miss.  Watch Thursday, March 3rd at 9p ET on Fox News Channel and stream live on foxnews.com."},{"comment_id":"10152843996092293","commenter_b":"White mid-western girls fall for it...talk to your daughters about that life...","commenter_a":"are they really women or","post_message":"The caption: \"chillin in the khilafah, lovin life\""},{"comment_id":"10153779454116336","commenter_b":"She's a snake!","commenter_a":"Shes all done for now, goodbye Hillary","post_message":"WATCH: Rep. Jim Jordan questioned Hillary Clinton on emails she sent regarding the motive for the #Benghazi attack.   “You tell the American people one thing. You tell your family an entirely different story,” he said."}]
