[{"comment_id":"10157180953385389","commenter_b":"she's a waste of skin!","commenter_a":"Oh, that was an Economic Speech. I did not hear anything of her plans for the economy but she was well studied on what she thought Donald J. Trump might do. Why will she not tell us her own plans?","post_message":""},{"comment_id":"1140721385968332","commenter_b":"I like her filthy mouth. Filthy mouths FTW!","commenter_a":"Hardly a roll model really. She's got a filthy mouth.","post_message":"\"We have to be a role model for these little girls, because who do they have? All they have, literally, is the Kardashians!\""},{"comment_id":"10153690862048812","commenter_b":"@username number 2 would be thugees not thugs","commenter_a":"Over rated NFL attention seeking drama thug using his kids for media attention.","post_message":"NFL star James Harrison strips his kids of their participation trophies. “These trophies will be given back until they EARN a real trophy.” @webpagelink"},{"comment_id":"1452387791451811","commenter_b":"until they bring in these terriosts refugees here watch diseases spread","commenter_a":"Not vaccinated your all welcome","post_message":"Antivaxxers, don't fuck this up for us."},{"comment_id":"528596753997571","commenter_b":"Yes the airline acted as they should have! If these people don't want to be put into ituations like this they should dress in such a way as not to bring question upon themselves. They should also understand the airlines concern where muslims are involved from prior experience. Personally, I think all illegals should be deported along with Obama!","commenter_a":"Yes. They've already proven they cannot b trusted","post_message":"These Muslims were thrown off the plane for this frightening reason.  It is always better to take necessary safety precautions.  Would you want them off your plane too?"},{"comment_id":"975168282518593","commenter_b":"Better be sure. Our us h hospital are not allowing this.....What. If. Patient wants non Islamic nurse. Because is this practice?","commenter_a":"STOP with the offending of muslims.....this is the United States of America...land of the free.... Who gives a crap if your offended....","post_message":"Whoa!"},{"comment_id":"535194776668815","commenter_b":"Enough reason to deny them into the USA!!!!","commenter_a":"Send them to the Obama White House when theyb return from vacation.","post_message":"***WARNING***"}]
