[{"comment_id":"1043755919078659","commenter_b":"White people...now hear this...You have no right to tell us black people, when, where, why, and most definitely how to protest anything at all. Besides, your ancestors brought us here, enslaved us here, discriminate us here, hang, and shoot us here...We're still trying to figure out why? 95% of the last 15 shootings since Kaepernick starting protesting, like many before, have been unarmed black males. He just started protesting 3-4 weeks ago. Do the math on that. There is an eradication of my people in progress. We're fed up. It won't be long before WE start shooting back. Bank on it","commenter_a":"322 white people killed by police this year vs 172 backs. How come the media doesn't report on those lives. Stop reporting 1/2 truths and creating race riots.","post_message":"Police confront protesters in Charlotte, N.C., who were demonstrating after police confirmed they'd shot and killed a man while seeking a different person.  FULL STORY: @webpagelink"},{"comment_id":"10153392650361536","commenter_b":"She will NEVER win the general. #NeverWithHer #BernieOrBust","commenter_a":"Hillary Clinton once again dominating the night showing that she is clearly more knowledgeable, articulate and experienced to be President and commander-in-chief. Ready or not, Madame President here she comes!!!","post_message":"Watch Sanders hit Clinton for her use of the term \"superpredator\" in 1996."},{"comment_id":"482294165294497","commenter_b":"Our home, our laws. Get out of our country!","commenter_a":"Kick islam out of America.","post_message":"First our schools, then our public areas, what's next?  'SHARE' this post, we have to let the nation know what the MSM won't.  Do you agree Shariah must be stopped?"},{"comment_id":"1233486323342287","commenter_b":"Would rather have this girl as president than hillary.","commenter_a":"As a tax payer I don't mind paying for something like that.....I can't be mad....","post_message":"This 4.95 GPA student revealed her status as undocumented immigrant during her graduation speech.  #MicBrights"},{"comment_id":"577625642398915","commenter_b":"I was going to say not everything you see/read on the internet is true- A very nice friend once told me that- so...where's the link to the factual article or video or actual statement? You can't believe it just because somebody posted it & made a meme out of it!!!😐","commenter_a":"At least at this election I will not be voting for a party that would take such a pledge and perhaps n ever will again.","post_message":"Republicans have been plotting to obstruct Pres. Obama since the day he took office, and now they have the audacity to ask for your vote this November.   Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154963330566509","commenter_b":"Not if we can help it....She is criminal","commenter_a":"Glad to see all the Democrat converts. Hillary will crush Trump in the general.","post_message":"The conservative columnist George Will is advocating that others do the same."},{"comment_id":"10153735094753701","commenter_b":"As long as he doesn't use it as a photo op","commenter_a":"Molly in case you wondered, he flew in on a plane THEN a helicopter. Lol","post_message":"President Obama is expected to land in Eugene a little before noon and then take a helicopter to Roseburg to meet privately with families of the #UCCShooting victims. He is not planning any public events."}]
