[{"comment_id":"10153843965931336","commenter_b":"Great va is screwed bc dc is so close no refugees should be allowed period","commenter_a":"Wow, it was 24 a few hours back. Looks like a rebellion.","post_message":"LATEST: 30 U.S. governors are now opposing or refusing to allow Syrian refugees into their states. @webpagelink"},{"comment_id":"557960721079763","commenter_b":"Put it in her butt and see if she still complains about size","commenter_a":"😂😂😂😂","post_message":"Size clearly matters to this girl! #WSHH"},{"comment_id":"10153170103931770","commenter_b":"She's improved at lying ! And she makes Barb not feel like such a hag.","commenter_a":"Crap","post_message":"Barbra Streisand said she thinks Hillary Clinton's campaign strategies have improved a lot over the last few months."},{"comment_id":"10153051145414094","commenter_b":"And if gun laws don't work, why have any safety laws? Should hardware stores sell nuclear material because the bad guys will get anyways? Should we not have traffic laws because the bad drivers will run a stop light anyways and crash into a school bus?","commenter_a":"While Republicans were defending the lack of sensible gun laws and calling this an \"accident\", the families and communities of this Church showed such dignity and Christian values by first saying that they forgive the shooter. They are such an amazing example and inspiration to this country. God bless them.","post_message":"Relatives of people killed in a shooting at a black church in Charleston, S.C., addressed the suspect in court Friday In an extraordinary display of grief and forgiveness."},{"comment_id":"10152904733026051","commenter_b":"I would love to get my hands on the bitch who wrote that! I'm very sorry that there are people out there like that.","commenter_a":"Key their car","post_message":"A woman asked her neighbor to please avoid parking in her handicap parking spot. This is the letter she got in response."},{"comment_id":"1067523319975236","commenter_b":"That must be beacause he dosent want to give his money away....she must have hit her face he self lol","commenter_a":"His family knew she was only with him for the money. She was a lesbian when they got married. I highly doubt he would be dumb enough to hit her where he left a mark. His other wife never accused him of this. How convenient he just did it when she is wanting a pay day to go back to get female lover","post_message":"Amber Heard kept her head high after filing a domestic violence restraining order against Johnny Depp."},{"comment_id":"1202278743181685","commenter_b":"Lots of estrogen.","commenter_a":"Causation or correlation? Lol","post_message":"Men Supporting Hillary Clinton Have Lower Testosterone"}]
