[{"comment_id":"10155618780610093","commenter_b":"Go stick your head back in the ground Anne...clearly you have failed to realize that unless ISIS is wiped out..they will not stop...period. And yes they want to strike us here. You want that? You rather they come here on our turf? Lady you better do a gut check and wake the hell up.","commenter_a":"Sorry but we should NOT have boots on the ground in Syria.","post_message":"\"It involved hand-to-hand combat, the jihadists tried to use women and children as human shields, and about a dozen jihadists were killed.\""},{"comment_id":"10152788579600736","commenter_b":"Yes, dumb ass lady","commenter_a":"Good!!! @username Kevin Heard","post_message":""},{"comment_id":"10153957571836336","commenter_b":"yep video that thieving skank so the whole world and any future possible employers can see that she is a totally untrustworthy pos","commenter_a":"hope she goes to prison!","post_message":"\"We got you on camera yesterday at Ralph's for $200, so just know that the cops are coming up here,\" Juana Martinez told the 19-year-old worker."},{"comment_id":"1187034151348219","commenter_b":"On the flip side the battle is going... ok ish","commenter_a":"\"Hold X to flip over\"","post_message":"Caption contest time! ~Josh"},{"comment_id":"942676889125393","commenter_b":"Is she ROYALTY ?","commenter_a":"How much did the vet charge?","post_message":"60-stone woman lifted out of her home by a crane in a SEVEN-HOUR emergency operation"},{"comment_id":"10153032834297452","commenter_b":"I was waiting for Hillary Clintons campaign team to do this, desperate move. The army rangers officially lead the way of u know what. Ooooo rah to the hoooo ya","commenter_a":"Well done!!","post_message":"U.S. Army Capt. Kristen Griest (left) and U.S. Army 1st Lt. Shaye Haver (right) will graduate Friday at Fort Benning, Georgia along with 94 men. They will be the first women to graduate from the Army's notoriously grueling Ranger School. @webpagelink  Griest said her successful completion of the two-month program shows that women \"can deal with the same stresses and training that men can.\""},{"comment_id":"1138545752861116","commenter_b":"Yes I want her and her friends out of my Country!","commenter_a":"They are lying liberals what you expect","post_message":""}]
