[{"comment_id":"1016134701742911","commenter_b":"@username OK as soon as I take mine out of a white woman's mouth","commenter_a":"I not very religious, but I stand with them. Obama will have you believe this country was found on Islam. I'm a proud American that enjoys the mention of God on my money, the pledge and so forth.","post_message":""},{"comment_id":"10153377171751320","commenter_b":"scumbag","commenter_a":"When he is in need, they should all turn their backs on him again,but for good. He stinks as a Mayor . 👎🏻","post_message":"ACTIONS SPEAK LOUDER THAN WORDS... NYPD Officer Brian Moore was shot in the head, killed in the line of duty and Mayor de Blasio was a no show at his death announcement. Click here to read why he said he wasn't there: @webpagelink"},{"comment_id":"10153835209313380","commenter_b":"Outstanding. Congratulations.","commenter_a":"CONGRATULATIONS","post_message":"Today, I want to recognize Commander Zeita Merchant as she relieves Capt. Ryan Manning as Commanding Officer of Marine Safety Unit Chicago. Zeita is a native of Jackson, MS, and a Tougaloo College graduate. She will be the first African-American female commanding officer in history to command a Coast Guard marine safety unit and the first female officer to command Marine Safety Unit Chicago. Marine Safety Unit Chicago comprises 52 active duty, reserve and civilian personnel. Marine Safety Unit Chicago’s area of responsibility includes a fleet of 266 vessels, 118 regulated waterfront facilities, Lake Michigan shorelines of Illinois and Indiana, as well as 186 miles of the Illinois River System segmented by seven locks and more than 250 bridges. Congratulations Zeita! We know you will continue to make us proud. #MississippiMade #MississippiSupports #MyMS02 #BGTMS02 #FeelGoodFriday"},{"comment_id":"10153263722107411","commenter_b":"Hold my dick!!","commenter_a":"Yea , meanwhile the murder capital award goes tooo","post_message":"THIS JUST IN: Mayor Rahm Emanuel is expected to introduce an ordinance that will raise the minimum age to purchase tobacco products from 18 to 21."},{"comment_id":"10153302851129087","commenter_b":"@username Medicare advantage.","commenter_a":"The ACA made billions in cuts to medicare.......","post_message":"\"[W]hy do Republican politicians keep bringing up the idea of cutting or eliminating Medicare, a losing proposition among every voting group, including Republicans?\""},{"comment_id":"1038558619518329","commenter_b":"How many more *illegal* guns are gonna kill people before you relize that if these people want guns, they'll get 'em... Illegal or not... #howmany","commenter_a":"There goes a wasted minute that I'll never get back.","post_message":"This video is packed with more celebrities than we could count — and they have one powerful message for the world."},{"comment_id":"848274368622676","commenter_b":"I tryed to watch it but everything else came up.... I agree with her 100% they are to demanding going into a new country.... You Muslims have good strong boy's ( can;t call them men chicken shits) send them back to fight you own war and not us !!!!!","commenter_a":"Makes me wonder what the hell is the matter with Islamic women? Can anyone answer why any women, with the way they are treated under Sharia, would want to be part of that? Disturbing","post_message":"OMG. If you only watch one video tonight, watch this Brit go off... on a Religion Of Peacer who told her to 'Shut Up!' This is an EPIC, unscripted, blast that you will probably love. @webpagelink"}]
