[{"comment_id":"1007061529350376","commenter_b":"Merry I'm very aware it won't be Carly. It's not time for a female President :-) No female running has the ability to do the job. They're both failures in their past jobs.","commenter_a":"The debate proved why we need a Republican President and not Hillary.","post_message":"If you watched yesterday’s debate, you know we can’t afford to have a Republican in the White House. Say you're with Hillary—add your name: @webpagelink"},{"comment_id":"1725002974382878","commenter_b":"Send this fool to the hangman to show that that USA won't put up with this crap, my husband post this","commenter_a":"obama 's sons if had them","post_message":"These disgusting Donald J. Trump-haters showed up to protest Trump as publicly and obscenely as possible.  And part of their protest was a SICK demonstration involving the American flag.  But before they could finish, they heard a voice give 1 order they never expected to hear..."},{"comment_id":"1693302644277794","commenter_b":"Great news. She does anything to get publicity","commenter_a":"Good the left wing nut.How does this broad even have a job?","post_message":"Melissa Harris-Perry is refusing to host her show this Saturday due to weeks of pre-emptions that she says has left her \"silenced.\""},{"comment_id":"10152892453289342","commenter_b":"Texans have had a better record than the cowgirls since they became a team up until the last 2 yrs.","commenter_a":"Come over to a winning team THE DALLAS COWBOYS!!!","post_message":"The greatest offensive player to ever wear a Texans uniform will play somewhere else next season.  The team has reportedly freed Andre Johnson up to pursue other options"},{"comment_id":"10156528431575354","commenter_b":"Screw her","commenter_a":"Boo-fucking-hoo! Lifes tough on EVERYBODY! And not everyone drives their car up on the sidewalk! Now the media will make her out to be the victim! Put her ass in prison and throw away the key!!","post_message":"Changed Name from ‘Lakeisha Holloway’ to ‘Paris Paradise Morton’…"},{"comment_id":"10153739704671051","commenter_b":"Dumb ass","commenter_a":"For recreational usage YES, only and dope does dope for no reason other than to escape reality. For MEDICAL use, HELL NO, it should be 100% illegal. BUT, that is not the real issue here..... the REAL issue is, THE LAW Follow it, or pay the price, SIMPLE","post_message":"Do you think marijuana usage should be illegal?"},{"comment_id":"10153179280538690","commenter_b":"Learn to convey your thoughts properly before getting all nationalistic. It makes you look even more ignorant than you already are for making such a bigoted comment.","commenter_a":"I think some American got fid up angry because some Muslim in America lived there got passport got education and freedom, then they turn back against Americans burning their flag and terrorizing people.","post_message":"Police have not yet given any possible motive for the attack. The hashtag #ChapelHillShooting  has gone viral, many of the tweets criticising the US and other Western media for not covering the shooting.   @webpagelink"}]
