[{"comment_id":"992882130761178","commenter_b":"#__ #__ #StopYazidiGenocide #StandforYazidiWomen","commenter_a":"@username: .","post_message":"A behind-the-scenes look at a historic night. hrc.io/269ym4J"},{"comment_id":"10152639430074071","commenter_b":"As a kid I really enjoyed the Daredevil movie. Watching it now... yeah lol. I do like the character though. I hope Netflix does it right :)","commenter_a":"Rodrigo Rubio Camara","post_message":"It's time to welcome him back."},{"comment_id":"10153445196113984","commenter_b":"She has no right to control any thing!","commenter_a":"Not only does she not have any class, she is ugly and gross! I do not care if she is republican or democrat she is just nasty!","post_message":"This has to be very embarrassing for the First Lady. Hopefully this doesn't make her try even harder to control Americans...  Do you think Michelle Obama as First Lady is bad for America?"},{"comment_id":"454038491472779","commenter_b":"What the Hell is wrong with this chick...one week she poses nude and another week she posts pic of her child, are we suppose to say which one we like better....you are a sad piece of work, girl","commenter_a":"Who cares????? Guess she wants him to be seen naked also. So popular for being nothings.","post_message":"Kim Kardashian West's newest snapshot of little Saint is a burst of son-shine!  (via Celebrity Baby Blog)"},{"comment_id":"10152997147654411","commenter_b":"All the western puppets are traitors,DIVIDING AND CONQUERING USING IMMIGRATION AS A TOOL TO PUT THERE SOCIALIST POLICIES THROUGH.","commenter_a":"wheres ya burka merkel,traitor bitch","post_message":"Angela Merkel has accused leaders of Pegida anti-Islamic movement, which is gaining popularity in Germany, of hijacking the slogan of 1989 Berlin Wall demonstrations,  sind das Volk ( are the people) for their xenophobic purposes."},{"comment_id":"10153759399624228","commenter_b":"Her point, Chad, is that it's not just Muslims who are terrorist. I'm not a supporter of Muslims and have my own views but you can't just pick and choose. If you're going to list terrorists, list them all. Not just a specific religious/culture type","commenter_a":"It's not just ISIS.","post_message":"They want all of us to become hostile"},{"comment_id":"1583527538618276","commenter_b":"Muslims please go back to your hell hole, you only make demands, cause problems , and bring terror","commenter_a":"You have freedom of religion in this country not freedom to shove your beliefs on others.","post_message":"They're not afraid of offending anyone, they stand behind their beliefs.  Do you agree with Lowes?"}]
