[{"comment_id":"460484767469658","commenter_b":"China dont want none!!!","commenter_a":"So we take warnings from communist?","post_message":"TRUMP WIN RATTLES CHINA"},{"comment_id":"10153420455089087","commenter_b":"Oh Brett. That's terrible. I am the wife Brett. I live in Texas, 10 generations next door to Mexico. Are there bad people there coming here? yes! Do we need immigration laws? yes! Will a wall stop it. No Brett. It wont matter how beautiful the wall is or how much it cost or who pays for it. Those drugs you smoke are going to make it here. Nothing you can do about it. The cartel will get immigrants and dope here. If anything there will be more killing and keeping that wall up is going to be draining on the economy. It's impossible.","commenter_a":"Trump's ability to showboat and boast out loud has a hypnotic impact on people who should know better. Please don't buy into Trumpmania.... he is all talk and I thought we were tired of that. You people have short memories. He was a full on liberal democrat just a few short years ago. Trump is telling you what you want to hear. He has no intentions of fulfilling these vocal obligations. It's all lip service and he will cater to his businesses before the people. Just because Bush isn't a loud mouth narcissist doesn't mean he can't get the job done. Trust me, you will never be so sick of anything as you will be of The Donald and his ego driven power play.","post_message":"“Donald I’ll take you on one-on-one in a debate, any time, any place,” Jeb Bush declared. “You name it and I’ll do it.”"},{"comment_id":"10153798584711350","commenter_b":"You need attention like that idiot cutting herself.","commenter_a":"She's trying to commit suicide by cutting her upper arm. She's an idiot. A bridge or high building is what she needs to do. Cutting her arm is just a cry for attention.","post_message":" a teenager is hard, school sucks, parents are lame but life has so much to give you.\""},{"comment_id":"657506131049235","commenter_b":"Hope she's being watched closely. It's a good bet she's surrounded by other like-minded people. It's women like her that become human bombs.","commenter_a":"Send her home","post_message":"What the mother of the Boston Bomber said after he got the death sentence is SICKENING!"},{"comment_id":"1119954238024715","commenter_b":"I'm for Trump! Politicians are afraid they will not get to keep lining their pockets if we vote OUT the good for nothing's. All they seem to do while in office is keep running for office. Raising taxes. They have good insurance. Do most of the people??They don't care about the American people! Let's get rid of them. Let's break up the good ol boys club!","commenter_a":"Trump Trump Trump! All the way!!!!!","post_message":""},{"comment_id":"958028154307215","commenter_b":"@username bitch!","commenter_a":"Does she realized she joined the military to defend the constitution....if she is that ashamed of America, she should request a dishonorable discharge.","post_message":"A sailor refused to stand for the National Anthem. She might be in big trouble over the protest. Should she be punished?"},{"comment_id":"10154548445633854","commenter_b":"OMG when will the lame lies end???? I'm highly offended that she thinks that we're ALL that stupid!!!!","commenter_a":"If she didn't remember taking required security training, how in the heck would she be able to know what (c) stood for? and how can she be qualified to be POTUS?","post_message":"She thought it had to do with alphabetizing emails. And she thinks she is fit to lead?! 😂"}]
