[{"comment_id":"741319736029564","commenter_b":"@username. That's ridiculous.","commenter_a":"It's just sad. Sad. You are more worried about getting the United States into a war than you are taking care of the people of your own state. @username - makes a great point why, why Tom do you keep opening yourself up to this and then turning around and bragging about Trump being as good as his word. That's worked well for this country so far hasn't it?","post_message":"The president said we were putting Iran on notice, and I'm glad to see he's as good as his word. Iran's ayatollahs will stop their provocations only if the U.S. shows strength and resolve. These sanctions are long overdue, and they're sending the right message to the regime in Tehran: Cease and desist immediately."},{"comment_id":"10150645509299999","commenter_b":"Apple should have made an iPhone 4C. Then all the women can just buy it. Problem solved.","commenter_a":"I visited China a couple of years ago and my guide, a 30 year old woman had written herself off already for ever finding love. She told me women in China look for the 4Cs: car, condo, credit, cash in a man. I laughed. But she wasn't joking...","post_message":"“Even though she’s a successful woman, she would come back home and be nothing in her mother’s eyes because she is a single woman.”"},{"comment_id":"10153672451109062","commenter_b":"He's a lady","commenter_a":"Michael Keaton was robbed!","post_message":"BEST ACTOR goes to Eddie Redmayne for \"The Theory of Everything.\" More: @webpagelink  Photo: Dan MacMedan, USA Today"},{"comment_id":"10155458393115389","commenter_b":"No, she sucks!","commenter_a":"This is a Tempest in a tea pot. Hillary Clinton will be the next president.","post_message":"Another bad week is shaping up for Hillary Clinton."},{"comment_id":"10153950458738690","commenter_b":"Actually another problem is that we have a long border with Afghanistan which is called Durand Line and Afghanistan does not accept it as an International Border and those terrorists move in between both countries and attack and then we blame to each others.","commenter_a":"This the same Pakistan my country Nigeria, training army to fight terrorism, have Pakistan already solved there Taliban terrorist? Terrorist are political party, negotiations is the solution to terrorism.","post_message":"At least 12 dead as suicide bomber on a motorbike crashes into government office."},{"comment_id":"10153592500342235","commenter_b":"Stepford wife! A woman with no dignity!","commenter_a":"Brave woman. ...","post_message":"This is sick."},{"comment_id":"10153618174361051","commenter_b":"America will pay. Cheaper to build wall than to keep paying for the illegals.","commenter_a":"There will only be a wall if the Donald pays for it,because Mexico says they will NOT pay for any wall!","post_message":"Donald Trump reiterated this week: If he becomes president, he's building a wall at the border. Would you be for or against the wall?"}]
