[{"comment_id":"10156235463225354","commenter_b":"Center right of what? The equator? He's a hair away from being a communist, if he's not already.","commenter_a":"If you aren't a conservative why are you s republican?what would be the difference between a democrat and republican.and ANYONE that votes for Obama is an extreme leftist period.","post_message":"What a guy!"},{"comment_id":"10154856564546438","commenter_b":"Fake IDs fake visas...so why are we sure illegals never voted?? Illegals pose threat because of how much they owe coyotes that families back in Mexico maybe threatened if they dont run drugs for cartels...Trump is right to close this border.","commenter_a":"Ooooo","post_message":"\"You notice the Republicans are not saying, 'Hey, those aren the facts,' or 'something has changed,' or 'he did all these other things afterward.' No, what they saying is, 'You don get to talk about that.'"},{"comment_id":"868659363156855","commenter_b":"You have never been raped!","commenter_a":"The allegations are a joke.","post_message":"Too much?  #GoldenGlobes"},{"comment_id":"10154413967139087","commenter_b":"The British started this mess, no one including the US wanted this \" trash of Europe so they found a desert to dump them in, let get along or die, who cares, why do we have to pay for these spoiled perpetual \" victims \"","commenter_a":"Israel will never be at peace, if they don't work for it. Sorry about the comparison but that sounds like something Hitler would do, obliterating a group of people to put your own. Have you ever heard about Divine intervention? God doesn't like when you prosecute His children.","post_message":"#BREAKING: The Israeli government says it plans to move forward with the construction of thousands of settlements in East Jerusalem despite a U.N. Security Council resolution demanding an end to settlements in the occupied territories."},{"comment_id":"920220598016177","commenter_b":"This is bull crap. The people who were slaves and all of their children are dead and gone. The country should have done more back in the 1860's and 1870's. That is when reparations should have been.","commenter_a":"Someone send this pandering jack wagon home please. He has done nothing but side with hate and strife, and stir the pot of social discord continually. Not a leader by any standard. Socialist poster child at best.","post_message":"What do you think of this?"},{"comment_id":"1513630462010754","commenter_b":"Be careful what you wish for; you might just get it.","commenter_a":"jijijiji....","post_message":""},{"comment_id":"10156217121965725","commenter_b":"@username, ur just a stupid liberal who wont open ur eyes... If u think Veterans get better treatment than these illegals ! You must be screwing one. Idiot","commenter_a":"America needs Trump for President !!!","post_message":"Notice that illegal immigrants will be given ObamaCare and free college tuition but nothing has been mentioned about our VETERANS #DemDebate"}]
