[{"comment_id":"969205239835501","commenter_b":"Karma ain't she a bitch!!!","commenter_a":"Karma is a bitch. Racism and bigotry are not signs of a patriotic, freedom loving American.","post_message":"The couple that hates together stays together, but their hypocrisy has finally come back to bite them."},{"comment_id":"10153680219934641","commenter_b":"Problem solved!","commenter_a":"I'd still like to know why they need to come HERE? It would be cheaper and safer to house and secure them over THERE. The need to vet them would be nearly eliminated, language issues would be non-existent, violence and criminal acts would be lessened, etc. We can't adequately provide for our nations homeless population as it is. We're going to bring in 10's of thousands of them from another country and shelter THEM, but leave our own (many of whom are veterans) out in the cold? (literally)","post_message":"\"If there's a rabid dog running around in your neighborhood, you're probably not going to assume something good about that dog,\" Dr. Ben Carson said Thursday, speaking about refugees. @webpagelink"},{"comment_id":"510973722424254","commenter_b":"Let's elect him and the boos will disappear, right along with all those illegals that are making the noise.","commenter_a":"Don't join conservative Tribune news bad to read","post_message":"Donald Trump handles this opposition like a CHAMP!!!"},{"comment_id":"10154306039388812","commenter_b":"How so @username, what was the childish remark. Do tell...","commenter_a":"This is awesome! Every child should have someone to tell them they're loved and accepted. Growing up is hard enough I can't imagine what transgender teens must go through everyday and I'm glad there are people willing to stand up for them and do the right thing.","post_message":"After an uphill battle involving protests and a petition, Wisconsin school will allow transgender high school student to run for Prom King: @webpagelink"},{"comment_id":"898756240177140","commenter_b":". . . and it's just going to get worse until we deport them all ! ! ! !","commenter_a":"LOL. LOL. These retarded Liberals! Can't we all just get along... you stupid liberals have brought this into our country... and now it will be like the middle east... Socialist DEMOCRATS SUCK!","post_message":"(Video) Is 2015 the year we see outright war between radical Muslims and Americans on our streets?  As exemplified by the actions of these Texans, Americans will push back against Islamization with highly provocative moves.   Will Obama be able to keep his jihadists in check until he declares Caliphate?  Read More + Video:  @webpagelink"},{"comment_id":"1050080195049016","commenter_b":"another dumb btch","commenter_a":"So Donald Trump you are not the savior we need for this country, I do not think you will bring jobs or prosperity when you do not even pay great wages for people that work for you. I think you are a disaster waiting to happen, you really belong in a reality series not president, I hope the people wake up before you end up our dictator","post_message":"ICYMI: Ivanka Trump took the stage in South Carolina and said, “My father is an incredibly hard worker and he’ll be working for each and every one of you.”   (CC: Donald J. Trump, Sean Hannity)"},{"comment_id":"10153598743328984","commenter_b":"We need a MUCH STRONGER policy for Illegals. These two should be Executed then they will not sneak back in the Country!","commenter_a":"Her family should sue the dept. Of immigration!","post_message":"While this 41-year-old grandmother and nurse slept in bed, she was tragically robbed of ever waking up. Our thoughts and prayers are with her family.   Do you think more needs to be done in the U.S. to prevent this from happening?"}]
