[{"comment_id":"800418456754419","commenter_b":"She shd be in jail","commenter_a":"Nobody in the GOP can't come to Hillary's standards, there is no comparison.. She is one smart and prepared capable Madam President!","post_message":"The #GOPDebate may have ended, but CNN’s Chris Moody is live, taking your questions from the post-debate spin room in Miami."},{"comment_id":"10154556187833089","commenter_b":"Be remember all of you the one who said refugees should be banned because one tree make million of million matchbox and matchbox born millions trees","commenter_a":"How sweet of him but he just had musks blown up!!!","post_message":"Trudeau says refugees are welcome in Canada"},{"comment_id":"419169165087070","commenter_b":"@username nobody wants your Ukranian ass here either. Plastic bitch.","commenter_a":"People with Green cards and visas are also being denied access. So don't tell me it's about \"coming here legally\" This is a hate based act. Period.","post_message":"This significance of the court's ruling and the power of protest cannot be overstated.  Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1613037799000233","commenter_b":"Thanks to Trump! He has successfully stirred up America. I'm still with Hillary Clinton!","commenter_a":"Ever since the election, the real closet racists have come out..","post_message":"A teacher shouted the N-word in the middle of class, stunning her eighth grade students. The video has millions of views and the teacher has since been fired. @webpagelink"},{"comment_id":"10154420350898797","commenter_b":"She dont need those racist mother f**ckers","commenter_a":"Beyoncé has a concert coming up in Florida. Guess what? I read not enough off duty Police want to work it. Karma be a beeoch.","post_message":"BEYONCE BOYCOTT: The police union deemed her performance - which included allusions to the Black Panthers, Black Lives Matter, and Malcolm X - \"antipolice.\""},{"comment_id":"672876839554418","commenter_b":"@username that's a stupid comment. Hillary supports killing Gods baby's.","commenter_a":"Hillary would throw her own daughter under the bus to save her own skin! America look out cause Russia is getting pissed at her and sees Hillary as Obama as a white woman.","post_message":"\"11% of the American people say that [Hillary Clinton]'s honest and trustworthy. To compare that, the same poll found that 14% of Americans believe in Bigfoot. Now that's what kind of trouble she's in.\" – Mike Huckabee"},{"comment_id":"10154420186151194","commenter_b":"Allah is shopping like à sodomized bitch right now","commenter_a":"who just saw that giant fuckin orb?","post_message":"LIVE: Anti-ISIS military op near Mosul, Iraq"}]
