[{"comment_id":"10152993326411336","commenter_b":"bahahaha hahaha........I love your comment....exactly","commenter_a":"So we agree....no gun is responsible for a crime.","post_message":"“No religion is responsible for terrorism. People are responsible for violence and terrorism.”  Moments ago, President Barack Obama delivered remarks at The White House Summit on Countering Violent Extremism. @webpagelink"},{"comment_id":"593124330856614","commenter_b":"@username where did she go?","commenter_a":"I hate Donald Trump, but these idiots are playing right into his rhetoric, and not doing anything but acting like thugs.","post_message":"Watch: Protesters set fire to a Donald J. Trump supporter's hat.  Read more about the San Jose assaults here: @webpagelink"},{"comment_id":"1683593111700811","commenter_b":"That's why they have a little pill now called Plan B...take that the day after you're raped if you can't stand to carry the baby and put it up for adoption to a family who doesn't care how the child was conceived! Abortions, especially late term abortions are cruel and inhumane!","commenter_a":"It's planned parent hood they do a lot more then abortions. And @username women chose well some prolly forced so @username women got knocked up because they didn't practice safe sex. I thought women wanted the right to chose what they do with there bodies planned parent hood also helps with women's health who can't afford insurance or hospitals the government cut there funding right? So how can they help these people and if they closed right now you don't think @username people won't find someone else to do abortions. I promise if there not smart enough to use protection and pph closed you would see a lot of dumb young women ending up in ER with a coat hanger hanging out of them. Americans are such pussies anymore of it is not your baby or body and you don't know the person making there chose mind your fucking business","post_message":"Ugh why?!"},{"comment_id":"967111676633636","commenter_b":"What a couple of dicks....","commenter_a":"Bigots.","post_message":"It's that important, huh?"},{"comment_id":"1137397219630950","commenter_b":"Hey Josh this chick is tripping. Lol","commenter_a":"#newyorkvalues","post_message":"“I don’t want money, I’m going to rape you.”"},{"comment_id":"10153274785312623","commenter_b":"I think they need counseling by Dr Phill.Hey people!Wake up!Want to be with the one you love?Renew your vows yearly.Want to have it both ways and live with guilt every day?Do not get married.","commenter_a":"It's like this.If you love each other.Fine.If you have the need to stray away from your soon to be spouse to hang out with the girls.Fine.But to be with somebody while you are married?Hey you are not fooling anybody but yourself.Either be married and be happy or go two different directions. I have been with my wife fronearly 20 years and have been through the best of times and the worst of times","post_message":"The wife of a Winston-Salem man arrested for bigamy is speaking out:"},{"comment_id":"10153134788679411","commenter_b":"Punk assed bitch!","commenter_a":"Blah! Blah! Blah!","post_message":""}]
