[{"comment_id":"1030656443730298","commenter_b":"\"Socialism never took root in America because the poor see themselves not as an exploited proletariat but as temporarily embarrassed millionaires.\" John Steinbeck","commenter_a":"Fight Bernie Fight for us all!!!!!! We need u!!!! The Dark Side of the Force will be strong with this administration.....","post_message":"Trump is assembling the wealthiest cabinet in history — so wealthy that its members have more money than the bottom 1/3 of American households combined. That does not sound like an \"anti-establishment\" administration to me."},{"comment_id":"10154641460388734","commenter_b":"Where there is smoke. There is fire. Only the individuals involved will ever know the truth.","commenter_a":"Hi Tony","post_message":"A woman accusing Republican Presidential nominee Donald Trump of ‘of victimizing her with inappropriate sexual conduct’ is speaking with the press for the first time."},{"comment_id":"10150668295129999","commenter_b":"She ugly","commenter_a":"Colleen Crann Generation Z is going to college.","post_message":"“In short, there’s a strong ‘you do you’ ethos among teens today.”"},{"comment_id":"1036956366325374","commenter_b":"Your mom is a joke.","commenter_a":"America the land of the free .. Your gun laws are a joke","post_message":"The first wolf spotted in the Grand Canyon for 70 years has been confirmed to have been shot dead."},{"comment_id":"10154380401494071","commenter_b":"Uh oh, there it is again \"Nasty woman\". But she is right.","commenter_a":"Hannity. Your rating might be high among poorly educated Trump supporters who love seeing you licking his butt.","post_message":"Sean Hannity railed against Joe Scarborough in defense of top Trump advisor, Stephen Miller."},{"comment_id":"10155251280330294","commenter_b":"The only thing \"frightening\" about this video is how butt ugly that lady is that get out of the car! Ha...","commenter_a":"There's 2 sides to every story...no other side could justify illicit behavior like that but what happened before the video started?","post_message":"\"Twice the lady tried to pass me on a two-lane road with double lines on a hill. She about ran me off-road first time.\"  Then- things take an even scarier turn, when the woman stops her vehicle, gets out and walks up to the car."},{"comment_id":"10154291680908701","commenter_b":"You're right. You're a white pig. ^^","commenter_a":"Your choices are, Trump, Hitlary, and everyone gets everything for free Sanders. We're screwed. No Trump isn't a racist.","post_message":"Donald J. Trump wins the Republican presidential primary in Washington, the Associated Press reports. MORE: @webpagelink"}]
