[{"comment_id":"1116556865104033","commenter_b":"ignorant bitch, we are ALL immigrants!!!! VOTE HER OUT & VOTE STRAIGHT BLUE, FEEL THE BERN!!!!!!!!!!!","commenter_a":"When is the last time the republicans filled a bill about anything that would benefit the American people? These fools are of limited intelligence to be sure. Please people vote Blue every chance you get.","post_message":"Republicans are now setting their sights on our librarians."},{"comment_id":"547039675478904","commenter_b":"trump is not going to build a wall or deport. sorry","commenter_a":"Make America great again build that wall","post_message":"\"I want America First - so do voters!\"  Hear from Donald J. Trump tonight on protesters, the Indiana primary and more at 10p ET. #Hannity @webpagelink"},{"comment_id":"10152738126476051","commenter_b":"What a dumb woman","commenter_a":"Just give her the money and don't accept any more invitations from her, damn !!!","post_message":"The woman who invoiced a 5-year-old for missing her child’s birthday party has a message for all the haters."},{"comment_id":"10154777446051336","commenter_b":"she's a prick","commenter_a":"It's disgusting Megan Kelly should shut up and be suspended with her biased comments shut her up! And stop playing Miley Cyrus music in the background! She said she is leaving if Trump wins. Bye Miley!","post_message":"\"The American people have spoken and the American people have elected their new champion.\"  Tonight, Vice President-Elect Mike Pence thanked the American people for his and Donald J. Trump's election victory, before introducing the President-Elect."},{"comment_id":"10155194763231178","commenter_b":"why r these liberal women ,so f-in ugly?","commenter_a":"Just another hypocrite.","post_message":"The New York Times reporter smeared the Tea Party as racist a few years ago.... now she's urging the left to start copying it."},{"comment_id":"10153580270695575","commenter_b":"If this is true, which I'm sure it is, how sick. But this is what the female liberals want. Oh is saying female liberals not PC?","commenter_a":"The Missing link!","post_message":"The Gateway Pundit - Muslim Dad Kills 4 Year-Old Daughter for Not Covering Her Head"},{"comment_id":"10155508321034778","commenter_b":"Round \"us\" up ans ship us out? Why would they round up and ship out legal immigrants or citizens?","commenter_a":"No. they are here to serve and protect us. Not round us up and ship us out. That's not part of their job. That's ICE's problem and a federal issue. They want people out then they can do it themselves.","post_message":"Should local police departments participate in immigration raids?  Explain why and your comment could be used on #OffScriptOn9 at 7 p.m.  Full story-->@webpagelink"}]
