[{"comment_id":"1334326533266897","commenter_b":"For the first time in American history a foreign hoe for first lady","commenter_a":"I wouldn't be Melania - even for a billion dollars!! I lived with a narcissist. She has my pity! I'm sure she is paid well to stay with him, and her frozen Botox face and designer wardrobe says it all.","post_message":"Politics aside, Melania Trump's modeled some winning looks on the campaign trail."},{"comment_id":"10153686958951028","commenter_b":"Not her? This is total and a unpleasant BS!!!","commenter_a":"Joseph & Christine wowwww","post_message":"Former professional wrestler Chyna has died at age 46, her manager confirmed to NBC4. @webpagelink"},{"comment_id":"10157276340925354","commenter_b":"Round up every muslim ship them home unless they are legal immigrants that speak english and have a job and no ties to isis otherwise build a wall shoot everyone of them that comes into the u s","commenter_a":"Vote Billary or Bernie for more lies, deceit, corruption,treason, gun control, Homophobia under Islam and 4 more years of obama. Almost forgot no more Country Girls having fun in the water. Cowboys, Liquor Stores, Smoking Marijuana are next. NOTE: Comments protected under the 1st Amendment.","post_message":"VIDEO:"},{"comment_id":"10154192129196176","commenter_b":"The average lifespan of a giraffe is 25 years","commenter_a":"I feel several brain cells dying from reading these comments.","post_message":"Baby watch! Do you think April the giraffe will give birth soon? All eyes have been on this sweetheart for a couple of days now. (Video courtesy: Animal Adventure Park in New York.)"},{"comment_id":"10154140456978256","commenter_b":"Sara Califf.....Illinois doesn't have a taxing problem... They have a spending problem.... Bloated government is Illinois problem.... Too bad the pensioners are the ones who will suffer","commenter_a":"Democrats need to raise taxes to keep Illinois, and Chicago government revenue stream to maintain the bloated government.... Probably need to build a wall around Illinois first, to keep resident's from leaving for other states","post_message":"Election-seeking Illinois Comptroller Leslie Geissler Munger plans to delay monthly paychecks for lawmakers and statewide officials, saying there isn't enough money to pay the state's bills and other services should go to the front of the line."},{"comment_id":"10153422129686636","commenter_b":"legal migrants not border jumping criminals","commenter_a":"Trump is a right wing extremist who perpetrates racial stereotypes about minorities to serve an agenda. Trump is an opportunistic bigot who has historically enjoyed good relations with Muslims but to become elected, he has jumped on the bandwagon of Islamaphobia. Attacking the Mexican community is also another opportunistic attempt to create hatred, division and anger. The most beautiful thing about America is its a nation of immigrants. A melting pot of many nationalities and a true leader would do everything in their power to unite all of us as opposed to dividing through religious and racial hatred.","post_message":"Well played, Canada"},{"comment_id":"886743024681887","commenter_b":"She dumb as hell she a pretry house but no one is home","commenter_a":"COMING UP NEXT..... - \"STACEY DASH\", \"APOLOGIZES!!!!\" (You SEE IT HAPPEN, All the time :\\\\ )","post_message":"Stacey Dash Believes Rape Victims Are Bad Girls Who Like To Be Naughty... @webpagelink"}]
