[{"comment_id":"1002700983109302","commenter_b":"Someone should ducktape her mouth","commenter_a":"Somehow, that doesn't look \"allegedly\".","post_message":"Woman facing animal cruelty charges after allegedly duct taping her dog’s mouth shut, then posting photos on Facebook: @webpagelink"},{"comment_id":"942747445773052","commenter_b":"BUTT UGLY !!! Just NASTY. Please Leave.","commenter_a":"Who cares if she leaves the country?","post_message":"If only...[Read Below]"},{"comment_id":"10154294125329614","commenter_b":"Just in case she was looking for fame .....","commenter_a":"If this is the only problem, what we face as a nation , we are doing great ;)","post_message":"KTLA meteorologist Liberte Chan and the morning news team address the dress moment from the show over the weekend that has gained national and international attention."},{"comment_id":"10154180124161770","commenter_b":"She is an evil witch who got away with murder.","commenter_a":"Poor baby dog","post_message":"The entire nation thought Casey Anthony murdered her daughter..."},{"comment_id":"948811408568971","commenter_b":"so far bro, all i am seeing from you is more words. do you ever do any thing but talk?","commenter_a":"Run for Congress","post_message":"Conservative Sheriff Promises  will fight for your rights.. I will die fighting for the Constitution!"},{"comment_id":"511818058979535","commenter_b":"Good they dont belong there. Its for shoppers and family time keep your zoo off all streets and malls! If black lives mattered so much to them why are they not stationed in the community?? #enoughalready","commenter_a":"They are a nuisance.","post_message":"The Mall of America is seeking a temporary restraining order that would bar the group from protesting. It also wants the group to post a message on social media saying the protest is cancelled."},{"comment_id":"10153868854236336","commenter_b":"Heck yeah","commenter_a":"It's OUR country. We don't have to agree. I'm sick of people like this telling other people to leave. You don't make the rules buddy.","post_message":"\"The silent majority has been silent way too long.\"  Harris County Sheriff Mike Jolley says he's proud to be political incorrect, and if you don't like it, you can leave his county. @webpagelink"}]
