[{"comment_id":"1082049255206943","commenter_b":"\"Claim to be Muslim\"??? Muslims marry 6 year old girls! Muslims think that women are 2nd class citizens! Muslims believe that women shouldn't be allowed to drive or leave the house alone! Muslims believe that the punishment for being gay is DEATH! Their culture and our culture can't coexist peacefully! Is there some part of that that you can't understand?!?!?!?","commenter_a":"It reminds me of Sodom and Gomorrah. The whole group would not allow the police to get to the BOY...What the fuck is wrong with these sick Bastards, that claim to be Muslim? Raping of young boys and girls is okay? I ned to re-read the Koran...","post_message":"Some of Obama's Muslim \"refugees\" were raping a 10-year-old boy when the cops were called.  The police arrived, but what they did once they got there has left the country furious.  It's time America learned the WHOLE truth..."},{"comment_id":"10154451547182144","commenter_b":"oh just shove a vagina in her mouth and shut her ignorant racist hate filled mouth up #sorryvaginas...but she loves to eat them","commenter_a":"what an idiot","post_message":"Dick Cheney's torture-loving daughter is back in Washingtonand she's very excited to help Donald Trump torture people."},{"comment_id":"10154692047301037","commenter_b":"Guess she can dress anyway she wants. Is that a big deal?????","commenter_a":"Hillary is on heroin!She wears long sleeves always even when its 95° out.And she fell out at the 9/11 memorial. And she'd have to be on heroin to put a U.S.Ambassador in a war zone with a couple of bodyguards. The last one he may have had some info that could get her convicted and that was a way to off him.","post_message":"“He has delusions—I’m not talking about being crazy, but for example when he told everybody he was very smart not to pay taxes, then denied he said it in front of a hundred million people.”"},{"comment_id":"1732269190330470","commenter_b":"Lol sure","commenter_a":"This just in, scientists baffled that the universe is not that old, may have been created by a a Supernatural being....\" I can't wait.","post_message":"The breakthrough could offer greater understanding of the Big Bang among other things. @webpagelink"},{"comment_id":"10153723751980667","commenter_b":"I wonder how many people actually read Hillary's dumped emails on wiki leak. I'd strongly encourage people to do their homework before voting for her. Be prepared for some stomach turning, treasonous info. #scary #makeamericagreat","commenter_a":"ROFLMAO. I'm thinking that kindergarten name-calling is *not* an effective general election strategy.","post_message":"\"She should get an award from them as the founder of ISIS,\" Trump said Wednesday."},{"comment_id":"1304804312923886","commenter_b":"Your kids would be better off in a Orphanage than with you..","commenter_a":"Lock them up","post_message":"They blazing new trails."},{"comment_id":"1345056415554103","commenter_b":"Parents fault? No, it was the sick pervert who raped her fault!!","commenter_a":"What the hell is a 13 year old child doing on a beach at 02 in the morning Even if her brother was with her The child should have been at her home in bed How could her brother let her out of site I just hope they will be able to catch the guy And made him pay for what he did to this young girl","post_message":"She lost her brother before she was attacked."}]
