[{"comment_id":"361328087404039","commenter_b":"She is worse than Holder . America keeps going down hill and it will get worse .","commenter_a":"Disgrace to America","post_message":"Squishy and Weak Senate Republicans Lead the Way in Confirming Loretta Lynch as Attorney General  Real Conservatives Outraged"},{"comment_id":"687362974730217","commenter_b":"It is spelled you're... You are. Your denotes ownership","commenter_a":"What! Let's see Hilary was a lawyer, First Lady, senator, Secretary of State, married to the president of the world and your comparing homes? YUP comical","post_message":"LOVE THIS!!!!"},{"comment_id":"10154363651421323","commenter_b":"Irony? He hasn't been right wing, he's been a German-Iranian guy.","commenter_a":"Irony A German born rightwing neo-nazi shots up the place wanting foreigners to get out! Online echo chamber immediately call him an Islamic terrorist immigrant","post_message":"The situation in Munich is still developing. This is what we know so far about the shooting."},{"comment_id":"997885863556217","commenter_b":"LOL -like a woman has time for that","commenter_a":"That was a woman who was all masked up","post_message":"The clinic staff say they aren't going anywhere"},{"comment_id":"883464781688982","commenter_b":"Research empathy Roger.. Apply it sometime.","commenter_a":"Just want to say that in your standup you talk a lot of trash about white people and shootings if I do recall correctly. So is racism just a white problem but black stand up comics are not. Check yourself before you tell me to check mine.","post_message":"It's not that easy to forget.  Do you think racism still exists? Let us know: @webpagelink"},{"comment_id":"1949307655356344","commenter_b":"Lies alternative facts deceitfulness racism and separation was exactly what Obama and the Democrats have done way before Trump was elected....that is why he won and until democrats realize it then Trump will get 8 years. I am a registered Democrat and I realized in this election just how racist lying criminals they are I voted for Trump and will give him a chance. I will never vote Democrat again as long as they keep doing what their doing by destroying this country","commenter_a":"I am not a Trump fan but I do believe in freedom of expression be it what it may We all have a right to voice our opinion and if she chose do it the way she did we all have to respect that America has always been great and Trump did not bring that greatness he has brought lies alternative facts deceitfulness racism and separation of a great country . I only hope that he is stopped before he deletes all the greatness in which this country was founded on","post_message":"24 Hours After The Grammys \"Make America Great Again\" Singer Posts Stunning News"},{"comment_id":"1127692307251779","commenter_b":"Fucking dumb bitch.","commenter_a":"Here we go again with the IFLS lies and propaganda","post_message":"The parents, who had chosen not to vaccinate their child, are “devastated” and have now had their younger daughter immunized as a result."}]
