[{"comment_id":"10153380578865950","commenter_b":"Maybe you're jealous, because you're a fat bitch.","commenter_a":"Well, considering Beyonce was involved, it was bull. I refused to watch it because of her and the song she was performing. Screw her and her terrible lyrics and slutty wardrobe/dancing. You're lucky Lady Gaga was there (never thought I'd say that...) to save the performance aspect. #nomorebeyonce #shesaterriblerolemodel #picksomeoneelsenexttime","post_message":"Compared to past Super Bowl halftime shows, this year's was relatively tame: no \"left sharks\" or wardrobe malfunctions here. Who was your favorite performer?"},{"comment_id":"437108856413709","commenter_b":"He will CERTAINLY BE BETTER THAN THE MORON IN THE WHITE HOUSE NOW!","commenter_a":"Agree","post_message":"\"I will be the greatest jobs president that God ever created\". Agree or disagree?"},{"comment_id":"1013388188713944","commenter_b":"All the illegals !!!","commenter_a":"All this happen cause of sin of Obama take our flight mh370 and keeping our passanger","post_message":"Will the blue helmets arrive to relocate tens of millions of Americans?"},{"comment_id":"10154878892083812","commenter_b":"GregOwens, @webpagelink","commenter_a":"That was just a typo. He didn't mean POTUS. He meant P.O.S.!","post_message":"Pres. Barack Obama in response to last night's presidential debate: \"Hillary Clinton went high and showed why she'll be a POTUS for all Americans.\" @webpagelink"},{"comment_id":"1056647814370639","commenter_b":"Let's be honest. HE is not confused. HE is still a MALE. And absolutely a disgrace.","commenter_a":"NO, are you kidding me?","post_message":"Do you agree with MAC's decision? Yes or no?"},{"comment_id":"10153708079877377","commenter_b":"How is Hillary going to debate? She can't even keep all her lies sorted out! Trump will wipe the floor with her!","commenter_a":"Hahahahaha...........2 points? In your dreams! The election is over. Trump has not a chance to win against Hillary. If Trump will show in the debate, Hillary will chop him into pieces. Trump's ignorance about political issues will be seen & witnessed by the entire world during the debate.","post_message":"Hillary Clinton leads Donald Trump in the presidential race by only two points — but factoring in the margin of error makes it a dead heat, a new poll from Rasmussen Reports reveals."},{"comment_id":"10153120807760671","commenter_b":"I think it a historical landmark and therefore cannot be torn down and if its not it should be. Even in its dilapidated stated it is still beautiful and the history that building has is a part of everyone who grew up on this area. #SAVETHEHOTELMARYSVILLE!!!","commenter_a":"Make it a church","post_message":"What should happen to this hotel?"}]
