[{"comment_id":"1619982001628404","commenter_b":"HILLARY WILL BRING MORE OF THESE TERRORISTS INTO THE UNITED STATES !!!!! SHE MUST BE STOPPED !!","commenter_a":"Who would predict that...lol...: @webpagelink","post_message":"Hillary Clinton's weakness while she was Secretary of State, has emboldened terrorists all over the world to attack the U.S., even on our own soil. They are hoping and praying that Hillary Clinton becomes President - so that they can continue their savagery and murder."},{"comment_id":"1248098948547994","commenter_b":"When does he go back to court for fraud? Trump is no better than Hilary, they're both dirty.","commenter_a":"Oh come on Donald. Your shocked a rich, privileged, well connected, manipulative say whatever you want to hear white women got away with a crime. You should have seen this coming. Bill helped her out big time, guess we all have a price ...right Loretta?","post_message":"\"We have a rigged system, folks.\" Donald J. Trump addressed the FBI's Hillary Clinton   investigation while speaking in Raleigh, North Carolina. @webpagelink"},{"comment_id":"1394286020597209","commenter_b":"@username Cruz voted in the senate to bring in hundreds of thousands of muslims and TRIED TO PUSH THROUGH AMNESTY FOR THEM AND ALL ILLEGALS because he wants NWO and Open borders! Why do you think for the first time in history the BORDER PATROL HAS ENDORSED A CANDIDATE AND IT IS TRUMP? THEY SAY TRUMP IS THE ONLY CANDIDATE THAT WILL BUILD THE WALL AND ALLOW THEM TO DO THEIR JOB!!!! Trump is the ONLY ONE NOT wanting a PRESIDENTIAL SALARY EXCEPT FOR $1 AND NO RETIREMENT! The ONLY ONE who wants AMERICA AND AMERICANS FIRST! The ONLY ONE That wants to KEEP OUR SOCIAL SECURITY for our ELDERLY! The ONLY ONE That wants to rebuild our MILITARY AND HELP OUR VETS! The ONLY ONE Who WILL UNTIE THE HANDS OF OUR POLICE OFFICERS, BORDER PATROL AND MILITARY! And the ONLY WANT TO CUT GOVERNMENT SPENDING AND BRING DOWN ...","commenter_a":"Cruz what are you then?? You change your tone like Hillary does based on whom you are speaking too. Im not pro trump but least he hasnt changed his speech based on whos around him. That says a lot by itself.","post_message":"\"Donald J. Trump is the master illusionist - he is the Harry Houdini... Trump is a phony.\"  Today while campaigning in Pennsylvania, Ted Cruz slammed his rival for the GOP nomination."},{"comment_id":"1590001651301475","commenter_b":"Great she'll be a steady war monger!","commenter_a":"Yeah diplomacy works! First and foremost.","post_message":"The Young Turks #LIVE coverage of the Commander In Chief Town Hall hosted by Ben Mankiewicz, John Iadarola & Ana Kasparian"},{"comment_id":"1024079497651798","commenter_b":"She's not a model , clearly, unless she is modelling Down Syndrome !","commenter_a":"Yes it's great and all but why does she constantly be labelled as the Down syndrome model, just call her a model.","post_message":"'People with Down syndrome can do anything' (via Daily Mail Australia)"},{"comment_id":"1265448890160011","commenter_b":"Dana, what if it's you who's the bitch and not Hillary?","commenter_a":"There isn't a nail in the coffin. At this point in time either you see her for the corrupt lying bitch that she is and refuse to vote for her or you vote for her in spite of it. No one can say she's not a corrupt liar. Either you admit she is and you're voting for her anyway or you are not. The table is set. The pieces are moving.","post_message":"JUST IN!"},{"comment_id":"10153256663916770","commenter_b":"Another huge waste of tax payer money. There are so many departments in the WH, that do nothing, except, pad their pockets & suck America dry! A big majority of them need to be kicked out!","commenter_a":"Same accountant Obama has. It's just like dropping a billon here and here(like dirty socks).","post_message":"Department of Energy officials might want to take a few more accounting classes after they miscalculated their budgets by a few billion dollars."}]
