[{"comment_id":"10152977557517217","commenter_b":"Lady*","commenter_a":"Beautiful England Rose, Princess Diana.....","post_message":"Princess Diana, lion cubs & space safety fears - This Week in History: @webpagelink #bbcrewind"},{"comment_id":"10157076549400354","commenter_b":"Does the rules say you can steal another candidates votes like he did with Ben Carson?","commenter_a":"Cruz is playing by the rules...PERIOD. Elections have been done this way your entire life. There is nothing different from other elections, with the exception of a whiny, sniveling, jealous loudmouth. Too bad Trump hasn't been paying attention to the rules.","post_message":"\"Ted Cruz has no chance of winning this without bribing the delegates. That’s his game at this point. He’s mathematically eliminated....\"  WATCH:"},{"comment_id":"1154038954631400","commenter_b":"@username show this to your boo.","commenter_a":"This made me think of you, Raima. And also laugh really hard.","post_message":"Will Ferrell: comedian, actor, just your average millennial."},{"comment_id":"1056873814372366","commenter_b":"Rightly so with people like you ..muslim countries would be crazy to let you in","commenter_a":"No churches can be build in Muslim countries, why should mosques be in Britain .Woman got 200 lashes for just reading a bible in Sadia Arabia just last week.","post_message":"The largest Mosque in western Europe is engulfed in flames"},{"comment_id":"10153448214053984","commenter_b":"That lady has a problem nice in front of kids","commenter_a":"He was absolutely right in what he did. People like her should be called out. They have no respect for any rules, they think they don't apply to them.","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"1760842010899023","commenter_b":"Bitches be trippin'","commenter_a":"No not for all the money in the world!","post_message":"Would you?? #WSHH"},{"comment_id":"10153992409688132","commenter_b":"Bet she can't do it again! Lol","commenter_a":"Bye Felisha","post_message":"The force of the blast tore her body apart, complicating officials' efforts to identify her."}]
