[{"comment_id":"10152904733026051","commenter_b":"I would love to get my hands on the bitch who wrote that! I'm very sorry that there are people out there like that.","commenter_a":"Key their car","post_message":"A woman asked her neighbor to please avoid parking in her handicap parking spot. This is the letter she got in response."},{"comment_id":"575394812634636","commenter_b":"Thanks for the giggles","commenter_a":"i know i'm not the only one who thinks dwayne johnson looks like the rock","post_message":"The brawl occurred after Cage reportedly pulled Vince Neil off of a woman at the ARIA Resort & Casino."},{"comment_id":"10154491854776002","commenter_b":"Yeah, she's a great mother!?!? Ha. Get those poor kids away from her immediately; lock her away with the scum husband.","commenter_a":"Seriously-not only her but her husband has committed the same crime-hurting thousands of others-stealing money from the government and she wants a break?!!!!!!","post_message":"Washington is asking the judge for a massive break. The judge ordered her to serve four years in prison, but she is asking not to go to turn herself in for five years so she can stay home with the kids while their father serves his time for the same crime."},{"comment_id":"10153649615904199","commenter_b":"The employee aint do nuthin wrong. she got hit. ole white girl lucky she didnt get stomped harder.","commenter_a":"The employee should be fired. People need work ethics. Call for the customer to be removed!","post_message":"Warning this video contains graphic language."},{"comment_id":"1038558619518329","commenter_b":"How many more *illegal* guns are gonna kill people before you relize that if these people want guns, they'll get 'em... Illegal or not... #howmany","commenter_a":"There goes a wasted minute that I'll never get back.","post_message":"This video is packed with more celebrities than we could count — and they have one powerful message for the world."},{"comment_id":"10154110742322439","commenter_b":"Cowards !! Stay to fight for your country !! You are Iran's puppets !!","commenter_a":"No problem. Enlist them in the French Foreign Legion - minimum 12 year enlistment; send them to Corsica for Basic and Combat training, and then deploy them to Libya to fight ISIS.","post_message":""},{"comment_id":"1783100141966543","commenter_b":"We should build a wall at the California line and put all the liberals in it...","commenter_a":"Wutttt ?????","post_message":"Game of Thrones actress Sophie Turner (Sansa Stark) attacked Trump saying that if she could fix the world, she would kick him \"out of the country. And we’d create a wall around him so he couldn’t escape.”"}]
