[{"comment_id":"460484767469658","commenter_b":"China dont want none!!!","commenter_a":"So we take warnings from communist?","post_message":"TRUMP WIN RATTLES CHINA"},{"comment_id":"1386005081478024","commenter_b":"Thank God! We are the voice of this babies.","commenter_a":"So let me get this straight.. These wingnut lefty/leberial woman who are marching all over today are really attempting to fight over their treasured planned parenthood. They want to keep the free goverment \"healthcare\" for women. Correct me if I'm wrong but, isn't their local welfare office giving out medical cards to cover 100% of their \"healthcare\" needs?? Oh wait, this is primarily an adult sized temper tantrum because they want the right to abort babies. PLAIN AND SIMPLE. Can't wait for Trump to sign the bill for defunding😡🇺🇸","post_message":"Baby-killing organizations that have been using government money to fund their sick, worldwide abortion agenda just got some seriously bad news... here's what Donald J. Trump just did to send them into total panic.  A lot of liberals are going to be furious about this... what do you think?"},{"comment_id":"695691723946745","commenter_b":"She has no clue !","commenter_a":"Talia Crichton","post_message":"The look on her face when Al Franken calls Betsy DeVos out for being so damn IGNORANT about education policy is simply priceless!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1265496813476971","commenter_b":"Angry black priviledged woman.","commenter_a":"He likes ugly women , that's as close to nice as I can get.","post_message":"People say during the #Christmas season I should say something nice about Obama, so I wrote Michelle to see if she can think of anything..."},{"comment_id":"10154377654466729","commenter_b":"parents need to stay in contact with reality when it comes to their kids. pay attention to what schools is teaching our kids. it is all coming together. womans lib, moms are not home any more to pay attention to what kids bring home. homes have been destroyed.","commenter_a":"Those who can, do.","post_message":"Bingo."},{"comment_id":"10154400338828812","commenter_b":"what a fking con artist","commenter_a":"Box of chocolates. Gump trump","post_message":"Donald J. Trump continues to refuse to release his tax returns and declines to reveal his tax rate. “It’s none of your business...you'll see it when I release but I fight very hard to pay as little tax as possible.”"},{"comment_id":"10154897891195530","commenter_b":"@username you kiss your mama with that nasty mouth?","commenter_a":"Trump is frightening for everyone. Period.","post_message":"There are up to 127,000 undocumented immigrants in Michigan, many of them anxious about Donald J. Trump."}]
