[{"comment_id":"10153254582474877","commenter_b":"I think that was a reply to the poster.","commenter_a":"Atheists are the first ones to cry Jesus as soon as they get hurt!","post_message":"NFL star Arian Foster reveals he's an atheist: 'Faith isn't enough for me.' Read more on his perspective below.   Grio fam, what's your reaction to Foster's remarks? Sound off..."},{"comment_id":"10154233423376179","commenter_b":"@username - He wants an empire. Fascism 101 lesson, from 1947: @webpagelink","commenter_a":"Wow, another white man! What could possibly be up with that?","post_message":"Trump #SCOTUS nominee revealed"},{"comment_id":"10153885880700667","commenter_b":"His wife is an idiot","commenter_a":"He is still body shaming this woman? Really Trump?","post_message":"\"I saved her job because they wanted to fire her for putting on so much weight.\""},{"comment_id":"1150787404931568","commenter_b":"Trump is only running to give the candidacy to Hillary... or Bernie. He is still very much a Democrat. The \"conservatives\" who joined him have proven that stupidity doesn't necessarily stop with the Democrats only.","commenter_a":"Mr. Trump is not my first choice, but the more the elite republican insiders attack him the more I am inclined to support him.","post_message":"Will Republican attacks work or is Trump unstoppable?"},{"comment_id":"1092002180891914","commenter_b":"Tiny little penis","commenter_a":"Piece of shit","post_message":"Think quick! Then, click \"like\" on your favorite answers in the comments.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10150935121129999","commenter_b":"She did say that but she said it was because of the mother's health.","commenter_a":"As an avid hater of Trump, it's hard to read this because I am so tired of Trump supports blaming all bad press about Trump on the \"liberal media\" but this is supposed to be a fact checking exercise and it is just so obviously biased and sarcastic and the tone does not come off as objective at all. It would be nice to see something written that fuels the \"evil media\" fire a little less.","post_message":"We're fact-checking the presidential debate with Hillary Clinton and Donald J. Trump: @webpagelink"},{"comment_id":"1111151122296756","commenter_b":"This makes Chicago sound a lot like Baltimore for the \"quality\" (corrupt, criminal) of incumbent leadership (I grew up in the south side of Chicago all the way back to the 60's - and am not much impressed with what the present day enthusiasts think of my opinion. I also lived for a while in Viet Nam, and there we were allowed to call the other guys \"enemy\", and to shoot back at targets of opportunity, ... just sayin\") @webpagelink","commenter_a":"I knew there was a dirty Democrat involved in that ruckus!","post_message":"Inside scoop, here . . ."}]
