[{"comment_id":"10156450025520551","commenter_b":"She is as dangerous as Hillary","commenter_a":"both---jail time","post_message":"Issa: FBI director would like to indict Clinton and Abedin [VIDEO]"},{"comment_id":"1159189937449759","commenter_b":"WHAT DOES THE OBAMAS AND CLINTONS HAVE TO HIDE FROM THE VOTERS. THEY ALL REMIND ME OF ALI BABA AND THE 40 THIEVES BUNCH OF CRIMINALS DON'T TRUST ANY OF THE CROOKS.","commenter_a":"Gee, funny they can tell who hacked emails showing Democratic corruption but, they have not had any luck finding Hillarys missing 30,000 emails.","post_message":"Whoa!"},{"comment_id":"10154278341944062","commenter_b":"Personally, I believe the game should have been forfeited. Cheaters should not be the champs.","commenter_a":"Cheating is cheating. Get him out.","post_message":"A federal judge erased Tom Brady's four-game suspension - do you agree or disagree with his decision? Vote now..."},{"comment_id":"636643946488247","commenter_b":"WHY DON'T YOU JUST SHUT UP-SAVE YOUR MUSLIM THREATS FOR THE MUSLIMS ! LONDON SURE SCREWED UP WHEN THEY LET SO MANY OF YOU MOVE INTO LONDON-AMERICA WILL NOT MAKE THAT MISTAKE !","commenter_a":"They will try to attack us anyway so if we don't allow them in it will be easier to contain the ones who are here already.","post_message":"The new Muslim mayor of London has issued a warning to Donald J. Trump: Moderate your stance on Muslims, or they will launch more attacks against America."},{"comment_id":"1394286020597209","commenter_b":"@username Cruz voted in the senate to bring in hundreds of thousands of muslims and TRIED TO PUSH THROUGH AMNESTY FOR THEM AND ALL ILLEGALS because he wants NWO and Open borders! Why do you think for the first time in history the BORDER PATROL HAS ENDORSED A CANDIDATE AND IT IS TRUMP? THEY SAY TRUMP IS THE ONLY CANDIDATE THAT WILL BUILD THE WALL AND ALLOW THEM TO DO THEIR JOB!!!! Trump is the ONLY ONE NOT wanting a PRESIDENTIAL SALARY EXCEPT FOR $1 AND NO RETIREMENT! The ONLY ONE who wants AMERICA AND AMERICANS FIRST! The ONLY ONE That wants to KEEP OUR SOCIAL SECURITY for our ELDERLY! The ONLY ONE That wants to rebuild our MILITARY AND HELP OUR VETS! The ONLY ONE Who WILL UNTIE THE HANDS OF OUR POLICE OFFICERS, BORDER PATROL AND MILITARY! And the ONLY WANT TO CUT GOVERNMENT SPENDING AND BRING DOWN ...","commenter_a":"Cruz what are you then?? You change your tone like Hillary does based on whom you are speaking too. Im not pro trump but least he hasnt changed his speech based on whos around him. That says a lot by itself.","post_message":"\"Donald J. Trump is the master illusionist - he is the Harry Houdini... Trump is a phony.\"  Today while campaigning in Pennsylvania, Ted Cruz slammed his rival for the GOP nomination."},{"comment_id":"10153228975447452","commenter_b":"*facepalm* ... She is an idiot. She should have respected their religion.","commenter_a":"Charge the lady for assault","post_message":"Attacked as they prayed?  A group of Muslim men say a worshiper was hit in the face and doused with coffee in a confrontation with an irate woman in a NorCal park. abc7.la/1Qgwbam  “You are very deceived by Satan,” the woman yells as the wild scene is caught on camera. Should she face criminal charges? Why she’s not backing down, in her own words."},{"comment_id":"1069935306362850","commenter_b":"Wooh, I guess different strokes for...that's one ugly woman","commenter_a":"Carly not bad to the eye that's all","post_message":"Carly ROASTED Hillary over her email scandal!  Watch her sound off."}]
