[{"comment_id":"559542634171067","commenter_b":"Attack Attack Attack !! We will give you something to cry about. Sieg Heil !","commenter_a":"Some of us have been warning of this for quite a while. People are not thinking. They are emoting feelings.","post_message":"He would know…"},{"comment_id":"10153953740523132","commenter_b":"Read!! Read!! Read!!!!!!!!!","commenter_a":"Did the other driver not stop to report it?And no one saw?","post_message":"People driving on the freeway told police they thought the body was a \"Halloween prank.\" It remained on the sign for 2 hours, police said."},{"comment_id":"1285821781534200","commenter_b":"nasty reptilian","commenter_a":"Well i think there is no more people to die,there was only one left so G Michael was that,the question is why they need people to die?","post_message":"I think she was right"},{"comment_id":"1576025939362143","commenter_b":"This is America not European dont like America go back to European take DONALD TRUMP with you ok gringo","commenter_a":"Why are people dumb enough to think people who do not want illegals in the US hate Mexicans? Or any other foreigner? It is ILLEGALS that they want to regulate, no those entering the country legally. We could do without the wall, just get more Border Patrol and more bullets...and do like other nations, shoot those crossing illegally, maybe that would satisfy the supporters of illegal immigration... Read up on Mexico's illegal immigration law.","post_message":"Former Mexico President Vicente Fox is sorry, not sorry about his big middle finger to Donald J. Trump and his proposed wall along the U.S. southern border."},{"comment_id":"10153917559886770","commenter_b":"Nah, her girl fans drink boiler-makers.","commenter_a":"Amy Schumer fans do not drink beer. They drink fruity drinks with umbrellas in them. And her female fans drink those, too.","post_message":"This doesn't sound good...."},{"comment_id":"10153782060807235","commenter_b":"i am embarrassed that this nasty little whore is from my home town. that is NOT the values we were taught in Newton, Massachusetts","commenter_a":"Imbecile!","post_message":"This makes me want to vomit..."},{"comment_id":"1277810208923879","commenter_b":"I wouldn't trust him to drain anything","commenter_a":"Ryan is a swamp rat.","post_message":"Let the draining begin!"}]
