[{"comment_id":"1833633870187083","commenter_b":"Whatever her position, she chose it. I have researched her & she was looking for a meal ticket. Hopefully she knows now the real meaning of money. She has a mouth & 2 feet & she could walk. No matter if there is a prenup & what it says, this bastard is going down & in the end she would probably prevail.","commenter_a":"we have more important things to do with our words and our time--feel sorry for Melania and the Barron--or get our Country back--it's a choice-Can't do both---you people better choose------Bleeding Heart will only go to degree---We have a choice...to allow a Dictator or feel sorry for his family? Cut me a break!!","post_message":"WOW. Melania's face says it ALL! #freemelania"},{"comment_id":"10153852047087061","commenter_b":"Woman need to have concealed carry. Just too nasty out there now.","commenter_a":"Wtf!!!","post_message":"BRUTAL ATTACK: Police are looking for a man who walked up to a woman near a San Francisco park and began punching her in the face. Read more: @webpagelink"},{"comment_id":"596204130539541","commenter_b":"@username I think most people are okay with accepting refugees. PROVIDED, that they become members of the country they decide to make home. Non of this lets make Sharia law zones like back home bollocks. How do you separate the good from bad? Only allow families in? That hardly sounds fair. Just be aware that when you accept them in you accept responsibility for them. Anyone raped. Any bars burned down. Any cartoonists shot. You are responsible for those by knowingly understanding some of the bad is coming with those who need your countries protection.","commenter_a":"The assumption that these guys are all refugees is really telling. *Open your eyes a bit, these fuckers are homegrown. Isis is betting on you hating and attacking refugees to add fuel to their fire. You're all being played.","post_message":"Some experts say it's only a matter of time before the heart of the European Union sees tragedy."},{"comment_id":"10153047231286615","commenter_b":"Dogs are innocent. At least a human can report what happens to them and make the choice who they stay with","commenter_a":"But you are all ok with James Harrison? He beat his girlfriend. Vick never harmed A HUMAN BEING.","post_message":"DEVELOPING: Quarterback Michael Vick is on his way to #Pittsburgh to meet with the Steelers, according to ESPN's Adam Schefter..."},{"comment_id":"1713481288905957","commenter_b":"@username...does that include the Canadian illegals that are here?","commenter_a":"But trump supporters are racist!! The only racist people I see are the one rioting at trump rallies!! You don't see that type of behavior at Hillary or Bernie rallies","post_message":"Protesters attacked Donald J. Trump supporters on the sidelines of a San Jose rally Thursday, in a raucous scene where a dozen or more people were punched and at least one woman was pelted with an egg."},{"comment_id":"10153814775523797","commenter_b":"A woman being drunk is not a license to violate her. Go Sit Down somewhere....","commenter_a":"exactly she was drunk she dk what he was saying or doing she just wanted n excuse to sue these officers n live off our tax dollars rest of her life n not work","post_message":"CITY PAYS DRUNK WOMAN: Well, not exactly. #Chicago taxpayers will shell out money to compensate an inebriated woman who accused two police officers of sexually assaulting her. What do you think? Details here:"},{"comment_id":"1193491007392830","commenter_b":"@username she better pray that she does. Her crooked butt will see prison bars.","commenter_a":"Horrifying? No, what is horrifying is you ignoring the pleas for help from four Americans, for 13 hours, while they were tortured, raped, and murdered, you evil witch.","post_message":"Debate question: Will Donald Trump accept the results of the election?  Donald J. Trump: “I will tell you at the time. I’ll keep you in suspense.”  Hillary Clinton: “That’s horrifying.”"}]
