[{"comment_id":"10152823238956130","commenter_b":"Women graduate at a far higher rate than men. From high school and college.","commenter_a":"And no the factors you listed clearly are important, not to discussing what wages should be, but to the discussion of why wages are not equal. Data clearly shows the problem is economic insufficiency, regardless of there being widespread discrimination. So we could make more progress closing the gap by everyone getting a better education (even at the library or online if you know how to source good) building your own successful business, or something innovative.","post_message":"This is what the wage gender page gap looks like."},{"comment_id":"1886511228246156","commenter_b":"Illegal aliens.","commenter_a":"What your liberal brains are to small to realize is there is no defending illegal immigrants. They have no right to a trial. They have no right to a defense. They are automatically guilty and only entitled to deportation. If you want to be American there is a legal way. It is not easy nor will it be quick. But if you are willing to do it the legal way then you get to become an American and stay without fear of deportation.","post_message":"Janet Napolitano says the University of California will vigorously protect illegal immigrants."},{"comment_id":"699563113502060","commenter_b":"I don't like killing of animals or anything what soo ever..... but.... i don't mind hunting to Feed your family.. its just hunting for sport that i hate with a passion","commenter_a":"It doesn't matter how I feel about this! They are free to do as the law allows. My opinion is: this is awesome!","post_message":"How do you feel about this?"},{"comment_id":"10153267588169497","commenter_b":"@username's a big ole pussy","commenter_a":"Deserter.","post_message":"In Focus:   The Onion breaks down what you need to know about the former POW"},{"comment_id":"1219986431394436","commenter_b":"Why are women today so violent?","commenter_a":"No wonder kids are so screwed up today in America...just look at their mothers.","post_message":"Boom box brawl erupts in the sky"},{"comment_id":"10153122884761130","commenter_b":"This article suggests I'll never find a smart woman to have kids with. That's disheartening","commenter_a":"Hmmmm.....","post_message":"As if being a woman is just about having kids."},{"comment_id":"10153512925208854","commenter_b":"They can take the next boat, plane, or train out of my country!!","commenter_a":"All those who sign this petition should be banned from the USA forever","post_message":"U.S. Citizens Sign Petition to Ban American Flag"}]
