[{"comment_id":"1719965091608675","commenter_b":"Newt Gingrich said on Fox News last night that it is not we the people who picks who runs for president! Now that is one right out lie! It's like our government makes the rules up has they go! Hillary Clinton gets away with right out murder and Breaking the laws. But Donald Trump can't be our president because they know that all of there Dirty Work will come out for all of us to know and that is what they are scared of . Obama did not get enough delicates but they let him run for president and they new that there was a lot of people who where not for Obama. They just was scared of what the Black people would do if he was not picked to run for president. Well you better be scared of all of us people that is fead up with our government ...","commenter_a":"I do love Newt. stay the course Trump.","post_message":"\"Newt Gingrich on ‘Anti-Trump’ Republicans: Should Form Lost Republicans for Hillary.\""},{"comment_id":"10154013859753812","commenter_b":"Well let's work and try to keep dump people from getting guns.","commenter_a":"you would be smart Mr President to work on peoples parenting NOT GUN CONTROL, guns dont kill dumb people do","post_message":"President Obama plans to sit down with Attorney General Loretta Lynch after returning from his Hawaiian vacation to discuss gun control options. @webpagelink"},{"comment_id":"795518530581327","commenter_b":"There is definitely something wrong with this lady...","commenter_a":"Bully like Hily Holbrook from \"The Help\" except for the racism.","post_message":"I can't stop laughing.....at HER."},{"comment_id":"10153988476564255","commenter_b":"Who is this dumb bitch this must be Stacy dash sister","commenter_a":"Unbelievable!!!","post_message":"This is how Fox News celebrates Black History Month."},{"comment_id":"1221087354570479","commenter_b":"It is French and Spanish ancestries some of the women probably do have more hair than the guys... I should know I was one pretty hairy teenage girl growing up in New Orleans!","commenter_a":" school board has a policy that does not allow any facial hair on male students, Tangipahoa Parish school superintendent Mark Kolwe told ABC News. So female students can have facial hair? Seems sexist to me.","post_message":"The school told all students with facial hair that they had to shave before the ceremony, but the rule was not enforced during the school year."},{"comment_id":"10155779626265725","commenter_b":"@username here @webpagelink","commenter_a":"It's Sad How there's many Mexican's in these comments saying they will vote for Donald Trump. Maybe because some of you don't know the struggle of coming to the United States & been judge just because we want a better life. Donald Trump NOT FOR PRESIDENT. smh","post_message":"Jorge Ramos- Please send me your new number, your old one’s not working. Sincerely, Donald J. Trump"},{"comment_id":"957861980892726","commenter_b":"Allowed, not aloud. Here, not hear. You're, not your. Go back to school, Linda.","commenter_a":"No one should be aloud in this country without being vaccinated period! No matter if you lived hear your whole life or your just coming in. Unless there is a medical reason it's just common sense.The risk of spreading these diseases is too high.","post_message":"The current measles outbreaks sweeping the country are the fault, at least partly, of Barack Obama lax illegal immigration practices, according to former Johns Hopkins neurosurgeon and possible 2016 GOP presidential candidate Dr. Ben Carson.   Read more at @webpagelink"}]
