[{"comment_id":"1104396149581395","commenter_b":"Because women aren't people?!","commenter_a":"*women with depression","post_message":""},{"comment_id":"895578827165435","commenter_b":"nothing ever happens to her for her lies!!!!","commenter_a":"Keep digging, @username.","post_message":"As the Speaker notes— Having finally heard from Secretary Clinton yesterday, we are left with more questions than answers. These public records at issue are broader than Libya and broader than Benghazi. The Secretary of State has enormous responsibility and jurisdiction and the public, the media and Congress have a legal right to access these public records without impediment."},{"comment_id":"547425292114717","commenter_b":"She needs to be exposed for every crime she has committed and she needs to leave her campaign so she can face charges for every one of those crimes!","commenter_a":"Oh! Bet me!","post_message":"Hillary is officially paying the price for all the crimes she has committed.  Awesome. She is a criminal.  Can we get 10,000 'LIKES' for Hillary getting arrested?"},{"comment_id":"1044864242277400","commenter_b":"@username Of course you haven't ever heard a group of 59 year old women bragging about \"popping a Tic-Tac\" so they could forcibly kiss a handsome man. And never have I heard this same age group say, \"grab'em by the d*ck\", nope, it doesn't happen...","commenter_a":"I am still trying to figure out how this man became a surgeon. Are you sure that his license and everything or legit cuz he is a total nut","post_message":"Ridiculous!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153936171871813","commenter_b":"Your wifes hot though LOL","commenter_a":"If your not in Law Enforcement nor never have been dont even bother to comment on this post","post_message":"Here’s a way to increase much-needed police accountability — especially when force is used."},{"comment_id":"10153528631451955","commenter_b":"What a cunt! I hope she ends up in jail!","commenter_a":"She's been divorced 3 times. If god forgave her for that 3 times, he'll forgive her for issuing a gay marriage license once haha","post_message":"DEFIANT: Judge orders KY clerk to appear in court after she again denies gay marriage licenses..."},{"comment_id":"10154866849395329","commenter_b":"Becky with the good hair have a stadium full of seats please","commenter_a":"*21 things no one asked for. There, fixed it. *waits for angry Trump supporters to start complaining in the comments*","post_message":"We asked Donald J. Trump supporters to write down a misconception about them and here's what happened."}]
