[{"comment_id":"10154004178307452","commenter_b":"Oh, but still lol what a sick hoe","commenter_a":"Her Bfs ex girlfriend is mad @username","post_message":"A Redlands woman woke up to a gruesome discovery when she walked out her front door to find pigs’ feet, fish heads and other animal parts scattered across her doorstep."},{"comment_id":"890315697769072","commenter_b":"@username boycott the Shamrock inn, this pos. people are more dangerous than animals.","commenter_a":"If the bear was causing harm that's one thing. But he wasn't, he was minding his own business only to be stalked by this idiot. Honestly, why don't we hunt down this creep and see how he likes it?","post_message":"A sad day for the hundreds and thousands of animals lovers who were following the story of Pedals the bear.  The bear that became famous for roaming around New Jersey on his hind legs like a human has been killed during New Jersey hunt.  A hunter shot the bear with a bow and arrow.  The hunter has reportedly been stalking Pedals for three years."},{"comment_id":"10153231132726336","commenter_b":"they should leave and not allowed back","commenter_a":"Look all black","post_message":"\"If you don't like what that flag stands for... leave!\"  On 'Fox & Friends,' Medal of Honor recipient Dakota Meyer called for a social media campaign to counter a movement encouraging Americans to stomp on the flag."},{"comment_id":"10154087182591409","commenter_b":"@username Michelle had to keep her legs closed or her dick would fall out!","commenter_a":"Lisa erikson just because Hillary hasn't been charged and found guilty doesn't mean she's not. She's a liar and as crooked as Obama and Michelle on many levels. Keep lying to yourself.","post_message":""},{"comment_id":"10153516807860575","commenter_b":"Schmuck must go!","commenter_a":"He looks mentally ill.","post_message":"The Gateway Pundit - DISGRACEFUL: Mitch McConnell WILL NOT Allow Vote to Defund Planned Parenthood (VIDEO)"},{"comment_id":"10154603264491756","commenter_b":"That's a huge stretch of the truth but I'm guessing you prefer a plagiarizing lying college drop out \"model\" as First Lady. And who of all people did she plagiarize? Michelle Obama.","commenter_a":"So phony! Had to be distracted since she probably couldn't give much details of the White House since she spends more time at her house in Hawaii!","post_message":"First lady Michelle Obama says she's only been able to \"rock out\" from the passenger's seat of a car one time in 7 1/2 years — when her daughter Malia learned how to drive."},{"comment_id":"10154468186761051","commenter_b":"She should never be allowed in another classroom!","commenter_a":"GOOD!","post_message":"This teacher was given the boot after video of what she did to Donald Trump went viral."}]
