[{"comment_id":"10153868585859203","commenter_b":"She wouldn't fuck any of you dude bros anyways.","commenter_a":"She looks great. Bold, sexy, unflinching, human.","post_message":", gross, strong, thin, fat, pretty, ugly, sexy, disgusting, flawless, woman."},{"comment_id":"10153877840551337","commenter_b":"I always hated rousey I'm glad her ass got knock the fuck out","commenter_a":"Truth is holly Holm is a real fighter n Dana white thought he picked another easy girl for Ronda to destroy well plan back fired ,Holm is a real fighter and real champion now let's see her n cyborg fight two top fighters Rousey is finished","post_message":"DAMN: Holly Holm didn't hold back with these comments about Ronda Rousey."},{"comment_id":"1322741314433625","commenter_b":"MORE POWER TO THE AMERICAN PEOPLE AND GO SUCK AN EGG TO U DAM MUSLUMS.","commenter_a":"If that's what they want, let them start their own school, with their own money.","post_message":"JUST IN..."},{"comment_id":"10153467245366770","commenter_b":"@username are you doing your homework?","commenter_a":"According to Roger Stone, 182919686769s Mens Fashion Editor and the only named \"source\" in the National Enquirer smear story about Ted Cruz cheating on his wife with five women. Ted Cruz doesn't have time for that crap, he's too busy pushing back the establishment.","post_message":"\"Despite the old guard and amateur pundits blaming Donald J. Trump and the majority of GOP voters who support him, much of the rift in the Republican Party has been caused by Texas Senator Ted Cruz conning nationalists into believing he is one of them.\""},{"comment_id":"10152709650356051","commenter_b":"Daila Gonzalez, if you are here illegally, it's time for you to leave!","commenter_a":"We should spend more money on our mentally ill americans then we do illegals.. It is such a shame they get so much while we neglect our own...","post_message":"Police saw that a man at IHOP couldn’t pay his tab, so they decided to pay for him. A few hours later, they made a grisly discovery in his apartment"},{"comment_id":"579350648893184","commenter_b":"These other ones need to keep on walking","commenter_a":"At Portland High graduation three young muslim woman remained seated during the National anthem, one of them grabbed the hand of the young muslim man who was standing , trying to get him to sit.He brushed her hand aside and remained standing.Then she turned around to face a large group Muslims and tried to get them to sit.Everyone of them remained standing.","post_message":"Muslim Students Walk Out During National Anthem [VIDEO]. If you don't respect our country, feel free to leave. Do you find this disrespectful?"},{"comment_id":"10153019932341323","commenter_b":"No, but look what women can do with them, much healthier than smoking.","commenter_a":"How much for the tampons?","post_message":"Only in New Orleans..."}]
