[{"comment_id":"10153091862830329","commenter_b":"Some women like to be told.","commenter_a":"This world needs to stop being offended by everything, and just let people live their lives.","post_message":"A pledge email from the University of Southern California’s Alpha Chi Omega chapter published by Jezebel today shows how authoritarian the sorority’s rules are for things like hair color, eyebrow shape, and required Spanx wearing."},{"comment_id":"560619820771155","commenter_b":"Happy Thanksgiving Dr. Carson and family!","commenter_a":"God bless and keep you both always,many more Thanksgiving to share our blessings.","post_message":""},{"comment_id":"10153352835244384","commenter_b":"I love Nancy Pelosi. Her farts smell like broccoli.","commenter_a":"I love Nancy Pelosi, she is a superb role model, and tireless worker for all Americans!","post_message":"Today, under the leadership of Congresswoman Rosa DeLauro, House Democrats are again taking the lead in addressing one of the most pressing economic challenges confronting our country by re-introducing the Paycheck Fairness Act. Securing a fair shot for women in the workplace is critical to ensuring prosperity for our nation. Rather than continue their cycle of obstruction and dysfunction, House Republicans should join with us to close the gender wage gap so we can provide bigger paychecks and better infrastructure for all Americans. @webpagelink"},{"comment_id":"10153900140313487","commenter_b":"Nazis are big in SA. Very wealthy, and powerful","commenter_a":"'Baby' Hitler was beaten by his father, and though loved by his mother, she died young. Take away either thing and you have a different adult.","post_message":"What would you do?"},{"comment_id":"667325733458005","commenter_b":"Gloria I agree. Get their muslim butt back where they came from","commenter_a":"Muslims if you don't like the way America's are then leave. Clint Eastwood has every right to be artistic and make true movies about who you really are then leave AMERICA. We have freedoms you do not have so leave because we will not stop being Americans. The movie was very well done and true to the ooint.","post_message":"This angry Muslim group wants Clint's head, but he's not backing down.  He is a true American, and a real patriot.  Can we get 125,000 'LIKES' for Clint Eastwood?"},{"comment_id":"10153127223956800","commenter_b":"Jodi, you are a serious bitch. And an ableist, uninformed, obnoxious bitch at that.","commenter_a":"I urge every parent with a child with autism (I have two children dx autism) to seek out proper IGenex testing for Lyme. Lyme mimics autism. Both of my children recovered from autism w proper Lyme treatment.","post_message":"\"The whole show is about raising money -- not to cure autism. Because a lot of people are working on biomedical research. My wife and I couldn't get our kid into any kind of school or program that was adequate for him until he was 7 years old. And people with fewer resources than us -- it's unimaginable to us what they have to go through. And the kids. They deserve better.” — Robert Smigel discusses Night of Too Many Stars   ► Watch the interview: @webpagelink ► Support autism programs: @webpagelink"},{"comment_id":"10153212648798690","commenter_b":"West & their illegal wars do. Racist Christine","commenter_a":"Dont go to Australia and the likes. There are a lot of other muslim friendly countries.","post_message":"\"The prime minister of Australia acted to firmly entrench in the national psyche not only that Australian Muslims are not to be trusted, but that Islam and Muslims are complicit in the 'death-cult' ISIL.\"  @webpagelink"}]
