[{"comment_id":"10153031134771051","commenter_b":"She should have kicked on his teeth. What an asshole.","commenter_a":"And a bunch of guys rush over to help HIM? Whee were they when she was defending herself?","post_message":"This waitress walked over to give a customer the bill. That's when he decided to grope her. Bad move."},{"comment_id":"10155793831095354","commenter_b":"Good. There are plenty of beautiful conservative women.","commenter_a":"LET HER GO","post_message":"\"Mexicans, like all Latinos, contribute positively to this great nation. We are the force that keeps the country afloat.\""},{"comment_id":"1117614688258709","commenter_b":"@username I bet you believe the liar Lucy.","commenter_a":"Apparently the alleged (by police) victim in this case, is saying \"there was no assault\"..... Of course if the Gian Gomeshi/Lucy DeLiar case has taught us nothing if not \"We must believe in the guilt of every man accused, even if he is not guilty... even if the accuser admits to lying about it... and even if the alleged victim says \"he didn't do anything\".... if you have a penis, you are, by default, guilty, even if you're not guilty :( Sad world when having a dick is more of a crime than being a dick :(","post_message":"\"If I find out that somebody is abusive, I cut them out of my life. It's very easy,\" wrote Lucy DeCoutere after the actor who plays Bubbles in the Trailer Park Boys was charged in a domestic dispute."},{"comment_id":"1753315408263301","commenter_b":"When u ugly as Fuck but because of your money u can fuck whatever hot girl you want! 😒😒😒","commenter_a":"😧we have become the laugh Hurd around the world..","post_message":"Nothing wrong with nude modeling, but could you imagine how they would scream if Michelle Obama had done this? Hypocrites..."},{"comment_id":"10154045575585575","commenter_b":"Who cares what you say ASSHOLE...............","commenter_a":"And how long would you last in a war with America fool?","post_message":"Vicente Fox jumps shark. Says Trump election will lead to war."},{"comment_id":"1190682247676976","commenter_b":"Hey Bitch you may go to prison after all !!!","commenter_a":"No accountability on behalf of Killary Clinton for the Email scandal Teflon Bill and her remain unscathed in her unsecured private server and passing of top secret state emails, after only a 30 minute talk with Loretta Lynch Bill got it all worked out last week, oh and the FBI director was an Obama employee, how convenient! I bet if she becomes our president she will be protecting the Nuclear codes the same way and making sure her Iranian Aide Huma Abedin knows just where to keep or use them, no worries. Please don't vote for this KILLARY, because our nation can't afford someone willing to sell us out so easily, email scandal, enriched uranium scandal with Russia, Saudi money foundation scandal, Unsecured borders, she will take all your guns, and not to mention Benghazi. Trump 2016","post_message":"Up until now Hillary Clinton has faced a lot of serious charges, but nothing compared to the one that just got brought up.  If this goes through, Hillary's about to get hit with the most serious charge a leader can be accused of.   There's no way the media will let this get out..."},{"comment_id":"10154062407918812","commenter_b":"The kids in low income areas would just grow up as failures and,we'd support them as inmates. Abortion is cheaper in the long run, and saves people from being victims of their future crimes.","commenter_a":"$500,000 doesn't compare to the $500 Million taxpayer dollars that go to the organization that is (Un)Planned Parenthood, strategically placed in low income areas across America and helps thousands of new mothers kill their own children in their own wombs. Can the Fed do something about that??","post_message":"Oregon governor says armed group’s continued occupation of federal land has cost taxpayers nearly $500,000."}]
