[{"comment_id":"10153194834046717","commenter_b":"Fuck you bitch","commenter_a":"Many Jamaicans are F'd up; bleaching, trickery, conning, God awful people!!","post_message":""},{"comment_id":"10155339234553132","commenter_b":"Why have this girl on TV really it is ridiculous !","commenter_a":"Take all her electronics away....and Danielle's too!","post_message":"Danielle Bregoli is back, and she not mincing words."},{"comment_id":"10153005348800496","commenter_b":"So it's from not walking?","commenter_a":"Can someone explain to me how they grow like that? What about wild horses? Thanks.","post_message":"Disturbing: @webpagelink"},{"comment_id":"10153151146755950","commenter_b":"Seriously, can this bitch go away?","commenter_a":"Nope don't believe it","post_message":"During their private meeting, Pope Francis told Kim Davis to stay strong, according to her lawyer."},{"comment_id":"1338680576172411","commenter_b":"Omg pathetic!","commenter_a":"@username, a good laugh.","post_message":"This is hilarious and sad."},{"comment_id":"10154456762501509","commenter_b":"Why not?!?!.Woman need to protect them selves.At least they got to train some combat skills hehehe...","commenter_a":"Feminism did not make a stride forward in the fight for women's rights. All they did was to send your daughters and granddaughters to potential war. They themselves didn't get anything out of it. They will never see war most likely. I hope they're proud of themselves.","post_message":"Do you agree?"},{"comment_id":"10153001581342377","commenter_b":"right CMc and send their illegal babies with them If they weren't made in America they are not American stop giving them birth certificates you just encourage illegals to come here Is this hard to understand??","commenter_a":"It's the law. They are here illegally and, according to the law, they must be deported. Trump didn't make the law. All he's saying is that he would enforce it. The government has no problem enforcing other laws that people disagree with; why should this be any different?","post_message":"Trump's Proposed Deportation Effort..."}]
