[{"comment_id":"1012561098824705","commenter_b":"The fact that this slut could possibly be our First Lady is a very important issue to me,","commenter_a":"Really people, this is what you talk about when there are real issues affecting people in the US. Shame on you. Is this what we have become as a nation?","post_message":"Conservative hypocrisy knows no bounds."},{"comment_id":"10154462849065695","commenter_b":"True and at the end of the day she going to be black im going to be white and nothing can be done about it. Oh and what the crap about drunk like most white girls? Yes that is a stupid remark","commenter_a":"Wow Sabrina why even make it a race thing.","post_message":"Police are asking anyone with information about what happened to Brenda Arreguin to come forward."},{"comment_id":"1561423844160413","commenter_b":"@username 😜","commenter_a":"@username me","post_message":"One 38-year-old Liverpool man took 39 goes to pass. 🚙"},{"comment_id":"478375502350743","commenter_b":"Ridiculous. Stop this nonsense","commenter_a":"Pay the fine..it's a small price to pay for all God has given us.","post_message":"Obama's America hating Christianity..."},{"comment_id":"10152776744107217","commenter_b":"Vicki Wray better start thinking of other names 😂😂😂😂","commenter_a":"Beautiful names xxx","post_message":"#RoyalBaby: Introducing Charlotte Elizabeth Diana - she'll also be known as HRH Princess Charlotte of Cambridge"},{"comment_id":"10153608463849440","commenter_b":"You are so uneducated, illiterate and pathetic. Worthless. Parasite. A rodent of no worth or accomplishment.Stop #WhiteGenocide 14/88","commenter_a":"Colorado is the epicenter of #WhiteGenocide and the GOP here is allowing it because they're afraid of calling Amy E. Brown and her #Blacklivesmatter5280 terrorist friends out.","post_message":"Editorial: Colorado Republicans made a big mistake in abandoning the 2016 presidential caucus."},{"comment_id":"556378537889545","commenter_b":"Freaking self-professed child molester. Figures she would be a surrogate for killary","commenter_a":"ok, Im wondering etf is lean dumbham ??","post_message":"Just when you thought she couldn't sink any lower..."}]
