[{"comment_id":"10154951315667235","commenter_b":"Oh, well, let's just kill the bitch. Thank goodness there are smarter people in America than people like you. Pick a fight that matters.","commenter_a":"Not going to watch her. She has no credibility or can be trusted. She was part of the Obama hate and lies machine that paid her millions of dollars to create the monster who is going to be our president. I am not going to watch her. Get trusted news from FSTV.","post_message":"That time Megyn Kelly told children that Jesus and Santa were white?  It wasn't the only time..."},{"comment_id":"10152958959170927","commenter_b":"she can give up citizenship which is just fine with me, at least in this country she can say this stupid remark, want to try to do so say in Hungry","commenter_a":"Leave","post_message":""},{"comment_id":"10154767405540575","commenter_b":"So surprised (NOT)!","commenter_a":"That has been standard operating procedure for n0bama and his corrupt administration since day one........","post_message":"BREAKING NEW REPORT FROM FEDERAL AUDIT...  Stupid Facebook pulled in the old title which has a typo!"},{"comment_id":"10154815795872936","commenter_b":"Maybe Canada would take us. They always wanted the Pacific Northwest.","commenter_a":"The rest of the country is dragging California down.. do we really have to be in the same union as knuckle draggers Mississippi, Kentucky, West Virginia, etc.? I'm beginning to agree that California should secede, go our own way.","post_message":"Gov. Jerry Brown's fiery take-down of Donald Trump: \"We've got the scientists, we've got the lawyers, and we're ready to fight.\""},{"comment_id":"10153516568789087","commenter_b":"Muslim is not a religion it describes someone who worships Islam. Guess what ISIS stands for? Its the radical group of Muslims you understanding? Its a Muslim group of people that engages in terrorism. Trump wants to ban Muslims from coming here and he wants American Muslims to help us sort out who is good or bad.","commenter_a":"How is Trump a white supremacist? He has never said anything racist okay \"illegal\" is not even a race. Trump has said millions of times he supports immigration. What he does not support are people that are dangerous getting free cards to come here. Also to those who say illegals don't use Government assistance they do. They fucking come here have an anchor baby and then use the babies citizenship to get Government assistance. We have a serious problem I have a Mexican friend who is American with perfect credit and great job. She tried to buy a house and got told no. Guess what same house and a family both illegal except their 2 girls bought the house. How is that fair to anyone? Illegal immigration impacts Mexicans who are already here legally and it's not fair to them if others cheat the system. If you are so damn ...","post_message":"“I would certainly return it if you think it is appropriate,” Donald J. Trump told a voter who asked if he would return the donation he received from noted white separatist William Daniel Johnson. “I would return it. Don’t be so angry, I don’t even know who he is.”"},{"comment_id":"10153604514287293","commenter_b":"@username Deport the illegal immigrants in Palestine, back to Minsk, Krakov, Vilnius and Brooklyn, where they were BORN.","commenter_a":"Stop all to the Israeli Colony.","post_message":"“Even the United States doesn’t have anything as complex, as sophisticated.”"},{"comment_id":"936212533138468","commenter_b":"Stupid bastards, Mexicans are not the only illegals in this country, canadians, europeans and some Asians... Also blacks are not leading the welfare race, more whites are on welfare than the rest of the races! Let that marinate..... Get your assets out there and pick strawberries if you support trump so readily","commenter_a":"Americans will be lining up - lining up - I tell you - for those lucrative strawberry picking jobs.","post_message":"Turns out America's food production relies heavily on immigrant labor, and our farmers are NOT pleased."}]
