[{"comment_id":"10152843284606519","commenter_b":"How about you pay for your own? Why do I and the rest of the taxpayers have to pay for you losers? Stop being a fucking whore or just swallow next. time. Cum guzzling gutter slut sounds about right.","commenter_a":"400 million dollars plus the tax payers have paid to keep Planned Parenthood in operation. I understand it is cheaper to kill the child then pay for it in the form of welfare, Medicaid, HUD and food stamps. 56 million have been dismembered in the womb thus far. My question is where did the idea of the taxpayers paying for people's mistakes come from? Why should I be obligated to pay for other's mistakes? I am not and neither are any taxpayers. You fucked, you knew the results of fucking without birth control....fuck you and your offspring.","post_message":"\"I believe that abortion care is a positive social good. I suspect that a lot of other people secretly believe the same thing. And I think it’s time we said so.\""},{"comment_id":"10153454938709330","commenter_b":"R.I.P","commenter_a":"Just heartbreaking ... Your with your mom...Rest in Gods Grace and Peace.","post_message":"Sad news to report. Bobbi Kristina Brown, daughter of Whitney Houston and Bobby Brown, dies at 22.  More here ---> @webpagelink"},{"comment_id":"10154704981818812","commenter_b":"Shut up Ayesha","commenter_a":"NBA is rigged!","post_message":"U.S. men's basketball team earns gold for third consecutive Olympic Games and the sixth time in seven tries with NBA players."},{"comment_id":"10152949187346130","commenter_b":"Heheheh I don't need a beard to attract women and prove dominance. It's all in confidence and your attitude. You want dominance? Push me far enough and you'll find out your place real quick! ;)","commenter_a":"lol","post_message":"It's just evolution."},{"comment_id":"10153622480508690","commenter_b":"Nna, infact you get am","commenter_a":"And this is not a problem at all to the world peace, unless when Israel bombs Hamas terrorists, then it will be a problem for the world peace. Hehehehehehehehe One good thing people should learn is that Muslims from the unset, have always wanted to dominate. Whether Muslims like it or not, Israel of today will never succumb to them again. If Israel is the problem of the world, then Palestinians should try and leave the land of Israel and let's see whom Israel will kill again. Thousands are dying in Syria, Yemen and Iraq, yet it's not a problem to the world peace. Tell that to the birds. Never ever succumb to the demands of any Muslim community, if u give them one today, tomorrow they will demand for 3. Always push them back or they will over run u. This is why i pity Europe,maybe they are not ...","post_message":"Syrian government has conducted nearly 7,000 air strikes during the month of July, according to the Syrian Observatory for Human Rights, making it the most intense bombing reported in one month since the beginning of the conflict in 2011. @webpagelink"},{"comment_id":"1237347102949965","commenter_b":"You and me, (and millions of others, I'm sure), both!","commenter_a":"It isn't because she's a woman. I would stand in line for 5 hours to vote for Elizabeth Warren. Hillary? *shrug* It better be a short line.","post_message":"Here’s a strong but fair piece from the heart on the media establishment in DC by CNN’s Jeff Greenfield, whose long experience in politics and journalism began with Robert F. Kennedy back in the 60s."},{"comment_id":"10153782621653869","commenter_b":"That's been exactly the narrative. It's about time for a woman president. There's a special place in hell. Bernie girls are just boy-crazy. It's her turn. Thou shalt not question Her Inevitability.","commenter_a":"The media have been crowning her daily since 2015. Your daily reminder that at this point in 2008, her backers (motto: \"Party Unity My Ass!\") were still promising a bloody floor fight at the convention and demanding she be awarded all the illegal Florida delegates. Something to remember when you hear Hillarrhoids calling for you to \"line up behind her.\"","post_message":"Today's Daily Cartoon by Kim Warp. See more cartoons with our randomizer: @webpagelink"}]
