[{"comment_id":"10153779566119170","commenter_b":"Bush is a tush","commenter_a":"They need to stop this childish back and forth banter, and get back to the serious problems that need to be solved in this country! SMH...","post_message":"Jeb is pulling out all the stops on trashing Donald J. Trump, even comparing the billionaire to ultra-liberal filmmaker, Michael Moore. Of course, Trump had to respond!"},{"comment_id":"10153700532617894","commenter_b":"Make me. Hip hop is my lane. Silly woman.","commenter_a":"What is she doing at a T.I. concert if she don't want too be questioned.","post_message":"Model Shot at T.I. Concert to Sue ‘Heartless’ NYPD for Treating Her Like a ‘Criminal’ During Their Investigation"},{"comment_id":"10153677360299641","commenter_b":"She is worth more than all of Isis put together.","commenter_a":"Mary Knoll","post_message":"This is Diesel. She is a 7-year-old police dog French police say was killed in the raid today.  Here's what we know about the raid so far: @webpagelink"},{"comment_id":"1115311211854904","commenter_b":"We don't need more people coming here from anywhere. Immigration is to benefit the country not the immigrant. We gain nothing by allowing more here when we can take care of our own","commenter_a":"North Carolina here voting TRUMP 2016","post_message":"\"I'm the only one that speaks my mind and tells the truth and everybody knows I'm right.\"  Today on \"MediaBuzz,\" Donald J. Trump discussed his proposed temporary Muslim ban. @webpagelink"},{"comment_id":"1216368028409389","commenter_b":"Allyson the bitch","commenter_a":"Donald the Clown and his Republican surrogates will lose big time !! Only imbeciles will believe he stand by working class Americans","post_message":"I stand for ALL AMERICANS! Deplorables, basement dwellers, I stand for ALL of YOU!"},{"comment_id":"10154356585776509","commenter_b":"The mass shooter in California, were not by Americans. They should establish a law that anyone who comes into this country looking for citizenship should established themselves as Americans ,have at least 2 year or more waiting period. Until they do an extensive background check","commenter_a":"When black people kill white people and rape white women you don't see no tears from Obama. When Muslims terrorize and kill people cut Christians heads off you don't see no tears from Obama","post_message":"President Barack Obama wipes away tears while speaking about victims of gun violence: \"Every time I think about those kids it gets me mad.\" @webpagelink"},{"comment_id":"10153332076309411","commenter_b":"Remove NATO from their borders","commenter_a":"Russia must stop being aggressive by removing all warships, and submarines, from international waters - these waters belong to the US and its allies, even though they are international :)","post_message":"The 'hunt' is on"}]
