[{"comment_id":"10153503601036770","commenter_b":"BLM? not at all! worthless savage racists. if they think that their worthless lives matter then go into the dangerous crime ridden ghettos created by blacks and convince them to stop killing each other. I would rather give black thugs target practice so that they don't hit innocent bystanders when trying to shoot each other.","commenter_a":"SCREW BLM...","post_message":"A controversy has erupted at Dartmouth College after a pro-police display was torn down by Black Lives Matter activists, who denounced it for memorializing the \"perpetrators\" of \"state violence.\""},{"comment_id":"979362338768669","commenter_b":"Guys don't have tits !","commenter_a":"It's called hooters. No man with big boobs should be allowed to serve food in a skimpy outfit. Gross","post_message":"This may surprise a lot of people!"},{"comment_id":"10154862137916756","commenter_b":"Yes, It's sad to see our Democracy gone to Totalitarianism. We're ruled by the subversive evil Corperations who War on terror was a scam. More honestly put it was WAR to produce terrorist so Corperations could exploit, kill and take down America itself by stripping freedoms as the Patriot act does and by spending the majority of monies on WAR. Now the Red Scare if being probigated by the Democreeps","commenter_a":"I'm stressed about the ugliness that this election has revealed in my fellow Americans. It is disgusting and frightening.","post_message":"Are you?"},{"comment_id":"10152956106239877","commenter_b":"It always existed except my dark skinned Sista women had it worse.","commenter_a":"True statement Colorism exist","post_message":"'Empire' Actress Grace Gealey: 'I Was Discriminated Against For Being Light-Skinned.' Read more on her revealing statements here.  Grio fam, sound off with your thoughts on all she had to say."},{"comment_id":"10153733142212708","commenter_b":"Looking at the next Presidential Family.","commenter_a":"Have a blessed Thanksgiving. You have a lovely family and we all have so much to be thankful for on this day. All the best to you on the campaign trail. A special thank you to the brave men and women who are serving in our military worldwide who can't spend the day with their families. They need a Commander-in-Chief who can provide them strength and guidance during troubled times and you, Senator, can do just that. Warm regards.","post_message":"From our family to yours, Happy Thanksgiving"},{"comment_id":"10155314611590652","commenter_b":"hahaha! this is amazing","commenter_a":"@username apparently the jar of mayonnaise episode anticipated this.","post_message":"\"Life is best when it's a bit strange.\"  This weird new reality show has millions of people pretty much watching paint dry:"},{"comment_id":"1300695323356852","commenter_b":"Get educated. Oh that's right you don't want the truth only lies from the most disgusting pig.","commenter_a":"Hillary supporters, How do you put Syrian refugees before American people? How do you look a homeless vet or child in the eyes and say sorry I won't help you. Oh the same way you turned your back on American's in Benghazi.","post_message":""}]
