[{"comment_id":"595052750663656","commenter_b":"So RACIST I used to really like her. Now o can't stand her..","commenter_a":"And we don't want to hear you talkm","post_message":"THE VIEW’S Whoopie Goldberg To Co-Host: “This Is Why Black People Don’t Wanna Talk To White People” [VIDEO]"},{"comment_id":"10153655061641336","commenter_b":"There not illegal immigrants, they are Illegal Aliens. Death penalty for them!!","commenter_a":"Deportation or jail time is not good enough, eye for an eye. Capital punishment","post_message":"“This was not a random incident,” Sheriff Mike Chapman said at a news conference Saturday. “The suspects and the victim were known to each other.”"},{"comment_id":"10153369157063984","commenter_b":"Fire them all and make new hires sign a contract that if they are caught stealing anything they will pay back double the amount of the theft. The citizens work hard for their money and it is the taxes they pay that keeps those in Washington working.","commenter_a":"Hey, as long as they're paying for their gambling and \"adult entertainment\" out of their own pockets, well..... that's between them and God! But, if I'm paying for any part of it, then \"nail them to the wall\"!!!","post_message":"This has got to be a big embarrassment, and they probably thought they'd gotten away with it..."},{"comment_id":"2076295639262230","commenter_b":"Who is Jill Stein?????","commenter_a":"Throw your support behind TRUMP all of you Bernie supporters!!!!","post_message":"Breaking News: Democratic National Committee Chairwoman Debbie Wasserman Schultz will not preside over her party’s convention in Philadelphia following email leak suggesting anti-Bernie Sanders bias, Fox News confirms. @webpagelink"},{"comment_id":"10154137971976323","commenter_b":"You cannot stop it, it's a done deal. The pacific couldn't stop the TPPA, North Americans couldn't stop NAFTA. These deals are done above our heads, I very much doubt you would be allowed to leave the EU even if you wanted to.","commenter_a":"Have you read the EU's conditions on public services they want within TTIP? It looks to me as though these would offer considerable protection to NHS services; are we sure that our Government would have similar protections? See @webpagelink I was very much against TTIP and concerned about EU position until a colleague brought this to my attention.","post_message":"\"If being in the EU has brought us TTIP, it has also brought us the means to stop it.\""},{"comment_id":"10154551617736336","commenter_b":"Voting TRUMP, you dirty COMMIE BSTD... Only people like you get filthy rich off our flesh and blood! New WORLD ORDER NUT JOB","commenter_a":"This coming from a PURE MORON.","post_message":"Speaking in Austria, European Union chief Jean Claude Juncker said, “We have to fight against nationalism, we have the duty not to follow populists but to block the avenue of populists.\""},{"comment_id":"1191494990889956","commenter_b":"I could care less what that judge has or says, I AM TRUMPED ALL THE WAY TO THE WHITE HOUSE !!!!!! THAT FREAKIN JUDGE JUST DON'T WANT THE WALL !!!!!!!! TRUMP 2016","commenter_a":"Boy, if Obama worked as hard pleasing the people as he does trying to destroy the republican front runner we'd all say he was great instead of destructive.","post_message":"HISPANIC JUDGE THE NEWEST ATTEMPT TO DERAIL TRUMP  @webpagelink"}]
