[{"comment_id":"10155458393115389","commenter_b":"No, she sucks!","commenter_a":"This is a Tempest in a tea pot. Hillary Clinton will be the next president.","post_message":"Another bad week is shaping up for Hillary Clinton."},{"comment_id":"467273093466185","commenter_b":"Hello . It is ok to call this guy a f....t ?","commenter_a":"Haven't we learned that terrorist have the greatest amount of patients and will take years and alter thier lives how ever they need to to carry out a plan. Throwing us off course, that's part of thier plan. Taking our attention away, part of the plan.","post_message":"Orlando shooter who killed 49 people at the Pulse nightclub was himself a regular patron of gay clubs in Florida for years, classmates, friends and club employees say."},{"comment_id":"10155022606302501","commenter_b":"Why. Dont. U. Suck. His. Cock. Bitch.","commenter_a":"Donald Trump is a psycho and a nut has no business running for president","post_message":"John Kasich will be on the outside looking in for the RNC, but what is he really up to?"},{"comment_id":"10154028997088132","commenter_b":".. she is ugly","commenter_a":".. & soo - Kris Jenner is ugly","post_message":"Grandma Kris Jenner has arrived!"},{"comment_id":"806494949541082","commenter_b":"The same way , but don't get caught . You will go to jail and stay . They get a pat on the back !","commenter_a":"Bullet to the head","post_message":"Muslim Terrorist Arrested After Threatening FOX In The Worst Way Possible.  Radical Islam is becoming a domestic threat.  How should America respond?"},{"comment_id":"10153954150653606","commenter_b":"actually I love me some Tom Collins","commenter_a":"Love me some Pat Collins","post_message":"FUNNY MOMENT OF THE MORNING: \"I have more layers than a Smith Island Cake\"- Pat Collins"},{"comment_id":"10155973648509199","commenter_b":"This Woman is money smart. Say it with me. This Woman is money smart. She will wind up moving up at her job to the highest position, paying more taxes, and bettering her life. People around her will be better from her life. She will put out better quality in everything she does or touches. It can all start with positivity here and with acknowledging that this Woman is money smart.","commenter_a":"Those berating the mom...it is her employer who is getting the \"subsidy\" by being able to make more profits by paying wages families cannot live on - of course they also can sell things for less, so consumers pay less, so they benefit. Wondering where she lives that that's a years rent, where I live that's a couple of months. Messed up system, but glad for her fam.","post_message":"\"Instead of buying my kids the latest Jordans or fancy electronics, I paid my rent for the YEAR. I a single mom and I do it all by myself on a minimum wage job.\""}]
