[{"comment_id":"10154079186342541","commenter_b":"@username what are you talking about ?","commenter_a":"Officers do well checks. Would have taken a few seconds for a FB friend to call the cops and have that phone traced.... SMH.","post_message":"\"It's amazing for someone to sit there and see somebody or hear them take their last breath, and nobody did anything.\""},{"comment_id":"10152608656372894","commenter_b":"Women also cheat with their hearts minds and bodies too soooooooo","commenter_a":"The pic of him with the female outside the car looks like he was taking a pic with someone ... Ppl have cousins sisters groupies fans and friends that they don't sex !!!all these bitter broken hearted ppl jumping the gun obviously wasn't nothing serious he joking about it on Twitter .... Buuuuuut carry on","post_message":"Was Nick Young Caught Creepin' on Iggy Azalea in the Car SHE Bought Him for Christmas? [Photos]"},{"comment_id":"10153359922053984","commenter_b":"No more Muslims in this country. Enough is enough. Send the Muslims and Obama packing.","commenter_a":"Trey I love you to the moon and back, you are our only hope!!!!!! Keep up the wonderful things you are doing.","post_message":"Classic Trey Gowdy. State Dept. wants to send Muslims to these U.S. states, but they'll have to get through him first.  Do you agree with Gowdy's demands?"},{"comment_id":"988150574624052","commenter_b":"They are acting like school kids, so the best way to handle them is to ignore them.","commenter_a":"get off the dang eggs birdXD","post_message":"EAGLE CAM DAY 4: One egg has cracked and we spotted an eaglet. Watch it fully hatch now: @webpagelink"},{"comment_id":"1687846428128746","commenter_b":"What a nice sounding kid.","commenter_a":"Build that wall for America and make it big and strong! Trump 2016!","post_message":"I have built so many great and complicated projects – creating tens of thousands of jobs in the process. Building a wall is A LOT easier than building a 64 story building!  LET'S #MAKEAMERICAGREATAGAIN  www.DonaldJTrump.com/Nevada"},{"comment_id":"448351221956139","commenter_b":"I'm from Texas and Perry has done a good job for jobs and everything else, except shutting the border down. He gets an F for that...........","commenter_a":"Trump,Rick Perry is a very bright man.He lead Texas very good for many years.","post_message":"It seems that Donald Trump has now turned his attention to this rival GOP candidate."},{"comment_id":"10154562664816037","commenter_b":"Build Bridges Not Walls","commenter_a":"YES!! as part of an overall plan on illegal immigration . Please Remember that Sen. Hillary Clinton voted twice and lobbied for a border wall!!!!","post_message":"Would Donald J. Trump's proposed wall help?"}]
