[{"comment_id":"10153188400962894","commenter_b":"@username pediatricians have long ago said this is unsafe for children. Their immune systems cannot fight off adult germs. I am sure you want to keep your niece safe, right?","commenter_a":"North West is really cute. Kim should probably stopped letting Khloe kiss her baby in the mouth tho","post_message":"Kim Kardashian Shares Adorable New Photo Of North West With Her Curly Hair"},{"comment_id":"1067523319975236","commenter_b":"That must be beacause he dosent want to give his money away....she must have hit her face he self lol","commenter_a":"His family knew she was only with him for the money. She was a lesbian when they got married. I highly doubt he would be dumb enough to hit her where he left a mark. His other wife never accused him of this. How convenient he just did it when she is wanting a pay day to go back to get female lover","post_message":"Amber Heard kept her head high after filing a domestic violence restraining order against Johnny Depp."},{"comment_id":"10153991958186509","commenter_b":"Remember We are talking about illegal immigrants ILLEGALS","commenter_a":"Ricky Martin, go back to singing and dancing. Trump was referring to illegals....illegal is a status not a race. BTW, I'm not a Donald Trump supporter, but I can see the difference.","post_message":"Ricky Martin blasts Donald J. Trump for making \"racist, absurd, incoherent, and ignorant\" comments about Latinos. @webpagelink"},{"comment_id":"1705082506417935","commenter_b":"RACIST ASS HOLE!","commenter_a":"Trump is not for the KKK either Charlie.It's more likely that the Dems are still in bed with them","post_message":"\"What I really meant to say was...\"   WATCH:"},{"comment_id":"10153451640786973","commenter_b":"Regarding your Columbus post earlier, in my school he isn't credited with what you are saying. Blanket misconceptions are counterproductive, especially when it comes to school. Much like the Pledge crap that goes around... we do the Pledge, even if Fox news says otherwise.","commenter_a":"When my children are sick, they'll miss school. When they have dentist appts they'll miss school. If I decide it, they'll miss school. I'm the parent, our family's needs come before school administration's needs. Period. The school is LUCKY to havey children attend and i warch them like a hawk. Our childrens mental health is more important than grades and standardized testing!! And @username you've got to be high on meth if you think for one minute every doorstep wants or needs a social worker or, the GOVERNMENT rather, invading their privacy, trying to make parenting decisions or stomping on civil liberties on even the smallest scale. I wouldn't put up with that for a second. And haven't you been paying attention to what a total, corrupt failure DHS is anyway??? Ridiculous notions.","post_message":"Oregon schools have done little to intervene despite having 94,000 students miss at least 10 percent of the school year."},{"comment_id":"10153547660103854","commenter_b":"Hates those who serve. Loves the illegals","commenter_a":"Scum of the earth","post_message":"ULTIMATE BETRAYAL: Obama To Cut Healthcare Benefits For Active Duty And Retired Military"},{"comment_id":"10154151440809087","commenter_b":"Hillary is for women. I don't blame her one bit, those whores knew Bill was married!","commenter_a":"In 1978, Bill Clinton violently raped Juanita Broaddrick in a Little Rock, Arkansas, hotel room, then, as he was leaving, looked at her bloody lip and said: \"Better put some ice on that. Corroborated by five contemporaneous witnesses Knowing full well about Bill Clinton proclivity to sexually assault women, about three weeks after that rape, Hillary Clinton cornered Broaddrick at a party and said, pointedly, just want you to know how much Bill and I appreciate the things you do for him. Do you understand? Everything you do. In the early 1990s, Bill Clinton invited a young female staffer to his hotel room at the Excelsior Hotel in Little Rock, dropped his pants and said, it. As CEO of an organization, Bill Clinton had a young female intern just months out of her teens, perform oral sex on him while he made business calls. That girl name was Monica Lewinsky. ...","post_message":"#BREAKING: Former Utah governor Jon Huntsman's shocking call for Trump to quit comes one week after saying he planned to vote for him."}]
