[{"comment_id":"10152978726794342","commenter_b":"Yep that's some more B.S. All of the jobs that illegals are here taking were done by American citizens before you came. Your comment is without any truth whatsoever!!!","commenter_a":"All this jobs yall dnt do the hispanic race does !","post_message":""},{"comment_id":"10153203916923984","commenter_b":"Stand By Him- Military knows they are the boss-but a chaplain has an higher boss. Military should not let this man go.","commenter_a":"Why only a 1 month assignment as assistant? Is that the norm? Missing pieces of this story.","post_message":"This highly decorated vet and former SEAL chaplain is facing something unexpected after 19 years of service...  Do you stand by this lieutenant commander?"},{"comment_id":"10153826887651179","commenter_b":"It was at the place in France where the ladies wear no pants.","commenter_a":"going back to their roots? lol","post_message":"$55 million dollars of cocaine was found at a Coca-Cola plant in Signes, France."},{"comment_id":"10157618931615389","commenter_b":"And Hillary has never lied right? Are you serious right now? Hillary has been exposed for who she is and it's not looking good for her. For she is so squeaky clean, why does she keep hiding from the media? She is always at home resting. She used her position to grant favors to foreign governments and took millions from them when they abuse women. You are worried about Trump being exposed on that debate stage? What a joke!","commenter_a":"The snake oil salesman's chickens come home to roost Monday night. Hillary & moderators will quickly expose the lying fraud artist for the flip-flopping liberal he's always been.","post_message":"\"Because they can't attack him on policy, they try to make it personal. They appeal to the emotions and the sensitivities of not only the black community, but the foreigners and females.\"  Pastor Darrell Scott said the Democrats don't attack Donald J. Trump politically because personal attacks are \"all they have.\""},{"comment_id":"10154214106757411","commenter_b":"Girls like this get bigger diamonds","commenter_a":"Kathleen O'Connor ~ too bad they didn't have the first look when we all got married.","post_message":"A bride from Chicago wanted to make sure to give her groom a \"first look\" he would never forget... 😂"},{"comment_id":"1349180015160531","commenter_b":"I'm guessing it won't be Christians?","commenter_a":"Now we know what iran is using all that money obama gave them for. Old Valerie has been running the government for some time. Once these nuts get you guns guess who will march in.","post_message":"In a sickening op-ed piece for The Huffington Post, Valerie Jarrett basically \"killed off\" her own grandpa in order to push for her agenda... GUN CONTROL.  This is absolutely revolting... take a look at what she did."},{"comment_id":"10154087270880047","commenter_b":"Oh hell no - the responsibility lady falls on the dingbats having unprotected sex for hell sakes...","commenter_a":"Wonderful.... Just incredible how everyone is so consumed with life at conception. I have yet to hear a plan from the Pro-Life movement that will ensure these \"life begins at conception\" babies will receive all of the necessary love and care that a child so rightful needs & deserves. This becomes YOUR responsibility!","post_message":"VICTORY: The U.S. House of Representatives passed the \"No Taxpayer Funding of Abortion Act\" by a vote of 238-183.        This is a significant, bipartisan step forward for the pro-life movement."}]
