[{"comment_id":"754556321401612","commenter_b":"Tie them by their ankles to a fast moving train!!","commenter_a":"This is the mine set of Muslims. That it's ok . Send their asses back","post_message":"Group Of Muslim Migrants That Gang Raped 16 Year Old White Girl Get Devastating News They deserve much worse than this. What do you their punishment should be?"},{"comment_id":"10153628379818145","commenter_b":"Feed your own kid. Simple fix. And teach the little demon to sit still and learn.","commenter_a":"My son is 6, and gets recess twice a week!!!! Twice!!! He then gets in trouble because, as most 6 year old boys, he gets out of his seat and wiggles all day. But the kicker is what he's fed! Sugar sugar sugar for school breakfast! He's even come home and told me he had a freaking pop tart! What the crap! Then he's punished for their stupidity. Schools need to lay off the sugar, and allow for atleast 20 minutes for recess. I vote for 20 mins twice a day. My son would be SO much better for his teacher! (Oh, and I agree with many comments....get rid of this common core crap! It's just that....CRAP!!!)","post_message":"Do you think that Florida elementary schools should be required to provide 20 minutes of recess every day?"},{"comment_id":"10155160536813132","commenter_b":"I can't stand her...","commenter_a":"I don't know about her being an A-lister...","post_message":"Donald J. Trump spoke out about the decision on Twitter."},{"comment_id":"1016358938401725","commenter_b":"MONEY !!!!! That's all they care about !","commenter_a":"probably worried about all the money they have stashed in offshore funds they may have to pay tax now","post_message":"\"I don't think I've ever wanted magic more.\" J.K. Rowling, James Corden and more British celebrities react to the historical #EURef vote. @webpagelink"},{"comment_id":"1281382285238371","commenter_b":"Well said. If this Jolie live in Muslim country like we do ,then her opinion about Islam will radically change. She should know the Muslim will never compromise with others..stupid","commenter_a":"I don't listen to rich new world order liberal fucking wackos. If the come out and try to tell us all to do something. Its never ever good. This Bitch is rich living in nice safe places. Safe from the hell the rest of us would have to deal with","post_message":"DOES ANYONE CARE WHAT THIS LOSER HAS TO SAY?"},{"comment_id":"10153576717714024","commenter_b":"This is what's wrong with our country. Not just the BRAINLESS, CLUELESS, MORONS like her in congress, but THE SAME ONE'S THAT PUT HER THERE!","commenter_a":"They do indeed walk among us and get elected","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink #BB4SP"},{"comment_id":"10154183744199091","commenter_b":"She is a baby killer","commenter_a":"Trump belives in God and life & Americans clinton she is evil she is for aborting a baby in late term open borders allowing evil in our country no I voted Trump.","post_message":"Who do you think will be the next president of the United States? Send us a blue thumbs up for Hillary Clinton or a red heart for Donald J. Trump."}]
