[{"comment_id":"389899691198325","commenter_b":"No comment !!! But she better Pray that Her President doesn\"t get away with his Immigration Laws ??","commenter_a":"Get a JOB!!!!","post_message":"Another welfare queen...:/"},{"comment_id":"460098450844429","commenter_b":"Idiot, cite a source.","commenter_a":"Homicide and violent crime rates are down, twats. They're lower than they've been since the early 90's-you focus on \"gun murders\" instead of all murders because the facts don't back up your propaganda.","post_message":"America's big problem is lethal violence  and that's driven in large part by guns."},{"comment_id":"1142484579135691","commenter_b":"It will recover","commenter_a":"Guess what the pound is at a 31 year low at the moment, figure out for yourself what will happen to your economy in about an year, idiots.","post_message":"\"And we'll have done it without a single bullet being fired\" - Nigel Farage @webpagelink #EURef"},{"comment_id":"10153326702079877","commenter_b":"It doesn't make no sense for a woman to get sloppy drunk","commenter_a":"I just don't understand","post_message":"Man finds wife naked in bed with her father...then gets stabbed after an altercation. Read more of the details below.   Grio fam, we can't imagine. What would you do?"},{"comment_id":"10153446072426545","commenter_b":"Why would that CRAP sell out? It looks like a hooker dress. Either that or she LOST the other half.","commenter_a":"I want to hear more about why the SWAT team was deployed in W FTW.","post_message":"The sisters, who have previously collaborated on clothing lines with PacSun and Topshop, celebrated the launch of their \"first-ever ready-to-wear collection.\""},{"comment_id":"10153101911354877","commenter_b":"Give an inch and they take a mile.... true, but knowing that why even give an inch? She's just trying to get attention. If she were a normal woman she would be on every comment feed talking about \"like me on instagram\"","commenter_a":"I don't understand why some celebs consider sharing EVERY aspect of their lives but when they are judged or talked about they immediately ask for 'privacy'.","post_message":"'I demand that I climax': Nicki Minaj gets candid about her sex life in Cosmo - and where she sees herself in ten years.   Grio fam, do you find it refreshing when celebs open up like this? Or is it T.M.I?"},{"comment_id":"10153562430331350","commenter_b":"Shut up you stupid woman","commenter_a":"Why do white think they can break rules ? Anyone hunts is a savage, and they are going to suffer, that's the way they think you can treat black people also, you and your seeds will suffer, and it's long overdue, there is no way God gave me this same book to worship as the white man. Break the curse and burn the bible.","post_message":"Legal analyst Lisa Bloom explains what could be next for the dentist."}]
