[{"comment_id":"621940064660952","commenter_b":"everyone can do something....u are allowed to make a certain amount of money....pay enough and you can get any documentation from a doc. disable now a days has a broad spectrum.....defining disabled. ....I know Vets that have missing limbs and they have to prove every year that the limb is still missing and gas nit grown back","commenter_a":"these so called christian politicians could learn some thing about welfare and hand outs to people who don't want to work. 2 Thessalonians chapter 3 verse 10. (even when we were with you we commanded you this,if anyone will not work neither shall he eat. amen.","post_message":""},{"comment_id":"504677803025508","commenter_b":"Can't stand Mcain","commenter_a":"John Mccain almost crying because he's losing his beloved mercenaries under Russian airstrikes - @webpagelink","post_message":"What is really going on?"},{"comment_id":"10154485481559641","commenter_b":"What @username said ,is d same as oral sex...@ @username,gay pple does disgusting things as such too","commenter_a":"ORAL FECES SEX ..The Insanity, of those who participate in the ingesting of feces want acceptance for this \"NASTY\" diseased behaviors. Why because it makes for sickness, spreads a few disease`s to other humans that are deadly and dangerous disease`s. Calling the practice of ingesting feces \"normal and natural\". Tainted Blood, Fecal Infections and Perverted. Science tells us humans not to injest one anothers feces. The spread of disease is everyones business. Equality or Insanity.","post_message":"\"This will be the 22nd marriage equality bill in Australia and we still haven't got (LGBT) marriage ... what are we doing wrong here?\""},{"comment_id":"10153980476181336","commenter_b":"She's a United States Soldier . How dare they ? Iran will soon remember what respect is .","commenter_a":"When you are in a foreign country, you follow the laws, customs, and rules of that country. The female sailor is covering her head because that is what women do in Iran.","post_message":"Megyn Kelly: “What is our female sailor doing with a headscarf on?\"  Newt Gingrich: “She’s being imposed upon by a dictatorship that is deliberately humiliating her and deliberately imposing their value system.”"},{"comment_id":"10155066406976509","commenter_b":"Don talking bull**** without proof !","commenter_a":"Everyone dopes in the Olympics China, USA, Germany you name it, everyone, the Russians were just dumb enough to get caught.","post_message":"BREAKING NEWS: Russia has failed in its quest to have a ban on its track and field athletes at the Rio 2016 Olympic Games overturned."},{"comment_id":"10153249874686051","commenter_b":"Girl... You are so sooo wrong! I guess you think Hillary would have answered the question.. Lol","commenter_a":"Trump had NO intention of ever calling on this great reporter - his questions would have been too complicated for Trump to answer. Even later when the reporter comes back in after his \"time out\", Trump badgers him.","post_message":"Here's how Donald Trump responded when a reporter interrupted his press conference."},{"comment_id":"10152846459704205","commenter_b":"African wisdom here seems to be too verbose.","commenter_a":"Larry is a voice which needs amplifying as he speaks to our being qualified to run America's business of governing. His professorial countenance with assurance of our intelligence to grasp the duties and tasks for citizens of our land to undertake he does with the smoothness that is purely African wisdom.","post_message":""}]
