[{"comment_id":"10153289049898256","commenter_b":"See? You sound like someone who is over 40.","commenter_a":"Stefan, stop being a dinosaur.","post_message":"And now an important message from Chicago Confidential columnist Melissa Harris:   Please stop putting two spaces between sentences. It makes you look like a dinosaur.  What say you: One space or two?"},{"comment_id":"10153527716947623","commenter_b":"Trump will get enough advertising on Buzz feed by way of the anti Trump protestors acting like idiots. If you watch a video of people getting assaulted and are ok with it then you don't have much of a moral character. Why should America allow illegal immigrants to keep coming in and why shouldn't we have the ones here deported? There are legal ways of coming to this country use that rout and people will respect you more. Don't want to become legal then don't come to the USA. Stay in the country you are from.","commenter_a":"Wow, this is pretty pathetic. Considering Trump's numbers I believe we can infer he'll continue to do just fine without Buzzfeed's advertising lol. Can't wait to see their reaction this January! #Trump2016!","post_message":"\"We don't run cigarette ads because they are hazardous to our health, and we won't accept (Donald J. Trump) ads for the exact same reason.\""},{"comment_id":"10153150009791037","commenter_b":"They will bitchhh","commenter_a":"USA ... root cause of evry problem in world!!!","post_message":"#NorthKorea fired two short-range ballistic missiles into the sea and vowed \"merciless\" retaliation as the U.S. and South Korea kicked off joint military drills denounced by Pyongyang as recklessly confrontational."},{"comment_id":"1512686248764628","commenter_b":"Oranges are offensive, they resembles balls, likes men's balls! such a coincidence that white males eat oranges?! patriarchy for sure","commenter_a":"This article is very misandrist and perpetuating the matriarchy. All men are handsome inside and out. Try being more accepting, less shallow, and do less femsplaining UGG #triggered","post_message":"\"If someone was quite a weird child, he tends to be a great date.\""},{"comment_id":"10153098035411336","commenter_b":"No black race can prosper in caucasian society africa today has more midlle class than india our people in united states are in hell we africans has more future than them i hope one day they would come back to their motherland and leave the caucasians with their stolen land","commenter_a":"Time to clean up your act. Why do Asians, Europeans and other immigrants acclimate themselves into society but after 150 years blacks still expect others to take care of them. They are a society of takers and beggers. I'm sick of it. Why has Oprah, Conde Rice, Colin Powell and many others succeeded? ... they conformed to society, got an education and accepted responsibility for their own life and THEY WON.","post_message":"\"Nobody from ISIS ever terrorized us as a people as the police do us daily,\" Nebraska State Sen. Ernie Chambers said during a recent legislative hearing."},{"comment_id":"903935252988832","commenter_b":"That strategy has never once worked. In fact, we created ISIS by doing exactly that to Iraq.","commenter_a":"Just another reason to bomb them into little pieces. If done correctly, these vermin could be wiped out in a matter of weeks.","post_message":"\"Since ISIL declared a caliphate in Iraq and Syria in July 2014, the group has become one of the world’s most well-financed terrorist organizations.\""},{"comment_id":"998169870194483","commenter_b":"Dicks","commenter_a":"How the hell does anyone defend this crap?","post_message":"Their Orwellian alternative to paid family leave -->"}]
