[{"comment_id":"10152863643681990","commenter_b":"Illegal immigrants should not be here to commit any crime. U. S. Citizens do not need the extra concern.","commenter_a":"Yes look at Dyllan Roof he looks Latino... He shoot 9 black people last month in church.","post_message":"IMMIGRANTS AND CRIME: Despite rhetoric in the Pier 14 shooting Francisco Sanchez case, immigrants do not commit more crimes that U.S. citizens. That's according to 100 years of research according to the American Immigration Council. @webpagelink"},{"comment_id":"10153415746649024","commenter_b":"She is not eligible to run..","commenter_a":"The sad truth is that DUMB PEOPLE WILL STILL VOTE FOR HER! !!!! IT SHOULD BE ILLEGAL TO RUN FOR OFFICE IF THERE IS SO MUCH CORRUPTION IN YOUR HISTORY !!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10153331361449228","commenter_b":"I give up on our government and justice system. You mess with me or my family I'll kill you! There is no more calling the cops to help. I'm done! I can't belive this. My advice to every woman is get your cc and protect yourself!","commenter_a":"Police were still looking for him....I believe he will now be found dead from suicide..","post_message":"She was found with her teenage son.  Police are looking for this man"},{"comment_id":"10156223165790354","commenter_b":"Hell no they wouldn't. I'm still waiting on them to post the story about the white guy in South Dakota, that accidently shot his penis, while purchasing a gun illegally and tried to blame it on a black guy. They didn't even post the story about the white people in TX, that vandalized their vehicles and tried to put the blame on BLM. This page is a joke.","commenter_a":"I wonder if @username would have featured this news item if the chick was white ? Somehow I doubt it.","post_message":"And look what ELSE she did..."},{"comment_id":"1117162291652524","commenter_b":"Get over it she is covered in the right places and so what if she wasn't. Are you ashamed of your body so let's slam others?","commenter_a":"She is such a skank!!","post_message":"WOAH!"},{"comment_id":"889054771211302","commenter_b":"It doesn't happen to muslim women because they are all fugly uckers..","commenter_a":"Go fuck yourselves, dune coon","post_message":"ClashDaily.com"},{"comment_id":"642968752533659","commenter_b":"Amazing that this man who is causing all this problem is in cahoots with the Clinton foundation. Also the Muslim brotherhood. Look it up. He's also a lawyer who helps to bring in people illegally. Real \"good\"guy...and why was he attacking Trump? Trump did not want the war nor was he president or a senator who voted for the war. Nor is he the president now who has let ISIS run amok.","commenter_a":"He doesn't need to apologize. Hillary Clinton needs to apologize. If we did not go to Iraq their son would still be Alive. Hillary is to blame for running arms to muslim brotherhood. Khan attack Trump on national television. Trump responded. And cnn is Hillary Clinton fan club. Lol","post_message":"\"Is it difficult for your father to apologize?\" a co-host asked Eric Trump"}]
