[{"comment_id":"10153347951697144","commenter_b":"that's most likely it - when people camp out, they live somewhere, and the fault line between public and private gets blurred.","commenter_a":"why didn't they want the press there?","post_message":"Finally."},{"comment_id":"10153394561766336","commenter_b":"Only one I see judging is you","commenter_a":"Her Christian mother must be so proud. This is why you don't preach and judge. Once you put yourself out there, you are now the target to being judged.","post_message":"Bristol Palin, daughter of 2008 GOP VP candidate Sarah Palin, has announced on her blog that she is pregnant with her second child.  “I know this has been, and will be, a huge disappointment to my family, to my close friends, and to many of you,” Palin said. @webpagelink"},{"comment_id":"1082496428446957","commenter_b":"Taxpayers fund churches!! Churches don't pay taxes! Planned Parenthood is doing a service that they are legally allowed to preform because there are women choosing to have those services done. Christians have no right do insist this be stopped just because of their religious beliefs. I'm sick of Christianity being all high and mighty thinking that it is the end all be all of decision making for everyone else on the planet. Not everyone is a Christian and not everyone must be. Defund your churches!! Make the churches pay taxes!! Every time a Christian stops an abortion make a Christian take in an illegal alien and put him/her through school/college!! Stop hiding behind your bible and pretending to actually care about the embryos because we all know when you're not cursing abortion your wishing gays would go away and praying extra hard that your children won't turn out to be ...","commenter_a":"You know what's really ironic? Your religious organization doesn't pay taxes yet you're complaining about the money spent on abortions. Another thing is that you want to stop abortions but there's starving children right there in your neighborhood and your church and its congregation all have food on their tables, cars, cell phones etc. Then, you even complain about paying for birth control because it goes against your religious beliefs but then you expect non Christian tax payers to pay for your churches. In addition, you believe that your Christianity should trump my rights as a woman and you should decide what I should do with my body because of what your bible says. Well, I'm telling you NO!! Abortion is legal and its going to stay that way because of people like you. Women like me will always be here to stand up for our rights not only just ...","post_message":"Planned Parenthood has made a business out of destroying that which God has created. The one-sided relationship between it's ever-growing bank account and American taxpayers must be severed. That is why I introduced the \"Defund Planned Parenthood Act of 2015.\"   #ProLife #DefundPP"},{"comment_id":"10153664753098797","commenter_b":"Happy Birthday Glenn :)","commenter_a":"Happy birthday","post_message":"HEARTBREAKING AND HEARTWARMING: When Glenn turned 6, his mom threw him a big party. She invited 16 kids - but not one of them showed up.   Glenn was crushed. So his mom went on Facebook to vent. What happened next is absolutely incredible. See here - and wish Glenn a happy birthday in the comments section below:"},{"comment_id":"10155273538573797","commenter_b":"build a wall...then build another wall around the south side","commenter_a":"I blame the mayor. Its his fault this stuff happens","post_message":"A 74-year-old man has been charged with shooting another man Saturday night in the Park Manor neighborhood on the South Side."},{"comment_id":"10153653057081438","commenter_b":"Used to be, \"This may be upsetting to you.\" Then I would close my eyes. Yes, I get triggered, but it's not neuroscience to accommodate folks.","commenter_a":"Ovid yes and no. EVERY single one of the stories includes silencing of one kind or another-- often violent, often sexual violence. But it is a political poem by an exiled poet who was being silenced. HE tells a story about a bad (silencing) king and then says something directly to the emperor-- \" And you oh Augustus...\" Zeus was a rapist but he does not get praise for his philandering; his wife punishes the victim (the mother of nearly every demigod) since her husband is in power, but some god or goddess usually intervenes. Those rapes or dalliances are metaphorical for deeper political angst in Rome.","post_message":"Some professors believe trigger warnings build trust. Others think they stifle free discourse."},{"comment_id":"875360339257302","commenter_b":"God did not allow it but there is also an evil force in this world called Satan. Satan was at work in the guy trying to take the child but God was working when he was stopped. Give evil the name that it has and that is Satan.","commenter_a":"All the comments are giving credit to the determination and strength of the mother and the officer for being on site at the right time. Why is it so difficult for everyone to see it is the hand of God that gave the mother strength and put the officer exactly where he needed to be. We are not victims we are conquerors. We can do all things through Christ Jesus.","post_message":"Video captured a Florida mother wrestling her own daughter from the arms of a would-be kidnapper inside a store. The suspect ran out of the store but was quickly stopped by an off-duty police officer at gunpoint. @webpagelink"}]
