[{"comment_id":"902035299831892","commenter_b":"Then don't eat the Damn thing, leave now.","commenter_a":"im so sick of people trying to make racism out of nothing u people r pathetic","post_message":"What do you think? Is this food racist?"},{"comment_id":"10155783604970293","commenter_b":"If she was defending herself I hope she walks. Woman beaters should all end up like him.","commenter_a":"Likely another abused women who will be in prison for defending herself. I'm so tired of this happening!","post_message":"A Huntsville woman is being charged with manslaughter after her boyfriend died from his stab wounds."},{"comment_id":"10154308673266178","commenter_b":"They have NO rights if they are in this country illegally.","commenter_a":"If you want to protest, you have every right. When protesting and you decide to escalate your actions by using violence, you are not only breaking the law but also trying to infringe on other people's freedom of speech.","post_message":"The LA Times gets political over the Trump protests.  Here's their biggest concern..."},{"comment_id":"536487383205696","commenter_b":"Here's some facts for you Gerry - I NEVER want to be someone's \"arm candy\", I will NEVER marry for money and I don't have relationships with people because of the way they look. I do agree with you when you say we are our worst enemies, but that doesn't give you the right to generalise all women. Unless you're happy to be lumped with the guys that are shallow and only date women with big breasts","commenter_a":"Who the hell cares if she is pregnant? unfortunately women are their own worst enemies, happy to be arm candy of some of the most groteste males alive,providing they are millionaires, fact!","post_message":"Jennifer Anniston has said we’ll be the first to know if she's pregnant. Writing for The Huffington Post, the actor blasted the “sport-like scrutiny” she lives under, saying it’s indicative of society’s warped view of women which sets a dangerous example for girls."},{"comment_id":"1218171641599870","commenter_b":"She's a COOK","commenter_a":"Wow! Mr. Anderson Cooper. Thank You!! It gives me hope for CNN.","post_message":"Anderson Cooper must have hit a nerve! He just suggested to Elizabeth Warren that the Democrats might be \"out of touch\", and she was NOT happy."},{"comment_id":"10153216491624877","commenter_b":"I just saw a story about her on the ID channel on Sunday. She's ridiculous and should be ashamed of herself. She actually chose a life of crime over her kids when they were younger. There's nothing cute about what she's doing or has done. She should be locked up.","commenter_a":"She needs to sit her old, thieving behind down somewhere.","post_message":"Notorious jewel thief Doris Payne strikes again. Fresh out of prison, Payne is linked to a missing $33,000 diamond ring. Watch how it unfolded below.  Grio fam, 84 years old and Doris is still doing her. What do you think?"},{"comment_id":"10152995356441130","commenter_b":"some women think they'll be liked more (by men) if they act this way!!!! cause...ain't no way a woman believes this...EVER!!!","commenter_a":"CEO of the Dumbass Corp","post_message":"What the..."}]
