[{"comment_id":"1776189505982322","commenter_b":"dumb blonde","commenter_a":"You can't act like a 10 year old threatening to nuke someone if you don't get your way -- that's what Trump would do. Donald Trump doesn't have the temperament, the intelligence or the conscience to have these codes.#imwithher","post_message":"Republicans agree: We can't give Donald Trump control of our nuclear codes."},{"comment_id":"558362490993134","commenter_b":"Why is it we are so intent to run our country into the ground?? Follow Trump, and mark my words, there will be a WWIII, and everyone will be pointing their guns here. We will have no allies as he will insult them all. Wake up, America.","commenter_a":"\"I will not forget.\" What in the hell do that suppose to mean?","post_message":"Do you agree with Donald J. Trump's tweet?"},{"comment_id":"726552340811280","commenter_b":"this female is an ignorant scumbag","commenter_a":"I guess that means yes....","post_message":"I'm not afraid to say these are FAKE TEARS!"},{"comment_id":"1724899471110412","commenter_b":"And what did she sound like a complete or just partial idiot","commenter_a":"Scared Bitch? Sure sounds like you are!!","post_message":"If Democrats REALLY believed Trump's speech was ineffective, they'd want him to give MORE speeches like that, not fewer."},{"comment_id":"10155249184754218","commenter_b":"How do we know, @username? Watching the hearings and seeing her incapable of answering questions. We know by looking at her past experience and seeing it limited to special interest. She has almost no relevant experience. Cabinet members are to be experts in their field, not solely a wealthy donor to republicans. This is not a try out situation. There is not a revote. Your assessment of Trump's hiring practices ignore what we've seen even during his campaign. He had to find new campaign managers three times.","commenter_a":"Who in his right mind would approve of her, doesn't matter if you come from the left or right, everyone can see she is unfit for the job","post_message":"Senators are expected to vote Tuesday on the nomination of Betsy DeVos for education secretary. She is expected to be confirmed, with Vice President Mike Pence casting a tie-breaking vote. Do you support or oppose her nomination? >> @webpagelink"},{"comment_id":"985399901519758","commenter_b":"Stupid cow what did she expect","commenter_a":"Really?","post_message":"'I thought he was The One'"},{"comment_id":"649308955259683","commenter_b":"Stfu you stupid bitch.","commenter_a":"Gifts from the illegals","post_message":"A new disease is spreading like wildfire, doctors calling it the new aids.  Share this with your friends and family.  Have you seen these symptoms?"}]
