[{"comment_id":"1283300368381949","commenter_b":"Sonny Omelis hmm what do you think?","commenter_a":"Jaouad Jijeli","post_message":"...leaving Paris and New York in its wake!!!"},{"comment_id":"1003873189632434","commenter_b":"When you take into account what these 2 young men did taking beer from a grocery store well there's going to be consequences plus swinging a skate board well the Police have to do something...I wish I were standing holding a sign I Support the Police Department !!","commenter_a":"I hate to say this but the store video does not lie. Now hopefully they'll release the bodycam video too. Now would be a great time to prove just how successful those are.","post_message":"The Olympia police officer who shot two men last week has given his account of what happened to investigators, and the department isn't releasing information.   More than 100 people packed city hall tonight demanding immediate changes in police accountability >> @webpagelink"},{"comment_id":"1071940456151087","commenter_b":"the medias role should be to challenge state lies... now their main role is to amplify it","commenter_a":"this is not good.","post_message":"Barry Grey: Addressing the United Nations General Assembly on Monday, President Barack Obama portrayed himself and the US government as the preeminent defenders of international law and diplomacy. He did so even as the catastrophic consequences of the illegal wars of aggression he has overseen continued to send waves of refugees fleeing the ruins of entire countries—including Afghanistan, Iraq, Libya, Syria and Yemen—and as Washington took new steps to turn Eastern Europe into a militarized zone for eventual war against Russia."},{"comment_id":"10153404410236130","commenter_b":"@username All things you listed other than pot are legal. Yet why is it that while people...especially GOPers LOVE to scream bloody murder and point their fingers at those threatening to take away their guns and insist they not be persecuted the same way women who have abortions, gay men and women and birth control is seen as the devils idea. Guns kill people, The LGBT community hurts no one...all we want are equal rights and legal marriage, abortion in most cases saves unwanted children from being abused or just dumped in the trash and the GOP Congress has been trying to withhold food, shelter and a chance at a normal life from those born to poor unwed women. Where are those men and women when they see poor unnourished children who most likely are not wanted some being abused some being killed and some just starving to death. Instead ...","commenter_a":"To all those saying we have no gun problem - please review our statistics on mass shootings. We have more than the next few countries combined. And to those saying gun restrictions would not help because criminals would still get guns anyway: if you limit something at its source, if there are less guns being sold, period, statistically all criminals would have a much tougher time getting a gun. People with a history of physical violence and mental illness SHOULD NOT have access to guns, and today most can simply walk into a store and buy one as easily as anyone else - anyone who argues with these facts is part of the problem.","post_message":"What is standing in the way of meaningful gun reform?"},{"comment_id":"10153404609274170","commenter_b":"I use roaches. She is like a roach, nasty.","commenter_a":"Good news here .. 57% *of* 47% only comes to 26.69% overall. This places me among the 73.31 who think she's a lying skunk (and those are her good points).","post_message":"53% of voters say Hillary is not trustworthy. ...But 57% of Dems still support her.  Why?"},{"comment_id":"1012624708881318","commenter_b":"@username. She speaks 5 languages!! How many do you speak?","commenter_a":"I honestly can't stop crying right now to know that this monster is playing with families like this when his wife can't even speak English herself","post_message":"Watch protests at U.S. airports in opposition to Trump's executive order restricting travelers from specific countries.  Read more details on the travel restrictions issued by President Trump: @webpagelink"},{"comment_id":"980529482041405","commenter_b":"She crazy bruh","commenter_a":"She is so confused 😂😳","post_message":"Watch: She has to be seen to be believed. Somebody take away her car keys!"}]
