[{"comment_id":"10154094208712483","commenter_b":"I always love the people who shout about \"Damn SJWs always trying to shut down things they don't like! Get over it!\" because they're the same people that whine about things like the \"War on Christmas\". Who needs those safe spaces again?","commenter_a":"Oh no! Somebody got offended again so let's shut it down!","post_message":"The series, which has elicited a fierce backlash, will be shelved."},{"comment_id":"10153900355041378","commenter_b":"They are all crooked! This is what happens to women who try to play (and cause trouble) in the all boys club that is politics.","commenter_a":"Clinton should of appointed her to be her VP","post_message":"#BREAKING - One day after she was convicted of perjury and other offenses, Pa's Attorney General answers calls for her resignation. @webpagelink"},{"comment_id":"943618162339946","commenter_b":"^ What an asslicking, apologist bitch.","commenter_a":"It's his fathers fault.... He had warrants and ran.... Then tried to run over police.... Look up the story before u believe this wack ass page- that boys father deserves to be charged with murder","post_message":"Courage, bravery, hero, protect, serve... These words are not affiliated with the cops who killed this boy.   Full story → @webpagelink Police The Police | Filming Cops"},{"comment_id":"1187041288042639","commenter_b":"How is she even allowed to run for president with all of this disgrace","commenter_a":"They all need to be arrested clean the White House and all the corruption--- this needs to be done ASAP","post_message":"In response to the revelations about the pay-to-play scandal tied to former Secretary of State Hillary Clinton non-state.gov email system and the Clinton Foundation, Judicial Watch announced that it will host an educational panel discussion:   Scandal Update  Emails and the Clinton Foundation.  Panelists include author of the New York Times best-seller Clinton Cash and President of Government Accountability Institute Peter Schweizer; Joe diGenova, former U.S. Attorney, Independent Counsel and founding partner of the Washington, D.C., law firm diGenova & Toensing; and Chris Farrell, director of investigations and research at Judicial Watch. Moderator will be Judicial Watch President Tom Fitton.  [for higher volume touch sound icon on screen  ]"},{"comment_id":"10153414475016167","commenter_b":"Damn uppity women with their words and assertiveness","commenter_a":"They should know we Chicago folks like a good shout out. Have they never been to a Cub, Bear or Hawks game? It is enthusiastic and honest.","post_message":"Add this to the list of things the media would never attack a male politician for:"},{"comment_id":"10153590364786409","commenter_b":"What a bunch of caddie women","commenter_a":"Oh I could never stand her....once Regis was gone,so was the show.....","post_message":"Kelly Ripa says she and 'Live!' staff members helped speed up Michael Strahan's departure."},{"comment_id":"10153833789564411","commenter_b":"Israel has been there 3000+ years as proven by archaeology. it's palestine who are the invaders. It's the SECOND palestine if you've studied history. They're Syrians and Egyptians as confessed by the PA itself. They even use the flag of Jordan.","commenter_a":"Guys Guys Guys u no one thing turkey is number one trading partner of isreal....And turkey is first country who excapt isreal as a brother Nation......And turkey is N.A.T.O mamber what N.A.T.O did in libya Afghanistan Iraq and somaliya u no batter then me......Down with Erdogan Down with Turkey...long live Palistayin","post_message":""}]
