[{"comment_id":"1099626483393732","commenter_b":"RINO revolt began with Romney. We shall soon see a series of similar dogs.","commenter_a":"Ventura is a jackass!","post_message":"Someone other than Michael Bloomberg is considering a run for president.  Could this controversial figure make an impact on the 2016 race?"},{"comment_id":"10152863643681990","commenter_b":"Illegal immigrants should not be here to commit any crime. U. S. Citizens do not need the extra concern.","commenter_a":"Yes look at Dyllan Roof he looks Latino... He shoot 9 black people last month in church.","post_message":"IMMIGRANTS AND CRIME: Despite rhetoric in the Pier 14 shooting Francisco Sanchez case, immigrants do not commit more crimes that U.S. citizens. That's according to 100 years of research according to the American Immigration Council. @webpagelink"},{"comment_id":"10153331851941509","commenter_b":"There's a law in Alabama that says a man has to walk fifty feet in front of an automobile waving a red flag, if a woman is driving. In Ca. You can't shoot jackrabbits from a moving streetcar.","commenter_a":"Honorable lawmakers. Do not longer exist. This is just a small example of how good taste, decency, decorum and such, form no longer part of our society.","post_message":"Congressman Alcee L. Hastings, citing a dildo law, among other things, has some harsh words for Texas lawmakers. Now Texas lawmakers are demanding an apology. @webpagelink"},{"comment_id":"10154352617716880","commenter_b":"Yes. That's correct too. And once it's 10% conquest begins. Not sure if it's even possible to fix now.","commenter_a":"Could it be because there are too many Muslims in France?","post_message":"A French parliamentary report reveals its reasons."},{"comment_id":"10153369236751051","commenter_b":"Bitch got what she deserved..","commenter_a":"I am happy for the boy to let his real self show that bully get what she needed..","post_message":"This boy tried to stay calm in the face of relentless bullying from a girl on his bus. Finally, he just couldn't take it anymore."},{"comment_id":"10153467696365736","commenter_b":"This is Florida were talking about... the question of \"Consent\" is irrelevant. As the boys will simply plead that they were standing their ground!","commenter_a":"If you can't \"consent \" to having sex with an older person, you should not be able to consent to sex trafficking...","post_message":"The 15-year-old girl was a sex trafficking victim for two years, her mother says. At issue is whether she was capable of consent."},{"comment_id":"10153239073114087","commenter_b":"Becky, you ignorant slut.","commenter_a":"Why is the fact shes a woman the issue? This kind of rhetoric just signals their hypocrisy, in one breath decrying sexism and then in the next taking advantage of it.","post_message":"\"I first would like to register my opposition and my objection to the chairman beating up on a woman, on our witness today, for making a good salary,\" Rep. Carolyn Maloney at today's Planned Parenthood hearing. \"The entire time I've been in Congress, I've never seen a witness beaten up and questioned about their salary. Ms. [Cecile Richards] heads a distinguished organization providing health care services to millions of Americans. I find it totally inappropriate and discriminatory.\""}]
