[{"comment_id":"10153874531382464","commenter_b":"IF YOU ARE REALLY WORRIED ABOUT AMERICA CHRISSY ....... DUMP THE TRUMP!!","commenter_a":"Cruz lied about what he did with Carson! CNN fact checked and it was just like everyon knew it was. Cruz is a Liar and a terrible man! He threw Carson under the bus! Rubio puts out the same speech he and his family migrated here and had no money and how he supposedly walked dogs for spare change whileforgetting to mention that the dogs he walked were gaurd dogs for his mother and fathers drug dealings. Both which spent time in prison and were with a Cartel. I am not saying that as a child Rubio was guilty of the drug dealings.What I am saying is that he is giving peoplea false storyof some made up life. Anyone can fact check eitherof these two lying cheating thieves. I wouldn't let either of them wpe my dogs paws! Both are liars and career politicians. As for Bush, His familyuses eminant ...","post_message":"A super sale for #SB50. Get your #TeamCruz jersey for just $50: @webpagelink"},{"comment_id":"1672517186342699","commenter_b":"Kiss my white ass.I don't owe you anything","commenter_a":"White lives matter","post_message":"“...white folks actually gotta give up something. You have to actually sacrifice yourself. You have to be willing to give up the things that you currently benefit from.”"},{"comment_id":"475516605979471","commenter_b":"Getting a little tired of the, \"MUSLIMS\" trying to change our great country of AMERICA!!! If you infidels don't like our country, please feel free to go back to where you came from or if you're an American muslim, get used to our way of life or ship out & go to a muslim country from which they came. I'm sure they need you in those countries since so many have migrated here.","commenter_a":"So then go eat at Camel humps grill","post_message":"McDonalds, KFC, And Pizza Hut Say No To Halal Meat And Muslims Are OUTRAGED  There is no reason why they should have to change their business for them.  Do you support these food chains?"},{"comment_id":"933394380031531","commenter_b":"Good girl tell it like it is","commenter_a":"No one should lose their job for honesty","post_message":"Judge Jeanie Could Lose Her Job After Job After Publicly DESTROYING Obama On Live TV [VIDEO]  She just put everything on the line. Let's show her our support.  Can we get 30,000 'LIKES' for Judge Jeanie?"},{"comment_id":"537545743072047","commenter_b":"Fuck you you damn racist nut!","commenter_a":"Sounds like she just smoked a fat rock. Good job Vice... Keep throwing the crackheads on the top of my news feed. Not sure what I want more this or cat videos...","post_message":"On the Sea Islands along the coasts of South Carolina and Georgia, a painful chapter of American history is playing out again.  Watch our investigation into why Gullah culture is being replaced by waterfront mansions: @webpagelink"},{"comment_id":"1573634599333254","commenter_b":"I know smh that's it I'm looking for new locations tomorrow","commenter_a":"@username Eder Marure","post_message":"A drive-by shooting left 1 person dead on Cypresswood Drive on Monday night."},{"comment_id":"10156386712435354","commenter_b":"Dumb asses.. Nuclear terrorism ( round the corner) is far worse than gradual climate change..","commenter_a":"And he is a greater threat than Climate change. So I guess that makes him a greater threat than terrorism too !","post_message":"A DEVASTATING indictment every American should see..."}]
