[{"comment_id":"1099336866769294","commenter_b":"There great on the grill","commenter_a":"they are nasty things.. we have loads of them out here in Texas.. they tear up pasture land and wreak havoc on vegetation and are very dangerous and have been known to maim and kill people who get too close.. I would seriously not encourage residents to take them out unless they are in a rural area and are familiar with how to use caution in hunting them.. get the parks and wildlife involved.. they better know how to deal with them..","post_message":"Update: Wild pigs that have damaged landscaping at Fairmount Park and other Riverside County areas have caused millions of dollars worth of damage, and officials are warning residents to be careful around the animals.  Read KTLA's story here: @webpagelink"},{"comment_id":"10153174916561130","commenter_b":"Poor, sad, hatful women. I feel bad for you.","commenter_a":"homsexuals force their wicked ways on everyone. Shame on them. Homosexuals lust not love..","post_message":"Humans aren't the only ones celebrating the SCOTUS decision."},{"comment_id":"392158754326577","commenter_b":"I hope Trump wins the nomination. Then The Americans will for sure vote for a demokrat, whether it be Hillary or Bernie. No way the Americans are that stupid!!","commenter_a":"Isn't his stand against Muslims prohibitive by the Constitution and therefore automatically eliminates him from presidential nomination?","post_message":"Let’s stop the racism. Let’s stop the xenophobia. Let's stop Trump. #GOPDebate"},{"comment_id":"10153808795866336","commenter_b":"@username Typical Illegal Alien.","commenter_a":"Frankly it feels lousy to be called a murderer when all I'm trying to do is keep you safe. Im not a murder. That is slanderous. That is not how I act","post_message":"Quentin Tarantino has finally responded to the firestorm that’s been brewing since he criticized police officers at a rally last weekend, and he says he won't be \"intimidated.”"},{"comment_id":"1094342837275269","commenter_b":"She ain't coming back","commenter_a":"I love Jessica Lange","post_message":"Jessica Lange announced that four seasons of 'American Horror Story' was enough and she will not return.   The star of the first four seasons of 'American Horror Story', Jessica Lange, announced that she has no desire to return to the show. Lange will however return to FX in the show 'Feud'   One actress entering her fourth season of the show that announced she will be returning is Angela Bassett. Watch Angela Bassett talk season 6 of 'American Horror Story'."},{"comment_id":"10153972084976336","commenter_b":"Pretty white chick..Thug?...heck no...let her go....","commenter_a":"Thugs come in all shapes, sizes, genders and races! Thanks to the Law Enforcement for removing this thug from our streets.","post_message":"Abigail Lee Kemp was taken into custody in Smyrna without incident, the FBI’s Jacksonville, Florida, office announced."},{"comment_id":"10154239405639153","commenter_b":"Shes a looser","commenter_a":"@username you just posted trump did lol","post_message":"Clinton is expected to speak around 9:45 p.m."}]
