[{"comment_id":"1188648117842550","commenter_b":"America shouldn't change Muslims need to adapt to our cultures","commenter_a":"UN","post_message":"MUSLIMS FLIP OUT! McDonald, Pizza Hut And KFC Refuse Muslim Demands To Serve Halal...  Time to go eat a Big Mac! Can we get 10K LIKES for this!"},{"comment_id":"10152891097411491","commenter_b":"and because China is seizing Australian colonial territories in Antarctica which is morally wrong","commenter_a":"Asia is Asia, for the ASIANS. Why do we have to stick our noses in EVERYWHERE???? No wonder the U.S. is hated by so many countries.","post_message":"A historic debate over trade is now heating up in Washington."},{"comment_id":"10154148373635736","commenter_b":"His daughter/wife would hate that.","commenter_a":"When they said \"small hard object\" I just assumed the president had gotten excited.","post_message":"Police received a report Friday that President Trump's motorcade \"had been struck by what was believed to be a small hard object.\" He was passing through Palm Beach on his way to his Mar-a-Lago resort nearby, where he spent part of the weekend."},{"comment_id":"1116402168438318","commenter_b":"Darren VM They don't want the imbecile either, probably why he ran here! LOL","commenter_a":"I don't understand how this humiliates Obama. I don't understand why Michelle is included in this. I don't understand why any sane American will be for humiliation of an American President regardless of agreement on issues.","post_message":"Obama may think he's Europe's favorite politician, but Queen Elizabeth just made a stunning announcement that put Obama right in his place.  You know Michelle was furious when she heard about this."},{"comment_id":"10153337670592061","commenter_b":"Omg your so ignorant lady!","commenter_a":" I've had enough of this 'let's show black crimes in the news disproportionately bs' what's up with those occupy federal land militia and who's going to right the Steve Avery corruption wrongs. What he has to be an affluenza to qualify for civil rights in America?","post_message":"WATCH: Kidnap victim explains how she escaped after an alleged carjacker jumped into her car and forced her to drive nearly 150 miles: @webpagelink"},{"comment_id":"10154225245793483","commenter_b":"Wtf is wrong with this woman. She needs to be arrested for abuse. I take care of elderly people and this is despicable!!","commenter_a":"That's disgusting. Has she been arrested?","post_message":"A 94-year-old woman was supposed to be taken care of by a home health care provider. But she was screamed at and even hit by the woman.  \"I told you stop feeding that dog human food,\" the worker screamed at the 94-year-old woman. FOUL LANGUAGE WARNING FULL STORY --> @webpagelink"},{"comment_id":"10154329807781051","commenter_b":"These insecure women manage to chase away the good men...then end up with another POS and can't figure out why...imo","commenter_a":"Opps!","post_message":"This girlfriend really, really didn't trust her boyfriend, so she decided to send a porn star to test his fidelity while she watched it unfold on camera. She thought she was ready for anything - but she was definitely not ready to see what he did."}]
