[{"comment_id":"10153680219934641","commenter_b":"Problem solved!","commenter_a":"I'd still like to know why they need to come HERE? It would be cheaper and safer to house and secure them over THERE. The need to vet them would be nearly eliminated, language issues would be non-existent, violence and criminal acts would be lessened, etc. We can't adequately provide for our nations homeless population as it is. We're going to bring in 10's of thousands of them from another country and shelter THEM, but leave our own (many of whom are veterans) out in the cold? (literally)","post_message":"\"If there's a rabid dog running around in your neighborhood, you're probably not going to assume something good about that dog,\" Dr. Ben Carson said Thursday, speaking about refugees. @webpagelink"},{"comment_id":"449511958572680","commenter_b":"This lady is nothing but a liar...","commenter_a":"Muhammad ordered beheadings and other extreme violence as does the Quran today and all of Islam idolizes them as does Obama and Hillary!!","post_message":"The divisive rhetoric and encouragement of violence we're hearing from Donald Trump isn't just wrong—it's dangerous."},{"comment_id":"1802278956685902","commenter_b":"She is winning calm down","commenter_a":"Bahahaha 95% of the comments are anti Hillary and they have us believing she is winning...","post_message":"We're in Denver, Colorado, where both Bernie Sanders and Elizabeth Warren are holding a rally for Hillary Clinton."},{"comment_id":"10153020526397464","commenter_b":"STAND FOR PRINCIPLE or lose America!","commenter_a":"Either the Republican party morphs into liberatrian values or even conservative values, I see no reason to continue to throw away my votes on them. As it stands now, the difference between Republicans and Democrats is hard to see. They are BOTH for bloated Federal Government way beyond it's constiutional limits.","post_message":"We are facing a fundamental decision for our country.   Do we go back to the same old, same old or do we stand for principle? #SCTeaParty15"},{"comment_id":"10155234005228984","commenter_b":"Shut off the money! Mandate Everify with suspension of business & huuuuge fines if caught hiring illegals. No Welfare or any other benefits to non citizens. Proof of citizenship to attend schools! They will self deport! As for DACA? Ok. Let those poor kids who were dragged here as children BUT deport the parents that dragged them here!","commenter_a":"They are pissed off because of our policies but let ne of us cross their broader and see what happenes.","post_message":"WATCH LIVE: Secretary of State Rex Tillerson, DHS Secretary John Kelly and Foreign Secretary Luis Videgaray make statements from Mexico City on President Donald J. Trump's new immigration proposals."},{"comment_id":"10153839252314087","commenter_b":"@username He was a natural born citizen of the US and so was the LA Shooter who is from New Albany, Indiana. Why do you hate the Constitution, there is no racial component to citizenship. We must stomp out Christian and ISIS terrorism!","commenter_a":"I agree we must stomp out Jihadi and Christian Fundamentalism. The LA shooter was a Hoosier (Indiana). A disgruntled white man with fascist leaning aka the type of voter Loser Cruz tried to get but the Trumpster got. Is this un- PC enough for you gusano?!","post_message":"\"Enough is enough. What we need is for every American -- Democrat and Republican -- to come together, abandon political correctness, and unite in defeating radical Islamic terrorism,\" Ted Cruz said after the Orlando attack."},{"comment_id":"10152583869080779","commenter_b":"Dig this ditch. Now fill it back in. We'll print some money and pay you with it. Now bread is more expensive for everyone. Brilliant. The New Deal kept my grandfather a hungry child.","commenter_a":"Does Bob Dylan not remember the US government creating the Works Progress Administration (WPA), Federal Project Number One, or the Civilian Conservation Corps? Which created jobs for millions of unemployed Americans? The New Deal? FDR? No?","post_message":"Bob Dylan has a solution for unemployment: Let the billionaires step up. \"The government's not going to create jobs. People have to create jobs, and these big billionaires are the ones who can do it,” he says."}]
