[{"comment_id":"1130843966969767","commenter_b":"Good keep them there and deport them","commenter_a":"Like packs of hyneas.","post_message":"UNREAL! SOMALI MUSLIMS RAMPAGE Through Mall Of America In Minnesota...10 Arrested [Video]"},{"comment_id":"998307626859113","commenter_b":"Sorry pussy","commenter_a":"Not Donald we like Donald we don't like pushy billionaires","post_message":"A billionaire Saudi Prince makes an offensive demand of Trump, then Trump FIRED BACK!!"},{"comment_id":"10153641052531509","commenter_b":"@username, I'm willing to bet that Elizabeth up there hasn't murdered any teenagers. It's possible that she's never even been arrested. I won't mourn a guy who can't seem to keep trouble away from him.","commenter_a":"Too bad the gunshot didn't kill the punk.","post_message":"George Zimmerman, acquitted in Trayvon Martin's death, has suffered a minor gunshot wound in Lake Mary, Florida, police tell a CNN affiliate. @webpagelink"},{"comment_id":"10152803478324877","commenter_b":"And so are you......","commenter_a":"Cosby is guilty.","post_message":"Malcolm-Jamal Warner Breaks His Silence On The Bill Cosby Rape Allegations. Read what the 'Theo' actor had to say about his TV dad.   Grio fam, is this a fair comparison for him to make? Sound off."},{"comment_id":"10153512540611491","commenter_b":"Blow this mf off the face of the earth","commenter_a":"@username Camangyan","post_message":"\"The only way for defending the sovereignty of our nation and its right to existence under the present extreme situation is to bolster up nuclear force.\""},{"comment_id":"1280286192042365","commenter_b":"^^^ That is porn for some women...","commenter_a":"Do some actually people make that face when looking at porn?","post_message":"Browsing porn on your smartphone requires more than just anti-virus protection.   Let us help."},{"comment_id":"10153876245464411","commenter_b":"She's actually not Austrian. Quit with the PC BS.","commenter_a":"She got what she deserved. Make up your fucking mind and stick to it.","post_message":"Unconfirmed reports of the 'poster girls' fate also circulated last year, with UN counter-terrorism expert stating that one had been killed in fighting and the other had disappeared"}]
