[{"comment_id":"1345340232144440","commenter_b":"@username, strong women do not build economies on murder of other countries and arming terrorists. That is a woman in bed with Big Money.","commenter_a":"I thought I was following an intelligent, thoughtful and insightful site, obviously not. Frightened of a powerful women I see, like most insecure men. We're use to it, but good luck with that ideology going into the future.","post_message":"EDWARD S. HERMAN: Hillary Clinton is a neo-liberal and pre-eminent war-monger. I think she is the most dangerous person living in the world today, given her highly likely election victory and her likely performance as president.   Trump is a self-promoting windbag, racist and dangerous, unpredictable phony. We have a ghastly choice in these two. Jill Stein offers a protest opportunity, more so than not voting. On the line that either voting for Stein or not voting would constitute a vote for Trump, one might argue that a vote for Hillary Clinton is a vote for war with Syria and Russia"},{"comment_id":"10153183466936336","commenter_b":"It's an escort. Nothing will be done to prevent arms to Syria. Another red line crossed. He is an embarrassment and puts us all in danger from terror.","commenter_a":"Iran knows we have a coward President. Even these ships are like a lion without teeth because Obama is Commander in Coward!!","post_message":"U.S. Navy warships are shadowing an Iranian convoy approaching Yemen as the U.S. beefs up its presence in the region. Tune in to 'Special Report with Bret Baier,' tonight at 6p ET for the latest."},{"comment_id":"10153918436462619","commenter_b":"God have mercy on those who hate","commenter_a":"Revenge is mine says the Lord!! Definitely a different God!!","post_message":"An Islamic State terrorist praised Wednesday's attack on Charlie Hebdo, telling Reuters the attack was revenge for insults against Islam."},{"comment_id":"1110952199024027","commenter_b":"Oh before it was something else American government did wrong. Now it's that we won't solve your problems for you. Well then, build a wall too!","commenter_a":"This is really funny let's see what trump does for yo Greece","post_message":"LIVE: Protest against Barack Obama's visit to Athens"},{"comment_id":"10153259534778145","commenter_b":"Hehe","commenter_a":"Happiest place on earth!!!!!!","post_message":"EPCOT BRAWL: Looks like these Disney guests weren't exactly having a blast at the happiest place on Earth. Three women were recorded having a full-fledged fistfight while waiting in line at the Test Track at Epcot. Watch the full video: @webpagelink"},{"comment_id":"10153680098799772","commenter_b":"Support SAFE ACT 1214 hr 1942","commenter_a":"That's just a dummy computer. There is no glow on her face from the screen. There is no reflection of the screen in her eyes. Maybe even she is just a mannequin?","post_message":"Getting ready to start this Facebook Q&A!"},{"comment_id":"1920926941484648","commenter_b":"Worst president ever... and she's never been a First Lady... low class trash is what she is!","commenter_a":"Not at all","post_message":"Are the Obamas a good representation of the American people?"}]
