[{"comment_id":"1698524737097189","commenter_b":"Thanks gents for proving not only is the patriarchy alive and well, but it's also angry and ugly. Your mothers must be so proud.","commenter_a":"Just goes to show you no matter how powerful and important a woman is, men still feel that she is there for their entertainment and enjoyment, and they are entitled to direct her in her appearance and behavior. I'm pretty sure not one of them has said to Donald Trump or Bernie Sanders or John Kasich or Ted Cruz they should smile more, or made comments on the tones of their voices. They respect male candidates and don't see those things as important to a good male leader. But a woman leader? She has to be twice as qualified as the men to be considered competent, and has to be constantly critiqued on elements only seen as important to women: posture, poise, attitude and looks. I'm glad these neanderthals are being called out on their sexist tweets. But this is only the beginning. The ultimate glass ceiling is about to ...","post_message":"Were other (male) candidates called out the same way?"},{"comment_id":"1836845559870004","commenter_b":"She doesn't deserve to be nominated.. What a laugh..","commenter_a":"Her expressions are the worst.... From her constant head nodding to her wide eyed expressions. And what's worse is when she opens that mouth of hers to spew out a constant stream of lies...","post_message":"Balloons are released to celebrate the official nomination of Hillary Clinton & Tim Kaine."},{"comment_id":"10155940183045354","commenter_b":"Does she have an extra kidney. You really only need one. Never mind it comes from her scummy body. Monster","commenter_a":"You go Hollywood stars. I wouldn't put anything past you stupid people. If you agree to selling aborted baby parts, I can only imagine how many times you all have done it. It is no wonder I can't stand almost all Hollywood stars.","post_message":"Check out the Instagram video Scar Jo appeared in for Planned Parenthood"},{"comment_id":"10152601716778837","commenter_b":"Stupid a$$ b**ch...","commenter_a":"Another arrest, more jail. He's a bully and is still playing god. It's just a matter of time before he kills again..","post_message":"BREAKING -- George Zimmerman arrested in Florida @webpagelink"},{"comment_id":"639206099603302","commenter_b":"trump chooses palin for vp he loses my vote pay attention america to this family","commenter_a":"why would a person with any common sense support ANY ONE who assaults anohter person? that does not even make good sense. no matter why she assaulted the other person, you do not strike another person. she could have just left the party if she was offended by something said. it was a crime.. crimes are punishable by arrest and payment for that crime no matter who you are.","post_message":"Bristol Palin is in trouble with the law after this incident at a party.  We need to show Bristol our full support. We support her and the entire Palin family.  Do you support Bristol Palin?"},{"comment_id":"1234377609916581","commenter_b":"Euuuuuw you wouldn't bitch!!!!!!","commenter_a":"Shieeet om det här hade hänt... :S xD @username","post_message":"Just going to grab a nice handful of san - WHAT IS HAPPENING."},{"comment_id":"10153554565881615","commenter_b":"... Murder is obviously horrible... But I would like to expand capital punishment beyond that... To a crime I put equal to murder... Child molestation ... Or child RAPE. Unthinkable. Monsters like that should be eliminated as well.","commenter_a":"Will waste even more money to keep him in our prison system or on \"death row\" ... Please use capital punishment in cases like this and actually FOLLOW THROUGH WITH IT!","post_message":"BREAKING: Allen Wade has been found guilty on all counts in the murders of Susan and Sarah Wolfe, who were killed in their East Liberty home more than two years ago."}]
