[{"comment_id":"10153396408061130","commenter_b":"Why are these men so obsessed with a uterus? I mean I've never obsessed over a prostate...what is going on?","commenter_a":"The same thing happened to Joe McCarthy. Everyone was all for outing Communists, then they watched him bully people at hearings on the TV and realized what a witch hunt it was.","post_message":"\"This hearing is why everyone hates Washington, D.C.\""},{"comment_id":"10154258426436509","commenter_b":"JOINING THE ILLUMINATI BRINGS YOU INTO THE LIMELIGHT OF THE WORLD IN WHICH YOU LIVE IN TODAY. YOUR FINANCIAL DIFFICULTIES ARE BROUGHT TO AN END. CALL: +@username WE SUPPORT YOU BOTH SPIRITUALLY, FINANCIALLY, PHYSICALLY AND MATERIALLY TO ENSURE YOU LIVE A COMFORTABLE LIFE. IT DOES NOT MATTER WHICH PART OF THE WORLD YOU LIVE IN. FROM THE UNITED STATES DOWN TO THE MOST REMOTE PART OF THE EARTH, WE BRING YOU ALL YOU WANT. BEING AN ILLITERATE OR A LITERATE IS NOT A BARRIER TO BEING A MILLIONAIRE BETWEEN TODAY AND THE NEXT TWO WEEKS. YOU BEING IN THIS OUR OFFICIAL WEBSITE TODAY SIGNIFIES THAT IT WAS ORDERED AND ARRANGED BY THE GREAT LUCIFER THAT FROM NOW ON, YOU ARE ABOUT TO BE THAT REAL AND INDEPENDENT HUMAN YOU HAVE ALWAYS WISHED YOU WERE. WE DON DISCRIMINATE IF YOU ARE WHITE OR BLACK. CALL: @username OR SEND AN EMAIL TO: ...","commenter_a":"Terrorist can care a crap about climate change their goal is to eliminate all others that do not believe in their religion.","post_message":"\"What greater rejection of those who would tear down our world than marshaling our best efforts to save it,\" President Obama opens up #ClimateChange conference COP21 #COP21Paris"},{"comment_id":"10154087462891813","commenter_b":"Maybe after they have this 200,000 woman march on Washington Saturday for women's rights then maybe we'll finally get a female: Ambassador to the United Nations, Secretary of Education, Secretary of Transportation, Senior adviser to the President and first female to successfully run and win a Presidential campaign, female Director of small business affairs..preferential hiring for females and federal laws mandating all government workers and state workers and military personnel get the same pay for the same rank and experience? Oh and abortion on demand.....wait...","commenter_a":"powerful and mighty statement","post_message":"Today and every day, dissent is patriotic. #WomensMarchonWashington"},{"comment_id":"474611692726438","commenter_b":"Dear god. If I were Trump, and that batshit crazy woman decided to endorse me, I would bow out gracefully. Tail between my legs. Holy cow. She is a kook.","commenter_a":"How was she ever elected Governor!!!!!!!","post_message":"Sarah Palin endorsed Donald Trump on Tuesday. The result can only be described as Palinesque."},{"comment_id":"975168222494648","commenter_b":"Not really , I was talking about little pussy Libtards like you Chucky boy !","commenter_a":"Yea , all money belongs to the Dear Leader. And he gives us only what we need or deserves ! Just look at how that worked out with Joseph Stalin !","post_message":"Oh no."},{"comment_id":"1108095542598003","commenter_b":"@username please lady shut the hell up!","commenter_a":"O'Reilly won't stop spewing rubbish. He expected Obama to make same mistake like Bush and Blair by drafting thousands of troops to Syria like Iraq. If Obama has made that misstep, more than a thousand of finest American soldiers would have been killed there by now. Bill needs to be grateful to Obama by not being a blood thirst. There are more than 12,000 gun violence related death in America annually, he won't even address that. Funny old man!","post_message":"\"There's no question the Obama administration's greatest failure is allowing the Islamic terrorist group ISIS to run wild.\"  Bill O'Reilly criticized President Obama's response to the terror threat, adding he doesn't \"define the ISIS threat accurately.\""},{"comment_id":"1074912275882577","commenter_b":"Look at their faces....they're smiling. ...and we're not allowed to be angry about this. All of you bigots need to shut up! Wear your flag ....fly your flag......shove your flag.....who cares ....but you will not see it flying over that government building ever again!!!! Deal with that!","commenter_a":"Are these the same, \"It's Heritage, not Hate\" clowns?","post_message":"South Carolina voted to remove the Confederate flag, and bigots are in a frenzy: 'F*ck black people'"}]
