[{"comment_id":"10155604314476509","commenter_b":"I love it. Obama Obama Obama. Biden Biden Biden best Pres and Vice President ever","commenter_a":"At this point what difference does it make","post_message":"Biden: I'm not giving them the wifi password  Obama: Joe..."},{"comment_id":"10153884646907183","commenter_b":"Why you picking on us white folk here in Georgia? Keep that bitch far away from us!","commenter_a":"Katrina Pierson should be in Milwaukee or Georgia. The media is paid to review everything Trump said and to soil it. They don't care about the real news, another cop assassinated through race- baiting rhetoric from Obama and HRC. Milwaukee is rioting. The streets of Chicago are still killing fields. Clinton is racketeering money through the foundation in pay for play schemes. Yet Ms Pierson has only one thing to do on this Sunday. Find dirt on what Trump said and exploit it. Is this the kind of values we should accept from these UnAmerican sewer-valued people?","post_message":"Did you ever hear of a \"novelty tradition\" in politics?"},{"comment_id":"216170728787107","commenter_b":"She is a dried up piece of human flesh!","commenter_a":"This is a crazy idiot sue her but her out of business","post_message":"The heck!"},{"comment_id":"1425549500793527","commenter_b":"I hope Ellen tells them all to eff-off. America needs to take a stand against these whiney brats.","commenter_a":"It's hilarious not racist!!!! Come on!!!!","post_message":"People are not happy with Ellen DeGeneres' Usain Bolt photo."},{"comment_id":"10155459480226729","commenter_b":"Illegal peoples was unexpected to immigration live our homeland your said them all to their ear daft.","commenter_a":"Mexico’s Enduring Legacy of Failure If Mexican President Enrique Nieto truly believes Donald Trump is a bigot for not welcoming millions of medically and criminally unvetted illegal aliens with open arms and a check made out to \"cash\", then why does Mexico have stricter immigration and foreign work laws than \"racist\" America? Every civilized nation recognizes the absolute necessity of securing their borders and maintaining the integrity of their immigration programs. It's the type of common sense that requires no apology or gratuitous reminders. Perhaps if the Mexican government wasn't so adept at destroying its own country with an endless cycle of incompetence and corruption, their own flesh and blood would not be fleeing their native homeland with nothing but the clothes on their back. And yet these are the same hypocrites who have the nerve to denounce America as greedy capitalists; that transcendent beacon of liberty, opportunity and prosperity ...","post_message":"If there's one thing I truly despise about the progressive socialist left it is their blatant hypocrisy.   One of the fall back positions for the left is always the 14th Amendment's \"equal protection\" clause. In the case of Obergfell vs Hodges (same-sex marriage) the SCOTUS ruled that marriage was an individual right and States must conduct same-sex marriages, making it the \"law of the land\" as many say.   Now, with the executive orders of President Donald Trump on illegal immigration, the liberal progressive left is again decrying the 14th Amendment's equal protection applies to anyone within the borders of the United States.   Well, based upon this, I will henceforth be carrying my concealed weapon anywhere within the borders of the United States.   Look, if all of a sudden, two men and two women have the right to be married anywhere in America, and if folks here illegally have constitutional protections, then my constitutional second amendment right to keep and bear arms shall not be infringed. You know...equal protection.   So, there it is, I just saved Congress a lot of work. Law abiding legal American gun owners can travel anywhere they want with their concealed carry permit. If we can't, then no same-sex marriage -- and no rights and protections for illegal aliens.   End of class."},{"comment_id":"10153705245475667","commenter_b":"Build that wall tall!!","commenter_a":"Libertarian is just another word for Republicanism!","post_message":"Libertarian presidential candidate Gary Johnson talks with Paul Singer."},{"comment_id":"10156410831030725","commenter_b":"U not Gona win ginger bread","commenter_a":"Letssss go !!!!!","post_message":"The last person Hillary Clinton wants to run against - is Trump! I will be her worst nightmare! #Trump2016"}]
