[{"comment_id":"10156940473490354","commenter_b":"She was having plastic surgery!","commenter_a":"Where were you Maria, when Obama was proposing this last year. That's when you should have objected! It's too late now!","post_message":"BLISTERING..."},{"comment_id":"1136752646369001","commenter_b":"No the world is laughing at America","commenter_a":"The most pathetic, delusional president in history by far. Terror, hatred, murder and division all over the world like none in recent history and he says something so outrageous? Embarrassing and the world is laughing at this fool.","post_message":"Obama thinks we're living in the most peaceful time in history."},{"comment_id":"627551517435427","commenter_b":"Big mouth cow","commenter_a":"So we'll give her grandmother a free drink.","post_message":"This entitled woman just demanded a free drink... Because of slavery?  This is absolutely ridiculous. We owe her nothing.  Should she be compensated for slavery?"},{"comment_id":"10153151146755950","commenter_b":"Seriously, can this bitch go away?","commenter_a":"Nope don't believe it","post_message":"During their private meeting, Pope Francis told Kim Davis to stay strong, according to her lawyer."},{"comment_id":"10152623544456680","commenter_b":"Yes, I want our economy ran into the ground by having a college drop-out as our president. Said no one. Ever.","commenter_a":"I would rather see him run than Walker! I'm scared of Walker. After what he's done in WI, our economy would be in shambles after one year under him. @webpagelink","post_message":"Jeb Bush isn’t playing well among Republicans, Peggy Noonan writes in a new Wall Street Journal op-ed."},{"comment_id":"644282239071875","commenter_b":"I wish you ugly frumpy women would shut the hell up. Your blind support of Hillary is going to put Trump in the White House.","commenter_a":"He needs to bow out, pledge his delegates to Hillary and move on.. Hopefully she will have a place for him in mind and he can be of some help in the future. He's led a sterling campaign, but has been on the loosing side for the last few primaries and is bound to loose tomorrow.... YAY Bernie for doing what you did, now solidify the party, tell your supporters to support Hillary and then we can all go forward to enihilating trump and winning the presidency. Your Elizabeth Warren can still BE the VP candidate and together the women can set the world on fire and win... America is ready for this.. Trump must be downed and your support of Hillary will clinch that! PLEASE..","post_message":"Does Bernie Sanders keep fighting through July's Democratic convention? Or does he bow out?"},{"comment_id":"10156126266600615","commenter_b":"Make her pay for all the time she has wasted with her stupidity.","commenter_a":"Yes and he should block her from further action, and find her and her attorney's for wasting the court's time and money.","post_message":"What do you think? Will Judge Bunning dismiss Kim Davis' lawsuit against the governor?"}]
