[{"comment_id":"775477502501275","commenter_b":"I agree with Mark Colwell.one muslim won't go against the other.they are all for crap..","commenter_a":"Gee, really, and what would they do if he made them angry? Another Dem moron speaks in defense of her Beloved Leader and what she says is as stupid as they both are. How do these people get through even elementary school being this dumb?","post_message":"And this is what Democrats think about terrorists... #facepalm"},{"comment_id":"451917294996564","commenter_b":"As far as I know, no Subway in America has made this kind of change.","commenter_a":"So how many muslims vs AMERICANS are there in the U.S. that needs changes. REALLY?","post_message":"Should we boycott Subway?"},{"comment_id":"764904010309446","commenter_b":"RBG.. ALL DAY NOW","commenter_a":"When it's American soil , it'll be be armed patriots push back Muslim insurgents ,,, the main steam news will not say so ,, but we the people will !","post_message":"Coming to America soon compliments of Barack Obama."},{"comment_id":"10153394569638984","commenter_b":"What's her problem. Can't she walk straight.","commenter_a":"Crook ( I mean acorn or nut ) probly isn't far from the tree","post_message":"Shakedown artist Al Sharpton’s eldest child wants damages for “loss of quality of life,\" but looking at her recent photos, something seems a little fishy about the claim...  Are you glad to see the younger Sharpton outed for this?"},{"comment_id":"918281018215139","commenter_b":"All depends on how many illegals are allowed to vote!","commenter_a":"Nobody","post_message":"We’re now a little more than a year away from the 2016 presidential election and Hillary Rodham Clinton, long-time Democratic front-runner, has set her sights on the Oval Office. Who in the potential Republican field can beat her? Take our poll. @webpagelink"},{"comment_id":"525788244278422","commenter_b":"Look at her eyes, do you really want this ugly, selfish and stupid woman as your president,,,?","commenter_a":"She won`t be done until she takes her last breath. Shes to damn dumb to quit.","post_message":"Hillary tried to hide the truth, but Gowdy refused to give up until justice was served.  This is amazing. Hillary is finally going to pay for her crimes.  Do you agree Hillary Clinton should be arrested for treason?"},{"comment_id":"10155515421201509","commenter_b":"That woman is the devil incarnated in a human body.","commenter_a":"Change profile pic to RED to show your support of TRUMP/PENCE","post_message":"\"I will not defend or endorse @realDonaldTrump, but I am voting for him. HRC is that bad. HRC is bad for the USA\" the House Oversight Committee chairman tweeted."}]
