[{"comment_id":"1817577751825895","commenter_b":"Another good \"Christian\" pedophile! Family values liar! Beat him ,castrate him and put his sorry ass in prison for Ever!","commenter_a":"Oh my God, I watched this show, everyone of them were so talented, they are all beautiful, the kids were adorable, always dancing and singing, even the very youngest, the Mom was warm and loving. I really believed they were a great family, this is so very sad.","post_message":"Another \"family values\" hypocrite goes down in flames..."},{"comment_id":"10154412876021491","commenter_b":"Does this tour detour to the location of the White House MLK Bust? I hope they know where it is. Don't depend on Time, though.","commenter_a":"Shruti Maheshwari","post_message":"Here's how to score a major deal on a scenic getaway."},{"comment_id":"10153511898009087","commenter_b":"Look at the lies thay have in office today everyone of them for nothing but money .and there's nothing wrong with what trump personally done. .there trash on everyone .","commenter_a":"You will not turn a single vote away from trump support ers .you will only make more people for trump .","post_message":"\"I stand by every question I asked [Donald Trump] and he was not the only one who had tough questions,” Megyn Kelly said. “He was the only one, however, who complained.” WATCH:"},{"comment_id":"10152632904466636","commenter_b":"Natasha Rebecca","commenter_a":"Zee Gee","post_message":"'She was on a mission,' said the owner of the determined little miniature schnauzer..."},{"comment_id":"1113532561997426","commenter_b":"@username you are dumb idiot. W. Bush was the want that gave the tax break to the richest and the big corporations. Do you think that the MF Republica will go along with that, has much they hate like you the President. Went you moron , stupid and idiot use the word SOCIALISM find first the meaning of that word MORON. THE LUCKY ONE IS THAT MF BUSH THAT SEND OUR KIDS TO BE KILL FOR HIS GREED. BUSH NEED NOT THE BE IN JAIL , NO BE PUT IN THE ELECTRY CHAIR, TOGETHER WITH CHENEY AND HIS ADMINISTRATION.","commenter_a":"More for the rich..less for the poor..thanks a lot.","post_message":""},{"comment_id":"10153252381712016","commenter_b":"Don't speak for young women. You aren't one.","commenter_a":"Young women see through Hillary..she put up with a cheat for a husband as a ticket to the WH...thats not what young women want for a future...its from the 50s...she lied to protect him through numerous scandals and no longer does it convincingly...she mumbles stock phrases about equality with no real commitment to anyone but her ambition!","post_message":"\"Through a record-breaking voter turnout, we won because we harnessed the energy and the excitement that the Democratic Party will need to succeed in November.\" --Bernie Sanders"},{"comment_id":"852688794861003","commenter_b":"Biggest POS IN AMERICA TODAY, then KILLARY","commenter_a":"Yes","post_message":"President Obama continues to top lists of most admired people in the world. Do you admire him?"}]
