[{"comment_id":"10153763460367629","commenter_b":"The wall will be built of hatred and ignorance.","commenter_a":"Creepy!","post_message":"So cute!"},{"comment_id":"10155169857528690","commenter_b":"Que triste, que bom que salvaram!! Quero adotar!!!","commenter_a":"Daniela","post_message":"91 dogs and 10 cats were rescued from a suspected puppy mill in Australia."},{"comment_id":"10152949649721378","commenter_b":"I don't use any drugs...yet your comment is still incomprehensible.","commenter_a":"Disturbing and sinful....","post_message":"IRELAND  MARRIAGE VOTE NUMBERS: 62.1% of voters in Ireland were in favor of same-sex marriage in the world first national vote on the issue.   Ireland's deputy prime minister, Labour Party leader Joan Burton, said Ireland was becoming \"a rainbow nation with a huge amount of diversity.\""},{"comment_id":"10154654618245575","commenter_b":"@username are you by chance a Libetard? from cali ?","commenter_a":"The President to be mocks the loser that's really Presidential.","post_message":"TRUMP MOCKS HILLARY ON HER CANCELLED FIREWORKS SHOW! ---VIDEO"},{"comment_id":"10153352835244384","commenter_b":"I love Nancy Pelosi. Her farts smell like broccoli.","commenter_a":"I love Nancy Pelosi, she is a superb role model, and tireless worker for all Americans!","post_message":"Today, under the leadership of Congresswoman Rosa DeLauro, House Democrats are again taking the lead in addressing one of the most pressing economic challenges confronting our country by re-introducing the Paycheck Fairness Act. Securing a fair shot for women in the workplace is critical to ensuring prosperity for our nation. Rather than continue their cycle of obstruction and dysfunction, House Republicans should join with us to close the gender wage gap so we can provide bigger paychecks and better infrastructure for all Americans. @webpagelink"},{"comment_id":"1191127007601184","commenter_b":"Sometimes it takes longer for the other egg. They don't always lay both at the same time. And if was a bad egg she would get rid of it.","commenter_a":"It's crop never seems to look full?","post_message":"AFTERNOON #HATCHWATCH2017: Anytime now, the second eaglet is expected to hatch. A New Year's Day birth, perhaps? Video courtesy of Dick Pritchett Real Estate @webpagelink"},{"comment_id":"1738896129708338","commenter_b":"Abortion queen, and has no shame.","commenter_a":"this drunk, druggie idiot has comments that no one cares about. She is a has been,, and has been Had !!! Loser, Drunk","post_message":"Renowned moral philosopher Chelsea Handler condemns Trump.   The paragon of virtue also adds: \"Please buy my book, 'My Horizontal Life: A Collection of One Night Stands'\"..."}]
