[{"comment_id":"1857318871171795","commenter_b":"DRAIN THE SWAMP!! TRUMP/ PENCE 2016","commenter_a":"Thank you for making this so much easier to understand and for opening eyes as to what is really at stake!","post_message":"Clinton pay for play speeches. Understanding how it all works, and who gets paid for what -- all the favors --- and why she wants so many refugees.  Please watch and share.  If you are new to DML please give him a LIKE.  You won't regret it."},{"comment_id":"911808665590508","commenter_b":"Go home","commenter_a":"Ok send these people back where they came from.....F them!","post_message":"OUTRAGEOUS: MUSLIM Students At Public School Walk Out When NATIONAL ANTHEM Plays  Lets get 3000 SHARES if we should deport them!"},{"comment_id":"1480804778605937","commenter_b":"FEAR-MONGERING ULTRA-RIGHT FASCISTS!","commenter_a":"Well, there's this...@webpagelink","post_message":"Washington State Republican Party chair Susan Hutchison​ is holding a news conference after the Washington state attorney general announced a lawsuit against President Donald Trump over the immigration executive order. >> kiro.tv/WASuesTrump"},{"comment_id":"10153695789091336","commenter_b":"No women in combat puts the men at risk to protect them they are targets of the enemy..don't care how strong or tough you think you are you get in the enemy's hands you will see the truth","commenter_a":"There is no way a woman is as physically strong as a man. That is just the way it is. It is just common sense. A woman could be jeopardize the safety of other marines when in battle","post_message":"The U.S. Marine Corps would request a waiver to keep women excluded from infantry and artillery positions, but not armor positions like serving in tank units, according to an official."},{"comment_id":"1095660007120418","commenter_b":"good, dumb woman","commenter_a":"The tiger is a wild animal! What did she think would happen?","post_message":"Officials believe Jacqueline Eide, 33, entered a Omaha, Nebraska,zoo and tried to pet a Malayan tiger, which bit her hand. >>kiro.tv/TigerBite"},{"comment_id":"10152715320866636","commenter_b":"Bc she is a twat!","commenter_a":"But how is this possible? Our esteemed governor immediately came back with, \"Nope, can't afford it,\" when the idea of building storm shelters for the schools was put before her...","post_message":"When an E-F 3 tornado passed dangerously close to El Reno Schools, the district took steps to ensure that if it ever happens again, students and staff will be safe."},{"comment_id":"525067284350518","commenter_b":"Leave our country. Go home and behead your own.","commenter_a":"Leave!","post_message":"Texas sends huge message to Muslims everywhere, and they're not happy.  Let them be angry. This America and if you don't like it, get out.  Do you agree that Muslims should assimilate or leave?"}]
