[{"comment_id":"1865190080165091","commenter_b":"What about the serial killers child molesters child rapists murderers here in the United States we should get rid of all of them as well have them sent somewhere so they can stop all this craziness here and yes there are many Savages right here in the United States","commenter_a":"These people are f--king sick get them out of our Country.","post_message":"Muslim Nurse Mutilates Little Girl’s Genitals, What She Told Her Is Even SICKER"},{"comment_id":"10152795603885950","commenter_b":"if i turned into a woman id still want a woman so id be a lesbian, lets all turn to woman","commenter_a":"thats right, if i want to be a woman, ill be a woman, but i kind of like my dick so ill keep it","post_message":"\"If he says he's a woman, then he's a woman.\""},{"comment_id":"10153584553228010","commenter_b":"time for a woman in the white house now","commenter_a":"Don't blame me for the situation of this nation. I did not vote. I opt out.","post_message":"What if you were automatically registered to vote? Oregon has a history as a ballot-box innovator."},{"comment_id":"1072932319412282","commenter_b":"#BuildTheWall","commenter_a":"I hear the Train a comin, It's rollin' 'round the bend. And I ain't seen the sunshine Since a Trump win. I'm stuck in Obama's nightmare, And I just want to be free. But the TrumpTrain keeps a rollin' Down to Washington, DC. I bet there are voters, eating in dining cars, They're probably cheering and smoking big cigars. I know Obama had it coming, I voted for hm and can't be free. But the train keeps a movin' And that's what tortures me. Watching the TrumpTrain Rollin' down to Washington, DC.","post_message":"Join us in Indianapolis at 4 pm today for a major announcement!   RSVP here: @webpagelink"},{"comment_id":"1324679534258458","commenter_b":"The women who aren't giving it up are defending her.","commenter_a":"She might be asexual.","post_message":"'I love my husband ... I just don't want to have sex with him'"},{"comment_id":"1765902270312370","commenter_b":"Asshole","commenter_a":"P","post_message":"The message from Ted Cruz and Donald Trump is clear: If either of them become president, Guantanamo Bay won't just stay open -- it will be expanded. Does that sound good to you?"},{"comment_id":"10154542806314497","commenter_b":"Andrew Wright","commenter_a":"This title Matt Strzalkowski","post_message":"Via ClickHole:"}]
