[{"comment_id":"919423778080478","commenter_b":"You'd have a point (kinda) if it was a white girl. But shes black. So she has no argument. Neither do you.","commenter_a":"Wow I gotta admit I'm surprised at all the responses. As a dark skin man I understand that woman. If u an Artist and u preach something u should be about that something. Now as humans u love who u love but when u are a celebrity u open yourself to critisim good or bad.","post_message":"\"Dark Skin Activist\" Slams Kendrick Lamar Over Light-Skinned Fianceé: “I Will Never Support Him”"},{"comment_id":"10155222561152316","commenter_b":"Can you prove she rigged the election?","commenter_a":"Killary is our threat not TRUMP. Why wasn't she arrested for rigging the election? Yall are not covering her criminal acts, are you ?","post_message":"Republican presidential nominee Donald Trump is asserting that countries like France that he says are compromised by terrorism may be subjected to the \"extreme vetting\" he proposes as a deterrent to attacks in the U.S."},{"comment_id":"760481220717153","commenter_b":"stupid bitch","commenter_a":"SICK SICK what the hell is wrong with people now days?","post_message":"Terrible."},{"comment_id":"762861520482540","commenter_b":"Your lady isnt going to win lol thats a joke","commenter_a":"Hmmm but notice how all places she wins have issues with the polls.. Shes a cheat and a fraud whos bought out..","post_message":"Bernie Sanders went just one for five on Tuesday, bagging only Rhode Island."},{"comment_id":"563455260481095","commenter_b":"Apples have arsenic in them. Apples will kill you.","commenter_a":"So will parents of vaccination damaged children be given the same treatment?","post_message":"The parents used a variety of home remedies — including water with maple syrup — to boost their son's immune system after he became stiff and lethargic.   The 19-month-old baby had been sick for a couple of weeks when he suddenly stopped breathing."},{"comment_id":"666187176847797","commenter_b":"Too much butt kissing being done. The pilot and his white privilege remark, the seat mate's skin color even being mentioned, the flight attendant feeling compelled to apologize...oh, brother! This chick needs to put her big girl panties on and if she's a peace loving/seeking person, she'd drop the whole issue.","commenter_a":"So let all muslims boycott United, I will feel much safer with them not being there. Muslims are lower than whale shit.","post_message":"Look what happens when a flight attendant refuses to give a Muslim woman a Diet Coke..."},{"comment_id":"848788448587668","commenter_b":"@username is trying to use bully tactics to shut up anyone that doesn't agree with him. It won't work. We're fed up!! We will not call evil good and good evil, so crawl back to your safe space and stay out of the women's bathrooms!!","commenter_a":"I am NOT a bigot and i hate being told i am because i do not like what Target did.. that is crazy !! i really do not care what they do.. but not in the little girls room","post_message":"I hope this video makes the rounds....Target has completely LOST IT at this point....shame on them."}]
