[{"comment_id":"10153108326524197","commenter_b":"So sad just terrible how ppl are raising bullies and don't see anything wrong with it just so saf","commenter_a":"oh dear god what's wrong with these kids disgusting","post_message":"This girl died as a result of bullying, according to her mother. She said the reason her daughter took her own life extended beyond the walls her classroom: @webpagelink"},{"comment_id":"10156261922235354","commenter_b":"Time to go home.","commenter_a":"Don't know Trevor ...M and glad of it.","post_message":"Nevertheless, Trevor Noah still trashed Dr. Ben Carson for being \"callous.\"   No joke."},{"comment_id":"968194983273556","commenter_b":"The bitch sucks and is a liar and a cheat","commenter_a":"Is she your next President? I don't think so.","post_message":"She still managed to pay herself back the $1.3 million she lent her disastrous campaign."},{"comment_id":"608123169320865","commenter_b":"F**K Oprah .......she's a Racist Bitch.","commenter_a":"Hey. Heads up. Being gay is no more of sin than lying. Stop being so judgmental. Leave that to God. He says to love one another; guess what, a lot of you are clearly struggling with that.","post_message":".............................yikes"},{"comment_id":"1336023863131032","commenter_b":"Ppl crazy af time for u ta go","commenter_a":"Renata","post_message":"The female had to get some  in too. #WSHH"},{"comment_id":"10153507396631323","commenter_b":"She wears real fur....therefore she's a selfish bitch with no regard for the lives of others. I've never liked her. Seems I'm not alone in that here.","commenter_a":"I really couldn't care less about her, she's contributed nothing positive to this world.","post_message":"Why do newspapers hate Kate Moss so much?"},{"comment_id":"10152851658596636","commenter_b":"I am Muslim..&I say Good For Them! I hope it's banned allover the world..it has nothing to do with Islam .. It only has to do with Extremism &safe wise.. It's very dangerous...in many cases it's being used by terrorists..men or women escaping the law...etc","commenter_a":"Should be banned everywhere in the civilized world, its loved by fanatics, it belongs in regressing places like the Isis caliphate only.","post_message":"The Government says the move has 'nothing to do with religion'"}]
