[{"comment_id":"10154030310632061","commenter_b":"Hillary can send emails to Satan but Donald still won't get my vote!!","commenter_a":"She should be in jail!!! And she should have never been allowed to run for president! Now we have two people running and I can't stand neither","post_message":"The newly discovered emails that prompted the FBI to reopen the investigation into Hillary Clinton private server came from a separate federal investigation of former Congressman Anthony Weiner, multiple sources tell ABC News."},{"comment_id":"923822694380650","commenter_b":"@username, Hillary is not a good choice for president. I'll take Bernie Sanders!","commenter_a":"How pathetic is this woman??? EVERYTHING she does has an ULTERIOR motive....EVERY word is calculated......she is not genuine in the least bit.....","post_message":"Hillary Clinton will soon meet this history-making couple."},{"comment_id":"10153991958186509","commenter_b":"Remember We are talking about illegal immigrants ILLEGALS","commenter_a":"Ricky Martin, go back to singing and dancing. Trump was referring to illegals....illegal is a status not a race. BTW, I'm not a Donald Trump supporter, but I can see the difference.","post_message":"Ricky Martin blasts Donald J. Trump for making \"racist, absurd, incoherent, and ignorant\" comments about Latinos. @webpagelink"},{"comment_id":"709686039165167","commenter_b":"@username Illegals don't have insurance.","commenter_a":"Norway has a single payer health system as does every other civilized country in the world but us. Get insurance companies out of the middle of my health care. They jack up the prices on everything, not just drugs. UPDATE: every other civilized country has either single payer or two-tier system. I included a link below. Scroll down.","post_message":"U.S. drug prices are higher for 93% of 40 top branded drugs compared to Norway. That is unacceptable. We should use our buying power to get better deals for the American people."},{"comment_id":"976218969153516","commenter_b":"I hope she gets life in prison! She is a twisted individual! The other prisoners know how to handle child killers. She woo get what's coming to her then rot in hell!","commenter_a":"They all should die the very same way he did!!!!!!","post_message":"Rachel Bostian, one of three women charged with savagely beating five-year-old Alexander Stephens to death during a 22-hour abuse and torture marathon — one of the accused women the little boy’s own mom — pleaded guilty to murder and several other charges in an Ohio courtroom last Friday, according to a report in The Cincinnati Enquirer. But what led Bostian, 29, and allegedly her 26-year-old friend and Alexander’s mom Theresa Hawkins-Stephens, as well, to tie the little boy up for what... @webpagelink"},{"comment_id":"10153301604366680","commenter_b":"Get OUT !","commenter_a":"NH. Nah. NH. It's ok. NH. Isn't IA. Don't worry. NH. I","post_message":"It was bad."},{"comment_id":"908658009268823","commenter_b":"@username still smarter than that orangutan! That orange menace!","commenter_a":"Hillary Clinton is a walking oxymoron... Innocent yet Guilty!","post_message":"Hillary Clinton rips into Donald J. Trump for his critique of retired four-star Gen. John Allen, saying it's unpresidential to \"insult and deride our generals.\" @webpagelink"}]
