[{"comment_id":"10152961247876680","commenter_b":"That's you and your crowd... Dead and cut up babies sold for the meat market !","commenter_a":"I proudly stand with Planned Parenthood.","post_message":"The move dramatically increases the chances of a government shutdown fight in the fall."},{"comment_id":"889054771211302","commenter_b":"It doesn't happen to muslim women because they are all fugly uckers..","commenter_a":"Go fuck yourselves, dune coon","post_message":"ClashDaily.com"},{"comment_id":"10154236917854726","commenter_b":"Hillary must never be allowed into the White House.","commenter_a":"What about these rides on that billionnaires plane!","post_message":"Media pushes war-on-women narrative against GOP while ignoring indiscretions of Bill Clinton."},{"comment_id":"549265795241268","commenter_b":"Those boarders should never been opened... Obama fault all the evil happening in the world, is all due to Obama turning loose the Muslim maggots and Mexicans by mostly the Muslims... Their eating up all the good stuff in the world just like maggots do and ruining everything!!!!","commenter_a":"Yes","post_message":"BREAKING: Mexican Military Invading US, Begin Shooting Texas Residents.  We Trump's wall now. This is getting out of hand.  Do you think we should close our borders?"},{"comment_id":"1557919144505066","commenter_b":"Absolutely! The party comes first to Republicans.....the people and the country are not important until they can be used to the advantage of THE PARTY. Sad","commenter_a":"Honestly, I'm worried about 'merica if trump is such an overwhelming decision for them to make. Consider the members of the Republican party, they're going to vote trump because he's not a Democrat. That means, party alliance is more important to them then things like racism and ignorance. Give me a break.","post_message":"President Obama slow jammed the news and also talked about Donald J. Trump, Hillary Clinton and Bernie Sanders."},{"comment_id":"10153780723343984","commenter_b":"the Muslim parents could have kept their brats at home that day and celebrate their butts off.","commenter_a":"Yes","post_message":"Tempers flared after this city's board of education refused to take a day off of school in observance of an Islamic holiday, and these Muslim parents were NOT happy about it.  Do you agree with the decision these school officials made?"},{"comment_id":"10158044749370294","commenter_b":"@username nothing about him says he would do any of that....he got into a car crash lol stop making these puppets look like heros","commenter_a":"Why was he even shot when he had no weapon e could have been taken in to custody without killing him. That officer needs to be investigated and put on leave of absence","post_message":"There's still a lot of question about what happened leading up to the fatal shooting of a college student."}]
