[{"comment_id":"10153134477163984","commenter_b":"Already too late!! Enforce the law that is already on the books, secure the border and there would be no need for immigration reform and less deportations!!! No jobs for the American Citizens now, so let's grant amnesty to 5 million illegals!! That will get the economy and the job market rollin!!!","commenter_a":"No person has every done more to harm the best nation in the world than this man ! I am surprised a patriot has not shot him by now ?","post_message":"This is one of the scariest things I have read in a long time. If Americans don't wake up, it could soon be too late.  Spread the word about this danger."},{"comment_id":"1649214788452320","commenter_b":"She is one ugly mofo ..lol","commenter_a":"So true -- just the respect HE deserves, not his (temporary) office.","post_message":"No problem, Crazy Lady."},{"comment_id":"1259466750760461","commenter_b":"@username=republitard shitbag","commenter_a":"Really? Last I checked, this is still Obama's America...... Next year you can call it Trump's but for now it's ALL Obama......","post_message":"Welcome to Donald Trump’s America."},{"comment_id":"10153383373028984","commenter_b":"Why don't you go back to where you came from Asshole!!!!","commenter_a":"President Obama said the right thing.","post_message":"Israelis are NOT happy about this, and it's easy to see why. Whoever becomes president in 2016 will have a lot of work to do in repairing relations with Israel...  Do you support Benjamin Netanyahu - בנימין נתניהו and Israel despite what Obama does?"},{"comment_id":"10153264907976336","commenter_b":"The illegals are bleeding the system dry, plain and simple and then there's the government that doesn't give a crap about the poor because they largely do not see a reason to vote and therefore don't","commenter_a":"Yea and that will never happen. Illegal immigration will never completely stop as long as we have open borders and waterways","post_message":"In a Fox News Sunday exclusive, presidential candidate Marco Rubio says he still believes the U.S. needs immigration reform but it can’t be done “in one big piece of legislation.”  WATCH: @webpagelink"},{"comment_id":"10153463508245950","commenter_b":"@username thats your opinion, but if she makes president, guess what....WERE FUCKED even more!!!!","commenter_a":"I'm not a Clinton supporter, but well said. Hillary's maturity and eloquence are refreshing after listening to Trump and the rest of the GOP schoolyard clamor.","post_message":"Donald J. Trump has \"incited this violence over months,\" Hillary Clinton says; watch the Democratic candidate's interview with Nancy Cordes: @webpagelink"},{"comment_id":"10153451405011336","commenter_b":"The sooner the better. We're going to need them to bail us out.","commenter_a":"When are we joining the European Union?","post_message":"JUST IN: The Confederate flag will be taken down Friday. @webpagelink"}]
