[{"comment_id":"10153178663173854","commenter_b":"i think this has been going since christ was born these people have been fighting all this time","commenter_a":"Yes Sir on that one! God bless you","post_message":"Rev. Franklin Graham: Imagine the Outcry if 21 Muslims Had Been Beheaded by Christians"},{"comment_id":"1108181272536216","commenter_b":"thats how i hid my virginity, yeah do that","commenter_a":"Cilian they're coming for reggie","post_message":"This is awesome."},{"comment_id":"1802278956685902","commenter_b":"She is winning calm down","commenter_a":"Bahahaha 95% of the comments are anti Hillary and they have us believing she is winning...","post_message":"We're in Denver, Colorado, where both Bernie Sanders and Elizabeth Warren are holding a rally for Hillary Clinton."},{"comment_id":"10153380454004270","commenter_b":"Well lady if you want the horrors of War you go for it.","commenter_a":"Can they take the mental pressure of War. And getting raped by someone like ISIS?","post_message":"\"I think women are showing they can do the job. Physical capability is not the issue; it’s men’s acceptance of women that’s the issue.\""},{"comment_id":"10153205553056782","commenter_b":"@username...the difference is that I am a legal United States Citizen and the illegal criminal is not. They broke the law so that makes them a criminal..and as for pushing...the illegals are the ones that are not going to like the results.. You come to the U.S. legally and you are welcome with open arms. Illegals come here by breaking the law and then refuse to learn English and then demand they be given the same rights as American citizens and for things to be changed to fit them...BS!!!!","commenter_a":"This is complete BS!!! They are illegals!! NOT undocumented.... In Oklahoma you have to prove you are here LEGALLY, not an illegal criminal to get an Oklahoma ID or DL. Sign up for a DL as an illegal and get deported.","post_message":"An Oklahoma City grassroots effort to get undocumented immigrants drivers licenses is gaining momentum."},{"comment_id":"1074790329229886","commenter_b":"You're going to be the sad one when this country has the problems all countries that Muslims populate have, rape murder persecution. All countries that are being invaded by \" refugees \" are living in fear, there are NO success stories of peaceful Muslims coexisting","commenter_a":"These comments reflect a said piece of America that just wont die... Progress has left you behind, blind and ignorant. You worship a billionarw who says he cares about you while sending your jobs overseas, knows nothing of history, and can't answer direct questions about policy. The world mocks you, I pitty you","post_message":"A GREAT NIGHT IN IOWA! Thank you for all of your support. Get out and VOTE! TOGETHER we will MAKE AMERICA GREAT AGAIN! #IACaucus #FITN"},{"comment_id":"10153544665036159","commenter_b":"about as transparent as a full inkwell","commenter_a":"Because all requests and responses must be vetted by the White House. Who would ever imagined!","post_message":"Transparency?"}]
