[{"comment_id":"10154860386705470","commenter_b":"So why are you flocking to America?","commenter_a":"Of course we should. We should also stop doing drugs, selling drugs, prostitution, eating high cholesterol. What kind of a story is this. No one is advocating hate crimes and there are more hate crimes in India from Hindus and Muslims than almost anywhere else in the world.","post_message":"It’s been a long day for Srinivas Kuchibhotla’s widow, his coworkers at Garmin, those in his home country of India, members of the Olathe community, and those with Indian heritage who live in the US.  “Even though that guy was talking so discriminately about his race, he was still minding his own business... He did not deserve a death like this.\""},{"comment_id":"10153923556708690","commenter_b":"they will unfortunately forever be in western countries, untill all western countries are taken-over by muslims, because western countries have welfare system, none of the arab countries have a social welfare system like western people... so only when social welfare is completely destroyed like in sweden, they will have to get back to survive.. (^_^) sweden has taken in so many muslims it completely destroyed the economy.. destroyed women lives, destroyed everything. welfare is completely drained","commenter_a":"Maybe Muslims should stop migrating to Australia than and instead migrate to the arab countries.. Why don't they? Why do muslims prefer to migrate to democratic Australia and the western countries rather than the sharia-ruled arab states?","post_message":"A November survey by two universities and a research centre suggests that Muslims in Australia experience racism three times the national average. @webpagelink"},{"comment_id":"10153981518484749","commenter_b":"These drivers are trespassing on private property. The property owner is 100% within her rights to report each trespasser to the police and have their cars towed.","commenter_a":"why not have it towed? make a deal with a local tow company and get a commission off each car towed from your driveway","post_message":"\"Happy digging, at least it's not raining.\""},{"comment_id":"970914179695452","commenter_b":"Shut up!","commenter_a":"Proof that even when your dad is the ex-President and your mom is the future president, family pictures are still a disaster P.S. It is a joke. You all need to chillax!","post_message":"Happy Father's Day, Bill!"},{"comment_id":"10154577963871323","commenter_b":"President Mitterand had wife and kids plus a lover with who he had a girl!!! Lol","commenter_a":"If it was France or even Italy it wouldn't be an issue and would be distasteful to bring up in public. In America there is a certain ownership in marriages rather than partnership. Maybe she loves him as a man and equal in mind, the fact that he does have a wandering eye (penis) may be something she is willing to accept the way we accept a partner's handbag obsession.... Just saying....","post_message":"The end of a relationship – even a years-long marriage, even an otherwise-good relationship, even with children in the mix – is, at this point, the only acceptable consequence of infidelity, and staying is posited as the inexplicable choice for a woman to make.  But life and love are more complicated than that for many people, even in 2016."},{"comment_id":"1065131623520589","commenter_b":"R.I.P.","commenter_a":"Awwww, RIP, Al","post_message":"RIP Al from Happy Days. He passed away on Friday at age 96."},{"comment_id":"496937747163472","commenter_b":"Put the hag in prison","commenter_a":"I like that picture of Hilliary, \"hands up, bitch, you're under arrest.","post_message":"New documents released shows incriminating evidence that could put Hillary away for good.  She is a terrorist. We need to act now.  Should Hillary Clinton be arrested for treason?"}]
