[{"comment_id":"10153239579440329","commenter_b":"Bitches be trippin'","commenter_a":"@username @username Cayla Ray hmmm I don't know anyone like this","post_message":"That One Co-worker who gets weird when people touch their stuff."},{"comment_id":"10153182951850950","commenter_b":"Oh, just stop with the outrage already. African countries sell these permits for more than the price of the average house in the USA, and only allow hunters to take the old males that have already reproduced. The people in the communities get the meat, sometimes by the ton.","commenter_a":"Sad. Money wins","post_message":"Though Zimbabwe's national parks authority said the shooting of a massive African elephant was legal, some conservationists said it's unethical."},{"comment_id":"367438390047230","commenter_b":"Devora Sexton and you are a cheap whore","commenter_a":"If a man's children and wife are a measure of him, Trump is a hell of a guy.","post_message":"Another reason Dems are terrified..."},{"comment_id":"10153641200792235","commenter_b":"Fame whores","commenter_a":"Take your pick...lol","post_message":"Petty, childish and HILARIOUS all at the same time!"},{"comment_id":"10152997685931336","commenter_b":"Now we have the iic ( idiots in charge ) fighting the isis. Stop talking about it and just do it.","commenter_a":"I hope isis dont watch tv...","post_message":"A U.S. military official has outlined plans to retake the key Iraq city of Mosul from ISIS terrorists as early as April, but the move has swiftly drawn criticism that the Pentagon is revealing too much information. @webpagelink"},{"comment_id":"1076528565795194","commenter_b":"Let's see ... when he said, \"yes she broke the law, but we don't think it rises to the level of prosecution... \" everyone was happy. Now something changed that ... something explosive enough to convince someone who supported and did everything to protect Hillary ... that \"something\" is enough for me to say I CAN'T TRUST HER! WHERE THERE'S SMOKE... THERE'S A FLIPIN' INFERNO!","commenter_a":"www.mostdamagingwikileaks.com","post_message":""},{"comment_id":"1273581186010307","commenter_b":"Shut up bitch","commenter_a":"I wonder what u yank heros would do if a dog attacked u?? That's right, each and every one of u pussies would take out your big tough guns and shoot it!! You're all cowards who hide behind guns so don't blame the cops for doing their jobs","post_message":""}]
