[{"comment_id":"1018949481459396","commenter_b":"Bitch","commenter_a":"So men are the most evolved. We do it since birth. Maybe that's why women never let us forget shit because they're living in the past.","post_message":"And that's why men have nipples!  Via Curiosity."},{"comment_id":"10153319872961770","commenter_b":"What does Mexico have we can't go without WE don't need the Border jumpers We don't need all the drugs coming across they have nothing WE need in this Country and they will realize this and pay for the wall","commenter_a":"Great! Time to get these jobs back. TRUMP 2016!","post_message":"Donald J. Trump said he would be willing to start a trade war with Mexico in order to make the country pay for the wall along the US/Mexico border."},{"comment_id":"758408480932531","commenter_b":"A BRAVE WOMAN!","commenter_a":"Brave lady. Stay safe!","post_message":"Thanaa Jawabreh prompts a heated debate following a public apology for the ‘horrendous’ shooting attack that killed aIsraeli couple."},{"comment_id":"1673203152922095","commenter_b":"Fucktards.","commenter_a":"Oh come on....we have laws for a reason..I don't care what color your skin is...if you urinate in public..you need to be arrested!!! What is this world coming to???","post_message":"New York City’s city council is set to dilute a host of criminal laws including laws against public urination and excessive noise because council members believe too many members of minorities are getting arrested."},{"comment_id":"10154322380197217","commenter_b":"I'm just surprised he didn't grab her in the pussy","commenter_a":"Anyone else shudder when he leaned in to kiss Michelle Obama?","post_message":"Hugs and a gift. The Trumps meet the Obamas at the White House   #InaugurationDay   bbc.co.uk/inauguration"},{"comment_id":"1330438396971266","commenter_b":"Better than the PUSSY approach you girls are doing","commenter_a":"What does Biden know he follows Obama.","post_message":"Biden took on Trump in a recent foreign policy speech, arguing that America doesn't need \"empty bluster,\" or the \"insecurity of a bully.\" What do you think of his comments?"},{"comment_id":"692144217642823","commenter_b":"A lesbian trap in a mans body...say what.","commenter_a":"How can Caitlyn get the award for woman of the year if she still has a dick ????","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award.  This is what our world has come to. It doesn't get more absurd than this.  Do you think this is wrong?"}]
