[{"comment_id":"10153848371885779","commenter_b":"Not*","commenter_a":"RS, why in the world does a music magazine now consider itself a forum for serious topics and an authority on what people ought to think? You are obviously pushing a liberal agenda when Noone with any sense is turning to you for any of this. Go cover a Backstreet Boys reunion show and leave these matters to serious adults in unbiased forums.","post_message":"At last night's #VPdebate, Mike Pence explained that his faith controls his position on abortion. But Pence's stance is nothing short of cruel toward women."},{"comment_id":"1053026444717108","commenter_b":"Good. She is druggy scum! She deserves to never ever see him again!!","commenter_a":"Mother, child bond, find away to keep them together","post_message":"PLEASE SHARE: Puyallup police are asking the public to be on the lookout for endangered 5-day-old Jeshua Taylor and his mother (pictured) Myra Maria Aguilar. Police said Myra appears to have fled with Jeshua in an attempt to keep the child from state custody. >> @webpagelink"},{"comment_id":"10153677801340530","commenter_b":"Wow dicks can talk. .","commenter_a":"But, the SCOTUS said there is no racism in America.","post_message":"Community and city leaders are strongly condemning a racist flyer against blacks that was circulated in Southfield tied to an upcoming mayoral election."},{"comment_id":"1065496103473179","commenter_b":"J.K. needs to mind her business.","commenter_a":"WOW! She shut it down! OMG! Trump is backing down because a writer...no wait! This article isn't about the writer...it's not about Trump. It's about Pierson. No wait, it's about a writer comparing to one of her make believe characters. Jesus, if your going to attack; pick an opening paragraph and stay on topic. If you can't do that...atleast get the headline to reflect the topic...","post_message":"Just 5 words  and they say it all."},{"comment_id":"10153639148511656","commenter_b":"Girl! Lol.","commenter_a":"Uhm... Hmmm...","post_message":"In the lawsuit against Kendrick Lamar, the woman alleges that she met with the rapper in Philadelphia and the two  for like two hours, over the course of which they  a deep conversation."},{"comment_id":"10154691937306509","commenter_b":"She's a big crock!","commenter_a":"Great job @username....this debate is @username attacking Bernie Sanders....your agenda is so obvious....I'm not sure why I bother to watch this.","post_message":"\"Talk about the kinds of problems he had answering questions about even his core issue: breaking up the banks...\"  Hillary Clinton criticizes Bernie Sanders' answers to questions from The New York Daily News.   Live updates from the #DemDebate: @webpagelink"},{"comment_id":"1777971925823252","commenter_b":"She's cheating with a cheater, duh.","commenter_a":"Can't stand him. Good voice but once a cheater, always a cheater . Maranda your so much better without him. Keep up the good music. He's trash and so is She. .","post_message":"Whoa..."}]
