[{"comment_id":"883919521667797","commenter_b":"newsflash, genius. there's a bunch of dumb females already in ISIS.","commenter_a":"no female should be deployed where isis are, you are just asking for trouble.","post_message":"Kayla Jean Mueller, 26, traveled the globe fighting genocide, AIDS and domestic abuse."},{"comment_id":"10153868585859203","commenter_b":"She wouldn't fuck any of you dude bros anyways.","commenter_a":"She looks great. Bold, sexy, unflinching, human.","post_message":", gross, strong, thin, fat, pretty, ugly, sexy, disgusting, flawless, woman."},{"comment_id":"2049822328577410","commenter_b":"@username Mexican rapists.","commenter_a":"My question is, why is the inauguration not being cancelled until all of this has been investigated and charges brought together? Why is nothing being done?","post_message":"\"Either Donald J. Trump and friends have engaged in treasonous acts or America’s intelligence officials are guilty of a colossal lapse in judgment — or worse, a conspiracy against Trump. Either way — whether any of these allegations are true or false — the entire matter must be investigated thoroughly and immediately.\" - Bill Moyers and Michael Winship"},{"comment_id":"953133518031452","commenter_b":"Wow, county officials must be really threatened by gays getting married. We should tie them to chairs, and make them watch gay marriage ceremonies for weeks on end, to desensitize them.","commenter_a":"Go to the gulf and marry on a ship!","post_message":"They just cannot deal"},{"comment_id":"651668038332170","commenter_b":"And the idiots will vote her in.","commenter_a":"Thats true Mr President! A lot of unfair things are happening. Please take control of this country.","post_message":"The system is rigged. General Petraeus got in trouble for far less. Very very unfair! As usual, bad judgment."},{"comment_id":"10155133952496162","commenter_b":"@username you must be a huge pedophile with the ladies!","commenter_a":"He'll be back later to collect on that investment! We'll hear some sappy story how he's been stalking from afar, & how they got hitched! He left $1000.00 due to them knockers!","post_message":"WAITRESS $1,000 TIP: Waitress Jennifer Peitsch works two jobs a day  to get by.\" Imagine her surprise when a generous diner last week left her a $1,000 tip on a $87.15 bill. Jennifer was moved to tears @webpagelink"},{"comment_id":"1059407147484519","commenter_b":"She is terrible!!! She never said how she would protect us. My dog can do better than her!!!","commenter_a":"Agree!","post_message":"Eric Trump criticized Hillary Clinton's foreign policy and said it should be a requirement for Americans to watch \"13 Hours: The Secret Soldiers of Benghazi\" before voting for president."}]
