[{"comment_id":"1765714417015228","commenter_b":"You girls sound like that reporter that went over there to prove her point and got killed by them. LOL","commenter_a":"Totally believe women should be able to wear burkas as part of their religious dress, same for the Jews and their hats, etc. This is disgusting.","post_message":"The bill wouldn't just prohibit Muslim women from wearing burqas or veils in state driver license photos, it would also ban them from covering their faces while driving and possibly while on any public property."},{"comment_id":"10154210994334024","commenter_b":"@username and never apologized! Hillary blamed them and called them vile names. Such double standards.","commenter_a":"This book was praised by women readers and them running to the theaters to see the movie, but offended by what trump said 11 years ago. The vulgarity of those novels enormously outweigh what he said. Such hypocrisy!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10155994717525615","commenter_b":"Well, we now know which four are the cream of the crap.","commenter_a":"What does that say about the four that signed?","post_message":"NOM could only get four out of 17 candidates to sign? What does that say about their influence?"},{"comment_id":"218545795283614","commenter_b":"Children in poor areas should not be doomed to poor schools.","commenter_a":"Yes, The GOP has lost every bit of self-respect they ever had. To vote Betsy DeVos in as education secretary with no educational experience is just irrational. If Betsy were smart she would decline the office and get the hell out of town now. She will not survive as educational secretary.","post_message":"Republicans just sold our public schools to the highest bidder.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"939907909435597","commenter_b":"Aren't most Americans \"Economic Migrants\"?","commenter_a":"Then we have to accept everyone that comes to America theyre refugees well so are people who are running from drug cartels","post_message":"It's the American thing to do. What better way to show Trump and the rest of his racist rivals that they do not represent us?"},{"comment_id":"10153459873801756","commenter_b":"She's a Jew deliberately provoking hatred between Christians and Muslims.. Ask yourself why...","commenter_a":"I have to say I thought more people would be for protecting speech from violence, since we're in the liberal west and all, but apparently not. Paris gets shot up and the claim is to be \"je suis charlie,\" Texas gets shot up and \"they were asking for it.\" Makes no damn sense. You're either for the rights of us all to speak without fear of being shot, or you're not. I went to a public school and I learned that Voltaire quote. Small minded terrorists of an idiot ideology that requires giving your life to kill anyone who mocks your \"sacred\" beliefs. What a load of bullshit.","post_message":"The group's executive director runs a website called Atlas Shrugs, which The New York Times says \"attacks Islam with a rhetoric venomous enough that PayPal at one point branded it a hate site.\""},{"comment_id":"923311821095206","commenter_b":"Mexicans never botherd me. Keep'em! Deport Trump!!-","commenter_a":"Not a good idea!!! Go Trump","post_message":"Excellent idea! Share if you support this.  Image by Occupy Democrats, LIKE our page for more!"}]
