[{"comment_id":"1105360966151580","commenter_b":"this is some amazballs shit man!!!","commenter_a":"Heh. I know the guy getting his arm controlled. Had some classes with him in high school. Punniest guy I've ever met.","post_message":"Control someone else's arm with your brain, with relatively little equipment."},{"comment_id":"1096918067034607","commenter_b":"It's up to a woman if she wants to wear both rings or just 1 of the rings. She is married now so she has the choice","commenter_a":"I thought it was the plain gold wedding band that was important, not the engagement ring. That's why it's called an engagement ring. You don't have to wear it once you're married.","post_message":"Amal Clooney wants a smaller engagement ring"},{"comment_id":"612030692317870","commenter_b":"HAHA Austria also has an entire budget that is smaller than America's military budget is alone. I'll keep my 19% tax rate thank you. You all had your damn kids, pay for their college yourself. I'm not paying it just so they can go out and buy a new BMW when they graduate.","commenter_a":"Those poor bastards...they will be stuck in an Obama like environment.","post_message":"Austria's election gives hope that the far-right wave sweeping the West can be stopped."},{"comment_id":"10155148589429614","commenter_b":"Yes send them to jail!","commenter_a":"@username if I was that teacher I would have been calling the cops EVERY DAY about the abuse of that baby!! ESPECIALLY after he asked her to call the social worker!! That poor little boy knew there were people out there that could help him, and then realized how bad he was being failed by everyone","post_message":"In testimony during the preliminary hearing, teacher Jennifer Garcia said in the months before Gabriel Fernandez's death, she repeatedly reported to county child service workers new signs of abuse that prosecutors say came at the hands of his mother and her boyfriend.   In one instance, Gabriel came to school with swollen eyes and a pockmarked face, she said. At first, he said he had fallen, but he then told her,  mom shot me in the face with a BB gun, she testified.  On two occasions, she testified, a fearful Gabriel asked,  you call that lady?, referring to the county social worker. But as months passed, and the boy remained with his mother, Garcia said she began to lose confidence in child protective services."},{"comment_id":"10153122540893984","commenter_b":"This lady need to go and get a life !!!","commenter_a":"She hit the old nail right on the head! Hopefully, this congress will \"grow a pair\" and knock him right off his \"High Horse\"!","post_message":"This lady's fightin' words will get your blood flowing on a Monday.  Do you support this kind of boldness on Fox News?"},{"comment_id":"10155963781495354","commenter_b":"Kick that racist bitch out.","commenter_a":"Socialist pig","post_message":"Stephanie Rawlings-Blake insisted that, in the last few weeks, she has “seen a lot of progress”--and by that, she meant tax dollars going to “recreation centers” and spending on schools."},{"comment_id":"465186890273018","commenter_b":"This....this is brilliant lol","commenter_a":"No this nation was bast of God an build around it get it right dumbass","post_message":"The Anti-Media radio show is live at NOW! Listen from your computer or phone here: www.UCY.tv/TAMR  Call in and join the conversation: 1-718-717-8296  via Murica Today"}]
