[{"comment_id":"817910918313603","commenter_b":"there in panic mode now. they will say any thing in hoping it will stick. Trump 2016!","commenter_a":"We been speaking out against racist police since 1776.......","post_message":"\"For the past 7 years the folks have been witness to ... intense verbal attacks on police officers, labeling them racists ... a culture that now demands political correctness, even if it goes against sincerely held religious beliefs.\"  In his \"Talking Points\" tonight, Bill O'Reilly explained why he believes Donald J. Trump is appealing to voters. Do you agree? bit.ly/1TuevKb"},{"comment_id":"10154416632443701","commenter_b":"He already said he's voting for her lol","commenter_a":"Ugh!! Until I hear it from his mouth I don't believe it. Why should we believe ANYTHING a biased news station and a corrupt politicians say? In fact, if you read the article, it specifically says Bernie has not announced he endorsed her. Coming together in issues is NOT the same. Mis-leading headline, once again!! Sanders has not yet said he will endorse Clinton but told reporters on Saturday that the two campaigns were coming together and to stay tuned.","post_message":"Former Democratic rival Bernie Sanders will join Hillary Clinton at a New Hampshire event on Tuesday where he plans to endorse her."},{"comment_id":"1239208946099133","commenter_b":"Both moms need to get sterilized","commenter_a":"First it said she wasn't charged then it said she was charged with manslaughter and she has been released on 15,000 dollar bond. They should take all her children away from her. These children are her responsibility not the 8 yr old boy. If she would rather be in a bar then put her behind them for the rest of her life.","post_message":"A boy is being charged with beating a 1-year-old girl to death while they were left home alone as their mothers went to a nightclub, police said"},{"comment_id":"779978185438256","commenter_b":"And she is responsible for 100s of men being killed.","commenter_a":"In the Commander In Chief Debate tonight, wondered if anyone noticed that Hillary was wearing an earpiece. See picture here at @webpagelink Only thing that makes sense was that she was being fed the answers. That's why she sounded so scripted and robotic. Donald Trump was Presidential tonight. Hillary's \"in you face\" lies to the Veteran who asked the question about National Security cannot inspire confidence in the American public. How can anyone still support her? Trump is the only choice! America First is the plan!","post_message":"THANK YOU to our fantastic veterans. The reviews and polls from almost everyone of my Commander-in-Chief presentation were great! In addition, THANK YOU for hosting us this evening, Intrepid Sea, Air & Space Museum! -DJT"},{"comment_id":"1052361568153705","commenter_b":"A lot of people who follow this page will probably chuckle at this... But those are actually two very evil women you see picture there.","commenter_a":"#Hillary2016","post_message":"Hillary and Cecile Richards sat down with Refinery29 and talked about everything from “mansplaining” to the future of abortion rights."},{"comment_id":"10153966040516680","commenter_b":"Really Denny? Look back at this entire election process; every single act of violence was committed by the left, either A Bernie or a Hillary protester. EVERY single one of them.","commenter_a":"Tim like all rightwingers always blame someone else; it's SOP. This and other acts of violence is just a taste of what will happen if Trump is elected. Those prone to such acts will take it as de facto permission for violent acts against blacks, Latinos, Muslims, immigrants and of course their most hated enemy, liberals.","post_message":"“This act is a direct assault on people’s right to freely worship,” local authorities say."},{"comment_id":"1300696676663751","commenter_b":"Fuck yo bitch ass fuck you too pussy","commenter_a":"Fuck Donald Trump orange ass","post_message":"Clearly wasn't feeling the jersey!  #WSHH #WakaFlocka"}]
