[{"comment_id":"472703329582291","commenter_b":"How does Trump make Mexico pay for the wall, When America has no authority over Mexico ?","commenter_a":"We need the good people of Florida to Vote Trump!","post_message":"FLORIDA: Early voting is now open! Do not miss this opportunity to #MakeAmericaGreatAgain #Trump2016 Ivanka Trump  Find Florida early polling locations: @webpagelink"},{"comment_id":"10157824241580354","commenter_b":"Convert them or kill them.","commenter_a":"People who want to believe in Muslim as a religion should first understand how it was started and read a book called THE STORY OF MOHAMMED BY Harry Richardson .This book is where Islam started and who started it . It's a paper back book takes about 3 hours read it it tells you how thus Prophet Muhammad where it came from and how it all started. It tells you how this guy was nothing more than an outright murder a thief and kill everybody who didn't agree with him now people show up and tell you that Islam is a peaceful religion that guy would be nuts to believe that this book was done a great research and there's nothing peaceful about this guy named Mohammed take it upon yourself to read","post_message":"“We must not be afraid to approach and contend with the complexity of Islamic law and history, the good, the bad, the ugly and the viciously anti-democratic.”"},{"comment_id":"10153583881674087","commenter_b":"What Hillary Clinton is going to do about the unpaid maternity leave that women have to take there is no coverage for that in the United States","commenter_a":"Nancy was backing trump","post_message":"Hillary Clinton will leave the campaign trail on Friday to attend the funeral of Nancy Reagan and pay her respects to her fellow former First Lady who passed away this week at the age of 94."},{"comment_id":"10153366619543635","commenter_b":"Nope. I thought you knew better than that.","commenter_a":"Quran (3:56) - \"As to those who reject faith, I will punish them with terrible agony in this world and in the Hereafter, nor will they have anyone to help.\"","post_message":"Hillary Clinton: 'Muslims Have Nothing to Do With Terrorism'"},{"comment_id":"1792270164372790","commenter_b":"She's an old nasty hag!","commenter_a":"Not worth it!","post_message":"SAY WHAT?"},{"comment_id":"444744122316849","commenter_b":"YES IMPEACH Obama and his Administration","commenter_a":"The state of affairs in America is so sad. All about obama.","post_message":"Did President Obama do this on purpose or could it have been by accident?"},{"comment_id":"10154086020097024","commenter_b":"Build that wall","commenter_a":"Prosecute every elected official in every sanctuary city as being complicit in evey crime committed by illegal aliens.","post_message":"Happening Now: Judge Jeanine Pirro delivers remarks at #CPAC2017."}]
