[{"comment_id":"1569451360020943","commenter_b":"It's called treason, hang her.","commenter_a":"ABSOLUTELY NOT!!!!! We need to MOVE ON!!!!!!! Stop beating this DEAD horse and help the people, NOT YOURSELF INTERESTS!!!!!","post_message":"“I talk about the emails all the time and what can you say, does it get anymore corrupt or crooked than that?”  Donald J. Trump argued that Hillary Clinton is being protected from prosecution relating to her private email server. Do you agree with him?"},{"comment_id":"10152688677486491","commenter_b":"@username Was 9/11 an act of American terrorism? WTC and Pentagon are both on US soil, right?","commenter_a":"Not Polish camp but German!!","post_message":"Hundreds of survivors returned to the Holocaust’s most infamous concentration camp today."},{"comment_id":"10153867019782061","commenter_b":"That was good","commenter_a":"What an idiot.Typical liberal though.","post_message":"WATCH: Penny-wise or penny-foolish? Man decides to pay a fine with 22,000 pennies, but over-paid doing so."},{"comment_id":"10154803405263128","commenter_b":"@username - worked at Her campaign she is the most corrupt person with Her $150 million from countries w Sharia Law - Killary wants globalization. Google Bilderberg Group","commenter_a":"I've lived in Utah for almost 3 decades. The state's Mormon mouthpiece, The Deseret News, has already denounced Cinnamon Hitler as \"evil\" and a wannabe dictator. That should be a warning to all you Republican conservatives out there of the quality of your candidate.","post_message":"While most political prognosticators are closely tracking a familiar group of about 10 presidential battleground states, Utah is emerging as one of the most surprising wild cards in the 2016 race."},{"comment_id":"10154249832173128","commenter_b":"U.S. has a mind-boggling number of minimal wage jobs that do not involve any tipping at all. When was the last time you tipped a cashier at Walmart? Why waiters or taxi drivers are any different? Sure, if they can't cover their basic costs, just raise the rates.","commenter_a":"Oh, wow! This is new. When Uber came out, there was an automatic tip in your setting that you could set for yourself.","post_message":"\"I’m working at rock bottom now, and not having tips is part of the problem.\""},{"comment_id":"1110306035681925","commenter_b":"She's a evil hypocrite","commenter_a":"Good point!","post_message":"'Hillary Clinton doesn’t miss an opportunity to ridicule Donald Trump’s illegal immigration solution of a wall on the southern border — but that’s exactly what she’s deployed to keep undesirables away from her.'"},{"comment_id":"10153477114308984","commenter_b":"She's obviously trashy","commenter_a":"Am I the only one that saw that woman get out of that scooter, clearly nothing wrong with her","post_message":"This woman's young son got involved in her brawl with another Walmart shopper, and the video took the internet by storm. Now she's speaking out to defend their actions...  Do you think her son's behavior was unacceptable?"}]
