[{"comment_id":"10153945679949087","commenter_b":"Don't care for Michael Moore but im with him on this, gooo Trump!! Beat that lyin corrupt Hillary.","commenter_a":"Alyssa Hohorst","post_message":"Liberal filmmaker Michael Moore is doubling down on his prediction that Donald J. Trump will win the White House with a list of 5 reasons why."},{"comment_id":"10155444032526509","commenter_b":"@username Hillary is a good start then! She devil in the flesh you're so smart","commenter_a":"How quickly we forget! If you over 35, take a walk with me down memory laneyou won believe what you have forgotten. If you under 35, read onI promise you that you will be amazed at what you missed! (By the way, sadly, this isn a joke. I wish it was.) REMEMBER WHEN BILL CLINTON WAS PRESIDENT? (January 20, 1993 to January 20, 2001two terms) When Bill Clinton was president, he allowed Hillary to assume authority over an attempt to reform health care. Her proposed plan was so bad that many Democrats came up with competing plans of their own in protest, and in spite of threats and intimidation, on September 26, 1994, the bill was declared dead. This fiasco cost the American taxpayers about $13 million for studies, promotion, and other efforts. Then, President Clinton gave Hillary authority over selecting a female attorney general. Her first two selections were ...","post_message":"The Donald J. Trump campaign issued a statement denying all the allegations, saying the reports were politically motivated."},{"comment_id":"10155169857528690","commenter_b":"Que triste, que bom que salvaram!! Quero adotar!!!","commenter_a":"Daniela","post_message":"91 dogs and 10 cats were rescued from a suspected puppy mill in Australia."},{"comment_id":"1130148643687222","commenter_b":"Never. Who would be stupid enough to want murderer Hillary to be over our beautiful nation and wonderful people.","commenter_a":"Utah vote TRUMP!","post_message":"**BREAKING**"},{"comment_id":"1632662777034101","commenter_b":"Hope she cheats on you!","commenter_a":"I did the same thing to my fiancee. I told her if didn't register to vote, I'd be mad. She did register. When it came the time to vote early, she feet - dragged. And I told her if you didn't vote for Hillary Clinton, our relationship would be over. She voted. Emails or no emails, Hillary all the way!","post_message":"\"If you didn't vote for Hillary Clinton ... I'll seize your phone, I'll seize the car.\"  Watch this mom's impassioned plea for her son to vote for Hillary Clinton."},{"comment_id":"10154655790571101","commenter_b":"We will see the illegals go!","commenter_a":"But he promised the morons a yuge wall and told them the Mexicans would pay for it.","post_message":"\"These are dreamers who are seeking the American Dream, and we should embrace them rather than do a bait-and-switch.\""},{"comment_id":"10153167916826336","commenter_b":"I don't understand it either.","commenter_a":"They should have just as much of a right to stop and salute the flag as anyone else. Baseball is America's pastime and they deserve the right to respect the country.","post_message":"Workers say ordering them to work through the singing of the national anthem is disrespectful."}]
