[{"comment_id":"10153846948701162","commenter_b":"The wording is hilarious though. \"Twerking on a stranger\"....lol!","commenter_a":"@username how ridiculous are these two idiots!","post_message":"CRIME OF TWERKING: Two women are being sought for sexual assault after twerking on an innocent man.  FULL VIDEO: @webpagelink"},{"comment_id":"908022272624161","commenter_b":"How dare they,women please make your votes count!","commenter_a":"I don't understand how any woman can be a republican!","post_message":"Another day, another Republican attack on women. Shame on them.  Read more here: @webpagelink  Image by Occupy Democrats, LIKE out page for more!"},{"comment_id":"1785556881731423","commenter_b":"The white house will probably be full of naked stripper","commenter_a":"Trump will bring that back","post_message":"Yes!"},{"comment_id":"10155048083994182","commenter_b":"she's a jerk","commenter_a":"The only person it would be a stock to is the teachers union . Because they do not really care about the children it's all about them.","post_message":"Elizabeth Warren has been outspoken against Betsy DeVos. But there was once a time she was in favor of school choice....  What changed?"},{"comment_id":"835512459884693","commenter_b":"Crazy woman","commenter_a":"The truth is not in her.","post_message":"Pelosi glosses over spiking costs under the ACA for millions of Americans."},{"comment_id":"10153361671334032","commenter_b":"There's a huge difference between hearing loss and deafness. Its nothing at all like your eyes that are fixed with glasses. Patti. There are resources. Tomorrow if I can remember and find this again I'll list them or PM you. I don't know what the current name for the former Self Help for the Hard of Hearing. I'm not sure if you still have hearing aids. If you do find a good audiologist ASAP and don't stop until you find someone who treats you like you are their only client and their business dependent on your satisfaction. Anything less you shouldn't accept. If you can ever afford new hearing aids you MUST get digital. They don't know how long the current ones last. They haven't been out long enough to start failing. 10+ years for the current Gen. The biggest and very common thing people with hearing loss do is ...","commenter_a":"I just want to interject that driving while hearing impaired is not any more dangerous than while hearing. Your freaking out while driving is only in your head.","post_message":"What could just one day with a slight hearing loss teach a woman about what it's like to live every day without one of her five senses?"},{"comment_id":"10154172313547690","commenter_b":"Like the boy didn't have enough problems then get a nasty nanny!","commenter_a":"Put me in the room with there for about 30 minutes let me drive her around and a little more","post_message":"This nanny is facing charges after allegedly abusing a 4-year-old-boy with special needs.  Luke has Down syndrome, heart defects and epilepsy. Once his mother noticed a change in Luke behavior, she decided to get a nanny cam. This is what she discovered. #NBC5Now More: @webpagelink"}]
