[{"comment_id":"10154729609496729","commenter_b":"Unfit evil lying grandma killery","commenter_a":"She only said it because she wanted to diffuse Trumps statement. Too late to get on that band wagon. Meanwhile American lives are lost due to stupidity.","post_message":"Whoa. About damn time."},{"comment_id":"10154620452720575","commenter_b":"She should have had a gun!!!!!","commenter_a":"Was it a Muslim?","post_message":"WIFE OF MISSOURI GOVERNOR-ELECT IS ROBBED AT GUNPOINT IN ST. LOUIS!"},{"comment_id":"10154406866831037","commenter_b":"give me back the days of stong America when it was \"sticks and stones that brake your bones and (words) can never hurt me\" !!","commenter_a":"Weren't people just mad because people get \"artistically enhanced\" to be skinnier than normal? Perhaps they should pick a side an stick to it.","post_message":"Disney's new movie has already sent the internet into a rage."},{"comment_id":"10153880992094714","commenter_b":"Illuminati right?","commenter_a":"I really can't stand Obama right now nor his latest decisions. He's honestly pissing me tf off no lie Like the earlier comment said, you have plenty room at the white house to throw a traditional Thanksgiving dinner all for them... We'll see how fast you call that a good idea...I'll wait","post_message":"\"[A] woman from Florida told me her family's history dates back to the Mayflower - and she said that welcoming others is part of 'what it means to be an American.'\""},{"comment_id":"1091917874180626","commenter_b":"MAKE AMERICA GR8 AGAIN 2016! # AMERICA FIRST # BUILD THE WALL!","commenter_a":"Let's see a lot more arrests...these are terrorists!!","post_message":"Democrats' voter outreach to gang members is apparently working..."},{"comment_id":"10155008881554411","commenter_b":"Zeyad Hopkins : @webpagelink","commenter_a":"She didn't spark anger, in fact Saudis didn't care. But @username has a case against Saudi and the USA, and yes I don't like Saudi but let's not start spreading bullshit and hate","post_message":"Just days after Merkel said burka should be banned in her own country."},{"comment_id":"987021391354390","commenter_b":"@username: Once again, you can argue all you want day in, day out. And guess what will happen? The ongoing trend. It get's worse and worse year after year. The debt keeps climbing, yet some have their blind folders on like they can't see this way of thinking, and the economy is constantly nose diving, we are constantly going further and further in debt. Another fact, we in the South are tired of pressing 1 to listen to English while we live in America. If Hillary had it her way before she goes to jail, the mid-west and North would be in the same situation after she let them flood in and gives them drivers license, you too would be having to Dial 1, every single time you want to hear English. Think it wouldn't bother you? Think again, you'll question whether you are really living in America. After-all these ...","commenter_a":"Raise Minimum Wages - Put Small Businesses Out of Business, Take Jobs from Americans. Allow immigrants to flood the country, give them drivers licenses, and take jobs from Americans. Oppose the pipeline, Take Americans jobs. Do away with energy companies, Take Americans jobs. \"Hello, I'm @username, the hypocrite, I promise Americans jobs!\"","post_message":"Time to invest in a clean energy future—not build a pipeline to carry our continent's dirtiest fuel across the US. I oppose Keystone XL. -H"}]
