[{"comment_id":"10153047880386130","commenter_b":"Oh Florence, you dirty gal!","commenter_a":"Failed attempt at humor...","post_message":"You’ve seen the headlines.   Now it’s time to finally hear from the Brady at the center of the controversy…"},{"comment_id":"10153484724071509","commenter_b":"Jason, go tell it to your momma, she's use to your hot air, and I don't have time for idiots. Go get your daily fertilizer. Move along!","commenter_a":"They will get unsupervised probation. Maybe six months tops in lock up. \"Privileged monsters\" just itching to kill!","post_message":"Five teens have been charged with planning a classmate's murder. Their plot was discovered when another student talked to school administrators, police say. @webpagelink"},{"comment_id":"1160164500670245","commenter_b":"@username did you forget to take your happy pills? LOL","commenter_a":"I am so over this. We need to worry about the homeless and disabled right in front of us, not hunting regulations in another country over one dead lion. Take the money you spent getting to this guys house and buying paint and feed someone today.","post_message":"Raw meat, animal crackers and spray paint were used to vandalize the Florida vacation home of lion-hunting dentist Walter Palmer."},{"comment_id":"10152601048042061","commenter_b":"till she open`s her stupid mouth.......again !!!!","commenter_a":"I love this photo. Most models would be posing and trying to be the focal point. I just adore the fact that stunningly gorgeous Giselle has her hat pulled down and is pointing at Tom, and not stealing a bit of his thunder. What a great couple they make!","post_message":"Coming in at number 3 in the  News midday buzz  see how Gisele Bundchen and Tom Brady and their kids celebrated the Patriots AFC Championship win: @webpagelink"},{"comment_id":"10153835379166336","commenter_b":"Cause white people suck","commenter_a":"That door was racist against white people! Ban all cruise ships and doors.","post_message":"A jury has awarded a man $21.5 million in damages after he was hit by a sliding door on a cruise ship.   MORE: @webpagelink"},{"comment_id":"1003834523018162","commenter_b":"Fuck her she hates white's. She only hires blacks.","commenter_a":"she had made millions off the white people and i do mean millions.let her take some money and give it to street people or vets which i doubt she will she would only let them starve!!!!opra disappoints me as i thought she wouild be the last person to say something like that!!!!!!","post_message":"Oprah Claims White People Are The Cause Of Racism In America.  What a hypocrite, she is the racist.  Do you think Oprah is bigot?"},{"comment_id":"638889179634994","commenter_b":"Fat hoes crack me up","commenter_a":"Yep. Fat people shouldn't fly","post_message":"This airline is not going to allow people who weigh too much to fly on their plane.  They have absolutely no right to subject us to this.  Do you think this is out of line?"}]
