[{"comment_id":"10154128479435673","commenter_b":"She needs to go. and you can go to....","commenter_a":"Too little too late Jack","post_message":"The decision not to seek prosecution of Hillary Clinton is plain wrong. I have joined several of my colleagues to do something about it."},{"comment_id":"10157276340925354","commenter_b":"Round up every muslim ship them home unless they are legal immigrants that speak english and have a job and no ties to isis otherwise build a wall shoot everyone of them that comes into the u s","commenter_a":"Vote Billary or Bernie for more lies, deceit, corruption,treason, gun control, Homophobia under Islam and 4 more years of obama. Almost forgot no more Country Girls having fun in the water. Cowboys, Liquor Stores, Smoking Marijuana are next. NOTE: Comments protected under the 1st Amendment.","post_message":"VIDEO:"},{"comment_id":"1063632813696466","commenter_b":"Lol its the food colouring haha I wana try one of those, they're in Japan aren't they? X","commenter_a":"@username fancy a green poo? x","post_message":"This is gross Burger King"},{"comment_id":"10153974974065329","commenter_b":"Bye bitch","commenter_a":"My belief she is every bit as responsible of what that animal inflicted on the child. As a mother, you are to protect your child by any means necessary. Battered or not she bought that animal in her baby's life and chose him over her child. Save your hate post siding for the battered women of the world the only person I care about that needed defending is the child.","post_message":"Tondalo Hall will not be released early from her 30-year sentence in Mary Fallin's Oklahoma for failing to protect her children from her abusive partner. The man who actually harmed her child got just two years. (via BuzzFeed News)"},{"comment_id":"1053645448090460","commenter_b":"Jihad Malik ..get off this post ..your mama was stupid for making you","commenter_a":"Why don't you post a story of the anti Semites throwing people off of buildings in the countries surrounding Israel....they are the people you should be fearing and writing about ...The JP has joined the Shrillary camp","post_message":"Schmitz has called the accusations defamatory, but reports of anti-Semitic tendencies at the top of the Trump team reinforce the narrative."},{"comment_id":"10152947957269342","commenter_b":"Kill her","commenter_a":"Deviks advocate. There are guidelines for murder. She didn't intend for the baby to die and took it to the hospital So the only real charge would be manslaughter, or murder 2/3 if the baby took unassisted breath which at that gestation isn't likely","post_message":"JUST IN -- Prosecutors say the woman accused of luring an expectant mother to a basement and cutting the baby from her belly will NOT be charged with murder.  FULL STORY ---> @webpagelink"},{"comment_id":"1043277849065296","commenter_b":"Stupid cow! Needs to get over herself","commenter_a":"What a cow!!!","post_message":"'His career won't suffer, but I've been told I'm ruined'"}]
