[{"comment_id":"10153955830944087","commenter_b":"Never trust a woman in a white pants suit.","commenter_a":"No bitch, that's not how this works!","post_message":"#BREAKING: Hillary Clinton accepted the Democratic Party’s nomination for president Thursday, making history as the first woman to lead a major political party."},{"comment_id":"10153165565220399","commenter_b":"The Democratic President Lyndon B Johnson, the father of the \"Great Society\" that was the rebuilding of the Urban Center for the Black communities to populate and be the new beginning for the poor blacks.. How did that workout... Detroit was setup as the model city.. As was Baltimore and Chicago... In reality, all the democrats did was move the blacks from the southern plantations to the Urban Plantations and laugh as they did it!! Here is the quote from LBJ as he did this: \"These Negroes, they're getting pretty uppity these days and that's a problem for us since they've got something now they never had before, the political pull to back up their uppityness. Now we've got to do something about this, we've got to give them a little something, just enough to quiet them down, not enough to make a difference... I'll have them niggers voting Democratic ...","commenter_a":"Blame it on anyone else but your OWN failed policies, GOP.","post_message":"The conservative blame game is in full effect."},{"comment_id":"1213125935366328","commenter_b":"This old hoe has lost her mind.!!","commenter_a":"You can be the first one to be unprotected! Have your security do without their weapons to protect you & Bill!","post_message":"Hillary Clinton, front-runner for the Democratic Party presidential race, heartily endorsed the idea of high taxes for gun sales, along with high fees for gun dealers."},{"comment_id":"10153162579468908","commenter_b":"Unfortunately A LOT of people fall into this category. Sex is everywhere and to too many it is everything.","commenter_a":"When sex rules your life you have zero power and nothing to contribute to society. No better than an addict. No power No control over your own life. Puppet. Set yourself free.","post_message":"Something we should all consider when it comes to porn.."},{"comment_id":"10154323426879778","commenter_b":"Sad!! Rip LP","commenter_a":"Prayers to the family.","post_message":"The 80-year-old may have been found dead, police said Monday."},{"comment_id":"1766432363594674","commenter_b":"hillary a rothchilds criminal, she has already been selected months ago to be president all the sheep fall for it, see how the rothchilds find it easy to fool the easily lead with their controlled media","commenter_a":"Typical politician, first it's \"I didn't lie,\" then when the evidence piles up her statement quickly changes to \"I misspoke.\" Well, when you put it that way, I suppose you get a free pass...","post_message":"\"So I may have short-circuited it and for that, I, you know, will try to clarify because I think, you know, Chris Wallace and I were probably talking past each other because of course, he could only talk to what I had told the FBI and I appreciated that.\" - Hillary Clinton"},{"comment_id":"517056128505278","commenter_b":"@username I'm pretty sure much of what you typed is not true.","commenter_a":"Hillary should be forced to work as the next ambassador to Libya. She can hire the Mexican drug cartels as her security since Obama armed them better than he did our embassy in Benghazi.","post_message":"Eric Trump criticized Hillary Clinton's foreign policy and said it should be a requirement for Americans to watch \"13 Hours: The Secret Soldiers of Benghazi\" before voting for president."}]
