[{"comment_id":"10153401880031336","commenter_b":"Way to show tolerance","commenter_a":"pft just toss it in the garbage with all the other religious hog wash biblical nonsense!","post_message":"Police have recovered a relic believed by some to be the Holy Grail – the cup Christ drank from at the Last Supper."},{"comment_id":"1404359436262533","commenter_b":"Craigslist HIRED HACKS.","commenter_a":"Sorry not happening!","post_message":"WATCH LIVE: Local organizations are protesting at Phoenix City Hall to call upon Mayor Greg Stanton to make Phoenix a sanctuary city, among other actions."},{"comment_id":"1092995934129991","commenter_b":"Who has Hillary been taking campaign money from? Can you even make the connection lol","commenter_a":"I wonder why @username won't report the latest WSJ national poll. @webpagelink #ImWithHer #HillYes","post_message":"Electability has become a cornerstone of Hillary's campaign."},{"comment_id":"1532142173492916","commenter_b":"Oh we will because we need to stay united and fight. I mean go out there and protest, boycott Trump businesses, follow advice of people like Michael Moore, Bernie Sanders, Keith Olberman. I am saving my money and will travel to places where protests will be visible and impactful. Also, we have to find a way to help each other. Si se puede.","commenter_a":"2018 is just around the corner. We will clean house and send republicans packing!","post_message":"Conservatives will do anything to win what they perceive as the \"culture war.\""},{"comment_id":"10154306572928812","commenter_b":"Go Peggy... how could anybody vote for her especially women????!","commenter_a":"Hillary has the most experienceand best judgmentof any candidate running for president. Eight years as a team member under her husband Bill. point here is that Hillary Rodham Clinton has been doing this for a long time: seeing the world through a political lens and revealing an uncommon solidity of judgment and perspective. ... just because she has risen higher than any woman in American politics, but because she is by far the most experienced candidate of any of those running in either party this year. In fact, she is one of the most experienced people to ever run for president.","post_message":"As the remaining candidates turn their attention eastward, the style and locations of events are going to look different than they have in the past."},{"comment_id":"10155026863931509","commenter_b":"she doesnt look that bad for a transgender","commenter_a":"What a beautiful woman our first lady is.","post_message":"First families join hands for a rendition of \"The Battle Hymn of the Republic\" during memorial for slain Dallas officers. @webpagelink"},{"comment_id":"10155249184754218","commenter_b":"How do we know, @username? Watching the hearings and seeing her incapable of answering questions. We know by looking at her past experience and seeing it limited to special interest. She has almost no relevant experience. Cabinet members are to be experts in their field, not solely a wealthy donor to republicans. This is not a try out situation. There is not a revote. Your assessment of Trump's hiring practices ignore what we've seen even during his campaign. He had to find new campaign managers three times.","commenter_a":"Who in his right mind would approve of her, doesn't matter if you come from the left or right, everyone can see she is unfit for the job","post_message":"Senators are expected to vote Tuesday on the nomination of Betsy DeVos for education secretary. She is expected to be confirmed, with Vice President Mike Pence casting a tie-breaking vote. Do you support or oppose her nomination? >> @webpagelink"}]
