[{"comment_id":"10153143538491051","commenter_b":"How? A majority of liberal democrats are old rich white men todd","commenter_a":"Wrong... And you can bet the white scum liberal will go after the American Flag next... Americas biggest threat, the white scum liberal...","post_message":"The Confederate Flag's 54-year run at the South Carolina statehouse is officially over. Do you think that was the right decision?"},{"comment_id":"395052417343306","commenter_b":"We aren't screwed...again, RESEARCH MELLIE! See how much illegal immigrants attribute to the economy, then come back.","commenter_a":"Yay for Texas on this. But too bad Abbott was able to get Obama's immigration reform halted by a federal judge.","post_message":"Did you ever think you'd see this happen? Congrats Texas!!!"},{"comment_id":"970899619630870","commenter_b":"Deport ALL MUSLIMS everywhere!!!!!!!","commenter_a":"FULL CASTRATION!!!!!!!!","post_message":"Top Muslim Imam: \"We shall breed with Europeans to conquer their countries!\" (Video)"},{"comment_id":"10153933617414411","commenter_b":"Go fuck a pig!","commenter_a":"This is what happens when Islam gets a hold of a country. Back to the dark ages we go","post_message":"BREAKING: 8 coalition troops killed across Afghanistan"},{"comment_id":"1112148695548048","commenter_b":"Imagine if Hillary did all the finger wagging that Bernie does in debates?","commenter_a":"Men can get away with anything this election season that women (Hillary) could not. Waving their arms, swearing, making fun of people...anything goes.","post_message":"Social scientists have found the exact same affect by a woman simply doesn’t play the same way."},{"comment_id":"10153602906656509","commenter_b":"You can buy them too.","commenter_a":"I think she means she wants to make a lot of money. Those GEDs aren't cheap.","post_message":"Is America ready for #marijuana moguls? Follow one young couple's journey as they attempt to franchise legal marijuana  @webpagelink #HighProfits"},{"comment_id":"844885798949835","commenter_b":"Hillary was responsible for keeping wages at slave wage, oh and she sits on the Walmart board of directors too, if ya didn't know. Hillary sure likes to pull out the ACE cards for protection, still doesn't exclude that she is a liar, and a criminal of the highest order. As truly Democratic Trump holds the GOP hostage, and Cruz is stupid, full of shit, and a wingnut, and Hillary is a criminal: @webpagelink TRUMP BFF and CRIMINAL? REALLY! Get the word out, SHARE THIS! FEEL THE BERN! DOES USA WANT A KNOWN CRIMINAL IN THE MOST POWERFUL SEAT IN THE NATION/WORLD?","commenter_a":"Good for them Walmart can afford it, don't forget Walmart is the reason most of the factories closed b/c they brought cheap shite from China and the working man bought a TV or whatever from China that was cheaper so factories couldn't compete which is what Walmart wanted. I never have and never will shop there.","post_message":"Walmart faces another lawsuit loss..."}]
