[{"comment_id":"10152998065516037","commenter_b":"Of course men are trying to tell a woman what to do with our bodies. Go shove it!!!","commenter_a":"The silent holocaust, women and men who are irresponsible killing a life because of inconveinence. They will pay for it if not in this life the next one.","post_message":"A new report out today from the Guttmacher Institute shows that 57% of women now live in a state considered to be hostile or extremely hostile to #abortion rights."},{"comment_id":"451531238383723","commenter_b":"she also thinks we can't deport 20 million illegal parasites. boy is she in for a big surprise. a needy, insecure, unaccomplished , doormat to a serial women abuser.","commenter_a":"Have fun I will not hand mine over","post_message":"Hillary Clinton is Coming for your Guns!"},{"comment_id":"10153032045224411","commenter_b":"Don't waste your time here Ana! The reason why some of these people have tunnel vision is because their heads are deeeep up the RACIST European and American governments ASSHOLES they can't turn their heads to see what is really happening on side...","commenter_a":"Sadly people are not intelligent enough to draw a line between a religion and extremism. Had these cartoons been about Jesus instead of Mohammed a crazy christian extremist could have done the same thing, but I doubt that would be followed by throwing grenade at a church.","post_message":"'I personally believe that the death penalty should exist in our legal arsenal.'"},{"comment_id":"1044102145610796","commenter_b":"Stay at home moms!","commenter_a":"See Travis Kuras i dont drink that much coffee!!! Lol","post_message":"Who drinks the most coffee?  Image by I Love Coffee via AsapSCIENCE."},{"comment_id":"10154453372292149","commenter_b":"She, Bill are too quiet. Beware: they are coming back.","commenter_a":"Go to Jail........","post_message":""},{"comment_id":"1017389715024162","commenter_b":"@username Muslim terrorist ? Kill them simple.","commenter_a":"When you head to the polls in November, remember, Hillary Clinton tweeted this : \"Let’s be clear: Islam is not our adversary. Muslims are peaceful and tolerant people and have nothing whatsoever to do with terrorism.\" — Hillary Clinton (@HillaryClinton) November 19, 2015..","post_message":"Newt Gingrich said President Barack Obama and Hillary Clinton are \"misleading\" the American people about the #OrlandoShooting by refusing to say \"radical Islamic terrorism.\" @webpagelink"},{"comment_id":"10153206668181162","commenter_b":"I'm understand u Julie I feel the same sometimes I hate my own race the Humans!! I gonna try to adopt him.","commenter_a":"Are you kidding me??? I. HATE.HUMANS!!! Find the SOB who did this and shoot them! Disgusting! People make me sick. Praying for this poor dog <3","post_message":"\"SWEET SURVIVOR\": After being was shot twice, this dog will still survive. Police found her tied to railroad tracks and rushed her to the vet.   Once she is healthy, she will be up for adoption @webpagelink  Officers have named the dog R&R. (Photo via Twitter @TampaPD)"}]
