[{"comment_id":"10152716358611680","commenter_b":"Red herring fallacy and straw man fallacy.","commenter_a":"This is sexist and Politico and the lib media are trying to hide this story. Nice try. @webpagelink","post_message":"Kelley Paul says \"to have that label put on him, that really upset me.\" @webpagelink"},{"comment_id":"1200289290023832","commenter_b":"It just needs to be remembered do this with no violence unless it is used on them and if the illegal aliens respond with violence deal with them direct and swiftly. No questions just stomp them and dump them back across the border.","commenter_a":"She just deserve a raspberry. It is the to be said to her. Our immigration system needs work but she is really talking about letting illegal aliens in. The term illegal means we have acknowledged that they have committed a non-legal act, thus becoming a criminal. That means do not pass Go do not collect 200 dollars. They are already being coddled at our expense. If, they are caught they should be taken direct to be fingerprinted and photographed, then directly to a border. If, they are identified as having done it before. We should setup a location far away to ship them to. This non-American needs to mind her own business, instead of trying to shovel her troubles on to us.","post_message":"Oh really?"},{"comment_id":"10154219562119197","commenter_b":"Germaine Riley Another imbecile spewing really nice politically correct names, hey you .... smarten up !","commenter_a":"So very sad ! Obama should be impeached because he is not keeping us safe !","post_message":"We are continuing to follow updates on the deadly mass shooting at an Orlando nightclub. Here's Kevin P. Hogan WFSB with an update on what we know now."},{"comment_id":"1335636243169794","commenter_b":"Im tired of this bitch","commenter_a":"Yaneka Davis @username @username 😂😂😂😂😂","post_message":"She's calling out Kylie Jenner!  #WSHH #CatchMeOutside #KylieJenner"},{"comment_id":"10154415987472908","commenter_b":"DUMP TRUMP!","commenter_a":"Quite right. Remember Lincoln : \"A house divided agaisnt itself cannot stand\". Tell that to Trump who is SUPPOSED to be a Republican but he's a disgrace to their histoy.","post_message":"I do not want to see the frustration and the despair that so many people feel being picked apart by people like Donald Trump, preyed upon, in order to divide us again. A few months ago we were supposed to hate the Mexicans who according to Trump were all racists and criminals. And now we're supposed to hate the Muslims. That's not what this country is supposed to be about. We are strongest when we stand together."},{"comment_id":"1960555887503751","commenter_b":"TRUMP! Go, go go ... Defeat that evil woman and make America great AGAIN!","commenter_a":"Killary is a beast and needs to be in prison........TRUMP is the only candidate that deserves to be president","post_message":"I will defeat Hillary Clinton - and MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10156951027285725","commenter_b":"Redicous...sounds French.","commenter_a":"THIS IS REDICOUS","post_message":"Hold on to your $20s, they'll soon be a piece of history. @webpagelink"}]
