[{"comment_id":"1110789318977717","commenter_b":"Why didn't this administration just tell the truth in the first place. If the President or Hillary would from the beginning, just tell the People the truth, that they screwed up. Most Americans will probably forgive, (But not forget) But Now we have to spend time and millions of dollars to do an investigation Same goes for President Clinton, just admit you got a blow job in the oval office and the American people would of probably forgave you. Nixon same thing, why can't they just do the right thing and tell the truth from the beginning. Friggin Politicians, I'm so sick of being lied to.","commenter_a":"I used to have hope that you were going to get the job done, @username but after all this time, I have lost faith in you and your committee. I think you are now part of the cover-up and just playing along to make it look like something is being done.","post_message":"It is deplorable that it took over a year for these records to be produced to our committee, and that our Democrat colleagues never lifted a finger to help us get them. Shame on them and everyone else who has demanded this committee to give up before gathering all of the facts. This investigation is about a terrorist attack that killed four Americans, and it could have been completed a lot sooner if the administration had not delayed and delayed and delayed at every turn. For example, the #Benghazi committee still does not have records we requested over a year ago, and we are still waiting for some witnesses to be made available for interviews. As soon as possible, we will release our report and interview transcripts so everyone can see the evidence for themselves, and I’m confident the value and fairness of our investigation will then be abundantly clear to everyone."},{"comment_id":"1100928479922812","commenter_b":"Do you even beleive in smart women?","commenter_a":"Maybe compared to all the stupid people who support them they seem smart. The one eyed man is king in the land of the blind !","post_message":"I am not one of these people that thinks Hillary Clinton is The Smartest Woman in the World.  I don't think Elizabeth Warren's The Smartest Woman in the World.  What happens here is that whatever liberal female rises to prominence, it's just standard operating procedure that the media and everybody's gonna refer to them as The Smartest Woman in the World."},{"comment_id":"1835391226744152","commenter_b":"Def not girl lol. I liked her back in the day but when she got that diva attitude and had the nerve to kill some of my brain cells with Glitter, I was done lol.","commenter_a":"Whether it was her fault or not, I'm glad she fell on her face. Maybe it will bring her diva attitude down a couple notches because she is annoying.","post_message":"WATCH: Mariah Carey's New Year's Eve mishap; what really happened during performance? abcn.ws/2hHJaGj"},{"comment_id":"10154326005239657","commenter_b":"Just heard this morning, accordeing to an article in the NYT, that Hillary's unprotected server had an email disclosing the locaation of Ambassader Stevens on 9/11/2012. It was also disclosed that our allies knew her email was not secure, so we can only speculate our enemies knew as well. If all of this is true, this woman should be shuned by the American people.","commenter_a":"Lollllllll. True","post_message":"A look back at the week's most memorable, powerful, and funny political cartoons.  #5 might be one of the best we've seen all year!"},{"comment_id":"1548781162079004","commenter_b":"Found the stupid feminist.","commenter_a":"if U want to End ALL Abortions, eliminate the NEED for abortions!! STOP RAPE First!!!","post_message":"Flip the Script is back!  We asked pro-lifers why they think abortion is murder  and then they sorta threatened to kill us."},{"comment_id":"472460989569345","commenter_b":"Your vagina has muscles specifically designed for pushing things out. Kegel exercises will strengthen and tone them. Plus, I'm pretty sure that little knob looking thing on the bottom of the cup is for grabbing.","commenter_a":"I'm just not comfortable sticking something up there that I don't have a mechanism to pull it out with","post_message":"While used mostly in developing countries due to lack of access to regular products, these cups could be far superior than those regular products."},{"comment_id":"10154767533793258","commenter_b":"Definitely a paid for astroturfer, Delphi technique plant. Real people are not this stupid.","commenter_a":"No one cares about her emails","post_message":"Security briefings for Hillary Clinton should be suspended until investigation is over, says Paul Ryan."}]
