[{"comment_id":"10152784038336491","commenter_b":"Preaching to the choir, sister! One of many reasons I'm now divorced.","commenter_a":"Now if only science could find a man worth having......","post_message":"Science shows that there are quite a few health benefits of getting intimate."},{"comment_id":"1167985886552093","commenter_b":"Who cares she's a phony crook sanders all day","commenter_a":"I am voting for HRC!","post_message":""},{"comment_id":"931354546899967","commenter_b":"beggars can't be choosers. Get off food stamps and work harder if you want all hala food. Ungratefully, entitled beggar","commenter_a":"If you don't like what here already go home. We dont owe you anything.","post_message":"Shameful and UN-AMERICAN!"},{"comment_id":"10153156333212093","commenter_b":"Agree @username, I appreciate your candor.","commenter_a":"I would have to say too bad. There are reasons why adoption laws are written the way they are. Just because various individuals attempted to circumvent the prior marriage laws to gain legal status instead of going about the legal routes and legal boundaries others have until the recent decision on same sex unions, is not a good enough reason to change the laws surrounding adoption and the laws against adoptive parents becoming involved with adopted children. Do they think they are the only \"couple\" who have this issue. There are countless stories of parents who adopted a child, got divorced, and one of the \"parents\" wanting to change the legal definition of the legal parent-child relationship. How about you made your bed when you tried to circumvent the laws to get around state and federal laws regarding things like insurance eligibility, income tax deductions, ect., just because there are ...","post_message":"Roland and Nino want to get married now that same-sex marriage has been legalized. The only catch is that they are already legally father and adopted son... @webpagelink"},{"comment_id":"433011990220428","commenter_b":"good hope the NIGGER DIES","commenter_a":"I likt being mean but he hevhe i loveĉit","post_message":"Will he be able to finish his second term?"},{"comment_id":"965413580245506","commenter_b":"Keep trying @username. Killery the lying hag will fall short.","commenter_a":"PT Barnum is running for president!!","post_message":"Donald J. Trump tried to remember #DDay with a photo that wasn't from D-Day."},{"comment_id":"959701630828566","commenter_b":"Joel Mata 😂","commenter_a":"Jasmine Lopez","post_message":"Smh! #WSHH"}]
