[{"comment_id":"832521843510736","commenter_b":"All of them boobs!","commenter_a":"\"Mess NBC\" IS A JOKE! Less than 150,000 viewers. Now, compare this with FOX - with 2.7 Million each each NIGHT!","post_message":"Bouncing back?"},{"comment_id":"10153427375089726","commenter_b":"this brain dead old witch needs to be in a mental ward","commenter_a":"Congress can deny funding and they better. Premiums are going through the roof . Supreme are bunch of liberals out of touch with the average folks.","post_message":"According to Pelosi, Scalia ... joined the majority?  @webpagelink"},{"comment_id":"993982434028144","commenter_b":"That's my girl.","commenter_a":"Aarøn Andersøn","post_message":"\"The Seniors and Veterans Emergency Benefits Act would give about 70 million seniors, veterans, people with disabilities, and others an emergency payment equal to 3.9 percent of the average annual Social Security benefit, about $581 – the same percentage raise as the top CEOs got last year.\"  Read more here: @webpagelink  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153315866223812","commenter_b":"Still none of this warrants being shot in the back...","commenter_a":"The officer has the suspects identification so was a foot chase even warranted since his address is on the ID...this man could have been picked up at anytime...seems like the officer used extremely poor judgement.....","post_message":"WATCH: Newly released dash cam audio and video shows Ofc. Michael Slager and Walter Scott before fatal shooting: @webpagelink"},{"comment_id":"435422649916109","commenter_b":"Look at her scarf. Clearly a terrorist","commenter_a":"Who do you trust these days? Don't call a cop on a cop.FOP same as KKK. FATURNTY ORDER OF POLICE.I see FUCK OTHER PEOPLE.","post_message":"BREAKING: Cop Says He Doesn't Need a Warrant, Forces Way Into Woman's Home  Video posted by Facebook user New York, NY resident Diane Malikah Moomin Pinkston with this caption (Follow The Anti-Media for further updates on this story)  \"Just happened about an hour ago April 9, 2015 2pm they didn't give me their names or badge numbers . They ran like cowards wanting people to do their ob for them and they get paid. they all left without giving me their info. this is what the system allows them to do. And I'm holding the whole system responsible. they keep screwing up n need to pay to make sure this never happens again.\"  Update: the victim of this warrantless search has posted another video responding to this incident: @webpagelink  via The Rundown Live  Full story: @webpagelink"},{"comment_id":"716711075186137","commenter_b":"Then go back home. Get out of America. We don't want you Islam or Sharia law.","commenter_a":"If that is what they want, I would assume they would be buying airline tickets for a flight back to a Muslims country.","post_message":"Muslims Try To Pass Sharia Law In Alabama So Citizens Do THIS.  We live under the law of the constitution. They are taking a stand.   Do you support these patriots?"},{"comment_id":"10155947178415354","commenter_b":"Nail her to the wall!","commenter_a":"Fry her","post_message":"Maybe they can add this as a post-credits scene in Michael Bay's Benghazi movie..."}]
