[{"comment_id":"1393104724052131","commenter_b":"@username - Woman you should stop watching Fox!!","commenter_a":"This is so stupid. History will show that President Obama is one of our best presidents and also one of my most maligned president for no other reason for the color of his skin . He is one of our most educated presidents, he is also one of our most Christian presidents who didn't have to say he was Christian because he's lived it by being a faithful husband a wonderful father and a patient man who has reached across the aisle and had his hand slapped over and over and over again by hateful Republicans who put party before their duty as servants of this country . He without any help from the Republicans have brought us back from financial ruin that was left by the last Republican president given millions healthcare and under his leadership on military has killed those perpetrated 911 and killed hundreds of Isys and ...","post_message":"A Louisiana newspaper sent a very strong message to President Obama today. Do you agree with the paper on this?"},{"comment_id":"1067105896689813","commenter_b":"She's a bitch !!!!","commenter_a":"I've always believed we get what we've paid for .","post_message":"Do you support or oppose the stand these officers are taking?  LIKE Opposing Views for more breaking news and anaylsis"},{"comment_id":"10154738811856336","commenter_b":"THE MINUTE YOU VOTE FOR HILLARY CLINTON YOU BECOME GUILTY BY ASSOCIATION FOR HER CRIMES. Think about that for a minute...yep every time you see her, hear her she will be lying, and you become one too...a horrible person! She let 4 beautiful men get tortured, sodomized, and killed, all because she didnt answer her phone. She deleted 33,000 classified emails after she got a supena. She will Open borders for hell to get in. ISIS will kill and you will be guilty of this. You will be guilty by association and all your friends will turn on you! All because you wanted the first woman President...We pitty you if she gets in....you won't get help from us....we will be to busy fighting for our guns to save America from her!...We choose TRUMP, a MOVEMENT beyond your reach.","commenter_a":"r I have watched Megan Kelly for a while now and use to love her show. However, I am so disappointed in her need to make a name for herself that she has sold herself to the devil and we all know who that is. Seriously, the sexual predator comment??? And you call yourself a lawyer, what happened to innocent until proven guilty or does that just apply to the Clintons! Why don't you call out Killary for disgracing the office of Secretary of State or even better her husband who has actually paid money to women for his sexual indiscretions. Oh, and how many people close to them are in the grave?? So @username...get rid of the trash and get some class....Hint\"...The Ainsley Earhardt File!!!!","post_message":"\"That's not law enforcement. That's selective prosecution.\"  Newt Gingrich reacted to the perceived double standard with the investigation into Hillary Clinton's private server, saying \"this is the kind of stuff that in a place like Venezuela, you'd understand.\""},{"comment_id":"10154249392839445","commenter_b":"date on picture is July 2008 took almost 8 years to figure out he was a fraud no wonder this country is going to SH-T","commenter_a":"Shame on him","post_message":"In his application for disability benefits, John Caltabiano claimed he couldn’t drive, cook for himself, exercise at the gym, move around his house or even shave without help."},{"comment_id":"10153621420851045","commenter_b":"Uncle had custody of her, I don't think it's what it sounds like. Parents don't just lose custody.","commenter_a":"🙏🙏🙏","post_message":"We have some fantastic news to share with you. Carlie Trent has been found safe and her uncle is in custody! #BringCarlieHome"},{"comment_id":"1015573841835697","commenter_b":"She'd be fiesty in bed","commenter_a":"Sam WantAndre Szukilojc10154044729995518","post_message":"Don’t you know who I am?   No!"},{"comment_id":"509597579189019","commenter_b":"Her Christ has lice...","commenter_a":"good, hope they all empty their bank accounts and go belly up","post_message":"Hate can make people do stupid things... - Andrew"}]
