[{"comment_id":"10158052080890594","commenter_b":"@username Stop being dramatic. Trump's own wife is an immigrant. The only issue is with those here illegally. They should be deported under existing law.","commenter_a":"As long as you are here legally, there's nothing to fear.","post_message":""},{"comment_id":"959204997435717","commenter_b":"Well.... sometimes women are raped...","commenter_a":"Will this decision really stand? Don't get my hopes up.... Can it be vetoed? Will it stand? (I hope it stands but We the people have been asking them to defund PP for a long time and they haven't listened!)","post_message":"This Congress and its relevant committees must complete a thorough investigation of the disturbing accusations evidenced in the Planned Parenthood videos before another taxpayer dollar goes to this controversial organization. These funds can be better used providing legitimate health services for women in places like North Dakota"},{"comment_id":"10154284247599575","commenter_b":"Throw her in with the hardened inmates. Id love to see how \"pretty \" shed look then","commenter_a":"Oh god not another one...","post_message":"This bad girl is getting lots of social media love for her attractive mugshot.  Just keep in mind she's charged with aggravated robbery, kidnapping, first degree battery, hindering prosecution, and tampering with physical evidence."},{"comment_id":"1645030555784057","commenter_b":"Every woman who wants an abortion should see this. Children are truly gifts from God!","commenter_a":"If everyone showed that much love for their mother and all their family. This world would not be in the shape its in today. Most beautiful example for everyone!, thanks","post_message":"Incredible."},{"comment_id":"10152932852611378","commenter_b":"Give her a better intersection ! I'll take the intersection. ! This intersection should be for a young person , a person that's quick on their feet! Firing her doesn't solve nothing ! Crazy intersection","commenter_a":"Her attitude is disgusting; it's like I'm entitled to get paid just for showing up!","post_message":"A lot of people were talking about this 6abc Action News HIDDEN CAMERA Investigation before it even aired! Now here's the whole story. A crossing guard, who is paid to walk kids across a busy intersection, stood by as groups of children bolted across traffic, but she didn't help walk them across to safety. Plus, hear this public servant's interesting response, when we ask why she isn't doing her job to keep students safe!"},{"comment_id":"10153811362959087","commenter_b":"She's too busy partying","commenter_a":"Dean Forest: your party is losing what it needs more of. Susana Martinez will seitch to the Dems if trump isn't careful.","post_message":"A Hispanic official with the Republican National Committee is resigning after telling coworkers she is uncomfortable in a job where she has to work to elect Donald Trump."},{"comment_id":"10153572022092293","commenter_b":"We should see this McKenzie","commenter_a":"@username ayoooo","post_message":"The Witch is a must-see for any horror fan -- just be ready to be creeped out."}]
