[{"comment_id":"616988195096921","commenter_b":"If they don't like it, what can the Republicans offer that's better. We need well educated people.","commenter_a":"Where do I sign?","post_message":"The President just announced something very BIG - a proposal to make two years of community college free for anyone who’s willing to work for it.   #FreeCommunityCollege"},{"comment_id":"10152744813956094","commenter_b":"What is your alternative, Scott?? Just curious.","commenter_a":"Liz Warren is pissed off. Anyone who •isn't• pissed off, isn't paying attention!","post_message":"Yves Smith shreds the the Obama administration's rebuttal to Elizabeth Warren's critiques of the secret trade panels proposed in the TPP and TTIP treaties."},{"comment_id":"10154303589011051","commenter_b":"Immigrants are always welcome, if they come legally and come to be A PART OF AMERICA. If they come to just spread their own countries ideals that conflict with the ideals of the USA, then why come at all? As for who said anything about Sharia Law...that is one of the biggest current issues with immigrants going to the US. They believe in it. They shouldn't be in our country if they do.","commenter_a":"What a wonderful way to make immigrants feel welcome (ps: that's sarcasm) or perhaps immigrants aren't really welcome? In your hearts do you hate people who haven't been born here or speak with an accent or celebrate holidays differently than you do? Whatever happened to \"We hold these truthes to be self-evident- that ALL men are created equal.\"? Or do we really mean all white northern European men are created equal?","post_message":"Do you agree or disagree with this Theodore Roosevelt quote?"},{"comment_id":"1052520311437414","commenter_b":"STUPID AMERICANS!!!!!WAKE UP!!!!!!","commenter_a":"Kick all muslims out of America.","post_message":"This could be way more serious than you ever thought possible. Do you think these men need to be stopped?"},{"comment_id":"1300466673353815","commenter_b":"If they all count, then re count where Hillary won by small margins...","commenter_a":"Jill stein sucks proletarian donkey dick","post_message":"We're at Trump Tower in NYC standing up for voting justice."},{"comment_id":"1137109363022484","commenter_b":"You bought that car 🚗 off your daughter you broke bitch. Lmao","commenter_a":"And they have reproduced. Smh, Plant potatoes you'll get potatoes.","post_message":"Smh... All while their child is present #WSHH"},{"comment_id":"10152774860755927","commenter_b":"Is this wife beater and Obama DNA guzzler still relevant?","commenter_a":"The question is does Reid understand the U.S. Constitution? He should not try and put pressure on the Supreme Court. Reid is a pathetic old ugly man. He is mean and unhappy in life. Can't wait till he is standing before his Maker. Won't be a pretty sight for sure","post_message":"WATCH as Senator Harry Reid maligns the U.S. Supreme Court on forthcoming Obamacare decision "}]
