[{"comment_id":"810160139094199","commenter_b":"guns? what guns? we aint got no stinking guns. Now lets play hide and go seek...","commenter_a":"And hopefully this is what ends up being her downfall","post_message":"Band-aids don't fix bullet holes You say sorry just for show If you live like that, you live with ghosts..."},{"comment_id":"10154460256056509","commenter_b":"Let's not forget she's a sleazy hooker who is doing the work of an immigrant that no American would do.","commenter_a":"Oh so what! trump made fun of Bush having his 90 yr okd Mom campaigning. At least you can understand her, unlike Trumps trophy wife who needs speech lessons. Do we really need a flotus who barely speaks u derstandable englush!","post_message":"See if you can tell why Ted Cruz's campaign pulled this ad."},{"comment_id":"1861600594119875","commenter_b":"Nasty Women","commenter_a":"Disgusted.","post_message":"LIVE: Women's Marches across the nation."},{"comment_id":"10154244618664205","commenter_b":"Hillary Clinton is the Jerk of the year, because she put her personal ambition to be President, ahead of the welfare and safety of the vast majority of the American people!!!! Now we are all faced with the train wreck, of Donald Trump, with the nuclear launch codes at his incompetent finger tips!!!","commenter_a":"I vote Yank Jerkin \"off\" as #1. :-)","post_message":"Get in your last minute votes, before it's too late. @webpagelink"},{"comment_id":"10153883413908797","commenter_b":"Wayne if weren't a firefighter then don't offer an opinion you don't know anything about, the twit woman had it coming!","commenter_a":"They didn't have to do it. .could've went over her car and just give her a ticket","post_message":"DRASTIC MOVE: Look close. That’s Yasmine’s car. The windows are smashed and a fire hose has been pulled through it. Firefighters say they had to do it to get to a house engulfed flames. And they point to what Yasmine did just minutes earlier as the reason. Do you think she has any right to complain?"},{"comment_id":"1565559713753745","commenter_b":"Boy are you missing it!!!! Blacks kill each other 1000% more!!!!","commenter_a":"Wow. I didn't really support this dudes agenda before but after this, I can get down with him somewhat. It's a shame a man from another country has to speak on behalf of black Americans.","post_message":"\"Why are you Americans killing the black people there, shooting them down when they are already on the ground?\" he said. \"Answer that question, because even if it's just one or two or three, it is still human rights violations.\""},{"comment_id":"10153065626180950","commenter_b":"He's a dayum disgrace. Im sure Subway can't believe this saga.Jared is a sicko that needed mental help yrs ago. He failed to get it & now he pays for his sordid fetish. The inmates will love that ass.. Footlong comin for your ass Jared. Ijs !!!! Karma is a bish :(+","commenter_a":"Hope you bring Vaseline for your new job interview jared.","post_message":"JUST IN: Court hearing for ex-Subway spokesman Jared Fogle ends; he \"expects to go to prison,\" his attorney says: @webpagelink"}]
