[{"comment_id":"1700820033514238","commenter_b":"Yeah , more Women would have Guns!!","commenter_a":"who voted for these people?","post_message":"Pretty sure the millions of female gun owners would disagree."},{"comment_id":"10150859556744999","commenter_b":"Did she calll Monica Lewinsky ? It is only a mediocre actress and above is false as it was her husband","commenter_a":"Only in America is it possible that the president of the state --otac son candidate second son, husband and wife ..","post_message":"President Barack Obama: “We’re going to carry Hillary to victory this fall, because that’s what the moment demands.”  More photos: @webpagelink  Photo: Doug Mills/The New York Times"},{"comment_id":"1171823469552530","commenter_b":"Says the self loathing woman...","commenter_a":"Go find your safe place and cry. Omg please. Give up already Donald j trump is the president","post_message":"What do you make of this? These celebrities are among the stars taking part in a telethon airing on Facebook Live during Donald Trump presidential inauguration, which will raise money for Planned Parenthood and the environmental group Earthjustice."},{"comment_id":"10154755493169138","commenter_b":"Trump wont go after Hillary! His people will definitely do that! Trey goudy wants her head!","commenter_a":"I hope she gets bit in the butt and now I hope Trump will investigate her once he is in office","post_message":"Stein, the Green Party candidate who got roughly 1 percent of the national vote, wants a recount in Michigan, Pennsylvania and Wisconsin."},{"comment_id":"10150609954164999","commenter_b":"He got elected because he was the best man for the job and he keeps proving it over and over.","commenter_a":"Spread the \"word.\" The \"word\" is love.","post_message":"\"Societies don’t overnight completely erase everything that happened two to 300 years prior,” President Barack Obama said."},{"comment_id":"794329380660118","commenter_b":"Away with dumb blonde teleprompter readers, away!!!","commenter_a":"Considering it's the only one she has, you'd think she'd find a better use for it.","post_message":"Sorry, Fox News! The 2015 Obamacare enrollment numbers just came out, and once again they smashed expectations.   Read more here: @webpagelink Image by Occupy Democrats."},{"comment_id":"1044102145610796","commenter_b":"Stay at home moms!","commenter_a":"See Travis Kuras i dont drink that much coffee!!! Lol","post_message":"Who drinks the most coffee?  Image by I Love Coffee via AsapSCIENCE."}]
