[{"comment_id":"10153006139081602","commenter_b":"I think it would help lessen the burden on other welfare programs, if some benefit recipients were getting educated and coming off programs.","commenter_a":"Better to pay for this than all the bums on welfare and any state run handout that people take advantage of.","post_message":"Two years of community college could now be free for all, according to a plan President Obama is scheduled to propose Friday."},{"comment_id":"1601073560185519","commenter_b":"@username I know I'm not saying he's illegal, he just wants every illegal to come into our country without becoming legal. He's ruining our country!","commenter_a":"She's not even a native born American trying to become the FLOTUS. Yet Donald Trump gave the current American President hell about his birth certificate! GTFOH","post_message":"Melania Trump: \"The race will be hard fought all the way to November, there will be good times and hard times...it would not be a Trump contest without excitement and drama.\" @webpagelink"},{"comment_id":"877412165685172","commenter_b":"As long as you're legal. Either way, hard work or not your family broke the law so you're criminals. It's the truth. The country is better off without illegals.","commenter_a":"Please please all illegals and Mexicans and Mexican-Americans keep posting your stories. We need to show Trump and his ignorant followers the truth!!! Post your stories. Post your families stories. Flood the Internet and Facebook with the truth of why people of every nationality and every nation come to America!!! Make it known and state the facts and truth!!!!!! Bring ignorance to its knees.","post_message":"She really nailed \"The Donald!\""},{"comment_id":"10153100399077377","commenter_b":"We The People, continuously have said, \"Impeach Obummer Now!\" He has by far surpassed any former president with impeachable offenses, but not one congressman has started the process! Do we sit here yelling in vain? What are we waiting for? We all know he is not looking out for our best interest. And yet our congress wonders why Donald Trump is FIRST in All POLLS! Let's MAKE AMERICA GREAT AGAIN! VOTE FOR DONALD TRUMP","commenter_a":"They are always talking about working and being hard working. When someone tries, the republicans shut them down. Make up your freaking minds , republicans. Or is it you people to work at what you say, for the pay you say, when you say, without any remarks or compensation . That's called slavery. Republicans ended that years ago.","post_message":"Former House Majority Leader Tom DeLay told Newsmax TV  that if President Barack Obama implemented a plan to require background checks on some gun sales by executive order and without congressional approval, the House should consider impeachment proceedings. Like, Share and Vote in Newsmax’s online poll: Do you support Obama’s gun control? Respond here: @webpagelink"},{"comment_id":"10156595781460192","commenter_b":"Not Christian not even NICE!","commenter_a":"Lets just all work to eliminate race ...that so hard","post_message":"What are your thoughts on this sign?"},{"comment_id":"10150700585599999","commenter_b":"Trump is strong enough to protect the country from this invasion. Certainly no one on the Left is even thinking about it.","commenter_a":"Trump is a loud mouth, arrogant, self serving, person. He does not really care about the \"Regular\" folks, he is accustom to just \"Using\" them. I am a republican and can not stand him.","post_message":"Few people can address the circumstances more definitively than John Farmer Jr., who served as senior counsel to the 9/11 commission."},{"comment_id":"1713989815484209","commenter_b":"The Senate's duty is to listen to its constituents. Therefore it should or should not act on this matter based on what they know we want.","commenter_a":"Oh how quickly Obama forgot that he filibustered the nomination of Supreme Court Justice Samuel Alito in 2006. Hypocrite!","post_message":"\"I have fulfilled my constitutional duty. Now it's time for the Senate to do theirs.\"   WATCH: President Barack Obama says if the Senate does not vote on SCOTUS nominee Merrick Garland, \"our democracy will ultimately suffer.\""}]
