[{"comment_id":"484282168429030","commenter_b":"deport her and all the rest of the muslims in america","commenter_a":"Yes","post_message":"She walked on the plane wearing her Hijab, boy was that a mistake.  Shariah Law is dangerous, we support the patriots that stand against it.  Should Shariah be banned in all 50 states?"},{"comment_id":"10153128102178145","commenter_b":"NO! She is a murderer!","commenter_a":"only if she tells the truth about what really happened..oh yeah she doesn't know how to tell the truth!!","post_message":"She's been called the \"Most Hated Woman in America\". Now you may soon see Casey Anthony on TV again.  Would you watch her interview? #WFTV  Read more here: @webpagelink"},{"comment_id":"1357316664288360","commenter_b":"You have got to be kidding. These people are making bad decisions how long are we going to baby adults too stupid not to do drugs? Why can't our country figure out what ILLEGAL means? How about illegal immigrants and illegal heroin.","commenter_a":"its better then clinton","post_message":"Ithaca's mayor wants to open safe injection rooms for heroin users."},{"comment_id":"10155098907990329","commenter_b":"I'm always grateful to be corrected, especially when someone is able to be patient with me even though I'm not owed it :)","commenter_a":"My family has been calling this season's theme \"A Haunting\" because of the reenactments and stuff. I like the season so far but guys, what happened to the people of Roanoke really isn't that big of a mystery. Most likely after part of the group left to get supplies more colonist died from a mix of starvation and attacks. They then most likely moved to settle with the Croatoan tribe for both help feeding themselves and protection. It also helps explain the upsurge in Croatoan children with blonde hair or other features that are rare, though not unheard of, in their genetic pool. Basically, your elementary school teacher lied to you. Other lies you learned in history class: the Mayans didn't just mysteriously disappear. They over farmed the valleys they lived in and could no longer continue to occupy large cities and began living in smaller groups. They're are still ...","post_message":"Mind blown. // American Horror Story"},{"comment_id":"876486519053475","commenter_b":"Lmao Andrea the slut","commenter_a":"Lmao. These hoodrats can have armpit hair all they want. They'll be single and starved for cock. Noone wants chewbaccagina.","post_message":"There's a viral discussion being had over sexism..."},{"comment_id":"1238351549542994","commenter_b":"Take this woman's FB from her. That's stupid!","commenter_a":"No! Edwards did not ask Obama and liar Hillary to stay away! He's lying! He wanted them there but Obama did not want to give up his golf! Hillary is having serious health issues with seizures and needs her sleep!!!!! Trump Landslide!!!!!","post_message":"Donald J. Trump slams President Obama for not interrupting his vacation to visit Louisiana after deadly flooding in Baton Rouge and parts of Lafayette."},{"comment_id":"1112252572119545","commenter_b":"We have BOTH problems: 1. too many guns, too easily had, by too many people. 2. We don't take care of people who are mentally ill. Rather (thanks to Reagan who closed the public hospitals) we either put them on the street, or we bake them first in prison, and *then* put them on the street. Europe takes care of both of these problems much better than we do. That said, the statistics are clear, countries that have more guns, have more gun-related deaths and injuries. Guns within easy reach are far more likely to do harm than good.","commenter_a":"Today another mass shooting of children by a mad man which took place at almost the same time Republican mad men held unethical hearings about the falsehoods that Planned Parenthood are killing children for profit. If the Republicans wanted to investigate a terrorist organization that is solely responsible for the verifiable mass death and carnage of America's children, and other innocent lives, they'd be investigating the National Rifle Association and its members. It's time we realize the NRA and Republican cohorts are terrorist organizations and the Democrats are as guilty and cowardly to do anything to reign in this insanity, as they too are as beholden to NRA dollars as the Republicans. If these were Muslims murdering our children at this rate instead of deranged Caucasian white men, who make up the majority of the Republican voters, all of the Mosques would've been leveled and Muslims would have been rounded ...","post_message":"Another day in America."}]
