[{"comment_id":"10154534701938271","commenter_b":"Those seven countries on which the president issued the TEMPORARY ban weren’t picked out by him. They were picked in 2015 and 2016… by the Obama administration. Trump doesn’t even list those nations specifically in his executive order, he simply lists that he’s banning those nations named in the Terrorist Travel Prevention Act of 2015. ---> @webpagelink Trump’s TEMPORARY order specifically states that only refugees from 7 countries with ISIS controlled regions. (Syria, Iraq, Iran, Libya, Somalia, Sudan, and Yemen) ONLY AFFECT 12% OF THE WORLD’S MUSLIM POPULATION","commenter_a":"President Obama issued an order similar to President Trump’s in 2011 in response to a discovery that a known terrorist had entered the United States via the nation’s refugee program. It seems that much of the country’s forgotten about that, though even President Obama, himself, apparently.","post_message":"Obama's statement said he is \"heartened\" by citizens' civic engagement, but reiterated that policies should not discriminate against people based on religion."},{"comment_id":"877314922325204","commenter_b":"What would you expect him to say? I wonder how this country got to where it is today since we need more immigrants on welfare to advance us.","commenter_a":"rose colored glasses ? Go talk to your Dad and brother !!!!","post_message":"Don't you agree Jeb Bush is WRONG on immigration?"},{"comment_id":"1345080275507252","commenter_b":"I cannot believe how many selfish bastard whites live in this country that they stole from Mexico with a trumped up phony war. These selfish bastards all belong to the Repubtard party. which we need to destroy.","commenter_a":"Why do we have to pay for every disgruntled citizen from every country in the world.....you politicians have us deep in debt but want more from us....All you are doing is enabling irresponsible government around the world.....everyone sees the US as the international welfare program....we have too many of our own citizens who need to be cared for....and their violence is no worse than our own....","post_message":"I hope the administration reconsiders these raids. These children and their families are fleeing extreme violence in Central America and they should have a chance to seek relief, which is why I introduced the “Fair Day in Court for Kids Act” — a bill that mandates counsel for these vulnerable individuals. Instead of separating children from their parents, the administration should continue to address the violence and instability in the region that is forcing these families to leave."},{"comment_id":"1711039005849878","commenter_b":"This Mexican thug should be the one that's taken out. Lots of people would like to see that happen.","commenter_a":"This is so fake people will write anything to make a story","post_message":"This is bone-chilling.  Our prayers are with you, Donald J. Trump!"},{"comment_id":"1155965127752480","commenter_b":"I made the same point on a post on face book and was told I was comparing apples to oranges. P","commenter_a":"Cecil the Lion was made up of \"clumps of cells\"...WTH. Clumps of cells are ALIVE! All those dunderheads seem to forget that THEY were clumps of cells at one time too!","post_message":"I am one of the people being pilloried, by the way, in elements of the Drive-By Media for daring to compare Planned Parenthood to Cecil the Lion.  People on the left who are overly concerned with Cecil the Lion say they are offended that they are being accused of caring more about animals than they are about \"clumps of cells.\""},{"comment_id":"962475507142312","commenter_b":"I KNOW!!!!! They've already started. It's so funny!!","commenter_a":"That will drive them crazy","post_message":"Why does Hillary love Snapchat? Watch and learn:"},{"comment_id":"10154829556541425","commenter_b":"Go home","commenter_a":"Thank you all for standing up against bigotry and stupid trump!!!","post_message":"We are live at JFK Terminal 4 arrivals #MuslimBan #MuslimBanprotest #nobannowall"}]
