[{"comment_id":"10154473898974411","commenter_b":"@username stick to your supermarket shopping you dumb f","commenter_a":"So many ignorant people commenting on this. This is a traditional harvest of one of the only renewable resources the inhabitants of this barren rock can survive from. Educate yourselves.","post_message":"'The ordeal began this morning when locals spotted a pod of between 100-150 pilot whales'"},{"comment_id":"786579818199262","commenter_b":"He SUCKS DICK..........","commenter_a":"Dangerous would be the truth.","post_message":"BREAKING: Obama Makes Sickening Announcement, This Will Cost Lives  He will ruin this country before his term is up.  Do you think Obama is reckless?"},{"comment_id":"496937747163472","commenter_b":"Put the hag in prison","commenter_a":"I like that picture of Hilliary, \"hands up, bitch, you're under arrest.","post_message":"New documents released shows incriminating evidence that could put Hillary away for good.  She is a terrorist. We need to act now.  Should Hillary Clinton be arrested for treason?"},{"comment_id":"10155339234553132","commenter_b":"Why have this girl on TV really it is ridiculous !","commenter_a":"Take all her electronics away....and Danielle's too!","post_message":"Danielle Bregoli is back, and she not mincing words."},{"comment_id":"10153601498992383","commenter_b":"Well your opinions are wrong, ladies! What kind of military expertise do you have besides \"my husband served?\"","commenter_a":"this is getting way out of line.second marine shot at a shooting range at Camp pendleton?","post_message":"Our thoughts are with the family and friends of the Marine."},{"comment_id":"10154941549643057","commenter_b":"@username You can't get back in the US because of a wall.","commenter_a":"Wow! He really showed him! The walls still gonna happen! No more cancerous illegals!","post_message":"#BREAKING: Mexican President Enrique Peña Nieto says he will not attend a planned Jan. 31 meeting with President Donald J. Trump, hours after Trump tweeted the meeting should be canceled if Mexico won't pay for a border wall."},{"comment_id":"426081280913499","commenter_b":"Kiss my ass!!","commenter_a":"Not Surprised, a fight to fight, no reason just out of control. Using excuses for what is being done. If you were really protesting over the treatment of the men and women injured and or killed, you would be ranting about this, not burning up a city, and hurting people.","post_message":"Such a racist sign..."}]
