[{"comment_id":"800077153428906","commenter_b":"Women....or bitch....","commenter_a":"Welcome to a Hillary Presidency: Day to day scandals and law breaking. But, the Dems are OK with that as long as their guy is in office.","post_message":"This is definitely raising eyebrows..."},{"comment_id":"10154061115835530","commenter_b":"Someone blow smoke in this chicks face please","commenter_a":"Gross. Second hand smoke from cigarettes is disgusting enough, I get to choke on obnoxious people's vape fumes everywhere, and now we can add weed to the mix. Wonderful.","post_message":"Introduced by state Sen. Coleman A. Young II, D-Detroit, the bill is being called the “non-medical marijuana code.’’"},{"comment_id":"876368172456238","commenter_b":"You are so foolish. You must be a Hillary supporter? That nasty woman has direct ties with Monsanto. Do you realise that? She is one of the biggest crimals you could ever imagine. Put Google to good use and research just how evil Hillary really is.","commenter_a":"Amen!! Thats how you hurt a man with money right in his pocket. I had told myself i was not going watch nothing with his name on it.","post_message":"Kudos to NBC for doing what's right!  Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153115200467217","commenter_b":"He would embrace you but insist you stop sinning if his embrace is to continue . John 5:1-14..\"SIN NO MORE\"....","commenter_a":"Gemma Dunnell homophobes Homophobes everywhere","post_message":"\"I found a relationship with God... right around the same time I realised I was gay.\""},{"comment_id":"1137064162981260","commenter_b":"Mold on the apple","commenter_a":"Grrrrrreat. *head desk*","post_message":"A huge new study has confirmed that we are in the middle of an extinction event, the likes of which hasn't been seen since the dinosaurs went extinct."},{"comment_id":"942978109072863","commenter_b":"You're supposed to protect your children not potentially ruin them.","commenter_a":"Ever think of asking her why she steals? How about showing how her loved ones are affected by her stealing, a family intervention. How about telling her that you love her and if there's ever anything that she needs, she can ALWAYS come to her father!","post_message":"Too far or just punishment?"},{"comment_id":"10152731629721051","commenter_b":"Kids should never be returned to this evil woman and she should do years in jail.","commenter_a":"Why Don't these nutty individuals just take themselves out and leave others alone !","post_message":"This mom threatened to beat her kids if they didn't drink the apple juice she gave them. The next day they were rushed to the hospital."}]
