[{"comment_id":"936551829771205","commenter_b":"The United States is a weapon of mass destruction. NO MORE WAR.","commenter_a":"So you can wittness more families lose their love ones and get richer doung so. How many of your children will you send.","post_message":"The war criminal has emerged from the shadows once again."},{"comment_id":"888341521222544","commenter_b":"She sounds worse than the other guy Holder.","commenter_a":"Another dumbass handpicked","post_message":"Add your name HERE: @webpagelink"},{"comment_id":"473465766111797","commenter_b":"@username you mother should have swallowed your nasty ass.","commenter_a":"They are both true. And that cannot be argued. They are both true","post_message":"Full story: @webpagelink/ Graphic by: The Free Thought Project.com <-- 'Like' (y)"},{"comment_id":"582952285239212","commenter_b":"Vote Trump! Not crooked Hillary","commenter_a":"Trump is nothing but a narcissistic coward. He likes to dish it out but he can't take it. Semper Fi","post_message":"Watch: POWERFUL and MOVING... This WWII Veteran and former POW is literally brought to tears in this impassioned plea to Americans to keep Donald Trump away from the presidency. Let's make this brave veteran go viral.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153867019782061","commenter_b":"That was good","commenter_a":"What an idiot.Typical liberal though.","post_message":"WATCH: Penny-wise or penny-foolish? Man decides to pay a fine with 22,000 pennies, but over-paid doing so."},{"comment_id":"1038422129567160","commenter_b":"What a POS !","commenter_a":"Go home to Canada and take hiller with you.","post_message":"CRUZ F*CKS CONSERVATIVES, VOTERS and TRUMP  @webpagelink"},{"comment_id":"10153935380939456","commenter_b":"Ikr and people smuggle exotic animals and plants like that don't spread diseases but I guess everything that's wrong with the world is only caused by illegals.","commenter_a":"I'm stuck between laughing out loud at the idiocy of Jennifer and lucindas comments, or just being out right dumbfounded! But no, I laughed, y'all's ignorance just made my day 😂😂😂😂 Lol don't be mad cuz your wall can't stop illegal entry of virus spreading... Mosquitos 😂😂😅","post_message":"An illness is spreading around the world, and there's mounting evidence linking it to a terrible birth defect."}]
