[{"comment_id":"1801831173397468","commenter_b":"Michelle and Hillary are 2 of the most dishonest people ever!! If Hillary wins then you can tell your daughters and grand d aughters as you watch them being raped by the refugee's , how you are soo happy you voted for this evil..woman .. Get ready for it, with a Hillary win, it will be Sharia Law...","commenter_a":"Want more of THIS, America? Vote Hillary and you just might get it!~ >","post_message":"\"This is a country where a girl like me from the South Side of Chicago whose great great grandfather was a slave can go to the finest universities on Earth. A country where a biracial kid from Hawaii, the son of a single mother, can make it to the White House. A country where the daughter of an orphan can break that highest and hardest glass ceiling and become president of the United States. That is who we are, that is what's possible here in America—but only when we come together, only when we work for it and fight for it.\" —First Lady Michelle Obama today in North Carolina IWillVote.com"},{"comment_id":"10153734321486350","commenter_b":"You guys have kickass daughters :)","commenter_a":"Last year my daughter heard a football coach at my sons practice tell the boys they were playing like a bunch of girls. This year she is showing them how girls really play. Team captain and can take down every boy, she is playing on the line for both offense and defense. #girlscanplayfootballtoo","post_message":"\"The boys on the team were apprehensive at first, but then she laid a hit on someone and they realized she's just another player with a ponytail."},{"comment_id":"10157077224085354","commenter_b":"Ignorant slut","commenter_a":"Crazy socialist bitch","post_message":"The only thing \"ludicrous\" about it is what Debbie Wasserman-Schultz said this morning.  WATCH:"},{"comment_id":"1532770816783042","commenter_b":"You are a gross old creeper anyways. Have fun jerking off the rest of your life.","commenter_a":"Fuck black Lives matter!","post_message":"Black Lives Matter is a racist hate group! Share if you agree!!"},{"comment_id":"1238390432847651","commenter_b":"Shut up Head","commenter_a":"THE FACTS ABOUT MUSLIMS ------ MUSLIMS are not here to assimilate. Muslims have NEVER assimilated to any society. ... THEY COME TO: ... * Force THEIR\" traditions, beliefs & political system upon us. * Delete our Traditions, Beliefs, religions & political systems. TECHNICALLY SPEAKING: Islam is NOT a religion. Islam is a \"political ideology/government\" hell bent on erasing all OTHER religions & ruling the world. Islam is hell on Earth... Eradicate this so called religion. SPREAD THE WORD, COPY & PASTE!!","post_message":"Seven civilians, including three women and a child, have been beheaded by suspected ISIS-linked militants in southern Afghanistan."},{"comment_id":"10153277362054170","commenter_b":"she is such STUPID IDIOT","commenter_a":"Her strategy, which has worked in the past, is to blame everything as due to \"Right-wing extremists\" and denounce reports of her past as \"old news.\" The liberal press will support her.","post_message":"Well, the much-awaited Hillary announcement video is out, and we've got it here. If you can find a rationale for a Hillary presidency anywhere in it, by all means let us know. We couldn't."},{"comment_id":"10153811229123433","commenter_b":"1. Hardly \"record\" when the number of abortions is going DOWN. In 1990, there were 1.6 million abortions performed. Today, it's a little over a million. Numbers don't lie. 2. Hundreds of thousands of women were getting abortions BEFORE Roe V Wade legalized them. You are more likely to die due to childbirth/pregnancy complications than an abortion. 3. You are contributing to your own problem. Teens that had received comprehensive sex ed were 60% LESS LIKELY to get pregnant. The states with abstinence only education have HIGHER rates of teen pregnancy compared to states that actually teach sex ed. Why do women get abortions? Unwanted pregnancy. Much less likely to get pregnant when you're using contraception. It's not rocket science. 4. Abortion isn't free. The Hyde Amendment prohibits any federal funding of abortions except in the case of incest, rape, or danger to the life of the mother. They most ...","commenter_a":"What do you call 350k annually, or 10,000 late term per year how many is \" record\"?@webpagelink","post_message":"From the trail in Iowa. Carly Fiorina wrongly claims that we're seeing \"record\" abortions. @webpagelink"}]
