[{"comment_id":"1253236361399557","commenter_b":"This is how much hillary hates women. Hillary wants to bring in illegals who hate women. @webpagelink","commenter_a":"Trump is afraid of Hillary for one good reason and that is why he constantly threatens her with assassination. Hillary can win over Trump by force of argument rather than by force of fear. You Trump supporters aspire to fear and violence. We Hillary supporters to free speech and Civil Rights.","post_message":"On this day in 1973, tennis champion Billie Jean King defeated Bobby Riggs in the “Battle of the Sexes.” King went on to found the Women’s Tennis Association, the Women’s Sports Foundation, and Women’s Sports Magazine to support women athletes on and off the court."},{"comment_id":"10155066550807994","commenter_b":"White racist people that's who.","commenter_a":"This is how they return the favor for his dream","post_message":"I HAVE A DREAM. Before Martin Luther King Jr. gave his speech in front of 250,000 in Washington, DC - the great American delivered a very similar version right here in Detroit two months earlier. READ & LISTEN:"},{"comment_id":"948144815307058","commenter_b":"@username I appreciate that... However even though the question was asked by one person and he answered her directly .. He did that in front of an audience... As a parent I get what he's trying to say... But as a woman it makes me angry .. The boys that are being raised need to be taught that when a girl is too drunk to give consent it can be considered rape - I say can because not every girl that has drunk sex is going to consider it rape - but some may - plus it's incredibly unrealistic to tell a college girl to stay away from a party with alcohol... U may as well send her to a convent ..","commenter_a":"This advice isn't blaming the victim. Advising someone to lock their doors at night is not preemptively blaming the home owner for a robbery. Should we live in a world where girls can go to drunken college parties and not worry about being sexually assaulted or raped? Absolutely. Is that the world we live in? No.","post_message":"John Kasich to student concerned about sexual violence: \"Don’t go to parties where there’s a lot of alcohol.\""},{"comment_id":"1001682469851506","commenter_b":"This lady is so delusional. .... how did this happen","commenter_a":"Does no one get the part where they are wielding skateboards at police? This isnt because a WHITE COP or two BLACK KIDS.... this is because TWO CRIMINALS TRIED TO ESCAPE AND USED SKATEBOARDS TO ASSAULT POLICE!!!!!!!!","post_message":"JUST IN: This footage shows step-brothers, Bryson Chaplin and Andre Thompson, at Safeway -- before they were shot by an #Olympia police officer. >> kiro.tv/SurveillanceOly  They are both expected to survive."},{"comment_id":"10153910150514657","commenter_b":"Go home","commenter_a":"GITMO","post_message":"One doesn't have to think long or hard about how this would play if Hillary Clinton were a Republican (which she once was)."},{"comment_id":"10153389927718598","commenter_b":"She seems to be for all things bad!!! And she is suppose to be a christian...","commenter_a":"You are nothing but. Trash joy behar ,,","post_message":"Joy Behar Trashes Carly Fiorina for Being Pro-Life “She Should be Ashamed of Herself”"},{"comment_id":"10153467924781350","commenter_b":"Men like them that way on women.","commenter_a":"U can wear skinny jeans that aren't painted on","post_message":"Don't be a fashion victim."}]
