[{"comment_id":"925848087500236","commenter_b":"SHE BE A COMMIE SOCIALIST. FIRE HER!!!","commenter_a":"he needs to take about three weeks of anger management and then come back child behavior period","post_message":"BOMBSHELL!!  This changes everything..."},{"comment_id":"10152669035866135","commenter_b":"Me too","commenter_a":"Me too, worst sound i have heard from my phone! I try to read the alert and they want me to answer a survey! Are you freaking kidding me?!?","post_message":"UPDATE: Police have now released a picture of missing 6-year-old Hailey Betts.  READ MORE: @webpagelink  Have you seen her? Please call police right away if you have any information."},{"comment_id":"10153202858353352","commenter_b":"Nigger Bitch??? Hahaha So Original","commenter_a":"Only because he was a black cop..... If he was a white cop that cracker would be locked up..","post_message":"Gun enthusiast who shot police chief four times during raid walks free because cops 'didn't have enough evidence to charge him'"},{"comment_id":"10153656490006107","commenter_b":"Mrs. Paul rocks!!!! Ron put down that economics book and take Carol to dinner!!!","commenter_a":"This election cycle by far has been the craziest one I've ever witnessed. The one question I can't seem to get an answer to is this,,, WHY??? Why are both sides attacking Trump? Why is China attacking Trump, Why is the pope attacking Trump? Why is Mexico attacking Trump? Why are the Republicans going against their own pledge and attacking their own front runner? Why is HilLIARy so afraid of Trump? Why does Trump have this Republican Party split? Why is Mitt Romney going after Trump? Why are the Koch brothers dumping in 75 million dollars to go against Trump? This isn't normal, something doesn't add up and we need to be smart enough to see through the the smoke and mirrors why they are quickly exposing themselves as the try to take down Trump before #SuperTuesday Here's my theory, it goes back to the age old question how to ...","post_message":"Happy Birthday to Carol Paul, an amazing woman, mother, and advocate for liberty. Thanks for making me the man I am today, Mom. Happy Birthday."},{"comment_id":"1229225200430841","commenter_b":"I do agree though a little white girl wouldn't have been thrown to the ground...","commenter_a":"While the student was wrong in her choices to be disruptive, disrespectful, ignorant and arrogant. The officer also was wrong in the amount of force that he exuded on a MINOR. Regardless of the ignorance and attitude shown by this student. I worked in a school and have 6 children of my own. Some children nowadays are extremely difficult to manage and teach. I agree. My own children know better than to even entertain the thought of being disrespectful, they know their behavior has consequences. Not all children are raised in that type of loving environment. That is NO excuse for this child acting like a spoiled brat with a chip on her shoulder who obviously has authority issues. That being said, back to the police officer who felt the need to use his authority and man handle a child. Simply because you're annoyed and irritated that a child defies ...","post_message":"This video taken from inside a South Carolina high school classroom on Monday shows a police officer body slamming a female student and dragging her across a classroom. The chorus of parties angry over the confrontation continues to grow, as the sheriff's department investigates. @webpagelink"},{"comment_id":"10153717162272708","commenter_b":"No we don't have to solve the worlds problems with money we do not have. If you were a refugee from America, which countries would take you in and give you benefits FOR LIFE? Which countries would require nothing of you as a citizen of their country once they took you in??? Those refugees get better benefits than anyone who is from here would ever get......why? Because their government could care less about them so we have to save everyone from everywhere......just because. Just because they won't care about their own people.....just because we have endless tax dollars to support them all. Nope.","commenter_a":"Saying we can't take refugees is saying you don't have compassion, as humans we have to find away","post_message":"We won’t be able to take more refugees. It’s not that we aren’t compassionate. But we can’t. There’s no way to background check them. SIGN IF YOU AGREE!"},{"comment_id":"1046361932108447","commenter_b":"Wow, stupid bitch","commenter_a":"Kiss off Obama you are worthless !!! Go Donald Trump For President !!! Would be Great if Obama was for us Americans like he is for all the out siders !!!","post_message":"President Obama is urging the Senate to pass a bill to help Puerto Rico with their recession and debt crisis. What do you think about this?"}]
