[{"comment_id":"975168282518593","commenter_b":"Better be sure. Our us h hospital are not allowing this.....What. If. Patient wants non Islamic nurse. Because is this practice?","commenter_a":"STOP with the offending of muslims.....this is the United States of America...land of the free.... Who gives a crap if your offended....","post_message":"Whoa!"},{"comment_id":"834253316765245","commenter_b":"Send her back where she came from","commenter_a":"Put her in jail","post_message":"This is as low as it gets.  She is a traitor.   What do you think her punishment should be?"},{"comment_id":"10153738179686037","commenter_b":"She is looking for $$$. Obamacare is expensive","commenter_a":"Good for her! Everyone else is expected to do their job the way it's suppose to be done..why shouldn't this doctor? Most doctors don't like to be questioned or for you to have an opinion. She ruined this wonderful experience for these parents. Birth is a day to day normal thing for her but for the parents it's something they will never forget. Some docs need to get off their high horse and realize they're not always right!","post_message":"“I can’t be the only person out there this is happening to,” Lindsay Scarborough Switzer tells Yahoo Parenting."},{"comment_id":"807667145998560","commenter_b":"Dumb bitch cant spell","commenter_a":"Because she wanted to be an arrogant*** brat instead of following simple orders","post_message":"\"How did switching lanes turn into all of this?\""},{"comment_id":"10154339330179087","commenter_b":"@username, who is afraid of immigrants? There are laws. Laws need to be followed to become a citizen. Do you want a POTUS ignoring federal laws?","commenter_a":"The left just can't help themselves. They have to cast this Trump... They have to portray him as somebody that's a walking mental midget, that literally has no idea what he's done here by winning the presidency, that has no idea how to talk, has no idea how to behave. They continue to make the mistake of plugging him into their model. They're plugging him into what they think an accomplished politician is, and he's not that, he's never been that, and he's not going to be that.","post_message":"“Trump and Pence, they pulled a dog and pony show on the numbers. I almost threw up in my mouth.”"},{"comment_id":"1059120344128437","commenter_b":"I have a 15 year old daughter. She is very mature and brilliant. Although, she (as well as almost all teens that age I know whose frontal lobe isn't even completely developed and whose lack of life experience just isn't there no matter how much a teen thinks it is) is not ready to consent to domestic slavery, opps I mean marriage. Many organizations are trying to stop child marriages in other countries. I am pretty sure that this is the same thing.","commenter_a":"Sick","post_message":"A debate broiling in the Christian homeschooling community asks a hard-hitting question: just what should the minimum age for marriage be?"},{"comment_id":"1160205933989715","commenter_b":"You must want Hillary as president....","commenter_a":"I have to say I am ashamed to call myself a Republican...they need to stop crying and support the leader and stop this!!!! If they do this they would elect the Democrat and then away goes all our freedoms!!!!","post_message":"Gingrich: Trump is a natural ally of conservativism"}]
