[{"comment_id":"10153718777033690","commenter_b":"Why don't the Saudis and Qatari take them all. The are wealthy nations with more real state than Europe. We definitely don't want them here in the US we have enough dealing with illegals coming from our southern border...!","commenter_a":"Take 30 seconds to sign (and possibly share) this petition asking the US government to take in 65000 Syrian refugees. Germany is expected to accept 800,000 refugees this year, while the US has accepted less than 1,000 thus far. Let's do a small part to encourage the U.S. government to be socially responsible. This is a humanitarian crisis and the Syrian refugees have nowhere to go. You can vote no matter where you are from. @webpagelink","post_message":"\"The world sees Germany as a country of hope and chances,\" German Chancellor Angela Merkel said at a news conference last week.  Despite all the positive energy, however, some observers are questioning how the tens of thousands of newcomers, many of whom are conservative Muslims, will integrate and adapt to German society."},{"comment_id":"10156072417220603","commenter_b":"Well take up not enough jobs with the people that keep letting foreigners in the country.","commenter_a":"Yall saying people should be able to support themselves are not understanding that jobs at McDonald's etc are NOT meant to support a family. If you have a job there and have a family they (McDonald's) and us (people that will take the hit of a min wage increase because the cost of products will go up) should not have to pay for your poor choices for not being mature and either going to college or tech school or working your way up in a company. Min. Wage jobs are for high school/college students so if youre past those ages and still making min. wage you should've made better choices and should stop expecting the same pay as people that did!","post_message":"Do you think the minimum wage should be raised?"},{"comment_id":"490645967790363","commenter_b":"Trump thought better of it and he was invited in. Jorge Ramos is a U.S. Citizen, a gentleman and a great reporter for Univision. Shame on Trump!","commenter_a":"trump was right","post_message":"He just got SCHOOLED!"},{"comment_id":"10153345798428717","commenter_b":"@username Sweet cheeks maybe you should learn about history rather than remaining ignorant @webpagelink","commenter_a":"Be happy Manchester, your taxes won't get raised beyond the cap.","post_message":"#BREAKING NEWS: The unofficial final results in the Manchester mayoral race are in. Incumbent Ted Gatsas defeats challenger Joyce Craig by 75 votes. -- @webpagelink"},{"comment_id":"349180888539647","commenter_b":"Yeah, women's lib.","commenter_a":"I'd rather have her NOT have a romance - I thought that was the whole point!","post_message":"The hashtag #GiveElsaAGirlfriend began trending as many Twitter users voiced their support for a gay character in the Disney movie. What do you think?"},{"comment_id":"10152912269504071","commenter_b":"Idiot white people","commenter_a":"Why is it still okay to use the n-word in rap music? Why haven't people of color stood up against those of the same color that use that word?","post_message":"There a few other words more volatile than this one."},{"comment_id":"964951150247780","commenter_b":"Prove it!","commenter_a":"I support our troops; I support allowing them the victory over our enemies...","post_message":"BOOM!! If I were ISIS, I'd already be looking for cover. The U.S. Military isn't messing around here.   Do you support our troops?"}]
