[{"comment_id":"10153405844391955","commenter_b":"Cruz is a phony with his evangelical persona","commenter_a":"Trump's record makes him look like the flip flopping, inconsistent political opportunist he is. The right personality and talking the way we like without looking at policies, are the criteria the Democrats selected Obama in 2008. Donald Trump has supported a net worth tax, 35% tarrif, he supports amnesty and a path to citizenship, \"because there are jobs Americans just won't do,\" He's donated to clinton Pelosi & Harry Reid, and has said Bush is the worst president ever. He's a RINO and a caricature of a conservative inartfully voicing every failed mudsling of the left against conservatives. Ted Cruz is a world class debater, with a nearly perfect record who takes on both Democrats and spineless Republicans. He has all the positives and then some without the negatives of Trump. #TedCruz2016 @webpagelink","post_message":"NEW 'SILENT MAJORITY'"},{"comment_id":"10153903202659641","commenter_b":"Suck one Ortiz","commenter_a":"All those who dont like Zuckerberg you are free to delete your facebook account","post_message":"Mark Zuckerberg isn't happy about what people have been writing on Facebook's chalkboards."},{"comment_id":"10154965744184641","commenter_b":"I would agree that would be a good reason to March however that March said absolutely nothing about this. As a matter of fact the lady running the March believes in Sharia law and in her belief system this is perfectly acceptable","commenter_a":"This why we march. This is not acceptable for ANY culture.","post_message":"When she was 12, she was sold into \"marriage\" with a 70-year-old man -- and there are hundreds like her."},{"comment_id":"10153353712173984","commenter_b":"Ugly BASTARD.","commenter_a":"Wow Al really got hammered but Al doesn't care he's laughing all the way to the bank.","post_message":"Wow! One of the top conservatives on the internet just lowered the boom on Sharpton in a big way. Many people were thinking it, but only one had the guts to say it..."},{"comment_id":"1054028271282063","commenter_b":"You know thats an opinion. My grandfather fought some battles i could never even imagine in my worst nightmares. He earned his title and passed it down and if to a woman so be it. I stick with this country has the best military not because of our abilities but the devotion of our troops make it so. If a woman earns a ranger tab she did it because she truly wanted it. She pushed herself beyond her limits and succeeded. So no matter what others think because its only their opinion i am proud of these women and i ambproud of our troops. Sure they may be women but look how many millions of americans wouldnt dream of going to war yet these women are willing to risk it","commenter_a":"You know Russia in world war 2 fought with women on the front and never had an issue. Israel has women in their military and has never had an issue. Heck they have yet to be defeated. My question is why not allow women the opportunity to serve as well? Set a standard and if a man or a woman either one have the skill and determination to achieve it then that is what we need in our military. It reminds me of a story in Vietnam I heard once (Of course before my time) there was an older black man and an older white man I spoke with once. They were best friends and would do anything for each other. They told me that each was in the 1960s very prejudice. The black was raised to hate whites and the white raised to hate blacks. They went to Vietnam ...","post_message":""},{"comment_id":"1384915431551722","commenter_b":"Sorry dear i said this woman is really DISGUSTING ohh","commenter_a":"is she speaking from experience?","post_message":""},{"comment_id":"1025040644216607","commenter_b":"@username , I think there is, but would have to look it up. Basically the way it would work though is if impeachment is not possible, a no confidence vote by congress could in effect say we no longer recognize this Presidents authority. Members of congress can be sanctioned, why not the POTUS?","commenter_a":"What we need is Nation wide non-compliance with, or recognition of authority, or any further orders coming out of the White House. Personally I think a no confidence vote is in order. Write your Congress and demand the sanctioning of the President until the end of his term, for gross executive over reach and abuse of power.","post_message":"The president continues to show his disregard for millions of Americans with his 'Bathroom Order,' never bothering to consult with parents. Instead, he decided to issue an order threatening the loss of funding and lawsuits from the government to schools that don't comply."}]
