[{"comment_id":"969391529750304","commenter_b":"Even a whore has the right to decide when she has sex!","commenter_a":"Following a celebrity back to their hotel room doesn't make you ambitious. It makes you a whore.","post_message":"This is the side of the Bill Cosby rape scandal that hardly anyone is talking about  but everyone should."},{"comment_id":"1089539017791300","commenter_b":"Hillary belongs in jail! Do your job Congress.","commenter_a":"I would think about why she dosen't answer the question","post_message":"This state rep took a huge stand against Hillary and even called her out at one of her rallies.  But the rep had no idea what she had gotten herself into.  Now she says she carries a gun because of what Hillary's goons have done to her."},{"comment_id":"894821663947420","commenter_b":"more idiots!","commenter_a":"I blame Obama","post_message":"Don't be quick to blame California's drought on plush lawns and swimming pools ..."},{"comment_id":"10155061741852491","commenter_b":"Drain the swamp!!","commenter_a":"He needs to just let all former Obama people go. He tried not to cause a stir by dismissing everyone from the get go because the media and liberals would have had a hay day as they do with everything else. But now, it's obviously a huge issue. Let them all go asap!","post_message":"A former Pentagon official says 'nothing short of prison is enough' for the culpable officials."},{"comment_id":"10153826887651179","commenter_b":"It was at the place in France where the ladies wear no pants.","commenter_a":"going back to their roots? lol","post_message":"$55 million dollars of cocaine was found at a Coca-Cola plant in Signes, France."},{"comment_id":"10154313536616509","commenter_b":"Um, the judge is a republican. But thanks, though.","commenter_a":"Fox news haters will blame muslims","post_message":"A week after a warrant for his arrest was issued, Ethan Couch -- more commonly known as the \"affluenza teen\" remains on the lam."},{"comment_id":"1601888236769214","commenter_b":"I personally like the idea of amnesty for those already here, then very strict implementation of immigration laws and immigration reform after that. Breaking up families is not a solution to this problem. These raids will just cause more pain and foster bad feelings. If they're here, let them stay, get them legalized so they help support the system they're using. Then lock it down and form a clear, sensible, reasonable, doable path to citizenship. we don't need a wall. We need penalties on companies that hire illegals, and serious reform on the \"war on drugs\" that incubates environments that force people to flee their homes. We have to stop blaming people who are looking for a better life, and start finding ways to help our neighbors reach the same level of community peace that we enjoy.","commenter_a":"I know this is going to be unpopular, but I know many Hispanics who agree with me. There is a legal way to come to the country, and contrary to some of the attacks I have seen on other posts, it does affect our low income Black, Hispanic, and White communities. They are used to a more extreme poverty, so they are willing to work for less than minimum wage, and are off the books, so taxes, SS are not paid. This means an American citizen or legal immigrant is denied a job. When so many of our jobs are being sent to Mexico, China, India how can we not address the issue of those who came here illegally. My nephew's wife is from Mexico. 2 of my nephews have dual citizenship. US/Brazil. I am far from racist or anti-immigration, but our own citizens and legal immigrants are suffering. We ...","post_message":"This week the media reported something that I find not just wrong, but inhumane: President Obama is currently planning \"a month-long series of raids in May and June to deport hundreds of Central American mothers and children\" who came to our country fleeing that same violence.  Sending women and children back into harm's way after they already fled horrendous violence in Central America is painful and inhumane, and must be stopped.  Sign my petition asking President Obama to stop these raids and to make sure that families fleeing violence in Central America are protected from deportation."}]
