[{"comment_id":"10155690406614199","commenter_b":"She started it. First of all she knew it would take her long so why didn't she let him go first. Second of all she poured her drink on him. At it sounds like she isn't very honest. And sorry but she looks like she's on drugs. This is what happens when you push people to far","commenter_a":"I think because she lied and she threw the first thing to get the conflict from verbal to physical either she gets punished or he gets off free. This is soo sexist if a guy threw a drink at a lady and she smacked him in response pretty sure she would get away with it.","post_message":"Police have released surveillance video from an alleged attack at a grocery store that tells a bit of a different story than the one the alleged victim gave."},{"comment_id":"10153260495114087","commenter_b":"She should run to prison!","commenter_a":"100 percent right","post_message":"\"I can tell you this, if that were a Republican that did what she did with the emails, they would have been in jail 12 months ago,\" Donald J. Trump said."},{"comment_id":"10153234666538188","commenter_b":"Who is the idiot who decided on this He or she must be a pervert can't wait to see little girls or boys pull down their pants","commenter_a":"What is this country becoming ? I don't recognize it!!!!","post_message":"I just got back from San Diego. Incase you need the restroom you are greeted with this sign.   Welcome to the new normal."},{"comment_id":"385075118347449","commenter_b":"She's not worth two cents the skank","commenter_a":"How about we take oboma's pay to pay for this.","post_message":"This is CRAZY..."},{"comment_id":"10156594295450354","commenter_b":"She is a mental pig.","commenter_a":"Because you are a dog","post_message":"Feminism 2016 Style...  “It’s policy. Teddy Kennedy, remember Chappaquiddick?… I mean, a girl drowns and he abandons her, and [s]he drowned, and women still voted for Teddy Kennedy. Why? Because he voted for women’s rights. That’s why. That’s the bottom line of it in my opinion. I mean, I don’t like either one of them, to tell you the truth, Teddy or Bill. They’re both dogs, as far as I’m concerned. But I still will vote for Bill Clinton, because he votes in my favor.”"},{"comment_id":"549265795241268","commenter_b":"Those boarders should never been opened... Obama fault all the evil happening in the world, is all due to Obama turning loose the Muslim maggots and Mexicans by mostly the Muslims... Their eating up all the good stuff in the world just like maggots do and ruining everything!!!!","commenter_a":"Yes","post_message":"BREAKING: Mexican Military Invading US, Begin Shooting Texas Residents.  We Trump's wall now. This is getting out of hand.  Do you think we should close our borders?"},{"comment_id":"10154139052147869","commenter_b":"Yes, she should move to Berkeley!","commenter_a":"Backward looking. When was the last time she looked in a mirror ...","post_message":"Another thing noticed in the Wikileaks release of the full transcripts Hillary Clinton’s paid appearances for Goldman Sachs: she described Republicans as “backward-looking” and fundamentally un-American.”  So in addition to being rednecks (according to Bill), people who don’t support her politically are racists, sexists, homophobes, xenophobes and Islamophobes; a “basket of deplorables” who are backward, irredeemable and fundamentally un-American.    So I have to wonder: why does she want to be the leader of all us horrible people?  If she hates everyone who disagrees with her that much, instead of running for President, why doesn’t she just run for mayor of Berkeley?"}]
