[{"comment_id":"10153743132780950","commenter_b":"Fuck you Bitch!!!","commenter_a":"The entire staff cheats on that team !!! Even Bellicheck...fuck the entire Patriots organization!!!!","post_message":"New England Patriots quarterback announces latest move in wake of court rejecting appeal."},{"comment_id":"1026880740704736","commenter_b":"Crazy runs deep in that family","commenter_a":"Still 'illegal' still a liar and still not eligible for being in Congress or running for president...","post_message":"Da'fuq?"},{"comment_id":"10153460771654575","commenter_b":"Ian Gibson watch the video. Youre screwed.","commenter_a":"Lol this is news?","post_message":"What does your birth month reveal about your health?  Researchers who compiled the birthdays and medical records of patients found that people born in May are the healthiest. People born in October might be at the highest risk for contracting diseases."},{"comment_id":"1345340232144440","commenter_b":"@username, strong women do not build economies on murder of other countries and arming terrorists. That is a woman in bed with Big Money.","commenter_a":"I thought I was following an intelligent, thoughtful and insightful site, obviously not. Frightened of a powerful women I see, like most insecure men. We're use to it, but good luck with that ideology going into the future.","post_message":"EDWARD S. HERMAN: Hillary Clinton is a neo-liberal and pre-eminent war-monger. I think she is the most dangerous person living in the world today, given her highly likely election victory and her likely performance as president.   Trump is a self-promoting windbag, racist and dangerous, unpredictable phony. We have a ghastly choice in these two. Jill Stein offers a protest opportunity, more so than not voting. On the line that either voting for Stein or not voting would constitute a vote for Trump, one might argue that a vote for Hillary Clinton is a vote for war with Syria and Russia"},{"comment_id":"10153146604638690","commenter_b":"the terrorist girl.","commenter_a":"There is no age for crimes, a criminal is a criminal. You use children to score PR points in the media. These rocks can kill the passenger inside the car.","post_message":""},{"comment_id":"10153816221001336","commenter_b":"It will be a great day for America when this guy is out of office!!!!","commenter_a":"Not so breaking news","post_message":"Breaking News: President Barack Obama has rejected the Keystone XL pipeline.    In a press conference a short time ago, he said, “If Congress was serious about wanting to create jobs, this was not the way to do it.”"},{"comment_id":"10153226681651833","commenter_b":"Thanks Jason - the \"next one\" will probably effect me, though.","commenter_a":"I don't even own an AR, but I sent an e-mail to the ATF \"comments\" site opposing the ban on M855. I also sent e-mails to my congressman and both senators and signed a petition about the same issue. I suspect that the motivation is simply that the government doesn't want those who own ARs to have a source of reasonably priced ammo for their guns. I oppose this mindset.","post_message":"A notice from the Bureau of Alcohol, Tobacco, Firearms, and Explosives (ATF) shows the agency is considering a ban on the popular M855 AR-15 round  by re-categorizing the round as  piercing.  Be sure to contact ATF and let them know you oppose this proposal. Then contact your members of Congress and express your opposition to ATF's ammo ban.  @webpagelink/ #M855"}]
