[{"comment_id":"824413534273149","commenter_b":"She should point those racist fingers back at self!","commenter_a":"Do you really expect anything else from her? I'm not shocked at all. She's an idiot.","post_message":"This speech is shocking... even for her!  What Michelle says at this graduation ceremony will make you cringe!"},{"comment_id":"1339079949456485","commenter_b":"She should eat it","commenter_a":"She should eat it","post_message":"Chip Roulette: Who Will Eat The Carolina Reaper Chip, The World's Spiciest Tortilla Chip, First?"},{"comment_id":"1195945367091729","commenter_b":"Totally unacceptable. They should be arrested. Deport. Send them back to their country. Can u imagine what they would do if we destroyed their Quaran?","commenter_a":"Kick them out of our country now they do not need to be here","post_message":""},{"comment_id":"1769292306444953","commenter_b":"With you in that thought...sad but so true. In jail all his basic needs would be met and even medical. Sad we treat jailbirds better than the homeless.","commenter_a":"Imagine if he'd actually been trying to steal the food so he could go to jail and have a roof over his head and food in his belly. But good on the judge anyways for showing some compassion in a world that is lacking these days.","post_message":"A bit of compassion in the courts can go a long way."},{"comment_id":"10153415193876833","commenter_b":"I no Right, They Don't Want The Public Safe!!!!!! Then the Rioters and Looters would be Looting and Rioting even More and getting away with it as always!!!!","commenter_a":"Does this mean our murder rate will plummet because the gang members won't have guns?","post_message":"The U.S. Seventh Circuit Court of Appeals issued a decision on Monday allowing a Chicago-area gun and magazine ban to stand. Such bans are justifiable, according to the court, merely on the basis that they \"may increase the public's sense of safety.\""},{"comment_id":"10153743944261337","commenter_b":"GO HAWKS! We love you hating little bitches!","commenter_a":"It's okay. Knowing that their jackass coach screwed them out of the Super Bowl last season, it makes it better. Overrated team from Seattle.","post_message":"THEY BLEW IT: The blown call in Monday's Seattle Seahawks -Detroit Lions game inspired some hilarious fan reactions..."},{"comment_id":"10152987685511051","commenter_b":"She is a whore. Why give her a pretty name. The whore was not forced to spread her legs to two guys in the same month? That makes her a big whore.","commenter_a":"The fathers of these twins are no better! I like how everyone always seems to too put blame on the women for her having sex with multiple men but it's take 2 to tango! Men are just as dirty.. It a 2 way street!","post_message":"The judge just made it official: these twin girls have one mom and two different dads."}]
