[{"comment_id":"10155207615341037","commenter_b":"No politics?!?!?! You are not paying attention. 😂😂😂 LOVED it. AND what she stands for....only few understand. Good for her. NASTY WOMEN!!!!!!","commenter_a":"There was a subtle political statement in her opening songs but I felt it was out there to move people together. She was nothing less than I expected. She brought down the house. The show was amazing","post_message":"Did Lady Gaga win the Super Bowl?"},{"comment_id":"10154550859487464","commenter_b":"There are much better health coverage alternatives out there. Feel free to private message me for details.","commenter_a":"We tax payers all got fleeced big time.","post_message":"“The reality is the Affordable Care Act is no longer affordable for increasing numbers of people.”  #FullRepeal: @webpagelink"},{"comment_id":"923822694380650","commenter_b":"@username, Hillary is not a good choice for president. I'll take Bernie Sanders!","commenter_a":"How pathetic is this woman??? EVERYTHING she does has an ULTERIOR motive....EVERY word is calculated......she is not genuine in the least bit.....","post_message":"Hillary Clinton will soon meet this history-making couple."},{"comment_id":"1857318871171795","commenter_b":"DRAIN THE SWAMP!! TRUMP/ PENCE 2016","commenter_a":"Thank you for making this so much easier to understand and for opening eyes as to what is really at stake!","post_message":"Clinton pay for play speeches. Understanding how it all works, and who gets paid for what -- all the favors --- and why she wants so many refugees.  Please watch and share.  If you are new to DML please give him a LIKE.  You won't regret it."},{"comment_id":"10154809751863812","commenter_b":"Yup I'm buying it! Vanessa Duarte I found our house lol","commenter_a":"@username buy it","post_message":"The 3-bedroom property, located in Bracknell, Berkshire, served as the home where Harry Potter grew up with the Dursleys in the movies."},{"comment_id":"1244912678938315","commenter_b":"... Hillary Clinton for 2016 ...","commenter_a":"A terrorist killed your son. A terrorist the FBI removed from the watch list.Sorry for your loss, it must be devastating but Obama and Hillary wants more terrorists to come here.","post_message":"\"Christopher's paternal grandparents met and fell in love in a Japanese internment camp, so it was in in DNA that love always trumps hate.\"  - Christine Leinonen remembers her son Christopher, who was killed in the shooting at Pulse Nightclub in Orlando  Watch as the DNC took on the gun lobby: @webpagelink"},{"comment_id":"10152911551916051","commenter_b":"Thats a Black Ass Dumb Bitch... Fry the Bitch.","commenter_a":"She needs a bullet. I hope they get that poor little the home and help he needs. This makes my stomach hurt","post_message":"This woman was embarrassed by her 9-year-old son’s disability – so she decided to torture him."}]
