[{"comment_id":"880219112013511","commenter_b":"Try her for what. This is America. Take your laws and get the hell out of America.","commenter_a":"And the Democrats agree... I am sure..","post_message":"Not in America!"},{"comment_id":"1863352450575527","commenter_b":"She's a nasty which!!! I really felt sorry for Joy she was totally rude to her and had the look of revenge in her eyes toward Joy she should be ashame!!!!=","commenter_a":"Omarosa achieved \"fame\" by being nasty. She is perfect for Trump. She was a disgrace with her last comment to Joy. She literally gave me the chills. I was concerned about Joy's health (and mine) - Omarosa was so vile and consistently lied. She (along with Trump and his Trumpettes) could give good, caring people a stroke!","post_message":"It wasn't pretty."},{"comment_id":"10155164817270093","commenter_b":"Hilarious. And I can't even fault people for mistaking it as serious because that IS how absurd feminists sound most of the time.","commenter_a":"Good one!","post_message":"Talking about mansplaining, manspreading and manslamming is not enough. We also must fight against manterrogating, manpacking, mansulting, and bropen-mouth chewing!"},{"comment_id":"10153608463849440","commenter_b":"You are so uneducated, illiterate and pathetic. Worthless. Parasite. A rodent of no worth or accomplishment.Stop #WhiteGenocide 14/88","commenter_a":"Colorado is the epicenter of #WhiteGenocide and the GOP here is allowing it because they're afraid of calling Amy E. Brown and her #Blacklivesmatter5280 terrorist friends out.","post_message":"Editorial: Colorado Republicans made a big mistake in abandoning the 2016 presidential caucus."},{"comment_id":"10153237032465329","commenter_b":"Hahahahaja prateado, claro!!!","commenter_a":"@username Vou comprar o prateado. Gosto dos classicos. Qual vai ser o seu? kkkkkkkkkkkkkkk","post_message":"Updating."},{"comment_id":"10153823695146336","commenter_b":"FORGIVE HER AS GOD FORGIVES YOU....PUNISH HER IN OTHER WAYS..NO CELL PHONE..NO XBOX. ..NO TV IN HER ROOM..NO COMPUTER IN HER ROOM (ONLY FOR HOMEWORK OVERSEEN BY YOU)","commenter_a":"It's called tough love. That's what children need","post_message":"Would you cancel Christmas to punish your child for stealing?"},{"comment_id":"1232217873516420","commenter_b":"Female dog","commenter_a":"Convicted felon","post_message":"I want to see what you all come up with... Describe Hillary in just two words... Ready, set, go!"}]
