[{"comment_id":"603575639802390","commenter_b":"Dumb bitch but I completely understand there decision to shoot the Silverback.","commenter_a":"If you are such a negligent parent that you allow your 4 year old child to fall into the pen of a wild animal, you should have to descend into the pen yourself and fight the animal with your bare hands to show society that you are still fit to be a parent.","post_message":"The zoo's decision to kill a 17-year-old, critically endangered gorilla after a 4-year-old boy fell into the animal's habitat has sparked outrage."},{"comment_id":"10154019579790530","commenter_b":"Boot him out immediately! !!","commenter_a":"Tick uh errr.....Rick Snyder has a net worth of $200 million!! I think HE needs to bust his wallet out and help flint. There's no initiative in this case, we all know the pipes need replacing. So do it!! Might as well start because it's going to be a long process.","post_message":"The board unanimously approved a petition stemming from Gov. Snyder’s authorization to move the office dealing with struggling schools..."},{"comment_id":"10152574199456636","commenter_b":"Why are the females removed!","commenter_a":"After a half century of thinking / rethinking - my conclusion is that \"The Matured Feminine Approach\" (regardless the physical gender) is the today's hope for more cooperation, understanding,compassion and responsibility in the World! We need to educate and appreciate much women - especially for top leader purposes. Male thinking leaders are afraid of rivals and to lose domination","post_message":"After an ultra-orthodox Jewish newspaper removed all the female world leaders from the Paris march images..."},{"comment_id":"558942897646607","commenter_b":"If killery wins we WILL NOT HAVE A COUNTRY! !! ...NWO...WILL SUCK!!!!","commenter_a":"@username, Hermain Cain is a staunch supporter of the Second Amendment!","post_message":"Live Now: Donald J. Trump's running mate Mike Pence addresses supporters at a rally in Atlanta, Georgia."},{"comment_id":"10154985023891192","commenter_b":"Because life on Earth is the only life we can observe and study, so it makes sense to look for other life within the scope of life as we know it. How could we even begin to look for other forms of life if we don't have a clue what to look for?","commenter_a":"I really don't understand the definition of \"alien life\" and why scientists think the environment needs to be remotely similar to ours to support \"life\". HUMANS need the right temperature and water.... \"aliens\" may not....??!","post_message":"BREAKING"},{"comment_id":"1106079576120034","commenter_b":"Islam believe in cuting off heads and raping children.","commenter_a":"Ali didn't want to because it was supposedly against his religion, Islam! Not a good reason. He could have served as. Medic or in other capacities .He was not a hero. He was just an ordinary man but a good fighter . Let's not glorify him.","post_message":"\"The headlines may call him a hero for dodging the draft. But common sense calls him a hypocrite.\""},{"comment_id":"10153235422567994","commenter_b":"Hahahaha mathieu blocked me awe","commenter_a":"Who are these people with nothing better to do than just constantly complain about everything being racist? My God shut up.","post_message":"It's a bank robbery for Skittles. Is it a student video gone wrong?"}]
