[{"comment_id":"10153562923228132","commenter_b":"Please go up and down the beach and tell all of those women to put turtle necks on. I'm sick of seeing all of those boobs hanging out. And while we're at it, low cut shirts too. And tank tops (side boob). Stop being a hypocritical idiot.","commenter_a":"She could show a little modesty! Not everybody wants to see boobs hanging out! We used to be more modest, it's called showing a little class!","post_message":"\"I was really very hurt by this act, because I was in no way bothering him, so what gave him the right to shame me?\""},{"comment_id":"474511766072737","commenter_b":"Can't do that until you remove the Muslim president who encourages them to take over.","commenter_a":"we need to take our Country back. We outnumber them let stop the insanity. Dont let any mosks be built in this country. We cant build Churches in theirs. If they dont like it here than leave. No one would care.","post_message":"Muslims force this school to ban Christian holidays.  America is under attack, this is treasonous.  'LIKE' if banning Easter is WRONG!"},{"comment_id":"10153197747769094","commenter_b":"He doesn't shoot them for 30+ seconds.... You have to go out of your way to watch it.","commenter_a":"I made the mistake of watching the video from the shooter as he committed these awful murders. I wish I could take back watching that.","post_message":"Video of the fatal Virginia shootings shocked users of Twitter and Facebook when the “autoplay” function showed them what they didn’t want to see. @webpagelink"},{"comment_id":"10154156847317623","commenter_b":"This has got to be the dumbest comment I've heard in a while. You and the Cash Me Ousside chick should go hang out and play in traffic.","commenter_a":"Who puts a three month old into daycare??? Mom is so concerned etc. But that three month old needs his/her parents not daycare workers anyway. Plus no charges should be filed if daycare was not made aware of the lactose intolerance. Sounds like a lil neglect on both sides of this. Plus whoever took the video should have stopped this from even happening. This worker although breaking the rules was trying to help out a baby who is clearly already in duress when the parents should be the one taking care of them at such young age. I can almost bet that mother is more mad she had to take her kid to the hospital and missed out of her drinking time and watching tv time. Thats just my opinion!","post_message":"A North Carolina mom says a day care worker breastfed her 3-month-old son and made him sick."},{"comment_id":"10153228353231336","commenter_b":"Hawraa is unaware of the meaning of the word AND. Grow up little girl.","commenter_a":"This is dead on right...but the morons and libs will be outraged!!! If you can't handle the truth","post_message":"“It is the behavior of individual human beings, not big daddy government that leads to success.” — Bill O'Reilly  WATCH Monday's Talking Points Memo and weigh in: @webpagelink"},{"comment_id":"509489615909884","commenter_b":"No She is a pig.","commenter_a":"She is also a jackass","post_message":"Canada: Muslim Conservative who decried party's Islamophobia is really a Liberal"},{"comment_id":"10153843965931336","commenter_b":"Great va is screwed bc dc is so close no refugees should be allowed period","commenter_a":"Wow, it was 24 a few hours back. Looks like a rebellion.","post_message":"LATEST: 30 U.S. governors are now opposing or refusing to allow Syrian refugees into their states. @webpagelink"}]
