[{"comment_id":"10154660299872501","commenter_b":"She can work anywhere in these United States.","commenter_a":"So she can be a lawyer not a judge cool.","post_message":"We reached out to Angela Stokes today to ask about her future legal plans. If she responds, we'll add her comments to the story."},{"comment_id":"10153308747171037","commenter_b":"Failing to report 1,100 donations and $145 million in donations isn't sinister. It's just a small bookkeeping error. This is how totally out of touch this moron and his wife are.","commenter_a":"And, I did not have sexual relations with that lady, Miss Lewinski.","post_message":"Former President Bill Clinton used his first interview since Hillary Clinton announced her 2016 campaign to address questions about the Clinton Foundation - by Dylan Stableford in Yahoo Politics."},{"comment_id":"619582968232282","commenter_b":"She has to go","commenter_a":"Yea","post_message":"Michelle was just caught red handed and is about to be charged with treason.  Good. It's about time she was exposed.  Do you agree Michelle Obama does not belong in the White House?"},{"comment_id":"1005311662842639","commenter_b":"I would have kicked her in her taco real good!","commenter_a":"Damn what a sicko.","post_message":"This nun decided that students needed a hardcore lesson in Jesus' suffering -- so she stabbed a kid in the forearm."},{"comment_id":"489295787927668","commenter_b":"screw her","commenter_a":"first explain what 20,000 likes will accomplish ......","post_message":"Hillary Clinton is attempting to make it punishable by law to criticize Islam.  She just crossed the line. We can put a stop to this, let's end this right now.  Can we get 20,000 'LIKES' for freedom of speech?"},{"comment_id":"10154261503546770","commenter_b":"Hollywood is full of whores!","commenter_a":"Omg. It's just a dress! Didn't your mothers teach you that if you don't have anything nice to say, don't say anything at all!!! Looks like you could all use a lesson in kindness!!","post_message":"Holy moly, Jennifer Aniston."},{"comment_id":"1790041197906165","commenter_b":"She should behead you #deplorable","commenter_a":"Hillary could behead a school bus full of children on national TV and she wouldn't get arrested.","post_message":"\"Based on our review, we have not changed our conclusions that we expressed in July with respect to Secretary Clinton,\" FBI Director James Comey wrote."}]
