[{"comment_id":"10152982438537217","commenter_b":"Hooray! Now show me the first 4 corpses of native Indians killed by the illegal immigrants from Eng And.","commenter_a":"Bet the Native Americans are over the moon about this! #genocide","post_message":"They were four of the first English men to colonise America"},{"comment_id":"1537396076280417","commenter_b":"I would just ignore them all. Not worth stressing over. Continue on with remaining diplomatic and professional.","commenter_a":"If you support Yazidi Sex slaves, Vote Hillary. If you support crucifying Christians, Vote Hillary. If you support stealing relief funds from Haitians, Vote Hillary. If you support calling black people super predators, Vote Hillary. If you support foreign nations calling the shots in America, Vote Hillary. If you support free passes to the Rich and powerful and \"justice\" for the rest of us, Vote Hillary. If you love Wall Street, Vote Hillary. If you think arming Islamic Terrorists is a jolly idea, Vote Hillary. If you think going to war in Iraq was grand, Vote Hillary. If you'd love to have Islamic Terrorists \"Refugees\" in your backyard, Vote Hillary. If you support Drug Cartels, Vote Hillary. If you think women should have no rights accept in the US of course, Vote Hillary. If you like High Taxes, Vote Hillary. If you'd rather have the cops outline your dead body ...","post_message":"The document focuses attention on talks about which parts of Clinton's emails should have been be marked classified before release to the public."},{"comment_id":"10153272091283271","commenter_b":"lol. And the elephants will inherit the earth and as the most intelligent animal.","commenter_a":"This is why the aliens won't talk to us","post_message":"Kentucky clerk Kim Davis is free as of Tuesday. Former Arkansas Gov. Mike Huckabee stood alongside Davis outside the jail, calling her \"incredibly brave.\" Hear her words in the video. What's next for her career? ---> @webpagelink"},{"comment_id":"1097784373632154","commenter_b":"He always stands up... Except for when it's time to bend over for Trump.","commenter_a":"I have never stopped liking Cruz...He always stands up for what he believe in...Sometimes that puts him at odds with other Republicans.","post_message":"Excellent question..."},{"comment_id":"1801266436786153","commenter_b":"Ungrateful bitch what an embarrassment for her team disrespectful I throw her off the team","commenter_a":"Yes","post_message":"Do you think she should be KICKED OUT of the Olympics??"},{"comment_id":"10153321569596615","commenter_b":"The mask is part of hiding from an insecure woman so she can never find me again.","commenter_a":"Insecure women ruin more lives than drugs.","post_message":"\"Some people are commenting that she must be insecure or something, but it’s quite the opposite. People tell us we have the best marriage they’ve ever seen.\""},{"comment_id":"10155170466528984","commenter_b":"Hire American instead of illegals","commenter_a":"COWARDICE","post_message":"This just in..."}]
