[{"comment_id":"10152698391808717","commenter_b":"She's no Zumba instructor but she's not","commenter_a":"She's a hottie","post_message":"Claremont police say two people face charges after selling cocaine, crack cocaine and heroin in a school zone. @webpagelink"},{"comment_id":"1089823474413307","commenter_b":"Rhonda, your ignorance of reality is amazing!","commenter_a":"This administration MUST GO, PERIOD. Why is O allowed to take actions that have harmed this country in the eyes of the world???","post_message":"Yesterday, the Pentagon announced that the Russians could be told the location of our ground Special Operations troops in Syria, so that their Russian Air Force avoids them. This is a grave mistake. Once again, the President's administration demonstrates their inability to lead as Commander-in-Chief. Because he does not have an effective strategy for defeating ISIL/ISIS, he is putting troops on the ground without the protection of our air forces and asking the Russians, politely, to not bomb them. For over 50 years, our air forces have ensured no member of the American military has been killed by an enemy airstrike. I hope the Administration’s poor decision-making does not change this fact.  @webpagelink"},{"comment_id":"10153854981326509","commenter_b":"No mardi, flo is absolutely correct. There's no mass influx of Mexicans if that fence comes down. They can already cross the border with very little paperwork anyhow. Your fears are quite blown out of proportion.","commenter_a":"Highly dislike this man. He's everything America doesn't stand for.","post_message":"To quote the businessman himself, Donald J. Trump seems to be a \"very rich\" man. @webpagelink"},{"comment_id":"10153195806687217","commenter_b":"Thats the day nearly over! They're normal human beings like the rest of us, go to bed earlier! !!","commenter_a":"Yes, specially for night creatures like me ,actually 7-12 pm would be better (It's a fact that your brain is more active at night)","post_message":"Yawn! Should teenagers be allowed to start school at 1.30 pm?"},{"comment_id":"10154655715146037","commenter_b":"@username many!!! What parents dress their little girls like a sex queen? Um, JonBenet's and other child beauty pageant moms- $$$, attention, fame....","commenter_a":"I am inclined to believe the story to be true. There are just too many claims against Michael not to take them seriously. Not to undermine the victims, but the thing that I really can't grasp my head around is why the parents of all of these children that Michael victimized allowed their kids not only to sleep over at a grown man's home, but also to sleep in bed with that grown man?! This makes no sense to me and the parents of these kids should be held accountable for their actions.","post_message":"When he \"began showing signs of puberty,\" Jackson was allegedly \"no longer as interested in him sexually.\""},{"comment_id":"10154274724531320","commenter_b":"Let us see the lady you're talking to.","commenter_a":"Where is Greg?","post_message":"Good Day After Show!"},{"comment_id":"10154882133170329","commenter_b":"Really people! No arguments please","commenter_a":"The correct term is Native American.","post_message":"\"I realized that half the world made such an effort to get what I am naturally blessed with.”"}]
