[{"comment_id":"10152892067227144","commenter_b":"Far more competent and capable than anyone out there on either side!","commenter_a":"If she is the best we dems can do, we are in bad shape.","post_message":"The time has come."},{"comment_id":"895085380544226","commenter_b":"she shouldn't be driving on suspended license and the police where doing there jobs","commenter_a":"go back to where you blong","post_message":"(Video) If she wins, it will place Sharia law above our own and above the safety of police officers.  It wouldn't be the first time this part of Michigan has seen Sharia law placed above the law of the land....  @webpagelink"},{"comment_id":"1159718984066336","commenter_b":"Hang that ugly devil.","commenter_a":"go figure","post_message":"Disgusting."},{"comment_id":"577516445785152","commenter_b":"Sarasota canceled the witch!","commenter_a":"The pumkins look just like trumps he ad. Lol","post_message":"WATCH LIVE: Hillary Clinton continues to campaign in Florida, where she leads Donald Trump 45% to 44%, according to an NBC/WSJ/Marist poll reported by FOX News.  This morning, she's at the New Mt. Olive Baptist Church in Ft. Lauderdale."},{"comment_id":"10153352503921051","commenter_b":"Ha ha bitch","commenter_a":"Don't see a problem with this. Fl. Courts finally got it right","post_message":"The Hello Kitty Rapist, a horrible man whose crimes included sexually assaulting multiple women and attacking a war veteran, just learned his fate."},{"comment_id":"10150622928829999","commenter_b":"She needs to go and work with Al Dunlap. They both do jobs that no one else has the guts to.","commenter_a":"Joe Jack","post_message":"Ellen Pao is resigning from reddit after a week of ceaseless criticism from angry users."},{"comment_id":"10154422434652490","commenter_b":"All \"journalists\"","commenter_a":"Military Times journalists are all DEMOCRATS. They lean left. I stopped subscribing to their rag years ago- I got nauseous every time I read it. Here's to hoping they file for bankruptcy during the Trump administration.","post_message":""}]
