[{"comment_id":"1393104724052131","commenter_b":"@username - Woman you should stop watching Fox!!","commenter_a":"This is so stupid. History will show that President Obama is one of our best presidents and also one of my most maligned president for no other reason for the color of his skin . He is one of our most educated presidents, he is also one of our most Christian presidents who didn't have to say he was Christian because he's lived it by being a faithful husband a wonderful father and a patient man who has reached across the aisle and had his hand slapped over and over and over again by hateful Republicans who put party before their duty as servants of this country . He without any help from the Republicans have brought us back from financial ruin that was left by the last Republican president given millions healthcare and under his leadership on military has killed those perpetrated 911 and killed hundreds of Isys and ...","post_message":"A Louisiana newspaper sent a very strong message to President Obama today. Do you agree with the paper on this?"},{"comment_id":"605402049616235","commenter_b":"@username AMEN! She's just a stupid troll!!!","commenter_a":"He was probably drunk while being on the snowmobile. It will take more than duct tape to shut his wife's mouth.","post_message":"\"Knowing Todd, once he's cognizant, he'll probably ask docs to duct tape him up and he'll call it good. He's tough,\" Sarah Palin said."},{"comment_id":"1094669133962671","commenter_b":"Well folks that's more reason that woman will never be president","commenter_a":"Alright, That's it!","post_message":"JUST IN"},{"comment_id":"10153888153653352","commenter_b":"You said it all...Thank you!","commenter_a":"I feel she should have been fired.... possibly fined. Holding her in jail until she changes her mind is a waste of tax dollars and time.... yes this woman stood up for what she believed but she still had a job to do .... not only did she refuse to issue same sex marriage license but she didn't allow the people under her who were willing to issue them either.... that is wrong..... this woman used her title and athority and held an entire government staff to her religious beliefs ... she didn't have to issue them she could have let someone else do that and still be faithful to God's law.... this country was built on freedom of religion. That means no law can be withheld or upheld based on religious beliefs.... she made an oath to follow the laws of the US , as soon as the laws ...","post_message":"Defiant Court Clerk, Kim Davis, Will Be Held In Jail Until She Agrees To Issue Same-Sex Marriage Licenses!   CHRISTIANS WHAT IS YOUR REACTION?"},{"comment_id":"1248101021932790","commenter_b":"ALL CiTIZENS in this country have ID, ALL of them. so STFU about ID laws, only the corrupt want them","commenter_a":"Only clueless and the corrupt don't want voter id laws, REAL citizens WANT them as they stop the DEAD, non citizens and people voting multiple times. All of which are the exclusive territory of the left and the Dems.","post_message":"Dem Strategist Blames Hillary's Wisconsin Loss on Voter ID Laws [VIDEO]"},{"comment_id":"10154734635153797","commenter_b":"I can't believe this! That's why having your ccw's is so important. I will not leave without my .22, might not kill you, but it could save my life. Idk how the laws are there but here in Ohio, especially in Cleveland where I'm from. You need to be carrying. I would've helped her in a heartbeat. No questions asked. Then criminals would think twice, if we all start defending ourselves.","commenter_a":"I'm so mad right now not only at the whole situation but nobody had the compassion to help her I'm thinking of that was my Mother, sister auntie etc... praying..","post_message":"CTA VICTIM ID'D: The woman who was stabbed repeatedly on a crowded Red Line train Thursday afternoon has been identified as 25-year-old Jessica Hampton."},{"comment_id":"805029612967642","commenter_b":"She knew and never said anything?? She's should be locked up smh","commenter_a":"So if she knew he scouted both places why didn't she report him?","post_message":"The gunman's wife said that he scouted both Pulse, the nightclub where the mass shooting took place, and Downtown Disney, recently renamed Disney Springs."}]
