[{"comment_id":"10156327027695389","commenter_b":"Cuff the lying witch already.","commenter_a":"Sounds like a recommendation for an Indictment may be in the new future. If the DOJ rejects it.....Will their be alot of resignations from the FBI??","post_message":""},{"comment_id":"934918126557241","commenter_b":"Why dont you vote for Hillary then? She cant say two words without lying her ass off. But I bet everyone who commented will be there to vote for her. Thats why Donald is SELF FUNDED. Doesnt take money from soros or rockefeller. Thats why the media hates him and all of you do as well. Obama has already said that muslim refugees will go in a database. But when Trump says it hes a racist bigot. Obama used different \"words\" and its totally different . When really its not. Its the same and Im not argueing . I hope you will all be happy when your next LIAR is elected. Thats why grandkids wont enjoy America as you did. Thanks dickheads.","commenter_a":"The dude tells the truth. Regardless noone else has rhe balls to speak the truth anymore","post_message":"The call took place right around the time Donald Trump announced his intention to bar Muslims immigrants from entering the U.S."},{"comment_id":"1728663384083911","commenter_b":"They can stick it!!","commenter_a":"No, no, hell no! If if offends them, just stay away!!","post_message":"Liberals Want To Ban The Most Iconic 9/11 Picture From Museum.  There is no reason on earth why it should be banned.  Can we get 30,000 'LIKES' to keep this picture in the Museum?"},{"comment_id":"10153542250533812","commenter_b":"Chriss if you lease a car. Can anybody come in that vehicle and disrespect you. Chriss you happened to get a job that you get assigned a vehicle can anybody come tell you what and how. You're a smart man. You might get a job that requires you to move out of the state or even the country. That job comes with all expenses paid for four years including the house and the car. You tell me who can come in there and disrespect you. Not even the ceo or cfo of that company can do that without proper protocol. You had to move your family. And your doing your best job. Think about that chriss. YOUR A SMART INTELLIGENT MAN","commenter_a":"Pres. Obama. It is America's house we only let you borrow it for a little bit! Respect all people as you desire to be respected. You are in my house and every legal Americans house. Not that they were right but you are wrong!","post_message":"WATCH: Pres. Obama normally lets hecklers speak, but this time, he put his foot down: \"OK, you know what? No, no, no...\""},{"comment_id":"10153355238128984","commenter_b":"They love talking about themselves. Bunch of dumb thugs. God make them go back under the rocks they crawled out of.","commenter_a":"A is A. (Aristotle)","post_message":"Both Obama and Baltimore's mayor have called the rioters by a one-word name that has generated controversy..."},{"comment_id":"10152726918051051","commenter_b":"She should really be charged with Involuntary Manslaughter...","commenter_a":"Some people should have no children Stupid ass how can she do that","post_message":"This woman left her 2 small kids alone to get her hair done. When she returned, there were firefighters everywhere."},{"comment_id":"10155549473141729","commenter_b":"She's a deranged scumbag","commenter_a":"You have to feel for this poor delusional \"woman\". Her whole way of life is disintegrating & she needs to complain as loudly as possible so people actually hear her. Soon her dementia will kick in full blast & she will be confined to a nursing home. I can only hope she doesn't suffer. It's just too bad her legacy will be one of HATE & DIVISION !!!","post_message":"Whadd'ya think?"}]
