[{"comment_id":"10152890902061336","commenter_b":"Immigrants must obey the law...review history.","commenter_a":"What's wrong conservatives are these immigrants too brown for you?","post_message":"Mexico is now issuing birth certificates at its U.S. consulates so illegal immigrants can avoid deportation."},{"comment_id":"1080901341949487","commenter_b":"She let them die","commenter_a":"Donald Trump for President 2016! Make America great again and will work for FREE!","post_message":" Obama administration and Clinton officials hid this compelling Benghazi email for years, said Judicial Watch President Tom Fitton.   The email makes readily apparent that the military was prepared to launch immediate assistance. The fact that the Obama administration withheld this email for so long only worsens the scandal of Benghazi. Please SHARE!"},{"comment_id":"1306220052736740","commenter_b":"Trump has everything a person could want so he just wants to pay American back!! Hilary tried to steal furniture from the white house the first time around","commenter_a":"Hillary should be in prison! Treason and lying are her crimes. Benghazi will never be forgotten as she turned a deaf ear to our own and did absolutely nothing! Trump in 2016! 🇺🇸🇺🇸🇺🇸","post_message":"As of now, Donald Trump and Hillary Clinton appear headed for a showdown in November. Who gets your vote in this matchup: Trump or Clinton?  LIKE Opposing Views for more breaking news and analysis!"},{"comment_id":"1078464325543429","commenter_b":"@username , no not dictating whatsoever. She can spend as much as she wants; I won't vote for her.","commenter_a":"You're spending so much personal time with this little girl. Are her parents campaign contributors?","post_message":"I’ll do everything I can to make sure that DREAMers like Karla never have to worry about being separated from their parents."},{"comment_id":"1619415335012246","commenter_b":"Who do they think they are that they can come over to our country and try to change it? When they come here they have to obey our laws! This is our country not there we were to go to their countwe would have to obey their laws!","commenter_a":"Love the US & abide by our beliefs & the law of our land. Under God we trust & our constitution. Or GET OUT period.","post_message":"Here response is sickening.  These radicals must be stopped."},{"comment_id":"1495765340483209","commenter_b":"Wow ease up on the drugs girl, you're delusional.","commenter_a":"Hillary, is the only sane choice. Trump is the village idiot. Daily mail must be endorsing trump. Plus, what's wrong with being short?!!","post_message":"She hasn't got her way...and she won't get commercial breaks for coughing fits or fainting spells"},{"comment_id":"10153397569465950","commenter_b":"Girl power!! I'm sure he deserved it.","commenter_a":"So. The boy must have said it done something very intimidating to push get to this point don't have think?","post_message":"The viral video of a high school lunch fight shows a girl throwing a boy to the ground. At one point someone tries holding her back, but then she breaks free and knees the boy in the face before running away."}]
