[{"comment_id":"10153747990651178","commenter_b":"He right she butt ugly","commenter_a":"Trump all the way.","post_message":"Which corner are you in? Fiorina or Trump?"},{"comment_id":"10153552105389087","commenter_b":"What an undemocratic woman.","commenter_a":"I can't stand her. She had no ideas other than the ones she stole from Sanders.","post_message":"Jeff Johnson, the head of the Washington State Labor Council, was scheduled to speak in at a pro-Bernie Sanders rally, but a pro-Hillary Clinton union affiliated with AFL-CIO threatened to take away funding from Johnson's group if he spoke at the event, forcing him to back out."},{"comment_id":"10153288794126336","commenter_b":"we do love blonde women with breast enhancements and tight dresses , you nasty girl","commenter_a":"on fox news war on women","post_message":"Memorial Day originally honored soldiers from which American war?  How well do you know your #MemorialDay history? Take this quiz with FOX & Friends Weekend! #ProudAmerican"},{"comment_id":"10153464006023132","commenter_b":"IAN!!!!! Noooooo!!! We had plans to run away! Well, I did anyway! Oh well, Nikki rocks so that's cool!!!","commenter_a":"@username @username I am so sorry to hear of your loss!!! ;-)","post_message":"Nikki Reed and Ian Somerhalder aren't the only ones."},{"comment_id":"601311203355417","commenter_b":"What a dumb bitch","commenter_a":"I know lets get someone to shoot at her then we can see if she is right","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s.  This is the most ridiculous thing I've ever heard.  Are you offended by this?"},{"comment_id":"1239279662765353","commenter_b":"Judi you are correct about Obama, good for you.","commenter_a":"These little things they bring out about Ben Carson are all they can find. It's all they've got! They've got nothin'!","post_message":"#BenCarson should ask the media:  Where are Obama's grades and transcripts? And who checked out the lies in his autobiography?"},{"comment_id":"10153120614663203","commenter_b":"Women have degraded themselves to unbelievable depths. How sad, how very very very sad.","commenter_a":"This movie distorts how Love is supposed to be expressed. Women deserve better than to be chained and beaten.","post_message":"Say no to porn. Boycott 50 Shades of Grey, the movie: sign the petition"}]
