[{"comment_id":"1080674971953513","commenter_b":"And then she has an ungrateful kid... Lol","commenter_a":"How do they even survive that? Oh the pain! I hope they are able to get epidurals.. 😉","post_message":"The egg is so large that in the last few days before laying it there is no space left inside the mother for food. She is forced to fast."},{"comment_id":"998307626859113","commenter_b":"Sorry pussy","commenter_a":"Not Donald we like Donald we don't like pushy billionaires","post_message":"A billionaire Saudi Prince makes an offensive demand of Trump, then Trump FIRED BACK!!"},{"comment_id":"10152852200292014","commenter_b":"Dylan Crane its not domestic terrorism its a hate crime. He killed them because they were black. He didn't kill them for political or even religious reasons. So uh oh your ignorance is showing. ...","commenter_a":"Let's see he's not muslim, black, mexican, or asian so that means this will get written off as a guy with a troubled childhood and mental issues like always and quickly swept under the rug and no \"terrorist\" or \"thug\" label given.","post_message":"Dylann Roof, the suspected of fatally shooting nine people at Emanuel AME Church last night has been arrested."},{"comment_id":"10153505225891615","commenter_b":"These two are animals !!!!","commenter_a":"From that shiner, I wonder if our esteemed and trusted servants might have exacted a little street justice... Nah - THATS ILLEGAL!!!!!","post_message":"Shocking testimony reveals new details about the Uniontown toddler who was only 10 lbs at the time of her death. WPXI Cara Sapida is in court right now.   TONIGHT AT 5: Cara shares the disturbing testimony from an ER doctor and state trooper about the day little Lydia died."},{"comment_id":"536259236580093","commenter_b":"STAY OUT OF OUR ELECTION!!!","commenter_a":"He is AFRAID VERY AFRAID !!","post_message":"What does this tell you?"},{"comment_id":"1025129017543627","commenter_b":"Preoccupied? Can women still vote? $$ facebook doesn't want you to see this $$ As long as America's richest 1%, who now possess 70% of the wealth and don't bother to vote, have the Senators in their pockets the United States Government isn't representing the will of the people, it's the 1% that's running the show. I stand with Bernie Sanders, \"We're governed by an Oligarchy.\" The number of Americans living in poverty will continue to grow while the middle class will continue to shrink and working women will continue to enrich the wealthiest 1% for the next 20 years easily! (Able to afford the best and brightest, Hillary is a great political actor with a well rehearsed script.) Hillary Will make another Fortune!","commenter_a":"VOTEHfor both of US","post_message":"Women deserve access to the health care they need—without interference, intimidation, or violence. #StandWithPP -H"},{"comment_id":"926192544193565","commenter_b":"TO BAD THEY HAVE TO CHANT THAT!!! IF LEGAL SYSTEM HAD DONE THEIR JOB,SHE WOULD ALREADY BE IN ORANGE!!!!!!!!!!","commenter_a":"Apparently Kate Bolduan is the only one left that dosen't know what is PAINFULLY OBVIOUS...\"Slick Willie\" either bought out Lorett Lynch or threatened her with death in that plane meeting and Obama threatened Comey with his job and political future...Her problem is that she thinks we're all as dumb as her...smh","post_message":"CNN anchor Kate Bolduan whined about the \"lock her up\" chants directed at Hillary Clinton during the Republican National Convention on Wednesday while expressing doubt that it was the right \"message.\""}]
