[{"comment_id":"10153188400898352","commenter_b":"Do u.not care bout the girl","commenter_a":"Devil dogs","post_message":"Erin Ingram who lost an arm aged 8 in pitbull attack awarded $72M by jury"},{"comment_id":"10154729418265530","commenter_b":"Shut ur mouth Ried,!","commenter_a":"I guess in political land , it's against the law to investigate corruption and scandals to someone who broke the law , but can't be investigated because it may hinder the election ?? Lots and lots of question marks here ?????????","post_message":"\"Through your partisan actions, you may have broken the law,\" Harry Reid tells FBI Director James Comey: @webpagelink"},{"comment_id":"10154655790571101","commenter_b":"We will see the illegals go!","commenter_a":"But he promised the morons a yuge wall and told them the Mexicans would pay for it.","post_message":"\"These are dreamers who are seeking the American Dream, and we should embrace them rather than do a bait-and-switch.\""},{"comment_id":"10154406866831037","commenter_b":"give me back the days of stong America when it was \"sticks and stones that brake your bones and (words) can never hurt me\" !!","commenter_a":"Weren't people just mad because people get \"artistically enhanced\" to be skinnier than normal? Perhaps they should pick a side an stick to it.","post_message":"Disney's new movie has already sent the internet into a rage."},{"comment_id":"828484970520259","commenter_b":"What a stupid cow.","commenter_a":"A new low for commiecrats? Not so! The depths of their depravity know no bounds.","post_message":"A perfect example of the difference between Democrats and Republicans.  This is how they treat allies:"},{"comment_id":"10153521877313822","commenter_b":"That skank!","commenter_a":"She has an incredible voice.","post_message":"JUST IN: The NFL announces that Lady Gaga will perform the National Anthem at Super Bowl 50.    SUPER BOWL COVERAGE: @webpagelink  What do you think of the choice?   (Gareth Cattermole/ Getty Images)"},{"comment_id":"10152706974886717","commenter_b":"As an Australian, observing from afar, ALL your possible candidates are hypocrites and troubling. In a perfect world, Bernie Sanders would be President and the GOP and the Tea Party would have melted into oblivion. However, it's NOT a perfect world, and I'm a realist. Even the darling of the left, Elizabeth Warren, is an avid supporter of Israel, whilst allowing the continued persecution of the Palestinian people. Politics isn't about the best possible person: it's about the least worst. Hillary Clinton is the least worst by a country mile. We know where she stands. We know how she thinks. We know how she works. We know she's a fierce supporter of women's rights. We know she's learnt a lot of painful lessons from her time as first lady, Senator for NY, and as Secretary of State. I also believe that she's learnt from these mistakes to make herself a ...","commenter_a":"Doesn't mean she should be president. we need to stop being single issue voters and look at the whole picture.","post_message":""}]
