[{"comment_id":"10153325885524087","commenter_b":"Such an ignorant cow!","commenter_a":"Hideous hag.","post_message":"“They can wait if they like until next November for the actual balloting, but Donald J. Trump   was elected president tonight.” Ann Coulter tweeted."},{"comment_id":"1031698180201852","commenter_b":"why did this piece of shit get a job on T V anyway ??????? tampons for ear rings that is one sick hoe !!!!!!!!!!!!!!!!!!!!!","commenter_a":"Good","post_message":"\"While MSNBC may believe that I am worthless, I know better.\""},{"comment_id":"10153754963576636","commenter_b":"oh god im sick of seeing this the vote has been and gone in favour of leave just bloody get over it ,and out of the 2 mil that have signed how many are actually british,didn't know this was a world wide petition","commenter_a":"Keep politics out of music.","post_message":"The petition is unprecedentedly popular"},{"comment_id":"10153557846293984","commenter_b":"just leave her alone!","commenter_a":"For gosh sake's, get a life!","post_message":"Wow, just when you thought people forgot about Paula Deen's problems, this shocking photograph surfaces..."},{"comment_id":"10155862004711038","commenter_b":"That is impossible. Teenage girls take up the entire bathroom so you can't share it with them.","commenter_a":"Yeah, teenage boys are gross...but have you ever shared a bathroom with a teenage girl? It's fucking nasty.","post_message":"You love him, of course, but COME ON."},{"comment_id":"10155994717525615","commenter_b":"Well, we now know which four are the cream of the crap.","commenter_a":"What does that say about the four that signed?","post_message":"NOM could only get four out of 17 candidates to sign? What does that say about their influence?"},{"comment_id":"1306332122711020","commenter_b":"This is America. Let them all leave. We love our National Anthem.","commenter_a":"Oh say can you see your way out of here muslims","post_message":"MUSLIMS ARE OFFENDED AT NATIONAL ANTHEM: They Say It Forcing Them...  THEY WILL NEVER ASSIMILATE!"}]
