[{"comment_id":"1419706908060869","commenter_b":"What rights do women not have again?","commenter_a":"Suck it up... lol he won and he IS your president. I love liberal whining people it makes it all that more enjoyable to get on here and see them crying.","post_message":"\"You're orange, you're gross, you lost the popular vote,\" a crowd at the Women's March in Washington chanted today.  Millions marched in D.C. and around the world for women's rights and against President Donald J. Trump's inauguration: @webpagelink"},{"comment_id":"1072562746193671","commenter_b":"You don't like China?","commenter_a":"Yes yes Mexico is paying for the Wall, I just did nit get the chance to tell them yet. I met the Mexican president, he is a great man, I have a lot of respect for him and I love him and the Mexican hombres a lot. I offered the Mexican president free premium trump wine from china","post_message":"\"[It] fully-funds the construction of a wall on our southern border... with the full understanding that the country of Mexico will be reimbursing the United States for the full cost of such a wall.\"  Earlier today at his \"first 100 days\" speech in Gettysburg, Donald J. Trump outlined his proposed \"End Illegal Immigration Act.\" @webpagelink"},{"comment_id":"979292718775058","commenter_b":"Y hell yeah. I know is I do stupid stuff I would be locked up. She should be treated the same. That don't mess with her because she has money. The poor folks pay the price. The rich walk around like that are untouchable. It bs.","commenter_a":"False!","post_message":"BREAKING: FBI Finally Makes Move To Arrest Hillary Clinton…   Her time is coming to end. Say goodbye.  Would you be happy if Hillary was arrested?"},{"comment_id":"482294165294497","commenter_b":"Our home, our laws. Get out of our country!","commenter_a":"Kick islam out of America.","post_message":"First our schools, then our public areas, what's next?  'SHARE' this post, we have to let the nation know what the MSM won't.  Do you agree Shariah must be stopped?"},{"comment_id":"386189561505639","commenter_b":"Keep it open and all prisoners.","commenter_a":"Open","post_message":"Do you think Guantanamo Bay prison should be closed as promised or kept open?"},{"comment_id":"977246632310796","commenter_b":"Wth is a \"male feminist\"? This term is a total failure to understand what a feminist is.","commenter_a":"Amazing! A way for men and women to share the responsibility of contraception. This is the true mark of a male feminist.","post_message":"This is ballsy."},{"comment_id":"10153035820806770","commenter_b":"she can't even lead her servants...","commenter_a":"now she wants to bring in people to vote for her......","post_message":"Democratic presidential candidate Hillary Clinton told “Face the Nation” host John Dickerson Sunday that she hopes the United States will “lead the world” and take in 65,000 Syrian refugees over the next year."}]
