[{"comment_id":"10153074180200090","commenter_b":"she is evil and lies so much her nose is growing!","commenter_a":"Question? Why do Hiliary, Rosie and Michelle always have their mouth open when they never say anything.","post_message":"Take the survey if you know Hillary Clinton is trapped in a web of lies: @webpagelink"},{"comment_id":"10153524909826130","commenter_b":"If Trump had his way Muslims wouldn't be aloud to return if they left the states either.","commenter_a":"Muslim terrorist kills Americans again and liberals continue to make excuses for Muslim terrorist. Over 3,000 killed on 9/11, more than at Pearl Harbor , Fort Hood Muslim terrorist killed many, Muslim Boston pressure cooker bomber mangled several, Muslim husband and wife kills several in Ca. Liberals seems to love Muslim terrorist. Muslim terrorist cuts heads off reporters and airs the videos, Muslim terrorist throws homosexuals off roof tops, Muslim terrorist drown people in a cage, Muslim terrorist burns people alive.","post_message":"Donald J. Trump says he doesn't know any Muslim athletes, but these photos say otherwise."},{"comment_id":"10154265295731756","commenter_b":"Barriers for woman are more subtle in every field!","commenter_a":"Chet Logue","post_message":"The lingering, less-visible barriers to women in science create a new kind of challenge: People will fail to acknowledge they're there, writes Tania Lombrozo."},{"comment_id":"10154214106757411","commenter_b":"Girls like this get bigger diamonds","commenter_a":"Kathleen O'Connor ~ too bad they didn't have the first look when we all got married.","post_message":"A bride from Chicago wanted to make sure to give her groom a \"first look\" he would never forget... 😂"},{"comment_id":"1223281327711322","commenter_b":"PUT HER IN JAIL.","commenter_a":"They couldn't vote for her if she was in prison where she belongs America needs JUSTICE","post_message":"Read WHY!! @webpagelink"},{"comment_id":"10153904128981336","commenter_b":"@username I'd rather my money go to vets than illegals.","commenter_a":"Oh man, companies supporting a competent and able workforce with bonuses. Conservatives will not like this one bit.","post_message":"Jeffery Hildebrand, the 56-year-old billionaire owner, will pay out more than $100 million in total and reportedly uses these bonuses to motivate his workforce."},{"comment_id":"1064458436973745","commenter_b":"FIRE HIS ASS !","commenter_a":"Fox should remove shep ,,,,he was absolutely rude because he only wanted his views to be discussed, Time to go,,,,","post_message":"Many are Calling for Shepard Smith to be FIRED After What he Just did ON AIR... @webpagelink"}]
