[{"comment_id":"10155107253330557","commenter_b":"White people riot","commenter_a":"Must of been a black on black murder .... No riots","post_message":"#BREAKING: 2 people in custody, another still at large in the murder of a man in Reading. Developing details in the story below and in a live report on 69 News at 5:30."},{"comment_id":"10153653057081438","commenter_b":"Used to be, \"This may be upsetting to you.\" Then I would close my eyes. Yes, I get triggered, but it's not neuroscience to accommodate folks.","commenter_a":"Ovid yes and no. EVERY single one of the stories includes silencing of one kind or another-- often violent, often sexual violence. But it is a political poem by an exiled poet who was being silenced. HE tells a story about a bad (silencing) king and then says something directly to the emperor-- \" And you oh Augustus...\" Zeus was a rapist but he does not get praise for his philandering; his wife punishes the victim (the mother of nearly every demigod) since her husband is in power, but some god or goddess usually intervenes. Those rapes or dalliances are metaphorical for deeper political angst in Rome.","post_message":"Some professors believe trigger warnings build trust. Others think they stifle free discourse."},{"comment_id":"1103976636304606","commenter_b":"Man says something about women in sexual overtone, people are \"Shocked and Disgusted\". Welcome to planet earth.","commenter_a":"Who cares?","post_message":"Sen. John McCain has withdrawn his support for Donald Trump following the disclosure of a video recording in which the candidate made lewd comments about women."},{"comment_id":"1238637239481907","commenter_b":"ugly ungrateful woman -","commenter_a":"He better say that. Else Lady Chewbacca would beat his ass.","post_message":"Michelle Obama just brought down the house with a passionate speech at the Democratic convention. It's safe to say President Obama was a fan of it:"},{"comment_id":"644296295760949","commenter_b":"I'll wipe my butt with everyone that comes my way","commenter_a":"Not even on a penny","post_message":"Obama is trying change our countries money.  He has absolutely no right to even consider this change.  Do you think Obama deserves to have his face on a dollar bill?"},{"comment_id":"10153694731231955","commenter_b":"Awwww so sad, GO BACK TO YOUR FUCKING COUNTRY ,","commenter_a":"Oh nowvthey care","post_message":"Muslims feel intense backlash..."},{"comment_id":"10153733713798984","commenter_b":"Amen. And with the way that woman looks, she'll be working the counter at McDonalds.","commenter_a":"If you can't or won't do what your job requires, then find another job.","post_message":"The husband of Kim Davis wants to send a message to the judge who jailed his wife, and he only needs six words to do it. He is not at ALL happy with what is happening to Kim, but it is clear that he and his family are not going to back down from their beliefs.  Do you support Kim Davis and her family?"}]
