[{"comment_id":"870392283014938","commenter_b":"Just deport them","commenter_a":"Let them starve","post_message":"ILLEGAL ALIEN CRIMINALS ON HUNGER STRIKE IN AZ PRISON Give List Of Demands Including Removal Of Threat Of Deportation"},{"comment_id":"10153112038031770","commenter_b":"We need TRUMP we need the wall 11 mil illegals today 25 mil tomorrow when will it stop !!!!! North Carolina here voting TRUMP 2016","commenter_a":"And just another reason NOT to have this trash in our country!!!","post_message":"The District of Columbia started issuing drivers licenses to illegal immigrants in 2014, and now some are complaining because the process takes longer than they would like."},{"comment_id":"1206961029346060","commenter_b":"You still haven't answered the RACE question","commenter_a":"He sounds like when I BS for word count in an essay.","post_message":"Donald J. Trump and Hillary Clinton faced off in their first presidential debate. TELL US: What questions did you want them to answer? Your comments may be used on our newscasts. You can also watch the debate live on CBS2 or on CBSNewYork.com, Join us on CBS2 at 11. #Debates2016"},{"comment_id":"489295787927668","commenter_b":"screw her","commenter_a":"first explain what 20,000 likes will accomplish ......","post_message":"Hillary Clinton is attempting to make it punishable by law to criticize Islam.  She just crossed the line. We can put a stop to this, let's end this right now.  Can we get 20,000 'LIKES' for freedom of speech?"},{"comment_id":"1299379106804981","commenter_b":"Uh, she should be arrested!","commenter_a":"Sorry, but if didn't want anyone to see it, he should have put it in a folder, or face down, or taken it with him when he got up.","post_message":"You should be mortified - Post Updated *******************"},{"comment_id":"1044864242277400","commenter_b":"@username Of course you haven't ever heard a group of 59 year old women bragging about \"popping a Tic-Tac\" so they could forcibly kiss a handsome man. And never have I heard this same age group say, \"grab'em by the d*ck\", nope, it doesn't happen...","commenter_a":"I am still trying to figure out how this man became a surgeon. Are you sure that his license and everything or legit cuz he is a total nut","post_message":"Ridiculous!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153547660103854","commenter_b":"Hates those who serve. Loves the illegals","commenter_a":"Scum of the earth","post_message":"ULTIMATE BETRAYAL: Obama To Cut Healthcare Benefits For Active Duty And Retired Military"}]
