[{"comment_id":"10153750563214497","commenter_b":"Liar. You're not a prostitute.","commenter_a":"As an African American prostitute I find this offensive.","post_message":"For more world-renowned reportage, visit theonion.com."},{"comment_id":"1784575138485488","commenter_b":"How would she know what honor is?","commenter_a":"Honor .... She doesn't know what that means........","post_message":"Clinton says she wants Trump to know what \"American honor\" looks like. What do you think about her speech?"},{"comment_id":"10153828870277217","commenter_b":"why don't you to go suck his tits, they're probably bigger than yours. lighten up.","commenter_a":"why does he have his tits out? I'm offended, he's breast feeding in public.","post_message":"Syrian rebels say the city of Aleppo was attacked by government forces using chlorine gas. Warning: video contains disturbing images."},{"comment_id":"10156216618090389","commenter_b":"She'll get away with everything , just wait and see.","commenter_a":"I bet she gets away with it that's the way the Clinton's roll","post_message":"Those emails might not be about yoga or Chelsea's wedding. Do you think Hillary is finally feeling the heat?"},{"comment_id":"10153571607004411","commenter_b":"Fuck you Kike hook nosed cunt","commenter_a":"Just a usual palestine jewhating fascist lmao, good way of solving the problem Canaan belongs to nobody, especially not to muslims","post_message":"'My hope is that at some time, [Israel] is no longer there, but only Palestine'"},{"comment_id":"1444053418948017","commenter_b":"That's why those guys never meet a MULAN their whole life. They could not handle a strong woman anyway.","commenter_a":"He's blaming Mulan for progressiveness and equal woman's rights. Someone thinks we belong in the kitchen barefoot and pregnant.","post_message":"Donald J. Trump running mate Mike Pence slammed the kid's film as the brainchild of a \"mischievous liberal at Disney\" bent on causing \"a quiet change in the next generation's attitude about women in combat.\""},{"comment_id":"1264994986901695","commenter_b":"I am for the national guard to start rounding up these illegal wetbacks.","commenter_a":"Yes!","post_message":"America's Freedom Fighters"}]
