[{"comment_id":"10153344624090326","commenter_b":"Sit down and shut up!","commenter_a":"He has hearing problems nothing is free","post_message":""},{"comment_id":"10153708782186350","commenter_b":"Michelle ovomit is the washed out hag!","commenter_a":"Michelle Obama is a wonderful woman who deserves respect. She didn't do anything to you. Stop acting like 12 year old bullies and grow the hell up","post_message":"Find out what Michelle Obama can't wait to do once she leaves The White House."},{"comment_id":"670195519853865","commenter_b":"LEARN TO SPELL NIGGA DAMM Y\"ALL BITCHES OVER TRYING TO TELL US SHIT GO BACK TO SCHOOL.","commenter_a":"Not in a million years, she is a traitor, liar, con artist, she left 4 Americans to die with out any help but then what difference does it make anyway- Bitch, hope you go to prision!","post_message":"Hear, hear!  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"660481514127059","commenter_b":"She paid him off!!","commenter_a":"Why is she using Mr. Kahn so much? I thought his family is still distraught about the horrific death of his son?","post_message":"Replay: Hillary Clinton was in New Hampshire."},{"comment_id":"1415272741824926","commenter_b":"If I was as ugly as her I wouldn't be calling attention to my stupidity too !!","commenter_a":"sounds more like Eva Braun more and more!","post_message":"Less than 30 minutes after Donald J. Trump was sworn in as President, MSNBC's Rachel Maddow was calling him Hitler."},{"comment_id":"10153308437364877","commenter_b":"In the words of Redd Foxx \" you big dummy \"","commenter_a":"DF really??? And Ya'll all over Kanye this morning???? BEAHAHAHAAAA","post_message":"NEW ORLEANS (AP) — Former President George W. Bush returned Friday to New Orleans — the scene of one of his presidency's lowest points — to tout the region's recovery from the nation's costliest natural disaster on the 10th anniversary of Hurricane Katrina."},{"comment_id":"10154888478529714","commenter_b":"#FuckTrump #FuckPence #MelaniaFirstWhoreOfTheUnitedStates","commenter_a":"Boycott the show!! This is truly getting out of control. Did this occur when OBAMA became President? \"Of Course NOT\"!! The left are outspoken to the point of embarrassing themselves on a platform of defeat. Protesting, Chanting, Revolting won't change anything!! The American people have made a choice, that choice is for change. \"Get over it, get with it\" The Liberals power(s) were overturned, \"what a beautiful thing\" & they don't know how to deal with it!!","post_message":"\"Vice president-elect, I see you walking out but I hope you will hear us.\""}]
