[{"comment_id":"10153491404021680","commenter_b":"We live in a generation that feels like everybody owes them something. @webpagelink","commenter_a":"You guys are so biased, it's disgusting.","post_message":"Bernie Sanders must run a gauntlet of closed primaries and Hillary Clinton strongholds next week."},{"comment_id":"10155971884414062","commenter_b":"You wouldn't even bow down to GOD himself but to some woman who \"claims\" African goddess with Indian woman hair.. okaaayyyyy","commenter_a":"I take this performance highly offensive! There is Only One King and that is Jesus Christ! #Stepdown!","post_message":"This was the first glimpse of Beyoncé since her pregnancy announcement hit Instagram at the beginning of February.  Winners' list: @webpagelink Photos: @webpagelink Full GRAMMY coverage: @webpagelink"},{"comment_id":"1811602825768086","commenter_b":"@username they voted for TRUMP because Hillary is lying criminal that should be locked up","commenter_a":"not surprising.... the KKK IS a dem organization so it makes perfect sense that they would be able to get the uniforms.","post_message":""},{"comment_id":"991326630995465","commenter_b":"I will never refer to you as a woman, just a bitch!","commenter_a":"I will never refer to him as President, just trump, no capital t","post_message":"From placing sworn white supremacists in key cabinet positions to sucking up to Vladimir Putin, Trump's actions speak for themselves... he is a clear and present danger to the survival of our country."},{"comment_id":"859553757415299","commenter_b":"Coming out of the mouth of the most oppressive Fascist in American History!!","commenter_a":"Beat that dead horse. ..beat it some more","post_message":"Attorney General Eric Holder told reporters Friday that the federal government is “prepared” to dismantle the Ferguson Police Department if “necessary.”"},{"comment_id":"10153879434881337","commenter_b":"and fuck u bitch","commenter_a":"FUCK OBAMA!!!!!!!","post_message":"PRESIDENTIAL APPROVAL: Kendrick Lamar keeps it short and sweet with his reaction to Barack Obama's \"song of the year\" praise..."},{"comment_id":"10154346191079411","commenter_b":"I don't even think about you or feel absolutely anything for any of the followers of such cult... But i can tell you something: The members of the Western Civilization are entitled to protect Our values, Our culture and Our true religions from the plague that has overshadow every region it has reached... And there is absolutely nothing all of you can do about it. And if it happens that you are an antisemite like a very big portion of the muslim population, i can tell you that your life wouldn't be the same without Google, Whatsapp, Facebook, Oracle... and so on (Those are jewish invetions). Finally how can such a small country like Israel (You live next to it) defend itself from dozens of enemies and at the same time be so strong with such a small population? The brotherhood defends us all with the power of G'd... not ...","commenter_a":"If french people want to be slaved and force to convert to that filthy and pedophiloc religion then Fuck U All... Just wait to be once again a province from another country","post_message":"'I saw Muslims celebrating in the street during the attack. I saw it with my own eyes. In real time!'"}]
