[{"comment_id":"1384042331652908","commenter_b":"Good on ya.","commenter_a":"I stopped looking twenty years ago and saw my best friend and \"soul mate\" even though I know that souls are just a fantasy, right in the mirror. So me and my self became best friends and I haven't needed anyone in my life since then. I've been happier, I bought two homes in the last twenty years, and the freedom from the male drama is the best feeling in the world!!!","post_message":"As one writer points out, we spend endless hours wishing for, praying for, begging for our soul mates – that person who will finally make all the suffering worth it. But I’m here to tell you a little secret."},{"comment_id":"10155000451429228","commenter_b":"When the Ayatollah came to power in Iran, Iran had a major drug problem. They hung their way out of it; they didn't hang anywhere near all the addicts . . . It's just that, apparently, people can get the \"disease\" of the addiction under control if they see government is serious. **** The Nation of Islam cleaned up some housing projects in the 90s, again, with lots of negative reinforcement--then the ACLU and bleeding hearts put a stop to that. **** If such measures here could stop drug-related deaths and murders, and give people in projects safe places to live, we would have a net gain. Kindness to the guilty is cruelty to the innocent.","commenter_a":"Oh, well then . . . If criminals don't care, I guess we shouldn't punish them at all. ***** Getting real, living things seek pleasure and avoid pain. If negative reinforcement does not seem to be working, we're just not using enough of it.","post_message":"Missouri's new Governor is asking for tougher laws.  Some experts say criminals don't care."},{"comment_id":"10154818490392235","commenter_b":"Last I checked deplorables 1 idiots 0","commenter_a":"I wonder why raw story didn't post anything about the black kids jumping the white guy because they thought he supported trump. Liberal logic the worlds cancer","post_message":"This video just is the latest in a series of white people justifying their obnoxious behavior and demanding special treatment because they voted for Trump."},{"comment_id":"10154431713909411","commenter_b":"It would be good only if happen in America, Israel, Saudi Arabia, Turkey, England or some another war spreading and terror supporting country. All what happen in peaceful countries is bad and for regret. Thos who spread death around world, deserve it back in they own country.","commenter_a":"Good.","post_message":"BREAKING: Accident happened in Hualien County on Taiwan's mountainous eastern coast"},{"comment_id":"10152692455750950","commenter_b":"Bullshit...gay people are a disease and should be eradicated....I say we boil them alive in acid","commenter_a":"these people are a minority forcing their perversion on everyone else. So when are the pedophiles and rapist going to start marching too","post_message":"LGBT groups march in Boston St. Patrick's Day parade @webpagelink"},{"comment_id":"1149152748439068","commenter_b":"Kegels engaged automatically","commenter_a":"not a big white shark, just a fox shark","post_message":"Just stay calm, nothing to be afraid of ..."},{"comment_id":"10152900574094071","commenter_b":"I wonder if after building the wall, he will revoke all immigration permits to Scots and Germans and send his relatives back to Europe ... all expenses paid of course! ;)","commenter_a":"I believe that Jeb Bush will become the next president of the United States.","post_message":"Here are all the best moments from Donald J. Trump's presidential announcement."}]
