[{"comment_id":"1187041288042639","commenter_b":"How is she even allowed to run for president with all of this disgrace","commenter_a":"They all need to be arrested clean the White House and all the corruption--- this needs to be done ASAP","post_message":"In response to the revelations about the pay-to-play scandal tied to former Secretary of State Hillary Clinton non-state.gov email system and the Clinton Foundation, Judicial Watch announced that it will host an educational panel discussion:   Scandal Update  Emails and the Clinton Foundation.  Panelists include author of the New York Times best-seller Clinton Cash and President of Government Accountability Institute Peter Schweizer; Joe diGenova, former U.S. Attorney, Independent Counsel and founding partner of the Washington, D.C., law firm diGenova & Toensing; and Chris Farrell, director of investigations and research at Judicial Watch. Moderator will be Judicial Watch President Tom Fitton.  [for higher volume touch sound icon on screen  ]"},{"comment_id":"942535009139581","commenter_b":"get over yourself girl","commenter_a":"So girls/ladies do you go phoarrrrr when poldark shows you his chest? If so you cant complain.","post_message":"The wolf whistling debate has got VERY heated"},{"comment_id":"10153187291468812","commenter_b":"Sex slaves, good job girls!","commenter_a":"What's wrong with people this world is going crazy","post_message":"NEW: Search on for 3 schoolgirls who have fled home to join ISIS: @webpagelink"},{"comment_id":"1355437474524022","commenter_b":"Open season. Was Michelle off limits for you? No? Then neither should this ex porn model.","commenter_a":"Funny, not funny.... Who's paying for the wall? Mexico Mexic Mexi Mex Me.","post_message":"Today we celebrate one week since making history with the swearing-in of President Donald J. Trump and Vice President Pence! Watch the unforgettable inauguration:  @webpagelink"},{"comment_id":"604853703036255","commenter_b":"HOW she could stand there and openly lie to those families is just beyond me!! That is one dangerous woman!!","commenter_a":"People will still vote for her. Don't they know what a evil heartless lying phony she is. Here we have a vet who knows the truth she left those men to die despite numerous calls for help none came under her watch. She lied about the video not only to Americans but she lied straight to the faces of the victims families. She knew it was a planned attack that night but no she went to bed and I'm sure she slept peacefully. But as she yelled at the hearings \"What difference does it make.\" Her supporters should watch this over and over this will show her true colors.","post_message":"He exposed Hillary!!!"},{"comment_id":"345060612364120","commenter_b":"Can we trust her? What an absurd question! Of course not!!","commenter_a":"She still has no moral compass.","post_message":"Hillary Clinton's Record Begs the Question - Can We Trust Her?"},{"comment_id":"10153645733937217","commenter_b":"@username dude your wife looks like a yeast infection","commenter_a":"Oh god. Hillary can potentially become the next president, yet Nixon was almost impeached for missing tapes and she has thousands of missing emails. Wow people are incredibly stupid these days!","post_message":"\"Next January, I want to be sure that it is Hillary Clinton who takes the oath of office, not Donald J. Trump\" writes California Governor Jerry Brown."}]
