[{"comment_id":"451215538402360","commenter_b":"I will refuse, fuc her and the dirty dog she rode in this on!","commenter_a":"YES","post_message":"Will You Refuse To Turn Over Your 2nd Amendment Rights To Michelle?  Comment 'yes' or 'no'."},{"comment_id":"915727415130269","commenter_b":"Dại Lâm what do you think?","commenter_a":"I'm getting burned out on the Rock he was in 13 movies last year and it's only June and he's already in 6 movies this year give somebody else a job dam he's not the only actor in Hollywood. ..gee","post_message":"From Fast & Furious to Big Trouble in Little China."},{"comment_id":"510825025771036","commenter_b":"Exactly!","commenter_a":"The Greatest Good Common Sense is being questioned. Hope these will be at the FUNERALS of those killed by their bad rhetoric.","post_message":"Dr. Ben Carson weighed in on President Barack Obama's open door policy to refugees. What do you think about his comments?"},{"comment_id":"706537696174664","commenter_b":"White trash! Take a bath!","commenter_a":"Omg. Thought we only had one clown in the white house then she showed up. Glad its only for a few days left thank god","post_message":"Happy 53rd birthday to First Lady Michelle Obama! Join us in wishing her well!"},{"comment_id":"1004502652963001","commenter_b":"Better hope Hillary don't get to be President. This country will be a goner in 4 yrs. if she does.","commenter_a":"Oh, so Democrats are crossing over to vote for Trump. I see your game plan Dems. After Nov. gets here and if Trump is the nominee you all will turn around and vote Democrat.","post_message":"#FloridaPrimary"},{"comment_id":"10153415357404486","commenter_b":"Deport illegals with a QUEER under each arm","commenter_a":"QUEERS WIN !","post_message":"The Supreme Court just changed everything - what do you think?"},{"comment_id":"362582817419205","commenter_b":"They are terrified because of the media's misinformation. They blow the slightest remark out of proportion. He wants to expand on a wall that's already there. And the country has been deporting illegals the whole damn time. LGBT will continue to have their rights. And the so called race war is fueled by the media. Look at a person's character not at their skin.","commenter_a":"He should quit whining and moaning. I can assist him get residency in Madagascar within 15 minutes.","post_message":"Van Jones responds to the anti-Donald J. Trump protests: “We have to hear the pain.”"}]
