[{"comment_id":"949528478479092","commenter_b":"why can't they just leave things alone change this change that !!!!!","commenter_a":"The man who stopped the corrupt bankers is dumped. How extraordinary.","post_message":"Not everyone is happy about the change."},{"comment_id":"1007311229351882","commenter_b":"@username more people die every year in DWI accidents than in 10yrs of the war..stop whinning it will be on our soil soon.thank obama for that.","commenter_a":"Good because theyve destroyed the republican party and turned it into a warmongering party filled with neocons. Trumpism will come in to replace them and become a patriotic party for the first time in 40 years. We live in exciting times and I am honored to witness it.","post_message":"\"They are as dead as emperor-worship in Japan.\""},{"comment_id":"10153424598644726","commenter_b":"Hillary's policies will be like Obama's policies on steroids!","commenter_a":"Hillary is just an echo of Obummer.","post_message":"WATCH: Hillary Clinton says Businesses don't Create Jobs"},{"comment_id":"10155498405191729","commenter_b":"That's where he belongs. Back stabbing ungrateful dodo.","commenter_a":"Eeek. What ticket would he be on? Dem?","post_message":"Interesting..."},{"comment_id":"1541468506160349","commenter_b":"If, they take away guns criminals will build bombs !","commenter_a":"America has got to be in the grip of a a gun cult. When reason and logic doesn't work, you know the NRA propaganda has got a serious grip on us. We've shown the world how much our armed gun citizenry has worked - America's mass shootings are on a continuous news cycle being aired around the world. They must think we are arrogant when we refuse to look at their own country's statics as proof that less guns indeed do work. It's so logical, so reasonable, less guns, less gun related deaths. Yet we continue to be surprised at each mass shooting and continue to have vigils and prayers only to buy more guns. Other country's must laugh sadly at our arguments of death by spoon, forks or auto or our description of a gun being an inanimate object or that guns don't kill. Other countries must seriously hate ...","post_message":"Mic drop.   Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153911212003984","commenter_b":"Go Candance!!! Who is the woman on the right with the white duck on her head???","commenter_a":"I support Candace 100% God bless you","post_message":"I have to give major credit to Candace Cameron Bure. It can't be easy to be surrounded by the liberals of \"The View\" and stick to your guns like this. She sure got them riled up, and I could watch it over and over again!  Do you agree with Candace Cameron Bure?"},{"comment_id":"1765509470395082","commenter_b":"This morning someone on ABC said Trump supporters don't take him seriously. Republicans never gave President Obama a chance. They blamed him for everything and they worked tirelessly to make him a one term president. If Trump wins America will be the laughing stock. Even the Russian government knows that. Donald a Trump blames everyone democrats for everything that is wrong but he has yet to say how he's going make America great again. Unless building a wall to keep out the illegals is how few intends to make America great again. I was team Bernie but since he didn't make the cut I have to go with the lesser of two evils. I can't vote for someone who fuels hate and bigotry.","commenter_a":"It's not up to this man to judge anyone soul. He is filled with hate against Mr Trump, he need look inside to his own darkness!!","post_message":"Khizr Khan, the father of a US soldier slain in Iraq in 2004, says Donald J. Trump has a \"black soul.\" @webpagelink"}]
