[{"comment_id":"1762909607309407","commenter_b":"Hey Trump you going to build a wall for these people.","commenter_a":"Idiot","post_message":"During a Colorado rally on Sunday, Trump unfurled an upside-down rainbow flag with the words \"LGBTs for Trump\" written on it."},{"comment_id":"10154866849395329","commenter_b":"Becky with the good hair have a stadium full of seats please","commenter_a":"*21 things no one asked for. There, fixed it. *waits for angry Trump supporters to start complaining in the comments*","post_message":"We asked Donald J. Trump supporters to write down a misconception about them and here's what happened."},{"comment_id":"1015237518591880","commenter_b":"When I look at her boobs she spins all the way around. Her face goes halfway then comes back","commenter_a":"Prefer not to care","post_message":"Is she spinning right or left?"},{"comment_id":"10153634923619885","commenter_b":"Nah she's a girl, but keep on denying. Y'all have a lovely day.","commenter_a":"That brat holding up that sign probably wouldn't want this person using their locker room either. So it's go with the ladies where you are not welcome, or go with the boys who will treat you like garbage. This is stupid. Leave this young person alone and let her get an education.","post_message":"Students at Hillsboro High School briefly walked out in protest Monday morning as part of a dispute over whether a transgender student should be able to use gender-specific locker rooms."},{"comment_id":"10153525058378984","commenter_b":"I I do not believe in Political Correctness, I believe in following and standing for my Christian Convictions, and e e expecting others to respect me and what / how I live, as much as I respect others .... and I do not need the Government to tell me how to do it or try to force me to abandon any part of my faith.","commenter_a":"Frankly I dont give a damn what they say.","post_message":"Wow, I thought I'd heard it all from the politically correct left, until I saw this...  Do you think liberals are getting out of control with their constant censorship of America?"},{"comment_id":"10153278641039087","commenter_b":"Absolutey prison is where this bitch belongs.","commenter_a":"MADAM PRESIDENT HILLARY CLINTON","post_message":"“I have no doubt on [Thursday's appearance before the House Benghazi Committee] she will be remarkable, and that Americans will really see why so strongly I believe she should be our next president,” Chelsea Clinton said about her mom Hillary Clinton."},{"comment_id":"10153084028785667","commenter_b":"Uhh bc illegals.. This makes it easy for anyone","commenter_a":"Why would people not use their drivers license? Using library cards and Costco cards? Packing your driver's license? Seriously? Stupidity at its finest. Some people should just stay home.","post_message":"A credit card, prescription, student ID or even a Costco card could be enough to convince the TSA you are who you say you are."}]
