[{"comment_id":"593592797513564","commenter_b":"Absolutely. Bitches get treated!","commenter_a":"@username 😂","post_message":"Watch out"},{"comment_id":"854121244730702","commenter_b":"No need to fear - strong, intelligent, powerful women can purchase their own contraceptives or better yet save something special for marriage and then raise the next generation of Americans.","commenter_a":"Dumbass use your butt.Save a child from being liberal.","post_message":"Lena Dunham is absolutely terrified of Trump and his views on abortion."},{"comment_id":"10153713110753690","commenter_b":"a philistian women","commenter_a":"some facts from the bible samson an delila samson the israel lite wasted gaza","post_message":"Israeli authorities have issued more than 13,000 demolition orders against Palestinian-owned structures, including homes, in Area C of the occupied West Bank between 1988 and 2014, according to a new report by the United Nations Office for the Coordination of Humanitarian Affairs.  Area C is a designation from the Oslo Accords' era that indicates the region is under full Israeli military and administrative control. The area, home to around 300,000 Palestinians, covers 60 percent of the West Bank and is also where most Jewish settlements are built."},{"comment_id":"10153811917026162","commenter_b":"Uhhh no!","commenter_a":"@username @username told me you like spiders!!","post_message":"NIGHTMARE FUEL: A puppy-sized spider with fangs strong enough to punch through bone is discovered in the South American rainforest.  For stories you care about -- \"Like\" ABC 7 Chicago!  PHOTOS: @webpagelink"},{"comment_id":"10155015262498690","commenter_b":"Yes why give the terrorists hope? As soon as Obomber gets out, terrorist support will weaken dramatically.","commenter_a":"If 9/11 deserves a moment of silence, than The #Syrians & #Palestinians deserve that we never speak again...","post_message":"Does Assad have enough manpower and weapons to protect the territory his forces have retaken while at the same time trying to win back more areas?"},{"comment_id":"10156228497460725","commenter_b":"Evil woman with lying eyes.","commenter_a":"Socialist controlled media ?","post_message":"Hillary Clinton is on the front page of The New York Times waving to 200 people in New Hampshire. My crowd next door was 5,000 people – no pic!"},{"comment_id":"10153241049435950","commenter_b":"SHUT THE FUCK UP...","commenter_a":"Is oboma a member of isis/isil?","post_message":"\"He needs to go after the people who killed Russian citizens,\" Obama said of Putin."}]
