[{"comment_id":"10153085660518010","commenter_b":"@username - Why are you afraid of strong women?","commenter_a":"If women can complete the same physical testing that men have to then they should be allowed to become full combat ready Army Rangers","post_message":"About 60 women will be allowed to take the next Army Ranger course assessment for the first time ever.  But women are still not allowed to become members of the regiment and will not serve as Rangers in combat."},{"comment_id":"1018807534853645","commenter_b":"RIP what a good man","commenter_a":"Inspiration for more acts of random kindness towards strangers. What an amazing guy. So sad :(","post_message":"\"I still cannot believe it. I thought for sure I would get the chance to see him again, give him a hug and thank him at least once more in person.\""},{"comment_id":"10153126683228854","commenter_b":"Criminals almost never kill themself.","commenter_a":"So what do you plan on doing about this old info ?","post_message":""},{"comment_id":"10152987583472014","commenter_b":"If you don't want the responsibility of a baby, get yourself fixed or some type of contraceptive","commenter_a":"Punch her in the face","post_message":"A teen mother says she didn't know she was pregnant before delivering a baby girl, but court documents detail chilling details of her searching the Internet for ways to induce a miscarriage while 38 weeks pregnant."},{"comment_id":"1508345139225610","commenter_b":"His wife has his balls..","commenter_a":"SEE THIS IS THE SHIT THAT HAPPENS WHEN WE APPEASE TERRORIST SUPPORTING NATIONS JUST LIKE JMMA(THE PEANUT BRAIN) CARTER AND BILL(I DID NOT HAVE SEXUAL RELATIONS WITH THAT WOMEN) CLINTOOOON DID,, NOW OBAMA IS DOIN SAME THING BUT THIS TIME HE HAS LET THEM GO NUKE,,,THEY PLAY WITH US BECUAS ETHEY KNOW OBAMA DOESNT HAVE THE BALLS TO DO ANYTHING SAD","post_message":"JUST IN:"},{"comment_id":"10152702377667869","commenter_b":"Praying that God leads you to serve in the best way possible.","commenter_a":"We will miss your show","post_message":"This evening I wanted to share with you some news that is very personal to me.  Because you have been such a good friend and a strong supporter of all my efforts, I wanted you to know first that tonight I will do more than just say goodnight on my Fox show.  I will say goodbye.  This is the last edition of Huckabee on the Fox News Channel. It has been the ride of a lifetime, and I have never had so much fun in my life. But I also realize that God hasn¹t put me on earth just to have a good time or to make a good living, but rather has put me on earth to try to make a good life.  There has been a great deal of speculation as to whether I would run for President.  I won't make a decision about running until late in the spring of 2015, but the continued chatter has put Fox News into a position that is not fair to them. The honorable thing to do at this point is to end my tenure here at Fox so I can openly talk with potential donors and supporters and gauge support.  As much as I have loved doing the show, I love my country more, and feel that it may be time for me to leave a zone of comfort to engage in the conflicts that have almost destroyed the bedrock foundations of America.  I feel compelled to ascertain if the support exists strongly enough for another Presidential run. So as we say in television, stay tuned!"},{"comment_id":"10152734752671051","commenter_b":"Unbelievable! some women should not children and she is one. Discipline begins at home.","commenter_a":"Needs a good ole fashion spankin.","post_message":"This 11-year-old boy is responsible for a fifth of the crime in his town – and his mother knows exactly who to blame for that."}]
