[{"comment_id":"1101197406562586","commenter_b":"wheredid they dig these women up she does not know what she is doing..she mite as well givr the city to the thugs, disarm the police and go home and take a nap","commenter_a":"Burn it","post_message":"There are people openly worrying if Mosby's case fails, if Baltimore will burn to the ground."},{"comment_id":"10153148918692217","commenter_b":"@username yeah because he will send you back to Mexico..... and will put a full stop to cross jumping.... All those tunnels on the US border in Texas will also be sealed.","commenter_a":"old news.","post_message":"Using their tune? Donald J. Trump needs to \"Dream On\" 🎶"},{"comment_id":"10158446067150354","commenter_b":"You little queer. I think my grandkids could fuck you up, fag!","commenter_a":"You won't stand a chance asshole come on bring it I'll save a hospital Bed it's waiting on you fucking RACIST RAT","post_message":"The shutdown of MILO event at UC Davis may be a preview of what to expect at next week inauguration of Donald Trump.   Just who are these hooligans?  Lee Stranahan investigates..."},{"comment_id":"10153730746224087","commenter_b":"She oozes EVIL!","commenter_a":"He is right, nobody would accept this corruption if it was another man versus Bernie Sanders","post_message":"\"It’s not sexist. It’s true,” Donald J. Trump said, repeating comments he made Tuesday about Hillary Clinton. “If she were a man, she’d get less than 5 percent.”"},{"comment_id":"10153740264340667","commenter_b":"This woman is unethical and unprofessional and immoral @webpagelink","commenter_a":"It's not just him who sees it. Many people see how biased and one-sided the media is. Very unprofessional. No shame left. I'm not against anyone here. I simply criticize the corrupt system.","post_message":"Not the first time it's happened this election cycle."},{"comment_id":"10154748214069486","commenter_b":"Fools all of them grrrrd","commenter_a":"WRONG!!!!...ARREST THE CLINTONS NOW!!!!...THEY WILL NEVER STOP ALL THEIR CORRUPTION UNTIL THEY ARE ALL BEHINDS BARS!!!!!!!","post_message":"Is this throwing in the towel?"},{"comment_id":"10156102999530354","commenter_b":"If he's not an illegal, he should be. What a POS. If you feel uncomfortable around the American flag, then get the hell out of our country.","commenter_a":"while your education comes out of our pocket screw you anti american crap","post_message":"Look what Matthew Guevara has to say about the American flag..."}]
