[{"comment_id":"10153160382606491","commenter_b":"Lauren Kirby","commenter_a":"1577961212219543s","post_message":"\"Amy and I were creatively made for each other,\" Jennifer Lawrence said."},{"comment_id":"1705936436359891","commenter_b":"Oh shut up! The murdering, lynching KKK will be around to continue their hate. It would be great for you all to go back where you came from. The Indians would love it!","commenter_a":"so Black lives matter can protest anywhere and everywhere, but no other group can.hum? not that i agree with the kkk but they do have the same rights as Black lives matter.","post_message":"By the time this KKK rally was over, blood was on the sidewalks and ambulances were on the way:"},{"comment_id":"10154237542506162","commenter_b":"Years wasted but enjoy that compensation my man","commenter_a":"I'm so sorry you lost all those years","post_message":"WRONGFULLY CONVICTED: A former U.S. sailor who has spent 33 years in prison will be released as early as today after new DNA evidence showed he was wrongfully convicted of murder and rape... @webpagelink"},{"comment_id":"588976734614882","commenter_b":"She couldn't sexually satisfy ol slick willy either","commenter_a":"Don't want her in the War Room...Remember Benghazi!!!","post_message":"Ahead of President Obama's speech to the Democratic National Convention tonight, The White House released excerpts touting Hillary Clinton's experience."},{"comment_id":"10154344957028753","commenter_b":"@username so you are ok with building a wall by cutting programs like help Americas like are vets and retired or elderly and poor, like a childrens education, too what build a wall that will no nothing in the end 10 years from now when or if is done, I will not give my money for a wall I rather help Americas, the environment, help kids have a good education, and yes help those illegals trying too become citizen that cant afford too pay 5000 dollars too take a class to become a legal citizen,a wall will do nothing ,ask any Germany how the berlin wall worked for them, most European, middleeast and faeest ppl come tho Canada, Toronto airport is a major gate way too northamerica, why not a wall there, this as nothing too do with topps illegals it has too do with dons ego, he has too ...","commenter_a":"I'm okay with that. I would rather pay for a method to keep illegals out as much as possible, than to pay for their food, housing, health insurance, etc. and also feel the wrath of the homelessness because they invade my husbands profession.","post_message":""},{"comment_id":"1296273287105505","commenter_b":"You can go to hell liar","commenter_a":"Thank you president Obama. You will always be my president . The orange one will never be able to walk in your shoes he is a lier and con man and most of all a racist sob. Never put president before his name.","post_message":"\"That's what separates us from tyrants and terrorists.\" Nearing the end of his presidency, President Obama shared his hopeful vision of America's future."},{"comment_id":"888422501286356","commenter_b":"I feel bad for whoever votes for Hillary!!! You are asking for our country to be taken over and also death for America!!!! I guess Muslims get there wish of destroying America if Hillary is elected into the White House!!!! She is a traitor just like Obama is!!!!","commenter_a":"Hillary will probably just let me and my brothers die without any help. I trust trump fully.","post_message":"Who do you trust more to protect the American people: Hillary or Trump?"}]
