[{"comment_id":"1048332608520428","commenter_b":"Lmao Persian women though.. Gorgeous.","commenter_a":"You are free to choose between Arab uneducated fundamental extremists and moderate enlightened Persian Cats..","post_message":"Iranian Foreign Minister Mohammad Javad Zarif said on Wednesday a new U.S. law putting visa restrictions on Iranians and those who had visited Iran would, if implemented, breach a nuclear deal Tehran had struck with world powers earlier this year. Read more: @webpagelink"},{"comment_id":"10153199106634071","commenter_b":"Get her a group of body guards while you're at it","commenter_a":"M","post_message":"A $48.5 million diamond for a 7-year-old girl."},{"comment_id":"10153847208137894","commenter_b":"Bitch get your pasty ass on with that lie. What personal struggles has to do with you utilizing the word??? White people are full of shit bc whatever was said she meant it. They love to come back with a weak ass apology as though that changes anything. I love it when they make an ass of themselves or get fired bc it shows them that that so called white privilege isn't paying off like they want. Well opps dumb bitch your bad.","commenter_a":"Miss 'm y ass ..bullcrab","post_message":"Miss Teen USA Apologizes for All of Her N-Word Tweets, Blames Them on ‘Personal Struggles’"},{"comment_id":"1283819971638030","commenter_b":"She's a disgusting wombat","commenter_a":"Looks like big bird. We paid over 2 grand for that dress?","post_message":"The Narciso Rodriguez dress sold out online before the president had even finished speaking."},{"comment_id":"1048204431922451","commenter_b":"in the beginning of his campaigned media said he was a Muslim,friends of the activist terrorist eyre and his pastor mentor for 20 yrs condemned America,his wife hate America, the only PRESIDENT APOLOGIZED FOR AMERICA and the people still vote for him, and look America now, bankrupt morally,financially,economically and bankrupt spiritually. AND THE BAD NEWS HILARY GOAL IS TO FOLLOW HIS STEPS. IF ANY ONE OF DEMOCRATIC WIN, THE END OF AMERICA . WE WILL BECOME A SOCIALIST ,COMMUNIST COUNTRY LIKE CUBA AND SOCIALIST COUNTRY OUR LIFE WILL RUN BY THE GOVERNMENT. YOUNG PEOPLE ARE BRAINWASH OF THE SOCIALIST TEACHERS IN SCHOOL AND UNIVERSITIES. PRAY FOR OUR COUNTRY AND YOUNG PEOPLE,","commenter_a":"I have been saying that for years!!! He isn't going to do anything to hurt his peeps.","post_message":"Former CIA Agent Says Obama is Working With The Muslim Brotherhood Against America. ⋆ Please Share ⋆"},{"comment_id":"1101197406562586","commenter_b":"wheredid they dig these women up she does not know what she is doing..she mite as well givr the city to the thugs, disarm the police and go home and take a nap","commenter_a":"Burn it","post_message":"There are people openly worrying if Mosby's case fails, if Baltimore will burn to the ground."},{"comment_id":"1705082506417935","commenter_b":"RACIST ASS HOLE!","commenter_a":"Trump is not for the KKK either Charlie.It's more likely that the Dems are still in bed with them","post_message":"\"What I really meant to say was...\"   WATCH:"}]
