[{"comment_id":"10153985264843984","commenter_b":"She is hot","commenter_a":"You go girl","post_message":"Fox News superstar Andrea Tantaros just hit Instagram with an awesome selfie.  She's pretty, but it's the t-shirt that makes the pic amazing."},{"comment_id":"1136613006364478","commenter_b":"He told that woman to \"GO AND SIN NO MORE,\" @username. Jesus calls even a single divorce for ANY reason one thing: \"... ADULTERY!\" ~ JESUS \"THOU SHALT NOT COMMIT ADULTERY!\" ~ GOD \"JUDGE YE RIGHTEOUSLY!\" ~ GOD ~ JESUS","commenter_a":"Mark 10:10-12 In the house the disciples began questioning Him about this again. And He *said to them, “Whoever divorces his wife and marries another woman commits adultery against her; and if she herself divorces her husband and marries another man, she is committing adultery.”","post_message":""},{"comment_id":"10153860953039614","commenter_b":"Total fool.......actually wore than Hitler. Hitler is dead. Trump is still with us. For now.","commenter_a":"Clown","post_message":"A heckler interrupted Donald J. Trump at a rally in South Carolina, as the billionaire presidential candidate called for a \"total and complete shutdown of Muslims entering the United States until our country's representatives can figure out what the hell is going on.\"  \"They have no respect for human life,\" Trump said, referring to \"people that believe only in Jihad.\"  He has previously called for surveillance against mosques and said he was open to establishing a database for all Muslims living in the U.S.  Read KTLA's story here: @webpagelink"},{"comment_id":"10152694335031094","commenter_b":"^Calls other women whores^","commenter_a":"Anti-science lunatics...UGH!!!!!!","post_message":"The federal government has confirmed more than 100 people across 14 states have now developed measles. Will state governments respond by rescinding personal belief exemptions for parents who choose not to vaccinate their children?"},{"comment_id":"10155378344568132","commenter_b":"As phoney as her boobs...","commenter_a":"That fantasy world u r capable of living in will soon have u filing for bankruptcy Missie!","post_message":"Mariah Carey says she's \"incapable of being in the real world and surviving."},{"comment_id":"941709942541740","commenter_b":"Stay out of my relationship","commenter_a":"This is clearly propaganda to boost the cause to have people see same sex marriage in the same light; it's a ploy, not that I have anything against racial marriage, I'm 100 hundred percent for it but it's no coincidence this is being addressed in light of what is happening this month. When a black man or white man marries a latina woman or black or white woman or Aborigine woman, that is still a man marrying a woman, the way that God had intended. The sexes are complementary and marriage has been since the beginning of mankind, the core unit to propagate the family and for mankind to spread and to flourish. Two males and two females cannot propagate the family that is why they have to take other unnatural alternative measures to achieve this because that is the only way they can. Please don't think I'm putting down ...","post_message":"On this day in 1967, the Supreme Court legalized interracial marriage in the United States. Happy Loving Day! #LovingDay"},{"comment_id":"928454370547645","commenter_b":"Because only girls can get raped","commenter_a":"I am so glad that I don't have a daughter. I'd be terrified for her in this world we live in. Heartbreaking.","post_message":"'The most disgusting, sickening' gang rape at Spring Break beach party"}]
