[{"comment_id":"10153576489935667","commenter_b":"Their aliens","commenter_a":"I wonder what it looks like now","post_message":"Experts have yet to identify their breed but guess they could have a bit of wild cat in their DNA."},{"comment_id":"10152996938497293","commenter_b":"Sorry you can't understand science. Maybe you should go back to high school.","commenter_a":"So the WaPo says evolution is fact, even though it's theory that can't be demonstrated? Bias is a wonderful thing.","post_message":"This can go down as one of the best examples ever of why it's downright impossible to convince someone who's \"opposed\" to evolution that it's a basic fact."},{"comment_id":"10153618510960329","commenter_b":"How bad do you want to see picture number 4s titties?!","commenter_a":"Dave David Craig so Mark was right all along...","post_message":"Drinking beer in the shower is a thing and you should all be doing it."},{"comment_id":"1224337737632979","commenter_b":"I thought it was absolutely hilarious. Maybe the hood rats should have a bit more respect rather than planning their next drug deal.","commenter_a":"If she can't handle her job and behave professionally, then she shouldn't be an educator. Period. Her being a teacher and all you would think she would be able to find another way to get her point across. The way she spoke and behaved was unacceptable. She grabbed that boy and then went on to say racially inappropriate things. She's a disgrace to teachers.","post_message":"Aren't teachers suppose to be the example?  #WSHH"},{"comment_id":"892938524096132","commenter_b":"Don't hate immigrants--- hate law breakers. Invaders have to be stopped. Tax payers can't afford them. Do it legal or don't come at all.","commenter_a":"Why do you all hate immigrants? Your grandparents were immigrants.","post_message":"In the U.S. House Judiciary Committee, we introduced legislation to strengthen the interior enforcement of our immigration laws by allowing state and local governments to enforce federal immigration law. By doing so, we remove the ability of this or future Presidents – of either party – to systematically shut down portions of the law to suit their political purposes. WATCH:"},{"comment_id":"10153255153245329","commenter_b":"Jason Winter you must","commenter_a":"@username eeeeee","post_message":"These dogs don't know what to do now."},{"comment_id":"10154996300568827","commenter_b":"And when they do they can get arrested for indecent exposer. And if they do it in front of one child they should ALL have to register as a sex offender.","commenter_a":"Why do we need to see his returns...? He was a private citizen...show me yours...","post_message":"Protesters plan to pull their pants down to protest Trump."}]
