[{"comment_id":"10156654458470725","commenter_b":"Hoe","commenter_a":"Let me tell you WHY I AM voting for Trump. I've received a few boo's for my stance on Trump and I just have to say this so I hope you will take just a moment and read it to the end. And I say this as no response with no judgement or ill will toward anyone. I understand there are many who feel Trump's brashness doesn't qualify him for office. I agree he does need some polishing in some of his mannerisms. However, God willing, I will vote for him because this country is so far gone now and into the sewer so DEEP that I doubt there is much that will help it recover. That is why I feel more strongly about this now than perhaps ever in my lifetime that we M-U-S-T elect a strong, no-nonsense, straight-shooter with a BACKBONE OF STEEL who will stand up for ...","post_message":"realdonaldtrump is the first presidential candidate in 2016 to reach 1MM Instagram followers. Follow: @webpagelink/ for behind the scenes footage from the campaign trail! #TrumpTrain #Trump2016"},{"comment_id":"1797699957184669","commenter_b":"Gowdy is a total bad A!","commenter_a":"I must say that I have never heard of you before today, however after watching many you tube videos and a bit of research I am impressed by you in every way. You would make an amazing Attorney General.","post_message":"There will never be enough words to adequately express our gratitude for the brave men and women who have selflessly fought for our freedom. Thank you to all of our veterans, past and present, for your service and sacrifice to our country. May God bless you."},{"comment_id":"922507297858399","commenter_b":"Ms. Miller, I'm a proud supporter of Mr. Trump. I'm so concerned that with Ms. Clinton's ability to \"Fix\" things she may have the ability to fix the election. I'm a true believer that this also happened in the current Pressident's second election. I am afraid that the Dem party will be in place for many years to come with the young and uninformed youth being targeted supporters through free things offered to them as well as dead people and illegals voting. . I'm hoping I am very wrong though. God help us.","commenter_a":"Wow!! While speaking on fox news live right now Mr trump actually seems presidential. This is the tone and demeanor we, the people have been asking you for. Let hillary bury herself. She will!!!! Be a better man. Be the man America needs. We want to believe that you can lead us but not unless you can start to act and sound like a good president.","post_message":"Radical Islamic terrorism threatens our world. Anyone who cannot name the enemy - cannot fix the problem!"},{"comment_id":"654997668024145","commenter_b":"WHAT a dumb bitch!!!","commenter_a":"Looks like she has eaten one to many spud herself!","post_message":"Michelle is now targeting a common supermarket food.  That's enough. We're tired of Michelle.  Do you agree Michelle should just go away?"},{"comment_id":"10153141603253352","commenter_b":"Melissa shut the fuck up!","commenter_a":"Those Black Companies are NOT affiliated with ANY Black Supremacy Groups that's the BIG DAMN DIFFERENCE. WAKE THE FUCK UP PEOPLE.","post_message":"KKK erects billboard in Arkansas advertising local White Pride radio station featuring shows 'This is the Klan' and 'White Women’s Perspective'"},{"comment_id":"10152900574094071","commenter_b":"I wonder if after building the wall, he will revoke all immigration permits to Scots and Germans and send his relatives back to Europe ... all expenses paid of course! ;)","commenter_a":"I believe that Jeb Bush will become the next president of the United States.","post_message":"Here are all the best moments from Donald J. Trump's presidential announcement."},{"comment_id":"10154542886848984","commenter_b":"And Whoopie Goldberg and all those cackling The View women!!! BYE FLEICIA!!! Lol","commenter_a":"Gotta go with Ted on this one, but he left off Kanye West off his list. Maybe when West leaves the country, he'll take the Kardoucheians with him.","post_message":"Rock legend and conservative firebrand Ted Nugent has released his 20 reasons to vote for Donald J. Trump, and they've gone viral. No wonder. Look at what he's saying here.  Finally someone will tell the blunt truth about Trump versus the establishment. You've gotta love this!"}]
