[{"comment_id":"1084090904983990","commenter_b":"TheresaStephens I don't know how you can say that. The police might have something on him and if they have he should be charged and locked up for life. And all the tax payers money your going on about let Cliff Richard pay for it if he's guilty, let the police seize all he's wealth and money and all go in police funds. If he is guilty he's nothing else but a dirty old C@@@ I don't care about he's Christian lifestyle if he is guilty he should go away. After all Theresa God hates sexual immortality","commenter_a":"Oh for goodness sake leave the man alone. I'm not a fan but, your innocent till proven guilty. So far they haven't proven a thing. I am sure there are plenty of unturned stones in the police force that need investigating?!","post_message":"Just in...."},{"comment_id":"1018381961551666","commenter_b":"Monthly periids dont count woman. Come up with another strategy","commenter_a":"Yeah.... you've got such a stellar record from Benghazi, who wouldn't want to go into battle at your direction?","post_message":"We can defeat global terrorism—but only if we don’t let fear drive our response."},{"comment_id":"10152706974886717","commenter_b":"As an Australian, observing from afar, ALL your possible candidates are hypocrites and troubling. In a perfect world, Bernie Sanders would be President and the GOP and the Tea Party would have melted into oblivion. However, it's NOT a perfect world, and I'm a realist. Even the darling of the left, Elizabeth Warren, is an avid supporter of Israel, whilst allowing the continued persecution of the Palestinian people. Politics isn't about the best possible person: it's about the least worst. Hillary Clinton is the least worst by a country mile. We know where she stands. We know how she thinks. We know how she works. We know she's a fierce supporter of women's rights. We know she's learnt a lot of painful lessons from her time as first lady, Senator for NY, and as Secretary of State. I also believe that she's learnt from these mistakes to make herself a ...","commenter_a":"Doesn't mean she should be president. we need to stop being single issue voters and look at the whole picture.","post_message":""},{"comment_id":"10154216491251943","commenter_b":"WAKE UP AMERICANS .. This May be the Last Chance American and the American people (voters) have to retain and Guarantee, our American Heritages, Customs and Constitutional Rights .. We need to rid American of the Radical Muslims and Illegals who are here and trying to take over America .. Do You want a Clinton Corrupted Government Controlled Life or a Trump Love America Lifestyle for your Children's Children .. SERIOUSLY - that is the Choice Were making and There going to be Living with .. This is more for our Children and there Children than for US but only WE can Guarantee them a life and Future that we had .. Clinton will be a Disaster for America and all Americans .. Surely you can realize that - listen to the news , ,LISTEN .. WE THE PEOPLE - need to Bring back GOD, COUNTRY AND CONSTITUTIONAL FREEDOMS to ...","commenter_a":"Burn the witch!!!","post_message":"Hillary Clinton must be held responsible for using \"private\" email accounts and a hidden email server as Secretary of State to conduct government business in violation of the law!  Judicial Watch is the one organization with a proven 20-year track record of investigating, exposing, and prosecuting Hillary Rodham Clinton and company. Please SHARE!"},{"comment_id":"10153446072426545","commenter_b":"Why would that CRAP sell out? It looks like a hooker dress. Either that or she LOST the other half.","commenter_a":"I want to hear more about why the SWAT team was deployed in W FTW.","post_message":"The sisters, who have previously collaborated on clothing lines with PacSun and Topshop, celebrated the launch of their \"first-ever ready-to-wear collection.\""},{"comment_id":"10155823067465492","commenter_b":"Oh God there she goes again someone gotta find this chick a map","commenter_a":"Thank you Di Blassio!","post_message":"\"We are currently investigating and stand ready to assist the NYPD in bringing these individuals to justice,\" an Uber spokesman said."},{"comment_id":"1062536000443119","commenter_b":"White girls can't even right now.","commenter_a":"I went in to the Starbucks on Bay Area blvd across from baybrook mall,ready to buy coffee and a sandwich. They insisted on giving me everything \" on the house\" ! They were so kind and respectful to their customers. There was an outpouring of kindness from all who were in the store. The tip jar was full of large tips! They locked the doors right after I made my \"purchase\", but never once rushed me out of the door. This place is a class act!","post_message":"A computer outage is disrupting Starbucks sales in the U.S. and Canada, and its impacting a lot of people right here in Houston. KPRC2 Anoushah Rasta is following this story on #KPRC2 News at 10 p.m.  MORE ---> @webpagelink"}]
