[{"comment_id":"10153641823407217","commenter_b":"Inbreeding for centuries and lack of education. Most Middle Eastern People are genetically incapable of being anything more than what you are seeing. TRUTH. Which is why we MUST contain them. Putin knows....it's why he is working to get them back home to their litter box...I mean sand box Islam is a political movement designed to install Sharia Law...He doesn't want the creatures No-one does. There is NO such thing as a Moderate Muslim- And BTW Zionist Jews are JUST as Bad.","commenter_a":"That's a stupid question! It got that way because Dick Cheney ordered George Bush to depose Saddam Hussein. All HELL broke loose after that.","post_message":"BBC Middle East Correspondent Jim Muir explores the state of the region he's covered for decades."},{"comment_id":"918281018215139","commenter_b":"All depends on how many illegals are allowed to vote!","commenter_a":"Nobody","post_message":"We’re now a little more than a year away from the 2016 presidential election and Hillary Rodham Clinton, long-time Democratic front-runner, has set her sights on the Oval Office. Who in the potential Republican field can beat her? Take our poll. @webpagelink"},{"comment_id":"880834145309668","commenter_b":"Yeah the cunts wife found out through facebook hahah","commenter_a":"@username Will Woods","post_message":"It just keeps getting worse."},{"comment_id":"10154274502374087","commenter_b":"Oh you ALL make me tired. What a bunch of bullshit comments.","commenter_a":"The smartest thing this man has ever said: \"Dr. Carson feels he has no government experience, he's never run a federal agency. The last thing he would want to do was take a position that could cripple the presidency.\"","post_message":"#BREAKING: Dr. Ben Carson has told President-elect Donald Trump that he isn't interested in serving as secretary of Health and Human Services in his administration."},{"comment_id":"842369659142996","commenter_b":"Child abuse has actually increased since Roe v Wade. Abortion logic 101...the baby \"might\" be abused later so we'd better kill her now; the baby might actually get to LIVE in a non-traditional home so we'd better kill her now\". Sheeeesh, the stupidity.","commenter_a":"So many young couples would love to take that precious angel growing inside of you. Please don't murder that innocent baby..","post_message":"You don't get to \"choose\" to kill another human being."},{"comment_id":"1058239930927979","commenter_b":"This woman has to be one of, if not the stupidest person in the world.","commenter_a":"This piece of whale shit....no I stand corrected, whale shit has a purpose. This Is the very definition of dumbocrat....take your old tired ass and retire you outdated elite POS. You are so far out of touch with the human race just knowing you made that statement makes me throw up in my throat. Please go off to your pasture, dig yourself a hole so I can put an outhouse above it and shit upon your face.","post_message":"\"They voted against their own economic interests because of guns, because of gays, and because of God, the three G’s, God being the woman’s right to choose,\" said Pelosi."},{"comment_id":"1462621683757857","commenter_b":"Facts !!! What a joke, just like her supporters...zombies","commenter_a":"CLINTON IS THE WORST THING FOR OUR COUNTRY.... LYING HILLARY","post_message":"They haven't voted for a Democratic president in two decades or more."}]
