[{"comment_id":"1134617029988407","commenter_b":"GET HER OUT","commenter_a":"Firer her now","post_message":"The death stare comes easy for her because she can blink with all those Botox injections she has had. How many of you wish this chick was on her way out? I know I do. @webpagelink"},{"comment_id":"530303733802764","commenter_b":"Today is your Birthday? Well, then Happy Birthday!!!","commenter_a":"Happy birthday! God bless","post_message":"My birthday wish is that our nation would once again recognize God as our leader."},{"comment_id":"786225381476070","commenter_b":"Thats what fat racist lady wanted the cops to believe. I believe the teens who say the lady started yelling racist slurs and then slapped an underage girl. Then the racist lady called cops and lied to the police saying everyone was unruly and uninvited.","commenter_a":"It was not a pool party by all accounts....a dj set up beside a private pool and the pool was invaded by the people at the dj gathereing. And after being asked to leave by the security guard and being unruly ....the police were called and told a group of black individuals were causing trouble.....that s why th ey were focused on the black individuals....it was not a race thing. ...it was a group of disrespectful unsupervised kids being trouble....and they get attention from all of you...instead if being ignored by the public and handled by their parents....wow they have something to brag about now.....grow up and stay out of it and let the people involved handle it...","post_message":"He ran when the cop pulled out his gun."},{"comment_id":"1043755919078659","commenter_b":"White people...now hear this...You have no right to tell us black people, when, where, why, and most definitely how to protest anything at all. Besides, your ancestors brought us here, enslaved us here, discriminate us here, hang, and shoot us here...We're still trying to figure out why? 95% of the last 15 shootings since Kaepernick starting protesting, like many before, have been unarmed black males. He just started protesting 3-4 weeks ago. Do the math on that. There is an eradication of my people in progress. We're fed up. It won't be long before WE start shooting back. Bank on it","commenter_a":"322 white people killed by police this year vs 172 backs. How come the media doesn't report on those lives. Stop reporting 1/2 truths and creating race riots.","post_message":"Police confront protesters in Charlotte, N.C., who were demonstrating after police confirmed they'd shot and killed a man while seeking a different person.  FULL STORY: @webpagelink"},{"comment_id":"1041548139262556","commenter_b":"I applaud those who came to discuss the matter at hand. To those who just want to attack me...lmao you have to do so much better than pulling your \"trump\" card","commenter_a":"Good. Maybe the Republican Party can stop killing our soldiers and blaming it on Hilary","post_message":"\"I'm worried that I will be the last Republican president,\" said Former President George W. Bush"},{"comment_id":"702034983304927","commenter_b":"So you ladies that said you'd leave the country, hurry and get the hell out. We don't care for you or need you. Good bye","commenter_a":"These so-called celebrities exist only too the insignificant people they entertain","post_message":"Yes, it's as bad as you imagine..."},{"comment_id":"10153328314986051","commenter_b":"she a bitch who needs to be euthanized,,,","commenter_a":"Lost a lot of the respect that I was feeling for the pope. I don't care who he decides to visit, but why the \"secrecy\"?","post_message":"Pope Francis’s message to Kim Davis during their meeting was short and sincere: Stay strong. Do you support or oppose the stand Davis is taking?"}]
