[{"comment_id":"10154877505644351","commenter_b":"Build it electrify it arm the wall with automatic weapons cameras night vision electrify deep into the ground to kill tunnellers pass new deportTion laws make it a felonie criminal act to border hop punishable by years in a very bad prison","commenter_a":"His whole campaign was based on building a wall!! Of course he should, we need secure borders!!","post_message":"Thoughts?"},{"comment_id":"1144427122283701","commenter_b":"Seriously this woman obviously needs help.","commenter_a":"My cat thinks she's a human","post_message":"She hisses at dogs and often crawls on all fours"},{"comment_id":"10153953951823690","commenter_b":"How can funding settlement building be tax exempt these people are supporting a war.","commenter_a":"As an American, I'm happy to see this. It is long overdue for this to come to light. Being against apartheid SA, then without question supporting Israel is disgusting hypocrisy. That support fuels additional tension between the US and the middle east. It must end and Israel needs to be held accountable.","post_message":"A lawsuit has been filed in a US court seeking to stop non-profit groups from sending billions of dollars worth of tax-exempt donations to support illegal Israeli settlements and the Israeli army @webpagelink"},{"comment_id":"775703385909730","commenter_b":"Lying bitch","commenter_a":"Obama is the divider in chief.","post_message":"So, um, yeah...this went down on \"Meet the Press.\"  Here's the VIDEO if you missed it this morning..."},{"comment_id":"591608484297524","commenter_b":"smh....","commenter_a":"John","post_message":""},{"comment_id":"1052919424727810","commenter_b":"@username go ride your train off a cliff ya Californicator!","commenter_a":"I think we should ban people who wear socks with sandals next! They look even dumber than people using selfie sticks!","post_message":"Planning on going to the Evergreen State Fair in Monroe this year? Well keep your selfie sticks at home."},{"comment_id":"10154576312191037","commenter_b":"@username so if they agree with Her hatefulness that will make them good people? You must have drank her kool-aid","commenter_a":"Most disgusting, despicable woman in America. She and Drumpf are the perfect, hateful, ugly pair that embody everything wrong with the US.","post_message":"She previously called him an \"angry Muslim with a thick accent.”"}]
