[{"comment_id":"867826306655078","commenter_b":"Oooooh ich möchte eine haben!! <3","commenter_a":"Friederike happy Welt-Giraffentag!","post_message":"Happy world giraffe day!"},{"comment_id":"10155157892736729","commenter_b":"HILLARY LIED UNDER OATH SEVERAL TIMES- SHE TOOK FOREIGN BRIBES FOR CONTROL OVER OUR SOVEREIGN NATION- SHE DESTROYED EVIDENCE AFTER CONGRESS DEMANDED IT WITH A SUBPOENA- THOSE ARE REAL CRIMES- WE WOULD BE IN JAIL FOR- THE DEMOCRAT'S SAY COMEY IS SIDING WITH ONE SIDE OVER THE OTHER-FOR POLITICAL REASONS- BUT NOT THE FIRST TIME - WHEN HE WOULD NOT PROSECUTE CRIMINAL HILLARYS-BLATANT INTENTIONAL-CRIME SPREE- NO- ONLY NOW -THEY SAY IT- WHEN IT'S NOT GOOD FOR THEM- THIS NEW FBI INVESTIGATION- IS A JOKE- THEY WOULD HAVE ALREADY PUT HILLARY IN JAIL!!!! **WIKI LEAKS AND THE FBI-ALREADY HAVE ENOUGH EVIDENCE TO PUT HILLARY IN JAIL- THIS IS A SCAM- THIS IS JUST A DISTRACTION- SO HILLARY CAN SAY- SEE- THIS IS NONSENSE- THERE IS NOTHING THERE--CRIMINAL HILLARY HID EVERYTHING BUT NOW WANT'S IT OUT- I CALL BULLCRAP","commenter_a":"Kill yourself you fucking pig","post_message":"Amazing."},{"comment_id":"10153865214066680","commenter_b":"Yea she can teach them how to lie, cheat, and steal.","commenter_a":"Oh yeah","post_message":"“Hillary has spent her entire career bringing folks together on behalf of our kids,\" she says."},{"comment_id":"1274512465962929","commenter_b":"Look at the fucking rat you idiot!","commenter_a":"Ray this is the first one I don't know if I would 😂","post_message":"Would you? #WSHH"},{"comment_id":"10154397725896509","commenter_b":"She should teach her son how to respect women","commenter_a":"Cold Autumnbreeze","post_message":"Sarah Palin speaking at a Donald J. Trump event: \"We need to elect a commander in chief who will respect our troops... you realize that our vets deserve a commander in chief who will let them do their job and go kick ISIS ass.\" @webpagelink"},{"comment_id":"933606760085373","commenter_b":"We should have dropped another one !","commenter_a":"He is the 1st president to do so, sometimes it takes a bigger man to start something else. Maybe after this the Japanese will come to Pearl Harbor and do the same. What is wrong with u people. The man is talking peace and yes what happened years ago was evil on both ends, it don't mean u can pay respects. I hope all presidents from around the world take a piece of what Obama has done to try and end hate because it seems like we are going backwards with trump being so popular. He's making it ok to be racist and hateful and it's not. Happy Friday y'all","post_message":"Pres. Barack Obama lays a wreath at the Hiroshima Peace Memorial, mourning the Japanese, Korean and U.S. victims of the world's first atomic blast in WWII. @webpagelink"},{"comment_id":"10153999668791756","commenter_b":"Rapists and murderers... Yeah, idgaf about them. Kill them right away and stop wasting tax payer money.","commenter_a":"Not only 27. 27 too many. How many people were proven innocent after decades of being in jail?","post_message":"\"We get it wrong sometimes, and in the death penalty, we just can't get it wrong.\""}]
