[{"comment_id":"10154085328776782","commenter_b":"But if you are here illegal then you are already breaking the law just my thought","commenter_a":"Yes, mainly so it allows/requires them to get auto insurance. Having a license won't make people more likely to be in Oklahoma or use more resources. But if an undocumented person hits my car, I have a better shot of not having to pay for it myself.","post_message":"A newly elected Oklahoma lawmaker is pushing through one of his first bills this legislative session, but it likely to get some pushback from the majority Republican House. Patty Santos has the story: @webpagelink"},{"comment_id":"10154653727828812","commenter_b":"Don't Feed the Trolls","commenter_a":"Oblunder doesn't have a problem spending other people's money. A true Saul Alinsky Elitist.","post_message":"Ellen DeGeneres, Magic Johnson, NBA star Grant Hill, and Hollywood heavyweight George Lucas were among the party-goers at President Obama's blowout birthday bash at the White House Friday."},{"comment_id":"10153208792316336","commenter_b":"Fire her immediately!!! Quit pussy footing around with her!!!!","commenter_a":"And if you believe her I imagine you will be voting for Hillary too. Corruption is alive and well.","post_message":"\"You have to understand, it's not holding back. It's responding appropriately.\"  Baltimore Mayor Stephanie Rawlings-Blake told Fox News' Bill Hemmer she did not give an order for police to hold back as riots broke out Monday night. @webpagelink"},{"comment_id":"1514026052232145","commenter_b":"Omg can you just shut it, you selfish brat!!!!","commenter_a":"Hey I thought he was leaving this country cause he did not like here. Well be gone with your bad self","post_message":"An expletive-filled clip of Kanye West's alleged tantrum has leaked."},{"comment_id":"10157863685855354","commenter_b":"she will be the death of our country","commenter_a":"She ain't no lady. She's a hydra. Think about it- during the whole day every MSM outlet was focused on a 10 yr old comment while- An arms dealer was not charged because he said he'd tell on POTUS and Clinton Russia had drills for its citizens to go to underground shelters The FBI was caught being more than complicit in helping destroy evidence The internet was given away The UN is coming for our small arms- both thanks to POTUS","post_message":"JUST IN..."},{"comment_id":"819559654746124","commenter_b":"PS I certainly hope he doesn't think he's in the same league as Martin Luther King he's not fit to carry his shoes","commenter_a":"MLK Jr. Yes, Al Hell No !!!","post_message":"Martin Luther King, Jr. was a principled Christian who stood for his morals and convictions when fighting the Jim Crow in the Democrat-controlled South. For his courageous efforts, he paid the ultimate price.   Do you support MLK, Jr. and oppose Al Sharpton?"},{"comment_id":"10154083522298352","commenter_b":"Stupid Bitch shit like this makes me sick","commenter_a":"Hang Her High","post_message":"MOTHER ALLEGEDLY ARRESTED FOR POSTING HER BABY ON A LEASH EATING DOG FOOD AS HER \"NEW PET\"  READ & COMMENT BELOW:"}]
