[{"comment_id":"10153744773906880","commenter_b":"Huge write-up on a banker. He took billions of dollars from loser investors. Enron? Says it all. The greatest corporate collapse in US history. Great spin on a shark.","commenter_a":"Jason Espeseth Scott Arnebold","post_message":"He's taking on the issues that no one else wants to confront."},{"comment_id":"1694121650829136","commenter_b":"@username the immigrants themselves cannot legally however once they have a child in America we won't kick them out because they have to raise there American born child this is the idea called anchor babies","commenter_a":"What about his son? His wife is from Hungary right and his other kids had a Mother not American. How does that work?Ship them back I guess.","post_message":"\"No, it’s not in the Constitution. If you read and if you look, and if you go to the real scholars, like different people that I can give you, they will tell you.\" – Donald Trump  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"870445706335391","commenter_b":"Life starts when your born. Read the Bible partically when god breathed into Adams lungs and life started","commenter_a":"Every life matters!! Save the unborn today","post_message":"Tell Congress to protect the unborn!  Click below to urge your Congressman and Senators to cosponsor the Life at Conception Act!"},{"comment_id":"10153108653466770","commenter_b":"Psycho woman.","commenter_a":"Ho hum!!!","post_message":"Debbie Wasserman Schultz says Donald J. Trump's “misogynistic comments” are “reflective of what the entire Republican Party stands for.”"},{"comment_id":"10150576091714999","commenter_b":"Another highly paid rapist.","commenter_a":"@username...good or bad?","post_message":"Sports Alert: Jameis Winston, the star quarterback from Florida State Seminoles Football who played under a swirl of controversy, was chosen first over all in the NFL draft by the Tampa Bay Buccaneers."},{"comment_id":"1949307655356344","commenter_b":"Lies alternative facts deceitfulness racism and separation was exactly what Obama and the Democrats have done way before Trump was elected....that is why he won and until democrats realize it then Trump will get 8 years. I am a registered Democrat and I realized in this election just how racist lying criminals they are I voted for Trump and will give him a chance. I will never vote Democrat again as long as they keep doing what their doing by destroying this country","commenter_a":"I am not a Trump fan but I do believe in freedom of expression be it what it may We all have a right to voice our opinion and if she chose do it the way she did we all have to respect that America has always been great and Trump did not bring that greatness he has brought lies alternative facts deceitfulness racism and separation of a great country . I only hope that he is stopped before he deletes all the greatness in which this country was founded on","post_message":"24 Hours After The Grammys \"Make America Great Again\" Singer Posts Stunning News"},{"comment_id":"977190145651659","commenter_b":"Hey ship them all to Canada they like the trouble makers. Attention Muslims get out of the USA we don't want you here!","commenter_a":"Private school or home school. It's worth the sacrifice.","post_message":"#IStandWithAhmed was trending on social media nationwide as people expressed their support for the teenager."}]
