[{"comment_id":"760258614149329","commenter_b":"She need to be grabbed by the pussy","commenter_a":"Agree! Stop whining you liberals!","post_message":"Nicole Kidman: “I would just say he’s now elected, and we as a country need to support whoever the president is, because that’s what the country’s based on.”"},{"comment_id":"10153848285134497","commenter_b":"In others words BITCH, BYE!! Am I speaking your language now?","commenter_a":"But on a real level...this is what all parents should do with their offspring when traveling.","post_message":"\"Look at that, she not even stirringwhat a perfect sleepy angel!\""},{"comment_id":"611669965660278","commenter_b":"Hillary shouldn't be the Democratic nominee for the Presidential Election. She should be an inmate in a maximum security prison!!!","commenter_a":"well that would include her also wouldnt it, you know, being funded by the saudi's and all !","post_message":"FUNDING TERRORISM --- AND THE CLINTONS."},{"comment_id":"1384175518259929","commenter_b":"Oh maybe he doesn't want the Hillary supporters burning down our country!!","commenter_a":"Y'all got conned. 😂😂😂. Only idiots would believe him. Go ahead, chant \"Lock her up!\" If there was a reason to, he would - but there isn't.","post_message":"President-elect Donald J. Trump does not plan to pursue charges against Hillary Clinton for her personal email server or allegations of pay-for-play at the Clinton Foundation, senior adviser Kellyanne Conway says. @webpagelink"},{"comment_id":"10152946649009641","commenter_b":"While I despise Islam I don't hate Muslims.. At all! It's not their fault if they're born in it. But I agree with letting no more immigrants into west! None!!","commenter_a":"allTerrorists should be killed to make the world better","post_message":"Gunfire echoes from two police raids ending terror sieges around Paris. One witness says: \"It's like a war.\" Another describes how a suspect told him: \"Go, we don't kill civilians.\" @webpagelink"},{"comment_id":"1578043845546293","commenter_b":"Uhhh...Hillary won the election by 2.7 MILLION (and counting) votes.","commenter_a":"Another fake poll.... Just like the poll that claimed Hillary was going to win the election ..... Lie... lie.... Lie!","post_message":""},{"comment_id":"10153206762797377","commenter_b":"That's right!!! They have started doing everything you have talked about! Next they will start Building the Wall!!!! Lmbo!!!! Go Mr Trump!!!","commenter_a":"They can`t stop the peoples chose for Trump that`s already there!!","post_message":"Trump Tweets: Wow, because of the pressure put on by me, ICE TO LAUNCH LARGE SCALE DEPORTATION RAIDS. It's about time!"}]
