[{"comment_id":"10152658308576680","commenter_b":"I don't know why your playing around with her. You need a special prosecutor ,this way she needs to comply or go to jail.","commenter_a":"WHY!!!??? SO she can try to hide more stuff??","post_message":"The House Committee on Benghazi has given Hillary Clinton an additional two weeks to respond to a subpoena asking for her private emails on Libya and the 2012 terrorist attacks."},{"comment_id":"725495814307663","commenter_b":"Hillary is a virus!","commenter_a":"That's Tillery when we're not really being serious about lives of American citizens. She's a disgrace to represent any American. Trump 2016!","post_message":"Trump Just Leaked A Video Of Hillary Clinton That Could End Her Campaign [VIDEO]  She is panicking. See this video before it gets scrubbed from the internet.  Do you think Hillary has no place in our White House?"},{"comment_id":"1271510422882923","commenter_b":"Momma ain't raise no bitch","commenter_a":"I love how everyone says stop snitching but if he/she dosnt snitch he/she could go to prison as well for withholding information. I dont give a fuck my freedom is worth more then their freedom sorry not sorry. *Heres a little side note i have an extreme case of dyslexia so if my grammar is terrible i apologize *","post_message":"\"What r u going to gain from it\" "},{"comment_id":"10153068305271051","commenter_b":"She is legal","commenter_a":"fire the cop,he must like young girls.","post_message":"This teen girl was with her friends when a police officer started hitting on her. She decided she wasn’t interested. Bad move."},{"comment_id":"1839777972919599","commenter_b":"Ja i steh drauf ❤️","commenter_a":"@username 😂😂😂","post_message":"yassss"},{"comment_id":"1031885216864241","commenter_b":"no kidding wow","commenter_a":"Kerry is a moron!","post_message":"If only he could've predicted their reaction..."},{"comment_id":"10153063718888606","commenter_b":"What would be said if they were male teachers and little girls.... Sick is sick.... They need to go to jail and be on the sex offenders list.....","commenter_a":"Definitely a crazy world we live in!","post_message":"Two California teachers are accused of having sex with students while on trips to the beach, which included one overnight occasion. Police describe what happened here: @webpagelink"}]
