[{"comment_id":"10153171684108352","commenter_b":"Gun or no gun this girl would have stabbed him. And believe me, I would have too.","commenter_a":"And why do kids have access to guns?????","post_message":"Florida sisters, aged 15 and 11, are charged with murder of 16-year-old brother who they shot dead"},{"comment_id":"10153026927846051","commenter_b":"Cut down on fraud and kick out the illegals","commenter_a":"I live in Arizona. Thank you Gov. Ducey. So much welfare fraud. So many illegals getting enough benefits, to make you see red! 4 million people waiting in line to come here legally. They have been put on hold to accomodate the illegals. This is sooooo wrong.","post_message":"This state just reduced the amount of time people can spend on welfare to the shortest in the whole country."},{"comment_id":"10153159279537452","commenter_b":"^^ wrong house","commenter_a":"How about the government stay out of our homes.","post_message":"THIS JUST IN: The Los Angeles City Council unanimously voted to require guns that are stored at home to be kept in locked containers, disabled with a trigger lock. abc7.la/1GGHSUi"},{"comment_id":"1146022832118940","commenter_b":"How much did this investigation cost you???? Lying bitch.","commenter_a":"Hey liar, the FBI doesn't release information on investigations.","post_message":"Clinton is calling for the FBI to release more details on the investigation, saying \"the American people deserve to get the full and complete facts immediately.\" Agree or disagree?"},{"comment_id":"1619415335012246","commenter_b":"Who do they think they are that they can come over to our country and try to change it? When they come here they have to obey our laws! This is our country not there we were to go to their countwe would have to obey their laws!","commenter_a":"Love the US & abide by our beliefs & the law of our land. Under God we trust & our constitution. Or GET OUT period.","post_message":"Here response is sickening.  These radicals must be stopped."},{"comment_id":"10157872915845354","commenter_b":"Sadly, anyone can be an American these days, just run across the border or call yourself a refugee. Too many problems...","commenter_a":"I'd prefer \"firearmS\"","post_message":"Amen!"},{"comment_id":"10153875046907235","commenter_b":"So did Ollie North! The fuckery.......","commenter_a":"\"Former United States Attorney general sold guns to drug cartels.\"","post_message":"WHOA"}]
