[{"comment_id":"1037555982922868","commenter_b":"GB = Greedy Basturds!","commenter_a":"Where does he live now?","post_message":"Tony Blair’s office said there would be “no negotiations” over his fee, which per-minute is higher than the yearly salary of someone on minimum wage in the UK."},{"comment_id":"1806351676274393","commenter_b":"My body is mine Mario, and a pregnancy I would carry, would also be my decision. You get no say. Your ignorance proves you shouldn't have any. You think no women in your country get abortions? No, they get unsafe back-alley or home abortions. Men should absolutely not get to make legal decisions over what occurs within a woman's body.","commenter_a":"Your body is your choice only when your body will have 2 heads 4 arms 4 legs..if you want a choice you should buy a pack of condoms or close the oval tubes..stop abortion in Gods name.","post_message":"In Mike Pence's name"},{"comment_id":"692662477538954","commenter_b":"This American Woman supports Trump and I feel more comfortable just thinking about Trump being the POTUS, then I have ever felt the whole time Obama has been POTUS","commenter_a":"As a woman, I wouldn't trust Obama unless I was armed. As a woman, I wouldn't vote for Hillary unless I was voting to send her to the nearest blackhole. Trump is not perfect, by any means. But he's infinitely better than what's currently fouling up the White House.","post_message":"What do you think about President Barack Obama's statements regarding Republican women and Donald J. Trump?"},{"comment_id":"1079981378728005","commenter_b":"Sick Bitch","commenter_a":"She's an immigrant through and through!","post_message":"WOW. Just...Wow."},{"comment_id":"1037567749698799","commenter_b":"Facebook is trying to silence him tonite","commenter_a":"Completely cut off","post_message":"Watch Live: Donald J. Trump holds a rally in Sterling Heights, Michigan."},{"comment_id":"10153611062907217","commenter_b":"#LetAmericabebadagain trump2016","commenter_a":"If you vote in this racist idiot as your president , Your country will be going down the shitter for many many years to come. The guy is a nut job who hasn't got a clue !! He's a threat to world peace ... Anyway good luck America","post_message":"\"I am offended. Those are very rude statements.\""},{"comment_id":"1021100727949032","commenter_b":"I'm no a socialist I'm a total independent from the corruption government..I'm so proud of myself","commenter_a":"Bernie Sanders it's a socialist.. !!","post_message":"We're live in the #GOPDebate hall!"}]
