[{"comment_id":"1835608856683220","commenter_b":"What shut the fuck up","commenter_a":"Nazi Supremacy! Disgusting Asshats!","post_message":"The university stated that Richard Spencer's views are 'in direct conflict with our core values.'"},{"comment_id":"525067284350518","commenter_b":"Leave our country. Go home and behead your own.","commenter_a":"Leave!","post_message":"Texas sends huge message to Muslims everywhere, and they're not happy.  Let them be angry. This America and if you don't like it, get out.  Do you agree that Muslims should assimilate or leave?"},{"comment_id":"1241041889268599","commenter_b":"Kelly is an ass wipe. Acts like a two bit sleazy pig with her bottle cap tits, ya know the ones she like talking about","commenter_a":"Get rid of her","post_message":"Megyn Kelly reacts to Trump's Florida speech.  @webpagelink"},{"comment_id":"1021163441238000","commenter_b":"The next deaf girl I encounter will hear me cumming","commenter_a":"Lucy Truelove","post_message":""},{"comment_id":"10157089622540206","commenter_b":"White woman","commenter_a":"@username racism at it's finest","post_message":"“Because we aren’t whitewashed enough in Hollywood, apparently,” BET tweeted."},{"comment_id":"10154522993923854","commenter_b":"She's a crazy idiot!","commenter_a":"TIME TO END THE CLINTONS POLITICAL CAREERS NOW..","post_message":"IT TURNS OUT HILLARY CLINTON IS THE ONLY PRESIDENTIAL CANDIDATE WITH TIES TO THE KKK"},{"comment_id":"10153740832391800","commenter_b":"Chris, honey, being a salty bitch isn't going to solve the problem.","commenter_a":"Islamic Extremists: Kills people that don't share their beliefs, Christian Extremist: Kills people that don't share their beliefs! I say, we should worry about these pro-life extremist before we worry about extremists on the otherside of the earth!","post_message":"In the wake of a shooting at a Colorado Planned Parenthood, the media questions whether or not it was an act of domestic terrorism.  ►Watch last night’s full episode now: @webpagelink"}]
