[{"comment_id":"10154071850239456","commenter_b":"Look for Huckabee at VP","commenter_a":"He will make a great VP","post_message":"Do you think he made the right decision?"},{"comment_id":"10154416362313984","commenter_b":"It's so so wrong these thugs get by with this lawless This is Obamas America If it were white folks going against ANY minority's you can believe the law would be doing there job . But this is what Obama wants anything to keep Trump shown as the one causing all the trouble . Loretta Lynch is his puppet ( what can I do to please you master Obama? ) All Americans should be outraged at this complete lawless . I pray Trump can win.Not because he republican but Hillary will carry out this lawless policy . She wants Power folks power over you great Americans that work so hard to support your families and give to every illegal that comes in our country She wants 65,000 Muslims in without vetting them . It's all about votes","commenter_a":"SHERRIF CLARKE!!! YAGOTITRITE!!!! STICK TO YOU GUNS!!!! We are all PROUD OF YOU!!!!!","post_message":"Sheriff Clarke just took down the United States Department of Justice and Barack Obama in one fell swoop...  Do you agree with what Sheriff David Clarke just said?"},{"comment_id":"10153554179988984","commenter_b":"This twat is too dumb to breathe on her own","commenter_a":"Ignorant. I wonder what rock they found her under.","post_message":"I've heard a lot of crazy things from liberals, but this has to be right up there at the top of the list...  Has this woman's PC \"outrage\" gone too far?"},{"comment_id":"543375892529200","commenter_b":"She wouldn't survive!","commenter_a":"She should go to Sinaloa, they've been purging for a couple of years now, plenty of Mexicans to choose from there","post_message":"\"I would kill as many Mexicans as I could in one night.\"  A waitress, who was apparently upset that a customer didn't leave a tip, has been fired after she tweeted a racist comment."},{"comment_id":"785581448243402","commenter_b":"The people who are voting I know this is past but I can't vote for someone who can't keep our ambassadors safe and than with no feelings states what does it matter their dead well would she say that to if it was her family I as a lifetime dem. has changed my vote to rep. And if woman are smart trump hires woman, his wife's have their own jobs and buisnesses, and despite what Hilary says habout equal rights can woman want equal rights when you say men, have to clean up ,or need to be better looking, but if a man says it we can't take it what's good for the goose is good for the gander than we should be able to take it , rosie deserved what she got , and so did othe trump doesn't hate woman and to tell the truth hilarys open borders ...","commenter_a":"Funny that Hillary claims she wants to follow Obama steps after she has criticized him. Let's not forget this is the woman that as New York Senator voted for the Iraq War and in her own words she did it to thank you for George W bush help to New York during 911.","post_message":"\"She’s battle tested, she’s got a dirty uniform, and that’s who you want fighting for your kids’ future.\""},{"comment_id":"10153540502734411","commenter_b":"Wow--look at that face. That woman needs to smile more.","commenter_a":"Links of blood and marriage tied Battenbergs/Mountbattens to Germany/or.also Saxe-Coburg-Gotha into \"Windsor\" didn't transform Edward..","post_message":"'She was a child when this film was shot, long before the atrocities of the Nazis became widely known. But Edward was already welcoming the regime as Prince of Wales in 1933 and remained pro-Nazi after war broke out in 1939. He could well be teaching the Queen and Princess Margaret how to do the salute.'"},{"comment_id":"579381068889728","commenter_b":"BUILD THAT WALL AROUND TRUMP","commenter_a":"#BUILDTHATWALL","post_message":"Donald J. Trump joins supporters in chanting, \"Build that wall!\""}]
