[{"comment_id":"10154249832173128","commenter_b":"U.S. has a mind-boggling number of minimal wage jobs that do not involve any tipping at all. When was the last time you tipped a cashier at Walmart? Why waiters or taxi drivers are any different? Sure, if they can't cover their basic costs, just raise the rates.","commenter_a":"Oh, wow! This is new. When Uber came out, there was an automatic tip in your setting that you could set for yourself.","post_message":"\"I’m working at rock bottom now, and not having tips is part of the problem.\""},{"comment_id":"10153553565406955","commenter_b":"I can't wait until a loonie lib woman gets attacked by a filthy Muslim","commenter_a":"Muslims versus liberals...this is going to be fun.","post_message":"Topless protesters disrupt Muslim conference in Paris..."},{"comment_id":"10154426729152446","commenter_b":"Wtf. Who do they think they are. Little unqualified woman","commenter_a":"wth???","post_message":"@webpagelink"},{"comment_id":"674485572723233","commenter_b":"she needs to sit down and shut up","commenter_a":"Talk about a nightmare! Handler, look in the mirror!","post_message":"Lefty comedienne Chelsea Handler goes on a racially charged rant against Trump.  Just imagine if a conservative said anything like this?"},{"comment_id":"10153522197479255","commenter_b":"Fuck you, lady.","commenter_a":"This people have been drinking the Kool-Aid!!!","post_message":"Obama is officially the best president the U.S. has had in a long, looong time.  By Daily Kos user PCalith"},{"comment_id":"458537397670174","commenter_b":"NO She can Stick it !!!","commenter_a":"No way and the kids are not going to either.","post_message":"Will You Cave To Michelle And Only Eat Where She Wants?  Comment 'yes' or 'no'."},{"comment_id":"488312324683981","commenter_b":"Hmm if firearms are a replacement for a small penis what are females replacing with firearms @username???","commenter_a":"Gun Worship in The United States of Guns is Killing US...","post_message":"SCARY!!"}]
