[{"comment_id":"1005304559506884","commenter_b":"@username wow dude! go tell that to china, india, russia...they pollute the air you breathe in an astronomically higher number , last i checked, the earth only has one atmosphere.","commenter_a":"God be with you and your team as you go forward for our great state of Kentucky.","post_message":"\"They bribe us with our own money to stick it to ourselves. And we will not do that anymore in the state of Kentucky.\""},{"comment_id":"10153955830944087","commenter_b":"Never trust a woman in a white pants suit.","commenter_a":"No bitch, that's not how this works!","post_message":"#BREAKING: Hillary Clinton accepted the Democratic Party’s nomination for president Thursday, making history as the first woman to lead a major political party."},{"comment_id":"10154239643734411","commenter_b":"Evil Bitch","commenter_a":"That last one killed me, oh man","post_message":""},{"comment_id":"596327983852216","commenter_b":"@username... The woman is CHEATING. She's actually bussing mentally deficient people to the polls to vote for her! She and Bill are colluding to steal elections by interfering with voters at the polls! She is so despicable, and frankly, anyone who knows about this stuff and supports her anyway DESERVES a Trump presidency.","commenter_a":"(DISCLAIMER: YES I VOTED FOR BERNIE IN THE PRIMARY. THE FOLLOWING POST CONCERNS A HYPOTHETICAL SITUATION WHERE HILLARY IS THE NOMINEE) To the Hillary bashers, you do realize that she is ideologically identical to Bill Clinton and almost identical to Obama, right? If you found those presidencies to be solid, ok, or even mediocre, that is a hell of a lot better than the potential authoritarian nightmare we have coming with a Trump presidency or republican control of all of government (see Kansas or Louisiana for what happens when the tea party can do whatever they want unchecked). And yes, again, I voted for Bernie in the primary.","post_message":"One thing is certain: While I’m excited to cast my vote for Bernie Sanders next month, I’ll be more than ready to cast my vote for Hillary Clinton in November."},{"comment_id":"1160164500670245","commenter_b":"@username did you forget to take your happy pills? LOL","commenter_a":"I am so over this. We need to worry about the homeless and disabled right in front of us, not hunting regulations in another country over one dead lion. Take the money you spent getting to this guys house and buying paint and feed someone today.","post_message":"Raw meat, animal crackers and spray paint were used to vandalize the Florida vacation home of lion-hunting dentist Walter Palmer."},{"comment_id":"10154189753241130","commenter_b":"Hillary is way too smart, too tough and too focused on governing well to let these kinds of insults throw her. And Tina Fey said it best: Yes, she's a bitch and that's great because bitches get things done!! I think Hillary should own it and we should all get behind her! I'm ready to get my bitch on, how about you?! #I'MWITHHER Vote for Hillary Clinton!","commenter_a":"Already seen and heard it.","post_message":"If Hillary Clinton wins in November, brace yourselves."},{"comment_id":"10150751541914999","commenter_b":"Racists get uncomfortable when a mirror is held up to their face! No problem with unarmed Black men and women being slaughtered on a daily basis in a country that prides itself on being the greatest nation on the face of the earth. I mean, even the United Nations thinks there's a problem. Go figure! And any attempt to prove otherwise just simply means you're racist!","commenter_a":"Wah wah. Shut up and do your job.","post_message":"The Miami police union say Beyoncé had aimed to “divide Americans by promoting the Black Panthers” during the Super Bowl 50 halftime show."}]
