[{"comment_id":"1189264781194585","commenter_b":"Bet you swat flies, stomp spiders and spray bug spray around. Insects are living creatures and so is mold.","commenter_a":"Sick !!! Well no excuse weither crocodiles kill humans or not humans are the sickest living creatures on earth they do things to get kicks and enjoyment","post_message":"Vile."},{"comment_id":"10152892067227144","commenter_b":"Far more competent and capable than anyone out there on either side!","commenter_a":"If she is the best we dems can do, we are in bad shape.","post_message":"The time has come."},{"comment_id":"10154375945924749","commenter_b":"The man is a afgan veteran , a marine and a Muslim. I am a Hindu and I know , Imran name does not exist in us.","commenter_a":"Two Muslim brought up in America one killed 50 and the other saved over seventy, both are Muslim , it is not Islam, it is the illness inside each of us.","post_message":"Imran Yousuf decided to “take a chance” and it paid off."},{"comment_id":"1233486323342287","commenter_b":"Would rather have this girl as president than hillary.","commenter_a":"As a tax payer I don't mind paying for something like that.....I can't be mad....","post_message":"This 4.95 GPA student revealed her status as undocumented immigrant during her graduation speech.  #MicBrights"},{"comment_id":"10153481312808352","commenter_b":"There are other things to focus on ladies. Move on now.","commenter_a":"She looks like like a 10 year old boy with boobs. Way to skinny. You need some curves. She just looks hungry.","post_message":"Woman who got super-toned in SIX WEEKS taking body selfies (and found it so motivational, she launched an app so others can do the same)"},{"comment_id":"1007038892685973","commenter_b":"Liar liar","commenter_a":"@username for President of the United Sates of America, 2016-2024!!","post_message":"Read the texts Hillary sent some friends last night during the GOP debate."},{"comment_id":"10154356855773256","commenter_b":"She's an idiot","commenter_a":"She copied a kiwi who did this. Lame","post_message":"If others have the right to have their opinions of the divine reflected in their driver's license photos, then so should members of the Church of the Flying Spaghetti Monster."}]
