[{"comment_id":"10156442483085231","commenter_b":"Bitter Brother Committee..... If he didn't want a kid he should've strapped up....but since he wanted a souvenir from Ciara the singer, but not from Ciara the woman, he has a fiscal responsibility to provide for his kid....that's so 1940 to say \"she trapped him\" because a man can alleviate all of that by condom, vasectomy or not \"bussing it wide open\".....if they're so worried about \"getting trapped\", they should do something about it...I mean since \"females\" are sooooo devious","commenter_a":"She stay eating off her dudes... First it was Missy, then bow, then 50, then future, then Russell, now future again... That snatch is a trap... Russell better tread carefully","post_message":"Loose lips causes lawsuits. Ciara isn't playing when it comes to protecting her name and son."},{"comment_id":"951268851580640","commenter_b":"Nadia: You must one miserable bitch in real life. you have the nerve to pretend to know Shannon well enough make the unfounded assumptions you just made. You have no idea what her function at Walmart even is yet you make this idiotic comment. Let me guess, you hate YOUR job and so have this need to crap on others? Her simple point was that it's a myth that all Walmart employees are on or qualify for foodstamps. Keep on hating and being ignorant!","commenter_a":"I have worked at walmart for ten years. I don't even qualify for wic because I make too much money! And with my first baby on the way I could have used the assistance. Not every single walmart employee is on food stamps. Oh and I also bought a house, got a nice car, all while working there....crazy","post_message":"That's a one cent difference, folks. Only *one* cent.  Many thanks to Slate.com for the image (and the facts)!"},{"comment_id":"584420751713216","commenter_b":"STOP muslim immigration permanently !","commenter_a":"Yes!!!! And not just muslins!!!!","post_message":"Question of the Day: Should we halt Muslim immigration until the federal government can get it under control?"},{"comment_id":"10153214192574170","commenter_b":"Could care less what she thinks !!!! LEAVE AMERICA!!!!","commenter_a":"Her opinion is s💱t Like her music Ghetto monkey opinions on race is ignorant and illegitimate Black rap culture is immoral dishonorable and gross","post_message":"I know, I know. \"who cares about some rapper?\"  The sad answer is \"a lot of people.\"  Conservatives have failed to engage in the pop-culture space for too long. That needs to change."},{"comment_id":"10153137487806336","commenter_b":"Because 'not topless' she would never make the cover. Topless, she is on the cover. Follow the money.","commenter_a":"Why the hell do you have to pose topless to represent yourself? She plays golf, she's not a go go dancer so pose with something that represents your sport. As it is all she represents is the moral decay of America.","post_message":"\"I decided that I wanted to do it not only to represent myself as a professional athlete and a golfer, but to represent just all women athletes in general.\"  LPGA golfer Lexi Thompson appeared on 'Fox & Friends' to address criticism of her controversial \"GolfDigest\" cover photo."},{"comment_id":"1743528099240171","commenter_b":"Why did he choose to only visit those living in North Baton Rouge?","commenter_a":"Our great president. A day late and a dollar short","post_message":"We're in Baton Rouge where President Obama is landing to tour the flood-ravaged city after facing criticism for not visiting sooner. (No audio) @webpagelink"},{"comment_id":"10153604514287293","commenter_b":"@username Deport the illegal immigrants in Palestine, back to Minsk, Krakov, Vilnius and Brooklyn, where they were BORN.","commenter_a":"Stop all to the Israeli Colony.","post_message":"“Even the United States doesn’t have anything as complex, as sophisticated.”"}]
