[{"comment_id":"10153600253057431","commenter_b":"Well stated @username. Irony received. 😉","commenter_a":"White supremacist exist whether as paramilitary, or the idiotic Trump supporter who thinks he owns everything and everybody telling a Hispanic American (Jorge Ramos) to go back where he came from, to people who will destroy other cultures way of life for a dollar because they have no respect for others. They are so pervasive the only way to resist them is for people of color to band together. To pretend white supremacist don't exist or that they will magically disappear is to ensure their continued control over our lives. Working together to overcome an evil is not anti-American, it's just common sense.","post_message":"Fighting White Supremacists: Don't Forget, We Are In It Together!  @webpagelink"},{"comment_id":"10153585034949497","commenter_b":"Eh you know how the hot chicks are...","commenter_a":"Area Gisele fails to properly deflate Tom Brady's balls","post_message":"The NFL has debuted new rules pertaining to the quantity, air pressure, inspection, labeling, and monitoring of game-day balls"},{"comment_id":"10153182332356051","commenter_b":"i dont read anything about this lying bitch","commenter_a":"Hell no","post_message":"Here is how Hillary Clinton is defending herself against the e-mail scandal. Do you believe her?"},{"comment_id":"843506072460327","commenter_b":"Nina Turner is wrong and she knows it!","commenter_a":"She obviously never Studied JFK","post_message":"Sanders’ camp: Democrats ‘court disaster’ with Clinton"},{"comment_id":"877412165685172","commenter_b":"As long as you're legal. Either way, hard work or not your family broke the law so you're criminals. It's the truth. The country is better off without illegals.","commenter_a":"Please please all illegals and Mexicans and Mexican-Americans keep posting your stories. We need to show Trump and his ignorant followers the truth!!! Post your stories. Post your families stories. Flood the Internet and Facebook with the truth of why people of every nationality and every nation come to America!!! Make it known and state the facts and truth!!!!!! Bring ignorance to its knees.","post_message":"She really nailed \"The Donald!\""},{"comment_id":"959204997435717","commenter_b":"Well.... sometimes women are raped...","commenter_a":"Will this decision really stand? Don't get my hopes up.... Can it be vetoed? Will it stand? (I hope it stands but We the people have been asking them to defund PP for a long time and they haven't listened!)","post_message":"This Congress and its relevant committees must complete a thorough investigation of the disturbing accusations evidenced in the Planned Parenthood videos before another taxpayer dollar goes to this controversial organization. These funds can be better used providing legitimate health services for women in places like North Dakota"},{"comment_id":"578168169046751","commenter_b":"We do still have freedom of religion but I think these women would be so much better off just being free of wearing a hijab. Their so oppressed by men. Dumb the religion and live your life without restraint","commenter_a":"Let's say wear whatever you want in public, but when you go into a store, gas station, etc., EVERYTHING comes off from the neck up. Sunglasses included. And how about we lower the surveillance cameras to head height so we can get a decent face picture instead of a grainy aerial shot. Why are we continually so bad at surveillance? Be whatever religion you want, but for everyone's public safety, we deserve to get a good look at you so we can quickly identify you later on. Nuf sed.","post_message":"Pretty soon it may be illegal to wear a hijab in public in Georgia. Do you think the ban would be a good thing?"}]
