[{"comment_id":"1732772313625197","commenter_b":"Screw those DUMBASS muslims Go to Jail,, Go to Hell,,, Go back to the desert,,,,, JUST GET OUT OF OUR COUNTRY !!!!!!","commenter_a":"If muslims want to live here then they must adhear to our laws, period. If they don't, they can move on to an islamic country..","post_message":"Muslim Woman Refuses To Take Off Head Scarf In Court, So No-Nonsense Judge Does THIS    In our country you have to follow the laws of our court. If not,  suffer the consequences.  Do you support this no-nonsense judge?"},{"comment_id":"10154512852146350","commenter_b":"@username I'm well aware that her mother is white. Someone should let HER know that","commenter_a":"Alicia Keys is so talented and beautiful. It's really a shame that she's a racist.","post_message":"\"It's about just being who you are and not letting anybody tell you who you should be, Alicia Keys said."},{"comment_id":"685418174982094","commenter_b":"Why don't they take those liberal bitches off the air","commenter_a":"These women need to think before they speak","post_message":"The View is going to be taken off the air after host says this about candidate on live TV. This show is disgusting liberal trash. Put an end to the show already. Can we get 100,000 'LIKES' to have The View cancelled?"},{"comment_id":"10153227250726336","commenter_b":"Why did your daughter just bought a 10.4 million apt. What are you paying her away.","commenter_a":"Taking in millions of $ in the name of charity and only 12% actually goes to poor/charity......The Clinton Foundation is the family business for these two and supports them and their friends and family. DISGRACEFUL! But people are so blind and uninformed when it comes to Hilary and Bill...","post_message":"Former President Bill Clinton said there's nothing \"sinister\" in trying to get wealthy people and countries to spend money in a way that helps the poor."},{"comment_id":"1699094263675768","commenter_b":"Let's review the facts: The shooter was a Muslim. He pledged allegiance to the Islamic State. He targeted people that patronized a gay nightclub in the U.S. Daesh executes homosexuals. Jihadis don't believe in coexistence and they don't spare pacifists. Oh, and you cannot reason with these savages. Questions?","commenter_a":"And Obama and Hillary want to disarm us and bring a hundred thousand of these kind of people over here","post_message":"Breaking News: Police say 50 people were killed and 53 were injured in the Orlando nightclub shooting and are asking the governor to issue a state of emergency.  Fox News can confirm that the gunman is Omar Mateen, 29, of Port St. Lucie County, FL, a US citizen of Afghan origin. @webpagelink"},{"comment_id":"10154341383138067","commenter_b":"yeah,I think it is a great idea because Arnold make America ruined again and Donald make Apprentice again","commenter_a":"Publicity stunt. Stay tuned America","post_message":""},{"comment_id":"10153115741995950","commenter_b":"That is BULLSHIT there terrorist right now in AZ 1out of 4 children are starving obama cant feed and house. Ours so what the hell he is gonna feed and house them. You hate the US you love terrorist get the hell out of here","commenter_a":"Good!","post_message":"NEW: The U.S. is preparing to accept at least 10,000 Syrian refugees in the next fiscal year, which begins in October."}]
