[{"comment_id":"10153183802333188","commenter_b":"\"The walking dead\" are serving as most of our representatives in Washington, take a good look next time someone speaks to the Congress.","commenter_a":"Why do you think it's so good? It prepares us for what we might expect in a SHTF scenario.","post_message":"I don't watch The Walking Dead like most people..."},{"comment_id":"882209121877695","commenter_b":"When they said the meek would inherit the Earth, I don't think they meant the stupid. Unless they did and if that's the case someone is so fired for reading that wrong. But I am sure that isn't the case. Though that means god is going to be ever so pissed. At least everyone of these blind hate filled asshats will be happy to know Hell is warm year round forever.","commenter_a":"Kudos to them \"good 'ole white boys\" for doing there part against ISIS by attacking an innocent old man. They should go fight in Syria if they have the courage.","post_message":"U.S. Sikhs are frequently conflated with Muslims and often wind up absorbing the backlash against Islam."},{"comment_id":"1749918878564870","commenter_b":"What a bitch.","commenter_a":"American Ignorance. Do whatever you will anywhere in the world. Act as if whole world is America. He should humbly accept his sentence and after 15 years teach his fellow Americans how to behave abroad. With respect to other countries and their cultures.","post_message":"Otto Warmbier, a 21-year-old economics student at the University of Virginia, was found guilty of committing “severe crimes” against the North Korean state after he was held for allegedly attempting to steal a political banner from the hotel where he was staying."},{"comment_id":"1538102683151787","commenter_b":"What a bitch","commenter_a":"That was totally uncalled for she was just trying to start trouble!","post_message":"RACIST: Welfare Queen Attacks Man For Being White, Watch What Happens Next [VIDEO]  Racebaiters will never say anything about this.  What would you do in this situation?"},{"comment_id":"10154687828874657","commenter_b":"DEPORT this terrorist!","commenter_a":"Most universities are cesspools","post_message":"Amazing. ISIS recruiters are infiltrating our schools as teachers, now?"},{"comment_id":"632098943657535","commenter_b":"Stank bitch","commenter_a":"Wow!","post_message":"Oh Really? Kim Burrell Preaches a Hateful Sermon About 'Perverted' Homosexuals -- Days Before She's Scheduled to Appear on Ellen DeGeneres [Video]"},{"comment_id":"903880782991323","commenter_b":"Discrimination!!","commenter_a":"I think it something that must be done, especially when children are involved. The effect of cigarette smoke on kids is devastating.","post_message":"A children's hospital announced it will no longer hire employees who smoke: @webpagelink Do you think it's a good policy or too harsh?"}]
