[{"comment_id":"10153600166447217","commenter_b":"^That is a true life goal","commenter_a":"@username And we're sat here watching tv and being casual XD","post_message":"Life goals."},{"comment_id":"901805833201774","commenter_b":"Clown in a wig . She makes me sick","commenter_a":"Better to resign before the s--- hits the fan.","post_message":"Why did Democrat Congresswoman Corrine Brown pay the Chinese embassy?"},{"comment_id":"1063632813696466","commenter_b":"Lol its the food colouring haha I wana try one of those, they're in Japan aren't they? X","commenter_a":"@username fancy a green poo? x","post_message":"This is gross Burger King"},{"comment_id":"10153070666326336","commenter_b":"Kill all the non believers Haider? That's killing innocents!!!","commenter_a":"if anyone believes Iran will not pursue nuclear power they are delusional...they are playing the obama admin the same as every politician before.","post_message":"\"It is necessary that the stance of the U.S. administration be defined about this move.” - Iranian Foreign Minister Javad Zarif"},{"comment_id":"494820657375181","commenter_b":"She needs to shut that big mouth","commenter_a":"She need s to keep her friggin mouth shut","post_message":"Michelle Obama's tries to enforce this on her hometown, but they aren't backing down.  If they can stand up to her, so should the rest of the country.  Do agree Michelle needs to be silenced?"},{"comment_id":"650058555184723","commenter_b":"If they prove he's here under false terms. He an illegal. Hell yes deport him. Send him 2 where he could B put in jail. What a smear on the face of America.","commenter_a":"Would be great if this were true & a Blessing to the USA.","post_message":"Obama to be removed this country after justice department lawyer does this.  Get rid of him. He doesn't deserve to stay in this country.  Do you agree Obama should be deported?"},{"comment_id":"10154576995593812","commenter_b":"And Hillary gets away with what?","commenter_a":"#Belicheater","post_message":"A federal appeals court has rejected Tom Brady's attempt to get a new hearing on his \"Deflategate\" suspension. @webpagelink"}]
