[{"comment_id":"620966654718777","commenter_b":"She is the most horrible stupid idiot that has ever lived. Look at all the destruction she has caused even after her death.","commenter_a":"Neither did Karl Marx.","post_message":"Two attempts -- one small, one large; one entirely private, one government-backed -- have both come to the same conclusion: Ayn Rand didn't understand squat about real-world capitalism."},{"comment_id":"573913712787669","commenter_b":"Yada, yada, yada. This woman(?) Is so full of BS she makes me ill.","commenter_a":"Get over it!","post_message":""},{"comment_id":"10153003184965671","commenter_b":"Remove the millions of illegals. It may be a smaller piece....but it is still huge.","commenter_a":"Somewhat comical given the subject. If you're really worried about climate change and water, STOP GRANTING BUILDING PERMITS that CONTINUE to INCREASE California's population and water requirements.","post_message":"\"Longer fire seasons, extreme weather, and severe droughts aren’t on the horizon, they’re all here – and here to stay. This is the new normal. The climate is changing,\" Brown wrote in a letter addressed to Donald J. Trump.   Thoughts?"},{"comment_id":"1380514481968578","commenter_b":"You're way too late. It's all Hillary now #imwithher","commenter_a":"If you live in a state that has yet to hold a primary, join with Sanders and stop both Hillary and Trump. #nevertrump #neverhillary","post_message":"Ohio Gov. John Kasich will suspend his presidential campaign on Wednesday, a senior campaign adviser tells NBC News."},{"comment_id":"10153479859171337","commenter_b":"Shut up hoe","commenter_a":"Love him. And you know what HE DONT GIVE A SHIT!!!! He tells it like it is. Everybody put your big boy or girl pants on and DEAL WITH IT!","post_message":"WHOOPS: Donald J. Trump made some inflammatory comments about Mexican-Americans, and they're coming back to haunt him..."},{"comment_id":"10155207800518132","commenter_b":"She looks like a drag queen!","commenter_a":"Sad she hates herself so much to keep mutilating her body.","post_message":"Kim Zolciak Biermann is feeling nostalgic!"},{"comment_id":"10154086770281756","commenter_b":"I guess science works when ranchers feed their cows corn instead of grass and then have to shoot up the same cows with tons of antibiotics because they are eating GMO corn instead of organic grass. Guess what? Those antibiotics are transferred to humans who eat meat and cause cancers in humans. Be safe, don't eat meat or during dairy milk.","commenter_a":"Why? Wouldn't this be a conflict of interest? It behooves hospitals to feed their patients meat with as many antibiotics as possible so people would visit again in the future and hopefully for a much longer stay.","post_message":"Hospitals are on the front lines of the battle against antibiotic resistance."}]
