[{"comment_id":"1004458709688902","commenter_b":"Yo entiendo","commenter_a":"@username should fucking be ashamed of themselves. I see that you are just like most Corporate News Organizations which takes a real issue then contort it for your clicks and likes. I am a Black American. I have been living in the Dominican Republic for 3 years. I hold 3 degrees to include a JD and an LLM. I am going to tell the truth and I hope to never see such nonsense like this published again. As I said I been here for 3 years. I came here not knowing a word of Spanish because I as a Black Man wanted to get away from America. I spent 11 years in the Marines also and I have traveled the World and NO WHERE have I been or felt more free than living in the Dominican Republic and that is a very real yet sad statement, a testimony if you ...","post_message":"This Video Sheds Light on the Deep Racism That Black People Face in the Dominican Republic #ABSArchives"},{"comment_id":"1362078013830431","commenter_b":"Cruz....Kiss that ass.","commenter_a":"Mr. President, Please do not squander this opportunity to put a conservative in the Supreme Court. This is extremely important, we do not need someone who's going to be a straddle of the fence. We have too much anti-American government, anti-Constitution battering happening inside our nations capital and a crossed our nation, we cannot afford to make evening a half step in the wrong direction. Please Mr. President I implore you to please hear my request, my plea.","post_message":"Ted Cruz NAILS it, everyone needs to see this!"},{"comment_id":"855492334499315","commenter_b":"Leave her in the hot car","commenter_a":"Idiot to the max.......","post_message":"It has happened again. Police say a woman left her child in a hot car Friday, now she's facing charges."},{"comment_id":"10153009921992507","commenter_b":"I'm with you. I could teach a class in this at this point, because most women DO NOT CLIMAX without clitoral stimulation, no amount of deep thrusting will do","commenter_a":"This is quite common, and enjoyable for the man if he grows up. When she's using the vibrator & he is inside it feels like the penis is vibrating","post_message":"Awkward!"},{"comment_id":"480665305471830","commenter_b":"Dumb, ignorant witch","commenter_a":"Speaking of frauds!! Having a convicted felon as your top surrogate makes me wanna puke. She is spewing lies on every network, when is this P.O.S. going to be held accountable?#KatrinaPierson","post_message":"YES!"},{"comment_id":"859553757415299","commenter_b":"Coming out of the mouth of the most oppressive Fascist in American History!!","commenter_a":"Beat that dead horse. ..beat it some more","post_message":"Attorney General Eric Holder told reporters Friday that the federal government is “prepared” to dismantle the Ferguson Police Department if “necessary.”"},{"comment_id":"10153415193876833","commenter_b":"I no Right, They Don't Want The Public Safe!!!!!! Then the Rioters and Looters would be Looting and Rioting even More and getting away with it as always!!!!","commenter_a":"Does this mean our murder rate will plummet because the gang members won't have guns?","post_message":"The U.S. Seventh Circuit Court of Appeals issued a decision on Monday allowing a Chicago-area gun and magazine ban to stand. Such bans are justifiable, according to the court, merely on the basis that they \"may increase the public's sense of safety.\""}]
