[{"comment_id":"1611989915762064","commenter_b":"Women are objects to Trump- not people. Unfortunately, that's nothing new and despite all the changes in the way our society views and treats women today, they are still objectified. Some women today even objectify themselves- Beyonce, the Kardashians, many others who make themselves sex objects in order to \"succeed\". As a female, you can't be an actress, a musical artist, a broadcaster on CNN or any other job in the public eye unless you're young and attractive. So if you're shocked or offended at Trump's words, you've been living under a rock. There are tens of thousands of men who think and talk like him and they're your fathers, brothers, husbands, co-workers, bosses, judges, CEOs, doctors, lawyers, cops and US Presidents. It's nothing new and it will never change.","commenter_a":"Sad for her. He is such a shameful person.","post_message":"JUST IN: Melania Trump issues statement following release of husband Donald J. Trump's 2005 sexually-charged remarks: \"The words my husband used are unacceptable and offensive to me. This does not represent the man that I know.\" abcn.ws/2dmz2yg"},{"comment_id":"10153979570636378","commenter_b":"@username shut your trashy face","commenter_a":"Hey NFL PLAYERS, you guys got something you can do before the game to protest the mistreatment of POLICE OFFICERS??? HMMM??? Yeh, nothing, I thought so....","post_message":"DEVELOPING: Seven people were shot, including two police officers, after an ambush-style attack that led to a fatal shootout in West Philadelphia. A civilian and the gunman are dead. --> @webpagelink"},{"comment_id":"10154249002506409","commenter_b":"At the opposite end of the mall where Trump stood you are only able to see 1/2 of the mall. That 1/2 had a crowd, the rest of the mall was sparsely filled but you could only see that from an ariel view. Crowd scientists say Trump's inauguration crowd was half the size of Obama's and they are correct, especially when you compare views of both ends of the mall--anyway--who really cares about this anymore?","commenter_a":"Obama was the first African American president I would expect the crowd to be quite larger for him","post_message":""},{"comment_id":"10154406801145329","commenter_b":"She is disgusting ...an insult to women all over the world!","commenter_a":"I can get my head around the fact that Quantum field theory applies the ridiculous laws of quantum physics not just to solid particles but also to the fields describing the fundamental forces of nature. I just can't seem to understand why anyone cares so much about her or her family.","post_message":"People may THINK Kim Kardashian West's showing off her ~post-baby body~ but the photo may actually be from a year ago."},{"comment_id":"1055345397919589","commenter_b":"Natural selection for the girl that's in the bikini","commenter_a":"Wow","post_message":"LIVE FROM HOLLYWOOD BEACH - Take a look at LIVE video from our Hollywood Beach Cam where the outer bands of Hurricane Matthew are making their presence felt."},{"comment_id":"10153487443061336","commenter_b":"Lawrence and Ruthanne Dolezal parents, both white as snow. Only time she is black is when the lights go out.","commenter_a":"OMG how proud her folks must be. Shes as black as Obama is white.","post_message":"“I wouldn’t say I’m African American, but I would say I’m black.”   Former NAACP leader Rachel Dolezal said in a new interview that she didn’t deceive anyone about her race."},{"comment_id":"1074912275882577","commenter_b":"Look at their faces....they're smiling. ...and we're not allowed to be angry about this. All of you bigots need to shut up! Wear your flag ....fly your flag......shove your flag.....who cares ....but you will not see it flying over that government building ever again!!!! Deal with that!","commenter_a":"Are these the same, \"It's Heritage, not Hate\" clowns?","post_message":"South Carolina voted to remove the Confederate flag, and bigots are in a frenzy: 'F*ck black people'"}]
