[{"comment_id":"10154985622284687","commenter_b":"She schould blame her father for this","commenter_a":"Brilliant ! Will do","post_message":" is just  it's a wonderful line. I own some of it. I fully  I'm going to give a free commercial here. Go buy it today, everybody. You can find it online."},{"comment_id":"1160655937308596","commenter_b":"Many Muslim women are sick of being told what they are and what they can be from western women who have no clue about their culture, that's why Muslim Feminism had to develop on its own instead being part of the bigger movement, _that's_ sad if you ask me. Feminism should be about equality not about following one group of women's notion about what you should look, feel or talk like.","commenter_a":"I'm seeing a lot of diversity in the Muslim community about the concept of World Hijab Day (non-Muslim women wearing the hijab for a day in solidarity). Would love to get your thoughts on whether it's cultural appropriation, or upholding the more conservative aspects of your faith. I did participate last year, but not sure if I will again.","post_message":"Her \"Ask a Muslim\" booth was a huge success! - Parker Molloy"},{"comment_id":"1178158985635102","commenter_b":"OH PLEAZZZZZZZZZZZZ.....LMFAO..THIS IS BECOMING COMICAL...IDIOTS EVERYWHERE!","commenter_a":"It's not an anti trump its a protest against the president from mexico","post_message":"LIVE NOW: An anti-Trump protest in Mexico City."},{"comment_id":"10150887913809999","commenter_b":"Ya and she is going to jail if she don't win so she will say anything to get her way! She will do what ever it takes.... Murder . lie . steal. #Trump2016 #MakeAmericangreatagain #GodblessAmerican","commenter_a":"I can't believe Americans will vote for this idiotic woman, but they will and bring another 4 years suffering to the world","post_message":"\"Donald Trump has built his campaign on prejudice and paranoia. He is taking hate groups mainstream and helping a radical fringe take over the Republican Party,” Hillary Clinton said."},{"comment_id":"10152719503449117","commenter_b":"Don't these pigs have any REAL criminals to hunt down???","commenter_a":"Boy that's a basket of snarls","post_message":"Why the sex lives of teens should be subject to school discipline is suspect enough, but it's extra perplexing what interest the government has in such matters."},{"comment_id":"10154104815247061","commenter_b":"Its the degenerates who voted for a child rapist to run our country!","commenter_a":"I'm sorry.. I noticed some people responded to this story with the \"angry\" emoji... Why would anyone be angry at giving back to the community or better yet, to our vets?","post_message":"WATCH: President Obama and First Lady Michelle Obama serve Thanksgiving meal to residents of a retirement home for military veterans in Washington, D.C. @webpagelink"},{"comment_id":"10153122322244705","commenter_b":"Rehan Perera Damith Wickramarathne","commenter_a":"It never looked black! Blue n Brown. On the right it's got black with blue.","post_message":"And there you have it, folks!"}]
