[{"comment_id":"1364681343563732","commenter_b":"@username DA MAO POW!!!","commenter_a":"Kaaren Eric","post_message":"When a  meets a .   Check out more of our panda videos here: bbc.in/2hI4DPR"},{"comment_id":"10152829725821051","commenter_b":"if she shop lifts why isn't' the bitch in jail","commenter_a":"You mean she isn't stealing now?","post_message":"This shoplifter has never had a job. She current lives in rent-free housing and receives monthly benefits. She says if her benefits aren't raised, she'll go back to stealing."},{"comment_id":"10153574207499641","commenter_b":"And they are mostly Muslims !!","commenter_a":"that's because indians are breeding like rats","post_message":"If every candidate were granted an interview, the hiring process could take four years to complete, officials said."},{"comment_id":"10154258845019087","commenter_b":"Crooked Hillary, Star Trek, and a wussy looking dog......that fits you. #dbap","commenter_a":"Too many fail to realize that had the shoe been on the other foot, DT and his supporters would be screaming to high heaven about the system being rigged - so stuff it.","post_message":"A petition calling on the Electoral College voters to cast their ballot for Hillary Clinton instead of Trump has amassed over 600,000 signatures in less than a day."},{"comment_id":"10153264678366336","commenter_b":"98 percent of the illegals don't show up for their hearing.","commenter_a":"All future liberals lol.","post_message":"Some judges believe the backlog is expected to get worse."},{"comment_id":"10154133286695399","commenter_b":"Oh look it's a troll","commenter_a":"The republican party is an organized seditious criminal conspiracy. There is no reasonable basis for Ryan's actions.","post_message":"\"Briefings for the candidates will be provided on an even-handed non-partisan basis,\" James Clapper told Ryan."},{"comment_id":"10154079129819091","commenter_b":"Pence CNN 9/8/16 \"I think it's inarguable that Vladimir Putin has been a stronger leader in his country than Barack Obama has been in this country.\" Pence VP Debate 10/04/16 \"That is absolutely inaccurate. I said he's been stronger on the world stage.” Like his master Trump, Pence lies about his lies. The Trump campaign hostility towards President Obama is a national disgrace. President Obama is 100 times the leader that Trump or his boy Pence will ever be.","commenter_a":"The problem with Kaine was when Kaine spoke, Pence let him speak but the minute it was Pence's turn, two seconds into his turn Kaine was interrupting him, he's such a putz.","post_message":"VP nominees Tim Kaine and Mike Pence were both on the attack Tuesday night:"}]
