[{"comment_id":"723743707725776","commenter_b":"@username Marco can't stand ya!","commenter_a":"Why don't they go after his immorality.. Didn't he cheat on two of his wives. He is no Christian and then also said he has never had to ask for forgiveness OMG Adultry is a Commandment","post_message":"Donald Trump started a mortgage company (that failed) at the worst possible time -- when the housing bubble was about to burst."},{"comment_id":"901969823182419","commenter_b":"Girls like my weiner better.","commenter_a":"Nassssty fat pill..... puke","post_message":"A hot dog on a donut packed with bacon and jam... Here's where you can get it: @webpagelink"},{"comment_id":"10153312840067098","commenter_b":"My point is, YOU don't know what people do.","commenter_a":"How about we worry about our homeless vets and not other countries people.","post_message":"The results come amid a heated debate in the wake of the attacks in Paris..."},{"comment_id":"10153352503921051","commenter_b":"Ha ha bitch","commenter_a":"Don't see a problem with this. Fl. Courts finally got it right","post_message":"The Hello Kitty Rapist, a horrible man whose crimes included sexually assaulting multiple women and attacking a war veteran, just learned his fate."},{"comment_id":"897157403654934","commenter_b":"she gave her all, wasnt a armchair quarterback","commenter_a":"She did it great","post_message":"“It took heart, guts, determination, falling down and getting up, and a little motivation from the crowd to get across the finish line.   Check this out.”"},{"comment_id":"952513631455776","commenter_b":"No big deal. Mrs Bush did the same thing.","commenter_a":"Why is it so outrageous that an American woman does not do unculturally American things? Why is it that anything the President and his wife do so politically charged and subject to the idle chatter of people who have no interests outside of demeaning and denigrating people who are doing their level best for this country and its citizens? When you demean the President and his wife, you make us all small, meaner people, and this country seen as acollection of barbarians and yokels.","post_message":"How do you feel about Michelle Obama not wearing a headscarf while visiting Saudi Arabia?"},{"comment_id":"875788715811158","commenter_b":"@webpagelink, watch this and tell me is this ridiculous?","commenter_a":"Worse than ridiculous","post_message":"Don't you agree this is ridiculous?"}]
