[{"comment_id":"10152605770366680","commenter_b":"She certainly has enough raging male testosterone !!!!","commenter_a":"She is totally useless and has done absolutely nothing of benefit to the Democratic Party.","post_message":"Running for Senate might be an elegant solution for a woman with no other way to advance her career."},{"comment_id":"10153903202659641","commenter_b":"Suck one Ortiz","commenter_a":"All those who dont like Zuckerberg you are free to delete your facebook account","post_message":"Mark Zuckerberg isn't happy about what people have been writing on Facebook's chalkboards."},{"comment_id":"1280477518640408","commenter_b":"Who cares,he is nobody.","commenter_a":"Who can respect this so called intelligent person (jerk), wearing a batman tshirt making important statements? My 5 year old grandson loves to wear his batman tshirt to the play ground. Makes me think Cuban is doing this for publicity. Yep...his money success has gone to his head!","post_message":"He's rooting for..."},{"comment_id":"475707345887193","commenter_b":"If they don't like it here I will help them pack and kick there a##es out of here","commenter_a":"I'm sick of hearing about muslims. How abov you?","post_message":"A butcher was selling this to Muslim customers without them knowing. Now he's going to jail."},{"comment_id":"456122197909407","commenter_b":"Evil beast","commenter_a":"And that black power flag of the black panthers.","post_message":"OKAY THEN..."},{"comment_id":"10153878588886545","commenter_b":"Exactly I thought woman that age... can't have kids, no more.","commenter_a":"Why is a 62 year old getting pregnant and having young kids ? Second the 6 year old is only doing what he sees and what he thinks it's right . Do I think he's a bad seed no . Do I think he needs help after this yes.. This is obviously the only behavior that he knows ... I hope the mom suffers in jail .","post_message":"Kathleen Marie Steele of North Redington Beach, near Tampa, Fla., has been charged with aggravated manslaughter and neglect for the infant's death."},{"comment_id":"849061198475049","commenter_b":"She wants no part of it. Very wise classy lady.","commenter_a":"Condoleezza for President, she'd make a wonderful one. Outstanding human, patriotic, religious.......intelligent, classy. She has much more quality than Hillary any day.","post_message":"Just beautiful. I didn't even know Condi was a musician..."}]
