[{"comment_id":"10152967828847061","commenter_b":"Yes legal immigrants ma'am","commenter_a":"I am ashamed at the negative narrow minded comments. Check your heritage. We are all immigrants","post_message":"America Ferrera to Donald Trump: Thanks, your comments will send more Latino voters to polls: abcn.ws/1Iw7NNn"},{"comment_id":"10153151656451336","commenter_b":"Prayers for our Country. This woman is a tyrant!","commenter_a":"The last person on earth we need as president.","post_message":"BREAKING NEWS: Hillary Clinton announces 2016 presidential campaign. @webpagelink"},{"comment_id":"10154315230081051","commenter_b":"Kelly knows the enemy is coming from the south and must be stopped . Declare war and deport all foreigners !!!","commenter_a":"Military to the front again Obama to da back of the","post_message":"Trump's Homeland Security pick is dead serious about stopping the flow of illegal immigration into America. Does that sound good to you?"},{"comment_id":"10152932852611378","commenter_b":"Give her a better intersection ! I'll take the intersection. ! This intersection should be for a young person , a person that's quick on their feet! Firing her doesn't solve nothing ! Crazy intersection","commenter_a":"Her attitude is disgusting; it's like I'm entitled to get paid just for showing up!","post_message":"A lot of people were talking about this 6abc Action News HIDDEN CAMERA Investigation before it even aired! Now here's the whole story. A crossing guard, who is paid to walk kids across a busy intersection, stood by as groups of children bolted across traffic, but she didn't help walk them across to safety. Plus, hear this public servant's interesting response, when we ask why she isn't doing her job to keep students safe!"},{"comment_id":"10154378235307061","commenter_b":"ironic since even king himself thought malcolm x was a hack","commenter_a":"I am a white man, but it seems to me that Islam provided to Afro-Americans a system of faith and structure that Christianity failed to do. These people took names of Islamic heroes, rather than the surnames of their owners. Muhammad Ali took stature when he changed his name from Cassius (Roman name) Clay (ancestor white owner?). In America we stand up for who are and what we believe to be right.","post_message":"Malcolm X was killed on this day 52 years ago. @webpagelink"},{"comment_id":"1729830760638535","commenter_b":"Stfu dumb niggabitch.. let's see you come up with some rhymes.","commenter_a":"That was shit, idk what you people are thinking sometimes 😂","post_message":"That lie really hurt tho"},{"comment_id":"10153382120572293","commenter_b":"They are not the same at all","commenter_a":"Deidri","post_message":"Why the analogy is important."}]
