[{"comment_id":"10154774162911323","commenter_b":"@username, since you agree with @username, how does one load a machine with votes?","commenter_a":"\"The people have spoken\" is such an unfortunate choice of words when they gave your opponent in excess of 2M votes more than you.","post_message":"\"We believe we have an obligation to the more than 64 million Americans who cast ballots for Hillary Clinton.\""},{"comment_id":"1535691416490982","commenter_b":"Go lick some boots","commenter_a":"I don't see how the video is BS you can clearly see him drop his hands down into his waistband and wasn't following police commands again showing the total disregard to authority so The only BS I see is ignorant people trying to act like they're above the law","post_message":"The media ALMOST had everybody fooled about Crutcher, but we found the truth.  And it's going to destroy the media's narrative on the Crutcher shooting..."},{"comment_id":"10153677457716509","commenter_b":"White collar criminals need to get hammered too","commenter_a":"@@username.....you are so right. we must be smart in giving.","post_message":"They conned donors out of $187 million and spent almost nothing to help actual cancer patients, the FTC says. Here's how about 97% of the donations were used: @webpagelink"},{"comment_id":"1150426991676729","commenter_b":"We could put all Muslims on Atlantis and let them fight it out! Yes, I know it is a fantasy that Atlantis existed but believing Islam can coexist with the rest of the world is a fantasy, too. Best hope the idiots get there and drown vforevthey realize they have been had. Obama can lead them with Hilary behind. My fantasy! Sorry, but I have problems.","commenter_a":"Way to go Angola","post_message":"Muslims have been asked to tear down their own mosques under threat of paying for the demolition fees...."},{"comment_id":"10152737954746051","commenter_b":"She should never have bred!","commenter_a":"It's too bad the parents cannot( will not) just pay the fee and get over it.","post_message":"The woman who invoiced a 5-year-old for missing her child’s birthday party has a message for all the haters."},{"comment_id":"10154417440556729","commenter_b":"Muslim Jihadem Horde!","commenter_a":"And guess which country is going to have to fix things like in WWII?","post_message":"Hello??? Is anybody listening?"},{"comment_id":"1065968390113738","commenter_b":"William Tryon WOW...totally makes sense NOW, 10 Celebs Moving that Already Own homes in Other Countries, In Exchange FOR LUNATIC Trump Promising TO Send OUR KIDS to WAR...Excellent Logic!!! NOT!!! Our Country is Not A Business For Trump To Practice HIS Failures ON--IT'S OUR COUNTRY!!! MoonStruck \"SLAP\" Snap Out Of IT!!!! Trump has Infected Our Country With IGNORANCE The Worst EPIDEMIC! Trump Rising! DID the Hiel Hitler Salute On National TV for the World TO SEE..Disgusting!! VOTED For TRUMP & Got KIM JONG UN & Porn Star.... WWIII-- DO WE Want ALL Our Kids To Get Drafted Into A Greed WAR for Trump!! THE Epidemic in Our Country by OUR OWN Citizens Addiction TO Porn, Drugs & Human Trafficking is a Major Problem IT Comes By Boats, Planes, Trains & Automobiles CUT the Consumption Solve The Problem that Huge Problem. MEDIA Has Attached ITSELF TO Trump's BOOB because MASSIVE Orange ...","commenter_a":"Another reason not to vote for Ted Cruz. #Trump2016","post_message":"“The only guy who can beat [Donald J. Trump] is Ted Cruz.”   Breaking News: Carly Fiorina has endorsed Ted Cruz for president."}]
