[{"comment_id":"955678404472632","commenter_b":"Hey Christie, are your kids vaccinated? FOOL!","commenter_a":"Sooo, Chris believes that parents should have a Choice...wonder how far that goes beyond vaccination...","post_message":"Gov. Christie: “Not every vaccine is created equal, and not every disease type is as great a public health threat as others.”"},{"comment_id":"10152826329111130","commenter_b":"Women are a different race?","commenter_a":"Arrogant and controlling and not smart enough yet to hide it. Did anyone else who watched this wonder whether he would have shushed a male reporter?","post_message":"Unbelievable."},{"comment_id":"712967945491547","commenter_b":"Gals, you are missing the point.The birds ARE god","commenter_a":"Tom Beyer","post_message":"One of the prettiest scenes we've ever seen: A flock of starlings form spectacular flyover in Israel's sky (Video: Reuters)"},{"comment_id":"1700109030241371","commenter_b":"@username @username lol this lady","commenter_a":"@username I so see this being you in like 100 years","post_message":"This 105-year-old woman has the best reason for ignoring her doctor's advice about drinking soda."},{"comment_id":"1753789991533439","commenter_b":"Well one less lesbian in the country .","commenter_a":"Stop getting our hopes up and just get the FUQ out! Useless waste of oxygen","post_message":"Rosie O'Donnell To Leave The Country For This Awesome Reason.  Good riddance. We don't want her anyway.  Would you be happy to see her go?"},{"comment_id":"1135581816480053","commenter_b":"I was just going to say that! I don't even think Taylor Swift could pull off that jacket well. It's apropos for this witch though: an ugly jacket for an ugly person","commenter_a":"What's worse is it looks hideous. She could have found a nicer jacket at Kohls!","post_message":"Does something seem wrong with this picture!"},{"comment_id":"10153464723413734","commenter_b":"Take that child away from these monsters! Do NOT allow him back in that \"home\"!","commenter_a":"That's the kind of monster that deserves the death penalty.","post_message":"#BREAKING news out of Maryland.  The mom's boyfriend has reportedly been charged.  More details as they become available."}]
