[{"comment_id":"10153832005601162","commenter_b":"Not a girl if you have boy parts, sorry.","commenter_a":"What about the rights of every girl at this school. This is insanity.","post_message":"30-DAY DEADLINE: The U.S. Department of Education says Palatine Township School District 211 is violating the rights of a transgender student by refusing to allow her the unrestricted use of a girls' locker room: @webpagelink"},{"comment_id":"10154244618664205","commenter_b":"Hillary Clinton is the Jerk of the year, because she put her personal ambition to be President, ahead of the welfare and safety of the vast majority of the American people!!!! Now we are all faced with the train wreck, of Donald Trump, with the nuclear launch codes at his incompetent finger tips!!!","commenter_a":"I vote Yank Jerkin \"off\" as #1. :-)","post_message":"Get in your last minute votes, before it's too late. @webpagelink"},{"comment_id":"1765902270312370","commenter_b":"Asshole","commenter_a":"P","post_message":"The message from Ted Cruz and Donald Trump is clear: If either of them become president, Guantanamo Bay won't just stay open -- it will be expanded. Does that sound good to you?"},{"comment_id":"673468959486383","commenter_b":"Can't run from jail...better hope Obama pardons her","commenter_a":"I do not think she will run in 2020, nor will the DNC even consider her after the whooping they took, she is too toxic.","post_message":"Trump-Clinton rematch for 2020?"},{"comment_id":"10153618510960329","commenter_b":"How bad do you want to see picture number 4s titties?!","commenter_a":"Dave David Craig so Mark was right all along...","post_message":"Drinking beer in the shower is a thing and you should all be doing it."},{"comment_id":"458714004327362","commenter_b":"Whinny assed little bitch is what he is","commenter_a":"Lies or on all sides. It is politics and hard to see who really is lying. Media is a manipulator.","post_message":"These are some heavy-duty tweets..."},{"comment_id":"1259153044105704","commenter_b":"You could try this? :) @webpagelink","commenter_a":"Judy Acres too bad we can't watch this :( UK only","post_message":"Absolutely spectacular footage from the BBC's latest nature documentary, #thehunt. Honestly, some of these shots look almost too perfect to be real.  \"Witness a polar bear sneak up on its prey using ice holes to surprise it. This is the first time ever this has been captured on film.\"  You can watch on iPlayer here: bbc.in/1j0xI5B"}]
