[{"comment_id":"10154633905401336","commenter_b":"LOL, Yahoo doesn't have that many accounts....is this a hoax for attention?","commenter_a":"Your World with Neil Cavuto----- You are talking to a brick wall today,","post_message":"Breaking News: Yahoo says at least 500 million accounts were hacked in 2014, and reportedly believes the culprit was a “state-sponsored actor.” @webpagelink"},{"comment_id":"894646007249901","commenter_b":"Go home","commenter_a":"Shut your eyes or put a bag over your head !!!","post_message":"This is the real agenda of radical Muslims."},{"comment_id":"971423549572732","commenter_b":"Girl, is there any other?","commenter_a":"Dukes!!","post_message":"FOLLOW UP: We asked this morning about whether you like banana and mayonnaise sandwiches….if you say YUM, what mayo are you using?"},{"comment_id":"1007038892685973","commenter_b":"Liar liar","commenter_a":"@username for President of the United Sates of America, 2016-2024!!","post_message":"Read the texts Hillary sent some friends last night during the GOP debate."},{"comment_id":"10153825599556770","commenter_b":"Crooked Hillary's campaign is doing what they do best, and that is to take the focus off of her current health problems and turn the attention on to what Mr. Trump said in 1996 about a pageant queen. What's even more troubling is that the media is in their back pockets, treating her like she just won the presidency, while slamming Mr. Trump! Sorry, but who was it again who had 33,000 emails wiped from her private server using BleachBit that can never, ever be recovered? Who was it again who had staffers destroy their Blackberry phones with hammers? Who was it again who blatantly lied to the FBI? Who was it again whose \"key witness\" staffers were given amnesty from testifying? Who was it again who called tens of millions of Americans deplorables? And, of course, the list goes on and on and on! Isn't it amazing how crooked ...","commenter_a":"This is coming from a man who paraded his mistress around the city and let his wife be the last one to know he was divorcing her...he has as much room to talk about Hillary and Bill as Trump does...","post_message":"Former New York City Mayor Rudy Giuliani has some harsh words for Hillary Clinton."},{"comment_id":"1250171008375949","commenter_b":"NO She is a BAD EGG!!","commenter_a":"No I detest liars. I don't know how she gets away with all the junk that she's done.","post_message":"Hillary Clinton was voted the most admired woman in America in a Gallup poll. Do you admire her?"},{"comment_id":"10152608656372894","commenter_b":"Women also cheat with their hearts minds and bodies too soooooooo","commenter_a":"The pic of him with the female outside the car looks like he was taking a pic with someone ... Ppl have cousins sisters groupies fans and friends that they don't sex !!!all these bitter broken hearted ppl jumping the gun obviously wasn't nothing serious he joking about it on Twitter .... Buuuuuut carry on","post_message":"Was Nick Young Caught Creepin' on Iggy Azalea in the Car SHE Bought Him for Christmas? [Photos]"}]
