[{"comment_id":"419169165087070","commenter_b":"@username nobody wants your Ukranian ass here either. Plastic bitch.","commenter_a":"People with Green cards and visas are also being denied access. So don't tell me it's about \"coming here legally\" This is a hate based act. Period.","post_message":"This significance of the court's ruling and the power of protest cannot be overstated.  Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1054816387945602","commenter_b":"Watching these comments I can't help but notice that Obama is almost as popular as burlap toilet paper....","commenter_a":"Will he be pausing to pray to the east immediately following this speech?","post_message":"President Barack Obama comments on #Brexit at the 2016 Global Entrepreneurship Summit."},{"comment_id":"10153677360299641","commenter_b":"She is worth more than all of Isis put together.","commenter_a":"Mary Knoll","post_message":"This is Diesel. She is a 7-year-old police dog French police say was killed in the raid today.  Here's what we know about the raid so far: @webpagelink"},{"comment_id":"1337533142938860","commenter_b":"an untalented hooker","commenter_a":"That creepy dame who's his spokes person ought to be banned from every network and media outlet.","post_message":"Whoa, CNN grew a backbone! After what was said, he should be banned from America."},{"comment_id":"583797651802114","commenter_b":"Women Willing To Bern In Hell For Bernie Women Willing To Bern In Hell For Bernie sounds like a cult, kinda like Scientology.....","commenter_a":"The corporate owned media won't change their narrative about Clinton because for the most part, they are still run by straight, white males who must keep the myth alive that an ambitious woman is dangerous and there must be a negative reason behind her ambition.","post_message":"Let this sink in."},{"comment_id":"1192416514111710","commenter_b":"Then he cuffs the man after shooting him in the back smh","commenter_a":"How in the hell do you feel threatened by a man who is running in the other direction? This guy is full of crap.","post_message":"Former officer Michael Slager: \"What makes me upset is that nobody knows what actually happened.\""},{"comment_id":"922573247835730","commenter_b":"Two women had enough of him, despite his wealth, and headed for the hills.","commenter_a":"I dont understand how a man with everything can be filled with so much hatred","post_message":"Yep, that just about sums up Donald Trump's campaign.  Image by Occupy Democrats, LIKE our page for more!"}]
