[{"comment_id":"728966150600250","commenter_b":"FEMALE ON THE NEST","commenter_a":"Where is the first baby ?","post_message":"WATCH LIVE: We're ringing in the new year with Harriet, M15 and their new eaglet!  We're still waiting for the second egg to hatch!  Where are you joining us from tonight?  WATCH the video of the hatching- @webpagelink Pix provided by Southwest Florida Eagle Cam"},{"comment_id":"1520211998272919","commenter_b":"Amanda Murphy Maldonado they can take their kids with them. No families have to be busted up. Then when they kid is of age he can come back as a citizen. LAWS are LAWS...what laws are you CHOOSING to break?","commenter_a":"SEND THEM HOME. This isn't just \"politics\" anymore, this is the deliberate destruction of America from within. When they jumped the wall the broke the law!","post_message":"Breaking News: The Supreme Court says it will review President Barack Obama's orders to shield up to 5 million illegal immigrants from deportation. @webpagelink"},{"comment_id":"10153319630981135","commenter_b":"Take her car away!","commenter_a":"FOUND IN OHIO.","post_message":"Nancy Carfes was last seen around 8:30 a.m. Monday morning in the area of Wayne and Warren Roads."},{"comment_id":"10152536717736680","commenter_b":"Stop marriages of terrorists n force","commenter_a":"Speaking out against, or killing? Those are two very different things.","post_message":"From POLITICO Magazine: Police risk their lives in service. Does that mean we shouldn’t speak out against them?"},{"comment_id":"836200936476160","commenter_b":"Don't think ANY woman could run this country as well as a man could.","commenter_a":"Bring on mashed potatoe legs","post_message":"“I’m ready for Hillary, are you? Are you coming?”  - Sarah Palin"},{"comment_id":"10154090084173690","commenter_b":"That will not happen, they will NEVER dominate Europeans. It would take a better class of people than the rough beasts who are now slouching toward Europe.","commenter_a":"Saudi Arabia and other rich muslim countries take in muslim refugees,,,,muslims have a big plan to dominate europ and later force Sharia laws on them","post_message":"Four Balkans countries have announced a daily cap on how many people can pass through and Austria has restricted entry for hundreds of thousands."},{"comment_id":"1018817644877956","commenter_b":"#STOPHATEANDFEARMONGERING #dumpTrump #VOTEDEMOCRATS","commenter_a":"I have a bet going that Trump declares bankruptcy again after he loses the nomination. I hope he loses everything and all his foreign factories close down. DUMP THE TRUMP DUMP THE TRUMP DUMP THE TRUMP","post_message":"You reap what you sow."}]
