[{"comment_id":"877374009072027","commenter_b":"What they should do is put them to work while they are on welfare and lowering government al expenses! A few hours here and there will save a bundle! Stop giving them a free handout and not allowing them to contribute to society! Eventually, get them a regular job and get them off welfare!","commenter_a":"Yes! To all of them!","post_message":"Do you support drug testing for welfare recipients?"},{"comment_id":"215680145570500","commenter_b":"Who cares what she thinks?","commenter_a":"Stick to pretending to be someone else and saying someone else's words!","post_message":"Not a fan of Meryl Streep's politics? According to her, you may as well be a Nazi."},{"comment_id":"10152712712566545","commenter_b":"That was a WOMAN.","commenter_a":"That lady in the van just opened a can of Whoopass","post_message":"Here's the incredible ending to a nerve-wracking chase in Dallas County. We'll have the latest on News 8 at 4.  TO WATCH/READ MORE: @webpagelink"},{"comment_id":"10153450761424024","commenter_b":"blacks kill more blacks than any other race in this nation...but their little jungle minds don't see that !","commenter_a":"we don't want you because your dragging your diapers all over town. Get rid of the load, then we'll talk Leroy","post_message":""},{"comment_id":"10153713110753690","commenter_b":"a philistian women","commenter_a":"some facts from the bible samson an delila samson the israel lite wasted gaza","post_message":"Israeli authorities have issued more than 13,000 demolition orders against Palestinian-owned structures, including homes, in Area C of the occupied West Bank between 1988 and 2014, according to a new report by the United Nations Office for the Coordination of Humanitarian Affairs.  Area C is a designation from the Oslo Accords' era that indicates the region is under full Israeli military and administrative control. The area, home to around 300,000 Palestinians, covers 60 percent of the West Bank and is also where most Jewish settlements are built."},{"comment_id":"729509567174081","commenter_b":"Oh shit here comes Ronda, there going to kick our ass for sure now she here. Lol","commenter_a":"Better hope she doesn't bring her losses with her","post_message":"The UFC fighter made a trip to North Dakota and donated fruits, vegetables, bread, tents and wood-burning stoves to “water protectors” who are protesting the Dakota Access Pipeline."},{"comment_id":"1591036221183491","commenter_b":"NICE ! Drop that bitch","commenter_a":"That was just so great","post_message":"OUCH! That's gotta hurt.  This bully had it coming."}]
