[{"comment_id":"10154191212073132","commenter_b":"Some girls eat and eat and not gain a pound, I'm not talking about girls with eating disorders. That's a different topic. Some girls are skin and bones regardless of how hard they try and gain.","commenter_a":"Far better looking then the skin and bones models they normally show. But she isn't \"Plus size\", she's fit and healthly size.","post_message":" thought Sports Illustrated was taking a risk by putting a girl my size in the pages. But putting me on the cover? They aren just breaking barriers; they are the standard now. This is beyond epic."},{"comment_id":"10152890902061336","commenter_b":"Immigrants must obey the law...review history.","commenter_a":"What's wrong conservatives are these immigrants too brown for you?","post_message":"Mexico is now issuing birth certificates at its U.S. consulates so illegal immigrants can avoid deportation."},{"comment_id":"373546919515489","commenter_b":"She's retarded.","commenter_a":"I'm so sick of her BS, she needs to just plain go away and leave America alone.","post_message":"Pro-Gay, Pro-Abortion Nancy Pelosi Calls Marco Rubio a Bad Catholic"},{"comment_id":"10153814775523797","commenter_b":"A woman being drunk is not a license to violate her. Go Sit Down somewhere....","commenter_a":"exactly she was drunk she dk what he was saying or doing she just wanted n excuse to sue these officers n live off our tax dollars rest of her life n not work","post_message":"CITY PAYS DRUNK WOMAN: Well, not exactly. #Chicago taxpayers will shell out money to compensate an inebriated woman who accused two police officers of sexually assaulting her. What do you think? Details here:"},{"comment_id":"1391871914162547","commenter_b":"U r an Angela,go take every Muslims come back ur home","commenter_a":"You guys are all so worried about making jokes about Obama. How about we worry about the children who lost their lives and the parents that have to adjust to a life without their babies? My goodness!!!","post_message":"Witness describes seeing the gunman at Munich, Germany, McDonald's, killing children. @webpagelink"},{"comment_id":"10153366543351051","commenter_b":"why not Thugs Lives matter ... break the law assult others and what happens ??? Blacks Kill more of themselfs than any other ...... My mother taught me to dress for success not emulate Prison population booty call ...","commenter_a":"Racist idiot","post_message":"Here's why President Obama says many people misunderstand what the #BlackLivesMatter movement is truly about. Do you agree or disagree with the president's message?"},{"comment_id":"10153364798139877","commenter_b":"Robin! Amen! Everybody wrong for agreeing with that old woman!","commenter_a":"She is so wrong , she is not the Pastor nor is she the head of the Church. So far out of place in the Church , just because you put in a offering or your family started the church its not your church nor are you the Pastor. Dang shame! Guess she wants to go to hell in a hand basket.","post_message":"103-year-old woman who was kicked out of her church clapped back...now the pastor is in hot water. Watch what happened next below.   Grio fam, we're glad she put up a fight. What's your reaction?"}]
