[{"comment_id":"1008713619198681","commenter_b":"She's a BAD example of a women !!!!","commenter_a":"Excellent ... +++","post_message":"Whoever you support in this election, it's important to mark historic firsts - and this is the first time that a woman from either party has won the Iowa caucus."},{"comment_id":"10154319112003812","commenter_b":"Cover that nipple, girl.","commenter_a":"Time and a place for everything that was not the place. Plain and simple.","post_message":"Woman says she was kicked out of a North Carolina courtroom for breastfeeding during a child custody hearing. \"Ma'am, you need to cover up.\""},{"comment_id":"602134433280545","commenter_b":"Nina act like she fucking BERNIE GO HILLARY CLINTON FOR PRESIDENT OF UNITED STATES","commenter_a":"She just wanted to play Ted Cruz nobody needed that. Those that supported Bernie have to move forward and help defray trump this is what he's asking them to do. Let us not be divided and loose to trump.","post_message":"Bernie Sanders’ supporters say they are being severely mistreated at the DNC."},{"comment_id":"824413534273149","commenter_b":"She should point those racist fingers back at self!","commenter_a":"Do you really expect anything else from her? I'm not shocked at all. She's an idiot.","post_message":"This speech is shocking... even for her!  What Michelle says at this graduation ceremony will make you cringe!"},{"comment_id":"510973722424254","commenter_b":"Let's elect him and the boos will disappear, right along with all those illegals that are making the noise.","commenter_a":"Don't join conservative Tribune news bad to read","post_message":"Donald Trump handles this opposition like a CHAMP!!!"},{"comment_id":"10156442483085231","commenter_b":"Bitter Brother Committee..... If he didn't want a kid he should've strapped up....but since he wanted a souvenir from Ciara the singer, but not from Ciara the woman, he has a fiscal responsibility to provide for his kid....that's so 1940 to say \"she trapped him\" because a man can alleviate all of that by condom, vasectomy or not \"bussing it wide open\".....if they're so worried about \"getting trapped\", they should do something about it...I mean since \"females\" are sooooo devious","commenter_a":"She stay eating off her dudes... First it was Missy, then bow, then 50, then future, then Russell, now future again... That snatch is a trap... Russell better tread carefully","post_message":"Loose lips causes lawsuits. Ciara isn't playing when it comes to protecting her name and son."},{"comment_id":"1070107396359933","commenter_b":"She would have to drug me like Bill Cosby does his women","commenter_a":"This gal needs to get laid.","post_message":"“Her conduct and behavior are appalling, and I am not only disappointed, I am angry, that a member of our faculty acted this way.\""}]
