[{"comment_id":"10153274848901600","commenter_b":"Just send a card. She should get the hint.","commenter_a":"Decline the invitation","post_message":"A mom is causing a backlash online for an apparent email she sent before her son’s first birthday party. The email includes specific requests about acceptable gifts for her son."},{"comment_id":"1945808648983136","commenter_b":"This Fucking pussy","commenter_a":"What a freak thus guy is!","post_message":"Must-watch. Morning Joe, a Republican, was left speechless by top Trump advisor Stephen Miller's dictatorial, lie-filled performance on the Sunday shows.  Shared by Occupy Democrats, LIKE our page for more! Video from MSNBC."},{"comment_id":"1047390088634796","commenter_b":"Jane I think you should try instead of History books the actual bill that was introduced in the Congress in 1983, the sponsors of the Bill, the Democratic almost unanimous vote, and the Democratic rationale behind their support. It's there to read if you get your head out of your ass","commenter_a":"Strange how if your a Democrat you tend to forget the horrors created by your party when foolishly you are in command. After President Carter destroyed our country we needed to reform the Social Security System so it would be solvent as is the case today with Obama doubling down on the atrocities created by Carter. When Reagan took office he acknowledged that the system was broken and pledged to fix it. At the time we had a Republican President, a Democratic Congress and a Republican Senate but we also had a different set of principles in our politicians as they were devoid of loons like yourselves and the likes of Cruz. The Democratic house took care of all federal employees, all Federal Judges, all State Workers, all women's rights, raised the AGE of retirees from 65 to 67, took care of themselves, their staff and whoever else they could ...","post_message":"Jeb Bush has a plan to save Social Security: Ensure hardly anyone can qualify for it. Is he trying to lose the election?"},{"comment_id":"10153349534435667","commenter_b":"Nice rack, Mary","commenter_a":"Bengazi butcher leading the uneducated I assume because a smart common sense person would never vote for her.","post_message":"\"We're not taking anyone, and we're not taking anything, for granted.\""},{"comment_id":"10156046538185389","commenter_b":"Sorry , but I don't think women belong in combat ! I am old fashion , I still believe in Chivalry ! :D","commenter_a":"Time to retire this so called..\" Top Admiral \"..too many PC types in the military now, arm chair leaders..!! Desk jockies..!!","post_message":"The U.S. Navy's top admiral said he believes female sailors should be welcome to join the service's elite SEAL teams, provided they can pass the training regimen."},{"comment_id":"985465168182267","commenter_b":"You don't support our troops, you don't support tradional marriage, I would think support you.","commenter_a":"Good I don't go there now.","post_message":"Starbucks CEO: If You Support Traditional Marriage, We Don Want Your Business  ttp://woundedamericanwarrior.com/starbucks-ceo-if-you-support-traditional-marriage-we-dont-want-your-business/"},{"comment_id":"729187697271808","commenter_b":"A Hot MESS","commenter_a":"She should be in jail. Who is protecting this criminal and why.","post_message":"Like if you agree."}]
