[{"comment_id":"10154608447428690","commenter_b":"@username - Did I hurt your feelings? While you're defending her she's planning on how she'll enjoy all her wealth somewhere in the world while you'll be paying taxes up the wonker. It's called Sod's law.","commenter_a":"She is every color on the a--hole rainbow.","post_message":"\"I am innocent, I am an honest person and I have never committed a crime.\" @webpagelink"},{"comment_id":"1170889439672424","commenter_b":"The people who are fighting for our clean water and sacred burial land i applaud you, it is sad to see once again big corporate doing as they please at the expense of the people and bull dozing minorities but hey this is nothing new when has America respected minorities let alone there rights and means of survival, most of the people apposed to this never lived in a state of emergency where there water was flammable or had to be boiled even places today like flint still have contamination in there water, smh alot of you people need to wake up and realize the treaty(1890s)was broken and that property was not supposed to be sold or messed with but when has the white man ever kept a treaty with the red man.","commenter_a":"Ritini Mahuru Anabelle Palza","post_message":"Activists in Standing Rock, North Dakota were shot with rubber bullets and sprayed with water in freezing temperatures. @webpagelink"},{"comment_id":"610314089143994","commenter_b":"How embarrassing for all women! Their class level is as low as Trump's. Is there an emoji of a puking face?!","commenter_a":"LOL. I wouldn't count on them voting for Trump. I doubt they've ever been in a voting booth.","post_message":"People started freaking out when the hashtag #TrumpGirlsBreakTheInternet started trending Sunday night."},{"comment_id":"10155015963219199","commenter_b":"Always use condoms jeez you never know who has it.","commenter_a":"This senseless act could have been avoided if we would have banned all Mustangs after the first Mustang ran into a crowd.","post_message":"Surveillance video shows a man on a bicycle in the Phoenix area being run down by a Ford Mustang."},{"comment_id":"10155117976876002","commenter_b":"Lets do a story on bum tenants....thats where it is","commenter_a":"Hanks a tool lol","post_message":"Help Me Hank: Landlord's secret launches investigation (Full story: @webpagelink"},{"comment_id":"10152827185410047","commenter_b":"Welfare mothers should not get any money either","commenter_a":"like","post_message":"Planned Parenthood is the leading abortion provider in the United States while continuing to receive millions of dollars in federal government funding each year.   Our tax dollars shouldn't be funding the slaughter of innocent unborn babies. SIGN & SHARE to defend life and defund abortion: @webpagelink"},{"comment_id":"10155459480226729","commenter_b":"Illegal peoples was unexpected to immigration live our homeland your said them all to their ear daft.","commenter_a":"Mexico’s Enduring Legacy of Failure If Mexican President Enrique Nieto truly believes Donald Trump is a bigot for not welcoming millions of medically and criminally unvetted illegal aliens with open arms and a check made out to \"cash\", then why does Mexico have stricter immigration and foreign work laws than \"racist\" America? Every civilized nation recognizes the absolute necessity of securing their borders and maintaining the integrity of their immigration programs. It's the type of common sense that requires no apology or gratuitous reminders. Perhaps if the Mexican government wasn't so adept at destroying its own country with an endless cycle of incompetence and corruption, their own flesh and blood would not be fleeing their native homeland with nothing but the clothes on their back. And yet these are the same hypocrites who have the nerve to denounce America as greedy capitalists; that transcendent beacon of liberty, opportunity and prosperity ...","post_message":"If there's one thing I truly despise about the progressive socialist left it is their blatant hypocrisy.   One of the fall back positions for the left is always the 14th Amendment's \"equal protection\" clause. In the case of Obergfell vs Hodges (same-sex marriage) the SCOTUS ruled that marriage was an individual right and States must conduct same-sex marriages, making it the \"law of the land\" as many say.   Now, with the executive orders of President Donald Trump on illegal immigration, the liberal progressive left is again decrying the 14th Amendment's equal protection applies to anyone within the borders of the United States.   Well, based upon this, I will henceforth be carrying my concealed weapon anywhere within the borders of the United States.   Look, if all of a sudden, two men and two women have the right to be married anywhere in America, and if folks here illegally have constitutional protections, then my constitutional second amendment right to keep and bear arms shall not be infringed. You know...equal protection.   So, there it is, I just saved Congress a lot of work. Law abiding legal American gun owners can travel anywhere they want with their concealed carry permit. If we can't, then no same-sex marriage -- and no rights and protections for illegal aliens.   End of class."}]
