[{"comment_id":"10153491404021680","commenter_b":"We live in a generation that feels like everybody owes them something. @webpagelink","commenter_a":"You guys are so biased, it's disgusting.","post_message":"Bernie Sanders must run a gauntlet of closed primaries and Hillary Clinton strongholds next week."},{"comment_id":"10154205031258701","commenter_b":"You are clueless chickie....","commenter_a":"Seriously people, faulting the girl for not reporting! It's a small town good-old-boy system. You really think the police chief would arrest his good friend? They were probably laughing about it. Since she went public she is being harassed. Small town politics...","post_message":"A probable cause affidavit states he exposed himself to a female employee at Flowers 'N Fluff at least twice a week for at least two years."},{"comment_id":"516357545155952","commenter_b":"I'd be pissed,then sue everybody.Which I'm sure she'll do.","commenter_a":"How did they get the right to determine her mental state?","post_message":"Via Filming Cops -- How would you feel if within 24 hours you go from being a successful corporate executive to being forced to become a patient at a mental ward, stripped naked, where no one believes you? It feels straight out of a psycho thriller, but this is what cops did to her."},{"comment_id":"1127692307251779","commenter_b":"Fucking dumb bitch.","commenter_a":"Here we go again with the IFLS lies and propaganda","post_message":"The parents, who had chosen not to vaccinate their child, are “devastated” and have now had their younger daughter immunized as a result."},{"comment_id":"1192124507480431","commenter_b":"I will!","commenter_a":"Call Congresswoman Cheri Bustos' DC Office at (202) 225-5905 and tell her to vote NO! on the TPP... The house of representatives will be voting on the measure tomorrow (Thursday).","post_message":"It was a pleasure to meet with the talented young people who are in town with the Illinois Electric Cooperatives' Youth to Washington Tour today!"},{"comment_id":"886020504921859","commenter_b":"You are right Mary the bitch owes Haiti","commenter_a":"Shut it down.. take some of the millions and help Haiti which some of it was supposed to be used for. Then rehire ALL NEW PEOPLE IN THE VA HOSPITALS AND HELP OUR VETS. some of those people are the rudest uncaring and unhelpful people around hire enough to take care of the vets so they don't have enough to wait so long for appointments etc. Help Americans for God's sake.","post_message":"Hillary devastated after finding out this about her foundation.  It's all coming crashing down.  Do you think the Clinton foundation should be shut down?"},{"comment_id":"10154275931541509","commenter_b":"Do all the chicks look like you?? Pass....","commenter_a":"Welcome to the best dating agencies believed Malaysia We have a wonderful effect RICH SUGAR MUMMY / DADDY / IN MALAYSIA be among the people to get our exclusive link We are reliable and efficient in our work get a chance to meet with them we have a sugar mummy throughout Malaysia who are willing to lavish money on your car and home a contract extension.. To help get the job started., start calling right now to get in touch within 24 hours and make more money noted., applicants must be 18 years or older and must have a significant personality dinner with mummies , and wealthy Daddies .. Each of the night you spend with her or your daddy , will pay you RM5,000 .. This is a bonus for every interested applicant available . Every interested applicant for a hook up meeting appointment, must contact our Agency Mrs ...","post_message":"\"They were robbed of their stage. ... Tonight, we give them ours,\" Bono told the crowd.  For the first time since  #ParisAttacks, Eagles Of Death Metal make an emotional return to the stage alongside U2 @webpagelink"}]
