[{"comment_id":"10153328775418128","commenter_b":"I thing that puts our 18 trillion in debt in perspective...","commenter_a":"No doubt that population and geographical size - density as a dependent variable of income per-capita help construct the value perspective.","post_message":"The most valuable U.S. states by land value: 1. California 2. Texas 3. New York"},{"comment_id":"642248339288322","commenter_b":"Len dersima denen aşağılık sülük seni her zaman ki gibi kışkırtma aynı şeyleri tekrar etme çabası Amına kodumun iti seni","commenter_a":"They are commemorating kurdish terrorists. It s a scandal!","post_message":"LIVE: Rally to commemorate Kurdish activists killed in Paris (Courtesy Ruptly)"},{"comment_id":"10153999056241323","commenter_b":"She is pickled she will last a long while yet","commenter_a":"And when the Queen kicks the bucket we will have our money overhauled yet again. How much does it cost to overhaul the money all these times?","post_message":"To be eligible to appear on the new bill, the woman must be Canadian, either by birth or naturalization, and she must have died at least 25 years ago."},{"comment_id":"1067523319975236","commenter_b":"That must be beacause he dosent want to give his money away....she must have hit her face he self lol","commenter_a":"His family knew she was only with him for the money. She was a lesbian when they got married. I highly doubt he would be dumb enough to hit her where he left a mark. His other wife never accused him of this. How convenient he just did it when she is wanting a pay day to go back to get female lover","post_message":"Amber Heard kept her head high after filing a domestic violence restraining order against Johnny Depp."},{"comment_id":"10154382177016756","commenter_b":"Kyle, bad news for you. I'm a Bernie supporter. I'm just not up my own ass about it like so many of the rest","commenter_a":"Thank you for stating the obvious @username. This isn't about winning anymore. It's about spreading the message. This movement isn't going away. And we'll keep donating to see him through, because the message is important. Bernie Sanders, the nobody socialist senator from the boonies, almost took down the strongest possible candidate the establishment could put forward. He did it against rigged elections, big money, money laundering, and voter suppression. Him and our 27 dollar donations.","post_message":"As of March 31, there were 896 people on the Sanders payroll. The campaign says it will retain more than 300 staff."},{"comment_id":"10157212234715389","commenter_b":"They left them to die!!!! They were tortured before they killed them.... What kind of sick people lets this happen with the best armed forces in the world!!! These people need to go to jail!!!!! They did it on purpose!!!!! Sick !!! For heavens sake place these people in jail!!!!","commenter_a":"#nofaithintheGOP. Yeah, we know.. So you wrote a paper about it. What do you want? A diploma...Go arrest them. #theyarepartoftheproblem.","post_message":""},{"comment_id":"10153746116545326","commenter_b":"@username I'm still waiting for the tons of stepford wives to come.","commenter_a":"Lots of bitterness coming from the Sanders.","post_message":""}]
