[{"comment_id":"735565289967382","commenter_b":"Dear God, kick this ignorant African so hard he gets back to Africa. He needs English as a second language. Also needs to be taught to not make threats. What a POS. Go back to where you came from.","commenter_a":"This guy is a fanatic. He'd better be stop or someone s going to get Bharat namely, him","post_message":"Knife wielding Muslim attacks Trump, but watched what happens next. I bet he never expected this. Let's show him our support. Can we get 30,000 'LIKES' Donald Trump?"},{"comment_id":"10153366619543635","commenter_b":"Nope. I thought you knew better than that.","commenter_a":"Quran (3:56) - \"As to those who reject faith, I will punish them with terrible agony in this world and in the Hereafter, nor will they have anyone to help.\"","post_message":"Hillary Clinton: 'Muslims Have Nothing to Do With Terrorism'"},{"comment_id":"1038422129567160","commenter_b":"What a POS !","commenter_a":"Go home to Canada and take hiller with you.","post_message":"CRUZ F*CKS CONSERVATIVES, VOTERS and TRUMP  @webpagelink"},{"comment_id":"10153206999136336","commenter_b":"I love it. She should have her wooden spoon with her","commenter_a":"She is going to be arrested. She beat him that is abuse. Some Social worker will have her arrested.","post_message":"\"So what did this woman do that has everyone buzzing? What could be that extraordinary? It’s called parenting, folks. Good ol’ fashioned, no-nonsense, no-excuses parenting. This is what it looks like.\" – Ruben Navarrette"},{"comment_id":"676289335864353","commenter_b":"@username that's what I thought. Looks like she would suck a dick for a diet coke.","commenter_a":"I bet not one of you, without google, even knows why the song is racist or if it's even racist at all. You're pathetic. The problem with America is Americans. STOP TRYING TO SHOVE YOUR OPINION ON EVERYONE, just because you don't like what they do doesn't make them wrong. If you really believed in freedom you'd keep your mouth shut but you don't. You believe in shoving your opinion down the throats of everyone.","post_message":"“I don’t even think the song should be our national anthem, because it’s a racist song.\""},{"comment_id":"10153475591131051","commenter_b":"What a real sick bitch needs to go down for good she dont need her other kids go down bitch","commenter_a":"Prayers for that baby girl","post_message":"When residents here stumbled across an alcoholic mother trying to eat her own daughter alive, they decided to handle the situation personally."},{"comment_id":"10155455512331509","commenter_b":"Victim shaming is another way trump supporters are deplorable","commenter_a":"Ok time for JIMMY to come forward! Killery Klinton once fatshamed me at an OutBack SteakHouse in St Louis MIssouri! When eating i accidently flung my porkchop underneath her table where her dog was ( guess SHE is allowed to bring dogs). When i was wrestling the dog to get my porkchop back she called me a FAT idiot! #JimmyComesForward #FatShamerKillery","post_message":"Another woman is accusing Donald J. Trump of groping her, saying he allegedly put his fingers up her skirt"}]
