[{"comment_id":"10153312043927061","commenter_b":"I'm sure she is a smart cookie, given her education, but why can't these men date women their own age?!","commenter_a":"Such mean comment .. Wow!!! I sure she's a very nice person.","post_message":"Congratulations, Ryan Phillippe! The actor is reportedly engaged to his longtime girlfriend. @webpagelink"},{"comment_id":"1269577516395609","commenter_b":"So your saying CO2 is NOT a gas?? Where did you study chemistry?","commenter_a":"If that was gas.... the fireworks would have gone off as soon as the air was saturated enough to be visible.","post_message":"No, that's not fog. It's a gas leak.  @webpagelink"},{"comment_id":"10152601716778837","commenter_b":"Stupid a$$ b**ch...","commenter_a":"Another arrest, more jail. He's a bully and is still playing god. It's just a matter of time before he kills again..","post_message":"BREAKING -- George Zimmerman arrested in Florida @webpagelink"},{"comment_id":"1800960313527053","commenter_b":"She should wait till 2024 after Trump can't beat her again...","commenter_a":"She can't even walk right. Go to you jail cell and rest.","post_message":"Did I ever tell you the definition of insanity?"},{"comment_id":"10153564661133837","commenter_b":"If they are illegal then yes deport them and yes build a wall preferably with large guns","commenter_a":"He just wants to deport them all, and thinks they're all criminals, and wants to build a wall!!","post_message":"TRUMP LOVES HISPANICS!  Presidential candidate Donald Trump tweeted out this afternoon, \"I love Hispanics!\" to help celebrate Cinco de Mayo.  THOUGHTS - THAT'S SO NICE or THAT'S SO WEIRD?"},{"comment_id":"10153670096417869","commenter_b":"Can we share this with credit of course?","commenter_a":"It been a busy week. In the past ten days, the Trump Campaign joined the KKK, sucker-punched a Bernie supporter, attacked peaceful protestors, abandoned NATO, exported nuclear weapons to Japan and South Korea, spilled-the-beans on Heidi Cruz, outted Ted Cruz in a sex scandal, beat-up a female reporter, dropped nukes on Europe and the Middle East, and punished women for having abortions. These acts would be incomprehensible were it not for the fact that Donald Trump hates Mexicans, hates our trading partners, hates our stupid leaders, hates Muslims, hates women, hates blacks, hates reporters and Bernie supporters, and hates women having abortions. How can he claim to want to Make America Great Again, when he so clearly - hates Americans? There is no answer. Unless we look to the words of the candidate himself. According to The Donald: 1) He disavowed KKK David Duke endorsement; 2) He didn mind a ...","post_message":"There are a couple of twists in the story of Trump campaign manager Corey Lewandowski, accused of misdemeanor battery for allegedly grabbing the wrist of former Breitbart reporter Michelle Fields.  He was not arrested as some outlets initially reported, but voluntarily signed a “notice to appear,” a misdemeanor summons.  And an anonymous Secret Service agent on Trump’s detail claims that what Fields did could have easily resulted in a much harsher response.  This story has the latest:"},{"comment_id":"574693549357266","commenter_b":"Whores don't have souls, so yeah...","commenter_a":"so legalise drugs, legalise prostituion, are we just going to start legalising everything?","post_message":"\"Being a sex worker isn't about lack of choice. If I really had no choice, I'd be working in a garment factory.\""}]
