[{"comment_id":"683847751805803","commenter_b":"WTF!!! Enough of the PC climate in today's world! We celebrate American holidays in AMERICA! If the illegal immigrants want to be celebrated they should NOT break our LAWS and just STAY the hell in their own country!","commenter_a":"will not!!!!!!!","post_message":"Obama has created his own 'Holiday' and is forcing it upon American citizens.  We will stick to our own holidays thank you very much.  Will you refuse to celebrate Obama's made up holiday?"},{"comment_id":"909807282450701","commenter_b":"Great place for a Drive By Shooting!!","commenter_a":"- Funny, they don't look like brothers.","post_message":"Who paid the bill?"},{"comment_id":"1030656443730298","commenter_b":"\"Socialism never took root in America because the poor see themselves not as an exploited proletariat but as temporarily embarrassed millionaires.\" John Steinbeck","commenter_a":"Fight Bernie Fight for us all!!!!!! We need u!!!! The Dark Side of the Force will be strong with this administration.....","post_message":"Trump is assembling the wealthiest cabinet in history — so wealthy that its members have more money than the bottom 1/3 of American households combined. That does not sound like an \"anti-establishment\" administration to me."},{"comment_id":"535720006552593","commenter_b":"There's a hot, firery place in hell waiting for this bitch!!!!","commenter_a":"Thank God they found them.","post_message":"A woman in Texas is charged with child abuse after police find two toddlers tied in the backyard of a home, and six other children, ages 10 months to 13-years-old, alone inside. Disgusting."},{"comment_id":"10153454337713984","commenter_b":"BITCH","commenter_a":"Garbage! They want us to kidos their feetj!","post_message":"This incident has led to calls for a boycott of United Airlines, but not everyone is jumping on board...  Do you think this airline attendant acted fairly?"},{"comment_id":"767405186757001","commenter_b":"Get them out of America","commenter_a":"At least she learned some ENGLISH😜","post_message":"WIFE OF MUSLIM Immigrant Screams: “F*CK AMERICA!” After Husband Is Threatened With Deportation For Major Food Stamp Fraud In NY [VIDEO]"},{"comment_id":"10153715026934199","commenter_b":"Yup, tell Alaska pipelines are safe.","commenter_a":"you know, a pipeline is the safest mode of transportation.......","post_message":""}]
