[{"comment_id":"10153553698421323","commenter_b":"I'd rather be surrounded by happy refugees , than miserable right wing morons.","commenter_a":"Have you seen most of these refugees? Not the kind of people you want living near you. They've already turned many areas into hellholes for the residents.","post_message":"\"Anyone who tells me Germany is full up, or that we can’t afford them, I say think of our past, and of the future. Of course we can afford them – we’re a rich country, and we have a duty to help those in need.”  The German mayor desperate to welcome immigrants to his town."},{"comment_id":"10154336245354740","commenter_b":"Sheep not waiting for facts to fully come out.","commenter_a":"Notice when blacks are killed by other blacks the liberal media, Democrats, Obama, Sharpton, Jackson, Black LIED movement etc don't think twice nor make a sound","post_message":"Hundreds of people marched through the streets Thursday to protest the recent officer-involved shootings in Minnesota and Louisiana."},{"comment_id":"10156057897300725","commenter_b":"Who would vote for this guy?! Mexicans are the main ones who supplies you with your food and groceries! They built all the buildings you take advantage of today!","commenter_a":"They aren't crashing. Get real. And what the hell do you think you could do about it, huh?? Kick Walmart out of America? They put China on the map today. Good business people. Anything for a buck.","post_message":"Markets are crashing - all caused by poor planning and allowing China and Asia to dictate the agenda. This could get very messy! Vote Trump."},{"comment_id":"1246176155450245","commenter_b":"And don't come to Canada go back home we don't have any room for you either","commenter_a":"That's so true","post_message":""},{"comment_id":"1624197824544119","commenter_b":"During the debate season, Hillary Clinton will mop Donald Trump off of the floor and dump him into the sewer with the mop water because she is 20x smarter than he is. She went thru 12 hours of gruesome testimonies with congressional republicans and didn't even break a sweat and was able to squash all of them like cockroaches. On the other hand, Donald Trump choked during a 1 hour meeting with the Mexican President and he choked and sweated bullets while being interviewed by Faux News Megan Kelly.","commenter_a":"Jordan Elum","post_message":"#Repost Ivanka Trump #Instagram ••••••••••••••••••••••••• Smooches from baby Theodore. 😘 #Latergram"},{"comment_id":"1616996585254121","commenter_b":"Now keep the fuckers from being immigrants in this country","commenter_a":"\"The Brig it is.\"","post_message":"These pirates never saw it coming..."},{"comment_id":"10153878588886545","commenter_b":"Exactly I thought woman that age... can't have kids, no more.","commenter_a":"Why is a 62 year old getting pregnant and having young kids ? Second the 6 year old is only doing what he sees and what he thinks it's right . Do I think he's a bad seed no . Do I think he needs help after this yes.. This is obviously the only behavior that he knows ... I hope the mom suffers in jail .","post_message":"Kathleen Marie Steele of North Redington Beach, near Tampa, Fla., has been charged with aggravated manslaughter and neglect for the infant's death."}]
