[{"comment_id":"10153970480428734","commenter_b":"support the blue, let her pay for her own security!","commenter_a":"Too bad for Miami, they will just lose all of the tax revenue they would gain by Beyonce performing in their city. She doesn't need them they need her and the police want the overtime pay. All talk.","post_message":"Law enforcement around the country have been critical of the singer since her Super Bowl half-time performance, which referenced the Black Lives Matter movement, Malcolm X and the Black Panthers."},{"comment_id":"631371687022892","commenter_b":"What a chump","commenter_a":"Doesn't it make you wonder what Trump is holding over these guys?? I'm so dang curious but it will be years before it seeps out.","post_message":"\"After months of careful consideration, of prayer and searching my own conscience, I have decided that on Election Day, I will vote for the Republican nominee, Donald J. Trump.\""},{"comment_id":"10153573221561336","commenter_b":"Give a clipboard to a woman...And this is what you get. I live on land and not in a neighborhood for this reason. If I wanted to have one painted hot pink it would not matter :)","commenter_a":"That's why I would never buy a home in an subdivision with a HOA they try to control living !!!","post_message":"The homeowners association says the purple playground must be “subdued and within harmony with other colors of the community.”"},{"comment_id":"1753789991533439","commenter_b":"Well one less lesbian in the country .","commenter_a":"Stop getting our hopes up and just get the FUQ out! Useless waste of oxygen","post_message":"Rosie O'Donnell To Leave The Country For This Awesome Reason.  Good riddance. We don't want her anyway.  Would you be happy to see her go?"},{"comment_id":"1729203870680375","commenter_b":"@username Hillary still lies but that's true of most people who are liars. Dr. Carson must be desperate to dredge up a case this old.","commenter_a":"It's too bad these supporters, like Dr. Carson here, doesn't go after the things that Trump says and does everyday instead of something Hillary did 35 years ago. I'll bet a lot of us could dig into our pasts and find things we could have done or said better but yet we're going to vote for Trump, who is supposed to have maturity and says the most mean spirited things any Presidential nominee has ever said and he says these horrible things practically every day.","post_message":"Another woman from Clinton's past is speaking out."},{"comment_id":"10153112407151336","commenter_b":"Doesn't surprise me!!! Lots of liberals there;!!","commenter_a":"What a dullard...","post_message":"“Seattleites know that discrimination has no place in our city,” Mayor Ed Murray said. “That’s just equality 101.”"},{"comment_id":"1296306160407617","commenter_b":"I hope that VA dentist is in JAIL!","commenter_a":"No one at the VA loses a job; for any reason. The 2014 fudged wait list debacle resulted in no nurse or lying administrator losing a job or even pay. The VA is a corrupt leviathan in need of elimination. And with my first hand knowledge of the organization, I would put a bullet in my temple before becoming a patient in the system.","post_message":"Absolutely horrific! This department needs to be cleaned out top to bottom, and people need to be punished for letting things get this bad."}]
