[{"comment_id":"496246340568716","commenter_b":"She has been fired for lying / watergate mess -/ all she is corrupt lying old pruney bitch !!!","commenter_a":"Absolutely","post_message":"Hillary is now denying a MAJOR part of her original response to the Benghazi attack. It's unbelievable to think that she believes she can pull this over on the American people. Everyone needs to know about this...  Is Hillary Clinton unfit to be president?"},{"comment_id":"1767897086815216","commenter_b":"Stfu u dummy","commenter_a":"She has to be on drugs and was coached for the interview. There is way more to this story. I've never had a cop pull a gun on me when I was pulled over for a speeding ticket.","post_message":"WATCH: ABC News EXCLUSIVE: Woman who live-streamed boyfriend shot by police in Minnesota shares her story: @webpagelink"},{"comment_id":"1244912678938315","commenter_b":"... Hillary Clinton for 2016 ...","commenter_a":"A terrorist killed your son. A terrorist the FBI removed from the watch list.Sorry for your loss, it must be devastating but Obama and Hillary wants more terrorists to come here.","post_message":"\"Christopher's paternal grandparents met and fell in love in a Japanese internment camp, so it was in in DNA that love always trumps hate.\"  - Christine Leinonen remembers her son Christopher, who was killed in the shooting at Pulse Nightclub in Orlando  Watch as the DNC took on the gun lobby: @webpagelink"},{"comment_id":"1017395615037845","commenter_b":"@username Border security is far more lax than it has ever been. Obama gives the border patrol and ICE orders to stand down all the time, which is a major contributing factor of the explosion in the illegal alien population in the US. The illegal population here is at an all-time high. There should never have been a healthcare mandate. This isn't a socialist regime. The people (or at least the majority of us) don't like the mandates, individual or business. I assert that you condoned Fast-N-Furious because you're the one who said things are better than they were \"under the misery of Bush\". Businesses salivated at the prospect of cheap labor, so when Bill Clinton signed NAFTA into law they didn't mind one bit firing millions of employees -many of whom had to seek any type of welfare they could in order to get by. Not good for economy ...","commenter_a":"You are MOST WELCOME here in the great state of Pittsburgh, Pennsylvania Mr. Trump!! I cannot WAIT to see you tomorrow!! You build that wall and we'll provide the steel!!! Come on Yinzers!!! Vote Trump!!!","post_message":"THANK YOU CALIFORNIA, MARYLAND, PENNSYLVANIA, & NEW YORK! I appreciate your unbelievable support. Together, WE will MAKE AMERICA SAFE & GREAT AGAIN!"},{"comment_id":"10153686958951028","commenter_b":"Not her? This is total and a unpleasant BS!!!","commenter_a":"Joseph & Christine wowwww","post_message":"Former professional wrestler Chyna has died at age 46, her manager confirmed to NBC4. @webpagelink"},{"comment_id":"10155325034607439","commenter_b":"Women will be wearing them just to be so called fashionable","commenter_a":"YUK","post_message":"Fascist fashion. It's just plain ugly. Anti-fashion, anti-woman, anti-beauty."},{"comment_id":"562653790568588","commenter_b":"That's bad...right :-) Bernie is a moron, a pandering moron.","commenter_a":"idiots topped with lie pudding","post_message":"No, this wasn't Saturday Night Live. Bernie Sanders actually said this in a real debate..."}]
