[{"comment_id":"1744722422438798","commenter_b":"Fkn pussy","commenter_a":"BS!!!","post_message":"College Kid Demands Counseling After Being 'Traumatized' By Seeing The Confederate Flag Sticker  Our society is getting out of control.  Do you think this is ridiculous?"},{"comment_id":"1190463677676992","commenter_b":"Immigration laws are not being in forest because it only applies to legals and not illegals. It's time to make stronger laws and strongly in force them. Also illegals shouldn't be given drivers licenses or any form of ID until they become American citizens.","commenter_a":"The way I see it is this, if people come here and they are illegals SEND THEM BACK TO WHERE EVER IT WAS THAT THEY CAME FROM, the next step is build a wall that's high enough with barbwire around it so they can't try anything","post_message":"Do you agree?"},{"comment_id":"938657176211868","commenter_b":"Who is she ?","commenter_a":"DAN, Dumb A N","post_message":"\"While MSNBC may believe that I am worthless, I know better.\""},{"comment_id":"10153155404671323","commenter_b":"@username cool your jets mate !! Why should this woman or any woman in her situation sit around and wait for her breasts to kill her when she can do something proactive !! Do you know what it feels like to have the threat of your breast tissue turning against you and threatening your life !! Arrogant shite !","commenter_a":"What the fuck are you taking about? Are you a complete imbecile? She has a genetic mutation. This has nothing to do with chemicals. Besides, there are thousands of scientist like me around the world doing research to cure and prevent cancer. Read more before spreading nonsense.","post_message":"'I love my boobs but they have to go'. YouTube star Claira Hermet says goodbye to her beloved breasts before undergoing surgery for a double mastectomy"},{"comment_id":"1029984087043663","commenter_b":"Lying Bitch!!","commenter_a":"Now that Hillary has come up with the idea of barking like a dog if a Republican or Bernie lies,I think its a super idea and should be applied to her. The problem is if you barked at her everytime she lied it would sound like a pound and never stop!","post_message":"Hillary claims she's always tried to tell the truth to the American people - but I think many of them would beg to differ...  Do you think Hillary Clinton has been dishonest?"},{"comment_id":"733570513458390","commenter_b":"He wants to deport the Hispanics? We need to deport him with his team to Russia since they don't have anything to offer the nation. At least the Hispanics do all the dirty work in this nation.","commenter_a":"Politicians and Corporate thugs and bloated military spending.","post_message":"They're called politicians.  The Mind Unleashed"},{"comment_id":"10153807094811336","commenter_b":"Maybe this woman wants the truth about Hillary's evils be known .","commenter_a":"Fox news keeps exploiting this poor woman","post_message":"“[Hillary Clinton] lied to my face at a very, very hard time, and she’s been lying since.” – Patricia Smith"}]
