[{"comment_id":"10152584446122014","commenter_b":"No money for illegals!","commenter_a":"He's not an immigrant. He's a POS rock-throwing illegal alien coyote that's had 14 prior incidents with the border patrol.","post_message":"The judge ruled that the officer was not justified in opening fire on the immigrant who was crossing illegally into Arizona."},{"comment_id":"10153653816037377","commenter_b":"NO AMERICAN FLAGS!","commenter_a":"The color of Hillary stage is UN blue. No America to be found.","post_message":"As the Democratic National Convention entered its second day, presumptive presidential nominee Hillary Clinton's campaign is getting ready for Wikileaks to release more purloined emails and downplaying their potential impact."},{"comment_id":"1421191604574730","commenter_b":"Go to hell","commenter_a":"He's perfect for the job and he's american","post_message":"EXPLOSIVE! CNN Columnist Says Michael Phelps Should Not Have Been The Team USA Flag Bearer Purely Because He is WHITE! Liberals are going CRAZY, injecting skin color and religion into the the olympics!   Lets GET 5,000 SHARES For Phelps! He's White and a BADASS! So what!"},{"comment_id":"1369042613147367","commenter_b":"@username and us tax payers get to pay for double security bc the poor widdle brat can't move and change schools like every other American kid has to do when they move🙄🙄","commenter_a":"I mean Donald did say if she wasn't his daughter he would marry her so essentially it's what he wanted.... still Creepy AF!!! 😷😷😷","post_message":"Did you see this coming?"},{"comment_id":"895405060572025","commenter_b":"Just like that nut","commenter_a":"Looks to me Democrats are pretty scared of Trump and that way they send these people to his campaigning events and start up problems, fights in crowds. Democrats can't play fair cause they know they are not going to win people are tired of being lied to and their rights being striped away...people this is a wake up call!!!! If you value your freedom you better dig deep in who your voting for...because all Democrats are trying to take our rights away!!!","post_message":"This is hilarious.  Video by the Canadian comedy show 'This Hour Has 22 Minutes.' Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153714763793132","commenter_b":"I seriously dislike this arrogant woman who will not be kind to Shannon, she's stupid not to learn from the others. She's annoying...","commenter_a":"The color is BLUE!!!!","post_message":"The Real Housewives of Orange County star made a beautiful gesture."},{"comment_id":"1692664807687298","commenter_b":"She is evil...completely stupid","commenter_a":"She needs help that was sick","post_message":"This is SICK!   End the Cop-Hate NOW. #AllLivesMatter"}]
