[{"comment_id":"10153721390631800","commenter_b":"@username Girls, that's who.","commenter_a":"I can't see the humor in girls trying to look sexy and then being offended by aroused boys and then also being offended when boys don't care about them. I think the problem here is with the girls identity crisis rather than with boys boners.","post_message":"Kristen Schaal finds a way to prevent teenage boys from being too \"distracted\" by girls in leggings. @webpagelink"},{"comment_id":"10153415746649024","commenter_b":"She is not eligible to run..","commenter_a":"The sad truth is that DUMB PEOPLE WILL STILL VOTE FOR HER! !!!! IT SHOULD BE ILLEGAL TO RUN FOR OFFICE IF THERE IS SO MUCH CORRUPTION IN YOUR HISTORY !!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10156128714545725","commenter_b":"About time he helped his teammates out","commenter_a":"Them mugfucken Cubs been killen","post_message":"What a game! Let's hear it for the Cubs ----> @webpagelink"},{"comment_id":"880219112013511","commenter_b":"Try her for what. This is America. Take your laws and get the hell out of America.","commenter_a":"And the Democrats agree... I am sure..","post_message":"Not in America!"},{"comment_id":"10154292221654411","commenter_b":"Aka....draw and quarter Snyder.....lil bitch","commenter_a":"Cunts are a shame....get rid of them...","post_message":"The problem isn infrastructure but rather 'a hate crime and mass poisoning of Black and poor people,'  filmmaker Michael Moore."},{"comment_id":"10157018686460389","commenter_b":"And who is this new party going to be run by.. Romney?","commenter_a":"Ronald Reagan had similar numbers at this point in the process...the anti-Trumpites will fall by the waste-side....they are caught up in narrow-mindedness babble that has locked the GOP out of the White House for 8 years...it does not work WITH their current platform...we will re-write the \"Contract with America\" and the Republic's Platform (for our constitutional republic) and our new GOP party--the New American Conservative Party...AND TRULY MAKE AMERICA GREAT AGAIN. #TeamTrump #TeamUSA #BrightLightOnTheHill #AnythingisPossible #PositiveAttitude","post_message":"This is what an insurgency looks like."},{"comment_id":"10153794102616051","commenter_b":"Agree,she should be in prison","commenter_a":"AGREE","post_message":"Donald Trump says Hillary Clinton's record of scandals make her unqualified to be president. Do you agree or disagree?"}]
