[{"comment_id":"475937869263460","commenter_b":"what drug is she on these days? Think she's lost it in her old age....","commenter_a":"yes christian should pray all the time","post_message":"Parton delivers strong message to christians everywhere.  This is out of line, we need to show her that this type of public disrespect is unacceptable.   Do you agree that christians should be able to pray in public?"},{"comment_id":"10153902791784087","commenter_b":"@username : Shattup Trump whore","commenter_a":"Perfect. No one should be above the law and it's disgusting how her supporters are okay with her getting away with it but when repubs get away with it they act like babies. I'm not Republican either, mind you.","post_message":"#BREAKING: The House Oversight Committee will send a formal request to the FBI as early as next week asking to open a criminal investigation into allegations that Hillary Clinton lied to Congress."},{"comment_id":"1289659341093811","commenter_b":"So someone stole a car that means they deserved to get raped? Sickening","commenter_a":"But you stole and you went to prison, perhaps you shouldn't steal so that you can practice your transgender in your house","post_message":"Horrifying.  (via Daily Mail Australia)"},{"comment_id":"1201018046605718","commenter_b":"Why should I support someone who's two faced and and is only changing her opinion because her PR person told her to","commenter_a":"#freekesha....sexual assault is nothing to start arguments over ...she needs all the support she can get....as a survivor, I'm with you....#standtogether!","post_message":"We can all use our voices and platforms too."},{"comment_id":"728966150600250","commenter_b":"FEMALE ON THE NEST","commenter_a":"Where is the first baby ?","post_message":"WATCH LIVE: We're ringing in the new year with Harriet, M15 and their new eaglet!  We're still waiting for the second egg to hatch!  Where are you joining us from tonight?  WATCH the video of the hatching- @webpagelink Pix provided by Southwest Florida Eagle Cam"},{"comment_id":"10154184964563352","commenter_b":"Melissa..legalizing illegals will devastate black employment..for every available job it will be 150 Mexicans to every 3 blacks...it be horrible for us","commenter_a":"Hes gonna stop illegals from coming taking black jobs..hes gonna kill obamacare fines..wat sensible black would disagree","post_message":"Trump says black Americans 'are going to like me better than they like Obama' – even though the president has 'a slight advantage'"},{"comment_id":"10153301053671770","commenter_b":"What do they call a female dog ?","commenter_a":"He wants back in the white house so he can shame us again.","post_message":"Clinton let out her inner dog during a speech Monday."}]
