[{"comment_id":"10153530679413984","commenter_b":"I hope she gets jail time!","commenter_a":"Some beasty mom will kick her face in I'm sure. As a Juvinal little will happen to her in our current legal system.","post_message":"The extremely disturbing video of a young girl brutally attacking a schoolmate who was holding a small child went viral, now the attacker is facing some serious consequences...  Are you hoping justice is served?"},{"comment_id":"10153186263669411","commenter_b":"And what happens when two monsters get together? another monster!!","commenter_a":"ha ha ha America is a father England is a mother isis is a child isreal is a nanny","post_message":""},{"comment_id":"10153999056241323","commenter_b":"She is pickled she will last a long while yet","commenter_a":"And when the Queen kicks the bucket we will have our money overhauled yet again. How much does it cost to overhaul the money all these times?","post_message":"To be eligible to appear on the new bill, the woman must be Canadian, either by birth or naturalization, and she must have died at least 25 years ago."},{"comment_id":"1085736288142060","commenter_b":"Crazy woman!","commenter_a":"So sick of these lifer politicians & their lies.","post_message":"Nancy Pelosi's pointing fingers (again)...."},{"comment_id":"10154318363317232","commenter_b":"Why aren't they being plowed through? Run these scumbuckets down!","commenter_a":"Sent in the robot","post_message":""},{"comment_id":"939799776150807","commenter_b":"Screw her!!!","commenter_a":"They have been alright with it as long as it worked inn their favorr.","post_message":"Democrat Senator Introduces Bill to Abolish Electoral College @webpagelink"},{"comment_id":"10152823238956130","commenter_b":"Women graduate at a far higher rate than men. From high school and college.","commenter_a":"And no the factors you listed clearly are important, not to discussing what wages should be, but to the discussion of why wages are not equal. Data clearly shows the problem is economic insufficiency, regardless of there being widespread discrimination. So we could make more progress closing the gap by everyone getting a better education (even at the library or online if you know how to source good) building your own successful business, or something innovative.","post_message":"This is what the wage gender page gap looks like."}]
