[{"comment_id":"10153939704691178","commenter_b":"With this huge influx of illegals and radicals the REAL AMERICANS are in danger of extinction , wise up Hollywood!","commenter_a":"Must have fallen fron his star ship and landed on his head.","post_message":"Kind of hypocritical coming from a guy who owns tons of planes."},{"comment_id":"1715229538739557","commenter_b":"True. Plus who would want to see Hillary the Hag naked","commenter_a":"She was a good looking woman, now lets see them run nude picture of Hillary or maybe Chelsea, but then that would be equal and fair treatment and they will NOT be that.","post_message":"NYPOST runs naked pics of Trump's wife... again"},{"comment_id":"10152837238297483","commenter_b":"If you don't like it stay away, you certainly won't be missed .","commenter_a":"That's the problem in Alabama this history of Republican leadership we need more liberals to vote","post_message":"Columnist John Archibald weighs in on how modern-day Alabama fits into the Bible Belt:  \"Alabama ignores that 'thou shalt not kill' commandment, posting the second highest murder rate in America in 2013, the last full year available. And blessed aren't its poor. According to the National Center for Children in Poverty, half Alabama's children are low income. Yet we still tax groceries.\""},{"comment_id":"10154071433569778","commenter_b":"You know him or something?","commenter_a":"Gordon","post_message":"A 9-year-old boy beaten by his mother's boyfriend over birthday cake died from his injuries."},{"comment_id":"10153507378388487","commenter_b":"Not one female player could play to the standard of the men's World Cup","commenter_a":"Value is determined by the market. If we want to constrain the market in the name of fairness, we could get rid of the divide between men's and women's soccer and have one World Cup where the best athletes compete regardless of sex. Ensuring all players are selected based upon ability rather than sex seems fair.","post_message":"The World Cup concludes today, but the battle to equalize women's soccer with the men's game is only beginning"},{"comment_id":"10153206578922483","commenter_b":"Lol Caitlyn, you poor misguided... Whatever you are. I can't tell if you're a child or just an uneducated woman.","commenter_a":"But, muh freedoms...","post_message":"Angered after an argument over his smoking, the customer went to his vehicle and retrieved a 9-mm pistol, which he used to shoot the employee once in the head, according to reports."},{"comment_id":"10154069512515329","commenter_b":"Georgie McCarthy","commenter_a":"That moment in \"Dilemma\" when Kelly Rowland uses excel to text Nelly.","post_message":"\"Life is one big party when you're still young, but who's gonna have your back when it's all done?\""}]
