[{"comment_id":"931527210240361","commenter_b":"and why do women wear make-up? Hmmmm . . . .","commenter_a":"What a gent.... NOT!!","post_message":"Look on the face of woman as Lewis Hamilton sprays champagne in her face says it all."},{"comment_id":"1064358433623633","commenter_b":"TRUMP GO back TO Hell","commenter_a":"Can these idiots be any more reprehensible?! The Repugs care only about the top 1%.","post_message":"The right's hostility toward the working poor is now front and center."},{"comment_id":"1192273137481692","commenter_b":"Isn't this a dam foolish question to be asking of the citizens of US...why would we want Shariah law to begin with...they are taking over and our govt is allowing it...they have to conform to our CONSTITUTION here in America...can't do it, go back to your hole that practices Shariah wicked law..","commenter_a":"Yes! there is NO place in our country for Sharia law so take your laws home, Obay the constitution your in America.","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"665156860339272","commenter_b":"@username God loves Christians and hates all other religions..... Look at how God backed the Christians when they slaughtered 100 million native Indians because they foolishly loved their land and their own spirits, not accepting Christ as the son of God..... so, they were slaughtered... but, they told the men not to waste the ammunition on the women and kids, so they slashed them to death with sabers and machetes.... and God smiled at them...... And, since WW II the Christian Americans have invaded 37 countries killing between 20 and 30 million people, none of them were white Christians though, so God again smiled and nodded with His approval...... We spent $3 trillion on killing 500,000 innocent Iraqi citizens.... or $6 million per person killed..... it is really getting expensive to kill people nowadays isn't it..... Just think if we had spent that $3 trillion on food, we would have ...","commenter_a":"The Hillary and government set up is trying to keep the polls low for trump an high for hilkery, with the media and asking him politely bow out when Hillary wins it's all to hide the fact that they are cheating and they expect to win by their cheating so it will look good when they say she has won and Obama said he would not leave the White House and would blockade anyone coming in but they are trying to make Trump say that he won't fight. Because they know the system is rigged and ready for Hillary but God it's the boss.","post_message":""},{"comment_id":"1692723517682991","commenter_b":"One of you crazy ladies is from Texas.","commenter_a":"Realism is not what I see coming from most of HRC's supporters. There are some extremely hard to admit, and in fact, frightening facts that I think we have all tried to glaze over for years. In Bernie Sanders we have got a candidate that is addressing those facts. Climate Change is real, most democrats are no longer climate change deniers, but I feel like the real threats are being overlooked. For example, droughts are happening all over the United States. We are quickly depleting our fresh water aquifers. When one factors Fracking into this, we are willfully allowing our government to destroy more of our fresh water systems. HRC cannot denounce Fracking. Now, before you think that article that spells out how much HRC is taking in campaign contributions from the fossil fuel industry is another Republican smear tactic, note that it is by Greenpeace. She has to go. ...","post_message":"\"We can open the door to every person in this country again.\" —President Bill Clinton"},{"comment_id":"633195336830149","commenter_b":"Illegal invaders","commenter_a":"Feed them, clothe them. Try to teach them in our schools. Send them back where their parents came from.","post_message":"Where are their parents?"},{"comment_id":"10152832059200927","commenter_b":"Only in PRC (People Republic of California)","commenter_a":"This guys also looking for a raise, he says he can't make it on $174,000 a year with free medical, vehicle, and perks. I think he needs to be deported.","post_message":"So the murder of an innocent woman by an illegal alien is little thing?  That's what this congressman thinks!"}]
