[{"comment_id":"10153449417193984","commenter_b":"She is a loser!!!!","commenter_a":"Her Poor daughter .. I bet she was totally humiliated .. and then to have mom remove her from her class mates .. Brutal :(","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"10153718777033690","commenter_b":"Why don't the Saudis and Qatari take them all. The are wealthy nations with more real state than Europe. We definitely don't want them here in the US we have enough dealing with illegals coming from our southern border...!","commenter_a":"Take 30 seconds to sign (and possibly share) this petition asking the US government to take in 65000 Syrian refugees. Germany is expected to accept 800,000 refugees this year, while the US has accepted less than 1,000 thus far. Let's do a small part to encourage the U.S. government to be socially responsible. This is a humanitarian crisis and the Syrian refugees have nowhere to go. You can vote no matter where you are from. @webpagelink","post_message":"\"The world sees Germany as a country of hope and chances,\" German Chancellor Angela Merkel said at a news conference last week.  Despite all the positive energy, however, some observers are questioning how the tens of thousands of newcomers, many of whom are conservative Muslims, will integrate and adapt to German society."},{"comment_id":"451917294996564","commenter_b":"As far as I know, no Subway in America has made this kind of change.","commenter_a":"So how many muslims vs AMERICANS are there in the U.S. that needs changes. REALLY?","post_message":"Should we boycott Subway?"},{"comment_id":"537038436486736","commenter_b":"PUKEBAG, Tax-evading, racist POS!","commenter_a":"What A Joke HE IS DEFINATELY TALKING OUT HIS ASS NOW","post_message":"Dr. Alveda slams Al Sharpton for comparing himself to MLK on live TV.  Al Sharpton and MLK should never be used in the same sentence.  Do your agree Al Sharpton is a criminal?"},{"comment_id":"755872544562858","commenter_b":"Hes a special kind of stupid isn't he!!!","commenter_a":"I think I read Obama sent his people to Israel to interfear in their election. This is like the pot calling the kettle black. Put that is what Bullies do.","post_message":"President Barack Obama says the U.S. must and will take action against Russia in response to cyber interference with the election."},{"comment_id":"10156436861080354","commenter_b":"Barbara is either asleep or as dumb as a box of rocks!","commenter_a":"BABA STREISAND is a LIBTARD MORON, Like her EVIL BUDDY HUSSEIN OBUMMER...!! EAT SHIT BABA SHEEP STEISAND..!!!","post_message":"You've GOT to see her characteristically snooty and elitist statement..."},{"comment_id":"10153301251374087","commenter_b":"Jesse anderson, another perfect example of a bootlicking crypto fascist","commenter_a":"If police are doing nothing wrong they should have no problem being videotaped.","post_message":"The question of whether police are reluctant to enforce the law because they are afraid of being videotaped has become the subject of fierce debate, as experts struggle to explain an uptick in violent crime in some U.S. cities."}]
