[{"comment_id":"10153739265778984","commenter_b":"No need to wonder what you are, being from Liberfornia and all.","commenter_a":"I 100% support her staying in jail until she agrees to do her job as ordered by a federal judge.","post_message":"For Kim Davis, this is Day 5 of her incarceration - but her lawyers just made an announcement that could turn things around.  Do you support Kim Davis?"},{"comment_id":"765284786938035","commenter_b":"real women respect themselves enough to not get knocked up and then run from responsibility.","commenter_a":"The Colorado shooter's neighbors have been interviewed and his shack has been visited. Turns out he was...drumroll please...AN OBAMA-LOATHING PRO LIFE CHRISTIAN! Now who could've possibly seen that coming? The propaganda videos led the terrorist to carry out his deed. Sound familiar something going down a tad east of here?","post_message":"What a sleaze ball."},{"comment_id":"10154385949804087","commenter_b":"@username I think he ran away like a little bitch","commenter_a":"If all you ding-bat liberals would have acted like mature adults, all the EXTRA security wouldn't be needed and costs would have been much less. But no, you all ad to act like psychotic juveniles so this is what you get.","post_message":"The New York Police Department is blasting Republicans in Congress for refusing to cover costs to protect Trump."},{"comment_id":"848307568693153","commenter_b":"GO stuff your FAT ,UGLY, RACIST face!","commenter_a":"What IF I ONLY HATE \\bOBAMA'S \"WHITE\" Half???","post_message":"If you hate Oprah does that make you a racist..."},{"comment_id":"923666907700065","commenter_b":"That hoe better learned how to fight cuz we gon square up lmao","commenter_a":"@username if I ever find out my daughter sucking dick idgaf she can get it . lmao go to her school and embarrass her. lmao","post_message":"Mom Beats Her Daughter In Broad Daylight For Sucking D!"},{"comment_id":"10153025279926491","commenter_b":"What's the deal with communist people looking at all the post in this feed? Makes me wonder if they sent people like in Ukraine to start protest and eventually riots and killings. So far 5 have msg me and I've called their bluffs. Busted","commenter_a":"American Folks are in desperate need of a National Refresher course on the Civil War and American Reconstruction, so with that been said, let just stop framing the Confederate Battle Flag issue as a \"free speech\" issue and call it what it is, TREASON !!, and that's a fact jack","post_message":"Many still support the current flag."},{"comment_id":"10153498985924032","commenter_b":"Did these girls post this photo, or did it get posted by the prankster that took the photo?","commenter_a":"Expelled? Yeah, because interrupting what is obviously NEEDED education is the answer here... Maybe they should sue Snapchat as well, because this wouldn't have gotten the attention it did if they hadn't posted it on the app. *insert eye roll here*","post_message":"The petition was started by change.org and already has more than 39,000 signatures."}]
