[{"comment_id":"10153224178386336","commenter_b":"You cannot deport american citizens out of america, it makes no sense. lol","commenter_a":"Gather them up and ship them out of the country. Anyone who doesn't respect America should leave. No one is asking them to stay.","post_message":"A new social media \"challenge\" is encouraging people across the country to disrespect and stomp on the American flag."},{"comment_id":"1095436653882721","commenter_b":"Shut the Hell Up!","commenter_a":"this asshole can;t handle protesters and people actually think he can handle trained killers. Yeah DISASTER BELIEVE ME DISASTER IS TRUMP","post_message":"Exactly.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1143390539087332","commenter_b":"#HillaryALLTheWay #HillaryClinton2016 #ImWithHer #MadamPresident #Hillary2016 #OutForHillary #ShesWithUs #WomanCard #StandWithHillary! #TeamClinton #LoveTrumpsHate #Ready4MadamPresident #DealMeIn #GoHillary #HillaryForMe #HillaryForPresident #Rally4Hill2016","commenter_a":"Oh Lisa Lampanelli never fails....","post_message":"LOL! The look on his face is PRICELESS."},{"comment_id":"10153932654413854","commenter_b":"He has cornered the market on STUPID...","commenter_a":"This guy is absolutely INSANE.","post_message":"Obama cites American Revolution as example of Americans being falsely paranoid about gov’t tyranny"},{"comment_id":"1140838815950861","commenter_b":"@username now you're gay bashing but Muslims love male goats","commenter_a":"I bet Obama won't send anyone to her funeral...crickets. RIP Sister in Blue We have the watch from here.","post_message":"A Virginia officer who was on her first shift with the Prince William County Police Department was shot and killed Saturday and two other officers were wounded in a standoff stemming from a call about a domestic-related incident."},{"comment_id":"10152701811618067","commenter_b":"What about Asians! We have more wealth than whites! ;)","commenter_a":"CNN thought process: Pot? Check. Ladle? Check. Add racial mixture. Add perceived racial sleight. Stir vigorously. Serve on CNN Special, \"[fill in gap] in America\"","post_message":"The latest report about financial inequality makes for uncomfortable reading... @webpagelink"},{"comment_id":"1577321485900379","commenter_b":"Women yes! Hillary no!!!!","commenter_a":"No victory to any women! She does NOT represent me! she's a liar, fraud.. and doesn't even come close to respectable... What a shame for \"women\"","post_message":"Hillary Clinton: “We’ve reached a milestone: The first time in our nation’s history that a woman will be a major party’s nominee for President of the United States.”"}]
