[{"comment_id":"10153266920996051","commenter_b":"I think he's a muslim sleeper, programmed to distroy this country and let in all the muslims he can recruit.","commenter_a":"Even if he was it's his freedom to choose...why does he have to practice Christianity or Catholicism?","post_message":"Do you think these voters are right about President Obama?"},{"comment_id":"10153740832391800","commenter_b":"Chris, honey, being a salty bitch isn't going to solve the problem.","commenter_a":"Islamic Extremists: Kills people that don't share their beliefs, Christian Extremist: Kills people that don't share their beliefs! I say, we should worry about these pro-life extremist before we worry about extremists on the otherside of the earth!","post_message":"In the wake of a shooting at a Colorado Planned Parenthood, the media questions whether or not it was an act of domestic terrorism.  ►Watch last night’s full episode now: @webpagelink"},{"comment_id":"10154289426723797","commenter_b":"@username I am an alcohol manufacturer.","commenter_a":"They should never have been in prison to begin with.","post_message":"OBAMA COMMUTES DRUG SENTENCES: Nine people from Illinois are among the 95 whose prison sentences have been commuted by President Barack Obama."},{"comment_id":"10154242646146336","commenter_b":"Lots of ladies in Texas have CHL (concealed handgun license) enter at your own risk!","commenter_a":"Caitlyn Jenner is harmless. But lots of creeps out there will go into the women's room to do things other than pee. It's only a matter of time before we hear the horror stories. Be careful ladies.","post_message":"Donald J. Trump said this morning that he does not agree with North Carolina passing a law on bathroom use by transgender people.  He added that if Caitlyn Jenner visited Trump Tower she could use whichever bathroom she prefers. @webpagelink"},{"comment_id":"536487383205696","commenter_b":"Here's some facts for you Gerry - I NEVER want to be someone's \"arm candy\", I will NEVER marry for money and I don't have relationships with people because of the way they look. I do agree with you when you say we are our worst enemies, but that doesn't give you the right to generalise all women. Unless you're happy to be lumped with the guys that are shallow and only date women with big breasts","commenter_a":"Who the hell cares if she is pregnant? unfortunately women are their own worst enemies, happy to be arm candy of some of the most groteste males alive,providing they are millionaires, fact!","post_message":"Jennifer Anniston has said we’ll be the first to know if she's pregnant. Writing for The Huffington Post, the actor blasted the “sport-like scrutiny” she lives under, saying it’s indicative of society’s warped view of women which sets a dangerous example for girls."},{"comment_id":"10153228177684411","commenter_b":"Yes, and Russia is one of them, no?","commenter_a":"The only reason that Putin has troubles on his borders is that he steadfastly refuses to keep his troops within them. Russians need to elect a leader committed to managing their economy effectively instead of pursuing fantasies of reconstituting the old USSR.","post_message":""},{"comment_id":"10152706820701051","commenter_b":"A lot of the comments posted here are no better then the girls who did this. Nothing but a lot of hate.the girls had no right to hurt anyone.But are you any better.look at your comments.and yes I think this girls should pay for what they did.Bottom line no has a right to go beating up people .Got a problem do it right call the law.that's is if your not just personally the one wrong","commenter_a":"Its racially insensitive to assume black girls can tell the difference between right and wrong. As well as controlling their impulses. Seriously white folk....one step at a time.","post_message":"One of the women who beat up this teen girl says she’s the real victim. Here’s why."}]
