[{"comment_id":"705344102952475","commenter_b":"@username, I'm no fool and I'm with her. Run along, jump back into your basket and go away...","commenter_a":"No matter what your kinds of words against Hillary we will not listen to you.This is solid Blue.","post_message":"\"There were trans people all over the country who were so excited that we could get gender identification papers that reflected who we really are … that is something that Hillary Clinton has done.\" —Laverne Cox"},{"comment_id":"10153817603534497","commenter_b":"Feminism isn't a hate group.... lol Some feminists are cunts, but you can find cunts in every group of people","commenter_a":"That sad moment that a funny article about the majority of TV shows predictably lacking in certain areas turns into a feminist women hate spree. Need for feminism reconfirmed.","post_message":" part of my brain will just be switched off."},{"comment_id":"814364195330989","commenter_b":"Do that shit over here!","commenter_a":"and they wonder why most of Americans don`t want them here,Trump is right.Not all muslims are killers,but how would we know>?","post_message":"VIDEO: This is What Muslims Did in The Streets After Orlando Massacre…"},{"comment_id":"10156358978545354","commenter_b":"For the record, can't stand the women of the View.","commenter_a":"Too bad she wasn't this sharp in her failed tenures at Lucent and Hewlitt-Packard. She has the nerve to keep getting mileage out of Trump's remarks about her looks. Google \"Fiorina Gaffe\". If the media hadn't kept that video \"under wraps\" while at the same time raking Trump over the coals for his remark, the whole flap about her face would have been a \"non\" issue. She also left her campaign for Senator 5 million in debt and her staffers high and dry. Do your research before throwing support behind her.","post_message":"WATCH Carly run circles around the ladies of \"The View.\" Epic!"},{"comment_id":"1656487827976632","commenter_b":"\"a balanced choice between having a heart and having a brain.\" Really? Who wants to vote for a thyroid? ha.","commenter_a":"@username is a balanced choice between having a heart and having a brain. The two are not mutually exclusive. #JohnsonWeld2016 #Libertarian #FreedomEquality","post_message":"Sarah Silverman and Bill Maher spent a portion of Real Time with Bill Maher Friday wondering why 29 percent of millennials – many of them former Bernie Bros – have ticketed their vote to Libertarian candidate Gary Johnson instead of Hillary Clinton. \"Gary Johnson is a fucking idiot,\" Maher said."},{"comment_id":"743053085796330","commenter_b":"Idiots !!","commenter_a":"\"It is self-evident that no number of men, by conspiring, and calling themselves a government, can acquire any rights whatever over other men, or other men's property, which they had not before, as individuals.\" -Lysander Spooner","post_message":""},{"comment_id":"1083798295013251","commenter_b":"The JUDGE is a woman...","commenter_a":"How stupid!!! Wonder how this guy became a judge!!! Her mother is with her!!! Who is the idiot who is challenging her contract? Hang tough Bindi!!!","post_message":"A court judge is demanding proof that the 'Crocodile Hunter' is dead.  (via Daily Mail Australia)"}]
