[{"comment_id":"1077284305661431","commenter_b":"Hillary for POTUS! Hillary 2016! THE MOST QUALIFIED CANDIDATE! #imwithher","commenter_a":"You will never be our president, and I cannot wait to see what you do when the FBI files against you! I think your failing political career is dead!","post_message":"“To me, that’s the best of America and it keeps me going. That sense we are all in this together. We all have vital contributions to make. And that when come together, all of us, with a sense of shared purpose and shared humanity, we can solve any problem we face. We can heal any divide. We can build a future that is far, far better than our past.” –Hillary during her speech on breaking down barriers in the African American community"},{"comment_id":"684314941708338","commenter_b":"You pussy","commenter_a":"A vote for Trump is a blatant vote for racism. I'm so embarrassed at the people who support such hatred.","post_message":"Skywriters' message for Donald J. Trump: \"America is great. Trump is disgusting,\""},{"comment_id":"10153115245746162","commenter_b":"What a pig!","commenter_a":"Unbelievable!!!!!!!!","post_message":"30-year-old Matthew Warner is charged with sexually abusing and killing his 19-day-old daughter.  How he almost got away with it @webpagelink"},{"comment_id":"1031074676904002","commenter_b":"girls get u a 357 they will stop","commenter_a":"just waiting for the ruling that guns are people too","post_message":"This is gross -->"},{"comment_id":"10155045713159073","commenter_b":"Risking war lol? You do realize that we would utterly destroy Mexico in less than a few weeks. Mexico would never declare war on us.","commenter_a":"We're is your proff..........for this post","post_message":"A wall would do little, if anything, to stop the flow of illegal drugs - the majority of which are actually smuggled though checkpoints."},{"comment_id":"603575639802390","commenter_b":"Dumb bitch but I completely understand there decision to shoot the Silverback.","commenter_a":"If you are such a negligent parent that you allow your 4 year old child to fall into the pen of a wild animal, you should have to descend into the pen yourself and fight the animal with your bare hands to show society that you are still fit to be a parent.","post_message":"The zoo's decision to kill a 17-year-old, critically endangered gorilla after a 4-year-old boy fell into the animal's habitat has sparked outrage."},{"comment_id":"868576086513962","commenter_b":"My mako 10 rounder has never feed a full magazine flawlessly","commenter_a":"I think we shouldn't have to do this, there shouldn't be a magazine restriction","post_message":"What do you think about this?"}]
