[{"comment_id":"10153900140313487","commenter_b":"Nazis are big in SA. Very wealthy, and powerful","commenter_a":"'Baby' Hitler was beaten by his father, and though loved by his mother, she died young. Take away either thing and you have a different adult.","post_message":"What would you do?"},{"comment_id":"1170750279653754","commenter_b":"Leave, Obama, just leave already. Go live in the ghetto desert with your Saudi prince best friend, before whom you knelt and kissed his hand. And take lying, leftist, socialist Hillary with you, and Bill, too. Don't forget to tell Bill to keep his pecker in his pants. We'll even provide a private jet on Egypt Air for you. In your picture at the Orlando vigil for our citizens you coundln't kneel like you did b4 the jihadist price, you just sqatted like they all do since they all don't have toilets. You are a disgrace and you are one of them!!!","commenter_a":"he is absolutely right","post_message":"When Obama ignored radical Islam, this YouTube star went online and slammed him for the coward that he is. He proved that Donald Trump was 100% RIGHT in calling this ISLAMIC TERRORISM, and we should not be afraid of those words!  Let's get 1,000 SHARES for a man who's not afraid of telling it like it is!"},{"comment_id":"10155146081185725","commenter_b":"I would never allow a nun within a telephone poles reach of me! Hahahah","commenter_a":"At least the club is consenting adults! Not a priest on scared little boy! Protest that instead you concrete vagina bitches!","post_message":"A group of suburban nuns is suing a neighboring strip club for the second time. What their complaint is this time --> @webpagelink"},{"comment_id":"10155325034607439","commenter_b":"Women will be wearing them just to be so called fashionable","commenter_a":"YUK","post_message":"Fascist fashion. It's just plain ugly. Anti-fashion, anti-woman, anti-beauty."},{"comment_id":"10152541271415667","commenter_b":"Well Mickey they need a big building for all of his coloring books. Forget the white racist asshats on here... they will all die off eventually.","commenter_a":"Bush is responsible for thousands of american lives yet you bigots hail him as this savior because a blk man is president...he needs to be in jail yet you tea parties build him a library. .FOR WHAT!","post_message":"\"I have no more campaigns to run,\" Obama quipped during the State of the Union. \"I know 'cause I won both of them.\""},{"comment_id":"661111504079428","commenter_b":"They are eat up with the dumb ass !!!","commenter_a":"Whats amazing is that I know a lot of people that just love obama. What's the matter with peoples these days ???","post_message":"This group of police officers destroyed Obama, this is hilarious.  Great. We completely support these officers.  Do you support their stand against Obama?"},{"comment_id":"10154892441134312","commenter_b":"Shes hot","commenter_a":"And the mother of the year award goes too...","post_message":"The toddler was found inside suffering from hypothermia and frostbite."}]
