[{"comment_id":"10157187236600354","commenter_b":"Feminists need to stage another protest akin to their bra burnings in the 60s. Perhaps a massive Hijab burning in multiple western countries.","commenter_a":"So funny how the media always pushes these anti-Iran stories even though iran is 1000x more secular than our \"allies\" Saudi Arabia... let's hear about how many women Saudi Arabia executed breitbart. Stop the Iran propaganda pieces, you're turning into another Fox News.","post_message":"When will feminists take on the REAL \"War on Women\"?    “...promote immoral and un-Islamic culture and promiscuity...”"},{"comment_id":"10153224075406336","commenter_b":"I'm upset about it too, but let's take a look at our current President. He's stomped on the US Flag toward other nations apologizing for Americas stance for years on policy. He just keeps stomping and we just keep believing lies and hypocrisy.","commenter_a":"What a disgrace to our country!","post_message":"A new social media \"challenge\" is encouraging people across the country to disrespect and stomp on the American flag."},{"comment_id":"10156246277170725","commenter_b":"But I don't support Trump's fantasy plan about deporting 11 million people illegals with criminal records should be deported immediately!!!...we should build a wall too....and we should give work permits, make them pay fines, and adopt an E-verify system. ....that's more realistic and rational. Switzerland has a population of 8 million people, according to Trump's plan, he would deport the equivalent of every single person living in Switzerland and then SOME not only it is CRAZY, it's impossible. ..for the sake of argument let's say it was possible, it would cost billions and billions of dollars and take decades to accomplish that.","commenter_a":"I think people are going to vote donald trump for president","post_message":"Saying goodbye to some of my great workers at Trump National Doral Miami."},{"comment_id":"10153137548926051","commenter_b":"Obviously had to have his eyes closed, or blind to begin with!!! Maybe blind and she had a sexy voice!!! NAH.... Couldn't see something this ugly having anything sexy!!!!","commenter_a":"This unfortunate woman needs anger management & some AA meetings. A bit of dental work and make-up wouldn't hurt either--She was probably brought up in poverty. sandi","post_message":"When this woman's boyfriend refused to get intimate with her, she snapped."},{"comment_id":"10154576995593812","commenter_b":"And Hillary gets away with what?","commenter_a":"#Belicheater","post_message":"A federal appeals court has rejected Tom Brady's attempt to get a new hearing on his \"Deflategate\" suspension. @webpagelink"},{"comment_id":"10154003044699199","commenter_b":"They dont wanna work !","commenter_a":"Picking apples and berries?","post_message":"There were 5.4 million job openings in the U.S. in April  the highest number of openings in 15 years.  It is a record high since the Bureau of Labor Statistics began tracking monthly job openings in December 2000."},{"comment_id":"894010200634440","commenter_b":"I'll call him a she once he's a female according to the dictionary.","commenter_a":"Caitlyn Jenner's award acceptance speech. Uplifting, heartfelt, inspiring... Courage, intelligence, compassion, awareness, education... Caitlyn pointed out many of the crucial life and death issues facing trans folks nationally and globally. She made an impassioned plea for acceptance and respect for all of humanity and the trans community in particular. For such a new figure in the global trans community, she did an excellent job at getting the truth across. Her speech had me in tears early on and particularly when she addressed her family and her mom. Something additional: twenty percent of transgender people have served in the military, which is double the percentage of the U.S. general population that has served. Close to 16,000 trans folks are currently serving in the U.S. military. Close to 135,000 trans Veterans have served.","post_message":"\"Oh you know, just in the kitchen by myself crying because of Caitlyn Jenner's ESPYs speech.\""}]
