[{"comment_id":"10155421751074062","commenter_b":"Another idiot...","commenter_a":"To late to act like your civil now !","post_message":"Black Lives Matter activists led a peaceful march in Houston on Saturday."},{"comment_id":"377454052442889","commenter_b":"Let's BAN Muslims, this is our country and our freedom of religion!!!! They need to go back home where they belong to do this in their own country!!!!😡😡","commenter_a":"If the Muslims choose t o.live here, Don' t tell us what you want. This is America and a lot of us are Christians and we don't need or want immigrants telling us to change our beliefs. If you don't like our beliefs and our freedoms, maybe you should g o back to you country and try to get along. If you choose to stay here and enjoy our life and freedoms, then stop telling us to give up.our beliefs. I suggest you join a branch of service and share the responsibility of living here instead of holding your hands out for every thing you can get for free. It's time we stand up to you and what you want. I'm tired of it. God bless America!!!!","post_message":"The want to change Easter in \"Spring Break\"..."},{"comment_id":"995453690492867","commenter_b":"So he was generous enough to tip 15% (in a \"workaraunt\" none-the-less) and he's a penny-pincher. Can someone explain why these are bad qualities for a politician?","commenter_a":"He tipped 15%... The normal tipping amount for a small group. How about criticizing him where it's actually warranted instead of focusing on this nonsense?","post_message":"Bernie Sanders claims to be the champion of low-wage workers across America. However, what he did to a waiter recently proves that the rumpled, curmudgeonly socialist is full of hot air.  None of the GOP field would have EVER done this... not even Christie. Spread this everywhere."},{"comment_id":"478375502350743","commenter_b":"Ridiculous. Stop this nonsense","commenter_a":"Pay the fine..it's a small price to pay for all God has given us.","post_message":"Obama's America hating Christianity..."},{"comment_id":"10155325034607439","commenter_b":"Women will be wearing them just to be so called fashionable","commenter_a":"YUK","post_message":"Fascist fashion. It's just plain ugly. Anti-fashion, anti-woman, anti-beauty."},{"comment_id":"557140984486841","commenter_b":".....Hypocrite HILLARY SAYS DONALD DOES NO RESPECT ALL AMERICAN AS SHE HAS NO RESPECT FOR AMERICA OR AMERICANS ONLY GLOBALISM....HILLARY HAS LOST HER WAY SHE HAS FORGOTTEN THIS IS OUR HOME 'AMERICA'. WE WANT TO KEEP OUR FAMILY SAFE!, WHILE HILLARY JUST WANTS TO APPEASE THE ILLEGALS ..","commenter_a":"#NeverEverHILLARY PERIOD!! #BILLANDHILLARYCAREERLIARS","post_message":"Hillary Clinton’s actions constitute all of the elements of a major criminal enterprise - she created a private illegal email server in order to hide her corrupt dealings. She did so knowing full well it would put American lives at risk by making classified information highly vulnerable to foreign hacking. But, she didn’t care – as long as it helped her get away with her crime, no risk to America was too great.  Then, to further cover-up her crime, she deleted 33,000 emails to keep them out of the hands of authorities and the American public.  As a further element of the criminal cover-up, she claimed under penalty of perjury that she turned over all of her work related emails. We now know this to be one more massive Clinton lie. The FBI found thousands of work-related emails she failed to turn over, including the new discovery this week of 15,000 more work-related emails she failed to disclose.  What is being uncovered now is one of the most shocking scandals in American political history."},{"comment_id":"650948841696821","commenter_b":"Yup","commenter_a":"@username smh crazy sheeeet","post_message":"Damn."}]
