[{"comment_id":"10153001751980950","commenter_b":"Sarah, please elaborate. Because you've lost me completely.","commenter_a":"Hahahhaha so crazy.... Muslims are peaceful people ..its TERRORIST who are the killers.... And if ya haven't noticed there are white people in ISIS","post_message":"The gun shop owner says he's making changes immediately to \"make America a safer place to live.\""},{"comment_id":"10155686821610354","commenter_b":"Please were in Big Trouble if the ASSHOLE gets in. It's bad enough the ASS already in office is dismantling our Country little by little she'll just finish it off. Her and her asshole of a husband.","commenter_a":"She could have changed to state ID if she is no longer driving and that information should have come via letter","post_message":"Clinton said that she was fighting “for the grandmother who’s turned away from the polls because her driver’s license expired.”  If she didn't want it to expire, she could have driven once or twice since 1996..."},{"comment_id":"652024288284285","commenter_b":"I'm so glad.","commenter_a":"Yes","post_message":"Muslim Miss USA Chooses Jesus Over Mohammed... Islamic Community FURIOUS  She has the right to believe whatever she wants to believe.   Do you support her choice?"},{"comment_id":"10153435939769087","commenter_b":"@username Sorry you feel that way. She'll cheat and lie to you also.","commenter_a":"Who cares anymore what Bill Clinton has to say? He has no influence anymore. Why doesn't Bill & Hillary Clinton follow the law? why are they exempt from following the law?","post_message":"\"It's important that we not be chumps when we decide what security provisions should be employed to check people's background,\" former President Bill Clinton said. \"America is a place that welcomes all people who are willing to treat people the way they want to be treated, willing to follow the law, willing to create a common community.\""},{"comment_id":"10153619308152235","commenter_b":"@username a racist comment about baking!?? Okay, surely you jest. You don't know what you're talking about so you're automatically excluded. @username I agree it could be seen as sexist except I am a female and bake all the time, but MORE IMPORTANTLY Men are known to be the best chefs😉. @username she didn't make any valid point when she stated \"nothing new, threats made against students daily\" She's out of touch with the article and with reality if she is trying to compare unspecified kids being threatened to a RACIST threatening to kill only BLACK KIDS posing with ak47 on the school grounds!! ARE YOU FREAKING KIDDING ME!??? The generalization she attached to this comment is uncanny, disturbing, and I'm sorry RACIST in an of itself. Because the DENIAL of racism IS racism also.","commenter_a":"This is nothing new. Threats are made against students daily! We went through this last year and most kids were kept at home until the instagram poster was identified.","post_message":"Another effing beautiful day in post-racial America."},{"comment_id":"1772229929682875","commenter_b":"@username In defense of Donald Trump : Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not starting a race war. Trump did not leave any US soldiers in Benghazi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of Russia. Trump did not shrivel our military, and betray our veterans. Trump did not cripple our economy. Trump did not increase our debt to 20 trillion ...","commenter_a":"Trump represents everything that is wrong with America. A narcissistic opportunist, a pathological liar, a clueless idiot, an unashamed con man and an unapologetic bigot!","post_message":"Imagine this man in charge of our men and women in uniform."},{"comment_id":"1129299917126536","commenter_b":"Hillary is the real war on women.","commenter_a":"Together we Move Forwards Vote to President @username 2016.","post_message":"In ten years, we can generate enough renewable energy to power every home in America. #EarthDay"}]
