[{"comment_id":"10153297983721336","commenter_b":"I lean liberal and I agree. Fine the companies that hire illegals. Tax all employees, legally here or not, the same. If their legal papers expire and they are still here deport them and fine the company a shitload","commenter_a":"The answer is real simple. Enforcement of employment laws. Fine, and, if necessary, arrest those who employ illegals. Along with jobs get rid of freebies. They won't stick around for long with no jobs and no freebies.","post_message":"\"I think up until now, you can say, 'well it's in the hands of the courts.' But at a certain point it's not going to be and you're going to have to answer.\" – Charles Krauthammer"},{"comment_id":"915863931882175","commenter_b":"I think he should be raped until bleeds to death","commenter_a":"Let him go to prison and play with REAL BIG MEN","post_message":"Amanda awoke to find her baby was missing. She found her in the basement bleeding and unconscious. This man had raped the 9-month-old infant until she was brain dead. He was arrested and is in jail, but many people think he deserves a harsher punishment for his crimes. A new petition is calling for him to be hanged in public for his disgusting crime.   Should he be hanged?"},{"comment_id":"1689347211355625","commenter_b":"Well hopefully none of these girls are lesbians because if they want shari law they could end up getting stoned to death. Bunch of fools.","commenter_a":"I'm offended that must stop OHH wait a minute I'm a white America I don't have rights !!!","post_message":"SHARIA WEEK! Islam Week At Schools In America, Administrators Demand Females Wear Hijabs To Show Support!   Lets get 3000 SHARES if you'd like to see Trump outlaw Sharia Week!"},{"comment_id":"10153891408869062","commenter_b":"Yeah","commenter_a":"Waiting on PA","post_message":"JUST IN: The Texas House Committee approved a bill to make marijuana legal for adults. It still has a long way to go before becoming law, but what do you think?"},{"comment_id":"546896738832150","commenter_b":"Don't worry just go vote under a dead guys name or pick up a few illegals and get them to vote too. What democrats do all the time .","commenter_a":"I accidentally vote for Cain, so the four percent is a little high.","post_message":"POLL: Who won the VP debate?"},{"comment_id":"10157089744255347","commenter_b":"If Obama lied about military service/valor, would he be a hero or a liar? My guess is he'd be a liar, so how is this man still a hero?","commenter_a":"Chris Kyle was an American war hero...PERIOD. You liberal hacks need to find another hobby :/!","post_message":"American Sniper Chris Kyle told yet another lie: How many medals he received."},{"comment_id":"1753315408263301","commenter_b":"When u ugly as Fuck but because of your money u can fuck whatever hot girl you want! 😒😒😒","commenter_a":"😧we have become the laugh Hurd around the world..","post_message":"Nothing wrong with nude modeling, but could you imagine how they would scream if Michelle Obama had done this? Hypocrites..."}]
