[{"comment_id":"1301607906602125","commenter_b":"sharon when and if hillar y gets on i hope she puts the syrian refugees near u look what happened in europe well maybe u can get 1st taste of the syrian refugees in ur neighborhood","commenter_a":"Trump totally blew that first questions......He's the greatest at deflection.....LOL.......all he can say is we got to stop the jobs from leaving.","post_message":"WATCH LIVE: Hillary Clinton and Donald J. Trump square off in their first debate."},{"comment_id":"1528246223862069","commenter_b":"@username Pink pussy bow","commenter_a":"I am so glad that someone finally said all of those things directly to her smug, lying, corrupt, evil face!!!! That was awesome! All of us \"deplorables\" wish we could have the opportunity to do exactly the same thing!","post_message":"A notable percentage of voters changed their mind on Trump's attitudes toward women after the latest scandal."},{"comment_id":"1751693101711200","commenter_b":"Who is this women?...wait nevermind. I don't care!","commenter_a":"Everything we say anymore is considered to be racist","post_message":"Blake Lively is being accused of racism after using a famous line from Sir Mix-a-Lot’s 1992 song “Baby Got Back (I Like Big Butts)” to describe her assets."},{"comment_id":"524375314431275","commenter_b":"She is a disgusting human being.","commenter_a":"Lord what a pig.","post_message":"President Bill Clinton's accusers are publicly condemning Joy Behar for calling them \"tramps.\" @webpagelink"},{"comment_id":"10153810084117169","commenter_b":"Cornelia Gnutow Thompson","commenter_a":"The truth has a way of asserting itself. Thank God.","post_message":"News from NOVA l PBS:"},{"comment_id":"645397708975441","commenter_b":"Wow, does he have any world facts available to him?","commenter_a":"My 15 year old answered the question","post_message":"This is just laughable."},{"comment_id":"10157758385010725","commenter_b":"Hillary is a crimnal so are the Radical Muslims and the Fence jumpers deport them all Wait for it","commenter_a":"aye lmao","post_message":"Thank you for the great 'TRUMP' welcoming, Virginia! I realize that takes a lot of time & coordination - and I am grateful to you all, for your support! -DJT"}]
