[{"comment_id":"665287136906749","commenter_b":"sadistic bastards will rot in hell.......","commenter_a":"Horrifying...","post_message":"The religion of peace continues to disappoint. @webpagelink"},{"comment_id":"475707345887193","commenter_b":"If they don't like it here I will help them pack and kick there a##es out of here","commenter_a":"I'm sick of hearing about muslims. How abov you?","post_message":"A butcher was selling this to Muslim customers without them knowing. Now he's going to jail."},{"comment_id":"10153251876512464","commenter_b":"Would love to see these two little girls in the White House with dad.","commenter_a":"What a special day for the whole family","post_message":"Yesterday, we spent a wonderful Sunday afternoon teaching Caroline how to ride her big-girl bike—without training wheels!  She did awesome; very proud of her."},{"comment_id":"10154291301186337","commenter_b":"They better pay that woman right this time, she'll put your ass on blast if you negotiate her pay in any way.","commenter_a":"So they are doing a reboot of a remake? Hollywood has really run out of ideas.","post_message":"J-LAW BREAKIN' THE LAW! If Sandra Bullock plays Clooney, then is Jennifer Lawrence Brad Pitt?"},{"comment_id":"10156716294680725","commenter_b":"Trump is a scum bag who steals from Veterans!!! @webpagelink","commenter_a":"Never liked Cruz and I thought Rubio seemed like a nice guy. Not anymore...give em hell @username, your the only man that can pull this off. You have had my vote from the beginning.","post_message":"THANK YOU #TrumpTrain! Lets make it a great day! Preparing now for rally at Macomb Community College- here in Michigan!"},{"comment_id":"10154420026498984","commenter_b":"If the white house puts up another fence to keep people of its lawn then its only fitting to build a wall to keep people from coming into the country","commenter_a":"I grew up 30 miles from the border of Mexico. You need to be there to understand. Most Americans are clueless about the Southwest.","post_message":"This was NOT what the journalist expected...  Do you think America needs a president with a tough immigration stance?"},{"comment_id":"10154476200391037","commenter_b":"Experts still deny Free trade causing poverty joblessness....they still maintain America cant make its own goods that we must import or fall into some economic abyss! At the same time they back Hillarys claim that she can create some kind of new jobs that doesnt involve manufacturing?? Lets speculatefor a moment that 25 years ago our govt agreed to stabilize China by implementing Free trade...it created a middle class helped create a market for us to trade with down the road... they have enough money to buy from us but 25 years ago the large population was mainly poor. and it made Chinese govt more stable...Govts make these kinds of trade offs everyday...greater good it will pay dividends we have to think of the future all of that kind of nonsense while sentencing 3 generations of American workers to a deadend future.","commenter_a":"obama has done a great job dividing people...Time to fix that!!..TRUMP 2016!!","post_message":"\"We need more love and kindness in this country,” Hillary Clinton said. \"The last thing we need are leaders who try to divide us even more than we are.\""}]
