[{"comment_id":"604670086348434","commenter_b":"Like that, tbh","commenter_a":"He has the face a typical Republican Tea Party red neck. A Trump voter perhaps who will be voting in jail, if he is allowed. Disgusting asshole punching a physically disabled child.","post_message":"This guy gets my vote for Biggest Jerk of the Holiday season. --Andrew"},{"comment_id":"1219889091393445","commenter_b":"Is it racist to say pot calling kettle black ?","commenter_a":"Cummings is a walking violation of ethics. Pot call.","post_message":"Whoops."},{"comment_id":"496533153870598","commenter_b":"We will never submit to Islam! Go fuck another goat!","commenter_a":"How do you really know that @username...you have documentation to explain here to that right wingers are like muslims??? Haven't seen a right winger decapitate anyone yet...or did i miss one?? Are right wingers now involved in terror plots against America and are they sneeking into third world muslim countries and blowing people up?? Man!!! I must have missed all the headlines...sure glad you brought us up to page on this!!!","post_message":"First our schools, then our public areas, what's next?  'SHARE' this post, we have to let the nation know what the MSM won't.  Do you agree Shariah must be stopped?"},{"comment_id":"563455260481095","commenter_b":"Apples have arsenic in them. Apples will kill you.","commenter_a":"So will parents of vaccination damaged children be given the same treatment?","post_message":"The parents used a variety of home remedies — including water with maple syrup — to boost their son's immune system after he became stiff and lethargic.   The 19-month-old baby had been sick for a couple of weeks when he suddenly stopped breathing."},{"comment_id":"1219528801419908","commenter_b":"^^^dumb bitch","commenter_a":"The one and only way it could have been prevented was if he complied with the officers instead of resisting after being tasered twice and thrown to the ground.","post_message":"CASE CLOSED....  @webpagelink"},{"comment_id":"10153588117402235","commenter_b":"An abortion is cheaper than kids...just sayin","commenter_a":"Ummm...2 things here...this jail is ridic for withholding/failing to administer medicine for an inmate...but also, stop having kids if you can't afford them...now these kids will be a burden on the system and are at risk to perpetuate this same cycle...aren't condoms like $5 wtf","post_message":"He was arrested for unpaid child support.   Now he's dead."},{"comment_id":"10153220581496336","commenter_b":"And the rap sheet of those deceased are mind blowing. Sad to be in A profession where u care so much but the ones u protect care so little.","commenter_a":"A bad situation when police are persecuted for doing their jobs. The whole force should resign. I would.","post_message":"The booking photos of the six Baltimore police officers charged in the Freddie Gray case have been released."}]
