[{"comment_id":"10153214192574170","commenter_b":"Could care less what she thinks !!!! LEAVE AMERICA!!!!","commenter_a":"Her opinion is s💱t Like her music Ghetto monkey opinions on race is ignorant and illegitimate Black rap culture is immoral dishonorable and gross","post_message":"I know, I know. \"who cares about some rapper?\"  The sad answer is \"a lot of people.\"  Conservatives have failed to engage in the pop-culture space for too long. That needs to change."},{"comment_id":"1722289054713180","commenter_b":"notice how she talks about white man?","commenter_a":"@username Former foreign minister , has failed in its mission and has caused much of the confusion the US administration @username was not calling things by their names correct .. for example, terrorist organizations ( liberation movements ) , states that support extremism ( our friends ) , dictatorships ( our partners ) @username win means that a disaster occur American nation","post_message":"Women across the country lose out on every paycheck—and women of color feel it the most. Our families can’t wait: It’s time to ensure equal pay for women. hrc.io/EqualPayDay #EqualPayDay"},{"comment_id":"10154453767181729","commenter_b":"Liar liar pants in flames","commenter_a":"BHO will pardon her.","post_message":"And she still thinks she's going to get off scot-free..."},{"comment_id":"475027816013769","commenter_b":"Guess she is a shameful person.","commenter_a":"Remember, she was also \"ashamed\" that Bush was from Texas","post_message":"Dixie Chicks member Natalie Maines also took aim at Donald J. Trump, tweeting, \"As long as Donald Trump's decisions for America are as solid as his decision about his hair, we're in good shape.\""},{"comment_id":"959675597399526","commenter_b":"Hillary 2016 Hillary 2020","commenter_a":"Hillary!","post_message":"It sounds like voters have already decided who they are going to vote for in the presidential election. Have you?"},{"comment_id":"10153137299814060","commenter_b":"NOT OUR BELIEF !!!","commenter_a":"In islam animal or human statue is ban","post_message":"The destruction of ancient statues (some replicas) at the Mosul museum in Iraq, a video of which was released on February 26th, is far from the most heinous crime committed by Islamic State. But the group’s sacking of holy sites and libraries are elements of a broader attack, perpetrated in the name of Islam, on the Middle East’s rich cultural and religious heritage @webpagelink"},{"comment_id":"10154179510106409","commenter_b":"Lmao. Now she can STFU.","commenter_a":"Lol. Yes!!! I saw this coming and I'm loving it. Fall of the bully. Does she still want to fight Mayweather? Dwl","post_message":""}]
