[{"comment_id":"10153397476831336","commenter_b":"What do we do when Hildebeast gets elected? She certainly has no opponent in Jeb.","commenter_a":"What he meant to say was this was another victory over the people of America","post_message":"President Barack Obama called today’s Supreme Court ruling on gay marriage “a victory for America.”"},{"comment_id":"1048024048598660","commenter_b":"Disgusting.","commenter_a":"The blessings of new life. I think it's wonderful","post_message":"\"It looks like an alien\""},{"comment_id":"943824045713848","commenter_b":"It´s not a coincidence why Jeb Bush started his campaign in Miami...All his Cuban friends were drug dealers as Leonardo Martínez; money launderers as Armando Codina; Medicare swindlers as Jose Miguel Recarey; dangerous terrorists as Luis Posada Carriles and Orlando Bosch....... and every Cuban corrupt politician of Miami. When Jeb Bush signed the law forbidding to give the Driver License to illegal people in 2005 (he was the first governor to do it), he wanted to push the deportation of millions of illegal NON Cubans from Florida, who could not continue driving and give their jobs to millions of Cubans rafters newcomers. Bush never thought in unemployed veterans or other US citizens. He only has Cubans in his agenda.","commenter_a":"He will lead this country to a war in the sand...and your children will be buried there.....","post_message":"How a group of hecklers forced Jeb Bush to go off script and talk about immigration."},{"comment_id":"987930937907325","commenter_b":"That's how twisted this pervert is ! Prison !","commenter_a":"well well I never heard that stupid statement made before didn't fly with me","post_message":"UNBELIEVABLE! The audacity...  Story: @webpagelink"},{"comment_id":"924000977633655","commenter_b":"WHY are their women like her???","commenter_a":"Why aren't ALL men like him? God bless him and that sweet, loving little angel","post_message":"His wife said she would leave if he kept their baby -> @webpagelink"},{"comment_id":"10154506488603487","commenter_b":"Non-issue. Couldn't and wouldn't happen. Too much of our power structure is in Texas.","commenter_a":"If they do not want their Social Security, Medicare, Medicaid, and Veteran Benefits. We will gladly keep their share for the USA. Of course Hillary has a chance to win Texas.","post_message":"Hypothetical question: Would you support or oppose Texas seceding from the United States?"},{"comment_id":"1026833867373308","commenter_b":"We don;t want or need your amnesty, illegals are criminals.","commenter_a":"If he's all smiles with those morons, he can't be trusted. TRUMP.","post_message":"Sen. Rubio co-sponsored the gang of eight amnesty bill in 2013 that would've granted amnesty to 11 million illegal aliens, weakened border security, weakened interior enforcement, and TRIPLED immigration."}]
