[{"comment_id":"570070006492803","commenter_b":"Beat trump I. Want a Christian men with a back bone .we can live better cleaner an safer","commenter_a":"I bought what I was getting for Christmas before Thanksgiving so that I could concentrate on the ultimate gift , Jesus.","post_message":"Hello everyone, I wanted to make sure we had some time tonight to spend with each other. As always, remember to keep sending me your questions via text to ASKBEN (@username on your mobile phone).   There were many questions from all of you asking “what is one of your favorite things about Christmas?”     Honestly, I love to see the look on everyone’s faces as they open presents – that’s the best part for me, seeing the look children have in anticipation of a gift. During this season, I always try to remind myself of the greatest gift…our savior Jesus Christ.   I know that many of us spend the week leading up to Christmas frantically rushing around buying presents, our time occupied with “how much to spend” on loved ones, rather than spending much time occupied with those loved ones. It’s about relationship, not retail. We should remind ourselves of that more often.   It is easy to become distracted by the world when we are constantly being bombarded with competing priorities, our time becomes monopolized by differing pursuits and positions, fleeting moments that will pass. Our true pursuit should be everlasting, one that cannot be wrapped in bows, it does not perish. It is peace. It is good news, in pursuit of others as we share with those we encounter. Just as we are now, you and I, sitting here together sharing this moment in time, these are the moments that do not fade or wither upon snow’s first falling – this is the season to be joyous with one another, lift others as He has lifted you, our hands united in hope.   That is why Christmas is special to me – I am reminded of the greatest of gifts every time I see my children and grandchildren’s faces. Hope.   Thank you for sharing your evening with me, I look forward to many more.   Goodnight, Ben"},{"comment_id":"10153304563395927","commenter_b":"Democrats own guns,.. You Brainwashed idiots...Gullible fools","commenter_a":"Because their agenda is to control the people without being contested against. Don't you read your Bible? How can a government control its people without being toppled - remove the guns.","post_message":"Criminals don't follow the law.  Why is that so hard for the Left to understand?"},{"comment_id":"10152989497399099","commenter_b":"Impatient mother f'r, bc that's y those light and sign is there for, so they can cross safe.","commenter_a":"Smh","post_message":"A driver is accused of hitting a 6-year-old boy as he was getting off the bus and walking toward his mother @webpagelink"},{"comment_id":"10153372404416509","commenter_b":"We gays.","commenter_a":"Its so surprising how everyone calls on God for a miracle yet america is a homosexual country that dont obey God....","post_message":"Almost three weeks after she was found unresponsive in a bathtub, Bobbi Kristina Brown is still fighting for her life. @webpagelink"},{"comment_id":"577042442420795","commenter_b":"Lmao and crystal you're vote dosent count dumb ass. Have fun. In the end the government is choosing hillary over the rest of the puppets. This country was never and will never be good. And like I said cunt. He ships jobs out of fucking state. But hey research dosent count when a babbling moron says shit you like does it fucking broad? And you're voting for another greedy old men who has already said we're going back to war. And starting another war with Mexico if they don't pay for his little wall. You're stupid as fuck. Fucking little sheep. No a pig. Eating the shit they tell you. Fuck the media. It's all bull shit. Just like your vote. The world would be better without trump and his little feeble supporters. All so violent. All short of a few brain cells. Lmao you all get dumber and dumber ...","commenter_a":"This really exposes the mass ignorance in this country. The media brainwashed assses will stoop to any level. I remember when nobody hated Trump. Then the government owned media started a smear campaign. Wonder why the media would tell so many lies on one person. He's obviously a threat to the punks running things in this country.","post_message":"Because Donald Trump’s star continues to be vandalized, the Hollywood Historic Trust is considering removing it from the Hollywood Walk of Fame."},{"comment_id":"10155157643776162","commenter_b":"Someone needs to go in there and knock her in the head about 50 times","commenter_a":"OMG!!!","post_message":"HEARTBREAKING ABUSE! \"I told you to stop feeding the dog human food!\" Please share to help find the caregiver who was caught on video repeatedly hitting and swearing at a 94-year-old woman suffering from dementia. The victim son set up the surveillance camera after noticing bruises on his mom. @webpagelink"},{"comment_id":"602134433280545","commenter_b":"Nina act like she fucking BERNIE GO HILLARY CLINTON FOR PRESIDENT OF UNITED STATES","commenter_a":"She just wanted to play Ted Cruz nobody needed that. Those that supported Bernie have to move forward and help defray trump this is what he's asking them to do. Let us not be divided and loose to trump.","post_message":"Bernie Sanders’ supporters say they are being severely mistreated at the DNC."}]
