[{"comment_id":"10153279474011680","commenter_b":"She's fat","commenter_a":"Hot daughter, John","post_message":"The daughter of Sen. John McCain, who picked Sarah Palin to be his running mate in 2008, said she was specifically pained because of Donald J. Trump's past remarks about her father's prisoner-of-war status in the Vietnam War."},{"comment_id":"10153753103761037","commenter_b":"@username tell me that in 12 months... no Bernie, no Trump, no Clinton and no JEB... then who's left? Let's talk again when there's only days left of this nonsense.","commenter_a":"Jim Webb won this debate: he got more exposure out of the media tonight than he has had since he began his candidacy. Compared to Clinton he looks honorable, compared to Sanders he looks responsible. Since those two are the media darlings, those are the only two he needs to be compared to until he can get out of single digit polls. If any of those candidates expect to get moderate Independent and Republican voters next fall, they need Webb on the ticket… unless Trump manages to stay in the race.","post_message":"Bernie Sanders defends his record on guns after Hillary Clinton pounces. #DemDebate"},{"comment_id":"10155622855165354","commenter_b":"Pretty soon we'll be sending them on chartered flights, like the illegal immigrants we're busy with right now.","commenter_a":"uh huh!!","post_message":"Infuriating..."},{"comment_id":"608915299267779","commenter_b":"Nigga i would murder u nigga in HIp HOp","commenter_a":"Hahaha... @username ma boy who you got? Lol... Norman Harrell @username who you got? I call Em via 1st Round KO","post_message":"Drake reportedly claims he's ready to take on Eminem. Who do you got in a Drake vs Eminem beef? #Drake #Eminem #Beef #JoeBudden #WSHH #Hot97"},{"comment_id":"10153782621653869","commenter_b":"That's been exactly the narrative. It's about time for a woman president. There's a special place in hell. Bernie girls are just boy-crazy. It's her turn. Thou shalt not question Her Inevitability.","commenter_a":"The media have been crowning her daily since 2015. Your daily reminder that at this point in 2008, her backers (motto: \"Party Unity My Ass!\") were still promising a bloody floor fight at the convention and demanding she be awarded all the illegal Florida delegates. Something to remember when you hear Hillarrhoids calling for you to \"line up behind her.\"","post_message":"Today's Daily Cartoon by Kim Warp. See more cartoons with our randomizer: @webpagelink"},{"comment_id":"10153341688578984","commenter_b":"I love Judge Pirro, I wish she was running for president, instead we have a lying liberal.","commenter_a":"I wish that Judge Jeanine would run for President! Just think how our country would change!","post_message":"You can see why this lady was one heck of a prosecutor before becoming a judge. If only she could get Hillary into a courtroom.  Do you support the way Judge Jeanine is fearless in her truth-telling?"},{"comment_id":"1168574929824833","commenter_b":"She's extremely wealthy, money buys votes!","commenter_a":"Wait...Hillary is still leading in overall polls? Americans in general really are stupid.","post_message":"I don't care whatever else you think of Donald Trump, but one thing Trump is doing is killing political correctness.  He's wiping it out.  He's leaving political correctness in a trail of dust.  He has violated tenets of political correctness from day one, and he is leading in the Republican polls and has pulled within six points of Hillary in a general."}]
