[{"comment_id":"10153900801473445","commenter_b":"Never mind I've heard it only the oil and certain illness so it's shit like Ga.","commenter_a":"@username get you a card!","post_message":"Big News! Ohio Becomes the 26th State to Legalize Medical Marijuana"},{"comment_id":"1192440530796417","commenter_b":"She abstained from marriage and birth control","commenter_a":"I don't think abstinence means what she thinks it means.....","post_message":"Teen abstinence superstar Bristol Palin just gave birth to her second little bundle of hypocrisy."},{"comment_id":"1151424271590993","commenter_b":"Hillary is a racist bitch.","commenter_a":"Sums up trumps campaign..... even his surrogates are full of shit.","post_message":"He walked out of his own church because of his lies! #DonaldTrump #MarkBurns"},{"comment_id":"10152917419231051","commenter_b":"Seriously the Husbands deserve same treatment. I am not saying the mistress didn't have it coming . Chinese ladies are crazy !!!","commenter_a":"I don't get it! What about her douchebag husband!!? He's the one married but still decided to sleep with her sooo....","post_message":"This wife decided to track down her husband’s mistress and make an example out of her."},{"comment_id":"1801914530074898","commenter_b":"Deport all illigals","commenter_a":"Deport all illigals","post_message":"WATCH LIVE: Donald J. Trump speaks at campaign event - will he address the multiple allegations of sexual assault?"},{"comment_id":"1051072661621517","commenter_b":"Get them the hell out of America!","commenter_a":"Sadly delusional.","post_message":"THIS IS ISLAM: Typical Muslim Cockroach  And Tortures Co-Worker For 5 Days To Make Her Convert  @webpagelink"},{"comment_id":"10157824241580354","commenter_b":"Convert them or kill them.","commenter_a":"People who want to believe in Muslim as a religion should first understand how it was started and read a book called THE STORY OF MOHAMMED BY Harry Richardson .This book is where Islam started and who started it . It's a paper back book takes about 3 hours read it it tells you how thus Prophet Muhammad where it came from and how it all started. It tells you how this guy was nothing more than an outright murder a thief and kill everybody who didn't agree with him now people show up and tell you that Islam is a peaceful religion that guy would be nuts to believe that this book was done a great research and there's nothing peaceful about this guy named Mohammed take it upon yourself to read","post_message":"“We must not be afraid to approach and contend with the complexity of Islamic law and history, the good, the bad, the ugly and the viciously anti-democratic.”"}]
