[{"comment_id":"10152921219620090","commenter_b":"@username , do not believe Florence , we everybody chosen by God. Not Jew , only, hahahaaaa","commenter_a":"Israel can take care of itself! We need to take care of USA and quit spending, spending, spending!","post_message":"We're proud to stand with Israel & stand against terrorism.  We're calling on Arab governments throughout the Middle East to help advance this goal. Join us, here: @webpagelink"},{"comment_id":"10155183488410725","commenter_b":"He's an idiot and so is she. Standing there looking at him talk his crap. It's ridiculous.","commenter_a":"He's a freaking moron","post_message":"Kanye West's rushing the stage at last night's Grammys wasn't a joke after all, it seems----> @webpagelink"},{"comment_id":"10154523076746028","commenter_b":"Milo is trash","commenter_a":"And most of you laugh when our president calls all of the BS networks and papers \"fake news\"!","post_message":"Eek."},{"comment_id":"10153209729066051","commenter_b":"I am a woman but if you not respect the man, specially on from of so many people, how do you spec, he is going to do. My friend you said what you WANT sorry you heard what you DESERVE.","commenter_a":"He has the right to his opinion and here we go again with Kelly, supposedly a conservative, telling someone that they don't have a right to say what they think. War on women, isn't that a liberal jab or stab...you bet it is. Keep talking Mr. Trump and you may win my vote, too!","post_message":"Donald Trump just got banned from a GOP Presidential debate because of this comment about Megyn Kelly."},{"comment_id":"371202926416555","commenter_b":"^^^Suck one, racist prick !!!","commenter_a":"What's missing? Blacks!!","post_message":"Real Protest = No Damage www.eaglerising.com"},{"comment_id":"10153143510309575","commenter_b":"That's a woman?","commenter_a":"Good","post_message":"An Indianapolis mother was sentenced to 60 years Friday in connection with the death of her 2-year-old daughter.  In January, she was found guilty of murder, battery and neglect of a dependent."},{"comment_id":"1704157759871336","commenter_b":"Hate the show.Bitchy women!!","commenter_a":"Let's hope so","post_message":"The View makes me SICK.   Take Joy Behar off the air NOW!"}]
