[{"comment_id":"10156349678780354","commenter_b":"They can cut off their cocks all they want. DNA will still say male no matter what. Liberals always want to Goto science to try and disprove the Bible but don't with this sick shit. God bless Texas for taking a stand!","commenter_a":"I'll show you mine if you show me yours. President Obama said it's perfectly alright.","post_message":"How upside down is the world when this even had to be voted on in the first place?  That said, LOOK at the percentage of Houston voters who voted for and against this..."},{"comment_id":"10153061326484586","commenter_b":"this is sick how the hell does this go unnoticed","commenter_a":"tangeneng yan!!!!!","post_message":"HARD TO BELIEVE:   Do people know that THIS could be what they're paying for when they buy leather?!   [Warning: Some of the most GRAPHIC footage] #DogLeather"},{"comment_id":"818351058200569","commenter_b":"If he is here illegally, he should return home and come back through the front door!","commenter_a":" quality I would most like to magnify in human race is empathy. It brings us together in a peaceful, loving state, A very wise and educated man say it.","post_message":"New Latthivongskorn was brought to the United States from Thailand when he was 9 years old. New grew up in San Francisco, California, became an excellent student, and dreamed of becoming a doctor. A month after New graduated from Cal-Berkeley with honors, a 3.7 grade point average, and a major in Molecular and Cellular Biology, President Obama established the DACA program. DACA has allowed New to begin medical school and pursue his dream of becoming a doctor. New and other Dreamers like him have so much to contribute to our country. But if the Republicans have their way, New will be deported back to Thailand. Let’s remind them that #DACAworks."},{"comment_id":"10153238053014586","commenter_b":"plants are living things too... so eat sand... all human should eat sand.","commenter_a":"literally feel sick watching this how can people still let this happen? disgusting","post_message":"Can you imagine having that huge metal tube shoved down your throat?!   This is just 60 seconds of how #FoieGras ducks spend THEIR ENTIRE LIVES.   They sound so terrified. :("},{"comment_id":"10153754092626051","commenter_b":"Suck it up bitches!","commenter_a":"Why don't we buy them cars and houses, too? (shakes head sadly)","post_message":"California is moving forward with a bill to grant undocumented immigrants access to Obamacare. Are you for or against the move?"},{"comment_id":"10152939381996770","commenter_b":"That's her right to do so. Now can we just move along here!","commenter_a":"@username's mother is just as big a piece of crap as he was.","post_message":"As the one-year anniversary of the death of Michael Brown nears, his mother says that she will never forgive Darren Wilson, the Ferguson, Mo. cop who killed him."},{"comment_id":"10157549372250725","commenter_b":"Suck it up buttercup. Should've been a little more gracious and not acted like a douchewagon! Then u go on TV and act all sorry and \"accept full responsibility\" , then still weasel and lie around the truth about what totally happened and cop-out of some questions with the \"i was really drunk and don't quite remember\" garbage excuse! Pull up your Speedo and get over it! The media and Olympic committee are the only ones who really care about your little hissy fit , the most of us could really give a crap! You won a gold medal and now your sad because your entitlements are going bye bye! Well, if you were more grateful and less of an egotistical stroke then maybe you wouldn't be in this situation! Lessons learned and move on! Accomplishing something as difficult as you have, you would think you can find the gumption ...","commenter_a":"How old is he???","post_message":"The Olympian swimmer, who has now lost all of his sponsorships following the Rio robbery scandal, is \"not doing well.\""}]
