[{"comment_id":"699615530187912","commenter_b":"Its you Liberal Pukes who need safe spaces ! Too bad there are no safe spaces in NJ !","commenter_a":"Newt Gingrich says anyone who believes in Sharia Law should be deported. Hey Newt - I believe in Sharia law! 100%! Muh muh muh muh......MY SHARIA! Now - come try and deport me!","post_message":"\"I'm through trying to understand the sick ideology of Islamism. Instead of trying to understand it, we ought to just try to kill it.\" – Sheriff David Clarke @webpagelink"},{"comment_id":"10153265527170950","commenter_b":"Oh stfu","commenter_a":"The blood is on their hands. This is a typical reaction from a Liberal Democrat.. Like a small child they point the blame on some one or something else.. The Democrats have made California a safe haven for Illegals, Criminals and Terrorist with their Sanctuary and open border polices.. The Blood is on your hands Moon-beam.. You and your Lawless Democrats. @webpagelink","post_message":"\"Increased surveillance, creating relationships with mosques in the Muslim American community across the country. We did that after 9/11 and prevented attacks in New Jersey and all across the country.\""},{"comment_id":"10153656490006107","commenter_b":"Mrs. Paul rocks!!!! Ron put down that economics book and take Carol to dinner!!!","commenter_a":"This election cycle by far has been the craziest one I've ever witnessed. The one question I can't seem to get an answer to is this,,, WHY??? Why are both sides attacking Trump? Why is China attacking Trump, Why is the pope attacking Trump? Why is Mexico attacking Trump? Why are the Republicans going against their own pledge and attacking their own front runner? Why is HilLIARy so afraid of Trump? Why does Trump have this Republican Party split? Why is Mitt Romney going after Trump? Why are the Koch brothers dumping in 75 million dollars to go against Trump? This isn't normal, something doesn't add up and we need to be smart enough to see through the the smoke and mirrors why they are quickly exposing themselves as the try to take down Trump before #SuperTuesday Here's my theory, it goes back to the age old question how to ...","post_message":"Happy Birthday to Carol Paul, an amazing woman, mother, and advocate for liberty. Thanks for making me the man I am today, Mom. Happy Birthday."},{"comment_id":"484244465097180","commenter_b":"Why does anyone listen to her?","commenter_a":"PIG","post_message":""},{"comment_id":"852438651458224","commenter_b":"She's an idiot!","commenter_a":"AS. THE REAL Castro DID FOR THE USA. SEND THE BOAT PEOPLE. RETURN THE FAVOR. SEND OUR BOAT PEOPLE LET THEM SEE HOW THE REAL CUBANS ARRE BEING TREATED THE NUT. JOB IS TALKING. REVOLUTION.ARESST IT PUT IT IN JAIL. THE SCHOOL KNOWS ALL ABOUT HER AND DID NOTHING.INVESTGATE THE SCHOOL THEY HAVE MORE LIKE her","post_message":"Look kids, this is what #liberalism does to the brain!  Pray you're never on a plane with someone like this! You have to see it to believe it:"},{"comment_id":"10153122066896037","commenter_b":"Porter up there is absolutely right","commenter_a":"no, we have no backbone in the US so we will let Russia take what it wants.","post_message":"The leaders of #Ukraine, #Germany, #France and #Russia pledged renewed support for a tattered ceasefire in eastern Ukraine despite violations -- including the storming of a key town by pro-Russian rebels.  Do you think peace will happen?"},{"comment_id":"10153762499342483","commenter_b":"@username but she taking millions of dollars from terrorist country and support Obama funding Iran and terrorist","commenter_a":"Why would anyone vote for lying Hillary","post_message":"Forecasters give Hillary Clinton a big chance to win, noting that the odds of her losing the race are about the same as an NFL kicker missing a field goal from the 20-yard line."}]
