[{"comment_id":"509489615909884","commenter_b":"No She is a pig.","commenter_a":"She is also a jackass","post_message":"Canada: Muslim Conservative who decried party's Islamophobia is really a Liberal"},{"comment_id":"960942283946630","commenter_b":"and the worse thing is, women are doing the cutting. sick sick sick","commenter_a":"horrible","post_message":"Female genital mutilation is a human rights violation. And it happens way too often. - Laura Willard"},{"comment_id":"1174478745905487","commenter_b":"The hormonal teenager that's checking people's bags is supposed to make us feel secure?","commenter_a":"I would rather be inconvenienced than shot why I watched a movie","post_message":"The chain said the procedure would inconvenience guests but provide better security."},{"comment_id":"10156351998640354","commenter_b":"NO HE IS NEVER GOING TO BE A WOMAN. BORN MALE ALWAYS MALE JUST A TWISTED FRANKENSTEIN MONSTER THAT OUGHT TO BE SHOT. @username","commenter_a":"NO MEN IN DRESSES IN ANY LADIES ROOMS ANYWHERE IN AMERICA. EVEN IF HE HAD HIS GENITALS REMOVED.","post_message":"How upside down is the world when this even had to be voted on in the first place?  That said, LOOK at the percentage of Houston voters who voted for and against this..."},{"comment_id":"1158715757578534","commenter_b":"Jail house for this chick!","commenter_a":"Sorry don't remember any championships","post_message":"It's just a matter of Hillary living the rest of her life out in prison or free.  Do you want to see Hillary go to JAIL?  @webpagelink"},{"comment_id":"1208908179197618","commenter_b":"Who do any of these \"woman\" think they are? The show SUX Whoopie go eat another side of beef!!!!","commenter_a":"They are both empty headed idiots!","post_message":"Loud mouth Whoopi and her co-hosts are making serious unfounded accusations and demanding Trump step down.  Let's get 5,000 'SHARES' & 'LIKES' to show that Whoopi is the one that America wants to see \"STEP DOWN!!!\"  @webpagelink"},{"comment_id":"10152788579600736","commenter_b":"Yes, dumb ass lady","commenter_a":"Good!!! @username Kevin Heard","post_message":""}]
