[{"comment_id":"10153246182423188","commenter_b":"She allowed her cheeks to hang out. This woman POSTED this video to YouTube. They clearly received the attention that they were seeking.","commenter_a":"Michael shouldn't have posted a pic that shows a woman's butt cheeks hanging out, @username. I'm surprised as a Christian you condone this.","post_message":"My wife and I are laying in bed talking about this non sense with Michael Bublé and she pulled up something a girlfriend sent to her.  Holy cow!  Some people are just Shoot milk through your nose funny without trying.  Look out.  What follows makes Michael's butt cheek photo look like a bible pic.  Excuse the title on youtube.  No profanity on vid.  @webpagelink"},{"comment_id":"635686593246783","commenter_b":"@username As much as you might want there to be, there is Nothing wrong with Hillary's e-mail account! Just ask Colin Powell and Condoleezza Rice, who operated the same way.","commenter_a":"if I vote, I want it to count and be counted, that's the promise, Every Vote Counts, well except when Bush was elected","post_message":"It is probably way overdue.  Conservatives Are Destroying Our Future"},{"comment_id":"10154101108342217","commenter_b":"TRUMPERS: Instead of saying get rid of abortion, why not use POSITIVE REINFORCEMENT by encouraging safe sex, and making birth control available in stores - WITHOUT HAVING TO GET A PRESCRIPTION. SILLY goose. SSSOOOO, are you saying that if a mentally retarded person is raped, then they should have the baby? Even though they don't have the mental capacity to care for themselves?.......... thats really stupid to state that they would have to go to another state in order for them to have an abortion, or to exclude ALL abortions. WOW. I bet you didn't consider mentally handicapped people being raped, or even 10 year olds. The youngest parents ever recorded, from my knowledge are the age of 10. Do you see the issue here? Think about it. Seriously. THINK people.","commenter_a":"TRUMPERS: Instead of saying get rid of abortion, why not use POSITIVE REINFORCEMENT by encouraging safe sex, and making birth control available in stores - WITHOUT HAVING TO GET A PRESCRIPTION. SILLY goose. SSSOOOO, are you saying that if a mentally retarded person is raped, then they should have the baby? Even though they don't have the mental capacity to care for themselves?.......... thats really stupid to state that they would have to go to another state in order for them to have an abortion, or to exclude ALL abortions. WOW. I bet you didn't consider mentally handicapped people being raped, or even 10 year olds. The youngest parents ever recorded, from my knowledge are the age of 10. Do you see the issue here? Think about it. Seriously. THINK people.","post_message":"The BBC's newsroom does the #MannequinChallenge.  BBC Children in Need."},{"comment_id":"10152727264626051","commenter_b":"This woman is sick, she needs to lose her own child and put into intense therapy with jail time.","commenter_a":"Gross!!!!!!","post_message":"This kid never really thought about why his mom was so excited when his 11-year-old friend came over. Now he knows."},{"comment_id":"10153695940741955","commenter_b":"Does she get virgins too?","commenter_a":"ew....that is all...","post_message":"UNDER THE BURQA"},{"comment_id":"10154040256123132","commenter_b":"Take her AWAY","commenter_a":"She probably asked for an extension so she could take off far away....","post_message":"The Dance Moms star faces up to 5 years in prison if convicted."},{"comment_id":"10153620963073984","commenter_b":"When will Americans wakeup to the fact that Hillary is for Hillary and she don't give atinkers damn about anyone else!!! She BITCH!!","commenter_a":"Who in their right mind would vote for her???","post_message":"As cynical as I may be about politics, I just don't see how Hillary can survive this avalanche of scandals.  Do you think Hillary is destined for the ash heap of history?"}]
