[{"comment_id":"1164167413602019","commenter_b":"Hillary is unelectable. Period.","commenter_a":"Look...as much as you may like Bernie, this is over. Hillary Clinton has the delegates and she will be the nominee. It's time to stop being delusional and start being realistic. Yes, Hillary may be a corporate puppet. However, that's still better than the Republican alternative. Do you really want to run this country into the ground with Trump?","post_message":"\"A ticket combining Bernie Sanders with Sen. Elizabeth Warren would leave any Republican ticket with Donald Trump or Sen. Ted Cruz ticket in the distant dust and win a landslide victory for Democrats in November.\""},{"comment_id":"966104673465761","commenter_b":"Islam. Definitely will Dominate. ....... Hell of Course","commenter_a":"So America here is the hope and change policy everyone voted for. And the new world order. Question. When are we as voting and tax paying Americans going to say enough is enough. These punks can speak bad about God and Jesus. But God forbid if you speak bad about a child molesting prophet like mohmed. Or that false god like allah. Islam is a belief base and history and likes. We all know that Mohamed made promise to entice the people to fight lIke animals by promising them virgins. Where in the middle east are you going to find a virgin. All the goats are taken. Our courts need to grow a spine.","post_message":"Is Obama Trying to Establish Islam as our State Religion?"},{"comment_id":"10156528431575354","commenter_b":"Screw her","commenter_a":"Boo-fucking-hoo! Lifes tough on EVERYBODY! And not everyone drives their car up on the sidewalk! Now the media will make her out to be the victim! Put her ass in prison and throw away the key!!","post_message":"Changed Name from ‘Lakeisha Holloway’ to ‘Paris Paradise Morton’…"},{"comment_id":"956104721172976","commenter_b":"We will build that wall!!!","commenter_a":"After all we give Mexican illegals having them pay for a wall is racist??","post_message":"David Webb: \"Border security is racist to you?\"  Answer: \"It’s not that border security is racist, sir, it’s the whole – you know, he wants to make Mexico pay for the wall.\""},{"comment_id":"1153858647985703","commenter_b":"It's the \"Chicago way\".... the end justifies the means.","commenter_a":"And all his ISIS appointees and advisors!","post_message":"Does this about sum it up?"},{"comment_id":"470542439803003","commenter_b":"He","commenter_a":"If she was a man...say so.","post_message":"Michelle thought she could have her way, boy was she wrong.  She forgot that there are still real Americans ready to expose her, we support them 100%.  Do you support their stand against Michelle?"},{"comment_id":"10153510075534087","commenter_b":"So, there is no room for reasonable art of the deal on either side, now? Remember what happened in 2012, fellow Republicans. You didn't turn out because Romney wasn't \"conservative enough\" for you. Then you did nothing but whine and bitch and blame it on voter fraud and your grandmother's Impetigo. The problem is not PEOPLE a from another country, it is SUBSIDIES that politicians buy votes with and ABUSE of unskilled labor and QUOTAS set by those who use prejudice to their advantage. We cannot round up 12 million entrenched undocumenteds, nor should we- it would be political and fiscal suicide. So let's get an electable candidate, get him in the WH, and start doing what we can to enforce immigration laws that protect us from terrorists and criminals, the ones Obama and this DOJ flip the bird to the SCOTUS a about, create an environment where inclusion with ...","commenter_a":"Trump all the way to the White House.","post_message":"“Marco Rubio is the front man for the open borders syndicate,” Donald J. Trump's senior policy adviser Stephen Miller said in a radio interview. “And understand this, Marco Rubio is determined to finish what he started with the Gang of Eight bill and to be President Obama’s third term on immigration.”"}]
