[{"comment_id":"1875772702705471","commenter_b":"These hoes aint loyal","commenter_a":"@username 😴","post_message":"So messed up  #WSHH"},{"comment_id":"717976815002166","commenter_b":"Did you read what I said? Or did I lose you after ESPN? By law, you cannot force someone to give up their body, body parts, body tissue to ANYONE, regardless of their life being in danger. So you can't force a woman to give up her body and blood and essence to someone who you've notably identified as a completely other person. And ps, bananas also have their own DNA. Oh shit looks like we can't eat fruit.","commenter_a":"I read Planned Parenthood does 30% of all abortions. Who is doing the rest of them?","post_message":"Appalling on every level. THEY MUST BE STOPPED!"},{"comment_id":"10154102502686509","commenter_b":"haha at all you hatin mf'rs Trumps winning we gonna get that wall built and these isis mf'rs taken care of whether y'all like it or not","commenter_a":"Obama should contest this and say its forged..","post_message":"Donald J. Trump says it's complete with his mother's handwriting inside the cover and the address of his boyhood home. @webpagelink"},{"comment_id":"10152608268042452","commenter_b":"I know right she's thick not plus size","commenter_a":"She doesn't look so plus to some of us who are","post_message":"There's a big change coming to Sports Illustrated's swimsuit edition. For the first time, the magazine will feature a plus-sized model on its pages.  Model Ashley Graham will appear in a campaign for \"Swimsuits For All\", heralding a new chapter in the magazine's famous swimsuit issue.  So what do you think about a plus-sized model gracing the pages of SI? A sneak peek tonight at 11 from ABC7 Eyewitness News. abc7.la/1zifFNK"},{"comment_id":"10152946576794099","commenter_b":"doesnt matter, she is still an adult","commenter_a":"i worked the front desk at a college dorm and i cant tell you how many times ive had mommy's call and ask me where their child is because they didnt answer their phone. shes 19! give her a break.","post_message":"A Connecticut teen who was reported missing after going out with a man she met online has been found safe, police say @webpagelink"},{"comment_id":"562921477245254","commenter_b":"I'm so sick of that self-righteous hateful woman.","commenter_a":"Are we surprised? She's just reminding us all what a thin skinned vindictive man Trump is.","post_message":"That didn't take long. Not even a week has passed, and the president elect's team is already warning Trump critics to be \"careful\" about the way they criticize Trump."},{"comment_id":"932489970229038","commenter_b":"Nothing compares to what Bill Clinton did as Gov of Ark, and in the White House with Monika Lewinsky and other women..same with John F Kennedy, with Marilyn Monroe, and mistress of a Gang boss, and nude swimming parties. They both dis honored our White House...where was the media..and why were they voted in twice...","commenter_a":"I agree! Mr. Trump has changed in the past 11 years but Hillary Clinton has not except for the worst!!","post_message":"Dr. Robert Jeffress, Senior Pastor of the First Baptist Church in Dallas, Texas, stated that he still supports Donald J. Trump, despite the GOP nominee's controversial 2005 comments."}]
