[{"comment_id":"10154226374872894","commenter_b":"Kim better stop bcuz money can dry up. At the rate that she is spending it.","commenter_a":"...but Andy Cohen has had work done himself so what's his point??? *sips Brandy and Eggnog*","post_message":"Andy Cohen Grills Kim Zolciak About Plastic Surgery: Sweetie, You Need to Stop (Video)"},{"comment_id":"10153347814342426","commenter_b":"glad they got this on camera so she can't talk any bull about this officer!! crazy women","commenter_a":"Should've knocked all her teeth out period.....","post_message":"Going to the DMV can be stressful, but this Florida woman completely lost it at the counter. After she was asked to leave, the 31-year-old woman would not go without a fight -- with a Florida State Trooper."},{"comment_id":"10153062550892235","commenter_b":"Those ...fools...do not represent This Christian!😱😱. 😞😢. 😠😡. 😈😈. 😇😇","commenter_a":"Any religion that tells you where your going after you die is a CON JOB. What happens if it's just nothing but darkness after you die. You'd live your entire life by someone else's way. I say FUCK THAT! live your own life, make your own choices! Have sex with whoever you want. There is no hell. Let the pleasures flow! THERE IS NO JESUS TO SEND YOU TO A PIT OF FIRE. Hello..... your being manipulated, lied to, bamboozled!","post_message":"Way to keep it classy, bigots.   Attack a bunch of kids singing the National Anthem ..."},{"comment_id":"10154326338646336","commenter_b":"I don't have a family or children. I am not offended in the least. It might be a downer for those couples that are trying to start a family but geez........just quit being so sensitive. The world is not fair nor is it perfect. Keep moving forward.","commenter_a":"START A FAMILY, START A FAMILY, START A FAMILY. get over it you big babies.","post_message":"Is the phrase \"start a family\" offensive? Apparently some people think so."},{"comment_id":"1057942617592596","commenter_b":"@username go choke on some bacon goat humper","commenter_a":"Just so I'm clear, Hillary supports illegal aliens coming over here and doesn't support Donald J. Trump wall, but builds a wall to keep Americans out of the DNC? OK, that makes sense....","post_message":""},{"comment_id":"969780003138778","commenter_b":"Bye, bye illegal aliens and their bastard American children.","commenter_a":"Love it, ... and Muslims too !","post_message":"Ay, caramba! #BuildTheWall @webpagelink"},{"comment_id":"10155983890750354","commenter_b":"Yea I enslaved your lazy asses. That's the only way to get you to earn your keep.","commenter_a":"Agreed. Kill us all and then who will pay for your entitlements.","post_message":"“You mother-f**ckers...came and stole us from Africa and put us in chains and murdered us for over 400 years, so yeah, you do need to die.\""}]
