[{"comment_id":"10153724102627217","commenter_b":"Ms. Herod... Majority of UK science budgets are coming from EU... Now a lot of most important science projects are too expensive for even the US alone... Not to mention working scientists who are working in UK aren't British, but from EU who are paid by EU... UK's science sector is one of the biggest looser after EU exit...","commenter_a":"Lol pmsl...so now learning science has alot to do with brexit...not very intelligent then are you...we had science before we went into it we still have it & for all the years to come ...please stop with the crap ..we are & we will be better of out","post_message":"Are you a scientist worried about #Brexit? Here's the latest."},{"comment_id":"10153076176308188","commenter_b":"Should have called Tiffany. Nothing like a woman to get the boys back on task.","commenter_a":"Did you save the fly or just let it suffer...","post_message":"So a fly landed in my breakfast juice.    Jeffy became fascinated with it struggling to live.  Next thing I know Keith is taking a picture of jeffy taking a picture of the fly and stu on skype with Wilson about the fly.  I had to join in and take a pic of the three of them taking a pic of the three of them with the fly.   Lord please help us.   Sometimes we are small and easily distracted and other times we are positively 12 year old boys."},{"comment_id":"10154448446471636","commenter_b":"If liberalism is bad, what, IYO, is good?","commenter_a":"The coup is being instigated by the political establishment and the media against the people who dared to vote in what they dictated was the wrong way. They are mobilising the generations brain washed by leftist infiltration of the education systems to do their will. This is going to get bloody","post_message":"'If you're still trying to convince yourself that a 21st century coup is not underway, please, please snap out of it'"},{"comment_id":"990097811101554","commenter_b":"That looks disgusting 😱","commenter_a":"@username BONG","post_message":"Not all heroes wear capes. 🍔+🌭"},{"comment_id":"10153437815231680","commenter_b":"She is worthless!!","commenter_a":"Hillary... Who DA feck Cares!!!","post_message":"Hillary Clinton: \"Well, as one of the more than 65 million Americans who voted to reelect Barack Obama, I’d say my voice is being ignored right now because of their obstructionism.\""},{"comment_id":"386115264910101","commenter_b":"She needs to die. She would never have gotten any place in this country without white people. I hate that racist trash.","commenter_a":"She sounds like she is mad at the world .","post_message":"Oprah plays the race card again..."},{"comment_id":"10154298865889099","commenter_b":"Smh","commenter_a":"Jessica Milla","post_message":"\"Her ribs are broken. He beat her ribs and breast saying her milk was useless and she was worthless,\" the woman's mother said. \"He tried to blind her so she couldn't see her baby, he tried to make her deaf so she couldn't hear him crying for her.\" WARNING: Some may find the images in this story disturbing. @webpagelink"}]
