[{"comment_id":"10152742631486680","commenter_b":"Go Hillary ! Fun to watch these morons head explode!!","commenter_a":"Although I'd love to see a woman president, the very last thing we need is a career criminal like Hillary Clinton (who's currently in violation of Article VI of the Constitution) . She's proven herself time and again to be both incompetent and dishonest. She has no new ideas, and will continue to push Obama's tired old routine of increasing taxes, not for the domestic good, but so that we can send billions to Iran, Iraq, Pakistan, Afghanistan, Egypt and Israel. I would like a President who puts America first, for a change. The only candidate I've seen who shares these sentiments is Rand Paul, and he deserves my vote. By the way, many people are unaware that Obama's Democratic administration added $1.3 trillion in new taxes to small businesses, which lowers both wages and job creation. If you love America, vote Republican.","post_message":"Opinion: When Ayatollah Khamenei speaks, it pays to listen."},{"comment_id":"10153148690502014","commenter_b":"I remote control my grandson to clean my auto engine. He's for hire. Lol. .","commenter_a":"Good morning from Flagstaff!","post_message":"It's Sunday Shoutout time! Post your pics here!! Jaime Cerreta"},{"comment_id":"662046983985880","commenter_b":"She's not worth the used toilet paper in my toilet","commenter_a":"isnt she the wench thast triex to be a whore on every show, even the disney channel?? shes a meaningless tramp with no talent. her father is a meaningless douche with no talent. who cares whqat the slut thinks? shed vote for anyone who could give her a good orgasm","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'.  This is unacceptable, we stand against Miley 100%.  Do you agree Miley should be kicked out of the country?"},{"comment_id":"1012675578755490","commenter_b":"Stupid women","commenter_a":"shut up skanks, cancel the p.o.s....","post_message":"Umm ACTUALLY it is in the Bible!"},{"comment_id":"10153405844391955","commenter_b":"Cruz is a phony with his evangelical persona","commenter_a":"Trump's record makes him look like the flip flopping, inconsistent political opportunist he is. The right personality and talking the way we like without looking at policies, are the criteria the Democrats selected Obama in 2008. Donald Trump has supported a net worth tax, 35% tarrif, he supports amnesty and a path to citizenship, \"because there are jobs Americans just won't do,\" He's donated to clinton Pelosi & Harry Reid, and has said Bush is the worst president ever. He's a RINO and a caricature of a conservative inartfully voicing every failed mudsling of the left against conservatives. Ted Cruz is a world class debater, with a nearly perfect record who takes on both Democrats and spineless Republicans. He has all the positives and then some without the negatives of Trump. #TedCruz2016 @webpagelink","post_message":"NEW 'SILENT MAJORITY'"},{"comment_id":"1602376966724515","commenter_b":"@username I am fully aware of who I have voted for since 1992. Hillary Clinton put herself in this position by NOT doing what's right and serving HER own interests. Public Service is a privilege and shouldn't be abused. I look forward to more ethical women running for President in the future, hopefully in my lifetime.","commenter_a":"She puts herself in a coma just hearing herself!! Her own husband is so unimpressed, HE doesn't know her campaign slogan!!","post_message":"LIVE NOW: Hillary Clinton early vote rally, Cedar Rapids, Iowa"},{"comment_id":"596504240534222","commenter_b":"She is such a liar!","commenter_a":"If Donald would answer the question instead of just attacking Hillary perhaps she could stop having to check and correct his accusations first before actually answering the question in her own 2 minutes. Geez it's insulting that this man shows up to a debate unprepared. #whatajoke","post_message":"RT LIVE STREAM: Hillary Clinton / Donald Trump 2nd Presidential Debate (Courtesy: Ruptly)"}]
