[{"comment_id":"1835391226744152","commenter_b":"Def not girl lol. I liked her back in the day but when she got that diva attitude and had the nerve to kill some of my brain cells with Glitter, I was done lol.","commenter_a":"Whether it was her fault or not, I'm glad she fell on her face. Maybe it will bring her diva attitude down a couple notches because she is annoying.","post_message":"WATCH: Mariah Carey's New Year's Eve mishap; what really happened during performance? abcn.ws/2hHJaGj"},{"comment_id":"911808665590508","commenter_b":"Go home","commenter_a":"Ok send these people back where they came from.....F them!","post_message":"OUTRAGEOUS: MUSLIM Students At Public School Walk Out When NATIONAL ANTHEM Plays  Lets get 3000 SHARES if we should deport them!"},{"comment_id":"10152945892703855","commenter_b":"Quit being such a pussy.","commenter_a":"Sigh, more attacks on a man having an opinion and not actually insulting anyone. Give up. I guess you can go back to endorsing Prep.","post_message":"We all get it from time to time."},{"comment_id":"1192124507480431","commenter_b":"I will!","commenter_a":"Call Congresswoman Cheri Bustos' DC Office at (202) 225-5905 and tell her to vote NO! on the TPP... The house of representatives will be voting on the measure tomorrow (Thursday).","post_message":"It was a pleasure to meet with the talented young people who are in town with the Illinois Electric Cooperatives' Youth to Washington Tour today!"},{"comment_id":"10154933688831037","commenter_b":"She's a snake!!!","commenter_a":"This girl looks horrible, think she needs some rest.","post_message":"Trump will \"be the president of all Americans, including those that did not vote for him.\""},{"comment_id":"10153047601521336","commenter_b":"how many lawyers have been sent to \"find dirt\" on her, like they did with Sarah? can you imagine Sarah debating this heifer on live t.v.?","commenter_a":"Well of course they didn't find anything. You never had anything interesting to say.","post_message":"\"Will they put the same effort into her emails as they did mine?\"  Former Alaska Gov. Sarah Palin thinks the media should hold Hillary Clinton to the same standard to which they held her over access to emails. What do you think?"},{"comment_id":"635677536633830","commenter_b":"Demons","commenter_a":"@username read the top comment 😂😂😂","post_message":"Name it!  #WSHH"}]
