[{"comment_id":"781142075321254","commenter_b":"She should be in prison for what she's done","commenter_a":"She just needs to ask","post_message":"Would you be upset if a nurse did this to you? @webpagelink"},{"comment_id":"10154809033061320","commenter_b":"Whoopi goldberg should move now she is very hard on the eyes","commenter_a":"Hillary 2016❤️❤️","post_message":"REPLAY: Donald Trump in Raleigh, North Carolina."},{"comment_id":"578880512291528","commenter_b":"I have a daughter and if she decided to not wear a bra, and wore clothing appropriate for that. Obviously not some plunging v neck cut out, crop top but a shirt sure. Bras are a cause for back pain and unless it's comfortable for the woman to wear it she shouldn't have to. If you insist we wear bras, I insist that your man boobs must also be held with a wire bra. You're pecks offend me!","commenter_a":"If I had a daughter ain't no way she going to school with no bra on. So I think the parents are to blame also. What are they teaching her letting her go to school like that??....that's tacky and careless parenting in my opinion..","post_message":"These high school students brilliantly stood up against sexist dress codes."},{"comment_id":"10154088028351159","commenter_b":"I wouldn't trust her to clean my toilets !","commenter_a":"The same thing she did with Benghazi!","post_message":"In case you missed it..."},{"comment_id":"184666305270788","commenter_b":"This stupid woman is probably senile!","commenter_a":"Another lying liberal...we should be surprised?","post_message":"Wow! She didn't think we would find this letter!!"},{"comment_id":"10153661042541523","commenter_b":"You dumb white bitch!! THE SAME WAY YOU CELEBRATED CHRIS FAIRLY, AMY WINEHOUSE, AND THE REST OF THE HEROIN ADDICTS IN YOUR Neighborhoods......I will be so glad when your evil race is nearly extinct! Take your evil back to the caves of Europe!!!!","commenter_a":"RIDICULOUS!! The freak had mental issues and died of an overdose- why would a church celebrate this idiot??","post_message":"A Tulsa church’s tribute to Prince is going viral."},{"comment_id":"684314941708338","commenter_b":"You pussy","commenter_a":"A vote for Trump is a blatant vote for racism. I'm so embarrassed at the people who support such hatred.","post_message":"Skywriters' message for Donald J. Trump: \"America is great. Trump is disgusting,\""}]
