[{"comment_id":"10153138055390329","commenter_b":"You're an idiot, Michelle.","commenter_a":"Fuck you buzzfeed. Articles like this are the reason half the country has measles. So irresponsible for you to publish something like this","post_message":"Why would you ever want to get vaccinated? (WARNING: Contains images that some may find disturbing.)"},{"comment_id":"367420580112903","commenter_b":"Rot in Hell B#$%H !","commenter_a":"Good for him !!!!","post_message":"INSTANT Justice: Judge: \"I Hope You Die in Prison!\"  Watch the video!"},{"comment_id":"934918126557241","commenter_b":"Why dont you vote for Hillary then? She cant say two words without lying her ass off. But I bet everyone who commented will be there to vote for her. Thats why Donald is SELF FUNDED. Doesnt take money from soros or rockefeller. Thats why the media hates him and all of you do as well. Obama has already said that muslim refugees will go in a database. But when Trump says it hes a racist bigot. Obama used different \"words\" and its totally different . When really its not. Its the same and Im not argueing . I hope you will all be happy when your next LIAR is elected. Thats why grandkids wont enjoy America as you did. Thanks dickheads.","commenter_a":"The dude tells the truth. Regardless noone else has rhe balls to speak the truth anymore","post_message":"The call took place right around the time Donald Trump announced his intention to bar Muslims immigrants from entering the U.S."},{"comment_id":"620315121449719","commenter_b":"Would make a great couple . Two freaks .","commenter_a":"HE likes. HE likes. HE aint a SHE!!!","post_message":"Caitlyn Jenner says she likes Ted Cruz because “he's very conservative, and a great constitutionalist.” @webpagelink"},{"comment_id":"10157196875835603","commenter_b":"She's still a liar!","commenter_a":"She belongs in jail!","post_message":"#BREAKING: Hillary Clinton has chosen Virginia Sen. Tim Kaine as her vice presidential running mate."},{"comment_id":"10155004670634203","commenter_b":"I can't stand the smug bitch. Liberal fake news network is perfect for her.","commenter_a":"She's got 11.5 months to decide whether Santa is still white.","post_message":"Note Megyn Kelly's use of the word \"journalists\" here..."},{"comment_id":"10153134531845927","commenter_b":"these gals need a long vacation i mean a longggggggggggg vacation.","commenter_a":"Joy, you are old and stupid.","post_message":"As long as the candidate is a committed liberal...this View host will overlook just about anything!"}]
