[{"comment_id":"10153511380259641","commenter_b":"I can't believe some of the comments here - So much hate {that's not justified} :/","commenter_a":"RIP the old England, lost to Islam now.","post_message":"#TBT:"},{"comment_id":"1234855006552733","commenter_b":"trump = sexual predator. You really feel ok getting behind this rapey racist creep? Wake up you ignorant fool!","commenter_a":"If you are a woman who is offended by what Donald Trump said a decade ago but you enjoyed 'Fifty Shades of Grey' and other movies and books like this than you are a hypocrite! Do you laugh when comedians talk like this or do you stand up and leave the room!?! I was not offended, I could care less what he said BS's with men in private - give me a break! I care about what he says and does now - I care about what he will do for our country! Look what Hillary did that mainstream media is covering up - her speeched released show she also refers to people as bucket of losers....has two different policies, one for public,one for private...not to mention the entire email scandal with her \"innocent\" friends all getting immunity...why do innocent people needimmunity?","post_message":"After audio was released of Donald J. Trump saying highly controversial things about women, Christian Coalition founder Ralph Reed shocked the media with a huge announcement on the Republican nominee.  Nobody saw this one coming... what do you think about what Reed said?"},{"comment_id":"923666907700065","commenter_b":"That hoe better learned how to fight cuz we gon square up lmao","commenter_a":"@username if I ever find out my daughter sucking dick idgaf she can get it . lmao go to her school and embarrass her. lmao","post_message":"Mom Beats Her Daughter In Broad Daylight For Sucking D!"},{"comment_id":"10153652189710530","commenter_b":"Save the geese. Ban airplanes.","commenter_a":"Doug smith- what are they going to do? They can potentially set fire to a blanketed horse causing severe burns or death. It's all fun until it's one of your loved pets. Caroline Torr This horse was in a field when a Chinese lantern landed on top of the horse's blanket and set the horse on fire! Chinese lantern may look amazing when let off but do you know where yours lands after you have seen it fly away??? What do u think happens to the wire frame of the lantern? The ban of Chinese lanterns needs to happen and can't come fast enough for me!!","post_message":"Should there be exceptions to Canton's sky lantern ban?"},{"comment_id":"10153622480508690","commenter_b":"Nna, infact you get am","commenter_a":"And this is not a problem at all to the world peace, unless when Israel bombs Hamas terrorists, then it will be a problem for the world peace. Hehehehehehehehe One good thing people should learn is that Muslims from the unset, have always wanted to dominate. Whether Muslims like it or not, Israel of today will never succumb to them again. If Israel is the problem of the world, then Palestinians should try and leave the land of Israel and let's see whom Israel will kill again. Thousands are dying in Syria, Yemen and Iraq, yet it's not a problem to the world peace. Tell that to the birds. Never ever succumb to the demands of any Muslim community, if u give them one today, tomorrow they will demand for 3. Always push them back or they will over run u. This is why i pity Europe,maybe they are not ...","post_message":"Syrian government has conducted nearly 7,000 air strikes during the month of July, according to the Syrian Observatory for Human Rights, making it the most intense bombing reported in one month since the beginning of the conflict in 2011. @webpagelink"},{"comment_id":"10154048575244456","commenter_b":"Joke","commenter_a":"Prayers for Gunn's mom and prayers for Officer Smith. I pray that the whole truth be revealed and this young man will be safe.","post_message":"\"MPD supports their men and women in blue. #it'sok2hitthelikebutton,\" the post on a MPD Facebook page stated.  Here's what we learned today:"},{"comment_id":"10153573437688984","commenter_b":"That makes sense since she's a woman","commenter_a":"Bruce Jenner is a disgraceful, sick, fake excuse of a man. ..","post_message":"Wow. Franklin Graham just made a massive statement about \"Caitlyn\" Jenner on Facebook... now it's going viral.  Nearly half a million people just \"liked\" this post... because it's absolutely perfect.  Spread this absolutely everywhere."}]
