[{"comment_id":"581929555264971","commenter_b":"They need to be sent back to their own country, period! !","commenter_a":"I am getting to the point I really do dislike the new media, they are a bunch of useless asses","post_message":"The city of Twin Falls first made headlines when Muslim migrants sexually assaulted a five-year-old. Now another sex crime, this time against a disabled girl, has rocked the community. You won't see this story in the mainstream media."},{"comment_id":"367714146750213","commenter_b":"To win a war you have to call it war and fight it like a war.","commenter_a":"But Obama or any of his staff was there , how come ??","post_message":"More than 1 million people are marching in Paris to protest against Islamic terrorists"},{"comment_id":"10154204245296770","commenter_b":"This woman belongs in an asylum!","commenter_a":"She is a freaking idiot and that's fake news","post_message":"House Minority Leader Nancy Pelosi called for an official probe into President Donald Trump’s ties to Russia Sunday."},{"comment_id":"678380735661527","commenter_b":"@username idiot","commenter_a":"well, well, well, so hillary's leaks are coming out! She makes fun of Catholics and Evangelicals, are you going to report on this? Well probably not since another leak talks about how you in the media and donna Brazile help her by giving her question that will be asked in the debates with Bernie, so she could memorise her answers. Hemmmm ,poor Bernie. They even told her when to smile. But guess you won't be report this becuase you're as guilty as she is. What a shame that we can no longer trust the media, the FBI, and of course lying bigoted hillary. We already knew she found millions of people deplorable and unredeemable, but now she hates Catholics and Evangelicals. . Thanks Wickie Leaks for giving us the truth because we know the media won't.","post_message":"\"I regret coming to the Trump support event, and in particular allowing my son to be a part of it,\" one donor said."},{"comment_id":"517382478450045","commenter_b":"Anyone know whats happening in Europe? Muslim takeover. By sheer numbers they are over running countries and residents are falling back on rioting to fight the takeover. Muslims come into a country and this usually ends up in war and destruction of lifestyles and sovereignities. The US would be better off without them sad to say.","commenter_a":"They have NO BUSINESS in our Government!!!! Stop Muslim Take Over!!!!!!","post_message":"This is not unexpected. Click to Read ALL the SICK Details..."},{"comment_id":"930249893698207","commenter_b":"@username tell that to these women and many more @webpagelink","commenter_a":"Hillary takes millions from country's that rape girls at 9... Legally. And where woman can be beat stoned or imprisoned just for reporting rape.. What happened to the war on woman? Oh, big $$$$$$$$ Oops, my bad","post_message":"Hillary can't do it without you. Sign up to volunteer: @webpagelink"},{"comment_id":"10153289786066491","commenter_b":"Here's the thing. You need to go # 1? You need to go # 2? Go to bathroom of your current sex. Drop the bomb, Cut loose, wipe clean, get out. That simple. Bathroom is not social grounds It's not grounds to dispute how you feel as gender. Do your business, in out less than 2 minutes..... WTF is wrong with the world today. Everyone wants to be special.","commenter_a":"Are we that far gone from reality that we want to make bathrooms for the trans in our society. Im sorry you were born as a boy or girl. How about you just stick with that while you are in public. Problem solved and no money spent on suppling a unneeded bathroom","post_message":"\"Before the 5th grade, my classmates were able to accept and be friends with me.\""}]
