[{"comment_id":"10153693958978010","commenter_b":"It only takes an extra 2 hours in pouring rain. Finally home. BTW, Albert Hammond lied lied to us here. But i love that song. IT NEVER RAINS............","commenter_a":"Thanks.","post_message":"Turn on your headlights!  It's pouring outside. Here's a how-to for Southern Californians confused about driving in the rain.   @webpagelink"},{"comment_id":"10153866679791002","commenter_b":"This is what happens when the majority of nursing moms thinks it's ok to expose their breasts while nursing. No, use a cover please. Yes, it's natural and better for your baby, but that's still a nipple being shown to the public...","commenter_a":"I don't think John was saying that children should be denied a family fun day. But, he is right, when the children are hot and fussy, they are no longer enjoying the event. They are miserable and they are making the person next to them miserable and you too. That's not fair to your child or the patron sitting next to you. I know parents want to see the rest of the game but, that's one of the sacrifices we make for our young children. Changing a soiled diaper in such close proximity is rude and plain nasty!","post_message":"The Cincinnati Reds are opening a nursing suite at their stadium for nursing moms who want to feed their little ones during the game.  Do you think the Detroit Tigers should have something like this?"},{"comment_id":"981168698591584","commenter_b":"Wow! That's insane.","commenter_a":"They have been","post_message":"Tel Aviv says the Israeli military must have a freer hand to shoot young Palestinian stone-throwers."},{"comment_id":"905085592863011","commenter_b":"I got 8 right","commenter_a":"Yes","post_message":"Let us know how well you do!"},{"comment_id":"654971807960745","commenter_b":"Fake fugly whore.","commenter_a":"can she get her face redone?","post_message":"This woman wears a corset for 23 hours a day. She has also had 4 breast enhancements, a gastric bypass, and two nose jobs. She says she finally has the most perfect body in the world.   Do you think she has a perfect body?"},{"comment_id":"1123460471025521","commenter_b":"The mother is as full of crap as the child.","commenter_a":"Instead of asking the whole world to conform to ones abnormality or difference how about assisting that person to deal with their abnormality/difference in such a way as to not draw negative attention. If one is a diabetic the whole world does not need to eat a diabetic diet. If one has a limb removed does the whole world remove a limb? Honestly I see no difference. We all have differences and we learn to deal with them, not expect others to suffer or deal with it.","post_message":"Watch this amazing video as the mother of a \"trans\" teen makes the most outrageous claim possible about North Carolina's new HB2 law.   What do you think about this mother's claim?"},{"comment_id":"1728076730757228","commenter_b":"The pathetic woman never smiled....good riddance!","commenter_a":"I am truly sorry that Carly dropped out. I do think you would make a great Vice President. Your knowledge and experience will go s long way. Thank you for throwing your hat in the game.","post_message":"BREAKING: Carly Fiorina is ending her bid for the Republican presidential nomination."}]
