[{"comment_id":"10153112407151336","commenter_b":"Doesn't surprise me!!! Lots of liberals there;!!","commenter_a":"What a dullard...","post_message":"“Seattleites know that discrimination has no place in our city,” Mayor Ed Murray said. “That’s just equality 101.”"},{"comment_id":"10154370353509714","commenter_b":"She must be a psycho...","commenter_a":"I sense a new song coming","post_message":"Taylor Swift and Calvin Harris have called it quits."},{"comment_id":"10153194834046717","commenter_b":"Fuck you bitch","commenter_a":"Many Jamaicans are F'd up; bleaching, trickery, conning, God awful people!!","post_message":""},{"comment_id":"1664185713874789","commenter_b":"Mars, but unfortunately the earth will be trashed long before humans can get to it.","commenter_a":"Is there by any chance a spare planet any of you got around?","post_message":"This is not a drill – a bill has been drafted to “completely abolish” the Environmental Protection Agency before the end of 2018."},{"comment_id":"10154030694113812","commenter_b":"I think the kind of look like little foxes... so cute!","commenter_a":"I don't know the reason they call them red pandas when they resemble Raccoons","post_message":"After a 2-year hiatus, red pandas have returned to the Smithsonian’s National Zoo and Conservation Biology Institute."},{"comment_id":"877009682392087","commenter_b":"If you are a salaried worker, no overtime pay. Which means you get a set rate of pay weekly or biweekly and have to work how many ever hours you have to, to finish your job. Whether it's 30 hrs or 50 hrs you get the same pay. It's like that for a lot of managers and supervisors.","commenter_a":"I must be in a bubble, I thought anything over 40 hrs is overtime, I have always been paid time and a half for anything over 40 always. What is it the restaurant businesses? Who doesn't pay overtime?","post_message":"This is HUGE! \"A hard day's work deserves a fair day's pay,\" the President said in his announcement.  Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1362411960521719","commenter_b":"@username Oh snap, you go mean girl. Can I sit next to you in the cafeteria? I didn't vote for the Orange white trash. but carry on with your brilliant repartee. I'm so put in my place. Yawn, on to the next idiot.","commenter_a":"Well, it's what I always say, \"if everybody says it, it must be wrong.\" The only thing wrong with @username is they are PH.D. reporting to a Honey Boo Boo and Duck Dynasty population. We are a white trash nation, of course nobody watches.","post_message":"Would launching a trade war with China help \"make America great again\"?"}]
