[{"comment_id":"367411220096110","commenter_b":"Dalia Montosa","commenter_a":"Katherine Cardenas","post_message":"No bridesmaids assistance necessary!"},{"comment_id":"10153047179116051","commenter_b":"What does being a feminist have to do with anything?","commenter_a":"WHAT an awful person. Take the baby and give it to someone who will love it.","post_message":"Police took one look at this mom's Facebook photos and arrested her immediately."},{"comment_id":"10157089744255347","commenter_b":"If Obama lied about military service/valor, would he be a hero or a liar? My guess is he'd be a liar, so how is this man still a hero?","commenter_a":"Chris Kyle was an American war hero...PERIOD. You liberal hacks need to find another hobby :/!","post_message":"American Sniper Chris Kyle told yet another lie: How many medals he received."},{"comment_id":"983326201715214","commenter_b":"his momma owes him a butt whooping is all... since he probably got no daddy","commenter_a":"Send him back to Africa and let him live the life he would have had if his ancestors would have stayed there","post_message":"Check out the CRAP this clown is spewing. His 2nd statement really has peeps FUMING."},{"comment_id":"10154303194092042","commenter_b":"Id take anyone over Hillary. Shes a liar, a deceiver and manipulator and its all on record.","commenter_a":"That is what Donald Trump gets for once again trying to go after Hillary Clinton. If he keeps it up, well then, it's absolutely over for him. No one, I mean, NO ONE, would ever trust Donald Trump as president of the United States. It just isn't going to work.","post_message":"#DeleteYourAccount: Hillary Clinton has had enough of Donald J. Trump's comments on Twitter."},{"comment_id":"1146806995375828","commenter_b":"Only lesbians are voting Hillary","commenter_a":"#Hilary said she going to let her husband run the economy.... Way to go #feminists set back 50 years in one sentence...epic fail #TRUMP2016 pls share","post_message":"We just won Kentucky! Thank you to everyone who turned out. We’re always stronger when we’re united. hrc.io/1WDpty0"},{"comment_id":"10153448669913984","commenter_b":"All she had to do was say she was to fat to walk any farther and lazy. Should of called the cops and let them tow her.","commenter_a":"I want to have cards printed that say \"Congradulations! You have just won Jerk Of The Year Award for parking in a handicap parking space. Because of you my Mother could not get into her wheelchair. May you never have to be in the same situation.\"","post_message":"I would have done the same thing.  What do you think?"}]
