[{"comment_id":"1144395032262257","commenter_b":"there you go with that section 8 typing again, you must have failed computer class terribly lmao","commenter_a":"All people Trippn over a nigga who didn't stand for the pledge of allegience. And y'all got Nazi's on the mo fucking police force. OPEN y'all damn eyes","post_message":"And the police union says it's no big deal 😠😠"},{"comment_id":"1750956915163116","commenter_b":"Leave voters have woken up, it's time for these people to accept this country belong to people who have been here for centuries. The racist abuse that comes from people who have no rights to be here, is killing our country. EU is based on lies and corruption, people need to be protected from people who have no respect for the British people. Immigration need to be stamped out people who are not suppose to be here should be returned home. Enough of the rubbish people keep trying to push the boundaries of the country to an extent of hatered breeding in a peaceful country. Stay campaign maybe help all those who have no rights to be here, leave campaign had been made to rebuild their country for those who live for the moment.","commenter_a":"A \"so-called\" majority can be wrong. The referendum was a bad idea. The parliament are the elected representatives meant to lead and decide. It's a bad outcome for everyone, and is a very bad example to all in the world on how to get along in the global economy, and especially from a social perspective. We live on the same planet. We're not going anywhere else soon. We should share it. Borders are historically recent and arbitrary. Nationality is random (not a choice where you are born, just luck). It is not the most important thing. We all belong to the same human race.","post_message":"Join our live debate and tell us where you stand on a second referendum on leaving the EU."},{"comment_id":"895405060572025","commenter_b":"Just like that nut","commenter_a":"Looks to me Democrats are pretty scared of Trump and that way they send these people to his campaigning events and start up problems, fights in crowds. Democrats can't play fair cause they know they are not going to win people are tired of being lied to and their rights being striped away...people this is a wake up call!!!! If you value your freedom you better dig deep in who your voting for...because all Democrats are trying to take our rights away!!!","post_message":"This is hilarious.  Video by the Canadian comedy show 'This Hour Has 22 Minutes.' Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154394358144062","commenter_b":"I don't trust these hoes","commenter_a":"\"According to the police report, Crowley was intoxicated and made inconsistent statements about Manziel's actions. \" Dem hoes!","post_message":"Johnny Manziel could face NFL discipline for Ohio incident..."},{"comment_id":"10154774250570575","commenter_b":"He is the ugliest woman I have EVER seen!","commenter_a":"He is a women himself","post_message":"LOL..."},{"comment_id":"10154132565089087","commenter_b":"Thats it?? Popping a bottle of champagne??? He wasn't fucking any one...SHE WAS....GIVE ME A BREAK!!!","commenter_a":"Treasonous Clinton is going to be burned on Bills rapping of women when he was the AG of Arkansas that right Clinton you covered it up","post_message":"\"There’s been a lot of talk about sex tapes today and in a strange turn of events, only one adult film has emerged today and its star is Donald Trump,\" said the Hillary Clinton campaign in a statement."},{"comment_id":"832641430106532","commenter_b":"My first thoughts also.. Selfish woman!","commenter_a":"Selfish woman","post_message":"\"...why my wife hid that letter is beyond me.\""}]
