[{"comment_id":"10153147899391636","commenter_b":"the womans a simpleton","commenter_a":"And MPs should be treated like....... ?","post_message":"What do you think of Kerry McCarthy's comments?"},{"comment_id":"10154557639632619","commenter_b":"Jerusalem is the old city of Israel.","commenter_a":"IDIOT COMES IN ALL SHAPES & SIZES & STATUSES!!!!!!! ISRAEL FOREVER!","post_message":"Jordan's King Abdullah II threatened an \"explosion\" over Israel cracking down on violent Muslim riots on the Temple Mount, stating that he will broach the issue at the UN next week."},{"comment_id":"10153834639439255","commenter_b":"Fuck her!","commenter_a":"for being called out, really !!!!!!","post_message":"How did we get so many sociopaths running for President in one year, anyway?  By Daily Kos user barskin"},{"comment_id":"1174610022559026","commenter_b":"Build a wall , deport all illegal but no one will believe you","commenter_a":"Send them and their anchor babies home where they belong ,, Trump in 2016 ,,, I'll help with the roundup for free ,,,","post_message":"@JebBush faces Trump-led headwinds in attempt to change the GOP's tone on immigration."},{"comment_id":"10154687828874657","commenter_b":"DEPORT this terrorist!","commenter_a":"Most universities are cesspools","post_message":"Amazing. ISIS recruiters are infiltrating our schools as teachers, now?"},{"comment_id":"870445706335391","commenter_b":"Life starts when your born. Read the Bible partically when god breathed into Adams lungs and life started","commenter_a":"Every life matters!! Save the unborn today","post_message":"Tell Congress to protect the unborn!  Click below to urge your Congressman and Senators to cosponsor the Life at Conception Act!"},{"comment_id":"1024542317579852","commenter_b":"@username, Planned Parenthood doesn't sell body parts and those that say they do are lying","commenter_a":"Thanks to the fact that the local Planned Parenthood clinic was closed down in Scottsburg, testing for AIDS and other diseases was nearly nonexistent in Scott County. And now Republicans are wanting to defund Planned Parenthood despite the fact that abortions make up only 3% of what PP does. SMH... @webpagelink","post_message":"In recent weeks, the American people have learned more about the barbaric practices Planned Parenthood uses to take innocent human life. Despite the outrage of millions of Americans, Planned Parenthood’s response has been to blame the messenger or the videographer, without addressing the barbaric practice of harvesting aborted body parts.  We need to let Planned Parenthood know that the American people do not support these inhumane practices. Congress should vote to end federal funding for Planned Parenthood before we leave for August recess. I urge Senate leadership to give every Senator the opportunity to affirm that life is a sacred and precious gift that must be protected."}]
