[{"comment_id":"10154831956721350","commenter_b":"Isn't she supposed to be in Canada?","commenter_a":"why is she here? I thought she was leaving the country?","post_message":"WATCH: We love Amy Schumer's powerful message to body-shamers! @webpagelink"},{"comment_id":"10153233251546350","commenter_b":"No she don't she is a young hoe. Celine is why better the Ariana Grande","commenter_a":"I don't think so! Her voice lacks the richness of Celine's.","post_message":"Ariana Grande's impression of Celine Dion is spot on!"},{"comment_id":"10153581421506336","commenter_b":"How do you go so wrong in life before you're even out of high school??","commenter_a":"But they look like law abiding professionals","post_message":"Four high school students have been arrested in the carjacking and kidnapping of a Texas border patrol agent who was vacationing with his family in Florida authorities said."},{"comment_id":"10153412861986167","commenter_b":"A bunch of false prophets and their followers, sickening.","commenter_a":"First of all, for those who wish to criticize my typos complain to google translate. I'm dictating this and I don't have time to go back and correct typos. When it comes to SOCIAL ISSUES, topics like gun control, abortion, gay marriage etc voters who latch on to these things miss the big picture. The big picture involves having a viable economy in which to have debate about social issues. An economy cannot survive on social issue focus. It is a fact that 70% of all entitlement Dollar goes to bureaucrats not to the poor. @webpagelink To this day paychecks from the government are being dispersed to illegal immigrants, prisoners and dead people. There are perhaps hundreds to thousands of programs that have been budgeted by the government which always end up taking longer to implement and always cost more than expected. Under Hillary Clinton and Obama, six billion dollars ...","post_message":"He also thanked the star of Duck Dynasty."},{"comment_id":"1010496572318771","commenter_b":"@username You should be ashamed of yourself, liberal whore.","commenter_a":"\"Trump rallies are becoming increasingly dangerous to protest\" Then stay the fuck away. You didn't see white folks showing up at Obama rallies, shouting racist bs. Goes to show the intellect of these animals. Fair is fair, equality for all! My ass! History has proven that equality never stops when things become equal. It's supremacy these animals want at this point.","post_message":"Happening NOW:"},{"comment_id":"10153738179686037","commenter_b":"She is looking for $$$. Obamacare is expensive","commenter_a":"Good for her! Everyone else is expected to do their job the way it's suppose to be done..why shouldn't this doctor? Most doctors don't like to be questioned or for you to have an opinion. She ruined this wonderful experience for these parents. Birth is a day to day normal thing for her but for the parents it's something they will never forget. Some docs need to get off their high horse and realize they're not always right!","post_message":"“I can’t be the only person out there this is happening to,” Lindsay Scarborough Switzer tells Yahoo Parenting."},{"comment_id":"820953834667537","commenter_b":"He's not a Muslim.....and if he was so what??? Oh I forgot we live in America where it's screw every other religion but leave Christians alone.","commenter_a":"“I’m not sure what’s more shocking, the atrocities of ISIS or the silence of the Obama administration,”Perkins said. Perkins and Kelly also discussed the Islamic State’s ultimatum, as well as their torching of an 1800-year-old church and destruction of one of the oldest communities of Christians in existence. “That’s the choice of freedom under Islam,” Perkins said. “This administration has been silent continuously when Christians have been persecuted,” he continued. “[It] is more concerned about offending Islamic states and Islamic nations than they are of defending the long standing policy that America has always had — that religious freedom is a human right, not just an American right.”","post_message":"“We will find the people who did this. France is today shocked by this terrorist attack.”   -  French President Francois Hollande"}]
