[{"comment_id":"1722240001356259","commenter_b":"@username the woman who thinks he looks oh so sexy cuz she on the same drugs lmaoooo wanna try em??","commenter_a":"@username no comment","post_message":"he was definitely turnt up..."},{"comment_id":"10152777121252217","commenter_b":"Lots of girls called Charlotte if u want to call her it then do nobody will care","commenter_a":"Well we are due a girl in 6 weeks and charlotte was on our list of names 🙈 Well thats not going to happen now because there will be thousands choosing it because of the princess lol","post_message":"#RoyalBaby: Introducing Charlotte Elizabeth Diana - she'll also be known as HRH Princess Charlotte of Cambridge"},{"comment_id":"10153404609274170","commenter_b":"I use roaches. She is like a roach, nasty.","commenter_a":"Good news here .. 57% *of* 47% only comes to 26.69% overall. This places me among the 73.31 who think she's a lying skunk (and those are her good points).","post_message":"53% of voters say Hillary is not trustworthy. ...But 57% of Dems still support her.  Why?"},{"comment_id":"10154422434652490","commenter_b":"All \"journalists\"","commenter_a":"Military Times journalists are all DEMOCRATS. They lean left. I stopped subscribing to their rag years ago- I got nauseous every time I read it. Here's to hoping they file for bankruptcy during the Trump administration.","post_message":""},{"comment_id":"524146164440320","commenter_b":"Pos","commenter_a":"Why was he even there!!!! Ugh","post_message":"I don't even know what to say."},{"comment_id":"1811292265824545","commenter_b":"Lack off question mark ? Get a life lefty. It's Facebook , not a GCSE","commenter_a":"When I was the age they look,,,,,I'd got my apprenticeship done, bought my first house and was engaged!! How very strange,,,,,,,","post_message":"\"Things are moving quickly now.\""},{"comment_id":"10153004075042061","commenter_b":"These magnificent creatures were never meant to be made to stand on their heads or do any of the other ridiculous tricks they're forced to do.","commenter_a":"Stop hitting elephants.","post_message":"An elephant attacking your car - never a good thing: abcn.ws/1LxMzPP"}]
