[{"comment_id":"1158332250952774","commenter_b":"I am an American who moved abroad and I get better healthcare for very cheap and birth control and maternity leave and the whole shebang... Anyone working gets rights to this in other countries. I can't believe America is fighting such a simple idea. A healthy population is a productive population. You want more able workers? Make sure they can remain healthy enough to work!","commenter_a":"Todd...more than 3 million more said No to Trump than yes!","post_message":"WATCH LIVE: The Women's March on Washington following Donald J. Trump's inauguration –— over 500,000 are in attendance."},{"comment_id":"10153891408869062","commenter_b":"Yeah","commenter_a":"Waiting on PA","post_message":"JUST IN: The Texas House Committee approved a bill to make marijuana legal for adults. It still has a long way to go before becoming law, but what do you think?"},{"comment_id":"10153554179988984","commenter_b":"This twat is too dumb to breathe on her own","commenter_a":"Ignorant. I wonder what rock they found her under.","post_message":"I've heard a lot of crazy things from liberals, but this has to be right up there at the top of the list...  Has this woman's PC \"outrage\" gone too far?"},{"comment_id":"1151797721550248","commenter_b":"@username \"All people of Muslim faith need to be monitored ,suspend any and all travel for them born here or not .\" \" All Mexicans not here legally will be deported and any child born here who's parents are illegal will be deported \" Mexico doesn't send their best,just drug dealers and thieves. \" Maybe because I don't lick windex off of the windows of the Trumpian short bus but sounds racist to me.","commenter_a":"Good bye all the never trumps see you after you realize that not voting for trump is just another vote for hillary who no one wants. Sorry that people didn't vote for your candidate probably because they are tired of politicians saying what you want to hear and not doing any of it.","post_message":"Republican National Committee Chairman Reince Priebus says the meeting with Donald J. Trump was great."},{"comment_id":"288699034881182","commenter_b":"Now, have you been able to fill these jobs with non immigrants?","commenter_a":"What were they expecting to happen...","post_message":"From Oklahoma to New York, bosses fired groups of workers after they didn't show up at their jobs in order to protest at last week's \"Day Without Immigrants\" demonstrations."},{"comment_id":"1818799778404105","commenter_b":"It is time for a woman president peeps..........this is not the woman.","commenter_a":"She may have one the debate, but America lost in this Presidential election","post_message":"Join Hillary live in North Carolina for her first rally since winning last night's debate → IWillVote.com"},{"comment_id":"1220599301301398","commenter_b":"@username where is your weed now","commenter_a":"That will soon become illegal for sure","post_message":""}]
