[{"comment_id":"10153510448341130","commenter_b":"Because they turn away NO ONE. Because it cost a lot of money to give out free care. Or low income women can pay a small portion vs. going to a CLINIC where they want your soul before you get care. Many women are struggling to EAT. How long do you think they could do all that they do with out funds ?????????Gimme a break.","commenter_a":"Tell us something why a big corporation such as planned parenthood need my money?","post_message":"A big victory for Planned Parenthood."},{"comment_id":"10154557639632619","commenter_b":"Jerusalem is the old city of Israel.","commenter_a":"IDIOT COMES IN ALL SHAPES & SIZES & STATUSES!!!!!!! ISRAEL FOREVER!","post_message":"Jordan's King Abdullah II threatened an \"explosion\" over Israel cracking down on violent Muslim riots on the Temple Mount, stating that he will broach the issue at the UN next week."},{"comment_id":"10153894836055579","commenter_b":"Deport Muslims and illegals, provide help for the mentally ill. Uphold current laws. Problem solved.","commenter_a":"Can somebody explain to me the connection between the NRA and this 20 year mentally disturbed individual in Oregon? How come we don't hear Obama or Hillary talking about the thousands killed every year via violent criminals in major cities all over the US? Where's their plan to stop that violence? How many law abiding gun carrying citizens have been involved in a mass shooting in the US?","post_message":"Hillary Clinton on guns:  is wrong with us that we can stand up to the NRA? Watch full video here: @webpagelink"},{"comment_id":"10156385306200231","commenter_b":"She nonce play a white girl maybe she believe she one of them","commenter_a":"Can she be traded in???","post_message":"Why Stacey Dash? Why?"},{"comment_id":"1610489359249521","commenter_b":"Maybe she'll have a stroke.","commenter_a":"She has RECENTLY HAD 2 BLOOD CLOTS ON HER BRAIN, FROM WHEN SHE FELL AND HIT HER HEAD. SHE IS EASILY CONFUSED, STAMMERS, SHORT-CIRCUITS , AND IS DILLUSIONAL. She is not well. \"THOU SHALL BEHOLD AND SEE THE REWA.RD OF THE WICKED\" !!!!!! Psalm 91.","post_message":"Hillary Clinton apparently needed assistance standing up at a rally."},{"comment_id":"10153003040749091","commenter_b":"Thugs","commenter_a":"Soon will catch this people what a shame.","post_message":"HOME INVASION: Men break into South Bronx home, steal necklaces, PlayStation. Watch the surveillance video of the suspects.   FULL STORY: @webpagelink"},{"comment_id":"10153629371177235","commenter_b":"Gay marriage Trumps Straight Marriage, get lost Huckabee:)","commenter_a":"Down with Huckabee, as Donald would say, LOOSER..... .","post_message":"If God already 'solved' racism, he didn't do a very good job ..."}]
