[{"comment_id":"10154736947540575","commenter_b":"Ignorant bitch. You voted hate. You liberal clowns","commenter_a":"Were was Meryl Stereo about the man that was attached and tortured. Oh yes, he was White.","post_message":"BOOM! Kellyanne Conway Schools Elitist Meryl Streep... ---VIDEO"},{"comment_id":"10152920261777014","commenter_b":"White people belong in Arizona, unlawful criminals do not.","commenter_a":"Sheriff Joe is TRYING to do the job he was elected to do. The Feds do not like it !!!!","post_message":"YAY or NAY: Do you approve of the job that Sheriff Joe is doing?"},{"comment_id":"1554113821370873","commenter_b":"What an ASS!","commenter_a":"Now we see how close he is to that N word, he will before to long.","post_message":"Speechless."},{"comment_id":"10153975283176336","commenter_b":"Nothing will happen with her, its just a power game","commenter_a":"She disgusted me and betrayed all women who've suffered mistreatment at the hands of their men when she went back to that crumb of a husband of hers...they deserve each other!","post_message":"Earlier on 'America's Newsroom,' Fox News contributor Katie Pavlich said Hillary Clinton must answer for her role in former President Bill Clinton's scandals. What do you think? @webpagelink"},{"comment_id":"10155217921896320","commenter_b":"she looks like my dust mop!!","commenter_a":"I love it when their hair gets like that. It's so pretty.","post_message":"Halle Berry showed off her new hairstyle at the Oscars, many on Twitter didn't like it.  What do you think?"},{"comment_id":"1687154254839815","commenter_b":"To spy over the Congress and international leaders is a serious matter and the Congress should really act immediately to resolve it !","commenter_a":"Try him for his CRIMES!!","post_message":"Obama used the NSA to SPY on members of Congress to ram through his unpopular and disastrous Iran nuclear deal.   What do you want your Congress to do in response?"},{"comment_id":"10153773404108984","commenter_b":"You Gotta Love America !!! :) I Do !!!","commenter_a":"Go Obama.","post_message":"The head of the National Sheriff's Association just threw down and issued a blunt threat to Barack Obama. This cop isn't going to take Obama's anti-cop attitude any longer, and now he's going to do something about it. This is awesome."}]
