[{"comment_id":"426004474226175","commenter_b":"Oh, and fuck Conservatives. They're the ones who started anti-gun laws. Reagan and the NRA (racist hypocrites) got restrictions for firearms in California in response to the Black Panthers having a PEACEFUL open-carry demonstration. If Obama did the same thing to OPEN CARRY California, you'd probably be screaming for his head on a pike.","commenter_a":"Killing people sanctioned murder to satisfy blood lust and a wanting for revenge. Sounds pretty medieval and 3rd world to me.","post_message":"We traveled the world to ask people about the the death penalty."},{"comment_id":"1111506912205431","commenter_b":"The video basically implied that Donald Trump was a racist simply because he doesn't want illegal immigration in this country. There is an enormous amount of drug trafficking, Sex trafficking and a lot of bad people are coming through our borders. Yes their are a lot of great Latinos in this country and my husband is one of them but what basically everybody is saying is that Donald Trump is a horrible person and a racist simply because he wants to stop illegal immigration in this country. let's not get started on what people are saying about Donald Trump supporters. That we're ignorant that we are racist. And please don't lecture me on how I should respond to things! Like I'm some child in a classroom and you're the teacher. You're being extremely condescending.","commenter_a":"This is total bullshit!!Mexicans that think we are racist because we want to have a wall how about the wall you have between Guatemala and the Mexico border. None of you ever answer that question. (and if you want to get technical it's not a wall it's a huge fence with Barbwire on top of it)And I'm not a racist my husband is Latino and my children are considered biracial so stick it where the sun don't shine,I don't want to hear any of that crap.The people in this country are totally fine with legal immigration it is illegal immigration that Americans have a problem with. I don't see Mexico having open borders and even if they did they certainly wouldn't be giving illegal immigrants welfare food stamps Medicaid I could go on and on and it's all being paid for by the hard-working American taxpayers.it sucks when you live ...","post_message":"The Latino community has a powerful message for Donald Trump.  #MicBrights"},{"comment_id":"10152921412801051","commenter_b":"You go girl.only someone with a shallow mind and no heart would think such sick thoughts.fckn perverts.","commenter_a":"This woman is awesome! ^_^ <3","post_message":"When this woman saw a hungry baby animal, she decided there was only one thing to do: breastfeed it."},{"comment_id":"10153145409004342","commenter_b":"Woman why the hell are you on a Houston news site? Get the hell back to Arkansas.","commenter_a":"You have to kill someone because they pissed you off....seriously? Houston a breeding ground for mental cases","post_message":"Police say a man who was shot and killed while changing a flat tire may have been targeted due to an altercation at another location."},{"comment_id":"1743528099240171","commenter_b":"Why did he choose to only visit those living in North Baton Rouge?","commenter_a":"Our great president. A day late and a dollar short","post_message":"We're in Baton Rouge where President Obama is landing to tour the flood-ravaged city after facing criticism for not visiting sooner. (No audio) @webpagelink"},{"comment_id":"10154363011532908","commenter_b":"In America, the people are the government. We're a republic, where our elected officials are acting on our behalf. Otherwise, we're supposed to kick them out. Taxation is the idea that no one can amass keep lot of money without a central authority to provide the infrastructure to make wealth creation possible, or the security to make created wealth sustainable. No one gets rich by themselves, and the people who work to make the rich people rich, or to keep the rich people rich, deserve an infrastructure they can survive on, too. Taxation makes a society fair, stable, and full of opportunity.","commenter_a":"Bernie is not asking people to share. Sharing involves VOLUNTARILY giving away your possessions.","post_message":""},{"comment_id":"692144217642823","commenter_b":"A lesbian trap in a mans body...say what.","commenter_a":"How can Caitlyn get the award for woman of the year if she still has a dick ????","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award.  This is what our world has come to. It doesn't get more absurd than this.  Do you think this is wrong?"}]
