[{"comment_id":"10154002938919749","commenter_b":"Cindy Rhodes go do one stupid cow feminists are scum","commenter_a":"If your still hung up on feminism within the uk and the us then you need to develop your personality. Not your discrimination skills.","post_message":""},{"comment_id":"977002452335214","commenter_b":"Slaves","commenter_a":"the American people need to rebel against this. Citizens of a nation( especially one a great as america) should not have to live in fear of police persecution. The whole police force needs reform. The dirty cops, racist cops and just dam right bad police officers need to go. If your a trigger happy racist peace of shit who hides behind a badge and a gun to only parade around saying your a protector of peace, you need to be weeded out. Police in america don't know how to be police. Other countries around the world have polices forces that can control far greater numbers than america and without the casualties.","post_message":"Very disturbing video shows police killing a restrained man with three shots to the back."},{"comment_id":"10153861731493352","commenter_b":"Beat you make ass. Seems like that's what the people in the world needs.. #anasswhipping","commenter_a":"Haha. Wow.","post_message":"Woman frantically calls police after she finds a naked intruder inside her house taking a shower and doing his laundry"},{"comment_id":"925751947552361","commenter_b":"oul don","commenter_a":"303253143368344u after kellys when kfc was still open","post_message":"Great afternoon in Ohio & a great evening in Pennsylvania - departing now. See you tomorrow Virginia! #MakeAmericaGreatAgain"},{"comment_id":"1793385047544902","commenter_b":"@webpagelink wrap.com/trumps-law-firm-won-firm-of-the-year-award-in-russia/","commenter_a":"How are we continuing to allow this to happen? How high a mountain of evidence must be built before someone in charge realizes something has to done to prevent his reign from commencing?","post_message":"You literally can't make this up..."},{"comment_id":"10154333518999641","commenter_b":"It's about time america should have their own female leader, if they truly wanted a real change, that lady touch would make a real difference for a great nation to reach further.","commenter_a":"VOTE FOR HiLLARY CLINTON 2016 . Hillary for America","post_message":"\"We just put the biggest crack in that glass ceiling yet.” - Hillary Clinton appears via satellite at DNC in hat-tip to history @webpagelink"},{"comment_id":"1084003008332003","commenter_b":"#VOTETRUMP AND BUILD THAT WALL!!!!","commenter_a":"Melania will have the last laugh. She is smarter and prettier than this idiot, not to mention more accomplished and wealthier.","post_message":"Unreal..."}]
