[{"comment_id":"890384730998868","commenter_b":"They need to be sterilized so they can't reproduce themselves!","commenter_a":"Obama and Sharpton seeing this would say \" these fine young gentlemen were just defending themselves from her whiteness. She was in the wrong place at the wrong time and they have a right to do this. They were the victims here for the media was recording them acting like a bunch of crazy violent animals. So, in self defense, they mugged her and her cameraman. It's only fair after all since the white man has being doing this forever. Isn't that right Mr President, the most powerful man in the world elected by these white oppressors to be so? At any rate we believe these fine young gentlemen, who could after all be our sons, all deserve scholarships for 4 free years of college, extra food stamps, and free cases of colt .45 malt liquor each.\"","post_message":"\"Stop!\""},{"comment_id":"10153216649359705","commenter_b":"Heterosexuals have rights to same sex bathrooms","commenter_a":"PA-THE-TIC! Only country in the world that does this garbage!","post_message":"White House staff now have access to an all-gender bathroom. Here's why it's important."},{"comment_id":"1265448890160011","commenter_b":"Dana, what if it's you who's the bitch and not Hillary?","commenter_a":"There isn't a nail in the coffin. At this point in time either you see her for the corrupt lying bitch that she is and refuse to vote for her or you vote for her in spite of it. No one can say she's not a corrupt liar. Either you admit she is and you're voting for her anyway or you are not. The table is set. The pieces are moving.","post_message":"JUST IN!"},{"comment_id":"1379025478784145","commenter_b":"These r not protest they r riots","commenter_a":"They need to throe away the flash bang and prepped spray and use real ammo","post_message":"Seattle May Day protesters threw flares, bricks and Molotov cocktails, while police returned fire with flash bangs and pepper spray.  More here: @webpagelink"},{"comment_id":"10153524776247016","commenter_b":"If you want a female president, Elizabeth Warren would be a thousand times better than WHORE Hillary.","commenter_a":"You can dress HRC any way you choose and she still is a corrupt POS. NEVER $hillary, EVER BERNIE~!","post_message":"Wall Street thinks Sen. Elizabeth Warren would be a \"nightmare\" as Vice President of the United States.  You can't ask for a better endorsement than that."},{"comment_id":"10153422739691167","commenter_b":"Oh goodie, now pass the popcorn.","commenter_a":"Who gives a damn? Why was he looking at her? I bet he kept watching nasty irrelevant ass","post_message":"Rudy Giuliani and Fox News are livid at Beyoncé this morning."},{"comment_id":"1155965127752480","commenter_b":"I made the same point on a post on face book and was told I was comparing apples to oranges. P","commenter_a":"Cecil the Lion was made up of \"clumps of cells\"...WTH. Clumps of cells are ALIVE! All those dunderheads seem to forget that THEY were clumps of cells at one time too!","post_message":"I am one of the people being pilloried, by the way, in elements of the Drive-By Media for daring to compare Planned Parenthood to Cecil the Lion.  People on the left who are overly concerned with Cecil the Lion say they are offended that they are being accused of caring more about animals than they are about \"clumps of cells.\""}]
