[{"comment_id":"10150614186964999","commenter_b":"Amen. However they are supposedly there to educate humans. In some cases it is educating them. Unfortunately not in all.","commenter_a":"Happy would be happier with other elephants. However (if you read the article), her buddy Grumpy was killed by the other two elephants when they charged him. The Bronx Zoo is not bringing in any more elephants and would put Happy at risk with the two they have. She does need to be moved to another zoo. Maybe they all do, but there is no guarantee she will be accepted with other elephants. Sad, but maybe it's time to focus on getting rid of zoo's altogether and leave these animals in their natural habitat where they belong.","post_message":"For close to a decade Happy has lived alone, separated from the zoo’s 2 other elephants. Her solitary existence is quite unlike the life of a wild elephant."},{"comment_id":"10153256940195736","commenter_b":"God forbid we put them in shelters and feed them.","commenter_a":"I have advocated for helping the homeless for a decade but it has gotten out of hand over the last couple years...which is to be expected, given we've mostly ignored the problem. These folks belong in Wapato and Wapato needs to be converted into a mental health care site.. They commit crimes against society -- leaving garbage around is just a visible symptom but when folks aren't looking, they misbehave in more destructive ways. They need to be \"rebooted,\" in the computer sense, not the kick-in-the-pants sense. Though some of them need that as well...","post_message":"Mayor Hales said today was the first of several in which the homeless will be moved out of city parks."},{"comment_id":"10154944041488700","commenter_b":"They are ALL criminals!! It's why they are called ILLEGAL aliens!! All must go!","commenter_a":"If your illegal you will be going ...remove all the illegals criminals and violent sex offenders welcome to the deplorable nation of deportation to keep America safe","post_message":"\"Let me repeat this: Our country, not theirs. It is our country. And we are not going to leave,\" said Jorge Ramos to the Spanish-speaking audience."},{"comment_id":"10154575005093645","commenter_b":"Beyonc sucks..adele is 10 times the singer","commenter_a":"It's crazy because BEYONC deserved that award. Everyone knows it.","post_message":"She beat Beyonce in the top three categories with her comeback album , and repeated her accomplishments from 2012, when the British star also won album, song and record of the year at the Grammys.  She used her speech to honor Beyonce and her groundbreaking  album, which was also nominated."},{"comment_id":"10152660171235950","commenter_b":"My favorite science fiction tv show and movies i like them all i grew up watching Star Trek Spock was my favorite","commenter_a":"I have been and always I shall be your friends. Star Trek II.","post_message":"What's your favorite \"Star Trek\" moment involving the Enterprise's chief science officer?"},{"comment_id":"741381376052440","commenter_b":"Big ugly cow, let her bitch.","commenter_a":"So go to another store, what's the big deal?","post_message":"Welfare Queen Goes BALLISTIC After Seeing THIS Sign At The Grocery Store  Let her be mad, this is what she deserves.  Are you sick and tired of entitled welfare leeches?"},{"comment_id":"1626892184281597","commenter_b":"@username I didn't know whiney little bitches played hockey...","commenter_a":"The whole irony in this, is that Trump knew he was never going to be able to get Mexico to pay for the walll...and now im just waiting for some trump supporter to justify this and or blame Obama.....","post_message":""}]
