[{"comment_id":"1196992380374839","commenter_b":"Too bad all his accusers wernt nasty enough!!! .lmao...","commenter_a":"Not going to happen!","post_message":"We're in Raleigh, North Carolina where Elizabeth Warren is campaigning for Hillary Clinton. @webpagelink"},{"comment_id":"1034829756528494","commenter_b":"Yeah women!!!","commenter_a":"What about the father that wants to keep the baby? He has no rights...","post_message":"A win for choice"},{"comment_id":"885760648126024","commenter_b":"Such a wonderful hero to me. He's human, makes mistakes and humbly admits it. That takes a real man. Thank you, \" W\".","commenter_a":"he is a moran.","post_message":"So funny, and 100% class..."},{"comment_id":"1642358432731311","commenter_b":"She was queen to Obammy's King. Both suck!","commenter_a":"This dumb bitch needs to shut the fuck up!","post_message":"Do you think Oprah is a bigot?"},{"comment_id":"10153600166447217","commenter_b":"^That is a true life goal","commenter_a":"@username And we're sat here watching tv and being casual XD","post_message":"Life goals."},{"comment_id":"677232809133964","commenter_b":"The scumbag needs to be fired .... then she needs to be stripped of her teaching certification!!","commenter_a":"Fire her.","post_message":"This teacher threatened her student if they didn't submit to her beliefs.  She has absolutely no right to try and dictate what her students believe.  Do you think this teacher should be fired immediately?"},{"comment_id":"979192058784862","commenter_b":"LOL! You are So Silly. That Will Be The Last Win For Cruz in The Primary elections now. There is NO way Cruz can Get Anywhere Near The Delegates Trump Has and after the Next 5 elections all in the Northeast Where Trump Will Win In a Landslide, Cruz is Now Done!!! BYE BYE LYIN TED!","commenter_a":"thanks Gov. @username for endorsing Ted Cruz! I always respected you and prayed for you when all those protesting liberals gave you a hard time. and I don't even live in Wisconsin. we are 741915279236631s and we do need to pray for each other. 2 chronicles 7:14.. prayer does help!. Congrats to Ted Cruz for a great win. thank you Lord!","post_message":"Thanks Wisconsin for showing that common sense conservative leadership is valued! #TedCruz"}]
