[{"comment_id":"1150787404931568","commenter_b":"Trump is only running to give the candidacy to Hillary... or Bernie. He is still very much a Democrat. The \"conservatives\" who joined him have proven that stupidity doesn't necessarily stop with the Democrats only.","commenter_a":"Mr. Trump is not my first choice, but the more the elite republican insiders attack him the more I am inclined to support him.","post_message":"Will Republican attacks work or is Trump unstoppable?"},{"comment_id":"10154088875521717","commenter_b":"Omg what a pig","commenter_a":"@username read this, what an arsehole","post_message":"The student said she has never been more terrified of being outed than when Milo Yiannopoulos berated her on stage at a college event."},{"comment_id":"10154142762821756","commenter_b":"Carol Andrews Wilfork ....\"Concerned about appearances?\" Good one! Hillary Clinton would never be allowed to be an angry, cantankerous revolutionary with wild hair like Bernie....she would not make it in American politics. Women have to play a completely different game...and look good doing it or they are toast!","commenter_a":"Perhaps true criticisms of Rubio, but along with Rand Paul find them to be the most rational and reasonable persons at the debates.","post_message":"Some say the first-term Florida senator is inexperienced. Some say he's inconsistent. And others question how his loss in Iowa is being spun into a quasi-victory."},{"comment_id":"10153706069823717","commenter_b":"Best part about this is her age, she's not an 18 or 20 year old like most ad models.","commenter_a":"Oh thank heavens. The world is a safer place.","post_message":"People magazine has named Jennifer Aniston the \"World's Most Beautiful Woman\" for 2016."},{"comment_id":"861173230647951","commenter_b":"She is crazy","commenter_a":"Just 12 years? WTF","post_message":"8-year-old Julie died the same day she was going to be a flower girl at a wedding. Her mom has admitted to killing her daughter."},{"comment_id":"661747857265261","commenter_b":"@username in LA-LA Land - Run back to the boarder and GET THE FUXK OUT OF MY COUNTRY!","commenter_a":"Then he obviously didn't listen to the end. Bibi gave 3 more stipulations that were very clear to add to the table","post_message":"US President Barack Obama says that Prime Minister Benjamin Netanyahu “didn’t offer any viable alternatives” to the current P5+1 negotiations in his speech to Congress.   #NetanyahuSpeech"},{"comment_id":"844173412298350","commenter_b":"She's a witch!","commenter_a":"And she is a pig!","post_message":"NEW unpublished audio recordings of Clinton Foundation head Donna Shalala privately expressing concerns about Bill and Hillary Clinton’s mental state."}]
