[{"comment_id":"10154334992691130","commenter_b":"Hillary claims to be for equal rights and pay for women and care for womens rights but she still pays men more than women. She does not care about women it`s only money she cares about .. abortions save money ,that is why she is for abortion..","commenter_a":"Note to these kids: Don't bother asking Trump. He has no answers for you that are going to give you hope. He'd probably tell the children that they need to be vetted first to see if they love American values, even though they're only children.","post_message":"Ahead of tonight's debate, the children of Aleppo ask Hillary Clinton and Donald J. Trump the questions THEY would like to see answered."},{"comment_id":"1156511254368903","commenter_b":"The land belong to native american until white screw it up.","commenter_a":"NO TO CHINA!!!! Our land is for the American People!! and Washington State's water belongs to THEM!","post_message":"Farmers from drought-parched California are finding greener pastures in the Pacific Northwest. And so are buyers from China."},{"comment_id":"712544572223659","commenter_b":"The devils soldiers are out of control.beating and killing everybody.And they're not going to stop until we start fighting back","commenter_a":"That pig had wonderful training---can't ya see that?","post_message":"The police officer accused the man of a DUI - driving while drunk. He didn't realize that the man was having a stroke. When he didn't answer (because he was HAVING A STROKE), the officer beat the living hell out of him!"},{"comment_id":"10152720795558717","commenter_b":"According to the article, the mother actually administered cancer meds into the girl, as well as a feeding tube. That's where the endangering comes in.","commenter_a":"How is this lie endangering a child? I don't get it. I don't really know the story so I can't really say. Just going on headlines here.","post_message":"An Iowa woman who lied about her daughter's cancer diagnosis won't serve any time in prison for endangering the life of her child: @webpagelink"},{"comment_id":"1040367212665366","commenter_b":"Suck a dick Diane.","commenter_a":"TRUMP will close our borders to illegal people. TRUMP will rid us of common core curriculum! TRUMP will temporarily ban Muslims from entering our country.. TRUMP will build up our military to its once held position! TRUMP will dump obamacare! TRUMP will allow the 2nd amendment to stand! TRUMP will negotiate with foreign countries like a hellstorm! And will NOT back down! TRUMP will in for America! DONALD TRUMP loves America! TRUMP will get jobs... DONALD TRUMP is The ONLY CHANCE we have to stay a FREE NATION!!! That's ALL why we NEED DONALD TRUMP for PRESIDENT of these UNITED STATES of AMERICA!!!!!!!!","post_message":"Breaking...  This changes EVERYTHING!!"},{"comment_id":"599536596905185","commenter_b":"I want them to be deported and go back where they came from.","commenter_a":"I am absolutely shocked that a welfare state would attract welfare-minded reprobates who expect to receive cradle-to-grave welfare benefits, and then throw violent temper tantrums when they don't get what they think they're entitled to! Where in the world did these guys get such an idea? Oh yeah, after hearing the Marxist's constant demands for cradle-to-grave welfare benefits all of their lives.","post_message":"New post (Sweden: Muslim migrants enraged over not being given \"own house\") has been published on Jihad Watch"},{"comment_id":"524738424381756","commenter_b":"As i said before i will not debate with obama supporters. All they do is cry about being poor and then vote for people to make them worse instead of seeing a man whos going to build our country full of jobs. Then again many of Obama's supporters are on welfare anyway so theres no speaking to any of you. You are the problem","commenter_a":"This parent is teaching her kids so wrong. She needs to be having her to hold up a Trump/Pence sign for a better future for her and her child. No one wants to live under the reign of Obama anymore and we definitely don't want to have any parts of Hillary Clinton so she can continue the mess that he's made","post_message":"This 4-year-old was inconsolable when she found out Obama was leaving office  she wants four more years!  #MicBrights"}]
