[{"comment_id":"10153806670970329","commenter_b":"No. I'd rather have this Screw spiders","commenter_a":"THIS IS WORSE THAN 100 SPIDERS","post_message":"Always look under your bed! (via BuzzFeed Trending)"},{"comment_id":"10153252207146509","commenter_b":"Look at yourself and get off your high horse, lady.","commenter_a":"It's only free for freeloaders and illegal immigrants! The rest of us r still going to be up to our eyeballs in debt!","post_message":"President Barack Obama says he'll propose making two years of community college free \"for those willing to work for it.\" Do you agree? More details will be announced Friday: @webpagelink via CNNMoney"},{"comment_id":"1672143779721068","commenter_b":"Holy cow. This woman is aging in dog years. In four years, she'll be a shrunken head.","commenter_a":"That's because only stupid woman will vote for her just because she's a woman.just like people voted for Obama just because he was black.","post_message":"A great defender of women's rights? You decide."},{"comment_id":"661665720654565","commenter_b":"NOT NO BUT HELL NO!!! SEND THEM BACK WHERE THEY CAME FROM!!! ANOTHER PLANET!!!!","commenter_a":"No.","post_message":"The Obamas are celebrating 24 years of marriage today. Are you proud to have them in the White House?"},{"comment_id":"998546203523695","commenter_b":"when i ask, it's bengazi","commenter_a":"No president has ever endured the disrespect that President Obama, has. If there are people out there, that say that race has nothing to do with it. then they are the ones that are doing it.","post_message":"Sign your name if you're still standing with President Obama → @webpagelink"},{"comment_id":"10153089034256051","commenter_b":"She should have either buckled herself then got sick or she could have knead down holding door and do it that way ( some vans have a handles)..or have a push window..or found something to vomit in","commenter_a":"There is a reason why yiu are suppose to wear a seat belt. Glad she is ok though.","post_message":"This woman began feeling sick while driving and ended up opening a car door to throw up. The problem is, the car was still moving at the time."},{"comment_id":"10153554179988984","commenter_b":"This twat is too dumb to breathe on her own","commenter_a":"Ignorant. I wonder what rock they found her under.","post_message":"I've heard a lot of crazy things from liberals, but this has to be right up there at the top of the list...  Has this woman's PC \"outrage\" gone too far?"}]
