[{"comment_id":"10153615775017235","commenter_b":"In actuality, the video is being shown in reverse to make the officer look bad. He was actually using his gun to pull bullets out of the man in an attempt to save his life.","commenter_a":"I can show you a video where it looks like a deputy shoved a mans face into the wall. Then when you see it from the other angles you will see that the man tripped and the deputy tried to reach for him.","post_message":"Watch this. This is awful"},{"comment_id":"10154045575585575","commenter_b":"Who cares what you say ASSHOLE...............","commenter_a":"And how long would you last in a war with America fool?","post_message":"Vicente Fox jumps shark. Says Trump election will lead to war."},{"comment_id":"489966784527235","commenter_b":"Fuck em and feed em pork","commenter_a":"Yes.","post_message":"Radical Muslim group CAIR orders that Obama exempts them of this.  They are dangerous, and so is our president.  Do you agree that Obama is a threat to the United States?"},{"comment_id":"10154441744191509","commenter_b":"WE STAND WITH TED CRUZ----WE WONT VOTE FOR JIMMY NUTS CARTER ENDORSE TRUMP OR ILLEGAL ALIEN AMNESTY PROMOTER RUBIO.","commenter_a":"Jessi Spires Ben Kraja Alex Gochis Tyler Teejay Chase","post_message":"Three white nationalist leaders have formed a super PAC for Donald J. Trump, even though Trump doesn't want their support.  #NewHampshire voters are getting a robocall with a simple, disturbing message."},{"comment_id":"1354339577942641","commenter_b":"Education, do u have?","commenter_a":"I f*****g hate Islam.","post_message":"Behold the peaceful religion..."},{"comment_id":"10154075360053797","commenter_b":"You know her personal","commenter_a":"Wow look at all these people who would vote for a liar to run this country. What an uneducated bunch.go clear back to Watergate with hillary she is a liar.","post_message":"WOW! Rest in Peace Elaine. She was a registered Democrat and not \"a political person.\" However, her obituary says: \"Elaine requests, in lieu of flowers, please do not vote for Hillary Clinton.\" Her reason is getting a lot of attention. See here:"},{"comment_id":"1011822325526221","commenter_b":"Iran needs to get with the times. You se to want tourism but then scare people off by arresting people for no reason. Wake up!!","commenter_a":"generally muslim men under lucifer Allah do not respect women very well, look obama does not he muslim islamic religion","post_message":"In recent years, debate in the west has largely focused on the more visible aspects of the status of Muslim women and Islam, with many claiming that women have fewer rights than men."}]
