[{"comment_id":"10153994126946337","commenter_b":"Loved it!! These \"Million Moms\" need to stop clutching their pearls & promptly remove the sticks wedged up their tight asses.","commenter_a":"What do you think about the show Lucifer?","post_message":"NOT HAPPY! One Million Moms is beyond ticked at Lucifer and Olive Garden..."},{"comment_id":"447635222089017","commenter_b":"You are probably pro abortion cause you hate child support...","commenter_a":"This is great. You idiots that are against abortion are just that Idiots. Quite trying to take rights from Women . Plus Planned Parenthood doesn't pay for abortions. The client does. They provide health care. Get your facts right.","post_message":"JUST IN: A Houston grand jury investigating undercover footage of Planned Parenthood found no wrongdoing by the abortion provider but instead indicted anti-abortion activists involved in making the videos that provoked outrage among Republican leaders nationwide."},{"comment_id":"10154845355999705","commenter_b":"Omg this is perfect","commenter_a":"@username lolol we need one","post_message":"Someone reverse engineered the umbrella - and it totally works."},{"comment_id":"10155314611590652","commenter_b":"hahaha! this is amazing","commenter_a":"@username apparently the jar of mayonnaise episode anticipated this.","post_message":"\"Life is best when it's a bit strange.\"  This weird new reality show has millions of people pretty much watching paint dry:"},{"comment_id":"1789863337898793","commenter_b":"NO !","commenter_a":"Like a dog misses fleas!","post_message":"Will you miss having President Obama in office when his term ends?"},{"comment_id":"10154004178307452","commenter_b":"Oh, but still lol what a sick hoe","commenter_a":"Her Bfs ex girlfriend is mad @username","post_message":"A Redlands woman woke up to a gruesome discovery when she walked out her front door to find pigs’ feet, fish heads and other animal parts scattered across her doorstep."},{"comment_id":"10154327870086509","commenter_b":"If they did who cares cnn enjoy the holidays merry Christmas to the Muslim world . Leave cnn racism behind .","commenter_a":"and lovebirds don't own February. So wtf is your point?","post_message":"\"Christians don't own December,\" one atheist writer says."}]
