[{"comment_id":"10153058283284411","commenter_b":"Carlan those who behead people in the name of fake Islam are created by Mossad , CIA and MI6 have been given training by them please wake up to the reality CNN and fox news are not just the lives stop your hatred against us muslims please leave us alone , those isis members have kept their fake muslim names","commenter_a":"Germany starting shit again... Shocker.","post_message":""},{"comment_id":"10154525583946336","commenter_b":"Another red herring, Republicans? We've had enough of your endless investigations that amount to NOTHING.","commenter_a":"I'm sorry to say that she could murder a nun on 5th ave. and nothing would happen ...... Why?","post_message":"\"She did it for greed and for power and for the almighty dollar.\"  In her Opening Statement last night, Judge Jeanine Pirro said it's now clear that Hillary Clinton used a private email server to \"hide her shady Clinton Foundation dealings.\" @webpagelink"},{"comment_id":"823419914360098","commenter_b":"Never,never forget the countless acts of murder she committed by her acts against her brothers and sisters!","commenter_a":"I work hard at forgiving. I just can't forget. God told us in order for us to receive forgiveness, we must forgive. That is a tall order in this circumstance. I am trying. It is up to God to cleanse her of this deed. I had to turn it over to him. I still will not watch any movie or show she is on or in.","post_message":"Jane Fonda has changed her tune. She apologized for her Vietnam photos.   What do you think? Better late than never, or too little too late? Should she be forgiven?"},{"comment_id":"10154427648451955","commenter_b":"And she is a total lying bitch.","commenter_a":"He's an ASS !!!!","post_message":"Donald Trump, on releasing his tax returns (Source: NYT)"},{"comment_id":"10152984965615950","commenter_b":"@username what a BITCH","commenter_a":"Cute. But this is not the 1st time they put the glasses on the baby.","post_message":"WATCH: Adorable viral video shows a baby seeing clearly for the first time, and it teaches an important lesson for parents: it's never too soon to check your child's eyesight @webpagelink"},{"comment_id":"10153535797471336","commenter_b":"That's because they have a thug for a governor ..A Hood Rat..","commenter_a":"It's pretty obvious why there is so much crime in Baltimore. The cops are afraid to do their jobs! I'm surprised most cops haven't left Baltimore!","post_message":"Ten federal agents will work with Baltimore's homicide detectives in the latest bid to curb a surge in violent crime."},{"comment_id":"10155057898721729","commenter_b":"You can't make this crazy stuff up","commenter_a":"So they want equality. They get it but its not the equality they wanted because gasp! The police officers do their jobs. So the black police officers are not REALLY black because they are doing the jobs that the black population wanted them to do (and represent the black community) but didnt expect them to do the job as it is supposed to be done. Eeek! My head is spinning.","post_message":"How's this for a racist stereotype?"}]
