[{"comment_id":"753406171459230","commenter_b":"She should be drawn and quartered. That will hush he up.","commenter_a":"Blacks are useless lot of people. over 90% vote democrat and are indoctrinated in marixist doctrine. useless.","post_message":"MSNBC's Melissa Harris-Perry slammed a Latino Republican guest for using the word “hard worker,” because to her, the term “hard worker” only applies to former black slaves.  Here's Mike Rowe's BRILLIANT response. Spread this everywhere!"},{"comment_id":"1535105376549586","commenter_b":"We need to deport her ass","commenter_a":"Yes","post_message":"Do you think she deserved 7 months in jail for urinating on a war memorial?"},{"comment_id":"1191417507545813","commenter_b":"HELL, IF THESE PEOPLE WORKED AT A JOB AS HARD AS THEY DO PROTESTING THIS STUPID CRAP, THEY WOULD HAVE PLENTY OF MONEY !!!!!!!!!!!","commenter_a":"So the dems want to shut down Graceland via their personal propaganda terrorist cult Black Lives Matter AND they want to label WikiLeaks a terrorist organization and have put a DEAD OR ALIVE bounty on Julian Assange. These ARE troubling times. I can't believe they think the American people are that stupid. Enough is enough. Stop with the violence and let us now hear what the Clinton camp thought should be deleted. (Despite the State Dept. request for ALL email on server) I think at the end of the day people of all colors and beliefs in America will find they thought we were all stupid enough for them to screw all of us. We really all need to stick together. Unity matters now. #HumanLivesMatter #AllLifeMatters #TruthMatters Now let THAT sink in.","post_message":"Leaders of the protest say they chose Graceland because \"it demonstrates one of Memphis's most common forms of financial inequality and because the site has ties to ... the death of unarmed teen Darrius Stewart.\""},{"comment_id":"10153247991679342","commenter_b":"Abortion is good. They should abort all babies born before the mother is 25","commenter_a":"here we go, \"all these people worried about worms in the water and nobody cares that planned parenthood is selling dead babies!\"","post_message":"One woman said she first noticed the worms yesterday in her bathtub and after collecting a few, she heard neighbors found the same thing.   @webpagelink"},{"comment_id":"10153508480963984","commenter_b":"She is a disgrace","commenter_a":"There is nothing here for a reality show. Maybe a show on mental illness.","post_message":"NAACP race faker Rachel Dolezal stepped down from her job, but she already has a new gig in the works. You might be shaking your head when you see it..."},{"comment_id":"10154592077846756","commenter_b":"Good grief. I could pee a puddle deeper than her.","commenter_a":"She will never be first lady.","post_message":"As she readies to address the Republican National Convention Monday night, it's not so clear exactly what kind of first lady Melania Trump would be. But she's left some clues."},{"comment_id":"10153171186966051","commenter_b":"stand your ground. no to muslims","commenter_a":"I would say no no no","post_message":"The people in this town are prepared to do whatever it takes to keep a Muslim cemetery out. In fact, they have one very specific idea in mind."}]
