[{"comment_id":"10153803729806336","commenter_b":"Yes, and McCain and Graham were WRONG! Just like letting all these muslim immigrants into our country...we dont know WHO THEY ARE!!!","commenter_a":"Wait. You cry and cry that he has not done enough in Syria. He then sends some. And you get upset over that??? Fox / GOP supporters make zero sense.","post_message":"On \"Justice,\" Judge Jeanine Pirro slammed President Barack Obama's decision to send U.S. troops into Syria, after repeated pledges of no boots on the ground. @webpagelink"},{"comment_id":"765077356935066","commenter_b":"Gef mir.","commenter_a":"Amen term limits","post_message":"Bernie Sanders is 73, Joe Biden is 72, Chuck Grassley is 81, Barbara Boxer is 74, Nancy Pelosi is 74, Harry Reid is 75, John McCain is 78, Diane Feinstein is 81. Mitch McConnell is 72, Orrin Hatch is 80, Richard Shelby is 79, Carl Levin is 79, Jim Inhofe is 79, Pat Roberts is 78, Barbara Miklski is 77, Jay Rockefeller is 76, Thad Cochran is 76, Tom Harkin is 74, Patrick Leahy is 73, Lamar Alexander is 73,  Bill Nelson is 71.Charles B. Rangel is 83. In the last 30 years, the number of Senators in the Senate for 20 years or more has tripled. Senility and seniority are not serving us well. (some are now older than listed)  The 50 richest Congressmen and women reported a minimum net worth of at least $7.4 million in 2013, Roll Call discovered in it's review. That represents a steep increase from the $6.7 million benchmark set in 2012.  Wealthiest Members of Congress.  California Rep. Darrell Issa (R): $357.25M  Texas Rep. Mike McCaul (R): $117.54M   Maryland Rep. John Delaney (D): $111.92M   West Virginia Sen. Jay Rockefeller (D): $108.05M  Virginia Sen. Mark Warner (D): $95.13M  Colorado Rep. Jared Polis (D): $73.56M  Connecticut Sen. Richard Blumenthal (D): $62.06M  California Rep. Scott Peters (D):$45.04M  California Sen. Dianne Feinstein (D):$43.72M  Washington Rep. Susan DelBene (D): $37.89M  Florida Rep. Vern Buchanan (R): $37.15M  Maine Rep. Chellie Pingree (D): $34.47M  California Rep. Gary Miller (R): $32.97M  California Rep. Nancy Pelosi (D): $29.11M  Ohio Rep. James Renacci (R): $28.08M  Texas Rep. Roger Willams (R): $28.01M  Florida Rep. Alan Grayson (D): $26.18M  New York Rep. Chris Collins (R): $22.50M  New Jersey Rep. Rodney Frelinghuyson (R): $22.21M  Tennessee Rep. Diane Black (R): $21.24M  Massachusetts Rep. Joseph Kennedy III (D): $20M  Idaho Sen. Jim Risch (R): $19.24  Tennessee Sen. Bob Corker (R): $19.12M  Missouri Sen. Claire McCaskill (D): $18.38M  Wisconsin Rep. Tom Petri (R): $15.64M  New York Rep. Richard Hanna (R): $15.3M  Arizona Sen. John McCain (R): $15.17M  North Dakota Sen. John Hoeven (R): $15.16M  Florida Rep. Curt Clawson (R): $13.53M  Wisconsin Rep: Ron Johnson (R): $13.52M  Wisconsin Rep. Jim Sensenbrenner (R): $13.04M  Kentucky Sen. Mitch McConnell (R): $11.97M  Iowa Sen. Tom Harkin (D): $11.85M  Illinois Brad Schneider (D): $11.71M  Texas Rep. Lloyd Doggett (D): $11.51M  Tennessee Rep. Jim Cooper (D): $11.51M  New York Rep. Nita Lowey (D): $11.48M  Virginia Rep. Scott Rigell, (R): $11.29M  Arizona Rep. Trent Franks (R): $11.01M  California Rep. John Campbell (R): $10.21M  North Carolina Sen. Kay Hagen (D): $9.12M  Louisiana Rep. John Fleming (R): $9.06M  Georgia Sen. Johnny Isakson (R): $8.93M  Georgia Rep. Tom Price (R): $8.87M  Ohio Sen. Rob Portman (R): $8.60M  Pennsylvania Rep. Mike Kelly (R): $8.51M  Texas Rep. Kenny Marchant (R): $8.13M  New York Rep.Carolyn Maloney (D): $7.73M  New Mexico Rep. Steve Pearce (R): $7.72M  Florida Rep. Tom Rooney (R): $7.47M  Source: Roll Call"},{"comment_id":"1466756690087245","commenter_b":"Flynn has resigned!!!","commenter_a":"IMPEACH TRUMP NOW","post_message":"\"I think this guy is somebody who might want to think twice about whether he stays in the position that he has.\" -- Bernie Sanders"},{"comment_id":"10154766410094714","commenter_b":"Let us wave a wand and turn you into a woman...then comment about this. Have a nice day!","commenter_a":"Wow! All of a sudden women in distress coming forward. I wonder how many more will jump on the dollar filled band wagon? Doesn't this look a little suspicious? Clinton filling their pockets!","post_message":"The Donald J. Trump campaign is planning to fight fire with fire: “We’re bringing out tactical nukes now, with thermo nukes later.” @webpagelink"},{"comment_id":"10152797088006051","commenter_b":"Burn em all down. And roast a pig in the process.","commenter_a":"That is deplorable. He is entrusted to safeguard civilians, he does not have the right to pick and choose based on his personal beliefs and bigotry. One cannot condemn an entire religion because of a group of extremist radicals. EVERY religion has its bad...Catholics raping little boys, Christians murdering and blowing up abortion doctors and clinics. With the hateful logic all mosques should burn, burn all churches as well, right? I so sincerely hope he is removed from his station. Hate begets hate.","post_message":"This fireman tweeted out the first thing that popped into his head when he heard that an Islamic Center was on fire."},{"comment_id":"929408747192304","commenter_b":"As stupid and ugly as her mom!!","commenter_a":"She can't help it...look who her parents are!","post_message":"Chelsea Clinton....you are an IDIOT."},{"comment_id":"10153840102456523","commenter_b":"Your ignorant Jessica. Just Stfu","commenter_a":"Gang members shoot people to they do drive byes or just randomly shoot somebody it could be any if us blk kill blks latinos kill latinos white kil whites wow only in America","post_message":"The graphic video shows the three men listening to music, and a man in the front passenger seat holding the phone.   Suddenly, the phone drops to the floor of the car as what sounds like at least 30 gunshots can be heard in the background."}]
