[{"comment_id":"10153573127079268","commenter_b":"then get up lock n load and go fight..i dint want my kid dying for your stupid ass. Wordy @username","commenter_a":"\"Republicans trying to find a way to go to war and make their sugar daddies happy.\"","post_message":"The House is looking for a loophole."},{"comment_id":"1066828243360262","commenter_b":"I agree Diane..... but she is NO Lady!","commenter_a":"are you kidding me lady,Do you not get that Obama started this whole thing between races.there shouldn't be black or white there should be strictly American.","post_message":"VIDEO: Cokie Roberts has apparently gone completely insane."},{"comment_id":"10152781653123717","commenter_b":"That girl needs some help!","commenter_a":"wtf is that on the bottom left?","post_message":"Manchester police say an investigation into prostitution in the Queen City led to the arrest of six people. @webpagelink"},{"comment_id":"10153497102100163","commenter_b":"His wife","commenter_a":"I don't believe this..","post_message":"Waka Flocka Flame's longtime girlfriend explains why the couple decided to part ways"},{"comment_id":"10154429812461051","commenter_b":"Damage fags","commenter_a":"Impeach Trump","post_message":"The World Bank claims Trump could be the best thing to ever happen to the American economy. Do you think they're right?"},{"comment_id":"1440023386030632","commenter_b":"Amen","commenter_a":"It's really a fresh wind","post_message":"Find out why Judea and Samaria leaders say, 'a new wind is blowing from the US.'"},{"comment_id":"10153716841688132","commenter_b":"Sorry but he's not BLACK!!","commenter_a":"Ok President Obamas mother was white.His Grandparents were white.How can white people who say he does not care about white people Really ! You r all pissed because our President is Black?thats the issue with ignorant people who continue to blame our President.Im sure George Bush would not have done anything","post_message":"Barack Obama won't be intervening in Kelly Rutherford's international custody battle."}]
