[{"comment_id":"10154539619803433","commenter_b":"he has never cared about facts, just rambles, surprised that so many people are taken in...oh wait many people were taken in by Hitler also, very similar","commenter_a":"Trump, pay attention; you are wrong!","post_message":"In an attempt to defend his recently linked offensive comments, Trump claimed Clinton laughed at a 12-year-old rape victim. False. @webpagelink"},{"comment_id":"892830167500429","commenter_b":"Well when you're being raped - tell me about that theory again or in a 'dickless' gun free zone. (Hahha)","commenter_a":"Tell them if you knew you had to play inthe park, you would have brought a bigger bat.","post_message":"They have hunting... And dicks on their brain! @webpagelink"},{"comment_id":"508820039306289","commenter_b":"This should be in every state. Men that force themselves on a woman do not deserve to have the ability to rape again.","commenter_a":"I dont understand the verbiage \"violent sex offenders\". Isn't rape always violent, are their non-violent rapes I don't know about?","post_message":"This state did it, what about yours?"},{"comment_id":"10153620963073984","commenter_b":"When will Americans wakeup to the fact that Hillary is for Hillary and she don't give atinkers damn about anyone else!!! She BITCH!!","commenter_a":"Who in their right mind would vote for her???","post_message":"As cynical as I may be about politics, I just don't see how Hillary can survive this avalanche of scandals.  Do you think Hillary is destined for the ash heap of history?"},{"comment_id":"10153906444119705","commenter_b":"All these people on here saying Apple is supporting terrorism have no clue. If the software is created to unlock this phone, it can be used to unlock any phone. They all use the same data encryption software. This would put all of Apple's customers (hundreds of millions of us around the world) in danger of our privacy being breached by thieves or overreaching governments. Apple has complied with every aspect of this investigation otherwise, including providing data stored on its servers as required by warrant. But the software needed to break into the rest of the data on this phone doesn't and shouldn't exist.","commenter_a":"The order specifically refers to *this* phone, specifically allows Apple the option of doing it on *their* premises, and specifically allows *Apple* to retain control of the method used. What? They can't keep that process secure themselves?","post_message":"Apple vs. the FBI explained, how this case might affect your iPhone."},{"comment_id":"1258505287549557","commenter_b":"Nah yo Grandma shouldn't have been hoeing around on Christmas eve. Her old ass shoulda been inside","commenter_a":"Damn WsHH with the sad ass news but was santa cryin like that when his reindeer ran Grandma over","post_message":"This is heartbreaking. #WSHH "},{"comment_id":"934918126557241","commenter_b":"Why dont you vote for Hillary then? She cant say two words without lying her ass off. But I bet everyone who commented will be there to vote for her. Thats why Donald is SELF FUNDED. Doesnt take money from soros or rockefeller. Thats why the media hates him and all of you do as well. Obama has already said that muslim refugees will go in a database. But when Trump says it hes a racist bigot. Obama used different \"words\" and its totally different . When really its not. Its the same and Im not argueing . I hope you will all be happy when your next LIAR is elected. Thats why grandkids wont enjoy America as you did. Thanks dickheads.","commenter_a":"The dude tells the truth. Regardless noone else has rhe balls to speak the truth anymore","post_message":"The call took place right around the time Donald Trump announced his intention to bar Muslims immigrants from entering the U.S."}]
