[{"comment_id":"10153504352285329","commenter_b":"She's been on hormones for years-that's where the breasts come from. And you can't see anything under the suit because it was removed. Think ya need your eyes checked","commenter_a":"Guys... Where did that breast come from so suddenly?","post_message":"The olympian and reality star has made her debut in the July issue of Vanity Fair)"},{"comment_id":"803115886455778","commenter_b":"Shoot that mother f***** in the head","commenter_a":"Courtney Surprenant my fear at dollar tree or anywhere really","post_message":"Video captured a Florida mother wrestling her own daughter from the arms of a would-be kidnapper inside a store. The suspect ran out of the store but was quickly stopped by an off-duty police officer at gunpoint. @webpagelink"},{"comment_id":"1422840444402648","commenter_b":"0 for 3 definitely a malicious prosecution not based on facts evidence or law. they need to sue her and the city of Baltimore.","commenter_a":"I think that this prosecutor did this solely on political reasoning and her office needs investigated","post_message":"Caesar Goodson, one of the Baltimore police officers tried in the death of Freddie Gray, has been found not guilty on all charges."},{"comment_id":"10153953096951336","commenter_b":"So according to your logic @username driving home after having a few beers is equivalent to shooting a gun into a crowd of people? Am I understanding you correct? I bet you still believe Marijuana makes people go crazy.","commenter_a":"People who drink and drive should serve prison time. At least a 1to 5 year minimum . And if they kill or hurt someone while driving drunk they should serve life in prison.","post_message":"\"Social media led us straight to this suspect to stop him before he was able to hurt himself or others,\" the Franklin County Sheriff's office said."},{"comment_id":"10153068133586135","commenter_b":"Nope kids do not belong at wedding receptions! Especially with the cost of plates being so expensive!","commenter_a":"Can't stand the non-kid weddings. Just bring them. HA!!","post_message":"After their babysitter cancelled, Jessica Baker and her husband didn't attend the wedding because kids weren't invited. A couple weeks later, they received a bill for $75.90 in the mail to cover the meals they would've eaten at the reception."},{"comment_id":"1269958509763867","commenter_b":"And they're all dumb white girls 😂","commenter_a":"Great President!","post_message":"This is why we are going to miss him."},{"comment_id":"10153976851960950","commenter_b":"Hillary husband, Bill Clinton, makes Bill Cosby look like a Saint.....","commenter_a":"Bring it baby. I used to feel sorry for Melania, but she is as bad as her bully pervert of a husband. All Trump cares about is his money. All Melania cares about is Trump's money.","post_message":"She is demanding a retraction and apology."}]
