[{"comment_id":"10152763354566051","commenter_b":"kill the bitch","commenter_a":"They need to wrap her head completely in duct tape !!","post_message":"When her fiance broke up with her, this woman decided to make his 3-year-old daughter pay."},{"comment_id":"10156349547100354","commenter_b":"Conservatives learned the lessons of MLK. I think the left needs to review what he preached. It is not the color of the skin but the content of character.","commenter_a":"These people just say what they think and then if it bites them in the rearend they come back with some ridiculous other story which nobody believes but they seem to think that we will.","post_message":"FIRESTORM: MSNBC Liberal Claims She Wasn’t Calling Dr. Ben Carson Racial Epithet...\"Safe Negro\"...Backpedals Quickly...Dr. Carson Campaign Blasts...MORE..."},{"comment_id":"10153759399624228","commenter_b":"Her point, Chad, is that it's not just Muslims who are terrorist. I'm not a supporter of Muslims and have my own views but you can't just pick and choose. If you're going to list terrorists, list them all. Not just a specific religious/culture type","commenter_a":"It's not just ISIS.","post_message":"They want all of us to become hostile"},{"comment_id":"10150724585954999","commenter_b":"By all means, Madame, blame \"gentification\" for this vile behavior!","commenter_a":"So glad I was fortunate enough to have been able to move out of that place. Poverty, desperation, lack of global perspective, dread and hopelessness all dim the people's hope. Terrible place to live. For an uplifting story about this neighborhood check out HONY's series on Ms Lopez and her school there. So much work to be done, sadly the people who live there are the most marginalized people in NYC. Short of starting over, not sure what will happen to the poor in that city in the way it's going. These are the extreme sides of the coin of gentrification.","post_message":"The woman, 18, was walking with her father when 5 men approached them."},{"comment_id":"10153229519907377","commenter_b":"sick of protesters .come to our country and complain ,get them back to the life they love","commenter_a":"Who let the trash in in the first place ?","post_message":"\"There is hatred against us that is unbelievable,\" Trump told the rally, according to CNN, after Hamid and several others were ejected."},{"comment_id":"897196563636468","commenter_b":"Nailed it! Being as, I saw this last night and asked, who is this woman!","commenter_a":"Funny how Kelly Clarkson's known over a couple of continents, yet what's her face has never been heard of over here.","post_message":"Some people wait a lifetime for a comeback like this  well done, Kelly Clarkson."},{"comment_id":"665987530270126","commenter_b":"Don't forget though we will have to build an impervious penetrating wall around California to keep them there!","commenter_a":"So how about where ever the idiot pelosi lives at, lets make the area around her house and city a sanctuary city and move the unvetted refuges there. Put your monry where your mouth is wacko!","post_message":"Nancy Pelosi Has To Be The Stupidest Person To Ever Walk The Planet!"}]
