[{"comment_id":"1017702978286400","commenter_b":"It's a true testament to J.K. Rowling's writing that I can read that passage, and, nearly 9 years later, still feel the same goosebumps I felt the first time I read the book in July 2007. Very sad day today.","commenter_a":"\"Look... At... Me...\" He whispered. The green eyes found the black, but after a second, something in the depths of the dark pair seemed to vanish, leaving them fixed, blank and empty. The hand holding Harry thudded to the floor, and Snape moved no more. \"","post_message":"\"It is an ancient need to be told in stories.\""},{"comment_id":"10154637857483188","commenter_b":"He's been doing that since way before anybody else","commenter_a":"When are you going to report on Hillarys emails? Speeches? Ties with foreign governments?","post_message":"Tough situation."},{"comment_id":"10154527348963352","commenter_b":"Kiss his ass","commenter_a":"I agree with him!","post_message":"RUSSELL SIMMONS GOES OFF ON OBAMA WITH NO KIND OF RESPECT! BASICALLY SAYS OBAMA AIN'T SH*T! (PHOTOS) @webpagelink"},{"comment_id":"591336634387962","commenter_b":"Build the wall!!","commenter_a":"That's California for ya. I find nothing wrong with what he said in 1971. Things were different then. I said things in 1971. Does that mean I'm a racist today? I am military where everyone's color is either desert camo or woodland camo. I find affirmative action quite racist. Employers should be able to hire people because of their skills not because of the color of their skin. Absolutely ridiculous.","post_message":"California lawmakers refuse to honor John Wayne! and here's why..."},{"comment_id":"480443122154949","commenter_b":"INDEPENDENT WOMEN FOR TRUMP!!","commenter_a":"Saw the Town Hall meeting with you tonight, very on point. I hope people get their heads on straight and vote for you Mr.Trump. Go Trump Go","post_message":"WOW! What an evening in West Allis, Wisconsin! THANK YOU for the incredible amount of support tonight. Everyone get out and VOTE TRUMP on Tuesday, April 5th! We will MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1765614553704778","commenter_b":"Congress has the power to IMPEACH HILLARY now for all the massive lies & corruption at its highest level. Ask your Congress person WHY THEY ARE NOT?? Where is the integrity of Congress?","commenter_a":"So the White House knew full well about Hillary's email after all .. one false narrative after another. This nation cannot survive another 4 years of corruption like this!","post_message":"\"The IT professionals who whitelist devices at places like the White House only add the email addresses authorized by management.\""},{"comment_id":"1807363586202385","commenter_b":"Yes WE NEED TO LOCK HILLARY AND HER FRIENDS UP!","commenter_a":"Hell yes !!!!!!!","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"}]
