[{"comment_id":"992902970750561","commenter_b":":/ I think misogyny runs pretty rampant here. Look at what happened recently in Alberta. A dead woman's genitals were presented in court as evidence that she was stabbed in the vagina after she died from internal injuries to that organ. Usually, a doctor simply saying \"there was a stab wound\" would be alright.","commenter_a":"How long before someone argues some ridiculous point on this?!","post_message":"Thanks for the image, ATTN:!"},{"comment_id":"10153856538795575","commenter_b":"Great post😀","commenter_a":"People say that Mr Trump doesn't have a platform, that he just wants to make America great again. I have something to say about that, Donald Trump is not telling you his plan he's giving you an outline. Why? Every time he brought something to the table, the other candidates take it and run. Such as immigration, the wall and other issues. I can guarantee you that he won't give you his full plans in detail until he standing at the podium next to one of the Democrats. That is when he will reveal everything. He doesn't need to do that now. Donald Trump is a visionary. He doesn't go into business without a strategy, and a form of negotiation already set. This man is prepared in business and it will be prepared when the time is right in a debate. He is a brilliant man, and he will not ...","post_message":"CHAOS in Alabama --  20,000 EXPECTED AT TRUMP RALLY!"},{"comment_id":"956149327758873","commenter_b":"Hit it girl","commenter_a":"Indeed I do agree and it's another reason why I dislike them.","post_message":"Veterans have had it with Republicans using them as political props, while screwing them every chance they get. Do you agree with this veteran's take?"},{"comment_id":"10155662877255354","commenter_b":"She is f#$%&@+ stupid.","commenter_a":"Fucking stupid liberal fuckers","post_message":"And look how much the fine would be if you didn't."},{"comment_id":"10154356585776509","commenter_b":"The mass shooter in California, were not by Americans. They should establish a law that anyone who comes into this country looking for citizenship should established themselves as Americans ,have at least 2 year or more waiting period. Until they do an extensive background check","commenter_a":"When black people kill white people and rape white women you don't see no tears from Obama. When Muslims terrorize and kill people cut Christians heads off you don't see no tears from Obama","post_message":"President Barack Obama wipes away tears while speaking about victims of gun violence: \"Every time I think about those kids it gets me mad.\" @webpagelink"},{"comment_id":"10153244539676756","commenter_b":"And women like @username have no problem eating corn on the cob with those buck teeth!!","commenter_a":"Glad I live in the U.S.!!","post_message":"In Russia, women are prohibited from doing 456 types of work.   In Nigeria, it's not a crime to hit your wife for the purpose of \"correcting\" her.   In Iran, a woman can be jailed for not following the Islamic dress code, which includes wearing a hijab."},{"comment_id":"529094357257035","commenter_b":"No, no I'm not.","commenter_a":"You are just another phoney.","post_message":""}]
