[{"comment_id":"10155207761586509","commenter_b":"We don't do that to white people Bill....","commenter_a":"Just imagine if it was the other way around. They would have been met by heavily armed border guards pointing automatic weapons at them. They would have been put in handcuffs and leg irons and paraded before a judge and then be jailed for a ridiculous amount of time.","post_message":"Oops. 1,500 Americans accidentally floated over to Canada. @webpagelink"},{"comment_id":"963715427023908","commenter_b":"Thugs is a nice word for these fools...","commenter_a":"Disgusting!!","post_message":"SAVAGE THUGS DIG UP CONFEDERATE SOLDIER: Group Fed Up With Waiting Begin Digging Up Confederate General Grave (VIDEO)  NO RESPECT!   @webpagelink"},{"comment_id":"10152676040812293","commenter_b":"Really beautiful","commenter_a":"What ever you do . don't feed your mule a carrot ...He or she won't leave you alone. We had BLAST.","post_message":"The full, panoramic view is breathtaking."},{"comment_id":"1920123994941377","commenter_b":"Thought she was said she was leaving. Oh that's right she is an actress. Bad one at that.","commenter_a":"Hate to tell you this whippee but nobody really thinks you know anything you stupid bitch, and if you have any compassion for people at all, for God's sake cover your fugly ass face!","post_message":"Nobody saw this coming..."},{"comment_id":"588976734614882","commenter_b":"She couldn't sexually satisfy ol slick willy either","commenter_a":"Don't want her in the War Room...Remember Benghazi!!!","post_message":"Ahead of President Obama's speech to the Democratic National Convention tonight, The White House released excerpts touting Hillary Clinton's experience."},{"comment_id":"10155817024445192","commenter_b":"If she has an abortion, there is no child support. If you have the kid, they have to eat whether you like it or not.","commenter_a":"Women say it's thier body until it comes to child support. Then is both. Hmm mm if abortion is legal because of pro choice then child support should be pro choice too.","post_message":"A Florida judge is blocking a new state law that requires women to wait 24 hours before getting an abortion."},{"comment_id":"1143690625715878","commenter_b":"Good thing I'm pregnant!!!!","commenter_a":"Jennie!","post_message":"Warning!"}]
