[{"comment_id":"1351703334882522","commenter_b":"He should be raped to death by chainsaw","commenter_a":"Place him in the general population of prison. He won't last. That is the one crime they don't tolerate.","post_message":"Petition Created To Publicly Hang Benjamin Taylor, Who Raped 9-Month-Old To Death!  This guy is sick, its our duty to make sure he never harms another child."},{"comment_id":"10153925563166037","commenter_b":"SarahMasanana. Animals kill their young, adultery, kill for food and have no remorse, you just described the human race! Wow.","commenter_a":"If this were an atheist country and atheist world we would be a lot better off. Much fewer wars and conflict and nobody pushing their BS onto anyone else.","post_message":"\"I think one of the reasons God has been good to us is that we have done him honor. Unlike the other countries of the world that do not even invoke his name we do him honor.\""},{"comment_id":"10152774860755927","commenter_b":"Is this wife beater and Obama DNA guzzler still relevant?","commenter_a":"The question is does Reid understand the U.S. Constitution? He should not try and put pressure on the Supreme Court. Reid is a pathetic old ugly man. He is mean and unhappy in life. Can't wait till he is standing before his Maker. Won't be a pretty sight for sure","post_message":"WATCH as Senator Harry Reid maligns the U.S. Supreme Court on forthcoming Obamacare decision "},{"comment_id":"1069048556481240","commenter_b":"Really, how is this possible!!! Illegal immigrants are cover in the Constitution???","commenter_a":"NO they do NOT","post_message":"Incredible!"},{"comment_id":"1194953337245391","commenter_b":"😂😂😂","commenter_a":"@username... it's all about perspective","post_message":"\"[Donald J. Trump] was contributing to America by regrowing his business, which now employs thousands of people ... I think that's a better contribution to the economy and to America than pumping into the government, which wastes an awful lot of it.\" – Stuart Varney"},{"comment_id":"890066024388849","commenter_b":"Our own government is gonna put us in a civil war to survive all this mess.....SOMEBODIES GOT to be making dirty money off all this illegal stuff going on....unbelievable","commenter_a":"Send all of them packing NOW.","post_message":"ILLEGAL TSUNAMI 2.0: 12,509 Illegal Kids Already Over Border In New Wave (VIDEO)  The next explosion of illegal teen border crossing is in full swing, but just one-in-six are being sent home, with most of the rest settled in the United States,...  @webpagelink"},{"comment_id":"1442259229136366","commenter_b":"tell me what he lied about?","commenter_a":"Trump has NEVER had a alcoholic drink in his life ,you idiot.","post_message":"His Fakeness speaketh."}]
