[{"comment_id":"1754592891449959","commenter_b":"@username totally 💞","commenter_a":"@username 💖👻💖","post_message":"It's literally the most magical thing of all time, Harry Potter fans."},{"comment_id":"10153383966333352","commenter_b":"This isn't cute in fact it's sad that some women are going to grave lengths to look like someone else.","commenter_a":"She's just stupid","post_message":"Sisters attempting to copy Kylie Jenner’s plump pout left with swollen blue lips after repeatedly sucking a bottle"},{"comment_id":"10154602840309877","commenter_b":"It's not going against the majority, it's supporting a fascist bigot. Only a fool wouldn't know the difference! Girl bye! Your post was asinine.","commenter_a":"Dang....wow. That was unnecessary. Smh So if you go against the majority then you get fired or blackmailed. Yeah, okay. That's totally okay, just sit down, shut up and get on the broad path like everyone else.","post_message":"It was all good just a week ago."},{"comment_id":"10152875043501973","commenter_b":"My husband said he wished there was since we can't just hop in our car and get down there. :)","commenter_a":"Is there an online store too???","post_message":"The sale starts today at 9 a.m. for season ticketholders, 11 a.m. for the general public, and offers up a ton of Ducks' athletic gear."},{"comment_id":"10153442792427232","commenter_b":"Have you seen all the arrest of that originations leaders?","commenter_a":"Much like their spoksperson...LoL","post_message":"The civil rights group approved the measure Saturday at its national convention in Philadelphia to end the boycott of tourism and other economic activity. STORY HERE: @webpagelink"},{"comment_id":"10152535254222623","commenter_b":"It'd be great if people actually read, studied and paid attention in school and did something with their lives except screwing, rolling blunts, and figuring out ways to commit crimes.","commenter_a":"Look at the parents. Poor child","post_message":"A mother and father have been charged after police found video of a baby playing with a real handgun."},{"comment_id":"988150574624052","commenter_b":"They are acting like school kids, so the best way to handle them is to ignore them.","commenter_a":"get off the dang eggs birdXD","post_message":"EAGLE CAM DAY 4: One egg has cracked and we spotted an eaglet. Watch it fully hatch now: @webpagelink"}]
