[{"comment_id":"1605375073100237","commenter_b":"Fuck him and his family. Good job lady and sorry you had to as nobody wants to kill someone. But they will kill, torture, and rape you. Good you were armed. God bless you.","commenter_a":"Why do we allow people like this to contribute to the GENE POOL? His whole family should be spaded and or neutered. Why because of IDIOTIC lines like \"he needed money for clothes\" what happen to all the government hand outs this family was getting, cause sure as shit they all were on welfare and not one ever held a job. As to whether or not it was the home owners fault is by far the most asinine thing ever spoken.","post_message":"This teen punk broke into a woman's home and tried to rob her. But she defended herself, and left him dead.  Now the punk's family is asking an absolutely sickening question, that left the woman and her friends shocked.  Only in Obama's America..."},{"comment_id":"10154382479866159","commenter_b":"Now is a good time to venture into the moving industry !!","commenter_a":"I know a lot of people I hope does this.","post_message":"\"Make dating great again!\""},{"comment_id":"1064573833613565","commenter_b":"So much hate is was fuels the violence like what happened in Orlando .for all that keep on with with Muslim need to die why hide your face if your so though to say thoughts words only cowers hide behind masks .....","commenter_a":"Gun control does not work and this is proof","post_message":"The FBI, Orlando Police and officials gave an update on the Pulse terror attack. Here's the latest: @webpagelink"},{"comment_id":"10153796451206491","commenter_b":"STFU","commenter_a":"Wanna help stop racism? Quit talking about it","post_message":"\"The more we learn about who we are and how we got here, the more we will mobilise\""},{"comment_id":"10153305375703984","commenter_b":"She's a liar and possibly more","commenter_a":"She's gonna be flash in the pan, here and gone.","post_message":"Wow. One of Hillary's first moves as a candidate may be the one that kills her campaign...  Do you hope Hillary loses?"},{"comment_id":"801111976648525","commenter_b":"Wow that's all I can muster after reading these comments","commenter_a":"copy that.....","post_message":"This brave, hard-working man has accomplished so much in the face of unprecedented obstructionism and hate. History will treat him kindly.   Thanks to Roy Mark Ramdas."},{"comment_id":"1212512528838103","commenter_b":"STFU already! Hillary lost because she's Hillary. Get over it!!!","commenter_a":"Trump can't make an honest or decent response to anything.","post_message":"Trump’s Latest Twitter Tantrum Desperate Distraction From Tuesday’s Stunning Revelation.  It’s likely not a coincidence that the President-Elect is rehashing won battles after Tuesday’s breaking news that FBI Director James Comey likely acted favorably towards Donald Trump with his October announcement that new evidence emerged in the Clinton email investigation.  Read the whole story at Reverb Press HERE: @webpagelink"}]
