[{"comment_id":"10154325825161051","commenter_b":"Um I think this woman is a incredibly ignorant idiot, you can see anything in everything if you are looking for it. It is just a design of lines, what a dumbass","commenter_a":"If it offended you dont buy it.What's wrong with these cry babys","post_message":"Here's the Walgreens wrapping paper that had this lady outraged."},{"comment_id":"10154489632511051","commenter_b":"True, LOCK HER UP !","commenter_a":"agree'","post_message":"Newt Gingrich says Hillary Clinton is without a doubt one of the most corrupt politicians in American history. Do you agree or disagree?"},{"comment_id":"1859752354244114","commenter_b":"She is very stupid...and very mixed up..crazed..","commenter_a":"FUCK-YOU,YOU LYING ESTABLISHMENT PIECE-OF-SHIT...THIS BOOTLICKING PUBLICATION ISNT EVEN WORTH WHIPING YOUR ASS WITH...NO RIGHT-MINDED UNDIVIDUAL/FREETHINKING PERSON CARES ABOUT THE PARTISAN-CORRUPT GARBAGE THAT YOU CREATE OUT OF FABRICATED LIES...SO,GO SHOVE YOUR HEAD RIGHT BACK UP #MADAMEINMATE666'S FATASS AND QUIT PRETENDING TO BE A JOURNALIST PUBLISHING NEWS...FUK-OFF.","post_message":"It’s official now: Jill Stein—and the Green party if it agrees with her—is/are a waste of space.  By Daily Kos user BoGardiner"},{"comment_id":"10153362119139087","commenter_b":"IF I WERE A JEW ,,,, i would not want this broad on my side shes a idiot !!!!!","commenter_a":"Oh, please nitwit.","post_message":"“Our country turned [900 Jewish refugees fleeing Germany] away, and many who were sent back to mainland Europe were killed in the Holocaust,” said Democratic National Committee Chairwoman Rep. Debbie Wasserman Schultz. “Instead of learning from that mistake, Republican candidates and politicians were eager to repeat it.”"},{"comment_id":"1829950227225236","commenter_b":"William, true but there were two shots to the head though.","commenter_a":"These are the kind of people that \"commit suicide\" with two gun shots to the back of the head.","post_message":"He joins a host of whistleblowers who have been saying this for YEARS!!"},{"comment_id":"10153310022881051","commenter_b":"Why is this vermin still alive?","commenter_a":"Blow him off the face of this Gods earth!","post_message":"Al Qaeda's leader just called for a 'lone wolf' terror attack on the United States - and that's not even the worst thing he said. (via VICE News)"},{"comment_id":"10154207452564916","commenter_b":"Ever hear of Independents? You know, 45% of the voters.","commenter_a":"And just where are all you threatening to leave the Dem party going to go? Good luck with that one.","post_message":""}]
