[{"comment_id":"10156261922235354","commenter_b":"Time to go home.","commenter_a":"Don't know Trevor ...M and glad of it.","post_message":"Nevertheless, Trevor Noah still trashed Dr. Ben Carson for being \"callous.\"   No joke."},{"comment_id":"10153978466591002","commenter_b":"These are Outlaw Motorcycle Gangs..not Motorcycle Clubs..Outlaw Gangs are nothing but Thugs","commenter_a":"I am in the minority here, but I feel safer with motorcycle clubs than I would anyone else. I would not turn away of I walked into a place of business and seen club memebrs in the same place. They don't just go out and rob and kill people because they want to. You can't compare existing clubs to SAMCRo from Sons of Anarchy. This is a TV show. Hell, we should have the clubs patrol the streets. Think about that one!","post_message":"After the Waco shootout this weekend, outlaw motorcycle gangs are again in the spotlight. Roger Weber takes a look at local biker gangs: @webpagelink"},{"comment_id":"1090200961078541","commenter_b":"No sympathy.. The German people should have turned on their Government years ago for not putting the German people first.. The German people have sat back and just watched as their Government have let these migrant, immigrant and refugee vermin infect their country like a cancer.. And now innocent people have died.. How many more are going to die before someone does something and boots these parasites not just out of Germany, but out of Europe.. Can you imagine it.. a Muslim free Europe..","commenter_a":"Islam to be wiped off planet all together","post_message":"LIVE: 9 dead, multiple injured as truck plows into Christmas market in Berlin in likely terrorist attack Watch Ruptly LIVE here @webpagelink"},{"comment_id":"10155030336677501","commenter_b":"Trash at its finest. Good job getting her off the street officers!","commenter_a":"Throw the key away","post_message":"WATCH: Activist Kathy Wray Coleman arrested on outstanding warrant during RNC demonstration in Public Square"},{"comment_id":"10152649909240950","commenter_b":"Yeah you stupid pussy!","commenter_a":"We'll all be speaking ISIS by Sunday","post_message":"Here is what would happen if DHS runs out of money on Friday:"},{"comment_id":"1379793182036339","commenter_b":"because her goal is selfish...not to make HIM successful...not to help America....but to HELP HERSELF....","commenter_a":"They all say they have the answer when they're campaigning. I've always wondered the same thing...why the hell don't they tell someone, then??","post_message":"Here's another question that I have: If Hillary Clinton has the answers for the economy, why doesn't she tell Obama what to do now?  Why do we have to wait until she maybe gets elected and then gets inaugurated and then starts putting her ideas into practice?  If she's got the answers, why wait?  Why doesn't she make it a point to meet with Obama, who's in the Oval Office and say, \"Barack, this is what we need to do to fix the economy\"?"},{"comment_id":"906810012772083","commenter_b":"He hit that hoe!","commenter_a":"@username found it","post_message":"Chik-Fil-A Stays Lit!"}]
