[{"comment_id":"10154661777626336","commenter_b":"I encourage all you Hillary supporters to each take in 3 Syrian refugees, because we don't want them here. Let them live in your homes. And while you're at it, since you Hillary sheep hate #Walls, start the #movement by taking the walls down, doors and windows off your houses and let people come in and out freely. And while you're at it, put up your gun free zones. #Trump2016 #BuildThatWall","commenter_a":"It's now reported that Hillary is going to appoint Loretta Lynch to the Supreme Court if elected president....pay for play, and corruption to the max. UNBELIEVABLE but not unexpected.","post_message":"\"You tell me what’s worse: Name-calling or lying to grieving parents as their sons' bodies lay cold in caskets... and then turning around and calling those parents liars?\" – Judge Jeanine Pirro @webpagelink"},{"comment_id":"729100880559027","commenter_b":"Damn right! Put that bitch in office and watch what \"We the people\" do!","commenter_a":"If Hillary wins, it will be because the electoral college was bought out!! The government has already bought the media and they are lying about the margin between Trump and Hillary---Trump is way ahead. The American people are fed up!","post_message":"“I am winning. I am beating everybody and, in my opinion, beating Hillary is easier than beating [my Republican adversaries],\" GOP front-runner Donald J. Trump said."},{"comment_id":"587883731397342","commenter_b":"Takes one to know one Babs!","commenter_a":"Who cares","post_message":"Barbra Streisand blasted “narcissist” Donald Trump in a 1,228-word Huffington Post op-ed."},{"comment_id":"529925163864730","commenter_b":"Kool","commenter_a":"This poor (morally) man reminds me of the KKK and how most whites were offended and embarrassed by them in the early 60's.","post_message":"Al Sharpton's career is going to come to a screeching halt after this.  His own people are turning against him. Now is the time to strike.  Can we get 30,000 'LIKES' for Al Sharpton getting fired?"},{"comment_id":"993982434028144","commenter_b":"That's my girl.","commenter_a":"Aarøn Andersøn","post_message":"\"The Seniors and Veterans Emergency Benefits Act would give about 70 million seniors, veterans, people with disabilities, and others an emergency payment equal to 3.9 percent of the average annual Social Security benefit, about $581 – the same percentage raise as the top CEOs got last year.\"  Read more here: @webpagelink  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154793818836337","commenter_b":"Holy shit you're dumb","commenter_a":"Fake deal. She has run her course and they don't want her anymore. She has been all downhill since she cut her hair. She belongs back playing support for O'Reilly on his show. Demanding a raise? No. On the verge of being fired, but trying to save face.","post_message":"Should she stay or should she go??"},{"comment_id":"512912212228885","commenter_b":"Beyonce!!!!!!!! Gave them the green light.. They wAnt what you have but don't want to educate themselves or help themselves. LAZY","commenter_a":"I think that this man that served alongside of every single race in the world as a brother, was assaulted by black thugs representing their selves as Black Lives Matter. Now let's see if someone from BLM will stand up and condone this behavior, or embrace it. There is racism in every race, but the citizens that stand alongside each other and condone this, are the true brotherhood.","post_message":"*****BREAKING NEWS*****  They said these 6 words..."}]
