[{"comment_id":"10154342587333258","commenter_b":"David Mayhew The problem with your statement is that your assumption is that just because they have been drinking, they are going to use a gun. Just because a guy drove to a bar with his car does not mean that he's going to do something irresponsible with it. I guess we should start seizing the cars of bar hoppers. Or we could categorize those cars that are most often DWI that injure or kill someone as \"assault cars\" and start seizing those.","commenter_a":"Fewer guns would not have stopped this lunatic. We need more good people to be able to lawfully carry guns into more public places because the criminals will carry them wherever they want.","post_message":"The common thread in too many mass shootings was the availability of powerful semiautomatic weapons that serve no purpose but to kill. | Via Boston Globe Opinion"},{"comment_id":"10153061163329138","commenter_b":"Go home!!! We don't want the likes of you here","commenter_a":"We are here to stay and there's nothing you can do about it.","post_message":"\"Many of these folks may have not been to a doctor because they don't have health insurance or because they don't really understand how the system works,\" one Somali advocate says."},{"comment_id":"10154316931887654","commenter_b":"it's with the thieves,rapists and murderers! this lady is a witch!","commenter_a":"It's hard to believe that she has enough brain to keep her breathing...........The woman is a grieving mother whose son was murdered by someone who should not have been here. Our borders are sieves because of failed policy and Pelosi says he was a \"law-abiding citizen\"???? Where is her soul? Her compassion? Her empathy?","post_message":"Democrat leader sides with illegal aliens over mom whose son was murdered by one."},{"comment_id":"10155025508527577","commenter_b":"Ya genius. We don't want to pay for more illegals shit.","commenter_a":"maybe he just doesnt want to pay for someone else shit .. just like any normal person doesnt want to pay for anyone elses shit .. especially for something as stupid as a wall . didnt work for china back when they made one what makes you think itll work today.. there will always be someone smarter than the measures put in place to stop advancement ... explosives arent hard to get in mexico especially if you are a well connected cartel ... people will be getting killed while the wall is being built kidnapped and the likes the wall if stupid for so many reasons .. just increase personnel and the available resources to combat the problem and it will in turn become easier to manage the flow of illegal immigrants coming in ... and if you think we as the u.s. government doesnt profit off cartel youre dumb","post_message":"The Mexican President was funded by the Juarez Cartel and that’s why he is against the Trump border plan:"},{"comment_id":"1388976751118684","commenter_b":"STOP KILLING BLACK PEOPLE","commenter_a":"معقول يصير بامريكا","post_message":"Courtesy: Ruptly"},{"comment_id":"10155161723871037","commenter_b":"You are so gross ...","commenter_a":"States where mestizos who refuse to learn English because we made it possible to not have to learn English and tell them assimilation is bad, have horrendous scores.","post_message":"Number 1? Massachusetts."},{"comment_id":"10154062407918812","commenter_b":"The kids in low income areas would just grow up as failures and,we'd support them as inmates. Abortion is cheaper in the long run, and saves people from being victims of their future crimes.","commenter_a":"$500,000 doesn't compare to the $500 Million taxpayer dollars that go to the organization that is (Un)Planned Parenthood, strategically placed in low income areas across America and helps thousands of new mothers kill their own children in their own wombs. Can the Fed do something about that??","post_message":"Oregon governor says armed group’s continued occupation of federal land has cost taxpayers nearly $500,000."}]
