[{"comment_id":"10154433105394087","commenter_b":"I'm an independent, but republicans are completely full of shit. And they don't mind the smell. Their platform is based on racial deportation.","commenter_a":"100% TRUTH","post_message":"\"Unless more leaders in the black church recognize that blindly supporting one party, which has done nothing to earn that support, is not benefiting those that they serve, the church will continue to lose its political influence.\""},{"comment_id":"177307306103129","commenter_b":"Wrong! Never said in his first 30 days","commenter_a":"Didn't he defeat ISIS already? He said he would in his first 30 days.","post_message":"Join us as President Donald J. Trump delivers the Weekly Address."},{"comment_id":"1592257357455136","commenter_b":"Ew. That girl is a cow","commenter_a":"Soar losers. Get over it.","post_message":"Anti-Trump protesters are outside Trump Hotel in D.C. They've been marching for two hours now.  More about road closures or traffic in D.C.: @webpagelink"},{"comment_id":"10153256294124726","commenter_b":"Deport that illegal!","commenter_a":"Put them all on a boat back to Africa and sink it","post_message":"WATCH: Obama on Baltimore: \"Too Many Instances\" of Police Target Poor African Americans"},{"comment_id":"10153146580383352","commenter_b":"@username she is one lost soul,","commenter_a":"I Pray that evil spirt of homosexuality never come upon my kids, those demons had their way with that young boy, this is sad, when a person is not happy with who The Lord made them, an idol mind is the devil workshop, the devil does not care who he comes after, teach Boys to be boys and girls to be girls., no need to reply to comment with negative remarks, if you don't agree, but this is a sad and ridiculous situation.","post_message":"Suicide note of 17-year-old transgender girl is DELETED from her Tumblr page after her Christian parents demand message blaming them for her death be removed"},{"comment_id":"10153722151399705","commenter_b":"That was the syrup created by the heated jelly.","commenter_a":"Did you see the grease pour out of it no thanks","post_message":"Wow everyone: Thanksgiving morning with delicious baked brie and jam."},{"comment_id":"883354948459698","commenter_b":"Literally you're the only person I could think of that would find this as interesting as I did.","commenter_a":"@username this cell has no mitochondria and is kicking, but my phone dies on 15% #whatatime","post_message":"Time to rewrite the textbooks again."}]
