[{"comment_id":"10153028104776037","commenter_b":"She should be in prison!","commenter_a":"What Democrat party lackey will Obama cart out to replace her?","post_message":"#MarilynTavenner, the Obama administration official who oversaw the botched rollout of the #Obamacare website, #Healthcare.gov, announced she will resign as head of the agency that also manages the Medicare and Medicaid healthcare programs."},{"comment_id":"10154914956884411","commenter_b":"Agree! The protesters should just chill out, given everything we know about Trump, let's all PRETEND that this will be a normal president or let Murphy's law take its course!","commenter_a":"If you are an American, he is your president. Doesn't matter if you like him or not. I didn't want Hillary, however if she won, I would have still considered her my president. People need to grow up.","post_message":" is our chance to show the world that Donald Trump is not California president and that we are going to take direct action to defend our values, preserve our way of life, and protect our people."},{"comment_id":"666476586876253","commenter_b":"She needs to worry about herself ugly!!!!","commenter_a":"No me jodas... ...","post_message":"Controversial video just leaked that shows what Michelle thinks about white people.  This is extremely offensive. We need to spread this, and show the country she's a racist.  Do you agree Michelle Obama is the worst first lady ever?"},{"comment_id":"666544360165278","commenter_b":"@username, Mexico has a wall on their Southern Border and they swear it has dropped the amout of illegals in their country from Guatemala by 2/3rds. That's 66% less illegals if you can't understand what 2/3rds is. And No, Mexico can't do us more harm, only our Politicians like Clinton, Johnson and Stein can. Don't let them give America away.","commenter_a":"Sadly, we have become a society where protecting borders is not even an issue. It must be done because of the outside terrorists. Then our people could concentrate efforts significantly more on internal ones. I cannot believe I just wrote that. Trust in God.","post_message":"Truth."},{"comment_id":"10155045713159073","commenter_b":"Risking war lol? You do realize that we would utterly destroy Mexico in less than a few weeks. Mexico would never declare war on us.","commenter_a":"We're is your proff..........for this post","post_message":"A wall would do little, if anything, to stop the flow of illegal drugs - the majority of which are actually smuggled though checkpoints."},{"comment_id":"431677547020539","commenter_b":"Filthy muslims ,deport or tag &bag'em .","commenter_a":"That is disgusting.","post_message":"This is disgusting — would YOU want to use a sink someone had washed their feet in?"},{"comment_id":"1137364809637709","commenter_b":"Love you Scotland just stay safe","commenter_a":"Go Scotland ❤️","post_message":"In case you missed it: Syrian refugees arrived in Scotland this week. This is how they were greeted."}]
