[{"comment_id":"1202278743181685","commenter_b":"Lots of estrogen.","commenter_a":"Causation or correlation? Lol","post_message":"Men Supporting Hillary Clinton Have Lower Testosterone"},{"comment_id":"10153486710565779","commenter_b":"You, madam, are an idiot","commenter_a":"Well Bruce would allow a hairy old pervert in the restroom with that 10 year old girl, as long as he thought he was a woman. Let's all go to the zoo, and think we are lions and tigers, and go in their cage to do our business....... See how that works out Bruce. ;)","post_message":"Bruce Springsteen and the E Street Band closed out the U.S. leg of their 'The River' tour at Barclays Center last night with a three-and-a-half hour set that included covers of Prince's \"Purple Rain,\" John Lee Hooker's \"Boom Boom\" and Jimmy Cliff's \"Trapped.\" But it was a 10-year-old fan that provided one of the night's biggest highlights. Watch their performance of \"Blinded by the Light\" below."},{"comment_id":"10154103585977015","commenter_b":"They have ruined these children's life....they should be deported and banned from returning!!! If they return, they should be executed.","commenter_a":"LEAD POISONING BETWEEN THEIR EYES IS THE ONLY SOLUTION ! !","post_message":"Members of a Muslim rape gang shouted  akbar in court yesterday as they were jailed for raping girls aged 11 and 13..."},{"comment_id":"1501291303224228","commenter_b":"@username one of the Deplorables. He quotes Breitbart. You instantly lose all credibility; and can't be taken serious. Here let me fix this for you...... @webpagelink","commenter_a":"Nevermind the Democrats who are actually poisoning the people of Flint, right?","post_message":"“Mr. Trump, I invited you here to thank us for what we’ve done in Flint, not give a political speech,” the pastor said."},{"comment_id":"1002708926488828","commenter_b":"Syrian refugees will be coming in legally. They will be documented and traced. If they wanted to sneak terrorists in the country they could do it through our southern border without much problem. AND they probably have. I would prefer that we only accept families and no single men.","commenter_a":"This breaks my heart","post_message":"If we don't know our history, we're doomed to repeat it.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153531348054740","commenter_b":"I agree you shouldnt have to justify.","commenter_a":"It is sad that so many don't know the difference between real life and tv.....","post_message":"Here's why cops don't 'shoot to injure':"},{"comment_id":"10153824514356336","commenter_b":"Yeah, build a wall. That'll do...uh ABSOLUTELY NOTHING.","commenter_a":"Now build a Wall and Deport the Illegals!","post_message":"BREAKING: In a 2-1 decision, the 5th U.S. Circuit Court of Appeals upheld an injunction blocking President Barack Obama's executive order to protect an estimated 5 million people living in the United States illegally from deportation."}]
