[{"comment_id":"630472157108961","commenter_b":"@username you too bitch","commenter_a":"This is not a man.........he's a crazy kid........wanting notarization. Why not go after Obama who continues to destroy our country and it's citizens!","post_message":"Here is the man who tried to kill Donald Trump yesterday:"},{"comment_id":"1166997406690286","commenter_b":"We also have an excess of employers giving jobs to illegals. So really we don't have an illegals problem we have an employer problem. If there were no jobs to be had there would be no illegals.","commenter_a":"I don't want more foreigner coming in. that is for sure.. but.. there are right now 10 jobs for every man women and child in this country.. way way more jobs than people.. way more.. so..","post_message":"Do you agree with Senator Sessions on this?"},{"comment_id":"957758620983859","commenter_b":"I don't mean to sound rude on the subject but I'm soooo tired of women having kids (multiple times) and complaining about life is so hard for them. Like honestly, if you wanna take cum and get pregnant maybe you should think before just doing","commenter_a":"If you have kids you deserve the struggle. Don't have kids until you feel ready or accomplished enough to bring a new life into the world. If you have kids before the age of 21 then you are a complete idiot and shouldn't get help from anyone cause stupidity isn't worth saving","post_message":"Great point!"},{"comment_id":"1192124507480431","commenter_b":"I will!","commenter_a":"Call Congresswoman Cheri Bustos' DC Office at (202) 225-5905 and tell her to vote NO! on the TPP... The house of representatives will be voting on the measure tomorrow (Thursday).","post_message":"It was a pleasure to meet with the talented young people who are in town with the Illinois Electric Cooperatives' Youth to Washington Tour today!"},{"comment_id":"10153021059601051","commenter_b":"What a cruel woman","commenter_a":"All I can say, is he is better off without her for a mother.","post_message":"This baby's mom decided she didn't want him anymore and had him deported."},{"comment_id":"1202021696499916","commenter_b":"Whos paying her","commenter_a":"as your house comes crumbling down","post_message":"An open letter..."},{"comment_id":"1167878733267392","commenter_b":"Just a worthless pos","commenter_a":"What a loser","post_message":"Unbelievable! Michael Moore is now calling on liberals to disrupt and shut down Trump's inauguration. @webpagelink"}]
