[{"comment_id":"10154061349648352","commenter_b":"Sick woman you are","commenter_a":"He is taking care of both of them and about to marry her so what. If it works for them who cares. And if your in the church every last prophet had more than one wife. Having only one wife is a western and new thing.","post_message":"‘I try not to get jealous’: Pastor, 60 marries his pregnant girlfriend, 19, with the blessing of his wife, 44, with both women to live in different wings of Ohio home"},{"comment_id":"736103763189471","commenter_b":"I hope the police are called for every item he, or anyone else, takes to school that appears to be an explosive device of any sort. Truly Americans can't be this ignorant. Oh, wait! We are! Obama is president and was not only elected once, but twice! For those that truly believe in tolerance and are willing to allow Islam to infiltrate our country, just wait and see how tolerant they are of you, your children, and your children's children when they become the majority. Remember this, Obama is moving in thousands of \"refugees: next year and the current Muslim population is already having children at a much higher rate than the average American family. SURPRISE!!!!!","commenter_a":"No, comments.","post_message":"Of COURSE."},{"comment_id":"10154259788063797","commenter_b":"Omg lol","commenter_a":"@username looollllllll whaaatttt","post_message":"ATTN NEW PARENTS: The perfect solution to a crying infant is every parents dream. One doctor claims he has a technique that can quiet any baby.  WATCH THE FULL VIDEO: @webpagelink"},{"comment_id":"10153184918416336","commenter_b":"never believe this man promise. that's look errr. that's look that can behead you, rape your children and take your wives.","commenter_a":"The face of evil.","post_message":"Abdul Rahman Shalabi, who allegedly served as a bodyguard for Usama bin Laden, went before a parole board to ask for his release so he can marry and have a family."},{"comment_id":"10153424598644726","commenter_b":"Hillary's policies will be like Obama's policies on steroids!","commenter_a":"Hillary is just an echo of Obummer.","post_message":"WATCH: Hillary Clinton says Businesses don't Create Jobs"},{"comment_id":"917056878424478","commenter_b":"#fuckhillary she and the DNC planted this upon us","commenter_a":"#fucktrump","post_message":"Friday, January 20, 2017: Presidential Inauguration of Donald Trump & Mike Pence - LIVE on C-SPAN, C-SPAN Radio & @webpagelink"},{"comment_id":"1213125935366328","commenter_b":"This old hoe has lost her mind.!!","commenter_a":"You can be the first one to be unprotected! Have your security do without their weapons to protect you & Bill!","post_message":"Hillary Clinton, front-runner for the Democratic Party presidential race, heartily endorsed the idea of high taxes for gun sales, along with high fees for gun dealers."}]
