[{"comment_id":"10158042812305551","commenter_b":"I have trouble with Rhinos who profess to be one thing, but are LYING. I have not trusted John McCain for several years. I am beginning to wonder about Marco. Time will tell. As for Hillary and John Kerry, They are trying to destroy what America stands for and that is FREEDOM. Than there is Eric Holder who along with Obama and Clinton, sold guns to Mexico Mafia. Corruption is what WE THE PEOPLE are sick of.","commenter_a":"Trump is right again. John McCain is no war hero and never has been.","post_message":"Two Senators Have a Problem with Tillerson, but not Hillary Clinton or John Kerry"},{"comment_id":"10153943108472042","commenter_b":"Break that glass ceiling girls!","commenter_a":"Media prepping questions for war lmao","post_message":"Do you think women should be required to register for the draft?"},{"comment_id":"916949761698106","commenter_b":"Stupid woman","commenter_a":"she cant find anyone who has a visa already ! ? :O","post_message":"Some women never learn"},{"comment_id":"503579846468637","commenter_b":"Why argue with this man child?","commenter_a":"Remember the outrage over the clock kid? Let us see if libtards and media worry so much about Christians being singled out to die.","post_message":"\" He seemed skittish, always looking over his shoulder to see if anyone was watching.\""},{"comment_id":"1761764947438429","commenter_b":"@username you do realize Hilary wants to deport illegal immigrants too right? She announced it this last week.","commenter_a":"Women should feel insulted that the first female ever to be nominated also happens to be a corrupt, cold, calculating, ruthless, lying crook. If we're going to give the distinction of 'first woman nominee' or, God forbid, 'first woman president' to anyone, she is, quite literally, the last woman in the country who deserves the honor.","post_message":""},{"comment_id":"10154326754201636","commenter_b":"Well I don't think she has that strength","commenter_a":"Can she slap Nigel Farage and Boris Johnson, and get away with it?","post_message":"The incredible powers you didn't know the Queen wields"},{"comment_id":"10152906901509270","commenter_b":"Unreal !!! This makes me sick !!!","commenter_a":"It's just Wrong. Wanna bet the Commander in Chief authorized this crap..","post_message":""}]
