[{"comment_id":"1687846428128746","commenter_b":"What a nice sounding kid.","commenter_a":"Build that wall for America and make it big and strong! Trump 2016!","post_message":"I have built so many great and complicated projects – creating tens of thousands of jobs in the process. Building a wall is A LOT easier than building a 64 story building!  LET'S #MAKEAMERICAGREATAGAIN  www.DonaldJTrump.com/Nevada"},{"comment_id":"1287965734605309","commenter_b":"Fuck Trump. There's my dignity. I'll grab him by the pussy.","commenter_a":"All of you need to remember that you are not in the fourth grade anymore, and that we can actually behave as adults. Cut out the filthy language and the belittling insults. If you have something to say, say it with a little dignity. Also, try to improve your spelling and grammar.","post_message":"Gullible fools...  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152904733026051","commenter_b":"I would love to get my hands on the bitch who wrote that! I'm very sorry that there are people out there like that.","commenter_a":"Key their car","post_message":"A woman asked her neighbor to please avoid parking in her handicap parking spot. This is the letter she got in response."},{"comment_id":"775380562560552","commenter_b":"Your a stupid bitch","commenter_a":"This is the best show on TV. I won't be watching TLC if this is true. We can forgive things stars, football players, and men in charge of our country, but we can't forgive something a 12-year-old boy did. Standing behind the Duggars and praying for them.","post_message":"\"19 Kids and Counting\" has been canceled after Josh Duggar's shocking confession."},{"comment_id":"10153816896676337","commenter_b":"\"Bitch! Now turn the other cheek!\"","commenter_a":"Jesus needs to come back and give this Pastor a firm pimp hand.","post_message":"The Pastor leading the Starbucks red-cup charge got disconnected and laughed at on TV..."},{"comment_id":"10153193077162093","commenter_b":"Women choose their boyfriends over kids all the time. Its only when something bad happens they realize how STUPID they are. If nothing wouldve happened she wouldve kept doing it. Shame it takes something like that to open up some people's eyes","commenter_a":"Skin her and drop her in a lemon juice bath 3 times a day for life.","post_message":"The mom said she desperately wants to be able to go back and make a different choice about leaving the house that fateful day.... @webpagelink"},{"comment_id":"10156823156490594","commenter_b":"I don't want my great-granddaughters going into to bathrooms where males are also present. I'm not talking about transgender; there are sick people that will use that as an excuse to be were they shouldn't","commenter_a":"I never really shopped at Target's, I will now. I'm glad your taking a stand for the transgender population. So sad that people's lack of knowledge or fear make them judge.","post_message":"\"Inclusivity is a core belief at Target,\" said the retailer in a statement. \"It's something we celebrate.\""}]
