[{"comment_id":"665234353646282","commenter_b":"Can't make a silk purse out of a sow's ear.","commenter_a":"#klasssa 👌","post_message":"Do you think the Obamas represented America with class as our nation's First Family?"},{"comment_id":"1777765929177182","commenter_b":"Hillary Clinton is pure evil! Most vile, lieing, thieving, corrupt witch on the planet!","commenter_a":"She lied and lied and has lied about her lies, all the while breaking the law, and half America still thinks she should be president. I would as soon a bank robber or one who had commited treason be president. Her lawbreaking and lying has been such a lifestyle for so long I can't imagine her being president no matter what skunk is running against her.","post_message":"An iconic photograph of Hillary Clinton using her BlackBerry while wearing sunglasses on a military plane prompted an official in her office to inquire about whether Clinton had been assigned a government email address...  The information came out in sworn testimony in a Judicial Watch deposition of Karin Lang, a former State Department official. Please SHARE!"},{"comment_id":"10156102482195615","commenter_b":"State officials are supposed to be non-bias. If she can comply, she can find another occupation.","commenter_a":"You really don't have one KIM!!!!","post_message":"And here we finally have the truth, folks!"},{"comment_id":"10153526289392183","commenter_b":"She is one nasty creature!","commenter_a":"You have nothing to worry about you entitled shill. Your we does not include me. Go Bernie!","post_message":"She's setting up the arguments for the general election here."},{"comment_id":"10154313536616509","commenter_b":"Um, the judge is a republican. But thanks, though.","commenter_a":"Fox news haters will blame muslims","post_message":"A week after a warrant for his arrest was issued, Ethan Couch -- more commonly known as the \"affluenza teen\" remains on the lam."},{"comment_id":"367438390047230","commenter_b":"Devora Sexton and you are a cheap whore","commenter_a":"If a man's children and wife are a measure of him, Trump is a hell of a guy.","post_message":"Another reason Dems are terrified..."},{"comment_id":"10153317110562377","commenter_b":"Illegals work to build the wall with fair pay. They can stay. No brainer.","commenter_a":"They will pay.","post_message":""}]
