[{"comment_id":"1624197824544119","commenter_b":"During the debate season, Hillary Clinton will mop Donald Trump off of the floor and dump him into the sewer with the mop water because she is 20x smarter than he is. She went thru 12 hours of gruesome testimonies with congressional republicans and didn't even break a sweat and was able to squash all of them like cockroaches. On the other hand, Donald Trump choked during a 1 hour meeting with the Mexican President and he choked and sweated bullets while being interviewed by Faux News Megan Kelly.","commenter_a":"Jordan Elum","post_message":"#Repost Ivanka Trump #Instagram ••••••••••••••••••••••••• Smooches from baby Theodore. 😘 #Latergram"},{"comment_id":"10155875894235354","commenter_b":"No one wants to see people in need suffer. But the time has come to stop illegal immigration and deal appropriately with those already here. ENOUGH! Impeach the whole lot of them for putting politics and \"special\" interests before the legitimate interests of the US citizen. COME TOGETHER PEOPLE!!","commenter_a":"dump her now,out of touch with the people,","post_message":"And We Support the Legal U.S. Citizens.   Bring it On, Nancy."},{"comment_id":"692662477538954","commenter_b":"This American Woman supports Trump and I feel more comfortable just thinking about Trump being the POTUS, then I have ever felt the whole time Obama has been POTUS","commenter_a":"As a woman, I wouldn't trust Obama unless I was armed. As a woman, I wouldn't vote for Hillary unless I was voting to send her to the nearest blackhole. Trump is not perfect, by any means. But he's infinitely better than what's currently fouling up the White House.","post_message":"What do you think about President Barack Obama's statements regarding Republican women and Donald J. Trump?"},{"comment_id":"10153564532183984","commenter_b":"@username All immigrants who enter LEGALLY are welcome!! We dont need or welcome ILLEGALS. There is a difference.","commenter_a":"I don't understand good, law-abiding Latinos taking a position against following our immigration law and supporting programs that shelter criminals just because they too are Latino. I would be incensed that my good name and that of my race was being damaged by those lawless usurpers.","post_message":"Donald Trump isn’t backing away from his position on illegal immigration and his disgust for sanctuary cities. These policies endanger the lives of innocent Americans, and they must be put to an end.   Obama needs to rethink his plans for amnesty before more Americans die at the hand of violent illegal immigrant criminals.   Sign the petition to block Obama’s plans for amnesty!"},{"comment_id":"10153257299639071","commenter_b":"@username another Hilidiot who will blindly vote for a woman for no other reason than wanting a female president.","commenter_a":"Let's be honest about this. The only reason they gave back access is because a court battle over this would have revealed to the public that every democratic campaign had access to those records, and when the Sanders campaign reported it, nothing was done. Which would have highlighted not only the DNC favoritism of Clinton, but of the fact that they have been working to shut down Bernie at every turn. Which would have meant public acknowledgement of Bernie actually having a chance to win.","post_message":"Bernie Sanders sued, and the Democratic National Committee backed off, but it's not over yet."},{"comment_id":"10153338017932411","commenter_b":"So the nets they snag your tuna in make those fisher people littler dicks?","commenter_a":"All the idiots who says no different then fishing. Big men that kill nature as sport. Little dicks!","post_message":"The Facebook video of the incident quickly went viral, attracting comments like, “Someone should drag that guy around in the water just for pictures.”"},{"comment_id":"10153809270614454","commenter_b":"Hurrah! Hurrah! Hurrah!!!","commenter_a":"Couldn't happen soon enough. Long overdue .","post_message":"ICYMI: This week, Hong Kong pledged to ban the import and export of Ivory goods. #SaveElephants"}]
