[{"comment_id":"10150935097914999","commenter_b":"no clue what you're talking about?? You're not a woman so sfu!","commenter_a":"No, she's a hypocrite! Have you ever watched an abortion? I have...in 20 weeks it is a baby. In late term abortion labor is induced. The baby's head is delivered. a small incision is inserted into the back of the head the knife is twisted to kill the baby. The brains and skull is crushed.","post_message":"\"Hillary Clinton owned her feminism. She sounded like the first woman running for president, defending other women — our autonomy and our control of our own bodies,\" Emily Bazelon writes in The New York Times Opinion Section."},{"comment_id":"10153903226928797","commenter_b":"She Must Be Mentally insane","commenter_a":"Connie Reyes","post_message":"MOM HAS SHOCKING OUTBURST: The mother accused of killing her two young children and stuffing their bodies in a freezer has lashed out in court after losing her temper. What do you think? WARNING, details in this story are graphic and may be hard for some readers. Here's what mom said:"},{"comment_id":"10153161332178606","commenter_b":"with friends like that who's need enemies! She's just evil.","commenter_a":"Good. She can go to JAIL !","post_message":"Police said a teen had second thoughts about committing suicide, but his friend encouraged him to do so. @webpagelink"},{"comment_id":"905632936170129","commenter_b":"No mames wey pobre jente k vive cercas!!!","commenter_a":"Luis atacko godzila.","post_message":"Huge Chemical Plant Explosion In Tianjin, China!"},{"comment_id":"10152871964481491","commenter_b":"Says the woman whose profile pic looks as if she is in drag!!!! You should never talk about anyone's looks!!!","commenter_a":"Quit posting this, she isn't even a woman, so stop it","post_message":"“You’re too young for a 51-year-old!”"},{"comment_id":"1042887679092881","commenter_b":"Democraps Are The Cronies....","commenter_a":"What bunch of pussys, liberal Socialist progressive cry babies","post_message":"Democrats are staging a sit-in for gun control measures on the House floor, led by Congressman John Lewis. Congressman Beto O'Rourke is streaming the sit-in from the floor @webpagelink"},{"comment_id":"10153420149016350","commenter_b":"Awesome!!!!!!! Congrats to the graduates!","commenter_a":"This is Awesome!!","post_message":"The seniors only took two days to learn the performance!"}]
