[{"comment_id":"10153596460999486","commenter_b":"She needs to be in prison for it!!!!","commenter_a":"Funny how that works for a lying, cheating,sneaky,and generally lousy human being!!! She needs to apologize to the 4 families for their murder in Benghazi!!!","post_message":"Talk about a flip-flopper..."},{"comment_id":"10154377682500575","commenter_b":"She is done. She knows that she can't beat Trump. So she is play the frail feel sorry for me tactic. She is no good for our Country she hates American citizens she hates minority's she is only after fame and fortune from crooked dealings. Drop out of the race Hillary save yourself the embarrassment of getting your ass beat in a landslide.","commenter_a":"What attack in minnasota n when","post_message":"Get this poor tired woman to bed! Hillary looks like she's going to pass out after speech in DC and bombs in New York."},{"comment_id":"10154048392259087","commenter_b":"Mexicans might cross a border but not a fucking ocean.","commenter_a":"\"The Wall\" is just what he said to get racist white votes. You're a fucking moron if you think a wall would be built. Let alone be efficient. There's OTHER ways in!","post_message":"\"We didn't discuss who will pay for the wall,\" Trump admitted."},{"comment_id":"1287096984651728","commenter_b":"A Muslim Communist Terrorist...","commenter_a":"You mean 70% of America? The same 70% that pays the most taxes and fills our military ranks? I'd rather he just said thank you, ate pork and died.","post_message":"Is he racist?"},{"comment_id":"10153362253533132","commenter_b":"Please dont let her walk free like Casey Anthony is walking free. If she wants to kill herself let her. She is not a mother. A mother doesnt kill her children AND take pictures of it!!","commenter_a":"Leah Stevens","post_message":"In the arrest report, detectives reported finding an open journal with an entry addressed \"To My Family.\" According to authorities, Jessica McCarty apologized for what she was about to do."},{"comment_id":"10153797001880329","commenter_b":"This bitch you can order your kid what you want ...she's ignorant as hell I would have whooped her ass","commenter_a":"It was called marcy's diner in maine and this is what the owner posted. Threatening to get physical. She is a dumb cunt. And this is someone from maine.","post_message":"Neugebauer's diner has recently become the center of a massive controversy after she yelled at a screaming child."},{"comment_id":"10153253849621955","commenter_b":"Poor rich spoiled brat she thinks she's and her stupid husband ruthless she no First Lady you wouldn't see Jackie Kennedy acting like her.","commenter_a":"WTF.","post_message":"MICHELLE OBAMA: Emotional toll of being a black first lady..."}]
