[{"comment_id":"1700042326929352","commenter_b":"Right here with my eyes open....much wider than your evidently.","commenter_a":"I just saw a posting with Trump and the same headline....too easy to to photoshop pictures these days. If you remember, bush didn't salute a Marine coming off AF1, as did President Obama....they've all done it at one time. However, I think Obama has been a great job....kept us out of a bigger depression than the big depression the last president create, but Americans have very short memories.","post_message":"Obama Refuses To Salute During The Pledge Of Allegiance [VIDEO].  Hands down the worst president of all time.  Do you think Obama is a disgrace?"},{"comment_id":"1079285898761124","commenter_b":"No woman with an ounce of self respect would vote for a misogynist like Trump.","commenter_a":"Good way to clean out those we don't need in America. Just one more reason for Trump to win","post_message":"A majority of people said they would go to Mexico."},{"comment_id":"10153774397117098","commenter_b":"No!!!! SHE IS A LYING SKANK!!!!","commenter_a":"What the hell? So these dudes were sleeping with their coworker's underage daughter? That is disgusting.","post_message":"#BREAKING...  What we're just learning on KRON News at 5 p.m."},{"comment_id":"1190682247676976","commenter_b":"Hey Bitch you may go to prison after all !!!","commenter_a":"No accountability on behalf of Killary Clinton for the Email scandal Teflon Bill and her remain unscathed in her unsecured private server and passing of top secret state emails, after only a 30 minute talk with Loretta Lynch Bill got it all worked out last week, oh and the FBI director was an Obama employee, how convenient! I bet if she becomes our president she will be protecting the Nuclear codes the same way and making sure her Iranian Aide Huma Abedin knows just where to keep or use them, no worries. Please don't vote for this KILLARY, because our nation can't afford someone willing to sell us out so easily, email scandal, enriched uranium scandal with Russia, Saudi money foundation scandal, Unsecured borders, she will take all your guns, and not to mention Benghazi. Trump 2016","post_message":"Up until now Hillary Clinton has faced a lot of serious charges, but nothing compared to the one that just got brought up.  If this goes through, Hillary's about to get hit with the most serious charge a leader can be accused of.   There's no way the media will let this get out..."},{"comment_id":"10153816352544726","commenter_b":"This dumb bitch deserved it!!!","commenter_a":"I'm sure it was a hate crime right?","post_message":"WATCH: Trooper Orders Woman To Leave Florida DMV, But She Refuses...Then Goes Nuts!"},{"comment_id":"10153240442411336","commenter_b":"incest with goats gross","commenter_a":"Guys u don't know abt islam, islam is one of the most growing religion. Coz every is's true and stay forever. People why insult 1/3 believers' religion? If again repeat such insult of us ,next time you will get ponish bY MUSLIC ACT.","post_message":"Four Egyptian kids who dared make fun of ISIS in a harmless video are headed for trial along with their teacher on charges of \"insulting Islam.\""},{"comment_id":"10154136814559411","commenter_b":"@username how is Rupert Murdoch theses days in sunny oz.","commenter_a":"Valdimir Putin will be proud!!! But this this newspaper is tied to a very sinister movement. Not all papers crytical of the government are shut down.","post_message":"Turkish authorities took control of Zaman last Friday, sales drop from 650,000 to 6,000 a day"}]
