[{"comment_id":"1421875981165778","commenter_b":"I had heard that too but I'm not sure where to pick up meatloaf in D.C. . I wouldn't put it on the taxpayer to feed me at the White House, I just want to have the face to face.","commenter_a":"Invite me for dinner at the White House, I'll say it to your face. For real, I'll even spring for the Kentucky Fried Chicken.","post_message":"Trump sounds off on what he considers fake news: \"A source says that Donald Trump is a horrible, horrible human being. Let em' say it to my face.\""},{"comment_id":"10153218446741051","commenter_b":"she wont care, she has another kid to take her spot. i bet she will continue to see him, and probly get married. sick nasty world!","commenter_a":"That is one sick family hope that mother feels real good abouit that sex, it cost her daughter and grandchild[s life.","post_message":"A pregnant lady walked in on her husband with another woman. When she realized who the woman was, she killed herself."},{"comment_id":"10153321686504091","commenter_b":"They was trying to rob him","commenter_a":"Did anyone notice she looks around twelve?","post_message":"WANTED FOR TWERKING? Two women are being sought for sexual assault after twerking on an innocent man, police say.  WATCH --> @webpagelink"},{"comment_id":"1033066763409083","commenter_b":"Maybe we could stop the flow of heroin coming into the U.S.","commenter_a":"To associate with Hillary Clinton, you are an EMBARRASSMENT to the residents of VA and to the military who live and serve here!! DISGUSTING!!","post_message":"I’ve seen firsthand how significant an impact the opioid and heroin abuse epidemic is having on communities and families in Virginia. More Virginians now die from these overdoses than car accidents, and law enforcement currently lacks the tools to save more lives. I’m pleased the just passed Comprehensive Addiction and Recovery Act (CARA) will encourage co-prescribing of naloxone – a life-saving drug – alongside opioid prescriptions and also implements a measure to protect the elderly from medication abuse. I worked with a bipartisan group of colleagues to draft and introduce these provisions. Lastly, while I am pleased Congress was able to work in a bipartisan way to address this crisis, we should keep working to provide emergency funding that is critically needed for state substance abuse programs, law enforcement, treatment and other priorities authorized in this bill."},{"comment_id":"10156314605160354","commenter_b":"Dems care more about illegals than Americans! Vote all democrats out!","commenter_a":"Here is a list of the DEMS that blocked the vote for Kates Law and to stop Sanctuary Cities.Tweet or Facebook your Congressman or woman.","post_message":"\"With a vote of 54-45, the measure failed to obtain the 60 votes necessary to end debate.\""},{"comment_id":"10153522197479255","commenter_b":"Fuck you, lady.","commenter_a":"This people have been drinking the Kool-Aid!!!","post_message":"Obama is officially the best president the U.S. has had in a long, looong time.  By Daily Kos user PCalith"},{"comment_id":"10157476731040725","commenter_b":"Now get you're head out of his illegal Orange trumpster butt2.. It's over flowing with his B.S for a LIFETiME!!!!!","commenter_a":"This is what I don't understand, Every Trump rally, there are 1000's of people in attendance. Not as many people show up at Clinton rallies. Yet she is ahead in the polls!! Is the media and the poll takers rigging the outcome of the polls?","post_message":"A beautiful evening in Ft. Lauderdale, Florida last night. We need to WIN Florida- so make sure you get out and VOTE this November! I am here all day - attending events -- looking forward to a great day! -DJT"}]
