[{"comment_id":"945825838793990","commenter_b":"nothing but a whore from the sixties.","commenter_a":"Ask her to please go back to Vietnam where she loves it so much .","post_message":"Actress Jane Fonda, who 45 years ago as making the lives worse for Americans fighting for their life in the jungles of Vietnam, is now making lives worse for American energy producers. Given the fight Fonda now has against North American oil discovery and transportation, she has once again aided and abetted the enemy: Islamic oil producers. It seems Jihadi Jane neither understands how her actions are viewed by the enemy (major Muslim oil exporters, some of whose core members want to see the destruction of the United States) nor how these anti-jobs protests impact hundreds of thousands of North American families. @webpagelink"},{"comment_id":"487739541416626","commenter_b":"She is an Ass","commenter_a":"Ann is not afraid to speak out she is a very brave lady","post_message":"This brave woman just called Obama a primate on national television.  She made a huge stand against our president, let's show her our support.  Do you endorse her public defiance against Obama?"},{"comment_id":"868568856511870","commenter_b":"Chuck is right!","commenter_a":"You go Chuck.","post_message":"Chuck Norris puts Hillary to shame!  His liberal fans will hate what he said about her candidacy! But you'll love it!"},{"comment_id":"1104058139606442","commenter_b":"Not a politician but an accomplished business man, with a reputation for getting things done right! he's got my vote and the illegals can build the F-N wall for trespassing and then get their a** on the other side. And all those anchor babys adios amigos","commenter_a":"Why did you cut him off? He was still talking. That's very disrespectful. You do that again and I will unfollow this page.","post_message":"GOP DEBATE  Watch Donald Trump affirm his commitment to not only building a wall on the US/Mexican border, but making MEXICO pay for it."},{"comment_id":"10153786734045329","commenter_b":"Hahahahahahaha!!!! Omg!!!! It's like we're on the Truman Show!!!","commenter_a":"@username!!!! Holy moly!!! Lmao","post_message":"\"If we're still single when we're both 39, can we have babies together?\""},{"comment_id":"1203183663111217","commenter_b":"STFU","commenter_a":"Nothing Mr. Trump does compares with crimes Hillary and obama have committed.","post_message":"A prominent Republican who supports Donald Trump urged the candidate to start acting like “a potential leader of the United States.”"},{"comment_id":"1680894471939506","commenter_b":"Other people need jobs. Quit and you don't draw unemployment. Saves tax payers some money","commenter_a":"Which means 28% of our \"public sector servants\" are actually partisan political hacks. Liberals embedded like ticks. About right.","post_message":"I hope they're mostly from the IRS."}]
