[{"comment_id":"1039059936190258","commenter_b":"That's not what Margaret said, and the fact that you think it was is a pretty clear indication of how little you understand about this and comparable situations, Pat.","commenter_a":"Answering for dead soldiers is abusive? If she can't handle this she's absolutely not fit for president.","post_message":"\"Republicans are squandering millions of taxpayer dollars on this abusive effort to derail Secretary Clinton's presidential campaign.\" - Rep. Elijah Cummings"},{"comment_id":"1677567089166752","commenter_b":"See ya later Bye! Oh and by the way give all the money back that you made from us Americans who made you rich! That wouldn't happen in any other country they would kick her out. Maybe if all the people who doesn't like america would leave, then we would have a better america! I love my country","commenter_a":"Why are you still here??? Please don't wait any longer, you and your racist, hate mongering friends are NOT welcome here!!!","post_message":"Whoopi Goldberg is planning to move out of the country if Donald J. Trump is elected the next president of the United States. @webpagelink"},{"comment_id":"10154236917854726","commenter_b":"Hillary must never be allowed into the White House.","commenter_a":"What about these rides on that billionnaires plane!","post_message":"Media pushes war-on-women narrative against GOP while ignoring indiscretions of Bill Clinton."},{"comment_id":"10154374417982894","commenter_b":"Bitch u real life bitter","commenter_a":"Lol I hope someone run on stage and snatch that prosthetic belly off and expose her lying ass!!!!","post_message":"The Show Must Go On: Pregnant Beyoncé WILL Perform at Coachella...As of Now"},{"comment_id":"10157187236600354","commenter_b":"Feminists need to stage another protest akin to their bra burnings in the 60s. Perhaps a massive Hijab burning in multiple western countries.","commenter_a":"So funny how the media always pushes these anti-Iran stories even though iran is 1000x more secular than our \"allies\" Saudi Arabia... let's hear about how many women Saudi Arabia executed breitbart. Stop the Iran propaganda pieces, you're turning into another Fox News.","post_message":"When will feminists take on the REAL \"War on Women\"?    “...promote immoral and un-Islamic culture and promiscuity...”"},{"comment_id":"10154324391116336","commenter_b":"This lady is nuts! His mom just died.","commenter_a":"Whoah not cool. The judge must have seen something he didn't like. :(","post_message":"Amber Heard was reportedly granted a temporary restraining order against Johnny Depp."},{"comment_id":"764904010309446","commenter_b":"RBG.. ALL DAY NOW","commenter_a":"When it's American soil , it'll be be armed patriots push back Muslim insurgents ,,, the main steam news will not say so ,, but we the people will !","post_message":"Coming to America soon compliments of Barack Obama."}]
