[{"comment_id":"1181787745189978","commenter_b":"Lock her up","commenter_a":"BULLSHIT!!!!!","post_message":"******BREAKING NEWS******  Finally!!"},{"comment_id":"1037202013040797","commenter_b":"@username oh go screw yourself you ignorant idiot i could care less about what you think ....arrogant pig","commenter_a":"Just goes to show what kind of trash is on trumps payroll he is nothing but a pig and so are his delegates OPEN YOUR EYES PEOPLE he is nothing but a piece of crap","post_message":"The Trump campaign said the man will be replaced immediately."},{"comment_id":"10153279474011680","commenter_b":"She's fat","commenter_a":"Hot daughter, John","post_message":"The daughter of Sen. John McCain, who picked Sarah Palin to be his running mate in 2008, said she was specifically pained because of Donald J. Trump's past remarks about her father's prisoner-of-war status in the Vietnam War."},{"comment_id":"857055204364524","commenter_b":"Just proves that he's good at beating up women too. And it's probably more fun since the women can't punch.","commenter_a":"Manny is no angel","post_message":"Floyd Mayweather has been charged with domestic violence on six separate occasions, convicted on five of those charges and has only served two months in prison, never receiving any penalties from the Nevada Athletic Commission regarding his professional boxing career."},{"comment_id":"1203183663111217","commenter_b":"STFU","commenter_a":"Nothing Mr. Trump does compares with crimes Hillary and obama have committed.","post_message":"A prominent Republican who supports Donald Trump urged the candidate to start acting like “a potential leader of the United States.”"},{"comment_id":"1014939015229294","commenter_b":"Then stop importing Muslims.","commenter_a":"Brought to you by liberal idiots like Billary and Obummer: @webpagelink","post_message":"All our prayers are with the people of France. We must stand side by side every step of the way with France and our allies around the world to wage and win the struggle against terrorism and violent extremism.   Even after this darkest night, Paris remains the City of Light. No terrorist attack will ever dim the spirit of the French people or our common commitment to the democratic values we share."},{"comment_id":"10152703657281051","commenter_b":"This woman is clearly abusing the system!","commenter_a":"Christine I enjoyed reading your comment I too came from a family of 11 I'm number 10 my daddy was the sole provider he injured himself and was off of work for a couple of months my mom said they had to get assistance which was very hard for my father when he returned to work he paid every cent back its funny how people can respond so quickly maybe we should just pray","post_message":"This mother of 11 lives almost entirely off government benefits. Last week, she announced some big news."}]
