[{"comment_id":"493465740841719","commenter_b":"Good I will not go there!!","commenter_a":"I wont be there so shove your coffee and other product up your big rich white ass","post_message":"Should we boycott now?"},{"comment_id":"949813105041545","commenter_b":"Yes cuz girls are such disappointments. SMH.","commenter_a":"3Girls.....maybe a son in the future","post_message":"“I Am Up Every Three Hours With The Baby.\" Ludacris On Diaper Duty With Newborn, Cadence"},{"comment_id":"10153118499596955","commenter_b":"Hemlock, anyone?","commenter_a":"These stories are being given as some form of programming... The nation was taken over and completely changed post Lincoln and forever altered for the globalists post JFK... If they want to move a major agenda forward they throw the nation off by creating spectacular distractions... This is subtext leading to a possible grand piece of theater.","post_message":"'Drunk' Secret Service agents disrupted bomb probe..."},{"comment_id":"10153695954333984","commenter_b":"Carly should be in the prime time debate","commenter_a":"We need a female leader on that stage who isn't whining \"i'm so week and gutless I need a man or goverment to get me better pay and by my birth control for me.\" A real grown up woman who can take a blow and still be standing. Go Carly go","post_message":"Despite a pretty big poll surge, this 2016 Republican candidate may be kept off main debate stage again...  Do you hope to see Carly Fiorina in the next debate?"},{"comment_id":"579776192190480","commenter_b":"Leave now bitch","commenter_a":"Good Bye.","post_message":"Whoopi Goldberg Says She Might Leave The Country If Trump Is Elected. Well I guess she's going to say goodbye. Will you happy to see her go?"},{"comment_id":"723350911147017","commenter_b":"All this after making remarks that all Mexicans are criminals and rapists and we need to isolate ourselves from them by building a wall between the United States and Mexico at the expense of the Mexican Government. Then hiring undocumented Mexicans to work in his hotels and casinos with no unions to represent them, offering to compensate them under the minimum wage, then refusing to pay them. Now, trying to entice them into voting for him? Unbelievable!","commenter_a":"Say whatever?","post_message":"This should go over good with the GOP! ~Kay"},{"comment_id":"970690569690664","commenter_b":"Good luck... Whomever the bitch was that reported my post. Truth hurts don't it troglodyte?","commenter_a":"Am I the only one to realize that all of these mass shootings are done by men?","post_message":"America's easy access to guns almost led to another devastating tragedy..."}]
