[{"comment_id":"10158146730430354","commenter_b":"@username pay up bitch @webpagelink","commenter_a":"No way. Not a sanctuary city.","post_message":"***BREAKING***"},{"comment_id":"10154263730768271","commenter_b":"Perhaps MaryAnn Kosimko would like to be grabbed by the pussy too and go to war while she's at it... what ever you're smoking STOP...","commenter_a":"Yes! We need him for president! Strong! Cares for this Counrty. He's not doing this for the money- he has Money. He can't be bought!! ( not like some one) He is doing this because he wants to make American strong. We have been brow beaten for 8 years. I'm tired of that, aren't you? We need to be Strong and Proud of who we are: Citizens one a great country. We need Trump as our Leader. We don't won't a dictator.","post_message":"JUST IN: Donald Trump will hold a campaign rally in Denver Saturday night as the cherry on top of a busy week in Colorado politics, filled with visits from both major campaigns."},{"comment_id":"10152797676794753","commenter_b":"Typical female.","commenter_a":"He replies.. \" sorry Hun I forgot u said light toast not dark. My bad not happen again\" lol","post_message":"A solider at Fort Bragg in Fayetteville, North Carolina, tried to bring his wife a surprise breakfast in bed Friday morning, but things went terribly wrong."},{"comment_id":"10153197747769094","commenter_b":"He doesn't shoot them for 30+ seconds.... You have to go out of your way to watch it.","commenter_a":"I made the mistake of watching the video from the shooter as he committed these awful murders. I wish I could take back watching that.","post_message":"Video of the fatal Virginia shootings shocked users of Twitter and Facebook when the “autoplay” function showed them what they didn’t want to see. @webpagelink"},{"comment_id":"573913712787669","commenter_b":"Yada, yada, yada. This woman(?) Is so full of BS she makes me ill.","commenter_a":"Get over it!","post_message":""},{"comment_id":"10153799805727623","commenter_b":"They need to be handcuffed at all times !","commenter_a":"Now report how many inmates are killed by correctional officers every year","post_message":"4 correctional officers are assaulted at a North Carolina prison:"},{"comment_id":"10158014853220594","commenter_b":"Mariah Neu and @username. You both say the state of Illinois has lax gun control. In the city of Chicago, not the state of Illinois gun crime very high and so is gun control. Now to my point about Chicago and how gun control affects crime. It is stated that affectguns are imported into the city and these guns are used in the crime. If close carry by law abidi ng citizens was allowed in the city then law abiding could and would protect themselves. It should be of no surprise to anyone that a thug will not follow the gun law, but common citizens will. Gun control laws don't stop crime they just reduce the law abiding citizens ability to protect themselves. You folks use data about the state of Illinois, that has nothing to do with this discussion. Do a comparison of the city of Chicago and the ...","commenter_a":"As is often the case Oreily misses the point, the elites left are the the white spremest. The left just plain want control of all our lives. Taking all freedoms starting with gun ownership","post_message":"The Fox News anchor drew criticism after he said liberals' call to abolish the Electoral College is \"all about race.\""}]
