[{"comment_id":"1323559051002906","commenter_b":"YOU CAN'T TAKE OUR RELIGION AWAY FROM US.","commenter_a":"Keep it. Just don't use it when class is in session.","post_message":"Teacher Demands Christian Boy Surrender His Bible, He Says No, See What Happens Next Good for him. Let's show this young Christian our support. Can we get 30,000 'LIKES' for his refusal to surrender his bible?"},{"comment_id":"10153533564596438","commenter_b":"This is why people are turning against feminism. Jeremy makes a legitimate point, and everyone attacks him because they don't like what he has to say, but he is totally right. Women like her don't need to have a victim mentality because she is more successful than the majority of men on this planet. Victim playing just holds people back and places limits on you before you even get started. Why not go out there, be confident, and refuse to let anything keep you from achieving your goals?","commenter_a":"Wealthy ladies are almost never feminists in actuality. They'll say they are because they need to in order to keep up a certain facade. But they've proven that women are able to be (more) successful and that most of the BS spouted by modern feminism is just that. It's not like someone's political views should matter anyway for the most part. Celebrities are human too.","post_message":"Marion Cotillard says she's not a feminist. Should we care?"},{"comment_id":"10155997067345354","commenter_b":"Hopefully, Palin and her Carnival Midway Freaks family will return to obscurity soon. Surely she's spent all the money she collected for running for political office by now.","commenter_a":"China is killing us just like Donald Trump said, and our country's leaders do act like that are stupid who are only interested in staying in their cushy jobs in Washington DC, and who keep lying to the American people about race, gender. And all the other social things that will distract the American people from really noticing that your country's Government is crashing our country's economy. And that the media is playing hand and glove along with the Washington DC establishment of both political Parties. Because the media likes their cushy jobs also, and really don't want to change how our country is run, for no reason. So we the American people Ladies and Gentlemen were always on our own and we just never realized how bad these guys were, and simply trusted in the wrong people. Who would believe that all three branches of our country Government Institutions ...","post_message":"“It is such a sham business. This BS of them touting all the medical services they provide women and the free healthcare–They don’t provide all these services.\""},{"comment_id":"10152631358675779","commenter_b":"He's hip pop. And of course they do numbers most ppl think the radio is all there Is to offer. And I'd say 3 ouuta 4 drake fans r girls. Drake can go hard but he chooses not to cuz that don't sell albums to women...so instead he's like \"long as my bitches love me\" lol","commenter_a":"It's funny how people who don't like hip-hop or don't like Drake's music post derogatory comments .If you don't like it don't post it,I think music like Young Thug(or when Gucci Mane was hot) & HALF of what I hear on the radio is trash lyrically but perfect for a party,but I don't sound off on it b/c the numbers that these songs/mixtapes/albums do,speak for themselves regardless of what we as neigh-sayers,b/c it's not our cup of tea,may say about it.Although I am biased to Drake's music,I love music period so why don't we all just take a lil advice from a19 year old(myself) & actually be grown about what we post instead of being ignorant cause honestly,8 times out of 10,nothing we say is taken into major consideration by the famous.In the words of Kevin Durant,\"Why do you tweet?\" lol...dang","post_message":"Is it an album? Is it a mixtape? Who cares? The 17 tracks Drake released at midnight last Thursday hit harder and hold together more cohesively than most big-budget event albums. Click through for our full review of ‘Too Late.'"},{"comment_id":"10153847356156162","commenter_b":"It's sexual assault by two nasty woman....!!","commenter_a":"Working for tips...","post_message":"WANTED FOR TWERKING: Two women are being sought for sexual assault after twerking on an innocent man.  WATCH -->@webpagelink"},{"comment_id":"10154087182591409","commenter_b":"@username Michelle had to keep her legs closed or her dick would fall out!","commenter_a":"Lisa erikson just because Hillary hasn't been charged and found guilty doesn't mean she's not. She's a liar and as crooked as Obama and Michelle on many levels. Keep lying to yourself.","post_message":""},{"comment_id":"10155021805082501","commenter_b":"He's a Big joke andhorrible mouth. When General's don't approve of him how can YOU?","commenter_a":"Your headline should be Duck Femocracy. The DC elite do not get to elect our President.","post_message":"Ted Diadiun: We are on the precipice of a catastrophic national political decision as we prepare to elect our 45th president."}]
