[{"comment_id":"10153777739548690","commenter_b":"But the don't need people like you black monkey","commenter_a":"Long live Israel long live the Jews... I just wish i was an Israelite so i can walk into the occupied west bank and tell those occupying Muslim extremist that God gave that land to the Jews... Jews fight for their right...i love the Jews with my life. God bless Isreal.","post_message":"Inside Story: Israeli government leaders have repeatedly said they don't want changes at the Al-Aqsa Mosque in Jerusalem.  Israel is also accused of funding groups advocating major changes to who can pray at the sacred and sensitive site in Jerusalem.  What are the implications of Israel action? And with growing discontent in the occupied Palestinian territories, is it a recipe for more unrest? @webpagelink"},{"comment_id":"575299862633901","commenter_b":"@username if he just fired all the illegals that work him would be a start. And then send the visa people back home and hire american . But as we saw with romney they like chinese workers.","commenter_a":"Trump says Bernie should tell his followers to stop the violence....I damn near dropped my phone when I read that","post_message":"Tell him, Bernie!"},{"comment_id":"870555189755929","commenter_b":"Fuck that! Teach those fucks the appropriate way to interact with us.","commenter_a":"POLICE=Political.Oppressors.Lynching.Innocent,Citizens.Everywhere.","post_message":"Thoughts?"},{"comment_id":"554388108092251","commenter_b":"Merry Christmas to you and your family","commenter_a":"GOOD+++","post_message":"May your Christmas be filled with happiness and hope. Let us not forget the women and men overseas protecting our freedom. Merry Christmas from my family to yours."},{"comment_id":"10153259409494060","commenter_b":"Having engaged in a few discussions on the subject of party politics, I think the results of this quiz might suprise some of you. Go on give it a go.","commenter_a":"Could be good if it was resposnsive!","post_message":"Attention all eligible Britons! Not sure how to vote in this year's election? Take our election quiz: a blind test of the parties' policies. Then get yourself to a booth on May 7th @webpagelink"},{"comment_id":"10154228017338797","commenter_b":"Girl I'm glad u werent","commenter_a":"@username @username this actually happened at my job","post_message":"FLAP OVER FLAPJACKS: A Chicago woman has been arrested after police say an argument over all-you-can-eat pancakes got out of hand at Denny's."},{"comment_id":"10152821064059342","commenter_b":"^ they just don't have enough self control to keep from raping a woman unless shes covered apparently.","commenter_a":"Why do we have a muslim Capitol day?","post_message":"FBI RESPONDING TO MUSLIM CAPITOL DAY THREATS: Organizers say demonstrators are expected to protest against Thursday's rally. A spokesperson said the event began in 2003 and has never drawn opposition before, but this year online threats have prompted the council giving event to contact the FBI."}]
