[{"comment_id":"10153789765316770","commenter_b":"All for it don't need to spend our hard earn money on racists black bastards that haven't Done anything for our country America ! ! ! But disrespect our American laws our American Flag and our national anthem along with discriminating against white Americans and our American Veterans","commenter_a":"Boycott all nfl games and their sponsors.","post_message":"If they thought their fans would blindly go along with any insult to their country, they were sorely mistaken..."},{"comment_id":"619138891610023","commenter_b":"that alright. She can just leave the white","commenter_a":"Just shut up","post_message":"Michelle Obama wants America's sympathy for all that she has to put up with.  Nobody cares. What a joke.  Do you agree Michelle Obama should keep her mouth shut?"},{"comment_id":"10153601498992383","commenter_b":"Well your opinions are wrong, ladies! What kind of military expertise do you have besides \"my husband served?\"","commenter_a":"this is getting way out of line.second marine shot at a shooting range at Camp pendleton?","post_message":"Our thoughts are with the family and friends of the Marine."},{"comment_id":"686618911486884","commenter_b":"Does this arbitrary terrorism not offend a large number of your customers, therby, justifying, really justifying firing such a dumb asshole?","commenter_a":"How much do he makes,","post_message":"This might be the worst CEO in the country and no, it’s not Papa John this time."},{"comment_id":"10155384146056509","commenter_b":"You have to be a goddess first.","commenter_a":"There are no emojis that look like me either... When will Apple give a goddess as an option","post_message":"She couldn't find an emoji that looked like her, so she took it upon herself to make it happen.  Meet the 15-year-old that brought the hijab emoji into the picture @webpagelink"},{"comment_id":"10153211085979087","commenter_b":"I am not afraid and I know no one who is. Though I support you Dr. Carson, you are wrong. Close the border to Muslims until we can sort all this out. Israel has it right, they profile and so should we.","commenter_a":"So I on board.","post_message":"\"We are losing this war while America looks and feels afraid at home,\" Dr. Ben Carson writes in an op-ed for The Hill. \"By the jihadists’ measure, they are winning. They have changed our country, created a republic of fear and, as Osama bin Laden predicted, his enemies are destroying themselves.\""},{"comment_id":"10153843036548984","commenter_b":"She should be in jail!","commenter_a":"Not more than the parents and siblings of the fallen, you arrogant wench.","post_message":"Hillary Clinton was already in a tough spot at the Benghazi hearing. Then she went and said this sentence and buried herself even deeper...  Do you think Hillary should be held accountable?"}]
