[{"comment_id":"10153651600041323","commenter_b":"Because she's British William!!!!","commenter_a":" for rent for the big fat cunt to have axcess to a private pool what other perks did the rest have its just away of mugging the goverment and dickheads for money charity begins at home.","post_message":"“I’m a mother. My heart bleeds. Just because we live in a poor area. Is this what they want to do with us? The government don’t care. Nobody will listen. They don’t care about us. Only God cares.”  It is six weeks since Kids Company abruptly closed its doors; since then several inquiries have been launched but little has been heard from the people who once relied on its services."},{"comment_id":"10154177685016943","commenter_b":"Quit talking about it and do something! Put her in jail!","commenter_a":"Enough already with the disclosures. I'd be happy with just one little indictment.","post_message":"Hillary Clinton has taken a beating this month over the discovery that donors to her family charitable foundation received special treatment from the State Department when Clinton was secretary of state. And she unlikely to get a reprieve before Election Day, as the organization behind those email disclosures expects several more headline-grabbing document dumps in the next 11 weeks. - via Newsweek"},{"comment_id":"1222107054548141","commenter_b":"Fucking weird bitch","commenter_a":"@username @username wdf","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"},{"comment_id":"10154375945924749","commenter_b":"The man is a afgan veteran , a marine and a Muslim. I am a Hindu and I know , Imran name does not exist in us.","commenter_a":"Two Muslim brought up in America one killed 50 and the other saved over seventy, both are Muslim , it is not Islam, it is the illness inside each of us.","post_message":"Imran Yousuf decided to “take a chance” and it paid off."},{"comment_id":"1044665095680389","commenter_b":"Women wouldn't exist without men we build your houses your roads your public offices we farm the food etc etc shut the duck up ungrateful twat your couldn't survive 2'days in the wild without a man to hunt or scavenge for you","commenter_a":"I love this. If a man posted a picture of a cup that said \"tears of women\" or some other bullshit these women would be up in arms. Ridiculous.","post_message":"so this I guess is a thing now???-mo  Shop.tacticalshit.com"},{"comment_id":"10152756027891051","commenter_b":"Let your women drive already !","commenter_a":"Its a respect and courtesy issue in a foreign culture. It doesnt hurt to put a scarf on her head. They arent asking her to put on a Burqa","post_message":"People in Saudi Arabia are livid with Michelle Obama for one very specific reason."},{"comment_id":"10152858682652411","commenter_b":"She should have been tazed!!","commenter_a":"I don't condone what the the officer did but the situation would've been completely different if the little brat did what she was told.","post_message":"Breaking News: The police officer whose video-recorded actions at a North Texas pool party have drawn national attention and comment has resigned from the police force."}]
