[{"comment_id":"1285345191558532","commenter_b":"She is the Bitch.!","commenter_a":"love Hillary...Kill Babies.... $$$$$%","post_message":"The star actress makes an excellent point.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1062386963799539","commenter_b":"@username Much like one refinances one's house at a lower rate. Sure sounds Republican to me.","commenter_a":"And this political cartoon shows why he should. Personally I'd prefer that he wait and allow a Democrat president appoint him to the Supreme Court.","post_message":"Does this about sum it up?"},{"comment_id":"1879145055641043","commenter_b":"I bet her husband can't wait to their son Ben turns 18 so he can leave this psycho b****","commenter_a":"She went from 102 pound to 104 pound woman in a matter of minutes. Proves that she's full of shit and gaining.","post_message":"I bet she has at least seven cats.   -Admin Rick Birdsall"},{"comment_id":"10153798240092869","commenter_b":"Leave this woman alone . A human life always comes first ....","commenter_a":"I disagree raising children is a great responsibility and absolutely no one is perfect that is why we have axcidents. The zoo done what had to be done at the time they were not aware that a child could get into the cage or I'm sure it would have been fixed","post_message":"Cincinnati Zoo keepers had no choice but to kill a gorilla that might have harmed a small child that somehow got into its enclosure.  But the Internet has been lit aflame by animal lovers furious at the parents for allowing the situation to happen.  They’ve reportedly received death threats and demands that they be prosecuted.     But animal expert and TV host Jeff Corwin points out that it’s nothing new.  One study showed that 42% of deaths and injuries from captive tiger attacks involved visitors, many of them kids, and not zoo keepers.  He has an important message for all zoo visitors, especially parents:    “When you go to these places, the zoo is not your babysitter. You have a responsibility.”   I wonder if our constant immersion in TV, movies and virtual reality is making people forget how to behave in “real” reality. The same obliviousness that allows people to yak on cell phones in Broadway theaters just as if they’re sitting at home in front of their TVs is also leading them to assume that real zoo animals are no more dangerous than those in a video game.  In real reality, you don’t get to press the Reset button for an endless number of lives.        Read the full article for some possibly life-saving tips for your next real trip to the real zoo."},{"comment_id":"991088854247496","commenter_b":"It's about time we had somebody who will stand up and speak the truth!","commenter_a":"Who determines what is Polically Correct? The liberals trying to manage free speech.","post_message":"WATCH: The Donald gets into a heated exchanged with a member of the PC police at press conference."},{"comment_id":"909598592517510","commenter_b":"what a load of crap get off facebook,snapchat,instagram, pintrest,tumbler and go to sleep before 1am then see what happens and u are up at 630 because it u move so slowwwwwww be organized :) and btw u start at 9am","commenter_a":"@username Dannii Leask","post_message":"We might as well be sending teens to school in the middle of the night."},{"comment_id":"10153431181609497","commenter_b":"Get rid of her for your own future. You can never be president if you only eat pizza.","commenter_a":"Dad's girlfriend orders pizza every night.","post_message":"\"One time, she even let us get cheesy bread and watch an R-rated movie.\""}]
