[{"comment_id":"1035291306577703","commenter_b":"Science does trump random personal stories. (pun intended)","commenter_a":"I live in Savannah Georgia the South Carolina border is 10 mins away from me, 9 out of every 10 people I meet regardless of sex color sexuality or background supports trump, most support him silently they are not going to run around screaming that they support trump they are not participating in polls their voices will be heard at the ballots","post_message":"Hillary Clinton and Donald J. Trump are tied in South Carolina according to new polling. Rachel Maddow breaks down the surprising development.  More analysis on the latest polling from The Rachel Maddow Show: @webpagelink"},{"comment_id":"992656437438363","commenter_b":"Ban cars and booze. They made her do it !!","commenter_a":"The amount of unregulated stupidity shown by this younger generation is just absolutely astounding. It just blows my mind bravo idiots bravo","post_message":"Police couldn't believe what they were watching unfold live:  “After 30 years of law enforcement I hadn’t seen anything like this before.”"},{"comment_id":"931492536967525","commenter_b":"Lying BITCH...who only worries about her bank acct....NOT...American LIVES. She can't even control her Husband. Good thing he keeps Monica handy.","commenter_a":"Liar","post_message":"ClashDaily.com"},{"comment_id":"10153721427574753","commenter_b":"Devious nasty man woman. Ugh","commenter_a":"1 she is a man...2 who cares","post_message":"Caitlyn Jenner just competed in her first golf tournament where she played as a woman. Jenner has always loved golf and this didn’t change when she transitioned. For some reason, it just took this long for her to do a tournament. ET Online shared the details of Caitlyn’s recent golf tournament. Jenner was in the ANA Inspiration Pro-Am in Rancho Mirage, California, on Friday morning and she played alongside former U.S. soccer star Abby Wambach. Caitlyn did a great job on the golf course today... @webpagelink"},{"comment_id":"10153517502611770","commenter_b":"She should give all her money away","commenter_a":"What an idiot","post_message":"You can't make this stuff up, folks."},{"comment_id":"10154704981818812","commenter_b":"Shut up Ayesha","commenter_a":"NBA is rigged!","post_message":"U.S. men's basketball team earns gold for third consecutive Olympic Games and the sixth time in seven tries with NBA players."},{"comment_id":"1130843966969767","commenter_b":"Good keep them there and deport them","commenter_a":"Like packs of hyneas.","post_message":"UNREAL! SOMALI MUSLIMS RAMPAGE Through Mall Of America In Minnesota...10 Arrested [Video]"}]
