[{"comment_id":"10154345626992549","commenter_b":"First off Executive orders are largely symbolic. Building a wall will do absolutely nothing for illegal immigration and drug trafficking other than to satisfy the small minority of Americans who voted for Trump. The tax payers will have dole out billions to build this \"wall\" without benefit. You can't even call this a viable \"infrastructure\" project. I do agree with deporting illegal criminal offenders and would go even further by deporting criminals with legal but non-permanent status. Not only from Mexico but anywhere. Ireland, Israel, Africa, etc...","commenter_a":"Isolationism does have consequences.","post_message":"This afternoon, President Donald J. Trump is expected to order the construction of his long-promised wall along the U.S.-Mexico border and take other executive actions on immigration. @webpagelink"},{"comment_id":"10152945892703855","commenter_b":"Quit being such a pussy.","commenter_a":"Sigh, more attacks on a man having an opinion and not actually insulting anyone. Give up. I guess you can go back to endorsing Prep.","post_message":"We all get it from time to time."},{"comment_id":"10153876614269024","commenter_b":"Kick this fucker right in the mouth","commenter_a":"What a poor excuse for a Mayor.","post_message":"@conservativebyt"},{"comment_id":"10153364798139877","commenter_b":"Robin! Amen! Everybody wrong for agreeing with that old woman!","commenter_a":"She is so wrong , she is not the Pastor nor is she the head of the Church. So far out of place in the Church , just because you put in a offering or your family started the church its not your church nor are you the Pastor. Dang shame! Guess she wants to go to hell in a hand basket.","post_message":"103-year-old woman who was kicked out of her church clapped back...now the pastor is in hot water. Watch what happened next below.   Grio fam, we're glad she put up a fight. What's your reaction?"},{"comment_id":"992170134153660","commenter_b":"She is a nasty, vile woman...","commenter_a":"What about the part where it was not illegal to have that information on a private server you could have debunked it as well","post_message":"\"Ahead of the #DemDebate, this is the video Hillary doesn't want you to see.\" - Reince Priebus."},{"comment_id":"10153363808198010","commenter_b":"How do we know the restaurant would go out of business anyway? It happens all of the time. I live in Seattle and the rate increase is just slowly beginning to take effect. No conclusions of this sort can be made.","commenter_a":"In Seattle where they just raised minimun wage to $15 a hour some restaurants are now going out of businss as restaurants are having to pass on to their customers a lot higher prices for the food they serve.","post_message":"An L.A. City Council committee has endorsed a hotly contested plan to raise the citywide minimum wage to $15 by 2020, up from the current $9 an hour. The proposal now heads to the full city council."},{"comment_id":"867378403371198","commenter_b":"Yes, women WILL vote for Trump!","commenter_a":"Mr. Trump, I was at the State Assembly wearing my red Trump \"Make America Great Again\" ball cap. People actually stopped me to tell me I am the first woman they have met who supports Trump. When people tell me that women won't vote Trump, I tell them \"intelligent women will\". Incredible.","post_message":"The people of Colorado had their vote taken away from them by the phony politicians. Biggest story in politics. This will not be allowed!"}]
