[{"comment_id":"1080901341949487","commenter_b":"She let them die","commenter_a":"Donald Trump for President 2016! Make America great again and will work for FREE!","post_message":" Obama administration and Clinton officials hid this compelling Benghazi email for years, said Judicial Watch President Tom Fitton.   The email makes readily apparent that the military was prepared to launch immediate assistance. The fact that the Obama administration withheld this email for so long only worsens the scandal of Benghazi. Please SHARE!"},{"comment_id":"10153904097708984","commenter_b":"She's an American. Deportation isn't an option","commenter_a":"DEPORT THIS TRASH","post_message":"She's the biggest female star in Hollywood right now, and she just made a sickening claim about Christians and the cross of Christ.  This is just disgusting.   She has a new movie out. Let's make sure she doesn't make a dime off of us!"},{"comment_id":"10155634882296509","commenter_b":"@username. Get the hell out of my country crybaby","commenter_a":"Do we have to tell President Cheeto not to \"grab her\" ? Someone might have to tell him. I can't believe this is our reality now. Ugh. Sorry world. :-(","post_message":"The British government is considering whether to invite President-elect Donald J. Trump to the UK for a state visit in 2017."},{"comment_id":"10153409033281833","commenter_b":"How is it racism the mulford act wasn't supported by the nra?","commenter_a":"In the 1960's when the Black Panthers were arming themselves and encouraging inner city blacks to arm themselves as protection from the government the NRA was an active advocate of gun control....and then they found they could make more money arming back woods, uneducated white guys. @webpagelink","post_message":"Amid a surge in violence in Milwaukee, the Republican-controlled Wisconsin Senate voted to repeal a state law that requires a two-day wait for handgun purchases. Just before the April 21, 2015, vote, the author of the bill, state Sen. Van Wanggaard, made this waiting-period claim: \"There no statistical evidence that it reduces violence whatsoever,\" the Racine Republican declared."},{"comment_id":"10152742631486680","commenter_b":"Go Hillary ! Fun to watch these morons head explode!!","commenter_a":"Although I'd love to see a woman president, the very last thing we need is a career criminal like Hillary Clinton (who's currently in violation of Article VI of the Constitution) . She's proven herself time and again to be both incompetent and dishonest. She has no new ideas, and will continue to push Obama's tired old routine of increasing taxes, not for the domestic good, but so that we can send billions to Iran, Iraq, Pakistan, Afghanistan, Egypt and Israel. I would like a President who puts America first, for a change. The only candidate I've seen who shares these sentiments is Rand Paul, and he deserves my vote. By the way, many people are unaware that Obama's Democratic administration added $1.3 trillion in new taxes to small businesses, which lowers both wages and job creation. If you love America, vote Republican.","post_message":"Opinion: When Ayatollah Khamenei speaks, it pays to listen."},{"comment_id":"10153087493924641","commenter_b":"Castration ? Wicked ladies always love that","commenter_a":"Rape cases are very high in India....those men need castration","post_message":"India has banned a controversial rape documentary. Are they protecting women or restricting free speech?"},{"comment_id":"1273581186010307","commenter_b":"Shut up bitch","commenter_a":"I wonder what u yank heros would do if a dog attacked u?? That's right, each and every one of u pussies would take out your big tough guns and shoot it!! You're all cowards who hide behind guns so don't blame the cops for doing their jobs","post_message":""}]
