[{"comment_id":"10153663985481509","commenter_b":"Americans don't know half the stuff the government does.","commenter_a":"Loose lips don't sink ships anymore or what?","post_message":"The U.S Air Force's 'secretive space plane'... what exactly is it? CNN Rachel Crane reports: @webpagelink"},{"comment_id":"1648860662067713","commenter_b":"Why doesn't that useless cunt step in front a speeding train??","commenter_a":"Rosie O'Donnell is against guns, but it's ok for her body guard to carry one to protect her!!! Crazy!!","post_message":"YES!  This is why we love you Tom Selleck."},{"comment_id":"1214601541965192","commenter_b":"Y don't y'all go look up great migration n u do kno all white ppl ain't rh+ either meaning not descended from monkeys smh ignorance at its finest pick n choose shit to push ur retarded ass agenda","commenter_a":"Awesome. Teach them early. I'd rather my kid learn to hunt and survive than play on a phone or tablet all day.","post_message":"How do you feel about this?"},{"comment_id":"609058575939393","commenter_b":"Not only is she a bigot but she is a lying murdering greedy bigot!!!!","commenter_a":"NO HIL LIAR EE!!!!!","post_message":"Join me in MISSISSIPPI for a few minutes! It is time to MAKE AMERICA SAFE AND GREAT AGAIN!"},{"comment_id":"1759075771038433","commenter_b":"@username...No evidence??? HOW ABOUT 4 DEAD AMERICANS.... HOW ABOUT ERASING YOUR EMAIL TO HIDE IT, WHEN ASKED...HOW ABOUT MISHANDLING TOP SECRET INTELLIGENCE... THAT'S ALL BEEN PROVEN. .. YOU CAN'T PICK AND CHOOSE....YOU CAN LEAD A HORSE TO WATER, THEN HOLD HIS DAMN HEAD UNDER, UNTIL IT QUITS KICKING...THAT'S WHAT IT TAKES, WITH PEOPLE LIKE YOU, IT SEEMS.","commenter_a":"So would we all. As a matter of fact, orange jump suits would look good on all Socialist-Democrats.","post_message":"“Hillary, I’m waiting for what you promised me. All I heard was you getting on TV, calling me a liar. That’s not true, Hillary. I am not the liar. You are the liar.”"},{"comment_id":"1401167556601539","commenter_b":"Well if you get appendicitis which is a sepsis or a serious infection in your appendix and it can burst you can die so if that's the case and you get appendicitis I would recommend your removing it","commenter_a":"God made humans with an appendix not about to remove it just because scientists have not quite figured out a use for it. Think about it","post_message":"Be grateful if you still have yours."},{"comment_id":"1167985886552093","commenter_b":"Who cares she's a phony crook sanders all day","commenter_a":"I am voting for HRC!","post_message":""}]
