[{"comment_id":"825517894248057","commenter_b":"Sure I can agree with that but you need a way to pay off debt. Taxes are revenue for the government which are used for various expenses. When you balance the budget that means you are simply not paying down debt but spending less than you have. We need to start moving in a direction where we will run surpluses and thereby pay off previous debt. Just like a company, a government should not be run by debt. Now theoretically by increasing taxes = more revenue which could be used to pay off debts but that doesn't always work in modern society. We are a people who now are all run my debt, we own nothing anymore.","commenter_a":"Realistically the only way to reduce the deficit is increasing taxes. The problem is Hilary wants to increase to help her buddies and Bernie wants to increase taxes to add more social services. The other two will uses those taxes, cut spending and find other ways to be more efficient to reduce deficit.well trump will cuz Cruz will just have to give money to his buddies in the establishment","post_message":"HA! Look at how much the tax plan of each candidate will directly affect your paycheck...  Your jaw will drop when you get to Bernie Sanders..."},{"comment_id":"879266582115130","commenter_b":"The Zionists regime knows only the language of the gun.","commenter_a":"What can they have to talk about ? I am a pacifist , but in this case i would urge Iran to start building nuclear weapons, or get someone to supply them immediately , then maybe the Zionists will finally show them some respect.","post_message":"The foreign ministers of Iran and the United states kick off a fresh round of talks in the Swiss city of Montreux."},{"comment_id":"10153373472869411","commenter_b":"Bugger off Rosa!","commenter_a":"Will sodomite marriage replace traditional marriage in Ireland?","post_message":"Check out our interactive map of the #hometovote trending worldwide  inside this article"},{"comment_id":"10153222402864705","commenter_b":"Well......let's see what happens. According to the books it wasn't Mance who was burned.","commenter_a":"Aren't we jumping to conclusions a bit here? (SPOILERS IN NEXT SENTENCE) We believed he was dead for a few chapters in the books too. Even Jon Snow was surprised when he came back. Couldn't that still happen?","post_message":"Game of Thrones may be playing by new rules this season (PS: spoilers spoilers spoilers)."},{"comment_id":"681700478660950","commenter_b":"My life","commenter_a":"@username you","post_message":""},{"comment_id":"487115881470292","commenter_b":"What a perverted, sick and depraved asshole!!","commenter_a":"Fucktard","post_message":"God will put rainbows and sunshine over the house of every straight, white, christian cis man!"},{"comment_id":"10155146637143984","commenter_b":"Sad part Brenda Gantt at best they will pat him on the hand deport him without any consequence for ehat he did, he will turn around without a wall to stop them and illegally enter again.There was an incident ehere a woman lost her daughter unborn grandchild and new son in law to an illegal no consequences.She and several tried to get illegals deported what she got in my oppinion was a slap in the face, it cost too much to send them back where they came from.SERIOUSLY SHE PAID THE ULTIMATE PRICE TO BE TOLD THAT? No i say meet the authorities at the border say here are illegals we are returning.We need stricter rules if they are here they need to suffer same consequences a citizen does, whether here on a visa or illegal with no consequences for judgement given from court","commenter_a":"Ha ha Mexico will never pay for the wall and when they send the illegals back I can't wait to see all of you working in the fields","post_message":"Jaws hit the floor as soon as Trump revealed when the Mexico wall is going up. This came as a complete shock to Mexico, and is going to go a long way in shaping Trump's presidency..."}]
