[{"comment_id":"1044102145610796","commenter_b":"Stay at home moms!","commenter_a":"See Travis Kuras i dont drink that much coffee!!! Lol","post_message":"Who drinks the most coffee?  Image by I Love Coffee via AsapSCIENCE."},{"comment_id":"10156126266600615","commenter_b":"Make her pay for all the time she has wasted with her stupidity.","commenter_a":"Yes and he should block her from further action, and find her and her attorney's for wasting the court's time and money.","post_message":"What do you think? Will Judge Bunning dismiss Kim Davis' lawsuit against the governor?"},{"comment_id":"1313767168664034","commenter_b":"Just a bunch of self absorbed leftist lesbians.","commenter_a":"Just say there prayin see what happens","post_message":"Wait...so the WNBA is still a thing??"},{"comment_id":"1044939055565842","commenter_b":"Watch out for the showers.","commenter_a":"Disrespectful, Ungrateful Cretins!","post_message":"Refugees in Germany are being housed in a former Nazi concentration camp"},{"comment_id":"911808665590508","commenter_b":"Go home","commenter_a":"Ok send these people back where they came from.....F them!","post_message":"OUTRAGEOUS: MUSLIM Students At Public School Walk Out When NATIONAL ANTHEM Plays  Lets get 3000 SHARES if we should deport them!"},{"comment_id":"10154376947093271","commenter_b":"Kind of reminds me of Walking Dead when Negan took the mattresses and lit them on fire. That was only a TV show and we screamed at the injustice. No need to take things away from people. Especially the homeless in this cold.","commenter_a":"This is really sad... sad that the mayor decided to enforce the camping ban, sad that the police department officers don't tell their higher ups that they aren't going to be cruel and steal from citizens, and sad that a majority of the public is just barely realizing that the mayor and his police force has been doing this for a long time now. I read each and every comment, as well as the replies to comments... to those that think all the homeless people choose to live on the streets and refuse to go to the shelters, stfu and learn something before you speak... talk to a couple of them, see them, really SEE them, before you pass judgement. To those that are outraged at what they read, speak up... take a stand... help out someone just because it's the kind thing to do. And to those who are ...","post_message":"After video surfaced of officers taking blankets away from the homeless during a cold Colorado night, Mayor Michael Hancock is now speaking out."},{"comment_id":"1603960996557680","commenter_b":"Deport her","commenter_a":"Racist pig!","post_message":"Ridiculous...  Take Oprah Winfrey off TV right now."}]
