[{"comment_id":"944125178989101","commenter_b":"Not unless the Bush Administration moonlighted at 7-11!","commenter_a":"That's an easy mistake to make, he thinks the guys that work at 7-11 were responsible for 9/11....sheesh.","post_message":"Donald J. Trump mistakenly refers to 9/11 as 7-11: “I was down there and I watched our police and our firemen, down on 7-11, down at the World Trade Center, right after it came down, and I saw the greatest people I’ve ever seen in action.\" READ MORE: @webpagelink"},{"comment_id":"10156358978545354","commenter_b":"For the record, can't stand the women of the View.","commenter_a":"Too bad she wasn't this sharp in her failed tenures at Lucent and Hewlitt-Packard. She has the nerve to keep getting mileage out of Trump's remarks about her looks. Google \"Fiorina Gaffe\". If the media hadn't kept that video \"under wraps\" while at the same time raking Trump over the coals for his remark, the whole flap about her face would have been a \"non\" issue. She also left her campaign for Senator 5 million in debt and her staffers high and dry. Do your research before throwing support behind her.","post_message":"WATCH Carly run circles around the ladies of \"The View.\" Epic!"},{"comment_id":"587298078081643","commenter_b":"You dumb bitch","commenter_a":"Pasco ain't little","post_message":"That sort of puts things in perspective, doesn't it?   @webpagelink"},{"comment_id":"1537745596485739","commenter_b":"Got it STOCKINGS !!!!!!","commenter_a":"salt","post_message":"Riddle of the day! What is it?   Quiznatic Media"},{"comment_id":"10152998065516037","commenter_b":"Of course men are trying to tell a woman what to do with our bodies. Go shove it!!!","commenter_a":"The silent holocaust, women and men who are irresponsible killing a life because of inconveinence. They will pay for it if not in this life the next one.","post_message":"A new report out today from the Guttmacher Institute shows that 57% of women now live in a state considered to be hostile or extremely hostile to #abortion rights."},{"comment_id":"10152945892703855","commenter_b":"Quit being such a pussy.","commenter_a":"Sigh, more attacks on a man having an opinion and not actually insulting anyone. Give up. I guess you can go back to endorsing Prep.","post_message":"We all get it from time to time."},{"comment_id":"10154054009251337","commenter_b":"God Damn I want some fries now.","commenter_a":"Fuck Topher Grace. He ruined Venom.","post_message":"IT'S NOT A REUNION! Curb Your Enthusiasm's reunion for Seinfeld finally gets edited together..."}]
