[{"comment_id":"1225473394192695","commenter_b":"@username you suck big donkey dicks","commenter_a":"A man of class, dignity, character, honesty...everything goid and positive. God bless our nominees, and the Unired States of America!","post_message":"Republican vice presidential candidate Mike Pence holds a town hall."},{"comment_id":"743009682482479","commenter_b":"Our military needs to follow the example of General Pershing in 1911. Soak the bullets in swing blood, kill them, pack their cavities with sausage and bury them with a pig. This would stop the rest of them from whining. This guys is a loser from the start.","commenter_a":"Don't worry ducky, soon you will join your comrades in line waiting for your non-existing virgins. Will a couple old goats do?","post_message":"Boo-Frickin'-Hoo. You think life sucks now... @webpagelink"},{"comment_id":"10153922572740950","commenter_b":"No she was saying don't do it Keith.","commenter_a":"Dummies... she was telling the cops, \"Don't do it\". Did you not hear her NUMEROUS TIMES say, you better not shoot him. Don't do it. HE DOESN'T HAVE A GUN. I suppose she changed her mind halfway through. Smh","post_message":"Warning - Graphic Content: The Charlotte-Mecklenburg police department just released the officers' body cam footage taken during the shooting of Keith Scott: @webpagelink"},{"comment_id":"10154188943324255","commenter_b":"How is it that these backwoods fucktards are so hopped up about the rights of fetuses, but when that fetus grows up and needs public assistance, they think it's a loser and a piece of shit? Idiots. I guess this is what happens when you fuck your sister.","commenter_a":"yeah lets legislate morality. Like that ever works. Like some others have said, forget getting any of my tourist dollars.","post_message":"All these new restrictions will not make abortions go away. But they will kill women."},{"comment_id":"10153715482507452","commenter_b":"@username my point is just because the government calls it illegal doesn't mean so that's my point and hector no conspiracy you just like to believe everything the government tells you","commenter_a":"Even if the lady were to have been illegal, the US low key appreciates the narcotics the government sells it themselves on the side where else can they seize the dirty $$$ that keeps circulating","post_message":"A San Diego woman traveling from Mexico was busted at LAX trying to smuggle in more than 11 pounds of crystal meth tucked away in the lining of her suitcase."},{"comment_id":"662083353949972","commenter_b":"@username the police and you need to respect the first amendment","commenter_a":"These are adults who are supposed to be leaders in our community. They have the power to take life and they are the ones acting like children who have taken their ball and gone home. Is it any wonder these children are afraid of police and concerned with their actions? Shame. Shame on them. Shame on them for proving the children's point.","post_message":"Some Jefferson Parish deputies won't volunteer for security detail at Bonnabel High School football games after several team members kneeled during the national anthem during last weekend's game."},{"comment_id":"1113541475361229","commenter_b":"Killary is a delusional lying bitch","commenter_a":"No Trump was right on","post_message":"Clinton: \"Donald Trump spent his time attacking when he should have been apologizing\" at the debate. Agree or disagree?"}]
