[{"comment_id":"1525021640848139","commenter_b":"Connie your argument makes no logical sense. You can't have it both ways. There are no voter suppression laws. Requiring an id is not voter suppression.","commenter_a":"Where was all your outrage over the treasonous Clinton pay for play entanglements? This page is so ridiculous","post_message":"Trump's not going to like this one bit!"},{"comment_id":"1765509470395082","commenter_b":"This morning someone on ABC said Trump supporters don't take him seriously. Republicans never gave President Obama a chance. They blamed him for everything and they worked tirelessly to make him a one term president. If Trump wins America will be the laughing stock. Even the Russian government knows that. Donald a Trump blames everyone democrats for everything that is wrong but he has yet to say how he's going make America great again. Unless building a wall to keep out the illegals is how few intends to make America great again. I was team Bernie but since he didn't make the cut I have to go with the lesser of two evils. I can't vote for someone who fuels hate and bigotry.","commenter_a":"It's not up to this man to judge anyone soul. He is filled with hate against Mr Trump, he need look inside to his own darkness!!","post_message":"Khizr Khan, the father of a US soldier slain in Iraq in 2004, says Donald J. Trump has a \"black soul.\" @webpagelink"},{"comment_id":"10158064309830354","commenter_b":"She's so ugly!","commenter_a":"she looks like a dude to me. this not a real female.","post_message":"Poisoned coffee on the day of the debate???"},{"comment_id":"1478938502146617","commenter_b":"That redneck is probably terrifying his sister...err! Girlfriend!!!","commenter_a":"That woman looks like she's trying to hide her identity. I would too if I had to go to a Trump rally with that gormless chubby asshole. :(","post_message":"\"One man's sexual assault,\" one said, \"is another man's flirtation.\""},{"comment_id":"1000913466673540","commenter_b":"Trounce her lying ass!","commenter_a":"Don't run like Romney....","post_message":"Take our new CLASH Poll. Should Donald J. Trump play nice or ... should he put The Hildebeest on ICE? @webpagelink"},{"comment_id":"10152512178746316","commenter_b":"Most doctors are not looking out for you, just the bottom dollar. Research apricot kernels","commenter_a":"Cannabis oil all the way! Id never ever do chemo","post_message":"Radiation and surgery provide more burden than benefit, destroying prostate cancer patients' quality of life in their final years. What would you do if you were diagnosed with cancer? @webpagelink"},{"comment_id":"1422508754431832","commenter_b":"Yes","commenter_a":"Yes, totally!!","post_message":"Should Washington require drug testing for unemployment benefits?   A. Yes.  B. No, it's spending a lot of money on little gain  C. This is a bit unfair for states that legalized pot  D. Only for those who lost jobs to drug use E. Enter your own anwser"}]
