[{"comment_id":"10154340193151509","commenter_b":"Hillary has an estimated 70-80 pct of Hispanic votes , but only needs 40-45 pct according to experts. I'm just the messanger. Rand Paul is my pic.","commenter_a":"Not that I care for this socialist , but the Latino vote will bring Hillary over the top.","post_message":"Donald J. Trump has been tearing away at Bill and Hillary Clinton for more than a week"},{"comment_id":"10153288291318812","commenter_b":"That is great! I had to tell a mom to stop playing games on her phone in the theatre once. She was playing for nearly half an hr into the movie & it was totally distracting cuz of her huge bright screen & she was holding it up right in front of her face.","commenter_a":"Praise God it is so good to know that some people do still believe in kids being obedient and respectful to their elders.","post_message":"\"This rude, disrespectful, and awful behavior is unacceptable and they owe you an apology.\"  Mom's Facebook apology for kids' bad behavior at the movies brings recipient to tears: @webpagelink"},{"comment_id":"522223391280988","commenter_b":"@username you do not get it David. Bernie Sanders and Donald Trump are so popular because people are sick and tired of what is currently available. He is not unelectable and Hillary Clinton is going to lose the Donald Trump if she wins and that is not good for anybody in this country. She's going to kill this country","commenter_a":"Why are you so biased towards Hillary? You are supposed to represent ALL democrats!","post_message":"Hillary Clinton was just announced the winner of today's Democratic caucus in Nevada. Congratulations to her and her supporters!  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"949480448492859","commenter_b":"I know and all white people are racist, and all blacks are bad and all people named Ana are jerks. Yeah I get it.","commenter_a":"Whatever people think about Trump, he's not as stupid or delirious as the Democrats who put Israel and the USA in jeopardy of a nuclear strike, and gave the biggest supporter of terrorists over $150 billion dollars to wipe us out... Our government is carrying political correctness to the point of suicide, just like all the European nations did by taking in millions of so-called refugees... People think it might be dangerous if Trump has his hands on the nuclear arsenal... how is that any worse than giving nukes to our biggest enemy who daily threaten our extinction and Israel's extinction??? AND CRUZ was behind all these deals. We don't need him in the WHITE HOUSE. Lawyers are liars and he is not different than the rest of the lawyers around this country.","post_message":"Carly Fiorina: It's time to unite behind Ted Cruz: @webpagelink"},{"comment_id":"10153057363191028","commenter_b":"Bhahaha!!! A ccw in San Fran ? Does a unicorn issue those?","commenter_a":"I am sure that the thugs guns were a registered and they all had concealed carry permits with proper background checks done.","post_message":"The brazen attack occurred just before 6 a.m. at Pier 14 in San Francisco, where the reporter and photographer – along with several other news stations – were covering a story.   \"I thought I was going to hear a click,\" the photographer said afterward, meaning that he thought he was going to die. @webpagelink"},{"comment_id":"10156321873895725","commenter_b":"Global warming is responsible for baby dick","commenter_a":"iIN United States there plenty terrorist as illegal immigrants driving yellow taxi in the cities of United States taking the jobs from American people and ready to do bad things to us here that's why we need DONALD TRUMP to deport all of them","post_message":"As President of the United States, my top priority would be to keep America safe & strong! Thank you for your support."},{"comment_id":"1167985886552093","commenter_b":"Who cares she's a phony crook sanders all day","commenter_a":"I am voting for HRC!","post_message":""}]
