[{"comment_id":"10153039322884753","commenter_b":"She doesn't have to pledge allegiance to the USA. So where is she pledging allegiance to, while getting a free education here. Hmmmmmmm","commenter_a":"I think she and her family should leave the country","post_message":"When a 14-year-old student decided she no longer was going to participate in the pledge of allegiance at her school, her teacher decided to punish her. Now the girl's parents are asking for an apology."},{"comment_id":"631005147090064","commenter_b":"run him off. his wife also.","commenter_a":"he must be on drugs again.","post_message":"Obama said that America wants him to run for a third term, here's how they responded.  What a joke. This is absolutely ridiculous.  Do you think Obama should run a third term?"},{"comment_id":"1746481058744968","commenter_b":"Get out of here","commenter_a":"Traduction: Our thoughts are with the people of ISIS","post_message":"Our thoughts are with the people of Aleppo"},{"comment_id":"10154071433569778","commenter_b":"You know him or something?","commenter_a":"Gordon","post_message":"A 9-year-old boy beaten by his mother's boyfriend over birthday cake died from his injuries."},{"comment_id":"10153679733478967","commenter_b":"People really do get butt hurt in SF","commenter_a":"Carlos Salazar","post_message":"Well this didn't go very well."},{"comment_id":"10154319611824586","commenter_b":"Horrifying! All for money!! Humans are barbaric! Vegan for animals!","commenter_a":"People are killing crops:@webpagelink #PlansLivesMatter #DontGoVegan #JKGoVegan","post_message":"BREAKING: Those hermit crabs you see at beach shops & pet stores may come from this horrifying supplier.  Warning: The way workers crack crabs shells is really hard to watch :("},{"comment_id":"1085742424820999","commenter_b":"Steven Lumb then ask yourself why. She must be doing something right.","commenter_a":"So after my 12 years teaching and three post-grads I am still not allowed to call myself a professor but she can, in her first teaching job, what a joke.","post_message":"2016"}]
