[{"comment_id":"10153085660518010","commenter_b":"@username - Why are you afraid of strong women?","commenter_a":"If women can complete the same physical testing that men have to then they should be allowed to become full combat ready Army Rangers","post_message":"About 60 women will be allowed to take the next Army Ranger course assessment for the first time ever.  But women are still not allowed to become members of the regiment and will not serve as Rangers in combat."},{"comment_id":"966234590136262","commenter_b":"Love this, her & Ann Coulter make me sick. Both need to go away","commenter_a":"She is like Ann coulter. Such people must be sentenced for a lifetime. Her intolerance is making me angry.She must be imprisoned.","post_message":"Pope Francis is furious."},{"comment_id":"10153109185578812","commenter_b":"I hope people know the women in Iowa aren't all like her.","commenter_a":"I'm from Iowa. So embarrassing!","post_message":"The Republican Response to #SOTU2015: Who is Joni Ernst?"},{"comment_id":"10153477114308984","commenter_b":"She's obviously trashy","commenter_a":"Am I the only one that saw that woman get out of that scooter, clearly nothing wrong with her","post_message":"This woman's young son got involved in her brawl with another Walmart shopper, and the video took the internet by storm. Now she's speaking out to defend their actions...  Do you think her son's behavior was unacceptable?"},{"comment_id":"494202484098498","commenter_b":"Do they want her cause America doesn't want or her trashy ole man and her entire trashy family oh and take Bruce with them too","commenter_a":"If you vote for Hilary , I'd be scared as much as she travels.","post_message":"Is Kim Kardashian West a secret agent? @webpagelink"},{"comment_id":"10152955356009071","commenter_b":"I know I said LMAO, but really hit me up... could use the help. ;-)","commenter_a":"Dear anyone... please contact me if you're up for some pro bono work to sharpen your skills! Lmao!","post_message":"It's a known fact that hacking makes money. But how much money?"},{"comment_id":"10153411890906167","commenter_b":"Nah. Satan and the Mrs, would have had an abortion before bringing this creep into the world. ;)","commenter_a":"the son of satan.","post_message":"Troy Newman's views are so extreme that, as The New York Times reported in 2015, Australia cancelled Newman's visa over \"concerns that he might encourage violence against abortion providers or women seeking the procedures.\""}]
