[{"comment_id":"10154302113081509","commenter_b":"She had them surgically removed. She also doesn't have a brain or even a modicum of decency. And THAT is why she's running for office! Hellary 2016!","commenter_a":"Hillary would you like to have your husband also in prison ? Or else a dildo is enough ?","post_message":"Hillary Clinton had a message for a supporter's father who is backing Donald J. Trump"},{"comment_id":"1438428362916880","commenter_b":"No, we, the REAL constituents, are not there and we are upset because we're working to pay our bills, support our families, fund illegal aliens, fund refugees, fund multi-generational welfare families, fund single mothers who don't know who their babies daddies are, pay for the prisons to hold baby daddies who make kids then get thrown in jail etcetera etcetera etcetera...","commenter_a":"Oops shouldn't have texted both when I offered 3","post_message":"Spot on."},{"comment_id":"10154119887406167","commenter_b":"LOCK HER UP!","commenter_a":"Why hasn't Hillary been arrested for money laundering and racketeering?","post_message":"It's not just Trump that's the problem -- it's his family too."},{"comment_id":"927580090624348","commenter_b":"@username OMG are you loco? This b&tch kills off people.","commenter_a":"You not being elected the President will make America safer","post_message":"Hillary Clinton: Guns Will Not Make Americans Safer #DemDebate   @webpagelink"},{"comment_id":"10156314605160354","commenter_b":"Dems care more about illegals than Americans! Vote all democrats out!","commenter_a":"Here is a list of the DEMS that blocked the vote for Kates Law and to stop Sanctuary Cities.Tweet or Facebook your Congressman or woman.","post_message":"\"With a vote of 54-45, the measure failed to obtain the 60 votes necessary to end debate.\""},{"comment_id":"436426606545633","commenter_b":"Women are too smart for an old fish tale lol","commenter_a":"Good job, Mrs. Wifey","post_message":"This is great..."},{"comment_id":"10154201387086037","commenter_b":"How many people did Jesus kill? How many sex slaves did Jesus have?","commenter_a":"In the Quran Mohammed said to \"cut off their heads\". That's the Islamic role model. Just be glad that role models Jesus and Gautam Budhha didn't say the same about \"infidels\". There would be even more chaos...","post_message":"\"He was brainwashed but we do not know by whom, when or where,\" said a family friend."}]
