[{"comment_id":"926693817463797","commenter_b":"Fuck u bitch","commenter_a":"Good :) anything to make more conservatives whine and bitch like the petulant children they are.","post_message":"This is just plain sad..."},{"comment_id":"361328087404039","commenter_b":"She is worse than Holder . America keeps going down hill and it will get worse .","commenter_a":"Disgrace to America","post_message":"Squishy and Weak Senate Republicans Lead the Way in Confirming Loretta Lynch as Attorney General  Real Conservatives Outraged"},{"comment_id":"899754210061920","commenter_b":"What do you care what she does or has? She doesn't have 2 brain cells to rub together!","commenter_a":"From what I understand, they don't drink alcohol at all. So I don't think she would fit in. Sad thing is that because of the alcohol and drugs she uses, she looks a lot older. I'm actually older than she is!","post_message":"Is Lindsay Lohan converting to Islam?    See what she was photographed holding."},{"comment_id":"10154742195526178","commenter_b":"The X miss universe is Hillary's friend plus the miss X universe is in a world of hurt on her own now she's in trouble with the law","commenter_a":"RUSH: The thing that's ironic about this, they're claiming that Donald Trump bullied this ex-Miss Universe. Has anybody asked about Hillary Clinton bullying all of the bimbos that have erupted during the course of her and her husband's political career? This is so screwed up. If there is anybody in this campaign who doesn't pay women what she pays men in her office, it's Hillary Clinton. If there's a woman in this campaign that bullies other women and has been acclaimed for it, it is Hillary Clinton","post_message":"Now First Lady Michelle Obama is getting into it with Donald Trump."},{"comment_id":"499065056962019","commenter_b":"I can't stand her. Send her back to India where her parents are from.","commenter_a":"We can't let the GOP pick and choose who they want in office. It is up to the voters! GOP take notice, heed our warning, because if this does happen, and Donald becomes and independent; there will be. Democrat elected!","post_message":"Now that she criticized him, will Donald Trump snuff out Gov. Haley's rising star?"},{"comment_id":"502375926577851","commenter_b":"WELL damn go fund ME!","commenter_a":"It worked for this hating pig, wait for the next one. Gopers are slow learners.","post_message":"I'd say I've been doing it all wrong the past few years... except I'm a decent human being with a conscience... via The GOOP  | Liz"},{"comment_id":"939606616115567","commenter_b":"Slaves to Islamic vermin. not MEN","commenter_a":"Sharia and Islam are only good for Muslim Males ................Males get all the advantages............... BUT .women, children, gays, Christians , Buddhists, Jews, Hindu and anyother religion not \"their \" brand of Islam will be punished , raped , enslaved , or killed . Women of the world wake up and see this truth . Fight for freedom .Women Fight for your life....Women you can be more than slaves to men ........","post_message":"They're just sweet refugees', they said. 'Who just want a better life', they said. Welcome, and then .... German girls... cover up... so you don't get raped by the 'refugees'?"}]
