[{"comment_id":"10154092848234087","commenter_b":"A special letter to Republican nominee Donald J. Trump: Dear Sir, In a way, you are no better than your narcissistic alter ego. When told what you say is considered sexist, racist, classless, hurtful, and you say it more, you are a self-centered narcissist. Speaking off the top of your head, yelling hurtful insults, slinging mud, your unsophisticated intellect comes as somewhat surprising. It is apparent there is no limit to what you will say. For starters you are unapologetically low class: women ooze blood Hillary cofounded ISIS \"Hillary Clinton is a bigot!\" punish women for abortions kill terrorists and their families proposed mass deportation force African Americans use food stamps extreme vetting of Muslim immigrants if Ivanka wasn't daughter, he'd date her Mexican immigrant murderer rapists cancel Obamacare (offers no alternative) \"you have to be wealthy in order to be great\" \"putting a wife to work is a dangerous ...","commenter_a":"WE ARE CONCERNED ABOUT YOUR QUESTIONABLE BUSINESS DEALINGS OVERSEAS AND YOUR FINANCIAL TIES TO THE MOB AND OTHER COUNTRIES 1.\\tWill you sever ties with your company linked to foreign leaders, questionable organizations, and criminals if you become president? 2.\\tHow will you handle non-cancelable contractual obligations with parties whose interests conflict with those of the United States? 3.\\tWhile refusing to release your tax returns, how will you confirm that you do not have dangerous financial ties to bad actors abroad? 4.\\tIf you were willing to work with Qaddafi known terrorist and dictator there anyone you aren't willing to make a deal with? Who? 5.\\tHow can you be tough on Iran, given your business partnership with someone connected to Iranian money laundering? 6.\\tGiven that you've already questioned our commitments to NATO allies, what is your answer to this? For example, how would you handle the millions of dollars flowing into your organization ...","post_message":"Bernie Sanders ripped the media for letting itself be manipulated so easily by Trump."},{"comment_id":"10153833449353145","commenter_b":"Ignorant uniformed woman!","commenter_a":"Totally stupid. It's an illegal drug! Small amounts lead to large amounts. Bad enough there is a jerky a.. Attorney who is trying to legalize marijuana in Orlando. Get a grip. Bad enough this state is number one in the country with the worst drug problem!!","post_message":"This would be a major change in Orlando, but is it a step in the right direction or should leaders nip this in the bud? Let us know what you think."},{"comment_id":"10154227999432490","commenter_b":"Fine. Get on your knees and suck a dick if it makes you happy. I'm out.","commenter_a":"My Navy. The one I loved and served in for 20 years has become a piece of garbage. The morality is gone . It's run by leftist , gays and polatitions bending to the will of .02% of the weirdos making a lot of noise. What the hell?","post_message":"Same-sex couples are eligible to receive veterans benefits, but House Republicans still aren’t ready to fully acknowledge that."},{"comment_id":"1286179581424362","commenter_b":"And she is a liar and murder!","commenter_a":"He can talk about Hillary all day, but he has no real plan for this country, he's an imbecile.","post_message":"REPLAY: Donald Trump at a rally in Wilmington, Ohio."},{"comment_id":"10153992359576037","commenter_b":"Unethical","commenter_a":"Smh... Crazy!!","post_message":"Some fear this could eventually lead to the creation of “designer babies.”"},{"comment_id":"554226841431375","commenter_b":"Hillary is the dispicable one calling Millions of Americans all kinds of names that do not want her for President . So save all your outrage for Hillary , oh that's right . You hypocrites don't have a problem with Hillary doing it and yourselves as well . Shame on you Debbie and all like you .","commenter_a":"The nasty, inconsiderate, unemphatic comments are disgusting & shame, shame on everyone making them. Hillary has run herself ragged & not surprised she's got pneumonia. Coughing a lot lately. She's exhausted. No wonder. Be careful what you say because it'll come back to you tenfold. #KARMA","post_message":"JUST IN: Hillary Clinton was diagnosed with pneumonia on Friday, her doctor says. The doctor revealed the condition hours after Clinton stumbled while leaving a 9/11 event. @webpagelink"},{"comment_id":"10156001828650725","commenter_b":"Every illegal alien is a criminal. Their crime rate is 100%.","commenter_a":"There's barely any crime from an immigrant but way more crime with other ppl just saying","post_message":"We must stop the crime and killing machine that is illegal immigration. Rampant problems will only get worse. Take back our country!"}]
