[{"comment_id":"1150086235078889","commenter_b":"Hillary Clinton for President!","commenter_a":"This guy.....God help us all if he's elected!!!! Gary Johnson!!!! Love how he talks about jobs when he's notorious for trying to break up unions and has his own clothing line made in China!!! l","post_message":"WATCH LIVE: Donald J. Trump holds rally in Florida"},{"comment_id":"10153335574974384","commenter_b":"A complete waste of good female human flesh.","commenter_a":"Communist scum.","post_message":"Celebrating Women’s History Month by honoring women of \"Supreme\" achievements! Indeed, an inspiration to us all."},{"comment_id":"10154538565137178","commenter_b":"@username illegal guns in Chicago are the guns killing people there, not the ones owned by legal owners, all the guns in Chicago have not slowed the death tole, cities that allow guns have less violence less killing, it's history and its fact! Taking guns from legal citizens makes them defenseless and easier for the government to control! Outlaws will always have guns!","commenter_a":"The problem is he considers the dangerous few the Legal Gun Owners in America, Not the Illegal gun owners in south Chicago!","post_message":"Executive action? President Barack Obama is exploring ways to keep guns out of the hands of \"a dangerous few\" without depending on Congress to pass a law. Steps to strengthen background checks could come this week. >>> wral.com/@username"},{"comment_id":"10153146203991051","commenter_b":"Caucasian women are most desire able","commenter_a":"I'm not racist but do y'all notice that the teachers who have sex with students be Caucasian? Hum!!!!","post_message":"This teacher was arrested for having sex with her students. While she was out on bail, she got busted doing it again."},{"comment_id":"999541756747912","commenter_b":"Wake up American, Those people re Terrorists not Refugees.","commenter_a":"New York! !!","post_message":"WOW!"},{"comment_id":"10153693446321037","commenter_b":"Women on women issues unless it's Bills sexual affairs then she doesn't care.","commenter_a":"Maybe she should have first looked to tackle it at the White House when she was living there.","post_message":"Hillary Clinton is the first 2016 presidential contender to address the issue of campus sexual assault on the campaign trail, but she may not be alone for long."},{"comment_id":"1362072713808008","commenter_b":"ROTFLMFAO!!! Opine from the woman actually wearing an \"A$$\" hat! You just CAN'T make this stuff up!","commenter_a":"The Judge is a lawyer for La Raza. He is literally a La Raza Grand Dragon.. He has literally helped many illegal immigrants break the law in this country. Donald Trump could go further and he didn't but when you start doing some digging this Judge doesn't seem like a very nice man. A lawyer for a group who has said many times to \"kill all white people\".. Okay.. Donald Trump could go further.. You may very well make him show his hand and there's a lot to show on this judge and the company he keeps. The ONLY racism here is of the judge and the people he represents. Imagine if the Judge was a KKK member presiding over a case that affected black men. You'd be outraged. You know you would. How is the Donald going to get a fair shake when the judge is soooo clearly biased ...","post_message":"By refusing to denounce Donald Trump’s attack on Judge Curiel for the racism it clearly connotes, it shows Senate Republican Leader Mitch McConnell is the poster boy for the Republican spinelessness that allowed Trump to be the Republican nominee for President of the United States.   Senator McConnell has so fully embraced Donald Trump that we are all unclear as to where Trump’s platform ends and Senate Republicans’ begins."}]
