[{"comment_id":"693806690773834","commenter_b":"Women should be prosscuted!","commenter_a":"I think this is where the word HOG WASH, came to be.... just saying...","post_message":"How rotten this administration is to the core when the attorney general takes the fifth to avoid incrimination!"},{"comment_id":"10153494156593352","commenter_b":"Good story. Bitch is a lying though. I don't know one woman that would've let that bullshit go down...","commenter_a":"Why was she so close to a canal going downhill with her kids? This is a sad story but seemed like she made some careless mistakes.","post_message":"Mother was fighting off a BEE when she let go of her twins’ stroller and they rolled into canal and drowned"},{"comment_id":"1325297067482547","commenter_b":"Means nothing! That's why it took him so long to release it. It had to be all set up. Duh!","commenter_a":"Unfortunately not true. The BC was a. Latent forgery and Trump said before there were serious questions about it. He should have sidestepped the issue. Hillary always does.","post_message":"Trump senior communications adviser, Jason Miller, had said the issue already was closed, as far as Trump was concerned.   2011, Mr. Trump was finally able to bring this ugly incident to its conclusion by successfully compelling President Obama to release his birth certificate.  Miller statement continued,  successfully obtained President Obama birth certificate when others could not, Mr. Trump believes that President Obama was born in the United States.  He added, . Trump did a great service to the president and the country by bringing closure to the issue that Hillary Clinton and her team first raised."},{"comment_id":"1569633279990452","commenter_b":"U a fat bitch.u hater.k.k.k.","commenter_a":"Oprah is a racist bitch","post_message":"Way to go Carrie Underwood!"},{"comment_id":"991088854247496","commenter_b":"It's about time we had somebody who will stand up and speak the truth!","commenter_a":"Who determines what is Polically Correct? The liberals trying to manage free speech.","post_message":"WATCH: The Donald gets into a heated exchanged with a member of the PC police at press conference."},{"comment_id":"10152512377042377","commenter_b":"RINO !","commenter_a":"He'd be bad for the workingman","post_message":"Romney 2016???"},{"comment_id":"10153487298809877","commenter_b":"This is a very fine line that people are walking, it's offensive because if you think about it you are saying a woman is a ho and you don't even know why she is dressed how she is dressed. Women are the worst....if you want to wear a form fitting dress...go for it.....if not....that is good for you. Please stop.","commenter_a":"I don't understand where the problem is. That is her choice and I commend her.","post_message":"Ayesha Curry Says She's Not Into 'Barely Wearing Clothes,' Prefers to Keep it Covered Up for Husband Steph. Twitter had plenty to say about that! Read more below.  Grio fam, we say 'do you' when it comes to fashion. What's your reaction?"}]
