[{"comment_id":"10154085328776782","commenter_b":"But if you are here illegal then you are already breaking the law just my thought","commenter_a":"Yes, mainly so it allows/requires them to get auto insurance. Having a license won't make people more likely to be in Oklahoma or use more resources. But if an undocumented person hits my car, I have a better shot of not having to pay for it myself.","post_message":"A newly elected Oklahoma lawmaker is pushing through one of his first bills this legislative session, but it likely to get some pushback from the majority Republican House. Patty Santos has the story: @webpagelink"},{"comment_id":"10154553793429712","commenter_b":"They work harder, are ambitious, and always have the American Dream end goal in mind to own a business. If there are all these loop holes and advantages that a non-native English speaking LEGAL immigrant can utilize, how the hell can a English speaking American familiar with the system not be able to take advantage? The answer is some do and the others complain. Want a hint? Take a job in a profession like trade work, food, cleaning, retail, etc work there for years to establish yourself financially and become experienced. Take a calculated risk in opening up your business with all your set up in mind, keep working your butt off and you've done it. People say ohhh ILLEGAL not legal immigrants, as if a lot of Trump don't already see anyone darker than Macklemore as an illegal immigrant, terrorist, or possible threat.","commenter_a":"Lazy entitled Trump voters think it's unfair how immigrants do better than them by working smarter and harder and willing to be entrepreneurs.","post_message":"In Baltimore, foreign-born residents make up 9 percent of the city's population but own nearly 21 percent of the city's businesses, according to a 2012 report from the Fiscal Policy Institute."},{"comment_id":"10154885084089411","commenter_b":"we all good woohoo like riding a wave..","commenter_a":"Leah stay safe. Xx","post_message":"URGENT New Zealand civil defense warns of tsunami, urges people on South Island to move to higher ground"},{"comment_id":"938184229613517","commenter_b":"So then everyone on earth is an American, and we should have no borders, right?","commenter_a":"I took that ancestry DNA test. You all should. Turns out, I'm Native American. If your DNA turns out you are not from the America, shouldn't you fuck off?","post_message":"\"Was it because of Europeans? Or was it because of the very early events that led to the peopling of the Americas?\""},{"comment_id":"1154513944599658","commenter_b":"Open primaries work just fine Terrence.","commenter_a":"Yea- Bernie baby! This was a closed primary and they are near a tie!!!!! Can you imagine if they \"allowed\" everyone to vote?!!!!! #therevolutionishere","post_message":"UPDATE: Sanders wins the Oregon primary, while Clinton appears likely to eke out a narrow win in Kentucky. Sanders' cut into Clinton's 270+ pledged-delegate lead likely will be single-digits."},{"comment_id":"1185753454849738","commenter_b":"Hope to hell this arrogant prick gets put in prison !!","commenter_a":"Who cares...arrogant classless racist. Good riddance.","post_message":"It's always about him. Always."},{"comment_id":"10155052267050695","commenter_b":"This world was based on religious freedom I'm showing mine...","commenter_a":"Good but killing him is no better than taking the life of any one else... God will be his final judge","post_message":"Nine church members were shot and killed at Emanuel AME in downtown Charleston in 2015."}]
