[{"comment_id":"10154283827397014","commenter_b":"Milita Military Milita Military those two words don't sound the same","commenter_a":"A collection of dudes with short man complex playing army man and pretending to be \"patriots\"....awwwwwww, you guys run along and have fun now, don't get anyone or yourselves killed","post_message":"The group said they'll vow to protect the Second Amendment, even under Trump."},{"comment_id":"10154847976925560","commenter_b":"This is so sad and disgusting...and women kill for these bags.","commenter_a":"This is just bullshit","post_message":"This is why Hermes & Louis Vuitton bags have those bumps on them. [GRAPHIC]"},{"comment_id":"933893426670406","commenter_b":"I'm sure Myra Hindley was a serial killer @username, that's only one name, I could name a few. Woman r quite capable of becoming serial killers. The statement is true, most serial killers start with killing and torturing animals","commenter_a":"thats how serial killers start!","post_message":"'My first bow kill lol'"},{"comment_id":"363905233797771","commenter_b":"Stupid wench. I hope her show and all of her movies bomb.","commenter_a":"And the answer to your question, YES. Oprah is a racist....","post_message":"Is Oprah a race-baiter?"},{"comment_id":"10154900824501037","commenter_b":"Obama is playing on Americans. He wants to play a nice guy. He knew all powers for executive orders has been striped off him. He wants to turned american workers against trump's adminstration. And gain cheap popularity from clueless workers. Obama's intentions for america is bad. this is just a cover up. Watch out. He will try something like this again even wen he knew that he doesn't have power to do so. Just to make names for himself n pave ways for his wife 2020. Am one person obama can't fool. All his doing is to put trump in a tight corner n make him look like a bad guy. His a hypocrite and no one shud take him serious. Hilary and obams wants to make sure that trump did not succeed.","commenter_a":"I hope this judge dies of pancreatic cancer.","post_message":"A devastating blow to one of Barack Obama's signature achievements for boosting wages."},{"comment_id":"1141429345895300","commenter_b":"Why doesn't he close the border and escort all of the illegals & especially Muslims out of our country?","commenter_a":"TIME TO DOWNSIZE DHS. Secret police full of pussies. The whole thing is useless.","post_message":"BREAKING NEWS:"},{"comment_id":"1234498396590570","commenter_b":"Carole, keep your day job and drop the politics. You're a suffering liberal.","commenter_a":"This is big news because conservatives want you NOT to notice that the economy is way up, the deficit is way down, unemployment claims are at a 42 year low, and Obama has unprecedented world approval. So Obama has almost rescued us from the disaster the Republicans left us when Bush was in office. But don't notice that stuff, focus on bathrooms and what Muslims are doing in countries you can't even find on a map.","post_message":"#BoycottTarget  #PRDisaster #TalkIsCheap"}]
