[{"comment_id":"1308080519212956","commenter_b":"What's up with all this refugee hate going around? \"They're brown and muslim!! I hate em! They're animals! MURICA!!\"","commenter_a":"Until the refugees find it and start using it as there public restroom","post_message":""},{"comment_id":"1829686510610987","commenter_b":"Just go away Jill. You are as bad as Crooked Hillary. No one believes you.","commenter_a":"So Sad, wasting more taxpayers hard earned money. I hope Trump puts that piece of shit Hillary in jail. I'll never vote for a Democrat again.","post_message":"FUBAR!"},{"comment_id":"1374953252516136","commenter_b":"OH my goodness....Awesomem display of fireworks...:'(","commenter_a":"Happy New Year to all family and friends in London ❤❤❤❤","post_message":"We at the London Eye to welcome in the New Year."},{"comment_id":"401994746592233","commenter_b":"I haven't done any unlawful thing at all not that big too get my ass in trouble but I get tired of how they treating everyone","commenter_a":"I don't believe they should have their guns taken away. Their are some good cops haven't seen it with my own eyes but, their are some. I want to know why they so scared now. I know their was a dog in this case but, what about the other case where people don't have are unarmed and the officer fears for his life. Cops are pussies now a days this shot didn't happen this often just a few years ago","post_message":"This story is as appalling as it is tragic. The Cop Logic and pure stupidity of this officer is staggering. I still can't wrap my head around it. Yet another case why some people suggest police should be unarmed.  Read more: @webpagelink Via - The Free Thought Project.com <-- (y)"},{"comment_id":"10154730385206341","commenter_b":"Understand. Thank you.","commenter_a":"Hmmm, an army that establishes a state based on a single religious identity through violence and ethnic cleansing. Why does that sound familiar? Oh yah! Ding Ding Ding Ding! Is the big chief still living in the nineties? They already look like ISIS to most of the world, just a little less sloppy.","post_message":"\"The commanders are the ones who should set the rules of engagement, not politicians\""},{"comment_id":"1242469175793552","commenter_b":"Righto. Execute the little bitches! That will teach them a lesson!","commenter_a":"Sorry. If you watch the news you cannot just let things go with kids anymore. This time it was pepper that choked the teacher, who knows what would have happened in a few years if another teacher pissed them off........rat poison?? Good lesson to learn early.......being a little psycho bitch is not going to pay off.","post_message":"Three 12-year-old girls have been charged with first-degree felonies in the latest example of America’s insane rush to criminalize children."},{"comment_id":"10153921301277217","commenter_b":"@username has lost their integrity!","commenter_a":"Hahaha.sorry for the laugh. But @username Please investigate first before you conclude on this report. These are all accusations to our beloved president . even his rival denied those witnesses that testified in the senate. sad to say our president's rival now is doing the best they can to destroy our only hope to have a drastic change in this country . BTW You need to go to our country first to know more abt the facts and whats really happening here. :3 -_- #PostResponsibly -_-","post_message":"Gruesome gangland-style hits, including feeding one victim to a crocodile, were described to a Senate hearing by a former death squad member."}]
