[{"comment_id":"10153976487996130","commenter_b":"we are living in the country that has no national insurance and crazy people can have a gun. poor sick people will die without government help and crazy people can massacre a lot of people easily and at one time with a gun.","commenter_a":"Kasa","post_message":"Another mass shooting. Another national address by President Obama."},{"comment_id":"10152964297833445","commenter_b":"what we dont want is a bullshit feminist agenda","commenter_a":"oh fuck off dont invade weed with your feminist bullshit","post_message":"Women Aim to Avoid Glass Ceiling in Marijuana Industry Before It Forms.   @webpagelink"},{"comment_id":"10153199114815950","commenter_b":"I'd pick up the deal with her in it and put her outside. Call her parents and tell them she's outside. She looked small enough. The cop lost his cool. Out smarter by a brat. Now he is fired and they will sue. Sad all around.","commenter_a":"I was raised very conservatively about manners and respect, and I agree that she was wrong for her actions. However, that deputy does not need to be a SRO if he is going to deal with students this way. It's unprofessional and disturbing.","post_message":"\"I was praying out loud for the girl and I just, I couldn't believe it was happening. I was just crying, and he was like, well since you've got so much to say you're coming too.\""},{"comment_id":"1262067313806885","commenter_b":"@username ...You are a very smart Lady... 100% correct","commenter_a":"Chris Christie is a bully like Trump. Senator Marco Rubio owned him, Rubio was just trying to get across the truth about what Obama has been doing all along. Is Rubio perfect, NO, but show me one politician who is please. As for his youth, remember John F. Kennedy anyone?","post_message":"The pundits expected a pile-on at the #GOPDebate Saturday night, but Chris Christie was relentless in his attempt to take down Marco Rubio."},{"comment_id":"563277980487645","commenter_b":"What's the difference between Trumps wife's and illegal immigrants? Trumps wife's applied to become citizens through the legal process of American citizenship and now their AMERICANS. Women like u are uneducated.","commenter_a":"Look up the definition of legal immigrants and illegal immigrants... Idiots.","post_message":"Yes, Donald, have you made their travel arrangements yet?"},{"comment_id":"10153066092873445","commenter_b":"I bet the strippers were forced to strip and what not","commenter_a":"Okay... Retracting previous statement, these fucks need to be jailed... Illegal immigrants being forced into prostitution... Nope! Pigs","post_message":"More DEA Scandal!  DEA Agents Arrested for Lying About Owning a Strip Club"},{"comment_id":"10153475674267452","commenter_b":"Illegals for a living too.. And pay taxes and guess what they don't get a refund. Securing borders? Fix the immigration system it's hard becoming legal.. The system is he problem not the illegals..","commenter_a":"Congratulations on not being an illegal immigrant and working for a living. Trump is not against immigrants he and many other Americans are against ILLEGAL immigrants. Oh and your protest in Canada doesn't mean a thing in the USA.","post_message":"In protest of Donald Trump’s immigration policies, a construction worker hung a Mexican flag atop the Trump Tower in Vancouver, Canada. abc7.la/1W7pFVh  “While working on your tower, Mexicans didn't steal anything nor raped anyone. We just did the best work we could possibly do, for ourselves, our families and the future tenants in your building.”"}]
