[{"comment_id":"10153943108472042","commenter_b":"Break that glass ceiling girls!","commenter_a":"Media prepping questions for war lmao","post_message":"Do you think women should be required to register for the draft?"},{"comment_id":"1277154398974272","commenter_b":"How does she keep getting elected ??","commenter_a":"Liberal Ass Clown","post_message":"Remember that time Nancy Pelosi reassured us that Obamacare was going to be \"affordable?\""},{"comment_id":"557366464412130","commenter_b":"She's anti-woman.","commenter_a":"and, an eyesore.","post_message":"Carly Fiorina is gaining in the polls because Trump gave her his attention in a tweet. Now Republicans are claiming she supports women's rights."},{"comment_id":"10153224011251051","commenter_b":"Shoot the the sonofbitch","commenter_a":"Dirt bag!","post_message":"A lot of people considered this man a hero. Then the truth came out."},{"comment_id":"10156327050085725","commenter_b":"A HUUUUUGE WALL. the next 11 months are gonna be a nightmare. Get in there and fix it asap donald trump. Please","commenter_a":"Caught and turned themselves in are two different things.","post_message":"Eight Syrians were just caught on the southern border trying to get into the U.S. ISIS maybe? I told you so. WE NEED A BIG & BEAUTIFUL WALL!"},{"comment_id":"579018038952469","commenter_b":"Safi Cedrick Varda this actually aired like today ..... in 2016!!!","commenter_a":"What was the point of this?","post_message":"They actually aired this."},{"comment_id":"1191348794238924","commenter_b":"She should keep her mouth shut and her daughter her legs shut","commenter_a":"Here is how I see it: The rediculous right always has an angle of deceit. Their only honor is to ones self and personal greed. No matter what they put out in propaganda the real truth about them shines in their actions and public statements. The problem with the left is they won't get up and go vote even by absentee ballot and let the post man do all the waiting in line when the religious right blocks off all the bathrooms.","post_message":"Sarah Palin wants you to fight against haters who want to take Christ out of Christmas by buying her ridiculous book."}]
