[{"comment_id":"10153072204470329","commenter_b":"Girl I'm trying to kick it with u","commenter_a":"Leida Maria1020806391970270610210023845541574Alicia Jo","post_message":"We all have that one co-worker who is obsessed with Beyoncé...  via BuzzFeed BFF: @webpagelink"},{"comment_id":"10154115326121341","commenter_b":"Simply put - Hillary Clinton is a criminal, and she'll never have my vote","commenter_a":"All lives matter... Sorry but those who still support this man do not see that he is destroying the Democratic Party... For what? He will not be POTUS. For his moment of fame. He is giving Trump an edge in the elections! It is time haaretz realized this!","post_message":"The most successful Jewish presidential candidate in American history is saying that Palestinian lives matter. And he daring Hillary Clinton to disagree."},{"comment_id":"690494281108627","commenter_b":"pregnancy, keep your pants on and shut up!","commenter_a":"They need a Vasectomy law instead lol stop blaming the Uterus","post_message":"100,000 women took to the streets ... and now the abortion law has been dropped."},{"comment_id":"10154533840951509","commenter_b":"well you certainly are a hateful person!! Jealousy is a evil trait poor girl.","commenter_a":"I dont know if rock hudson was at the gates to meet nancy reagan if she even made it shame shame shame on you nancy","post_message":"1980s star Mr. T did not pity the fool as he recalled his seemingly odd-couple friendship with Nancy Reagan."},{"comment_id":"10153216973363855","commenter_b":"Good let the idiots divorce","commenter_a":"overinflated sense of their own importance much? idiots","post_message":"Here's to a speedy divorce!"},{"comment_id":"10154473898974411","commenter_b":"@username stick to your supermarket shopping you dumb f","commenter_a":"So many ignorant people commenting on this. This is a traditional harvest of one of the only renewable resources the inhabitants of this barren rock can survive from. Educate yourselves.","post_message":"'The ordeal began this morning when locals spotted a pod of between 100-150 pilot whales'"},{"comment_id":"1325297067482547","commenter_b":"Means nothing! That's why it took him so long to release it. It had to be all set up. Duh!","commenter_a":"Unfortunately not true. The BC was a. Latent forgery and Trump said before there were serious questions about it. He should have sidestepped the issue. Hillary always does.","post_message":"Trump senior communications adviser, Jason Miller, had said the issue already was closed, as far as Trump was concerned.   2011, Mr. Trump was finally able to bring this ugly incident to its conclusion by successfully compelling President Obama to release his birth certificate.  Miller statement continued,  successfully obtained President Obama birth certificate when others could not, Mr. Trump believes that President Obama was born in the United States.  He added, . Trump did a great service to the president and the country by bringing closure to the issue that Hillary Clinton and her team first raised."}]
