[{"comment_id":"957019640987493","commenter_b":"It's normally women who wear high heels that shame women who don't if we are going to be honest. As a woman you can't get into many clubs if you're not in heels.","commenter_a":"On the other hand, I don't think it's right to \"shame\" women who likes to wear heels either.","post_message":"Looks like somebody learned his lesson."},{"comment_id":"10154266616104714","commenter_b":"@username hey wanna help us build the wall when trump gets elected","commenter_a":"Good you can celebrate without my dollars goodbye target fn libtard fruitcakes","post_message":"\"Inclusivity is a core belief at Target\" said the retailer in a statement. \"It's something we celebrate.\""},{"comment_id":"10153376704131051","commenter_b":"Someone needs to beat her the same way","commenter_a":"Dear God in heaven. God bless this poor child.","post_message":"Officials couldn't believe that someone would treat a child like this."},{"comment_id":"10156410898495725","commenter_b":"@username he does not have to insult Hillary's looks. She does a good job of insulting herself.","commenter_a":"I would love to watch Donald Trump debate Hillary Clinton! He will tear her a new one!","post_message":"The last person Hillary Clinton wants to run against - is Trump! I will be her worst nightmare! #Trump2016"},{"comment_id":"10153845765260950","commenter_b":"@username are you a woman? No! Then it's not your say!","commenter_a":"Republicans already passed a Zika bill. Democrats voted against it because defunding planned parenthood was attached. Democrats had rather murder the unborn than prevent the born from being deformed. You see stopping Zika is bad for buisness at Planned Parenthood!","post_message":"President Obama blasts Republicans in Congress for refusing to approve requested amount to fight against Zika."},{"comment_id":"10153933492904411","commenter_b":"lol it makes no fucking difference you whiny bitch","commenter_a":"Miss Universe pageant is all politics.... the Elites crown whichever country they wanna make use of. In this case, the Phillippines in the South China Sea issue. Whereas Colombia is drawing closer to China this year, this is just humiliating Colombia in public.","post_message":"Oops: Steve Harvey crowns wrong #MissUniverse2015"},{"comment_id":"10153684606323487","commenter_b":"There is no part of any of the Planned Parenthood video footage of a fully-formed aborted fetus on the table, with its heart beating, its legs kicking, IT IS A LIE!!!!!! The damned bitch lied!!!!!","commenter_a":"In the sense that she lied louder and slower than the others, Carly owned the night.","post_message":"Carly Fiorina owned the night."}]
