[{"comment_id":"10154579846521337","commenter_b":"Uproxx spreading the word of obama lets keep stoking the fires of divison","commenter_a":"Why is the kid running? I mean...I personally see cops running towards me I'll probably freeze like a deer in headlights. The cops would've likely seen their theory was ridiculous once they got close to the kid and moved on.","post_message":"“I was scared for my life. I was thinking that they were going to shoot me.”"},{"comment_id":"1749284951998475","commenter_b":"I love this","commenter_a":"@username @username me in second year","post_message":"An AirAsia plane accidentally flew more than 400 miles in the wrong direction"},{"comment_id":"1569451360020943","commenter_b":"It's called treason, hang her.","commenter_a":"ABSOLUTELY NOT!!!!! We need to MOVE ON!!!!!!! Stop beating this DEAD horse and help the people, NOT YOURSELF INTERESTS!!!!!","post_message":"“I talk about the emails all the time and what can you say, does it get anymore corrupt or crooked than that?”  Donald J. Trump argued that Hillary Clinton is being protected from prosecution relating to her private email server. Do you agree with him?"},{"comment_id":"881902655289442","commenter_b":"Something is wrong with this woman's reasoning. If the plumbing says you are a man, you are a man.","commenter_a":"Just more of Obummer bullshit, today I feel like woman ,today I feel boy, today I feel privilege so today ogle little girls. ,today I'm black or am I white, damn asswipe..","post_message":"According to the attorney general, laws cannot be made to define gender because individual feelings trump the law.  What if I feel like I already paid my taxes, even if I didn't. Do I still have to pay them?"},{"comment_id":"10154532123498271","commenter_b":"Oh, you're so compassionate from your suburban home, Kim. Here's to hoping they move in next door to YOUR family.","commenter_a":"So green card holders and those with dual citizenship are our enemies? And regardless of that, these people, they are us. We or generations ago of us were standing on this land as immigrants. They are us.","post_message":"\"This is not about religion - this is about terror and keeping our country safe,\" says President Donald J. Trump in new statement.   @webpagelink"},{"comment_id":"10154033420732293","commenter_b":"He is just a Gangster! Sick! Abnormal!! Frighten thing!! If they indeed build the wall and this crooked man wins, every American is going to regretted as the will try to jump to the other side (Mexico) trying to be safe from his menace. He wouldn't care about America as long as him and his family gets their hands on the treasure, Money, Power and Threats!!! And American who voted for him, will find a job in Mexico planting food and cleaning, karma!!! Just let him win and you will see and live as Latinos, Africans and Chinese after a war.","commenter_a":"Imagine if you will 'The Donald' as POTUS - and after a speech, address, whatever.....people are scrambling to yet once again 'explain' what he said, to have to diffuse a potentially volatile situation with another country or world leader. I want my President to have clarity of thought, to speak in a measured, thoughtful and highly educated tone. I don't want her or his words to be subject to interpretation. His rhetoric is inflammatory, bigoted, and often without thought. His use of language is at best that of an arrogant, whiny, teen-ager. No way does this man possess the skill-sets needed to be my president.","post_message":"There have been multiple explanations. There haven't yet been any that work."},{"comment_id":"10153542533598352","commenter_b":"Wtf.....it's not like her f ing nipple is sowing or something.....how about telling the girl who come with the dress so short they can't bend down to pick up something.....how about telling the girl with their clothes so tight they can't breathe.....sweetheart enjoy your time screw them.....if they still messing with you just let hulk out and tare the place apart....well I would....I can't have fun no body having fun","commenter_a":"That's messed up they just trying to find things wrong","post_message":"Mother slams school officials who insisted her daughter's floor-length, long-sleeved prom dress was 'too revealing', claiming they 'targeted' her because she is 'plus-size'"}]
