[{"comment_id":"10153259409494060","commenter_b":"Having engaged in a few discussions on the subject of party politics, I think the results of this quiz might suprise some of you. Go on give it a go.","commenter_a":"Could be good if it was resposnsive!","post_message":"Attention all eligible Britons! Not sure how to vote in this year's election? Take our election quiz: a blind test of the parties' policies. Then get yourself to a booth on May 7th @webpagelink"},{"comment_id":"10154379213963812","commenter_b":"Go back to Europe. Lol","commenter_a":"Go TRUMP build the wal!! Deport illegal all of em Ban muslims Lets make america great again! !!","post_message":"Donald J. Trump announced on Good Morning America that he \"probably will take small contributions.\""},{"comment_id":"416369798522976","commenter_b":"Cheeko you ignorant slut. Stop acting like you know anything.","commenter_a":"Russia, get your shit together.","post_message":"Last year, fans of the Moscow CSKA team chanted racist slurs during a match against Manchester City. A year earlier, fans of Torpedo Moscow threw bananas at player Christopher Samba, who is from Congo, during a game against another rival Moscow team."},{"comment_id":"1659939417632867","commenter_b":"This would be true if Hillary got in! Stupid racist black woman!","commenter_a":"Real Hope and Change is coming to Americans !!","post_message":"SHE'S BACK TO HATING AMERICA: It's the end of \"hope and change\" and Michelle, for one, isn't happy about it."},{"comment_id":"10154271863249071","commenter_b":"China! China ! Chiana!","commenter_a":"Lorenzo","post_message":"Alibaba.com founder Jack Ma meets with Donald J. Trump."},{"comment_id":"1003361709753187","commenter_b":"Coming from someone who puts stupid cartoons of her self on Facebook! Lol. Maybe Leslie could get a brain in the next one and give up on Hillary!","commenter_a":"When trump gets elected maybe this bug eyed freak will leave and take his high girlish voice with him","post_message":"*Shivers*"},{"comment_id":"1173335299353316","commenter_b":"Lady...Just give it up and go home!!!!","commenter_a":"Pathetic!!","post_message":"\"I don't think what Donald J. Trump says is worse than actually what Hillary Clinton in fact has done.\"  - Green Party presidential nominee Dr. Jill Stein"}]
