[{"comment_id":"1647670705273781","commenter_b":"This dude is in trouble. He better start working for the people who elected him, or his ass is grass","commenter_a":"Government that works? Republicans are out to prove to us that government is bad by giving us spectacularly bad government.","post_message":"Jason Chaffetz's contentious town hall in deep-red Utah proves Americans care more about a government that works than partisan politics."},{"comment_id":"10153979603521509","commenter_b":"Time for all illegals to go home","commenter_a":"Rather have trump in kkk then black panther party","post_message":"Former Ku Klux Klan leader David Duke said Donald J. Trump is the \"best of the lot\" -- but didn't endorse him for 2016: @webpagelink"},{"comment_id":"10157484651970725","commenter_b":"@username PAM she is already DESTROYING THE COUNTRY !","commenter_a":"Go trump ! So, 96% of Hillary's charitable donations went to the Clinton Foundation! Yeah, 96%, they donated to themselves.","post_message":"Unbelievable! Thank you Erie, Pennsylvania. This is a MOVEMENT! I have no doubt that we are going to WIN -- and MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"},{"comment_id":"1174759955897808","commenter_b":"And assholes will be assholes!","commenter_a":"They are F'n PIGS... We learned that in the sixties... How soon the ignorant forget. PIGS BE PIGS... NOTHING HAS CHANGED","post_message":"We FINALLY have the proof!"},{"comment_id":"10155151407594575","commenter_b":"Illegals have to hide behind walls to avoid deportation. They build their own walls. Saw absolutely no effects from a day without immigrants, Guess they don't really matter.","commenter_a":"Awesome.","post_message":"Business owners are standing behind their decision to fire workers who participated in \"A Day Without Immigrants\" protests.  They say it's not a political stance but rather a business decision.  \"If you're going to stand up for what you believe in you have to be willing to pay the price.\""},{"comment_id":"1760652447526552","commenter_b":"@username you can eat in a public restroom and listen to people pissing and shitting and sit there and smell it for 10 minutes!! I don't even use public restrooms for myself if I can avoid let alone for my baby to eat in! If everyone wants to be politically correct then make a bottle fed baby eat in a restroom with a blanket over their heads too! That bottle nipple is replica of a mother's real nipple, for a REASON!","commenter_a":"It's okay to breastfeed in public. Its the way your doing it that offends people. If you're gonna breastfeed in public at least have some decency to have at least something to cover that part of your body and the baby while nursing. Simple but effective.","post_message":"A Connecticut woman is speaking out after posting a viral video in which she was yelled at by a man for breastfeeding her baby in Target."},{"comment_id":"992066754146411","commenter_b":"No, we don't want their kind here.","commenter_a":"How great it this to see! The same people who have always looked down upon us Tacoma people are now wanting to live here. Sweet justice is here. :)","post_message":"#Seattle workers are moving from the city to #Tacoma -- in the search for more affordable living! [kiro.tv/SEAtoTAC] Do you think:   A. Seattlites shouldn't have to move, rent control please! B. This is making Seattle traffic worse.  C. Moving to Tacoma or a suburb is a good solution.  D. (Your own answer)"}]
