[{"comment_id":"10153611062907217","commenter_b":"#LetAmericabebadagain trump2016","commenter_a":"If you vote in this racist idiot as your president , Your country will be going down the shitter for many many years to come. The guy is a nut job who hasn't got a clue !! He's a threat to world peace ... Anyway good luck America","post_message":"\"I am offended. Those are very rude statements.\""},{"comment_id":"10155029420463690","commenter_b":"Because women are more corrupt than men","commenter_a":"First Brazil female president now Argentina. Jealousy men and women hounding women for things they continue to let men get away with. Same with Imelda and Gloria from the Philipines and current S. Korea, India's Sonia Ghandhi, liberia's grandmother, Pakistan Benezir Bhutto female presidents/PM etc!","post_message":"Cristina Fernandez Kirchner, the former Argentine president, has been charged in a corruption case and slapped with a $630m asset freeze over public tenders awarded to a businessman friend during her administration."},{"comment_id":"10154707923201800","commenter_b":"hahahah omg yes!","commenter_a":"Now we're fucked. Like the Civil War and the Civil Rights Movement, this is yet another horrible scar on our nation. The damage was already done, and now it's just worse. I seriously hope our younger generations, myself included, can fix this within our lifetime. Shame on all of you who made this happen.","post_message":"Ready for either outcome. Tune-in to our LIVE Election Special tonight at 11/10c! #election2016"},{"comment_id":"10153892680026680","commenter_b":"Get a grip Republicans! Don't get weak and give up on Trump! The stakes are much too high! Our lives as we have known them will never be the same if Hillary Clinton wins this election! Donald Trump apologized for things that were said in private 11 years ago but Bill Clinton has yet to apologize for putting his cigar in places it shouldn't be while in the Oval Office and being paid by the taxpayer! There is no low that Killary and team will not stoop to in order to steal this election! October 6, 2016 Clinton Foundation HACKED – Now We KNOW Hillary Clinton Stole More Than Taxpayer Dollars! barney-frank Americans may have been disappointed when Julian Assange announced that he didn’t have an October Surprise for Hillary Clinton, but they weren’t disappointed for long. Another hacker stepped up with an explosive leak. Going by the name “Guccifer ...","commenter_a":"This is too far. You can't start talking about someone is father specially if they are deceased.","post_message":"The file is all of eight pages in length, suggesting the bureau never subjected Fred Trump to any serious scrutiny prior to his death in 1999."},{"comment_id":"1854247478194959","commenter_b":"Why you do this to me","commenter_a":"@username try not to cry","post_message":"Walnut the whippet was not alone on his final walk 🐶😢 #walkwithwalnut (via BBC England)"},{"comment_id":"1237650529605618","commenter_b":"Who is going on the Walking Dead cruise in February","commenter_a":"This is kindergarten.....,childish.........by.....","post_message":"The Walking Dead gift reveal party"},{"comment_id":"1109422589147098","commenter_b":"Dumb whores for Trump","commenter_a":"He has no respect for anyone. Scum","post_message":"In a battle between Trump and Intelligence, Intelligence wins."}]
