[{"comment_id":"10153242618583132","commenter_b":"First Dr. Nancy Snyderman and now Brian Williams betrayed us!","commenter_a":"Yea a permanent one lol","post_message":"Brian Williams tells staffers that he is taking a break from NBC Nightly News amid his recent scandal."},{"comment_id":"10154302113081509","commenter_b":"She had them surgically removed. She also doesn't have a brain or even a modicum of decency. And THAT is why she's running for office! Hellary 2016!","commenter_a":"Hillary would you like to have your husband also in prison ? Or else a dildo is enough ?","post_message":"Hillary Clinton had a message for a supporter's father who is backing Donald J. Trump"},{"comment_id":"1722289054713180","commenter_b":"notice how she talks about white man?","commenter_a":"@username Former foreign minister , has failed in its mission and has caused much of the confusion the US administration @username was not calling things by their names correct .. for example, terrorist organizations ( liberation movements ) , states that support extremism ( our friends ) , dictatorships ( our partners ) @username win means that a disaster occur American nation","post_message":"Women across the country lose out on every paycheck—and women of color feel it the most. Our families can’t wait: It’s time to ensure equal pay for women. hrc.io/EqualPayDay #EqualPayDay"},{"comment_id":"451215538402360","commenter_b":"I will refuse, fuc her and the dirty dog she rode in this on!","commenter_a":"YES","post_message":"Will You Refuse To Turn Over Your 2nd Amendment Rights To Michelle?  Comment 'yes' or 'no'."},{"comment_id":"10153383373028984","commenter_b":"Why don't you go back to where you came from Asshole!!!!","commenter_a":"President Obama said the right thing.","post_message":"Israelis are NOT happy about this, and it's easy to see why. Whoever becomes president in 2016 will have a lot of work to do in repairing relations with Israel...  Do you support Benjamin Netanyahu - בנימין נתניהו and Israel despite what Obama does?"},{"comment_id":"10152895696909342","commenter_b":"shoot her in the face..","commenter_a":"Smh","post_message":"Police: Woman tosses baby out of car window during traffic stop. abc13.com/@username/"},{"comment_id":"10153688042296028","commenter_b":"No way!! Frankie","commenter_a":"He not dead tf","post_message":"Update: Prince's publicist confirms that the pop superstar has died.  A death is being investigated at the Minnesota property of singer Prince. The identity of the person has not been released. @webpagelink"}]
