[{"comment_id":"10153394569638984","commenter_b":"What's her problem. Can't she walk straight.","commenter_a":"Crook ( I mean acorn or nut ) probly isn't far from the tree","post_message":"Shakedown artist Al Sharpton’s eldest child wants damages for “loss of quality of life,\" but looking at her recent photos, something seems a little fishy about the claim...  Are you glad to see the younger Sharpton outed for this?"},{"comment_id":"10154087953651491","commenter_b":"GO AWAY","commenter_a":"I Finally found the link original watch Suicide Squad {2016} full movies @webpagelink watch Don't Breathe {2016} full movies @webpagelink watch Bad Moms {2016} full movies @webpagelink watch Fifty Shades Darker {2016} full movies @webpagelink watch Doctor Strange {2016} fulmovies @webpagelink","post_message":"Sometimes the landlord/tenant relationship can be a difficult one. But it doesn't have to be that way."},{"comment_id":"10153737877981409","commenter_b":"What a jerk!!! He thought what he did was a start for his 2020 presidential run. After tonight, he'll never be elected. He shot himself in the foot and his chances for 2020.","commenter_a":"Unfortunate choice. He committed political suicide and will take the name \"Lyin' Ted\" to his grave.","post_message":"Former Trump rival Cruz met with boos during GOP convention speech."},{"comment_id":"10153202617203690","commenter_b":"Stupid girls!!","commenter_a":"We must ask ourselves why and find the antidote. The only way.","post_message":"Security forces estimate some 600 British Muslims have travelled to Syria to join the conflict there, some of them with the Islamic State of Iraq and Levant group."},{"comment_id":"884069771715072","commenter_b":"Remove the traitor ASAP !","commenter_a":"Yes.","post_message":"Obama Announces DEVASTATING Executive Order Right Under All Of Our Noses.  He is completely abusing his power.  Do you think Obama should be removed from the White House?"},{"comment_id":"10154507396141051","commenter_b":"Maybe the kid should go to history class and learn how the evil \"white\" people voted to free the slaves. Oh ya, it was only the republicans who voted that. NOT ONE DEMOCRAT. And maybe he should learn that the flag represents freedom from the brits, For all Americans. If he doesn't like it, maybe he should take a year for some overseas education. Say France maybe.","commenter_a":"Move if you don't like America","post_message":"This teenage boy refused to stand up out of his chair for the Pledge Of Allegiance because, in his words, \"America sucks.\" Here's how his teacher responded."},{"comment_id":"1159279537467495","commenter_b":"The Obama 's are more racist then anyone else Michelle everytime she opens her racist mouth it's all about her give me a break and it's true the other 1st ladies have more class then she will ever have and it has nothing to do with the color of her skin if the whites are so racist he wouldn't have been in office","commenter_a":"I wish she has racism up her back side!!!","post_message":"Michelle Obama Calls Out Military Racism  This Marine Answer Is DEVASTATING!"}]
