[{"comment_id":"10153053153366717","commenter_b":"I can't believe how selfish this woman really is! How can she make a whole office and try to make the whole county think the way she does?! She gives no condition the others in her office that have to work under these stressful conditions. Amazingly selfish. God must be so proud.","commenter_a":"The Devil is your boss and no she is not going to let this die","post_message":""},{"comment_id":"932314590139215","commenter_b":"She's definitely covering her butt! It's all about the $$$$$$$$$$!","commenter_a":"Her check book should get a lot smaller after her nasty comments to all Americans. She just sunk her ship. Remember the Dixie Chicks comment?","post_message":"After 24 hours, Ariana Grande has issued an apology for saying she hates America.  And it's very bizarre."},{"comment_id":"10157615901290389","commenter_b":"What about the arrests of all those that beat up and tried to burn people alive?????","commenter_a":"The reporters should have asked the protesters if they had a job etc.........","post_message":"Breaking News: A suspect has been arrested in the shooting death of a protester during rioting Wednesday, Charlotte's police chief says."},{"comment_id":"1243101862382258","commenter_b":"Wolves in sheep's clothing!!!!!","commenter_a":"Those of you who comment on this in a judgmental way will face your own judgment because of it. God knows the hearts of everyone. Let's walk with Christ and see the beauty in this video and resist the urge of the Evil One to tear it apart and make it less than what it is. It seems to me that Mr Trump is seeking divine guidance through strong Christian leaders. He is very wise and God will make him wiser for this. (Please read this thread...I have been led to the truth by my brothers and sisters in Christ Jesus. Amen!). May God bless them all.","post_message":""},{"comment_id":"10152505642191770","commenter_b":"She finally bought herself some new boobs?","commenter_a":"People dont realize that both Kim K and Paris are shrewed business women.","post_message":"Remember Paris Hilton? She's back, and she's letting it all hang out."},{"comment_id":"1012396785523240","commenter_b":"BUSH AND CHENEY WAR CRIMINALS!","commenter_a":"BENGHAZI, EMAILS, Feckless Foreign Policy , He is a Muslim , look at this snow ball Mr, President... Im not a Scientist , repeal Obama Care and shutting down the government again ?","post_message":"11 days and one massive to-do list."},{"comment_id":"10155094877376037","commenter_b":"She deserves the same treatment.... sick sick sick nasty woman. She doesn't deserve life","commenter_a":"Where's the picture of the mother?","post_message":"14-year-old Grace Packer was beaten, raped, poisoned and strangled."}]
