[{"comment_id":"1031660353527286","commenter_b":"I dunno, it seems like America went from a pretty nice country with polite, religious hardworking people to lazy, angry mean spirited race conscious materialists since those days. So I think there is nothing to celebrate in this 40 year decline since then.","commenter_a":"I am surprised the director of this movie which claims it is historical, heard recording of 1964 meeting between LBJ and MLK and knew Johnson cared deeply over black voting issue but she depicted him as indifferent! Why would she do that? I hear LBJ daughters and aides are furious!! We should all be!!!","post_message":"Our so-called #CivilRights president: I am surprised the new Selma Movie omits the Obama connection—oh wait, there isn't one!"},{"comment_id":"10154345885036051","commenter_b":"No second chances for this crazy woman!! That poor girl going thru all those surgerys...","commenter_a":"The sister is right she is not a monster!! She is a crazy bitch! And to me the sister is as bad, would she want the mom released if it had been her that had been put in an oven!! I mean seriously what the hell is wrong with people?? And myself i have a hard time buying the insane bit anymore, to many times it is used to try to get away with doing wrong!","post_message":"When she was only 14 months old, Ashley's mother put her in the oven and turned it up. Her father was able to save her. She spent the next 10 years in and out of surgeries. Now she is 15 and ready to start high school - and she just got some unexpected news about her mother."},{"comment_id":"259111647859034","commenter_b":"Yes $85 million!!! They're saying that he abused he used to go to the most expensive hotels, restaurants, and buy so much expensive stuff since tax payers are the ones that were paying !!! A lot of luxury vacations for Mr. Obama !! And before leaving the office he send $221 million to the Palestinians !!!! I wonder since when he was sendings them money. that's why noooo I don't miss Obama ! I don't agree on some stuff Trump is doing but I hope he can makes this country great cause Obama did a lot of F***** up stuff to this country and I guess that's what people want a president that lies to us and do stuff that we don't know !!!","commenter_a":"What? A weekend at his own property? The nerve! He should be on a beach in Hawaii, sucking up the taxpayer's money! The utter gaul of this man!!!","post_message":"LIVE NOW: Trump arrives in Florida on Air Force One."},{"comment_id":"1701996636715698","commenter_b":"@username What kind of murder,Cuz whites kill in record numbers in one single act of violence.","commenter_a":"Imagine the riots and violence that would be rampaging across the country had police shot four African Americans overnight - even were they all legitimate uses of force.","post_message":"Ambushed for wearing the badge: Four police officers in cities across the country were shot overnight.   There’s a manhunt for a suspect who shot and killed San Antonio Detective Benjamin Marconi as he sat in his squad car outside police headquarters. @webpagelink"},{"comment_id":"1380609545301335","commenter_b":"GOOO NORTH DAKOTA, WISCONSIN, CA. , NEW YORK BRING IT ON IN!!!!! ALL ABOARD NEXT STOP THE WHITE HOUSE!!! ADDING COAL TO THE TRAIN!!! MEDIA,MEDIA, MEDIA!!! NO MATTER HOW YOU TRY YOU CAN'T TRUMP THE DONALD!!!! CRUZ KASICH =ESTABLISHMENT'S COCKROACHES!!! A VOTE FOR THEM IS A VOTE FOR HILLARY OR BERNIE!!!!!! ALL ABOARD !!!! NEXT STOP THE WHITE HOUSE!! T TRAIN R ROLLING U UNITED M MOVED BY THE PEOPLE P PRESIDENT TRUMP","commenter_a":"Any word on royal booze taster Glenn Beeks and his daily abuse of Christianity. I mean what a embarrassment that guy is using God and Christianity to prop up that disgusting philanderer Cruz","post_message":"It's a super religious day or something, he maybe thinks."},{"comment_id":"10152641754716367","commenter_b":"Yes she is!!! She wears Spanx.","commenter_a":"Mucho baggae...g","post_message":"The Hillary Clinton email controversy is a reminder of one inescapable fact: She comes with baggage."},{"comment_id":"10153993590153203","commenter_b":"Well, Sharon, I'll tell you what. I don't know a lot of women who regretted NOT aborting their baby. I know quite a few women who DID regret aborting their baby. And I know a lot of judgmental, intolerant women who pronounce when they think another woman SHOULD have had an abortion. That, and Margaret Sanger's avid stance on eugenics, says a lot to me about who is pushing the abortion agenda and who is falling for their bs.","commenter_a":"I was assaulted & I chose to keep my baby. For me I only had 2 choices either A. Keep her or B. Put her up for adoption. Killing my baby which is abortion never crossed my mind. Today she is almost 9 months and I thank God for her every day.. She is a blessing to me and God has a plan for us. I can't imagine my life without her. If your Pro-life you believe in LIFE No matter what.. So even in assault/rape or incest a baby should live. It's not the baby's fault what happened. No one knows how a baby was conceived.. God has a plan for ALL unborn babies.","post_message":"Christie and Bush attack Cruz, Rubio for being too pro-life"}]
