[{"comment_id":"10152928923462293","commenter_b":"His twin appears normal. She also got a lead paint settlement?","commenter_a":"\"Didn't Die In Vain\" . . . but he lived in vain . . .","post_message":"Reports of Gray’s history with lead come at a time when the city and nation are still trying to understand the full ramifications of lead poisoning."},{"comment_id":"939707739399900","commenter_b":"It used to be fairly common to have a cross on the flag pole representing the same thing as Christ above all.","commenter_a":"I am a Christian but, no flags are to be flown over the flag of the United States. I DO feel his frustration but, this is a no-no. God Bless America !","post_message":"Are you OK with this?"},{"comment_id":"10154550859487464","commenter_b":"There are much better health coverage alternatives out there. Feel free to private message me for details.","commenter_a":"We tax payers all got fleeced big time.","post_message":"“The reality is the Affordable Care Act is no longer affordable for increasing numbers of people.”  #FullRepeal: @webpagelink"},{"comment_id":"950867651635304","commenter_b":"The son of a bitch is white----that's why!!","commenter_a":"How bout this bastard coward be sentenced to 79 years, the age of the gentleman he hit, please put him with the gangs","post_message":"Texas man who filmed himself assaulting an elderly black man during what is known as the “knockout game” sentenced to 71 months in federal prison.  Conrad Alvin Barrett was charged with a hate crime for punching 79-year-old Roy Coleman, fracturing the man’s jaw in two places. Barrett said he targeted the man to see if the assault against an African-American victim would be nationally televised. MORE ----->  @webpagelink"},{"comment_id":"1185753454849738","commenter_b":"Hope to hell this arrogant prick gets put in prison !!","commenter_a":"Who cares...arrogant classless racist. Good riddance.","post_message":"It's always about him. Always."},{"comment_id":"10152918751311336","commenter_b":"Because there wasn't technically a government and laws like European style governments didn't give the European invaders the right to grab the land and kill the people that were already living here my ancestors didn't welcome yours","commenter_a":"If you are in a country without the required paperwork, you are an illegal. Check the dictionary please.","post_message":"\"We don't believe in capitulating to people who are going to tell us how to run our newspaper,\" said Scott Steepleton, city editor of the Santa Barbara News-Press on FOX & Friends Weekend."},{"comment_id":"1332532336775650","commenter_b":"Trump \"Hillary is a Bigot\" there you go! This is exactly where this phrase came from~ the Pot Calling the Kettle Black. Okay you Mexicans can stay in the US , But must pay, I will Not build the Wall, Mexico will not have to pay for it , I Love the Mexicans, my African Americans, Muslims and attractive women... I was only Joking, being sarcastic, just a suggestion. I love Rachel Maddow! ha","commenter_a":"I think it is hilarious the Trump supporters come to a Hillary site and post their idiotic remarks. Like their posts have any meaning or validity. It's not like they are going to have any affect on changing Hillary supporters minds.,","post_message":"8 things you can do *today* to help elect Hillary: hrc.io/2bQizDc"}]
