[{"comment_id":"10154142762821756","commenter_b":"Carol Andrews Wilfork ....\"Concerned about appearances?\" Good one! Hillary Clinton would never be allowed to be an angry, cantankerous revolutionary with wild hair like Bernie....she would not make it in American politics. Women have to play a completely different game...and look good doing it or they are toast!","commenter_a":"Perhaps true criticisms of Rubio, but along with Rand Paul find them to be the most rational and reasonable persons at the debates.","post_message":"Some say the first-term Florida senator is inexperienced. Some say he's inconsistent. And others question how his loss in Iowa is being spun into a quasi-victory."},{"comment_id":"1776830319009844","commenter_b":"Maybe Cat is looking for a sanctuary city for cheap labor .","commenter_a":"Thanks","post_message":"Hardworking men and women from Peoria have always taken great pride in knowing their community has been home to Caterpillar, and there’s no denying this news is a real blow. Two years ago, I joined with officials from across our region as Caterpillar announced its intention to expand its footprint and keep its headquarters in Peoria – so this news comes as a shock. Our local economy is tied to the success of Caterpillar. My hope is that Caterpillar will keep the promise it made today for Peoria to remain its largest manufacturing site. I stand with all Peorians in expressing my deep disappointment with this decision."},{"comment_id":"10153569375843203","commenter_b":"Unless Rosie O'Donnell is raping you, she isn't forcing herself on you. I know many gays and I must be lucky to have escaped their revenge and then forcing their lifestyles on me since I'm still straight. Rosie O'Donnell is and always will be a loudmouth and a celebrity. Don't like it? Don't watch her.","commenter_a":"..Many of them are miserable, intolerant people hellbent on revenge ,forcing their lifestyles on others, and making everyone else miserable also.....Example : Rosie O'Donnell - one of the most miserable, intolerant people forcing herself onto the public...","post_message":"Study finds homosexuals less healthy, happy than heterosexuals    @webpagelink"},{"comment_id":"10154535471263812","commenter_b":"I'm a white female, and I sure as hell don't trust her","commenter_a":"\"Voters of Donald Trump are sexist idiots that rather vote for a fellow idiot than a woman\"","post_message":"Poll shows 18% of people who say they will vote for Donald J. Trump think the real estate mogul is not qualified to be president."},{"comment_id":"10154364961931320","commenter_b":"I don't like seeing fat chicks in spandex but yet I'm made to tolerate it.","commenter_a":"Was she covered up or like in the article picture? I am a mother and have no desire to see someone breastfeeding. Cover it up. That experience is between you and your baby and no one else.","post_message":"The sight of a woman breastfeeding her baby was enough to cause a male Target shopper to go off in a series of verbal assaults. @webpagelink"},{"comment_id":"1806555102961372","commenter_b":"Why does she keep bringing up controversy. Be done with it Megan! And get over yourself!!!","commenter_a":"Obama has flooded our country with muslims over the last 8 years to buy votes and destroy our country. America First an no PC.","post_message":"\"I welcome immigrants. I welcome people from all over the world to join us here. But I want to make sure that it's safe for Americans in my country that I fought for,\" Carl Higbie told CAIR Florida leader Hassan Shibly."},{"comment_id":"10152966596170399","commenter_b":"And all these illegal f$^%ers are going to Disneyland!","commenter_a":"Hire a illegal alien get a $5000 fine! A New Border Surge Opens Us To Surge Of Epidemics Border Surge: Secretary of State John Kerry warns of a new surge of illegals, just as Central America is being hit by a new wave of epidemics. No doubt about it: President Obama's open-borders policy is exposing us to disease, too. It's plain what's bringing up this great wave of diseases: immigration politics. President Obama is so obsessed with winning Latino votes for Democrats by neglecting border laws that he's unwittingly opened the U.S. up to a variety of third-world diseases. He's released tens of thousands of medically unscreened illegal immigrants into the U.S., supposedly to prepare for their immigration hearings, which 70% never show up for. The epidemics are small now, but the risk is rising. And with a new wave of illegals in the pipeline, where's the will to stop ...","post_message":"\"Anti-vaccination is tailormade for deeply selfish people, because it gives them a chance to show off how superior they think they are while shifting the cost of their choice on other people.\""}]
