[{"comment_id":"10155032769051757","commenter_b":"Great","commenter_a":"Excellent! I hope to see you do many more of Fox's interviews with President Trump. You deserve it. Thank you for always reporting the truth when others didn't.","post_message":"Question of the Day: What did you think of my interview with President Donald J. Trump?"},{"comment_id":"10153095274501600","commenter_b":"JERK","commenter_a":"there needs to be an (unlike button)","post_message":"“We are entering the curvy girl era and when all eyes are on the bikini babes of Sports Illustrated, it would be a great time to have the conversation about the rise of the curvy girl,” a spokeswoman for Sports Illustrated said."},{"comment_id":"904971426268782","commenter_b":"If they are illegels they can't vote cause they,are not citizens","commenter_a":"They most definitely, without a shadow of a doubt should not now or ever be able to vote! ONLY citizens of these great United States of America have the honor and privilege to vote in elections! Period! End of story!","post_message":"Last I checked illegal means illegal and you have no rights in America!"},{"comment_id":"512912212228885","commenter_b":"Beyonce!!!!!!!! Gave them the green light.. They wAnt what you have but don't want to educate themselves or help themselves. LAZY","commenter_a":"I think that this man that served alongside of every single race in the world as a brother, was assaulted by black thugs representing their selves as Black Lives Matter. Now let's see if someone from BLM will stand up and condone this behavior, or embrace it. There is racism in every race, but the citizens that stand alongside each other and condone this, are the true brotherhood.","post_message":"*****BREAKING NEWS*****  They said these 6 words..."},{"comment_id":"714422425388653","commenter_b":"Get out of this country!!! The USA was great until you damn Devils Muslims started to come here!!!","commenter_a":"I don't care. Take that shit off. What do you have to hide. You want to wear it , wear it at home.","post_message":"She filmed it.   WATCH the video very closely..."},{"comment_id":"1076375005794438","commenter_b":"I bet you are one of those that says it was just \"locker room talk\" when Trump spoke of grabbing a woman's pussy, aren't you? \"Hey, boys will be boys\"","commenter_a":"The flight attendant was not harassed, intimidated or any other federally worded names that aren't allowed. She made a mountain out of a molehill. Very irritating.","post_message":"Alaska Airlines confirmed that a different passenger's Facebook post detailing the incident on Flight 520 was accurate."},{"comment_id":"706998779490700","commenter_b":"I'll help her pack!!! Don't let the door hit your big fat ass on the way out!!!!","commenter_a":"She is as big a piece of shit as her husband","post_message":"Michelle Obama was caught bad mouthing America in this newly surfaced video. If she doesn't like America, she can leave. Would you be happy if Michelle was gone?"}]
