[{"comment_id":"10152979533166438","commenter_b":"I love Katy, But I did noticed that and it made me laugh. She has no swag! But I think that's part of who she is she knew she couldn't dance for shit but she went and did her thing with a fresh face.","commenter_a":"What makes me laugh is how people are talking about the shark... Did we not notice Katy herself completely unable to move as a quasi-good dance partner with Elliott's dancers?!?!","post_message":"\"We should leave Left Shark alone.\""},{"comment_id":"10153529915413010","commenter_b":"slave labor??","commenter_a":"Here's an idea..... Send the illegals home and put nonviolent incarcerated inmates to work on these farms.","post_message":"\"We have a large population of people who came here to work, not to be any kind of a security threat to anybody,\" said Bryan Little, of the California Farm Bureau Association.   \"And they came to work in an industry that needs them badly.\""},{"comment_id":"1738737039712860","commenter_b":"Republicans are not racist like the democrats would like you to think we just want a safe and secure country. They blocked him bc he wants to give our country away!!!! Illegals do not belong here!! There should be no sanctuary cities to protect them. Anyone coming here needs to take the steps to be a citizen first!!","commenter_a":"Y all the hate? What have Obama done that is so terrible? To my opinion he is one of the best. They races republicans stop him since day one, cuz they want him to fail. Block him all the way...","post_message":"President Obama's approval rating stands at 55% in a new CNN/ORC poll, the highest of his second term"},{"comment_id":"341937372643300","commenter_b":"Do you consider such hate to be Godly?","commenter_a":"It simply explains our Republic ...For which it stands....We are one Nation under under God...ALWAYS....OUR GODFATHERS KNEW THE MEANING OF REPUBLICS...Look it up...The American Flag is Our heritage....Obama is illegal trash....his followers as well...Demorats.s have sunk lower every year...This Obama is a bottom scraper...Clinton And Sanders are also bottom feeders.They NEED to be removed from office ...Ungodly monsters...","post_message":"I agree!"},{"comment_id":"966904363440661","commenter_b":"Says the liberal tard cat lady","commenter_a":"What would you expect from a woman with 1000's of nude/lesbian porn pics on the internet to wear? She's a hoe and trump a con artist. The Whitehouse is going from class to trash.","post_message":"When people saw what Melania Trump wore to mass, they were simply outraged. Do you think what she wore was appropriate?"},{"comment_id":"10154370353509714","commenter_b":"She must be a psycho...","commenter_a":"I sense a new song coming","post_message":"Taylor Swift and Calvin Harris have called it quits."},{"comment_id":"911046885608046","commenter_b":"LIKE I SAID, SHE KILLED THOSE KIDS. A BEE?! Get out of here with that mess. Throw the book at her. @username,","commenter_a":"Whatever!! She killed those kids.","post_message":"Two 18-month-old twins drowned in an Arizona canal Friday after their mom briefly let go of their stroller to fend off a bee: @webpagelink"}]
