[{"comment_id":"10153782621653869","commenter_b":"That's been exactly the narrative. It's about time for a woman president. There's a special place in hell. Bernie girls are just boy-crazy. It's her turn. Thou shalt not question Her Inevitability.","commenter_a":"The media have been crowning her daily since 2015. Your daily reminder that at this point in 2008, her backers (motto: \"Party Unity My Ass!\") were still promising a bloody floor fight at the convention and demanding she be awarded all the illegal Florida delegates. Something to remember when you hear Hillarrhoids calling for you to \"line up behind her.\"","post_message":"Today's Daily Cartoon by Kim Warp. See more cartoons with our randomizer: @webpagelink"},{"comment_id":"10153228177684411","commenter_b":"Yes, and Russia is one of them, no?","commenter_a":"The only reason that Putin has troubles on his borders is that he steadfastly refuses to keep his troops within them. Russians need to elect a leader committed to managing their economy effectively instead of pursuing fantasies of reconstituting the old USSR.","post_message":""},{"comment_id":"10153150337159607","commenter_b":"He didn't live there 6 years. Stop believing everything you read, or make up in your head. Respect his family and friends right now and stop thinking this was a conspiracy","commenter_a":"Police did it he was going to expose the police for the dirty","post_message":"A Baltimore City police officer was found facedown in the water in South Baltimore Tuesday night. Officer Prashanth Davis, 34, was pronounced deceased at the scene."},{"comment_id":"10154434943826323","commenter_b":"The Arab trade was on a larger scale mate.","commenter_a":"The British Empire and other European nations were not the only ones responsible for the suffering of blacks. For centuries, Arab and Berber traders made big profits from the highly lucrative 'business' of slavery. Millions of black Africans were captured/kidnapped from their homes, abused and sold in slave markets. Today, In places like Saudi Arabia and Qatar de facto slavery still exists. People from the Philippines, Indian subcontinent etc. live and 'work' there in subhuman conditions. This is not a history lesson. It is happening right here and now. None of this justifies in any way the crimes committed by European colonialism in general and the British Empire in particular against indigenous peoples. But I do hope Mr. Gayle (whom I respect) will not hesitate to write/speak about injustice and racism that still exist in other parts of the world - including in African and Arab nations - with the ...","post_message":"Howard Gayle: \"The education system told me nothing but lies about Africa.\""},{"comment_id":"1101655299855480","commenter_b":"Can't be bothered. This isn't science its novelty","commenter_a":"I'm skeptical. Tree rings are concentric not spiral. How would the needle track?","post_message":"Find out what tree rings sound like:"},{"comment_id":"10153778405133854","commenter_b":"Who cares what she told her daughter","commenter_a":"She is above the Law, Richard Nixon looks like a choir boy \" truth has no meany, Anymore\"","post_message":"Hillary Told Daughter Chelsea That Terrorists Were Behind Benghazi Attack The Night It Happened [VIDEO]"},{"comment_id":"955398181243627","commenter_b":"And we will ship them out idiots","commenter_a":"BIGGEST WANKER MUSLIM OF ALL TIME","post_message":"This is only the beginning..."}]
