[{"comment_id":"10154119755618188","commenter_b":"now why on earth would you go and say something so hateful?","commenter_a":"Glenn is an idiot","post_message":"Crazy flash back photo from the early 90's.    Mike Opelka center and a long haired drinking Glenn."},{"comment_id":"700248193457289","commenter_b":"@username honey your aluminum cap should b worn at all times ...","commenter_a":"When he opens his mouth he divides. Expected from a 1/3 white 1/3 black and 1/3 Arab who is a closet Muslim. Conflicted hate eVeryone but MUSLIMS. THATS TRUTH NOT A FALLING LYIN' tree.","post_message":"Probably... but we'll never really know will we?  Hostile Politics"},{"comment_id":"10154426729152446","commenter_b":"Wtf. Who do they think they are. Little unqualified woman","commenter_a":"wth???","post_message":"@webpagelink"},{"comment_id":"10155329030581002","commenter_b":"What's wrong with these racist black women?","commenter_a":"What is wrong with these nasty white bitches?","post_message":"A former Santa Fe Independent School District teacher is accused of having sex with two students over the last year and a half."},{"comment_id":"10154177421583734","commenter_b":"OK, toss in Jesus too, and all the Angles, and it still won't get him the Seat.","commenter_a":"He could have God running with him . He still has no shot at winning","post_message":"Do you think Fiorina was a good choice for Cruz?"},{"comment_id":"875788715811158","commenter_b":"@webpagelink, watch this and tell me is this ridiculous?","commenter_a":"Worse than ridiculous","post_message":"Don't you agree this is ridiculous?"},{"comment_id":"10153619308152235","commenter_b":"@username a racist comment about baking!?? Okay, surely you jest. You don't know what you're talking about so you're automatically excluded. @username I agree it could be seen as sexist except I am a female and bake all the time, but MORE IMPORTANTLY Men are known to be the best chefs😉. @username she didn't make any valid point when she stated \"nothing new, threats made against students daily\" She's out of touch with the article and with reality if she is trying to compare unspecified kids being threatened to a RACIST threatening to kill only BLACK KIDS posing with ak47 on the school grounds!! ARE YOU FREAKING KIDDING ME!??? The generalization she attached to this comment is uncanny, disturbing, and I'm sorry RACIST in an of itself. Because the DENIAL of racism IS racism also.","commenter_a":"This is nothing new. Threats are made against students daily! We went through this last year and most kids were kept at home until the instagram poster was identified.","post_message":"Another effing beautiful day in post-racial America."}]
