[{"comment_id":"1011637472207253","commenter_b":"Fuck drake ol biting ass nigga","commenter_a":"Fuck drake. He ripped off some shit from the nineties. Don't get crazy all you drake heads he is just trash anyways. pop not hip hop so don't disrespect hip hop by putting his name in the same sentence","post_message":""},{"comment_id":"899714753418554","commenter_b":"If we sent the illegals home wages would go up. It is called supply and demand. What are our collages and universities teaching these days?","commenter_a":"That's about half a million jobs for our citizens if we sent them home.","post_message":"Wow."},{"comment_id":"10153324129453984","commenter_b":"HERE you go......And in case You have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course we forget what has happened to many of the Clintons. 1- James McDougal Clinton convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr investigation. 2 Mary Mahoney A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown.. The murder happened just after she was to go public w:th her story of sexual harassment in the White House. 3 Vince Foster Former White House councilor, and colleague of Hillary Clinton at Little Rock Rose Law firm. Died of a gunshot wound to the head, ruled a suicide. 4 Ron Brown Secretary of Commerce and former DNC Chairman. Reported to have died by impact in a plane crash. A pathologist close ...","commenter_a":"Ugly tranny!!!","post_message":"This is one distinction Hillary did NOT want..."},{"comment_id":"10154208733135969","commenter_b":"Why do they want to protect illegals? Wth what about the citizens","commenter_a":"IAGREE YSE","post_message":"The White House Press Secretary Sean Spicer holds the daily press briefing after President Donald J. Trump met with Intel's CEO about investing in America."},{"comment_id":"880895332040553","commenter_b":"@username Didn't you get the memo? Pussy Liberals are NOT allowed to live in Texas... GET OUT","commenter_a":"Thank you @username for picking Mike Pence as you're running mate. Thank you thank you thank you God bless you both","post_message":"Mike Pence won big. We should all be proud of Mike!"},{"comment_id":"10154397036584205","commenter_b":"Way to stop women success!","commenter_a":"I work for Overstock and voted to pull all Trump, both he and his spawn, off our website. Proud of our CEO for putting it to his employees to make the final cut. I can't wait for the results!","post_message":""},{"comment_id":"10156988779965500","commenter_b":"Exactly. These are sick women.","commenter_a":"This is sick! As the mother of that boy I would go psycho on her! Check out this loser, @username!","post_message":"TEACHER IN TROUBLE! She told investigators that the boy's family was supportive and excited when they found out she was pregnant. @webpagelink"}]
