[{"comment_id":"10153049677426051","commenter_b":"She's in her 20's?? Seriously at first glance she looks like an old woman, she needs to lay off the drugs","commenter_a":"Damn.!!!","post_message":"A customer was walking through the Walmart parking lot when she noticed something odd about a nearby green Hyundai. After taking a quick peak inside, she immediately called 911."},{"comment_id":"1738235436425110","commenter_b":"TRUMP...u know Osama is in the Bahamas??? and not precisely dead","commenter_a":"The state run media are all Lib Commies ! Run by the Democrats !","post_message":"I have never liked the media term 'mass deportation' - but we must enforce the laws of the land!"},{"comment_id":"987322251337818","commenter_b":"They should be incarcerated. It's just that women who have legal abortions aren't murderers. And NO member of congress should make my reproductive choices for me.","commenter_a":"If you believe in murder, I guess it would be ok for you","post_message":"Yes! It's time to #abortthestigma"},{"comment_id":"10154786679373984","commenter_b":"What a shame that this ladies after so many many years will fall for Hillary's BS and the press that are now panicking cause things are getting worse to them and the campaign. Keep wondering how much money is floating around to pay all this people that suddenly have brought this stories and this will continue until Election Day, desperation is the mother of FU. \"GO TRUMP \"","commenter_a":"There is no one that is for Trump that is going to believe this. If it was true theses (ladies) would have spoken up sooner, so you see you people are not talking to morans as you think.","post_message":"Michele Bachmann has gone on national radio and revealed what happened to her when Donald J. Trump hosted her for breakfast -- alone -- in his penthouse.  Every American needs to hear her story. It says a LOT about Trump..."},{"comment_id":"10154004178307452","commenter_b":"Oh, but still lol what a sick hoe","commenter_a":"Her Bfs ex girlfriend is mad @username","post_message":"A Redlands woman woke up to a gruesome discovery when she walked out her front door to find pigs’ feet, fish heads and other animal parts scattered across her doorstep."},{"comment_id":"10154140324537690","commenter_b":"Economically saying no to this is an economic disaster.","commenter_a":"I do live in Arlington. I like the ballpark we got! And really, do you believe in no new taxes?","post_message":"The debut this week of Arlington's plans for a massive entertainment complex to be built around a proposed new baseball stadium is not sitting sitting well with everyone."},{"comment_id":"10154125168701770","commenter_b":"Oh I see how he filled the room he was in Chicago hahaha the city of thugs","commenter_a":"Can't wait for him to be gone!!!!!!!!","post_message":"Democrats really don't want Obama to leave the White House..."}]
