[{"comment_id":"1260466927330937","commenter_b":"@username agreed! She's a fecking CRIMINAL... PERIOD!","commenter_a":"Watergate would be jaywalking compared to the Clinton scandals","post_message":"Rudy Giuliani claims the Clinton Foundation scandal will be \"bigger than Watergate.\" Do you think there is truth to what he is saying?"},{"comment_id":"535308666651013","commenter_b":"Go Hillary!","commenter_a":"One thing is clear, They are terrified of Hillary and they hate America. Smh","post_message":"A twisted mindset."},{"comment_id":"1606743262959812","commenter_b":"Run cock roaches run!","commenter_a":"If only","post_message":"WATCH LIVE: Protesters are filling the streets in Charlotte after police say an officer shot and killed an armed man. @webpagelink"},{"comment_id":"932489970229038","commenter_b":"Nothing compares to what Bill Clinton did as Gov of Ark, and in the White House with Monika Lewinsky and other women..same with John F Kennedy, with Marilyn Monroe, and mistress of a Gang boss, and nude swimming parties. They both dis honored our White House...where was the media..and why were they voted in twice...","commenter_a":"I agree! Mr. Trump has changed in the past 11 years but Hillary Clinton has not except for the worst!!","post_message":"Dr. Robert Jeffress, Senior Pastor of the First Baptist Church in Dallas, Texas, stated that he still supports Donald J. Trump, despite the GOP nominee's controversial 2005 comments."},{"comment_id":"10154126843971254","commenter_b":"Yeah what ever and if the western woman didn't she'd be killed Mu idiots","commenter_a":"If a muslim man approached a western non muslim woman in the middle east and threw a niqab on her asking to wear it because she is in their country it would have went viral and all muslim would have been accused as extremists. We live in a world full of contradictions.","post_message":"'Our Britain, you live by our f****** rules'"},{"comment_id":"10153949454199087","commenter_b":"This idiot is a democrat? I bet no one saw THAT coming...","commenter_a":"Send this loser to another planet.","post_message":"Democratic congressman Hank Johnson on Monday compared Israeli settlers to termites while discussing Israel-Palestine relations."},{"comment_id":"1175029912517037","commenter_b":"Hal the point is we do need to tighten our borders, there are too many illegals here that get a free ride from the tax payers, and as much as people are going to hate this, if you came here illegally the children you have here are illegal. So, I do agree with you just never heard of known a Canadian to come here just to have a baby.","commenter_a":"look people. If you come to this country legally, doing all the appropriate paerwork and forms, any kids you have that are born here will be American Citizens. That won't change. What we want to change is the Anchor Baby tourism that flourishes on the West Coast, with the Asian women travelling here on 'vacation' to have their babaies in specially marketed motels just for them, so that their children, and them by association many times, would be American Citizens. And those illegal immigrants who cross our northern and southern border, from a multitude of countries, who break the law by sneaking in like a thief in the night, who have their babies here hoping for the chance to stay with them. People should not be rewarded fro breaking a law.","post_message":"With a renewed conversation challenging birthright citizenship, a look back at the 1898 case that first established the legal precedent in the U.S."}]
