[{"comment_id":"914001441995307","commenter_b":"Awsome woman!","commenter_a":"Barry Sheldon this was what I was talking about earlier","post_message":"BREAKING VIDEO: Mother Beats Her Son When She See Him Rioting in Baltimore  Mother of the Year Award? She goes straight hood on her son.   @webpagelink"},{"comment_id":"1082607271804819","commenter_b":"Lynne Longoria Torres","commenter_a":"the BBC is for the birds.","post_message":"Donald J. Trump has yet to comment!"},{"comment_id":"863004940415197","commenter_b":"Throw her in jail","commenter_a":"Take her down!","post_message":"\"Perfect\" was the response Lerner used about the non-archived messaging system."},{"comment_id":"915008615188661","commenter_b":"The other race of women say the same things, they just not on here.","commenter_a":"Good for him, this happens to men all the time. The women on here that are outraged are the type of women that men should stay away from. Nothing worse than a hypocrite. I can't help but notice that the women that are upset are mostly black. Very telling","post_message":"Tasha Smith forced to pay ex-husband $7K a month, in addition to the $50K she gave him last year @webpagelink"},{"comment_id":"1175029912517037","commenter_b":"Hal the point is we do need to tighten our borders, there are too many illegals here that get a free ride from the tax payers, and as much as people are going to hate this, if you came here illegally the children you have here are illegal. So, I do agree with you just never heard of known a Canadian to come here just to have a baby.","commenter_a":"look people. If you come to this country legally, doing all the appropriate paerwork and forms, any kids you have that are born here will be American Citizens. That won't change. What we want to change is the Anchor Baby tourism that flourishes on the West Coast, with the Asian women travelling here on 'vacation' to have their babaies in specially marketed motels just for them, so that their children, and them by association many times, would be American Citizens. And those illegal immigrants who cross our northern and southern border, from a multitude of countries, who break the law by sneaking in like a thief in the night, who have their babies here hoping for the chance to stay with them. People should not be rewarded fro breaking a law.","post_message":"With a renewed conversation challenging birthright citizenship, a look back at the 1898 case that first established the legal precedent in the U.S."},{"comment_id":"1659099987677347","commenter_b":"Silence is a virtue girl, use it.","commenter_a":"why does everything have to be about color. if you dont care about a race then go live somewhere they are not. problem solved. but it sounds to me like you need to get ssaved.","post_message":"She said that “people of color” are always asked to give out awards or entertain, but are “rarely recognized for our artistic accomplishments.”"},{"comment_id":"10154379049296028","commenter_b":"The tourist started it. There are reasons they had to close up. Their computers weren't working and they were forced to close maybe for an hour. Stupid tourist wanted to fight. She assaulted the employee first (yes, throwing water at someone is considered assault) causing the employee to be in defensive mode. Maybe that employee should be suspended for 2 days and hopefully she's not fired.","commenter_a":"What? You are not going to stack the coupons and price match??","post_message":"A woman's desire for a post-Christmas bargain took a violent turn. The confrontation caught on camera shows a store manager and a customer get into a scuffle in front of awaiting shoppers at a Florida mall. @webpagelink"}]
