[{"comment_id":"941291755930573","commenter_b":"Women are just as bad..","commenter_a":"Men are pigs","post_message":"She reported them to police because she said it made her walk to work an 'awful experience'"},{"comment_id":"10154102450848984","commenter_b":"OMG, Hillary is so very, very, very White !","commenter_a":"She just wants to be president, talks a lot of BS.","post_message":"Wow. Hillary Clinton was caught doing something next to Al Sharpton that is fueling the criticism that she is a complete fraud... and it was all caught on camera.  Do you think Hillary will be the Democratic nominee?"},{"comment_id":"10153183466936336","commenter_b":"It's an escort. Nothing will be done to prevent arms to Syria. Another red line crossed. He is an embarrassment and puts us all in danger from terror.","commenter_a":"Iran knows we have a coward President. Even these ships are like a lion without teeth because Obama is Commander in Coward!!","post_message":"U.S. Navy warships are shadowing an Iranian convoy approaching Yemen as the U.S. beefs up its presence in the region. Tune in to 'Special Report with Bret Baier,' tonight at 6p ET for the latest."},{"comment_id":"967905263263639","commenter_b":"She needs to be in jail!","commenter_a":"No just you","post_message":"EPA Chief Reveals Her 'Trashy' Upbringing And What She's Sure All Families Did Pre-EPA [Video]"},{"comment_id":"10156025741310354","commenter_b":"Go educate yourself, ALEX! The Constitution does not need revision to deny citizenship to illegal aliens, or their children. It is left vague in our founding document and is clarified by statute. The 14th Amendment defines citizenship this way: \"All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.\" But even this does not get specific enough. As usual, the Constitution provides the framework for the law, but it is the law that fills in the gaps. The Constitution authorizes the Congress to do create clarifying legislation in Section 5 of the 14th Amendment; the Constitution, in Article 1, Section 8, Clause 4, also allows the Congress to create law regarding naturalization, which includes citizenship. Currently, Title 8 of the U.S. Code fills in the gaps left by the Constitution. Section 1401 ...","commenter_a":"In my opinion all the RINOs currently in office as well as the few Republicans who haven't yet achieved RINO are crapping their pants because Trump is saying what the public is thinking. Plus, Trump could give a rat's ass about what the Democrat media formerly known as the \"mainstream media\" says about him.","post_message":"Top Republican Strategist Promises a 'Cleansing' of Donald Trump Voters from the GOP!"},{"comment_id":"10154478152135326","commenter_b":"Lying hyena she worse than she dog","commenter_a":"We all got something to say about Donald Trump, and his supporters and helpers but he still the president and he's still putting our lives in danger.","post_message":""},{"comment_id":"1297673556961425","commenter_b":"She has taken UGLY to a new LOW!!!!","commenter_a":"This awesome. Trump just keeps on winning.","post_message":"Awful Rosie O Got Slammed With Worst News Of Her Career After Election, She Screwed!!!  The news just keeps getting better for America!!!"}]
