[{"comment_id":"921197848005881","commenter_b":"Good Luck ! KILLARY sold out America to the highest bidders..several Muslim countries, big businesses, private persons gave millions to the made-up Clinton \"Foundation\". The Clintons PRIVATE SLUSH FUND. Only 10% is donated. KILLARY then sold 20% of America's uranium to Russia. OBUMMER Paid 400 Million to Iran in foreign currency , cash. That's not mentioning all the lies that has been told to the AMERICAN PEOPLE. The Democratic Party is now just socialists, communists. All of you need to see Clinton Cash. Many of top government positions or Muslims. If Hillary is the next POTUS, she'll be sending all of us a prayer rug, burqa's & hijab's for you female family members...now I expect you to call me a racist (against muslims) & bigot as that what you call anyone that disagrees..Pity for us all! 🇺🇸❤️🇺🇸❤️🇺🇸❤️","commenter_a":"With all the facts about this man being super unfit, I don't see how people still stand behind him. I guess they have no concerns for our future and the future of our children. If he gets elected I hope someone assassinate him.","post_message":"LOL! Spot on!  Made by Walt Handelsman, go give him a LIKE! Shared by Occupy Democrats."},{"comment_id":"1576560615982395","commenter_b":"Bitch needs to go away!","commenter_a":"The woman has been going way too much. She needs to rest. It's not exactly uncommon to get pneumonia when your constantly traveling doing events, and meeting with people on very little sleep.","post_message":"Democratic candidate abruptly left New York's 9/11 ceremony Sunday, raising questions about her health and campaign transparency."},{"comment_id":"10156654458470725","commenter_b":"Hoe","commenter_a":"Let me tell you WHY I AM voting for Trump. I've received a few boo's for my stance on Trump and I just have to say this so I hope you will take just a moment and read it to the end. And I say this as no response with no judgement or ill will toward anyone. I understand there are many who feel Trump's brashness doesn't qualify him for office. I agree he does need some polishing in some of his mannerisms. However, God willing, I will vote for him because this country is so far gone now and into the sewer so DEEP that I doubt there is much that will help it recover. That is why I feel more strongly about this now than perhaps ever in my lifetime that we M-U-S-T elect a strong, no-nonsense, straight-shooter with a BACKBONE OF STEEL who will stand up for ...","post_message":"realdonaldtrump is the first presidential candidate in 2016 to reach 1MM Instagram followers. Follow: @webpagelink/ for behind the scenes footage from the campaign trail! #TrumpTrain #Trump2016"},{"comment_id":"10153572345386955","commenter_b":"Both dopes.","commenter_a":"The Pope and the Dope!","post_message":"Influential Iowa Backers Get Invites to See Pope with VP..."},{"comment_id":"1001470336557869","commenter_b":"HaHaHa ROFL at her.","commenter_a":"And she is the Dean at a University? Sad state of mind and then you combine that with putting her in the role of teaching! Are we the people paying for that woman's salary?","post_message":"WOW this lady...shamelessly LIED about her entire encounter with the Police Officers..and here's the proof! What a fool."},{"comment_id":"1765015350452806","commenter_b":"This tells the whole story.","commenter_a":"Why can't people understand that the Clinton's are career politicians who amassed millions for themselves while being public servants and working in government? While working \"supposedly\" for we the people, they became millionaires. The same group of 1%s Hillary rallies against she is card carrying a member of.","post_message":"Don't let U.S. Senator Tim Kaine fool you -- the Clinton Foundation is a bastion of corruption."},{"comment_id":"10156228497460725","commenter_b":"Evil woman with lying eyes.","commenter_a":"Socialist controlled media ?","post_message":"Hillary Clinton is on the front page of The New York Times waving to 200 people in New Hampshire. My crowd next door was 5,000 people – no pic!"}]
