[{"comment_id":"1131104760243867","commenter_b":"Because no feminist says that.","commenter_a":"So when feminists say, genders should be separated in school, it's just a valid opinion. But if a straight white male says the same thing about science labs, it's sexist? How does this logic work? Oh, sorry, I forgot it isn't logic, it's stupidity. ;)","post_message":"I'm crying with laughter over some of these."},{"comment_id":"614347815409395","commenter_b":"Easy win! He will roll across her !","commenter_a":"Will she be stoned throughout the debate?","post_message":"Who do you think will win the first presidential debate?"},{"comment_id":"10153167916826336","commenter_b":"I don't understand it either.","commenter_a":"They should have just as much of a right to stop and salute the flag as anyone else. Baseball is America's pastime and they deserve the right to respect the country.","post_message":"Workers say ordering them to work through the singing of the national anthem is disrespectful."},{"comment_id":"1302858003140584","commenter_b":"Hillary is a war monger. You think There would be peace if she was elected?","commenter_a":"He will destroy this country parents get ready to send your children to war","post_message":"Nailed it."},{"comment_id":"10153573907066509","commenter_b":"She couldn't bring women down, only herself!","commenter_a":"I don't want to swear.... but.....way to go bringing the equality movement down a peg! !!! You really didn't think that one all the way thru!!!! :(","post_message":"A female CEO is under fire after a Facebook post in which she said a woman should not be president of the United States. “That should be left to a man, a good, strong, honorable man,” she said. @webpagelink"},{"comment_id":"10153912123821409","commenter_b":"Wow she should be kicked out for that!!","commenter_a":"You signed on the dotted line !! Hate to break it to you . Your job is to protect the freedom of this great nation. To bad you will be in the brig CHILE !!","post_message":""},{"comment_id":"10153844548482894","commenter_b":"Girls dem suga 😁 get well mi fellow Jamaican .","commenter_a":"Aww cmon now not Beenie Man","post_message":"Beenie Man Contracts Zika Virus, Forced to Miss OVO Fest Performance"}]
