[{"comment_id":"10154427648451955","commenter_b":"And she is a total lying bitch.","commenter_a":"He's an ASS !!!!","post_message":"Donald Trump, on releasing his tax returns (Source: NYT)"},{"comment_id":"10153029047279032","commenter_b":"Olivia Jean Plassmeyer how sad","commenter_a":"She looks evil... Yikes!","post_message":"PUPPY MILL ARREST: Authorities say a Wittmann woman is facing more than 200 charges of animal abuse and neglect."},{"comment_id":"10154493907103352","commenter_b":"Amen and thank you Lord","commenter_a":"Amen","post_message":""},{"comment_id":"10153447709650667","commenter_b":"If this would ever happen to my mom. I would make room so she can live with me.","commenter_a":"Good just because your old , you still have to follow the rules . If they make exemptions based on age that would be discrimination .","post_message":"“I have four grandsons, but I don’t want to be dependent on them. I can’t be a burden to my family. They don’t have room for me. That happens in life.”"},{"comment_id":"1841512796060882","commenter_b":"@username till the wall is complete lol there isn't going to be anyone picking lettuce you better grow your own","commenter_a":"Well Boston Mayor...... you are not the President so you don't get to decide what he focuses on. He's up holding his priority promises to his supporters first then comes the rest. Not the Democrats vision the Trump vision","post_message":"Boston Mayor Marty Walsh says President Trump should focus more on creating jobs and addressing urban issues such as homelessness.  Watch more: @webpagelink"},{"comment_id":"10157848946740389","commenter_b":"The People Must Protect the Republic, since DOJ and FBI are MIA! Trump wins in a landslide; however, the polls are a lie, and her rigging election must prove the lie! It's up to us to stop it, or America becomes just another Brazil. Infowars.com","commenter_a":"By hook or crook, ain't nothing on the books that we can't cook!","post_message":""},{"comment_id":"1727638077485478","commenter_b":"Theyre cool. But they claw into you. Very clingy animals","commenter_a":"@username this is why i wana go Australia - want one asa pet lets get one","post_message":"Koala joey plays in baby basket. Via Symbio Wildlife Park"}]
