[{"comment_id":"10153598670708822","commenter_b":"Woman driving a junk Kia SUV","commenter_a":"Awesome driving right there!","post_message":"It was a shocking sight… and some tense moments for people inside the Greenfield Giant Eagle.  An out-of-control SUV ended up on the building’s roof this afternoon, leading to evacuations over gas leak concerns: cbsloc.al/1RQuE9o"},{"comment_id":"10157067954080354","commenter_b":"FEMINISTS ARE THE NEW NAZIS.","commenter_a":"Where I work at, women who do the same job, get the same pay! It was even like that at my last job! Corporations cannot discriminate based on sex or they will face lawsuits! Feminists are always pushing the lie that women don't get paid the same! I've seen it first hand that it is just a LIE!","post_message":"\"It would be nice to be able to have a more complex conversation and to be able to look at it more than just a quota or numbers.”"},{"comment_id":"1004538792920312","commenter_b":"@username I'd love to hear your thoughts on the post from Kylelebrius Kennethius Jenkonious","commenter_a":"Hey friends, just wanted to highlight part of this post for those who aren't able to read the whole thing or watch the entire video. I really want this post to get people thinking about how we talk about these issues but also what causes these situations, not just the consequences of them. I know this is a tough situation and one that provokes lots of emotion and passion, but I hope we can talk about this in a productive and respectful way. Thanks in advance. \"Violence of any kind is wrong. But there's a serious problem when white students rioting after the annual Pumpkin Festival are described as \"rowdy\" and \"unruly\" but black protesters rioting in response to police brutality are portrayed as \"violent thugs.\"","post_message":"If you replace \"white\" with \"black,\" suddenly it doesn't sound so far-fetched. That's precisely the problem with the way folks are talking about the Baltimore riots. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"10153134531845927","commenter_b":"these gals need a long vacation i mean a longggggggggggg vacation.","commenter_a":"Joy, you are old and stupid.","post_message":"As long as the candidate is a committed liberal...this View host will overlook just about anything!"},{"comment_id":"10155130620974060","commenter_b":"Yeah Yeah okey then you are one of those...","commenter_a":"UK will go out on a Friday and apply to go in on a Monday....that will suit the FTSE trading too....","post_message":"If the public is to turn against Brexit, it will do so on its own terms. The task of Remainers is to be ready"},{"comment_id":"1678077472472997","commenter_b":"Fuck all Muslims and let them go to hell!!!!!","commenter_a":"So sad. It's bad enough that the boy lost his life, but for the Father of the murderer to defame his character is just too much.","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack  This is tragic. His died with honor, let's send our prayers for his family.  Can we get 100,000 'LIKES' for him and his family?"},{"comment_id":"10154884349326509","commenter_b":"Donald Trump would not try to lock the WW2 vets from their own memorial or lock American school kids out of the WH like the pho9ny Obama & dem's did. Pelosi would not even talk to the vets because she was speaking to a group of illegals. However, the scourge is claiming a very fraudulent amount for her retirement, way up in the 6 digits.","commenter_a":"It's still related to DDay and that was sent around by far more than him. Get over it, at least he was honoring the event.","post_message":"Donald J. Trump tried to remember #DDay with a photo that wasn't from D-Day."}]
