[{"comment_id":"10153137257982869","commenter_b":"Mr. McCain should not have called Trump backers, \"crazies\" but I dont hear any of you calling him on that. I like you Mr. Huckabee and would vote for you but understand that Trump is saying what we want ALL of you to say, the truth! McCain can no longer ride on his service alone, he is an awful senator and has done much to hurt veterans today!!!!","commenter_a":"I agree! I respect him for my freedom! He has been outspoken about issues I agree with - don't know what will steer our country In the right direction. I know we need prayer first! Who loves America the most should be elected! I love my country and love it's history! To all who love our red, white and blue!","post_message":"John McCain is an American hero. When our troops return from combat, they should be treated with the utmost respect and admiration. Every breath I breathe and every step I take is free because of brave Americans like John McCain."},{"comment_id":"10153254470474330","commenter_b":"I do not have girls, but if I did I would not let them wear either one of the dress below. they both look trashy, Asking for Trouble","commenter_a":"The guidelines may be appropriate.....yet they would have been honored if not considered had they come a month (or more) ago while these young women were shopping for the dresses!! Kids need to learn dress code acceptance to match the occasion...and while not promoting prudeism - if that is a word, my parents in the 60's would encourage us to leave some stuff to the imagination!","post_message":"Some controversy is brewing over prom dresses at Shelton High School. On Friday, the headmaster announced that dresses with slits, cutouts and backless styles wouldn't be allowed at prom. However, students and parents say the crackdown comes too late. They already bought the dresses. ---> @webpagelink  What do you think? Should the dresses be allowed or not?"},{"comment_id":"10154028997088132","commenter_b":".. she is ugly","commenter_a":".. & soo - Kris Jenner is ugly","post_message":"Grandma Kris Jenner has arrived!"},{"comment_id":"10153899711236509","commenter_b":"I'd hate to see when an STD breaks out lol!!!","commenter_a":"Mahalia","post_message":"Imagine living in a town where everything you need is under one roof. Welcome to Whittier: @webpagelink #GreatAmericanStories"},{"comment_id":"10153263764260329","commenter_b":"But what does she think of fat bastard?","commenter_a":"Who is this bitch?? Oh yeah that's right... #Irrelevant","post_message":"Azealia Banks said a whole bunch of interesting stuff, but let's not ignore that startled cat 0_0"},{"comment_id":"1076789345700753","commenter_b":"Put a bullet in his face. Is she was my daughter or sister, that's exactly what would happen","commenter_a":"ugly pig!!!!!!","post_message":"HATE CRIME! Swept under the rug because she's white and they were black lives matter thugs.  ARE YOU SICK OF THE DOUBLE STANDARD?"},{"comment_id":"10153247740094411","commenter_b":"Suck it up mother fucker","commenter_a":"När Israel skrotat alla sina atomvapen, har dom först då, rätt att ha trovärdiga synpunkter.","post_message":"BREAKING"}]
