[{"comment_id":"10154426292152431","commenter_b":"Sending smoke for Jim's family and friends","commenter_a":"Loved his stories!","post_message":"Jim Northrup (1943–2016): Beloved Ojibwe Author, Poet, Marine Veteran Walks On  @webpagelink"},{"comment_id":"10157173546425354","commenter_b":"what a stupid whore","commenter_a":"Bill Vito: Gee, I hope she doesn't have any of those baby killing guns around.","post_message":"Democrat Sen. Barbara Boxer says the physical violence among Democrats is \"frightening\" and that she \"doesn't know what would have happened if I didn't have security.\""},{"comment_id":"238735813255041","commenter_b":"And to think....they probably had children","commenter_a":"When the defendants were acquitted and they were just sitting back in their chairs with cigars in their mouths and everyone was just congratulating them on beating the case they had no remorse for what they did and it's terrible how could you be ok with kidnapping a 14 year old and just dismantle his face and then dump his body in a swamp that was pure evil and hate they had in their souls to just do that to him it's sad.","post_message":"The story behind the photo that exposed racism in America and helped spark the Civil Rights Movement. @webpagelink"},{"comment_id":"10153355011548984","commenter_b":"That mayor is an idiot.","commenter_a":"So what would you call someone who would break out the windows of someone elses property or burn someone elses businesses or homes?","post_message":"Both Obama and Baltimore's mayor have called the rioters by a one-word name that has generated controversy..."},{"comment_id":"10154877505644351","commenter_b":"Build it electrify it arm the wall with automatic weapons cameras night vision electrify deep into the ground to kill tunnellers pass new deportTion laws make it a felonie criminal act to border hop punishable by years in a very bad prison","commenter_a":"His whole campaign was based on building a wall!! Of course he should, we need secure borders!!","post_message":"Thoughts?"},{"comment_id":"1673236709627945","commenter_b":"I can't stand this big eared liar!","commenter_a":"Bull crap! You say that federal background checks don't work when it relates to gun control but when it relates to checking refugees you say it does so apparently it only works when you are telling the public lies to get what you want = pitiful","post_message":"\"Any refugee coming to the United States, some of them victims of terrorism themselves, will continue to get the most intensive scrutiny of any arrival.\"  After meeting with his national security team, President Barack Obama said that \"our intelligence and counterterrorism professionals do not have any specific and credible information about an attack on the homeland,\" but that \"we have to be vigilant.\""},{"comment_id":"996483170392155","commenter_b":"She needs to go sit in the snow for a few decades..","commenter_a":"She is a regular stand up comic! Keep it coming Sarah...we all need a good laugh.","post_message":"If her goal was to make sure people still know she's an idiot, she succeeded."}]
