[{"comment_id":"889054771211302","commenter_b":"It doesn't happen to muslim women because they are all fugly uckers..","commenter_a":"Go fuck yourselves, dune coon","post_message":"ClashDaily.com"},{"comment_id":"1189264781194585","commenter_b":"Bet you swat flies, stomp spiders and spray bug spray around. Insects are living creatures and so is mold.","commenter_a":"Sick !!! Well no excuse weither crocodiles kill humans or not humans are the sickest living creatures on earth they do things to get kicks and enjoyment","post_message":"Vile."},{"comment_id":"10153128765639586","commenter_b":"<3","commenter_a":"Jessica Thompson this is why we cut those things!!!","post_message":"ALWAYS CUT YOUR PLASTIC SIX-PACK RINGS.   PETA fieldworkers found this poor feral cat reminding us all how dangerous discarded plastic & other trash can be: @webpagelink   SHARE to remind everyone!"},{"comment_id":"1059297857458355","commenter_b":"bag your bags u/piece of pig shit bitch & go back or get killed soon","commenter_a":"bring this bigot home and throw her off the team.","post_message":"Seriously?"},{"comment_id":"1119477664770356","commenter_b":"Who needs to pay for the wall .? Ya want it ya pay for it . Smh","commenter_a":"You Goooo Mr Trump. .i am outraged over Fox ex prez of Mexico, how dare he tell us Americans what is best for our country, I can't wait for you to be our president, ..i can't wait until they pay for that wall, and you as our president, will make it happen, from houston texas along with myself and 8 family members will be voting for the next president v Donald Trump. .God bless you and your family,","post_message":"What I would do on my first day in office. #MakeAmericaGreatAgain  Text TRUMP to 88022 to join the #TrumpTrain"},{"comment_id":"10153209825548445","commenter_b":"Not if you make the tincture right","commenter_a":"Don't make edibles at all. If you want an edible high, just buy/make tincture and eat it with cookies. Or just eat the weed in fillable capsules: 1. Decarboxylate your Dry herb 2. Fill swallable capsules with dry herb 3. swallow capsules with food and drink","post_message":"10 Commandments of #Marijuana Edible Safety"},{"comment_id":"10153744058143132","commenter_b":"She's Still A Douche!!","commenter_a":"Doughnuts? I thought she smelled like Dalmatians.","post_message":"You can finally relax, Ariana Grande's fragrance ad is here."}]
