[{"comment_id":"10153523440189071","commenter_b":"You should always bet with Olly when he's had a few, he always loses.","commenter_a":"Olly Cairns @username","post_message":"It has a ton of benefits."},{"comment_id":"10157928279665500","commenter_b":"Why did they have babies to begin with? People like them have no business having babies - period. Don't believe in birth control - don't have sex.","commenter_a":"This makes me sick! The parents don't look like they missed any meals! Lock them up and throw away the key!","post_message":"The nurse also told police there were feces in one of the child ears and that the child looked  a skeleton. @webpagelink"},{"comment_id":"10153095892296955","commenter_b":"How childish","commenter_a":"You gotta realize Nancy Pelosi, he's a better man than you'll ever be.","post_message":"White House warns Netanyahu not to reveal Iran details...   'Days when Jewish people remain passive in face of genocidal aggression are over'...   Broadcast Networks Refuse to Carry...   'Enraged' Pelosi freaks on floor...  Dems LASH OUT at Netanyahu, Tell Him to Go Home, Call Him 'a Child'..."},{"comment_id":"1137500072976406","commenter_b":"I agree she's a snobby cow that needs to learn a lesson and go inside but prisons are full","commenter_a":"Yet another classic case of women and their double standards...if a man had stabbed a woman, there'd be out with the pitchforks and torches baying for his blood...","post_message":"Woman who stabbed a man in the eye with her stiletto walks FREE from court"},{"comment_id":"10154469641506051","commenter_b":"Absolutely not. She's a damn joke too.","commenter_a":"I will never claim Trump as my president. What a damn joke!","post_message":"If this goes the way some expect it to, Donald Trump could very well be impeached."},{"comment_id":"1027310527363527","commenter_b":"go girl go!","commenter_a":"Now do it with 40 pounds of gear and a drill instructor screaming at you. lol","post_message":"Meet Milla, a 9-year-old girl that just dominated a Navy Seals obstacle course. (via NowThis)"},{"comment_id":"1671785493043668","commenter_b":"Bitch..... Get a life. Stop using racism.","commenter_a":"Tactical shit is racist... says the man who uses \"Redneck\" over and over and over and then blankets all veterans as being PTSD, drunks, llamaphobes, ect. the ignorance level is... OVER 9000!","post_message":"What he says about Red White and Ben is priceless."}]
