[{"comment_id":"10153238053014586","commenter_b":"plants are living things too... so eat sand... all human should eat sand.","commenter_a":"literally feel sick watching this how can people still let this happen? disgusting","post_message":"Can you imagine having that huge metal tube shoved down your throat?!   This is just 60 seconds of how #FoieGras ducks spend THEIR ENTIRE LIVES.   They sound so terrified. :("},{"comment_id":"10154732909385586","commenter_b":"I am glad that this horrible woman will be banned from the store. Shame.","commenter_a":"Betcha Grandma cashes her SS check every month","post_message":"An elderly woman is shown yelling at another woman and her friend, using racial slurs, cursing and telling them to “go back to where they belong.” How's that for Christmas spirit?"},{"comment_id":"10154148707777994","commenter_b":"I'm more scared of a white maniac than some isis rag head sitting in a cave.","commenter_a":"They did it in response to capturing the guy behind the Paris attacks. You have to hunt them down and destroy them ruthlessly and make them fear you otherwise they will continue","post_message":"Here are some photos from the scene in #Brussels. The latest -- at least 26 people have been reported dead in the blasts. Dozens of others have been injured. Continue reading about what happened here: @webpagelink"},{"comment_id":"10153438882926130","commenter_b":"That's rape !!! Lmfao !!!! Jk","commenter_a":"I am a Viking woman. I don't play any games when it comes to sex. I don't try to look sexy when I want it. I go up to my man and take it.","post_message":"Terry Crews completed a \"90-day sex fast\" with his wife and it left him \"more in love\" and \"more turned on\" than ever."},{"comment_id":"10152774777037293","commenter_b":"Really????!!!haha...yeah thats funny.Is that why he cherishes illegal aliens more than Americans?","commenter_a":"I believe Giuliani is incorrect....I think Obama would like to see a better America....as many Americans would as well!","post_message":"\"I know this is a horrible thing to say,\" he commented."},{"comment_id":"10153508194124087","commenter_b":"Paid shills","commenter_a":"Twenty-six years ago when Savvy Woman ran him on the cover, four of the eight people in Trump innermost circle were women, including his then wife Ivana, who was not in any of these particular photos but who was running the Plaza Hotel at the time. The others, all executive vice presidents, were: Barbara Res, who was in charge of construction of Trump Tower and then the Plaza; Blanche Sprague, head of project development; and Susan Heilbron, who was Trump chief lawyer.","post_message":"“Nobody has more respect for women than I do,” Donald J. Trump said. “Thirty years ago I had a woman building a major construction project in New York City. That never happens. I’ve been great to women and they’ve been great to me. I’ve had so many women executives [and] they’ve done a great job.”"},{"comment_id":"1518865864832838","commenter_b":"No but he does plan to get rid of illegals. Anyone coming I to our country will respect our laws AND FOLLOW THEM!!","commenter_a":"Hollywood has never been right about anything in politics!","post_message":"Another Communist making a fortune on capitalism..."}]
