[{"comment_id":"684042675091009","commenter_b":"Hillary is guilty as sin . She should be in prison along with all of her Clinton Crime Mafia.","commenter_a":"Maybe he is scared of being the next victim to die like the FBI suspected leaking the emails.","post_message":"BREAKING: CLINTON CLEARED...Was This A Coordinated Last Minute Trick To Energize Hillary's Base?   This only proves why we need TRUMP to DRAIN THE SWAMP! We are a Banana Republic!"},{"comment_id":"10152591778190927","commenter_b":"Give them an inch they will take a mile!","commenter_a":"Lies, lies, and more lies, this is all this administration knows how to do.","post_message":"They finally admit it."},{"comment_id":"10153621420851045","commenter_b":"Uncle had custody of her, I don't think it's what it sounds like. Parents don't just lose custody.","commenter_a":"🙏🙏🙏","post_message":"We have some fantastic news to share with you. Carlie Trent has been found safe and her uncle is in custody! #BringCarlieHome"},{"comment_id":"1322936927726334","commenter_b":"Shariko ... I did call you Racist .. That has no bearing as to whether or not you attended college","commenter_a":"They are trying so hard to find him connected to that murder while they have him on some B.S. Making themselves look foolish.","post_message":"Multiple law enforcement sources explained to NBC News why a knife found on land where O.J. Simpson once lived does not appear to be connected to the murders."},{"comment_id":"10153987601378908","commenter_b":"And another commenter who didn't read the article.","commenter_a":"And this is the article that should prove to all of you that collective evolution spreads bullshit ... Yellowstone has a big herd over 4000 bison .... And they are to slaughter 4-600 of them to prevent spread of disease !!!!!","post_message":"Park rangers have begun capturing wild bison in the Stephens Creek trap within Yellowstone National Park. Since Feb. 20, approximately 150 of America last wild buffalo have been trapped. According to park officials, all are destined for slaughter."},{"comment_id":"10153982553531955","commenter_b":"Fire her!","commenter_a":"Where is this? Chicago..oh yeah..that crime riddled LIBERAL MESS..that place where there are 100's of black on black murders each week..that place where black lives matter the LEAST...that place where this ignorant fool of a so called teacher is. SAD AND IGNORANT.","post_message":"Public School Teacher Preaches \"Fuck The Police\""},{"comment_id":"10153956256701336","commenter_b":"Exactly!","commenter_a":"government is always looking for a new tax. The gas prices should be lower for what crude is going for right now.","post_message":"The price of Brent crude in the United States has fallen below $40 a barrel – more than $30 lower than in May of 2015."}]
