[{"comment_id":"662083353949972","commenter_b":"@username the police and you need to respect the first amendment","commenter_a":"These are adults who are supposed to be leaders in our community. They have the power to take life and they are the ones acting like children who have taken their ball and gone home. Is it any wonder these children are afraid of police and concerned with their actions? Shame. Shame on them. Shame on them for proving the children's point.","post_message":"Some Jefferson Parish deputies won't volunteer for security detail at Bonnabel High School football games after several team members kneeled during the national anthem during last weekend's game."},{"comment_id":"10154189753241130","commenter_b":"Hillary is way too smart, too tough and too focused on governing well to let these kinds of insults throw her. And Tina Fey said it best: Yes, she's a bitch and that's great because bitches get things done!! I think Hillary should own it and we should all get behind her! I'm ready to get my bitch on, how about you?! #I'MWITHHER Vote for Hillary Clinton!","commenter_a":"Already seen and heard it.","post_message":"If Hillary Clinton wins in November, brace yourselves."},{"comment_id":"513866205470626","commenter_b":"This IS STILL AMERICA and I'll go where ever I want, if those pigs fuckers try to stop me it will be the last thing they do before meeting allah in hell","commenter_a":"They need to obey American laws. As all do who live in this great country.","post_message":"Video coverage from the Shariah 'No-Go Zone' has been released.  This is America. If you don't like it you can get out.  Do you agree Shariah Law should be banned in America?"},{"comment_id":"1582128638759914","commenter_b":"Normal people don't put bombs in dumpsters......terrorists do....","commenter_a":"Tell us again how this isn't an act of terror?","post_message":"Breaking News: FBI releases a 'Wanted' poster identifying 28-year-old Ahmad Khan Rahami, a suspect in the bomb blast in New York City Saturday night.   The FBI's wanted poster identifies Rahami as a naturalized U.S. citizen of Afghan descent. MORE DETAILS: @webpagelink"},{"comment_id":"807667145998560","commenter_b":"Dumb bitch cant spell","commenter_a":"Because she wanted to be an arrogant*** brat instead of following simple orders","post_message":"\"How did switching lanes turn into all of this?\""},{"comment_id":"10153500455846336","commenter_b":"Mr Rubio: While it might be nice to possess 'class\", we don't need \"class\" as much as we need a \"leader\" who has the nerve to say what's on everyone's mind and then do something. It remains to be seen if he can get past the nefarious \"electoral college\" that elects the president no matter what the \"popular\" \"people's\" vote is.","commenter_a":"how about instead of commenting on another persons comments you actually tell us how you are going to fix all the crap wrong with our government, waste and abuse of tax payer dollars, so how are you any better??? so tried of you all","post_message":"Sen. Marco Rubio addressed immigration and Donald J. Trump's controversial comments. @webpagelink (via Fox & Friends)"},{"comment_id":"484066138450614","commenter_b":"@username any woman who needs a leader is not going to be the best wife.","commenter_a":"If that was my husband, he'd know his place, and it wouldn't be in my house. More like on the pavement.","post_message":"Kirk Cameron:  'Wives shouldn't tell their husband how he ought to be a better husband'"}]
