[{"comment_id":"10154394600380695","commenter_b":"Girl sit down... Really","commenter_a":"Why is this disgusting waste of human flesh still walking amongst us? Lock this rapist up already and throw thr key in the bottom of the Pacific","post_message":"BREAKING: The 78-year-old actor faces up to 10 years in prison if convicted."},{"comment_id":"537696536420926","commenter_b":"I don't like her anyway no matter what. Don't trust her","commenter_a":"Its a joke this woman no never come out as president she's wasting her time in her money we all know nobody wants to Clinton back in the White House","post_message":"Hillary Clinton's sex slave just exposed her for doing THIS.  What a disgrace. She will never be president.  Can we get 20,000 'LIKES' to make sure Hillary never becomes president?"},{"comment_id":"988968067881864","commenter_b":"Wake up woman","commenter_a":"I am not an HRC supporter, but folks, please don't start reposting these kinds of photos. This could have been taken hours before the event. If you can show me this size crowd with HRC on the stage, then I would repost. If you repost and it's false, the left will attack you and We all lose credibility","post_message":"SHOCK PHOTOS:"},{"comment_id":"1210989268913328","commenter_b":"Impeach this !!!!!!! Donkey Dicks ! Vote Trump","commenter_a":"How can you Impeach Trump??? He's not even President!!! Impeach the one in there now!! What the heck is the matter with people now a days??!! No common sense, want everything free, think they are entitled, scream racism at everything, destroy property with no remorse, get mad and just shoot people, not responsible for anything they do wrong, always due to their past or otherwise, no morals................ect..........And now talk of impeaching someone who isn't even President!!! America stand up and be counted for what is real, true, moral and right!! All Whiners can leave!!! Of course just my opinion! I know all will not agree, but \"Freedom of Speech!! My country, my Right!!","post_message":"Donald Trump doesn't have the GOP nomination and he hasn't been elected yet. But that is not stopping the effort to have him impeached the moment he might be sworn in as president"},{"comment_id":"10153931593886336","commenter_b":"Let's add panderer to Hillary's resume after liar. Perfect qualifications to be the next President.","commenter_a":"She has mislead the Hispanic voters by lying to them. Just because they do not understand the law and the BS she has so taken advantage of them. Hillary for Prison in 2016.","post_message":"A campaign post aimed at winning over Latino voters has backfired and instead is drawing the ire of many social media users for purportedly playing up ethnic stereotypes."},{"comment_id":"552329344892078","commenter_b":"Impeach her! She's suppose to be UNBIASED. What a joke","commenter_a":"Term limits asap","post_message":"Supreme Court Justice Ruth Bader Ginsburg bashes Donald J. Trump, calling him \"a faker\" and criticizing him for not releasing his tax returns."},{"comment_id":"870676293063413","commenter_b":"She can leave anyway. Useless","commenter_a":"Well,bye","post_message":""}]
