[{"comment_id":"10153475900679705","commenter_b":"Excuse me, but what kind of a MOTHER leaves her DAUGHTER behind because there's no seat for her?!","commenter_a":"There's very easy way to avoid these things. Don't piss about at the last minute and end up being the last person to check in. Guaranteed a seat on the plane.","post_message":"Unbelievable."},{"comment_id":"10153194384047217","commenter_b":"Helicopter looking for someone ?","commenter_a":"He's not the messiah - he's a very naughty boy.","post_message":"This mysterious bright light in the sky sent Californians into a panic 🌠"},{"comment_id":"1168212589885878","commenter_b":"Yikes!","commenter_a":"Ben may be a fair to middling Doctor but he needs a major lesson in history and about 20 years political experience.","post_message":"America deserves better."},{"comment_id":"10154142695231378","commenter_b":"Jesus for president!!!!","commenter_a":"This loser is not my President !!!","post_message":"#LIVE: President Obama holds first news conference since election."},{"comment_id":"10153549714052014","commenter_b":"She should've closed her legs.","commenter_a":"Unfortunately this POS will get an attorney who will say she is mentally ill, then she will go to some mental hospital. She will be there few years and they will say she is better, she will be back having more babies. I don't care what the reason, crazy, postpartum, bad day, whatever she deserves jail for the rest of her life!! She should have just whacked herself, sorry I have absolutely no pity for her.","post_message":"HORRIFIC UPDATE: Police are now saying the mother who killed her 3 children also partially dismembered them. Two of the kids were placed in closet & the 2-month-old baby was \"stuffed into a case.\""},{"comment_id":"1521164361521907","commenter_b":"11, MILLION illegal immigrants, @username. I won't write it out, you might have trouble counting the zeros. That would cost the US 4+ BILLION dollars, but hey- you might not realize how much money that is. Once the current illegals are removed from the work force, it would cost 1.4 TRILLION dollars and the likes of a recession no one in our lifetime has ever seen, but in the meantime, you rock on with your idiot self.","commenter_a":"Good fella for calling his royal Ass out on such ridiculousness.","post_message":"Kudos to the NBC reporter for calling Trump out to his face. Earlier today, Trump said he wouldn't rule out creating a national registry of Muslims, or giving them special IDs. That's NOT the American way. Spread his shame.  Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153220467940950","commenter_b":"Lets hope for something known as KARMA, mf'r.","commenter_a":"That's so wrong","post_message":"A video showing a McDonald's drive-through worker offering a reportedly homeless man a burger and then throwing water in the man's face is quickly moving through social media waves."}]
