[{"comment_id":"10157293666220725","commenter_b":"Did you hear what Hillary said? She intends to talk to \"the white people\". She makes me sick!","commenter_a":"we need trump for president in 2016 go trump","post_message":"I am the Law and Order candidate!"},{"comment_id":"10153810976206680","commenter_b":"Lock that vandal up!","commenter_a":"Way better than perjury charges, obstruction of justice, mishandling of classified documents, racketeering (Hillary) or fraud charges (Trump.) Jill spray painted a bulldozer and I would have too had I been there. They were bulldozing ancient barrial grounds and putting in pipelines without concent or respect for international law. #imwithjill","post_message":"Green Party presidential nominee Jill Stein is facing vandalism charges in North Dakota."},{"comment_id":"523485051181568","commenter_b":"Such a lying witch.","commenter_a":"She has dealt ace of spades. Let her bare the consequences!","post_message":"\"Donald Trump says I’m playing the woman card. Well you know what I say if fighting for child care, paid leave, and equal pay is playing the woman card – then deal me in!”  Moments ago, Hillary Clinton gave a speech responding to Donald J. Trump's criticism."},{"comment_id":"10153616192149342","commenter_b":"I can count the ppl, I can really count on on 1 hand.... With fingers to spare for a hot chick!","commenter_a":"Some of your \"real friends\" don't either. js","post_message":"How's your Facebook friend list?  #abc13"},{"comment_id":"10153326495519714","commenter_b":"Yeah a little weird but seriously.\"omg he got a picture of my butt.\" so what?","commenter_a":"If I were the girl in the picture, I'd send a thank you to him for making my derriere famous. We should embrace curves! I'm sure he's just goofing around. People need to stop being so sensitive.","post_message":"Do you think Michael Bublé crossed the line with this Instagram post?"},{"comment_id":"10154305700931729","commenter_b":"@username STFU you aussie pussy","commenter_a":"God (the real God) does not require one to pray a certain number of times. He's willing to listen at any time!","post_message":"Well, they probably won't do THAT again."},{"comment_id":"10153391344478352","commenter_b":"Crazy mother sucker","commenter_a":"Oh boy! Here we go! Before it starts, dont blame nothing on Islam.They went blowing up people out of their own desires.Islam had nothing to do with it.","post_message":"Car-jacking victim of Boston bombers tells court how they admitted to terror attack, demanded GPS to get them to New York and played CDs of ‘religious music’"}]
