[{"comment_id":"10153395223571336","commenter_b":"Pull up your skirt and grow a pair .","commenter_a":"I'm not Mexican but his comments were offensive. There are many honorable Mexican Americans and his words disrespected all Latin Americans. I happen to be a conservative republican, and in favor of tightening up the border issue. Donald Trump is an emotional and impulsive idiot and we don't need that in the White House. We need someone that will unite us, not separate us.","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"909362045826715","commenter_b":"NO!","commenter_a":"You idiot libs! Most of us conservatives carry a gun everywhere we go. You just dont know it. And if a criminal tries to go on a killing spree, we will save your dumb a$$es too.","post_message":"Should guns be allowed in parks and playgrounds?   What do you think? Sound off below!"},{"comment_id":"388174341307161","commenter_b":"Why not let seniors work and draw social security. Count married people as two on tax returns this would generate more taxes. People would spend more money. Only the very handicapped should not have to work. People on welfare that are capable should have to do community service. They should b drug tested and have valid I'd Think of solutions instead of calling names. Cut out the waste. We need solutions","commenter_a":"Then why don't they shout it out, let their scared party from the Tea baggers know it has to be done, but I'm sure none will stand up to them.","post_message":"Do you agree with this poll?"},{"comment_id":"10153285137206770","commenter_b":"Make them eat PORK.","commenter_a":"YES!!!!!","post_message":"\"In the Middle East, we have people chopping the heads off Christians. Not since medieval times have we seen what’s going on.\""},{"comment_id":"10153799327541336","commenter_b":"He was not hitting her I hope.she spends years in jail,she could have killed that officer","commenter_a":"Got Her.","post_message":"A woman used her car as a weapon and knocked over an Auburn Hills police officer to flee a traffic stop. Breianna Smart was caught and arrested."},{"comment_id":"1368961776496629","commenter_b":"Obviously yours is up ur boyfriends ass you homo!","commenter_a":"IF YOU ONLY REPORTED REAL NEWS! ! ! !","post_message":"This scandal is only getting worse."},{"comment_id":"10156506667295354","commenter_b":"MUCK FUSLIMS","commenter_a":"They hate what it stands for Freedom, and they want to take it over, take away all freedom and replace it with Sharia. They will by population growth win this battle and eliminate all non muslim men, women, and your children if you allow them to settle in our Country.","post_message":"\"The hatred of infidels is a religious imperative in Islam. No matter how fast we dance, appease, pay, accommodate, and submit, the hatred and holy war will not cease. On the contrary, the more we submit and reward the hatred and terror, the more we will have to surrender.\""}]
