[{"comment_id":"10153265498530047","commenter_b":"@username over 5million LOL. Dead people and illegals","commenter_a":"SIGN THE PETITION / CLICK ON WEB SITE Justice Scalia one of the most brilliant and ardent defenders of the Constitution has just passed away. This is a huge, deeply felt loss. We must not forget that the next justice could impact the Court and the direction of our nation for decades. The American people deserve a voice in this decision: @webpagelink","post_message":"President Obama will stop at nothing to force his nominee for the U.S. Supreme Court through the Senate before his last year in office comes to an end.      But we can stop this from happening.  SIGN & SHARE our urgent petition to the U.S. Senate today: @webpagelink"},{"comment_id":"603381206519125","commenter_b":"Miley is a nasty skank!","commenter_a":"get rid of miley.","post_message":"Miley attacked Christian conservatives, but Bristol had an epic answer for her.  Good. We support Bristol 100%.  Is Bristol Palin a better role model than Miley?"},{"comment_id":"1134556746600853","commenter_b":"She's no better.","commenter_a":"Trump is the devil...if he be elected to be the president...he's gonna start the world war III. HILLARY 2016-2020 !!!","post_message":"Estas son las promesas de Trump. Así podría ser su presidencia…."},{"comment_id":"1067465993294258","commenter_b":"James Whitehead","commenter_a":"Amanda Henry I squealed multiple times. The author is a great read too!","post_message":"A little something to brighten your day."},{"comment_id":"10152960081691051","commenter_b":"My ex wife is a chupacabra!","commenter_a":"Yeah right !!","post_message":"This woman is confident that she found a Chupacabra - and she has proof."},{"comment_id":"10154070103774916","commenter_b":"Shillary can't beat Dumper because she can't hold on to the Bernie followers who will leave the DemoRatic Party as soon as she gets the nomination. We aren't Democrats and we won't vote for her. #MassExodusOfTheDNC","commenter_a":"Hillary Clinton and Demographics and the American people will CRUSH Racist Republican Lying Cowards Donald Trump or Cruz.Who are vile bigoted ignorant chicken hawks warmongers un-American racist hateful assholes. HILLARY 2016.","post_message":""},{"comment_id":"1156510771035618","commenter_b":"Maybe criminals should stop shooting people unwarrantedly","commenter_a":"Maybe police officers should stop shooting people unwarrantedly?","post_message":"Authorities are hunting for the gunman."}]
