[{"comment_id":"10153100917462994","commenter_b":"And crazy women too","commenter_a":"Try a tour of Detroit, New York, and Green Bay. Anyone can do Florida lol.","post_message":"\"I get treated really horribly. Actually the emotional part is much worse than any physical pain I go through.\""},{"comment_id":"1022251871143567","commenter_b":"Trump card xxx you trump is good for God's love you trump","commenter_a":"clinton, liar, e-mails, white water, rose wood , scandals.... what's with webb hubell? is he chelsea's dad??..Vince foster?? tell America the truth...corruption with clinton foundation, schlonged by obama, OWES favors, soros, lobbyists, muslims leaders..her illict affairs with, yoko ono, vince foster etc....covering up billie's affairs..stole thousands from W H..when clintons left...benghazi, terrible lies...she let those heroes die...yeah, poooooor victim.. killary will do, or say... any thing to get elected....","post_message":"Trump Issues A Major Threat To Hillary!"},{"comment_id":"10153757259492293","commenter_b":"It's really about saving cash if you don't need boxes remotes and other material it cheaper on your end but much cheaper for them","commenter_a":"Awesome! Tired of the wires and boxes! Yay!","post_message":"This could be a win-win."},{"comment_id":"10154288676688445","commenter_b":"Ding Dong: who's there? Your local sheriff lol","commenter_a":"Throw them in the fireplace and share the lovely smell with the whole neighborhood!","post_message":"Grow Q&A: What Can I Do With The Pot Leaves I Trimmed Off?"},{"comment_id":"1386005081478024","commenter_b":"Thank God! We are the voice of this babies.","commenter_a":"So let me get this straight.. These wingnut lefty/leberial woman who are marching all over today are really attempting to fight over their treasured planned parenthood. They want to keep the free goverment \"healthcare\" for women. Correct me if I'm wrong but, isn't their local welfare office giving out medical cards to cover 100% of their \"healthcare\" needs?? Oh wait, this is primarily an adult sized temper tantrum because they want the right to abort babies. PLAIN AND SIMPLE. Can't wait for Trump to sign the bill for defunding😡🇺🇸","post_message":"Baby-killing organizations that have been using government money to fund their sick, worldwide abortion agenda just got some seriously bad news... here's what Donald J. Trump just did to send them into total panic.  A lot of liberals are going to be furious about this... what do you think?"},{"comment_id":"978935178808244","commenter_b":"Good. She looks like a menace.","commenter_a":"hey asshats...it was a 12 year old..not 2 year old....daddy put her in harms way......","post_message":"BREAKING NEWS! Police just SHOT AND KILLED a 12-year-old girl while evicting her family from their home!   Help us SPREAD THE WORD because the #MainstreamMedia is not TOUCHING this!  From >> Counter Current News for the latest!"},{"comment_id":"1398317006928016","commenter_b":"I don't particularly like or support this woman for the position. But this is petty.","commenter_a":"Christian Heredia 😂","post_message":"Trump's Secretary of Education. Speechless."}]
