[{"comment_id":"759569737474968","commenter_b":"We also.have to put up.with people like you. I'd welcome anyone from anywhere else before I'd welcome you .","commenter_a":"If we gotta put up with Muslims...why the hell not at least he doesn't want to behead us","post_message":"If you thought he was in jail, you thought wrong."},{"comment_id":"10152784839266680","commenter_b":"Oh hell no...","commenter_a":"Universal speed Bernie, your track record is AMAZING and your heart is filled with incredible passion! Thank you for FIGHTING FOR US #berniesandersforpresident #wallstreet #monsanto #earthfirst #love #care #animalsmatter #politics #gasland #environment #oceans #earth #america #goodpeople #bernie #hillary #hillaryclinton #jebbush @webpagelink","post_message":"Democratic Whip Steny Hoyer: \"We will dictate that the only people who can serve are the rich and I don’t think that’s what the Founding Fathers had in mind.”"},{"comment_id":"1003834523018162","commenter_b":"Fuck her she hates white's. She only hires blacks.","commenter_a":"she had made millions off the white people and i do mean millions.let her take some money and give it to street people or vets which i doubt she will she would only let them starve!!!!opra disappoints me as i thought she wouild be the last person to say something like that!!!!!!","post_message":"Oprah Claims White People Are The Cause Of Racism In America.  What a hypocrite, she is the racist.  Do you think Oprah is bigot?"},{"comment_id":"879835912051831","commenter_b":"I wish her big mouth would go away ; what a disgusting woman","commenter_a":"A message for Rosie. It is one thing for people to think you ignorant and it is another for you to open your mouth and prove it.","post_message":"Tom Selleck is awesome!"},{"comment_id":"528408970683016","commenter_b":"ghetto skank bitch","commenter_a":"They have,gotten away with it for six years and will keep doing it tell they leave the white house","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"},{"comment_id":"10153815263206336","commenter_b":"Don't let illegal immigrants hijack the Democratic Party!","commenter_a":"Kinda trashy.","post_message":"Did this video go too far?"},{"comment_id":"10153842113264877","commenter_b":"She need to go away!","commenter_a":"Is Sinead even relevant anymore?","post_message":"Arsenio Hall Sues Sinead O'Connor For Millions For Claiming He Fueled Prince's Addiction And Drugged Her. Read more on the lawsuit here.   Grio fam, what do you make of this lawsuit and Sinead's claims?"}]
