[{"comment_id":"1287965734605309","commenter_b":"Fuck Trump. There's my dignity. I'll grab him by the pussy.","commenter_a":"All of you need to remember that you are not in the fourth grade anymore, and that we can actually behave as adults. Cut out the filthy language and the belittling insults. If you have something to say, say it with a little dignity. Also, try to improve your spelling and grammar.","post_message":"Gullible fools...  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"546543972211278","commenter_b":"More Bullshit they don't do any of the test you say they do... Your make how much money off Dead Babies at 9 months? Disgusting Women","commenter_a":"Only a woman should decide what happens to her and her body!! Unbelievable that a so called modern nation is still discussing about that issue ! The body of a woman is not a incubator without any rights!!","post_message":"\"I will defend Planned Parenthood. I will defend Roe v. Wade. And I will defend women's rights to make their own health care decisions.\" —Hillary"},{"comment_id":"1788953421120280","commenter_b":"Progressive liberals are domestic terrorists! We the people must stop this corruption around our great country!","commenter_a":"Keep showing her lies as well as the corruption in Washington. Obama spending our taxes on her campaign, even though we are Not voting for her.","post_message":"Crooked Hillary Clinton lied to the FBI and to the people of our country. She is sooooo guilty. But watch, her time will come!"},{"comment_id":"576179842587911","commenter_b":"Sad. But, Karma is a real bitch...","commenter_a":"No matter how you cut it it's tragic, but in regards to Mr. Harmon's vote against firearms training it calls to mind the expression that there none so blind that do not see.","post_message":"In 2013, he attacked proposed legislation in Maine that would have required gun owners to take a firearms safety course ..."},{"comment_id":"891987007503062","commenter_b":"Death row for that bitch!","commenter_a":"DEATH!!!!!!!!!!","post_message":"The trial has finally started for this officer, after witnesses say they saw him pull out a knife and slit the dog's throat open, even though the dog was already restrained.  If you were the judge in this case, what would you sentence him to?"},{"comment_id":"10152785064574753","commenter_b":"Still, those girls can probably sue state of Montana.","commenter_a":"So when he was a sex offender where was social services to take the girls away! Now look at how he has damaged his grand children. He should be hung!","post_message":"A Montana man was sentenced to 200 years in prison for impregnating his 11-year-old granddaughter and sexually abusing her little sister. Although he was a previously convicted sex offender, authorities confirmed 55-year-old Makeal Shane Pruett was the legal guardian of both girls."},{"comment_id":"10153086168389411","commenter_b":"that is why she is the ex","commenter_a":"Hell hath no fury like a woman scorned.","post_message":""}]
