[{"comment_id":"465974283593152","commenter_b":"too damn bad. if they dont like get their asses out of our country. they dont and will not control america.","commenter_a":"Hell no!! They offend us just being here!","post_message":"Should The Words 'Bacon', 'Pork', 'Sausage' Be Banned?  Comment 'yes' or 'no'."},{"comment_id":"733056316849024","commenter_b":"Bitch has a nasty vagina","commenter_a":"They're wondering how to explain to their daughter that Trump won. How do you explain an adult woman wearing a vaginal out in public? What the heck is wrong with these people?","post_message":"ClashDaily.com"},{"comment_id":"1859752354244114","commenter_b":"She is very stupid...and very mixed up..crazed..","commenter_a":"FUCK-YOU,YOU LYING ESTABLISHMENT PIECE-OF-SHIT...THIS BOOTLICKING PUBLICATION ISNT EVEN WORTH WHIPING YOUR ASS WITH...NO RIGHT-MINDED UNDIVIDUAL/FREETHINKING PERSON CARES ABOUT THE PARTISAN-CORRUPT GARBAGE THAT YOU CREATE OUT OF FABRICATED LIES...SO,GO SHOVE YOUR HEAD RIGHT BACK UP #MADAMEINMATE666'S FATASS AND QUIT PRETENDING TO BE A JOURNALIST PUBLISHING NEWS...FUK-OFF.","post_message":"It’s official now: Jill Stein—and the Green party if it agrees with her—is/are a waste of space.  By Daily Kos user BoGardiner"},{"comment_id":"1265724350133686","commenter_b":"Honestly , I couldn't vote for either .. We will have a women in Whitehouse one day.. I want a patriotic POTUS whom puts Americans First always . Male or female makes no difference to me..","commenter_a":"Kirstie ally, was the first one to send Truck loads of supplies during super storm sandy.. \"Truck Loads\" I helped distribute.. Great Lady.. Love Trump","post_message":"Good for her!  She's also taking action herself!    @webpagelink"},{"comment_id":"1961690760557329","commenter_b":"How gorgeous is their baby gonna be @username @username can't believe one of my other husbands got someone else knocked up tho wtf","commenter_a":"Montana Cases","post_message":"Congratulations Rosie Huntington-Whiteley!"},{"comment_id":"10154287048884205","commenter_b":"TYT hello from Juneau Alaska! We are on the watch out here! Trump might sell us off back to the Russians, for a few barrels of oil!","commenter_a":"Hi Joe!!","post_message":"The Young Turks LIVE! Hosted by Cenk Uygur and Ana Kasparian"},{"comment_id":"10150822941699963","commenter_b":"What an entitled, self absorbed, sniveling whiner she is.","commenter_a":"Grow up Donnie","post_message":"Who saw this coming?!  Everyone. Everyone saw this coming."}]
