[{"comment_id":"10155080825746037","commenter_b":"Andrea ... it is scientific fact that bees couldn't fly without wings, but, pull the wings off of that bee and it is still a bee ! Semper Fi","commenter_a":"There is a scientific basis for being transgender. The brain's gender identity and the genitals develop at different times in utero. So mismatches due to hormones are possible. If God knits these children together in the womb, He must do some transgender knitting. A boy who goes through a phase of wearing a dress is entirely different than a boy who persistently and insistently over a number of years says he is really a girl. Psychologically, it is best for these kids to use modern medicine to enable their outsides to match their insides.","post_message":""},{"comment_id":"10153100644667431","commenter_b":"This girl knows nothing she is just as dumb as her ancestors, she is going to tell us that everything our ancestors fought for was a lie, no way our ancestors fought to keep our history alive and white people just want to erase us from history, don't let her finish her ancestors mission because she knows nothing she is a sheep, she doesn't even know about the underwater city they just found off the east coast of america a city that is older then her,,,,IM a descendant of a monkey theory, We know our history and can prove it with artifacts SHE CANT","commenter_a":"@username that's not true. The Bearing Strait Theory has been disproven by DNA and language development experts. Turtle Island is our original home given by the Creator","post_message":"Native American at Anti-Immigration Protest: 'You're All Illegal'  @webpagelink"},{"comment_id":"362582817419205","commenter_b":"They are terrified because of the media's misinformation. They blow the slightest remark out of proportion. He wants to expand on a wall that's already there. And the country has been deporting illegals the whole damn time. LGBT will continue to have their rights. And the so called race war is fueled by the media. Look at a person's character not at their skin.","commenter_a":"He should quit whining and moaning. I can assist him get residency in Madagascar within 15 minutes.","post_message":"Van Jones responds to the anti-Donald J. Trump protests: “We have to hear the pain.”"},{"comment_id":"965413580245506","commenter_b":"Keep trying @username. Killery the lying hag will fall short.","commenter_a":"PT Barnum is running for president!!","post_message":"Donald J. Trump tried to remember #DDay with a photo that wasn't from D-Day."},{"comment_id":"10153540575624411","commenter_b":"with Californias massive extreme drought, its like a match head waiting for a strike anytime any place.","commenter_a":"accidents happen anywhere why blame beautiful California. Nothing like California in this whole WORLD!!!!!!","post_message":"Watch: Huge forest fire sweeps highway in California"},{"comment_id":"10153718487658598","commenter_b":"Why can't liberals just coexist?","commenter_a":"Oh, but aren't liberals known for being open minded?","post_message":"Pro-Abortion Activists Freak Out New York Times Putting Picture of Pro-Lifers on Front Page"},{"comment_id":"904031539740409","commenter_b":"@username you are just Jealous because your fat ass cannot wear something like that. Shut the fuck up.","commenter_a":"1. Bitch you know damn well you can't wear that to school shut you're whinny ass up, talking about being oppressed. I'm offended about your damn video. 2. When the your school starts banning something you can't control like how your hair grows then your oppressed until then put a damn t-shirt on and go about your way because if you truly didn't car how you looked you wouldn't have wore a strapless dress.","post_message":"Her bare shoulders were enough to get her sent home from school. Now this teen is baring her thoughts on sexist dress codes."}]
