[{"comment_id":"1307596852595922","commenter_b":"Bangkok, Thailand","commenter_a":"Seoul","post_message":"Check out this LIVE rocket launch! Shortly, a Russian rocket will launch from Kazakhstan and travel to the International Space Station, and you can watch it LIVE right here. This is an uncrewed rocket, and it will deliver food, fuel, clothes, and other supplies to the astronauts on board the ISS. Where in the world are you watching from?"},{"comment_id":"10153847766591336","commenter_b":"That's Air Craft Carriers in english.","commenter_a":"So let's tell everybody what our Navy is doing!! Stupid media.","post_message":"On Monday, the aircraft carrier USS Harry S. Truman departed Naval Station Norfolk to head to the Middle East to combat ISIS. (Credit: U.S. Navy)"},{"comment_id":"1516900544996637","commenter_b":"And crooked lying hellary deleted 33,000 incriminating emails. That's why 5 people were given immunity so they wouldn't be prosecuted. Now why would they need that??? Here's the definition of immunity: Law. exemption from criminal prosecution or legal liability or punishment on certain conditions. Did hellary ever find the 6 billion $$$ that has been missing while she was SOS??? It's most likely in the clintons Swiss bank account! Wake up liberals!!! @webpagelink","commenter_a":"Trump is nothing but a CRIMINAL.. A FRAUD... CON ARTIST.","post_message":"City of Phoenix to Trump: Our cops didn't endorse you."},{"comment_id":"10156608436570354","commenter_b":"We need to STOP celebrating arrests.... and STOP the influx of these fuckers (LITERALLY) in the first place.... They breed like rats.... Once they infiltrate, there's NO GETTING RID OF THEM.... Think of the rat problems in NYC! How about cockroaches? How about emerald ash bore? Zebra snails? Asian carp? GET IT????????????","commenter_a":"There is no such thing as \"Moderate muslims.\" They all read from the same Quran.","post_message":"German police have now made a staggering 379 charges for the attacks in which women were sexually assaulted by migrant gangs on New Year’s Eve.  All the latest DETAILS here..."},{"comment_id":"1354018291282776","commenter_b":"Lol a bitch","commenter_a":"Colin, the multi millionaire football player only started feeling oppressed after he began dating a devout Muslim. He now hates everything American, but still takes advantage of everything American!","post_message":"If they thought their fans would blindly go along with any insult to their country, they were sorely mistaken..."},{"comment_id":"10156137722715093","commenter_b":"(If we support refugees by letting them into our country ISIS wins.","commenter_a":"And if we accept Syrian refugees without adequate screening America loses.","post_message":""},{"comment_id":"10154126988050787","commenter_b":"And emma dunsdon, you filty woman.","commenter_a":"Zzzzzzzzz yet more boring posts from the BBC..oo I've got cancer, please feel sorry for me. Yeh we get it, is it a competition to get the most comments ,likes and shares on FB..let's just pull some ..more..on..those..heart strings.","post_message":"Battling cancer with confidence 🙌  Meet Laura, the make-up artist who works with cancer patients in her spare time. (via BBC Three)"}]
