[{"comment_id":"10154217110321770","commenter_b":"We have a lot of work to do in America cleaning our schools of these liberal crazy teachers.","commenter_a":"This country, well the insane left, has lost it completely. Just flat out have gone rabidly insane. They need STOPPED. Now.","post_message":"These are the people teaching your children"},{"comment_id":"939419102765615","commenter_b":"If I was to make a point it would be that there should be an easier path to citizenship. People are coming over our boarders. Like or not, they are here. We can do three things at this point. We can continue the way we are. We can make a path to citizenship easier and less likely they're going to be expelled if they try. Or we can get all crazy and build a Great Wall around our boarders. Illegal citizenship builds poverty. Poverty creates crime. We all know this. I must remind you that precious few of us are truly Native Americans.","commenter_a":"People just don't understand how much America depends on Immigrant labor. If they were all to go on strike we'd all be paying more for things we take for granted. If they're here and not hurting anything what's so wrong with letting them stay and contribute to \"The Great American Melting Pot\"? Maybe, Just Maybe, They can become more than they started out when they got here. Never hurts to give them a chance.","post_message":"What a huge mistake. Except it shouldn't be one. - Laura Willard"},{"comment_id":"10153659904056770","commenter_b":"PEOPLE GUESS WHAT SHE WORKS FOR HILLARY NOW...","commenter_a":"Interesting Demcratic take on LGBT, since it's rumored that Hilary herself might fall into this category!","post_message":"Recently leaked emails from the Democratic National Committee revealed staffers had some less than LGBT-friendly comments."},{"comment_id":"753223974794383","commenter_b":"I am 70 years old but I still would have tried to kick that POS ass","commenter_a":"I'd love to knock his teeth out.","post_message":"Unreal. Would you intervene if it happened in front of you? Thoughts? @webpagelink"},{"comment_id":"10153336702199342","commenter_b":"Like my GRANDMOTHER WOULD TELL KEEP YOUR DAM MOUTH CLOSE .","commenter_a":"Pearland officers cool cops!","post_message":"What really happened when former Houston Oilers player Lamar Lathom was pulled over by Pearland police?  Lathon says one thing, while police say something else.  Now, we have the dash cam video .  STORY/VIDEO --> @webpagelink"},{"comment_id":"1707816392795801","commenter_b":"Kim Kardashian is a fucking douche, she and her asshat husband need to go the fuck away.","commenter_a":"Pity the no talent wannabe Kim Kardashian. Her only claim to fame is exhibition. So sad.","post_message":"Bette Midler isn't going to like this."},{"comment_id":"10153011056587169","commenter_b":"The go to feminist lie: blame it on \"Patriarchy\"","commenter_a":"I want all my kids to be powerful, my sons and my daughters","post_message":"How do you raise a powerful girl and what does that mean? PBS Parents experts share their thoughts:"}]
