[{"comment_id":"10153823695146336","commenter_b":"FORGIVE HER AS GOD FORGIVES YOU....PUNISH HER IN OTHER WAYS..NO CELL PHONE..NO XBOX. ..NO TV IN HER ROOM..NO COMPUTER IN HER ROOM (ONLY FOR HOMEWORK OVERSEEN BY YOU)","commenter_a":"It's called tough love. That's what children need","post_message":"Would you cancel Christmas to punish your child for stealing?"},{"comment_id":"10153247991679342","commenter_b":"Abortion is good. They should abort all babies born before the mother is 25","commenter_a":"here we go, \"all these people worried about worms in the water and nobody cares that planned parenthood is selling dead babies!\"","post_message":"One woman said she first noticed the worms yesterday in her bathtub and after collecting a few, she heard neighbors found the same thing.   @webpagelink"},{"comment_id":"640946546065952","commenter_b":"So support Hillary who takes millions of dollars from countries that practice Sharia law that kill women and kill gays for no reason! Also who's husband is a known sexual abuser and a rapist and she persecuted the sexually abused victims of her husband. Yet Hillary said she supports women's rights, what a joke. Wake up ladies!!! I'm wondering if Hillary hired these people to go there and start riots. Hillary Clinton is a evil corrupt woman who is mentally, physically and morally unfit to be our commander in chief!","commenter_a":"Go Trump.","post_message":"We're LIVE from Trump Tower New York, where the National Organization for Women (NOW) is leading an anti- Donald J. Trump protest."},{"comment_id":"10153936528885695","commenter_b":"You run like a girl","commenter_a":"Jose Arellano that's probably why we saw the traffic earlier today","post_message":"Wait for it...wait for it -- a police officer chased three shoplifting suspects across Georgia 400 after this car crash. See the full video, plus we'll explain how it all started, at 5:14! @webpagelink"},{"comment_id":"1188105787918203","commenter_b":"ANIMALS!@#$%^&!!!!","commenter_a":"These people are ALL nut jobs.","post_message":"See what happens when Islam and Christianity Mix"},{"comment_id":"1142218742523327","commenter_b":"No just Hillary now get back to your cat.","commenter_a":"They go together both fruit cakes","post_message":""},{"comment_id":"992247137464743","commenter_b":"The women that hate Amber Rose are either ugly or fat or both. A secure woman has NO REASON to hate on another woman.","commenter_a":"I love seeing a post about 2 women making a serious public statement about the hate women recieve and then reading nothing but hate on those 2 women (BY OTHER WOMEN) in the comments.........","post_message":"Jaw-dropping. #VMAs"}]
