[{"comment_id":"10153352503921051","commenter_b":"Ha ha bitch","commenter_a":"Don't see a problem with this. Fl. Courts finally got it right","post_message":"The Hello Kitty Rapist, a horrible man whose crimes included sexually assaulting multiple women and attacking a war veteran, just learned his fate."},{"comment_id":"10153825599556770","commenter_b":"Crooked Hillary's campaign is doing what they do best, and that is to take the focus off of her current health problems and turn the attention on to what Mr. Trump said in 1996 about a pageant queen. What's even more troubling is that the media is in their back pockets, treating her like she just won the presidency, while slamming Mr. Trump! Sorry, but who was it again who had 33,000 emails wiped from her private server using BleachBit that can never, ever be recovered? Who was it again who had staffers destroy their Blackberry phones with hammers? Who was it again who blatantly lied to the FBI? Who was it again whose \"key witness\" staffers were given amnesty from testifying? Who was it again who called tens of millions of Americans deplorables? And, of course, the list goes on and on and on! Isn't it amazing how crooked ...","commenter_a":"This is coming from a man who paraded his mistress around the city and let his wife be the last one to know he was divorcing her...he has as much room to talk about Hillary and Bill as Trump does...","post_message":"Former New York City Mayor Rudy Giuliani has some harsh words for Hillary Clinton."},{"comment_id":"577516445785152","commenter_b":"Sarasota canceled the witch!","commenter_a":"The pumkins look just like trumps he ad. Lol","post_message":"WATCH LIVE: Hillary Clinton continues to campaign in Florida, where she leads Donald Trump 45% to 44%, according to an NBC/WSJ/Marist poll reported by FOX News.  This morning, she's at the New Mt. Olive Baptist Church in Ft. Lauderdale."},{"comment_id":"10153009843726378","commenter_b":"A female can't be a predator","commenter_a":"So if a forty year old woman had sex with your sons you'd cheer him on and joke? What about a forty year old man that had sex with your 15 year old daughter? Because according to these comments no one cares about female predators.","post_message":"GUILTY PLEA: A former Baltimore Ravens cheerleader pleads guilty to raping a 15-year-old boy."},{"comment_id":"10152821064059342","commenter_b":"^ they just don't have enough self control to keep from raping a woman unless shes covered apparently.","commenter_a":"Why do we have a muslim Capitol day?","post_message":"FBI RESPONDING TO MUSLIM CAPITOL DAY THREATS: Organizers say demonstrators are expected to protest against Thursday's rally. A spokesperson said the event began in 2003 and has never drawn opposition before, but this year online threats have prompted the council giving event to contact the FBI."},{"comment_id":"546543972211278","commenter_b":"More Bullshit they don't do any of the test you say they do... Your make how much money off Dead Babies at 9 months? Disgusting Women","commenter_a":"Only a woman should decide what happens to her and her body!! Unbelievable that a so called modern nation is still discussing about that issue ! The body of a woman is not a incubator without any rights!!","post_message":"\"I will defend Planned Parenthood. I will defend Roe v. Wade. And I will defend women's rights to make their own health care decisions.\" —Hillary"},{"comment_id":"10154488301629228","commenter_b":"Good God she's a monster","commenter_a":"This woman is a liar, she lied to the police about Betsy Faria's death and her role in it and tried her best to imply Russ had killed his wife. Why she's not in jail is beyond me. I think this new story stinks to high heaven and hopefully the O'Fallon PD does a very through investigation. This woman is dangerous, avoid her for your own safety","post_message":"\"For him to be alone at all is shocking for me.  He doesn drive.  He doesn leave the house by himself."}]
