[{"comment_id":"1042027782504360","commenter_b":"Bitch would've been sucking soup out of a straw...","commenter_a":"This warms my soul.","post_message":"This is some serious racism. Would you have slapped her after she spit on you?"},{"comment_id":"481351072068406","commenter_b":"Ah realy swear. Her tits were that big. gcl","commenter_a":"He and Hillary could murder someone in front of a hundred people and nothing would be done. They are despicable.","post_message":"Bill Clinton Breaks Massachusetts Law -  Now 60K+ People are Calling for His Arrest!"},{"comment_id":"1280019028698326","commenter_b":"The football players that choose to disrespect all of the heroes that have died for this country, this anthem, this flag and unfortunately for them are lowest ungrateful humans that are part of the big problems of this country. I will not support the NFL in any form until they get rid of the garbage.","commenter_a":"BOYCOTT! Stop giving these spoiled brats their millions of dollars to play around. Then they will respect US!","post_message":"\"To protest against the flag, which stands for the United States of America, it's a disgrace. And if they don't like it they should go play football in Canada.\"  Jim Riches, whose son Jimmy was a firefighter killed on September 11, responded to NFL players like Colin Kaepernick and Brandon Marshall who are choosing to protest the national anthem."},{"comment_id":"10153427905081051","commenter_b":"stupid woman I hope she gets in big trouble .People like her don't need pets .They are a big part of the family","commenter_a":"GOOD! SHE NEEDS TO BE IN TROUBLE!","post_message":"Friends and family took one look at this woman's Facebook update and immediately called the police."},{"comment_id":"10153443850876680","commenter_b":"For her Clinton Foundation....Just say NO to HILL the SHILL!!","commenter_a":"Hillary Clinton will make a great President ! :-)","post_message":"Hillary Clinton name-checked some of her local allies and shared a series of personal stories, such as the recovery following the 9/11 attack and working with Congress to get first responders health care."},{"comment_id":"1054986811286811","commenter_b":"She is looking weak","commenter_a":"Hillary Clinton is as transparent as mud. She's so deplorable....no wait...I don't want her sharing my basket. Trump/Pence 2016","post_message":"Question of the Day: Do you think Hillary Clinton has been transparent about her health? Share your thoughts below!"},{"comment_id":"10153189308491336","commenter_b":"Fuc_k the Muslim Scum Bags. If they don't like the American way of life go to the \"Big Sand Box\" to live. Then they can cook and keep warm with Camel Dung...........","commenter_a":"SHAME SHAME SHAME on these colleges and universities for the disrespect they show to our America and for the disrespect they show our military who have given their all to protect THEM.................... just hard to believe there are people in these positions who let this garbage happen. STAND UP FOIR AMERICA AND DO THE JOB","post_message":"President of the University of Maryland College Republicans: \"This isn't a racist film. It's about a decorated American war hero who [risked] his life for you and me and all the viewers.\""}]
