[{"comment_id":"10154973344274166","commenter_b":"@username my daddy would never. Then again he's only had one wife and never talked about groping his children.","commenter_a":"They about to get cozy. He is so in lust with her.","post_message":"Here's a look at Pres. Trump and daughter Ivanka as they departed Washington unannounced to honor slain Navy SEAL Chief Petty Officer William \"Ryan\" Owens. Read more: @webpagelink"},{"comment_id":"10155761644675725","commenter_b":"The employee should of knocked that bitches teeth out","commenter_a":"Kristin Nugent Grigsby","post_message":"A woman has been arrested after allegedly biting a Macy’s employee over a Michael Kors handbag ---> @webpagelink"},{"comment_id":"10153128765639586","commenter_b":"<3","commenter_a":"Jessica Thompson this is why we cut those things!!!","post_message":"ALWAYS CUT YOUR PLASTIC SIX-PACK RINGS.   PETA fieldworkers found this poor feral cat reminding us all how dangerous discarded plastic & other trash can be: @webpagelink   SHARE to remind everyone!"},{"comment_id":"1243719872306934","commenter_b":"I would kill radical's in a minute for these women!","commenter_a":"These guys need to be exterminated!","post_message":"Of all the atrocities committed by ISIS, this just might be the most horrific of all. Kidnapped girls and women caged like animals and then set on fire for refusing to have sex with their Islamic captors"},{"comment_id":"10154264665781336","commenter_b":"No @username My dad is a legal immigrant my dad learned today that his vote is worth crap and the party will NOT listen to his vote and they will do whatever unless you bribe politicians You can take your negativism and stuff it up your butt","commenter_a":"Why even be a Republican or Democrat when they throw away your vote and DO NOT LISTEN No LONGER a party member of anything","post_message":"\"We don't feel that this was a fair process. The Trump button got checked more than any other, so why do we have so few delegates?\" said State Treasurer Jeff DeWitt."},{"comment_id":"10154656959438132","commenter_b":"She should never get out!","commenter_a":"I wish this country had \"an eye for an eye\" law. She should be put into 600 degrees of heat. That poor poor child. This sickens me.","post_message":"The daughter, now 15, has undergone 28 surgeries since the incident. (via People True Crime)"},{"comment_id":"1039445359429269","commenter_b":"Ewe, she looks drugged. GHB, JEB.","commenter_a":"I hate that... its like telling you , your my pet.I be your master.","post_message":"At least the younger Bush is a little more smooth with his moves."}]
