[{"comment_id":"1354028091302090","commenter_b":"Thank you for telling it like it was and appeared. I completely agree with your assessment. I am sure some women were just following what everyone else was doing: clueless, just part of the cattle drive to slaughter. Made me sick to my stomach seeing pictures of the filthy, vile costumes they paraded around wearing. Unbelievable, no shame whatsoever!! Hillary's minions!","commenter_a":"Straight talk: haven inspired me to join your cause, Hubbard went on. anything, you inspired me to run the other way.","post_message":"You've got to see this!"},{"comment_id":"1337533142938860","commenter_b":"an untalented hooker","commenter_a":"That creepy dame who's his spokes person ought to be banned from every network and media outlet.","post_message":"Whoa, CNN grew a backbone! After what was said, he should be banned from America."},{"comment_id":"710239562414460","commenter_b":"Yep, it's a sure way to self-destruction and negativity.","commenter_a":"Nope, not true. If that were the case, there would be collective responsibility too, and that would be impossible. We are individuals responsible individually for our own actions, choices and lives.","post_message":""},{"comment_id":"10152838610772144","commenter_b":"We get it, dude. Strong, intelligent women scare you.","commenter_a":"Filing charges for social media is ridiculous, it wont stick","post_message":"\"The amount of gender violence that I experience is absolutely extraordinary. And a significant part of my day today will be spent filing police reports at home about gender violence that's directed at me in social media.\"- Ashley Judd"},{"comment_id":"955814454527001","commenter_b":"He involves himself into everything other than the priests who get their heads c*** off so called refugees .","commenter_a":"lmao the fact that this is an actual problem and a topic taken up by the pope, speaks volumes about the state of the humans! arent we suppose to be the most intelligent species...i mean we aren't animals that can change genders at will or to reproduce...","post_message":"\"Today, in schools they are teaching this to children -- to children! -- that everyone can choose their gender.\""},{"comment_id":"10153381284694087","commenter_b":"And until tools are in place, ban all Muslim immigration!","commenter_a":"Bubio is a big money lobbyists puppet! Vote for Trump!","post_message":"\"How many attacks on the homeland will we have to endure before the president understands that lawful intelligence tools subject to judicial review are necessary to win the long war against radical Islamic jihadism?,\" Sen. Marco Rubio wrote in a scathing op-ed along with Sens. Tom Cotton and Joni Ernst."},{"comment_id":"10154382479866159","commenter_b":"Now is a good time to venture into the moving industry !!","commenter_a":"I know a lot of people I hope does this.","post_message":"\"Make dating great again!\""}]
