[{"comment_id":"10153557927483984","commenter_b":"More liberal stupidity","commenter_a":"This is just getting Americans used to having freedom taken away from them. One step at a time until Americans have no freedoms to do anything. This will stop when Liberal politicians are voted from office.","post_message":"Wow. Taking the Confederate flag down from state capitols was controversial enough, but this is on a whole new level. A lot of people are going to be furious...  Do you think Congress has gone too far?"},{"comment_id":"10155464827050354","commenter_b":"Crazy ass bitch.","commenter_a":"Ms. Warren needs to look into the eyes of the youngest victim and then advocate against the death penalty. And then go to the other families that lost loved ones or lost limbs and time. That dear little boy didn't have the chance to live and she wants that piece of sh*t to live a long life.","post_message":"Liberal values..."},{"comment_id":"10157089622540206","commenter_b":"White woman","commenter_a":"@username racism at it's finest","post_message":"“Because we aren’t whitewashed enough in Hollywood, apparently,” BET tweeted."},{"comment_id":"10153971160946320","commenter_b":"@username - LOL. That's ok. Some people need a little help to find their funny in the morning.","commenter_a":"The moment you realize the Jon Stewart photobomb.","post_message":"Retired firefighter Ray Pfeifer was honored at City Hall for his work in persuading Congress to extend Zadroga Act benefits for thousands of 9/11 first responders suffering from 9/11 related illnesses.  Thank you for caring and fighting for what was right. Read: @webpagelink"},{"comment_id":"1089590774419709","commenter_b":"The most stupid people in America are and has been those always vote against their own economical interests. While the Democrat Party still was the people's party, all the aforementioned idiots were working class Republicans, but not anymore. Now the most disgusting idiots are Democrats whom supporting Queen of Monsanto, Hillary Clinton.","commenter_a":"Vote for the ONLY Candidate who stands up against Monsanto! Bernie Sanders!","post_message":"“If Monsanto gets its way, the American people will pay a high price for corporate greed and political corruption.”"},{"comment_id":"10154105448940950","commenter_b":"@username So many foaming at the mouth racists until he will need them. He will need them in heaven.","commenter_a":"This \"news\" is like a week old. Why do I care if she wants her son to finish school with his classmates this year? Most parents would do the same.","post_message":"Melania and Barron Trump plan to remain in New York City until at least the end of the school year."},{"comment_id":"1226980343992420","commenter_b":"Ugh man females I hate em in high school and yes we can have a button up and cleavage will show lol","commenter_a":"Jessica Elizabeth😂😂😂","post_message":"Boob deodorant? Oh yes, I've got that."}]
