[{"comment_id":"10153180223152522","commenter_b":"Really? F... off! I rather vote for Clinton. (As much as I despise her)","commenter_a":"Hell no!","post_message":"Ryan was the man to unite the party in Congress. Could he do it again for the White House?"},{"comment_id":"10152845458146336","commenter_b":"you must be of yourr meds you moronic female","commenter_a":"A million and a half babies aborted each year in the United States and we are horrified by this?","post_message":"Zookeepers were horrified to discover 5-week-old cubs had been killed and eaten by their mother."},{"comment_id":"1505849332764056","commenter_b":"She needs to be held accountable..!!!","commenter_a":"You honestly can say that about both candidates...","post_message":"If Hillary Clinton hadn't thought that laws don't apply to her, if she had not believed that she was above the law and traditions that everyday people have to follow, she wouldn't be in this mess.  She's in this mess because of what she did.  She is in this mess because of who she and her husband are."},{"comment_id":"10152922830971491","commenter_b":"@username, you killed my sides.","commenter_a":"So many hateful comments. Why?!","post_message":"“God chose us to take care of these babies.”"},{"comment_id":"1297208260357707","commenter_b":"How can she do that from behind bars","commenter_a":"Only three more days of this fake bullshit, then Hillary will shut your lying asses up.","post_message":"The Associated Press may be the most venerable wire service in the world. However, they're now under massive fire after the sickening offer they made to the Clinton camp was just discovered...  The press is willing to do anything to stop Donald J. Trump, and this is yet more proof."},{"comment_id":"1202853869734641","commenter_b":"Muslim go home","commenter_a":"I don't believe we should elect a president so delusional he believes the Earth is only 6000 years old and that going to prison can make a person be gay...","post_message":"\"I would not advocate that we put a Muslim in charge of this nation,\" Dr. Ben Carson told Meet the Press."},{"comment_id":"10152541271415667","commenter_b":"Well Mickey they need a big building for all of his coloring books. Forget the white racist asshats on here... they will all die off eventually.","commenter_a":"Bush is responsible for thousands of american lives yet you bigots hail him as this savior because a blk man is president...he needs to be in jail yet you tea parties build him a library. .FOR WHAT!","post_message":"\"I have no more campaigns to run,\" Obama quipped during the State of the Union. \"I know 'cause I won both of them.\""}]
