[{"comment_id":"10156388159930294","commenter_b":"Racist white trash!!!","commenter_a":"Negro......you was a bad hood rat","post_message":"An Akron man learned his punishment for kidnapping and beating his ex-girlfriend. When the victim tried to escape, she broke her leg. More on the story here: @webpagelink"},{"comment_id":"10153177942114170","commenter_b":"Once a LIAR, always a LIAR! But what difference does it make at this point! Hillary is Obama in a skirt! Another Democrat that Bows to ISLAM and leaves Americans being attacked by Muslim Terrorists, TOO DIE!","commenter_a":"She should go to jail rather than the White House. Worst Secretary of State ever along with Obama the worst President ever.","post_message":"How stupid does she think we are?"},{"comment_id":"1285291914863987","commenter_b":"Another Muslim bites the dust !!!","commenter_a":"Thank you sir","post_message":"The police officer who shot and killed The Ohio State University attacker has been identified as Alan Horujko. @webpagelink"},{"comment_id":"10154299684276547","commenter_b":"???","commenter_a":"hire catfish ... they find everyone","post_message":"Judith met John online. But he wasn't John. He was a 'romance scammer' who made off with ,000 of her money. @webpagelink"},{"comment_id":"10152899941331336","commenter_b":"Sick woman","commenter_a":"This young lady will burn in her afterlife.","post_message":"A New Jersey woman who authorities say put her newborn baby in the middle of a road and set the child on fire was charged with murder."},{"comment_id":"865380196838555","commenter_b":"You're a dumb b****.","commenter_a":"Islamists stand together...if he were to admit islamism, he might be called an apostate.","post_message":"There’s a far bigger issue involved here than going to the anti-terror march in Paris on Sunday. That is Obama’s persistent refusal to identify the enemy as what it really is: Islamic terrorism. It’s pathetic to see the contortions our president and various administration officials and spokesmen go through to avoid using the word “Islam” when talking about the people who are waging war on the West. @webpagelink"},{"comment_id":"10153737877981409","commenter_b":"What a jerk!!! He thought what he did was a start for his 2020 presidential run. After tonight, he'll never be elected. He shot himself in the foot and his chances for 2020.","commenter_a":"Unfortunate choice. He committed political suicide and will take the name \"Lyin' Ted\" to his grave.","post_message":"Former Trump rival Cruz met with boos during GOP convention speech."}]
