[{"comment_id":"10154075665287377","commenter_b":"Denounce your US Citizenship,,proclaim illegal alien status anf receive FREE Medical from the Government!!!!","commenter_a":"Can't repeal it fast enough for me! My own insurance costs went up 700 bucks once Obamacare kicked in. Seems I'm paying for some family that can't afford their own insurance. Well... I can't afford their insurance either!","post_message":"Sen. Rand Paul slammed the Affordable Care Act, also known as Obamacare, saying Congress will, \"as its first course of action, vote to repeal Obamacare. It cannot happen soon enough.\""},{"comment_id":"1625836147707451","commenter_b":"That would be very hard for her to do.","commenter_a":"Why wait, just blow your brains out. Wait, that's why you said that, you don't have a brain","post_message":"Typical Hollywood liberal with an overreaction to everything."},{"comment_id":"1187848264597052","commenter_b":"Do you want to be responsible for a bus full of kids? Better to keep them home than risk it","commenter_a":"Why don't people buy chains? I don't get it","post_message":"JUST IN: Per the Flagstaff Unified School District, all FUSD schools will be closed on November 29th due to icy road conditions."},{"comment_id":"10153542094851509","commenter_b":"@username wow your German? That sucks Germans can't reproduce, their birthrate is below 0% by 2060 there will be more muslims in Germany than Germans. LMBAO enjoy your day.","commenter_a":"Oh yet another white on black crime receiving national.media coverage. Way to keep the racial divide strong. But i am glad to see some justice is being served.","post_message":"Demonstrators have flocked to North Charleston City Hall to protest the shooting death of Walter Scott. The following report contains graphic content. Viewer discretion is advised: @webpagelink"},{"comment_id":"10155101545959866","commenter_b":"I was in prison and the c.o.s and inmates were always like buddies","commenter_a":"Do you even know what C.O goes through everyday? Well you guys are probably working at mickey D's thinking you have a hard job","post_message":"LIVE: Delaware prison guards taken hostage by inmates a maximum security prison - live ground video. MORE at @webpagelink"},{"comment_id":"10157791995705206","commenter_b":"Rhd cars are illegal in NJ","commenter_a":"I see how they survived. The driver's side is on the right not the left. If it was an American made Car. The driver would have been dead.","post_message":"How could anyone have survived this horrific car crash? @webpagelink"},{"comment_id":"1195382713852612","commenter_b":"Okurumoniwonba Orimekunluyi, you are an idiot. None of what you say is even remotely true. Please pay attention.","commenter_a":"If Elizabeth Warren called me she would certainly get an earful of how despicable she is. She would hang up on me but I wouldn't hang up on her.","post_message":"When Elizabeth Warren isn't busy holding special interests accountable, she finds the time to make some calls for Hillary. Join her: hillaryclinton.com/calls"}]
