[{"comment_id":"1565559713753745","commenter_b":"Boy are you missing it!!!! Blacks kill each other 1000% more!!!!","commenter_a":"Wow. I didn't really support this dudes agenda before but after this, I can get down with him somewhat. It's a shame a man from another country has to speak on behalf of black Americans.","post_message":"\"Why are you Americans killing the black people there, shooting them down when they are already on the ground?\" he said. \"Answer that question, because even if it's just one or two or three, it is still human rights violations.\""},{"comment_id":"1219218918112237","commenter_b":"This is how Clintons work! So illegal!","commenter_a":"THIS PERSON NEED'S TO RESIGN IMMEDIATELY,BILL CLINTON HIRED HER TO WORK FOR THE DOJ WHEN HE WAS PRESIDENT.DO YOU THINK THERE MIGHT BE LITTLE THANK YOU PAYBACK.","post_message":"The DOJ is still investigating Hillary Clinton for possible criminal wrongdoing regarding her private email server, so why would Attorney General Loretta Lynch meet privately with former President Bill Clinton?"},{"comment_id":"545790502236393","commenter_b":"Liberals are NOT PRO ABORTION! WE ARE ANTI RELIGIOUS FANATICS THINKING THEY CAN RULE OUR BODIES! We are also pro families once children are born. We are anti poverty and anti starving and neglected children. We are as los anti ignorance!","commenter_a":"You will Never be president of my country. Nor will you ever dictate what I can or cannot do with my body. You creep.","post_message":"Really? He thinks that alienating 51% of the registered voters in this country is the way to get elected?"},{"comment_id":"10156346030730725","commenter_b":"@username We know you're illegal, Pack your bags buddy you're getting deported!!","commenter_a":"We love you here in South Carolina Mr Trump! #MAKEAMERICAGREATAGAIN #TRUMP2016","post_message":"THANK YOU for your support this evening Myrtle Beach, South Carolina! My family and I had a fabulous time with you this evening. Together we will #MakeAmericaGreatAgain!"},{"comment_id":"1078041262207343","commenter_b":"Fire her now!","commenter_a":"Mandamus?","post_message":"She took an oath. And the oath didn't say: \"I will uphold the parts of the Constitution that I agree with and ignore the rest\""},{"comment_id":"10152706974886717","commenter_b":"As an Australian, observing from afar, ALL your possible candidates are hypocrites and troubling. In a perfect world, Bernie Sanders would be President and the GOP and the Tea Party would have melted into oblivion. However, it's NOT a perfect world, and I'm a realist. Even the darling of the left, Elizabeth Warren, is an avid supporter of Israel, whilst allowing the continued persecution of the Palestinian people. Politics isn't about the best possible person: it's about the least worst. Hillary Clinton is the least worst by a country mile. We know where she stands. We know how she thinks. We know how she works. We know she's a fierce supporter of women's rights. We know she's learnt a lot of painful lessons from her time as first lady, Senator for NY, and as Secretary of State. I also believe that she's learnt from these mistakes to make herself a ...","commenter_a":"Doesn't mean she should be president. we need to stop being single issue voters and look at the whole picture.","post_message":""},{"comment_id":"10155770026010354","commenter_b":"She would England better than America.","commenter_a":"And I will remember not to vote for you!","post_message":"Facebook pool: how long until there's a hunting photo op to show how much Hillary understands sportsmen?"}]
