[{"comment_id":"10152889547313299","commenter_b":"I thought I could not dislike this so called woman any more than I do, but, taking a disabled parking spot is outrageous!!! Did she get a fine? Everyone else would have. Do you really want to see this self-centered, rule breaking murderer as president???","commenter_a":"Hilliary is entitled to be queen and all the common people are her court. she can be charming but she's Danger with a capital Dl . she is deceptive with a capital D and isn't that strange Democrats. Is a capital D too","post_message":"Hillary Parks in Handicap Spot ... @webpagelink"},{"comment_id":"10153203209001336","commenter_b":"THANK GOD THERE ARE MOTHERS LIKE HER I WOULD DO THE SAME THING IF IT WAS MY KID!!","commenter_a":"Lets hope she isn't accused of child abuse!","post_message":"VIDEO: A woman is seen beating a rioter in Baltimore. It turns out he is her son."},{"comment_id":"10153745171813837","commenter_b":"She lied. There's a difference.","commenter_a":"Far more honest about her mistakes than Hillary Clinton.","post_message":"MRS. TRUMP: Melania Trump announced Thursday that she took down her website, acknowledging that it contained inaccuracies."},{"comment_id":"10154686785341323","commenter_b":"Clarkson and Mary Berry should do a show together. Cut from the same cloth - she's just quieter about it.","commenter_a":"Wells said sir David. We all love clarkson.","post_message":"Unnatural history."},{"comment_id":"10153363808198010","commenter_b":"How do we know the restaurant would go out of business anyway? It happens all of the time. I live in Seattle and the rate increase is just slowly beginning to take effect. No conclusions of this sort can be made.","commenter_a":"In Seattle where they just raised minimun wage to $15 a hour some restaurants are now going out of businss as restaurants are having to pass on to their customers a lot higher prices for the food they serve.","post_message":"An L.A. City Council committee has endorsed a hotly contested plan to raise the citywide minimum wage to $15 by 2020, up from the current $9 an hour. The proposal now heads to the full city council."},{"comment_id":"1675805602436783","commenter_b":"Wicked prick!","commenter_a":"That is what happens when you try to work \"across the aisle\" with a group of people that have no desire to work with you.","post_message":""},{"comment_id":"10153858888594474","commenter_b":"Actually, she needs to go to jail.","commenter_a":"Not soon enough!!!!! We might get Hillary so it will just be like having Obama in the White House.","post_message":"Let the countdown begin. Share if you're ready for the end of the Obama era!"}]
