[{"comment_id":"895487660544289","commenter_b":"I wanna find the actual article sited for this one","commenter_a":"Tiffany Rae 😐","post_message":"Another colossal Republican waste of taxpayer money."},{"comment_id":"10154315230081051","commenter_b":"Kelly knows the enemy is coming from the south and must be stopped . Declare war and deport all foreigners !!!","commenter_a":"Military to the front again Obama to da back of the","post_message":"Trump's Homeland Security pick is dead serious about stopping the flow of illegal immigration into America. Does that sound good to you?"},{"comment_id":"10154775729248812","commenter_b":"Not to mention she has dyed her eyebrows to try to look younger. Won't work. She still looks like she needs a nap.","commenter_a":"They both disgust me","post_message":"Hillary Clinton: “Last night I was ‘grossly generalistic,’ and that's never a good idea.\""},{"comment_id":"10152662360374117","commenter_b":"Trevor clearly you're an angry misogynistic ass with your little troll posts. Ha.","commenter_a":"What's really alarming is that around 1 in 3 women will be sexually assaulted in their lifetime.","post_message":"Well, this is alarming."},{"comment_id":"462218217236106","commenter_b":"Transgender? It's a Guy who wears girl shit. That's no Transo, that's a stupid crossdresser who can't tell the difference between a P and a V. Sheesh! This country is Fucked up on this stupidass politically-correct bullshit. Wipe the makeup off and take the wig off or you'll get that shit Scraped off and that wig Split by angry parents and/or boyfriends.","commenter_a":"LET ME FIND OUT MY DAUGHTER, GRANDDAUGHTER HAD THIS FREAK WALK INTO THE SAME RESTROOM WITH THEM AND FOUND OUT THE SCHOOL OKed IT I`M GOING TO OWN A BIG PART OF THAT SCHOOL SYSTEM! THIS FREAK IS A MALE AND ALWAYS WILL BE ONE, HE HAS MALE DNA, MALE GENES MALE FINGER PRINTS A MALES RIB CAGE AND MALE PLUMBING NO SUCH THING AS A TRANS GENDER! THIS FREAK NEEDS TO STOP PLAYING DRESS UP AND PRETEND! HE MAY GET MORE THAN HE`S LOOKING FOR BY SOME DAUGHTERS DAD!","post_message":" girls have rights, and they shouldn have to share a bathroom with a boy, said a parent. See how this transgender student is causing a firestorm in a Missouri high school."},{"comment_id":"10155254328488690","commenter_b":"ALL THOSE WOMEN AND THEIR HUSBAND ARE ALL TERRORIST ..THEY SHOULD HELP THEM SELF'S AND SOLVE THEIR PROBLEMS NOTING ONE CAN DO TO STOP THEM FROM DOING EVIL IS INBORN IN THEM ....THEY ARE BORN WITH EVIL AND GROW UP WITH EVIL SO LET THEM PAY FOR THEIR EVILS","commenter_a":"Is today that you learned to join in hand to fight boko haram... What kind of leaders are you... You waste much time and innocent people lost their lives... The same thing happens in Libya president was been killed. Non of African leaders contribute a trip to help him... Everything UN and we gain nothing... Africa let's stand for our own... Bob Marley was a mixed blood yet he loves Africans and fight for you throughout his musical... Africa unit...","post_message":"\"The governments of Cameroon, Chad, Niger and Nigeria engaged in fighting against Boko Haram must take seriously their responsibilities to protect civilians.\"  - Winnie Byanyima & Jan Egeland"},{"comment_id":"626503050873607","commenter_b":"Man she's one ugly silver back","commenter_a":"I am sick of all the threats and lies on FB have you no shame? This President only has a year to go what do you gain with the BS about him and his family. Crawl back in your hole!","post_message":"Michelle Obama was just hit with a multi-million dollar law suit for this reason.  Totally justified. She deserves prison.  Do you agree Michelle Obama is a criminal?"}]
