[{"comment_id":"10153084028785667","commenter_b":"Uhh bc illegals.. This makes it easy for anyone","commenter_a":"Why would people not use their drivers license? Using library cards and Costco cards? Packing your driver's license? Seriously? Stupidity at its finest. Some people should just stay home.","post_message":"A credit card, prescription, student ID or even a Costco card could be enough to convince the TSA you are who you say you are."},{"comment_id":"10154451806701336","commenter_b":"@username no he wants to ban people ! Refugees are properly vetted - since we have had close to a million come in since 911 !","commenter_a":"Something is wrong with the America I grew up in.. it's called liberalism!","post_message":"Just In: Elderly patient and nurse shot and killed at hospital in Titusville, Florida. Police have not released information on suspect or motive. More: @webpagelink"},{"comment_id":"10153262591601051","commenter_b":"Hahaha, what the hell are you? Nothing but a Hispanic niigger. But you think you're better.","commenter_a":"Fu¢k niggas","post_message":"Here's what these protesters chanted while they were being escorted by police."},{"comment_id":"10152949187346130","commenter_b":"Heheheh I don't need a beard to attract women and prove dominance. It's all in confidence and your attitude. You want dominance? Push me far enough and you'll find out your place real quick! ;)","commenter_a":"lol","post_message":"It's just evolution."},{"comment_id":"1092094194179315","commenter_b":"Because I have read other shit she has posted and the BITCH talks crazy THAT'S WHY @username!!!!","commenter_a":"Wondering, where are the people saying, \"he should've complied with police orders?\"","post_message":"Protesters in Fresno, California, waved the Confederate flag & signs that read “White Lives Matter” to express outrage over a local unarmed white man’s police-involved shooting death.   Several shouted “f**k the police” and threw water bottles and glass toward a line of policeman gathered near the crime scene. DETAILS ---> @webpagelink"},{"comment_id":"1214715148582648","commenter_b":"That IS NO lady!","commenter_a":"This is one sick lady","post_message":"WHOOPIE GOLDBERG: Right To Abort Baby Same As Right To Celebrate Birth Of Jesus Christ [VIDEO]"},{"comment_id":"10153436699476337","commenter_b":"Yea and he's got a fake pussy.","commenter_a":"No one here read the article did they? She's not being called out for being a white NAACP supporter or for \"not being black enough\", she's being called out for lying about being black. She's totally not black at all. She's a white woman pretending to be black saying that she grew up poor, black, and racially profiled. When she wasn't. At all. -_-,","post_message":"HOW DOES THIS HAPPEN? Is this NAACP leader pretending to be black? Many on the Internet certainly think so..."}]
