[{"comment_id":"10152657458940047","commenter_b":"First get your children out of that muslim so called college. Stop paying tuition. Shut it down. It is now a muslim training camp. Congress must shut off funding. Senate and House must stop acting like they dont work for us and get all Muslims out of this country. Enough is enough!","commenter_a":"Operation Paperclip: 69 Years Later: @webpagelink","post_message":"ISIS militants and Hamas jihadists conducting training camps on American college campuses is no different than a training session for student athletes?    According to the Assistant Dean of Students at Cornell University they are.  Astounding."},{"comment_id":"10155223291794218","commenter_b":"Hillary didn't get elected. You're a victim of liberal ideology and the dumbing down of society.","commenter_a":"Section 212(f) of the immigration and nationality act of 1952 states: whenever the president finds that the entry of any aliens or of any class of aliens into the united states would be detrimental to the interests of the united states, he may by proclamation, and for such period as he shall deem necessary, suspend the entry of all aliens or any class of aliens as immigrants or non immigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate. Any questions?","post_message":"The Department of Homeland Security says it will comply with federal orders not to deport detained travelers"},{"comment_id":"10153284422191323","commenter_b":"White people are often unaware of their privilege as it is invisible a lot of the time. Happened to me when I got pulled over by a cop for cutting in front of them. I got an angry warning. If I were black, there's a better chance I would have gotten a ticket. I'm not 100% white, but eh, close enough in terms of looks to get the benefits of privilege most of the time. Except at hoity toity Connecticut country clubs.","commenter_a":"Do you understand now white folks?? Its not about you as a person but the system that programs these prejudice biases into you without you knowing consciously.... So when we speak out about institutional racism and bias...its not a direct knock against you as ppl but the fabric your ancestors created and is still maintained today.....","post_message":"Racism is a business. Its marketing is so successful that even Akala looks sideways at a young black man holding a lot of cash"},{"comment_id":"908006605999185","commenter_b":"Just try to take mine down!","commenter_a":"Good for USA...fuck obama","post_message":"This is HUGE!"},{"comment_id":"10155334759910329","commenter_b":"You won't be here to tear it down....This is America not Mexico...Tell your parents to get out and take you with them. And see where you end up.Won't be here in USA because you be able to climb the wall.","commenter_a":"No, you won't","post_message":"The photo was taken at a anti-Trump march on Saturday."},{"comment_id":"10153255153245329","commenter_b":"Jason Winter you must","commenter_a":"@username eeeeee","post_message":"These dogs don't know what to do now."},{"comment_id":"1729831163913652","commenter_b":"According to her, if you don't vote for her, your a Sexist.","commenter_a":"If youre thinking of voting because shes a woman Please dont vote at all This is about the future of the U.S And this *woman* Cares nothing for equality women Nor blacks... Nor anyone but her corporate buddies","post_message":"Hillary Clinton told a colorful story in Reno that ended with the former secretary of state barking like a dog to slam Republicans ... @webpagelink"}]
