[{"comment_id":"392182107608412","commenter_b":"He had a gun in front of him , h9w do you know his hands were uo you cant see shit . You fuckers are stupid to believe that its the cops fault or the military fault if not for either you fucking scumbags wouldnt have a place to trash , rob and i really can care less if you dont cosider me a fellow american if you believe that fuck was innocent your as bid of a piece of shit as he WAS dont even call yourself an american you fucking soft liberal scumbag go catch a bullet.and if you th8nk i cant handle a weapon then come up to ny and find out get the fuck out of my country and go fuck your allah in the ass","commenter_a":"Dont hate the cops, hate yourselves for breaking the law and being to stupid and lazy to get a job","post_message":"\"I ain't doing nothing. I'm not reaching for nothing, bro.\""},{"comment_id":"1266650310018983","commenter_b":"@username so a WOMAN RAPED HAS MENTAL DEPRESSION FROM THE INCIDENT CANNOT NOW BUY A GUN TO FEEL SAFE AND ALL THIS WITHOUT A JUDGE OR DUE PROCESS???","commenter_a":"Meh, I'm glad he's trying something, anything to try and save one child. Better than 7 years of NRA owned congress not even acknowledging the Sandy Hook children. I'm a responsible gun owner that likes the idea of strong background checks and licensed gun dealers.","post_message":""},{"comment_id":"10154719986051130","commenter_b":"I'm a middle income American born and raised in America I paid Social Security and income taxes all my life I'm tired of supporting illegal immigrants and people freeloading from the US government on my nickel pretty soon the freeloading is going to stop","commenter_a":"Now I see a lot of ignorant uneducated and sick people talking about things that don't make any sense against the president when Donald Trump gets going you people that are on welfare illegally you people that get free handouts from the government illegally for you people the freeloading stops you're going to have to get a job and actually work for a living.","post_message":"WATCH LIVE: President Trump to speak in Melbourne. @webpagelink"},{"comment_id":"10154394005871337","commenter_b":"I love Salma Hayek's ass.","commenter_a":"i like the scene in wild wild west, where salma hayek shows her naked behind. nice butt.","post_message":"Will Smith is really, really sorry about Wild Wild West..."},{"comment_id":"10153695152617507","commenter_b":"No difference, Bullshit, it is the same as endorsing him, even worse, it is a cowardly way of endorsement.","commenter_a":"He didn't endorse Trump, he just doesn't care if they play his music, big difference","post_message":"Wait. What?"},{"comment_id":"10154362944566880","commenter_b":"Leonardo Gai","commenter_a":"Vasilis Sotiriou","post_message":"$39 billion and rising."},{"comment_id":"10153814761109705","commenter_b":"So are fat chicks!","commenter_a":"It's always amusing when it's celebrated to mock some, but when it's other's it's called \"shaming\" and it's frowned upon. Looking forward to your next article on fat chicks saying fat is cool and healthy!!","post_message":"Twitter is calling it #YallQaeda."}]
