[{"comment_id":"10153706067582490","commenter_b":"tell them to come get they're money!!!!","commenter_a":"please remember they hold 46% of our debt right now, sure dont to piss off the banker","post_message":"SENDING A MESSAGE: The Navy plans to send a warship to directly challenge China's recent aggression."},{"comment_id":"10158510929345206","commenter_b":"Then how do you explain her looking at the camera from a certain angle while wearing a head scarf? Only one woman can pull off that move.","commenter_a":"thats not even her.","post_message":""},{"comment_id":"10153550945636943","commenter_b":"No Syrian refugees....NONE!...call the Capitol...1-202-224-3121...follow instructions...Let them know you oppose Syrian refugees entering the U.S.. Took me 2 minutes...EASY!","commenter_a":"No","post_message":"Tom Fitton joins Fox News to discuss the danger Syrian refugees pose to the United States. Do you think Obama should allow thousands of Syrian refugees into our country?"},{"comment_id":"10154425900258366","commenter_b":"There is no wall","commenter_a":"Who f****** cares. Now it will be a party. They're gonna roast him like never before.","post_message":"BREAKING: President Trump has officially announced that he will not attend this year's White House Correspondents' Dinner."},{"comment_id":"10153416119358203","commenter_b":"WTF is wrong with these people? How could they do that to such an innocent life","commenter_a":"that's outright murder!","post_message":"‘This baby won’t stop breathing!’: Abortionist strangled baby born alive while nurses stood and watched"},{"comment_id":"10153107012089474","commenter_b":"By opening her mouth, we can generate all the revenue we need from the gas coming out of her.","commenter_a":"Hey, you nut job, take Sen, Boxer's lead and just retire.","post_message":"Right when Americans are finally feeling some relief at the pump, Nancy Pelosi wants to take it away with higher gas taxes!"},{"comment_id":"1234562866583168","commenter_b":"Hillary can sell pieces of our country, lie to investigators, channel campaign money, donations and contributions to her \"charity organization\" into her own personal slush fund, and she uses one technique to keep her out of the limelight for very long........she deflects whatever she does to whomever challenges her. Harry Reid is a complete idiot. Obama's constant comments of ridiculing Trump is the same technique. How dare that piece of trash accuse Trump of not being American!!! He is lawless, devious, lying, aids the enemies to be able to be in a position to kill us, takes money and feeds people who are illegal, criminals and he DARES to call Trump Un-American??!! He is seriously sick in the head...he THINKS he is the ideal American. Why do we still have a nut in the oval office? Shame on anyone who listens to this crap....and I can't wait to have both ...","commenter_a":"Just shut up, sounds like squeaky mice got caught, just go away quietly no one will miss you...","post_message":"HEAVEN HELP US  @webpagelink"}]
