[{"comment_id":"10154608248221350","commenter_b":"Wonder how many people asked when he was born...\"does he have hair\"?","commenter_a":"Baby cute","post_message":"WATCH: Look at this little guy mane! @webpagelink"},{"comment_id":"392182107608412","commenter_b":"He had a gun in front of him , h9w do you know his hands were uo you cant see shit . You fuckers are stupid to believe that its the cops fault or the military fault if not for either you fucking scumbags wouldnt have a place to trash , rob and i really can care less if you dont cosider me a fellow american if you believe that fuck was innocent your as bid of a piece of shit as he WAS dont even call yourself an american you fucking soft liberal scumbag go catch a bullet.and if you th8nk i cant handle a weapon then come up to ny and find out get the fuck out of my country and go fuck your allah in the ass","commenter_a":"Dont hate the cops, hate yourselves for breaking the law and being to stupid and lazy to get a job","post_message":"\"I ain't doing nothing. I'm not reaching for nothing, bro.\""},{"comment_id":"505113796343580","commenter_b":"They reproduce like rabbits, anytime a Muslim gives birth in an American hospital they should be sterilized.","commenter_a":"Screw the Muslims, they are all sheep in the cult of Islam.","post_message":"Watch what happens when Muslim Brotherhood extremists attack journalist in front of the NYPD!"},{"comment_id":"10153677657398132","commenter_b":"She to good for him it's time she finds a real man","commenter_a":"More like scott dick sack !","post_message":"\"They urge her to never take him back.\""},{"comment_id":"10155161723871037","commenter_b":"You are so gross ...","commenter_a":"States where mestizos who refuse to learn English because we made it possible to not have to learn English and tell them assimilation is bad, have horrendous scores.","post_message":"Number 1? Massachusetts."},{"comment_id":"10154736458587300","commenter_b":"Clinton's own faith says she should not be elected. For it is told in the bible, \" For the love of money is the root of all evil; which while some coveted after, they have erred from the faith, and pierced themselves through with many sorrows.\" ...and Jesus said to the Money Changers that his house was a house of prayers and they had made it into a den of thieves\" There is no Baptist, Catholic, or any other Christian that should be voting for Hillary Clinton. Next class...Murdering children in the womb!","commenter_a":"Geraldine Donze Berlingeri this is amazing mom!","post_message":"Protons destroy cancer cells while avoiding healthy tissue and minimizing side effects."},{"comment_id":"10153555053111037","commenter_b":"I bet you any money she can't breathe anymore","commenter_a":"When will people learn the cops will not lose!! I don't care what color u r, she said \" I'm gonna see u in court \"! She baited him. Why would cops kill her in jail? It's another cry baby black!","post_message":"Newly released dash cam footage shows the events that led to Sandra Bland’s arrest."}]
