[{"comment_id":"1047390088634796","commenter_b":"Jane I think you should try instead of History books the actual bill that was introduced in the Congress in 1983, the sponsors of the Bill, the Democratic almost unanimous vote, and the Democratic rationale behind their support. It's there to read if you get your head out of your ass","commenter_a":"Strange how if your a Democrat you tend to forget the horrors created by your party when foolishly you are in command. After President Carter destroyed our country we needed to reform the Social Security System so it would be solvent as is the case today with Obama doubling down on the atrocities created by Carter. When Reagan took office he acknowledged that the system was broken and pledged to fix it. At the time we had a Republican President, a Democratic Congress and a Republican Senate but we also had a different set of principles in our politicians as they were devoid of loons like yourselves and the likes of Cruz. The Democratic house took care of all federal employees, all Federal Judges, all State Workers, all women's rights, raised the AGE of retirees from 65 to 67, took care of themselves, their staff and whoever else they could ...","post_message":"Jeb Bush has a plan to save Social Security: Ensure hardly anyone can qualify for it. Is he trying to lose the election?"},{"comment_id":"864868203550521","commenter_b":"ROFLOL!!!","commenter_a":"I see a white guy in a gold shirt.","post_message":"Photo: 20-year-old Jeffrey Williams, suspect charged in shooting of two police officers in Ferguson, Mo. @webpagelink"},{"comment_id":"10154840580075695","commenter_b":"Go Hillary!!!!!! Vote blue!!!!!!","commenter_a":"#voteblue","post_message":"People fainting, 3-5 hour waits in line and it's only day 1 of voting. Local elections officials say today was the biggest turnout they have ever seen for early voting in an election. @webpagelink"},{"comment_id":"10153938458440695","commenter_b":"Go home Barbara. You're drunk.","commenter_a":"We're checking on the condition of the other child injured in the crash for the Channel 2 Action News Nightbeat at 11.","post_message":"HEARTBREAKING: Police say a 12-year-old critically injured in a crash on I-285 today has died. Please keep her family in your thoughts and hug your loved ones tight tonight. @webpagelink"},{"comment_id":"1410810932269586","commenter_b":"What a wanker.","commenter_a":"Demented old cray cray white man, losing touch with his cash cow. He's milking that cow because it's dying and he knows it. Will need to start a new job with no talent!","post_message":""},{"comment_id":"1291576474195436","commenter_b":"Gonna be great for tranny sex!","commenter_a":"Private stall restrooms make it no longer an issue for either side of the issue","post_message":"Target will invest in private stalls in response to protests from customers over its policy allowing transgender customers and employees to use the restroom that aligns with their gender identity.  Do you like Target's move toward inclusivity? Or were you opposed to its policy?"},{"comment_id":"10153000313242383","commenter_b":"you mean Haliburton? .. don't you think they got compensated enough?","commenter_a":"What about the contractors who did everything including making the ultimate sacrifice only to come home and be crapped on","post_message":"Interpreters who helped save Marines lives on the battlefield are fleeing to the U.S. with nothing  so one Marine is pushing to get them veterans benefits. @webpagelink"}]
