[{"comment_id":"10158064309830354","commenter_b":"She's so ugly!","commenter_a":"she looks like a dude to me. this not a real female.","post_message":"Poisoned coffee on the day of the debate???"},{"comment_id":"1135581816480053","commenter_b":"I was just going to say that! I don't even think Taylor Swift could pull off that jacket well. It's apropos for this witch though: an ugly jacket for an ugly person","commenter_a":"What's worse is it looks hideous. She could have found a nicer jacket at Kohls!","post_message":"Does something seem wrong with this picture!"},{"comment_id":"10154653842272639","commenter_b":"No they don't, they just have a problem with a stupid woman lying and telling everyone it's Alternative Facts..... You are a White Neo Nazi KellyAnne and that is what the problem is.....You don't have power, you have NOTHNG!!!!!","commenter_a":"No we have a problem with fact challenged people","post_message":"“It turns out that a lot of women just have a problem with women in power,\" Kellyanne Conway said about the historic Women's March on Washington."},{"comment_id":"10153551321648984","commenter_b":"A coal burning slut","commenter_a":"Kardashian is nothing more than a SLUT! Don't watch anything to do with her, PERIOD!","post_message":"Look out, Kim Kardashian. I don't think you realize who you're messing with...  Do you side with Megyn Kelly on this one?"},{"comment_id":"10152906075606336","commenter_b":"@webpagelink In case you wanted to read the rest of what Seth Rogen had to say, not just the original tweet that was blown WAY bigger than it needed to be.","commenter_a":"Well said craig","post_message":"Country music singer and military veteran Craig Morgan fired back at Seth Rogen for his American Sniper comments. @webpagelink"},{"comment_id":"1231022086976838","commenter_b":"Look at the size of that wood. Those are strong birds. Yet so very gentle with their chick.","commenter_a":"Menifee California","post_message":"BREAKFAST TIME! Looks like Momma Eagle is feeding her new hatchling. More info: @webpagelink Where are you watching from this morning?"},{"comment_id":"1687154254839815","commenter_b":"To spy over the Congress and international leaders is a serious matter and the Congress should really act immediately to resolve it !","commenter_a":"Try him for his CRIMES!!","post_message":"Obama used the NSA to SPY on members of Congress to ram through his unpopular and disastrous Iran nuclear deal.   What do you want your Congress to do in response?"}]
