[{"comment_id":"10154641793644614","commenter_b":"She's a freaking pig!","commenter_a":"Hope she rots in hell!","post_message":"The mother of Victoria Martens, the 10-year-old girl who police say was drugged, raped and killed, had allegedly used an online dating website to arrange for men to sexually assault her daughter in the past, according to a search warrant.   After her daughter was brutally killed, Martens told police that she watched her boyfriend, Fabian Gonzales, assault the little girl \"for sexual gratification,\" according to the criminal complaint.  (Warning: The below story contains graphic and disturbing content)"},{"comment_id":"10154969127953128","commenter_b":"@username just another feminist.","commenter_a":"when I go to a show I pay to be entertained , I don't pay to listen to the actors personal views or his GD views on politics.","post_message":"A central part of Donald Trump’s presidential campaign was his use of social media to weigh in on issues surrounding him – large and small – and he did it again on Saturday morning."},{"comment_id":"2169846419907186","commenter_b":"Don't listen to Nikki's Parra she needs to go back to school and take a history class or two cause slavery wasn't about a protest and it didn't end cause of one as well","commenter_a":"These people doesn't really know anything. They only wanna learn and hear what they want to hear and learn that is not against to them. Shame on you all! Get back to class and get a better future rather than this. Best revenge is to get educated!","post_message":"Students at East Los Angeles College and more than 100 colleges across the country walked out of classes and held rallies in protest of Donald Trump’s election as president. @webpagelink"},{"comment_id":"1090370634418986","commenter_b":"@username lol nah it's the bitchy women that make good men run from all women.","commenter_a":"The man is my younger brother and this girl is a psycho. She broke into his house, they WERE engaged but not living together, and she stole $2.1 MILLION worth of jewelry. And this stuff happened AFTER he paid off her house and bought her a business, (just a nail salon). My brother was married for over 20 years and his x will tell you just as I will that he is the most laid back and passive guy you'll ever meet. She sent the jewelry to her parents via UPS and now they're in just as much trouble. The stolen merchandise was never recovered","post_message":"This woman has said her ex-fiance hit her, causing a black eye and other injuries. But now his attorney says this home surveillance video tells a different story.  It's the latest round in a legal battle involving allegations of millions of dollars in stolen jewelry that's unfolding in a Bay Area courtroom: @webpagelink"},{"comment_id":"684673561687958","commenter_b":"Your right I will vote female when it's right and it won't be Chelsea Clinton either. MAYBE IVANKA TRUMP.","commenter_a":"I would have no objection voting for a QUALIFIED female for president. However, I will not vote for anyone of any gender, color, or nationality that is a liar, is a thief, etc to run our country further into the ground. This election is not the time to vote for a female president.","post_message":"\"For all you women out there who think that electing a female president will lift us all up, just ask yourselves if electing an African American president lifted up the blacks in this country.\" – Judge Jeanine Pirro @webpagelink"},{"comment_id":"968036809901222","commenter_b":"Take the criminals away first","commenter_a":"FAST & FURIOUS ???","post_message":"This is one of those times where a picture is worth a 1,000 words!"},{"comment_id":"1174759955897808","commenter_b":"And assholes will be assholes!","commenter_a":"They are F'n PIGS... We learned that in the sixties... How soon the ignorant forget. PIGS BE PIGS... NOTHING HAS CHANGED","post_message":"We FINALLY have the proof!"}]
