[{"comment_id":"706537696174664","commenter_b":"White trash! Take a bath!","commenter_a":"Omg. Thought we only had one clown in the white house then she showed up. Glad its only for a few days left thank god","post_message":"Happy 53rd birthday to First Lady Michelle Obama! Join us in wishing her well!"},{"comment_id":"946644428709749","commenter_b":"Wow seriously? Talking about reading too much into something. It is a cartoon meant for entertainment. Good grieft! You know where I got my sense of womanism from? My MOTHER! Yep, that is who shaped who I am.","commenter_a":"Missed the most important point fat, ambitious women are evil, unnaturally thin submissive and child-like women are good.","post_message":"Not only is this hilarious, but it is *so* on point. Kudos, ScreenJunkies.com."},{"comment_id":"1444053418948017","commenter_b":"That's why those guys never meet a MULAN their whole life. They could not handle a strong woman anyway.","commenter_a":"He's blaming Mulan for progressiveness and equal woman's rights. Someone thinks we belong in the kitchen barefoot and pregnant.","post_message":"Donald J. Trump running mate Mike Pence slammed the kid's film as the brainchild of a \"mischievous liberal at Disney\" bent on causing \"a quiet change in the next generation's attitude about women in combat.\""},{"comment_id":"434228700035058","commenter_b":"Why so illegal immigrants can collect our money??? I think u should have to prove that you' have worked for 20 yrs or more to collect","commenter_a":"Also give thanks to Bill Clinton who signed the bill making it legal to outsource jobs here.","post_message":"Jeb Bush wants people to work until this age. I'm sure this will raise some eyebrows."},{"comment_id":"825891407559633","commenter_b":"Nothing like putting more American lives at risk and putting us deeper in debt. Frickin buttholes.","commenter_a":"so is it a race to see who we can get attacked by first?!? He says war with mexico Bannon says war with china is inevitable This guy is challenging Iran--- BOOM!!!!!","post_message":"Even if this wasn't a direct threat, Iran will perceive it as one. --SarahB"},{"comment_id":"10153683223480575","commenter_b":"Leave my country!","commenter_a":"You got to be kidding.","post_message":"Pig books now banned.... They might offend Muslims."},{"comment_id":"10157445323790093","commenter_b":"Because they wanna control things...U know the hands on your mind effect","commenter_a":"REMEMBER THE REPUBLICANS WARN US ABOUT AFFORDABLE HEALTH PLAN.","post_message":"Thanks Obamacare."}]
