[{"comment_id":"10153339835009087","commenter_b":"Does this apply to Christian refugees too ?","commenter_a":"youtube title; William Blum - CIA murder and torture of Hundreds of thousands of people...use transgenders & lesbians deuteronomy 22:5 man should not wear the headdress of a woman & a woman should not wear the headdress of a man... youtube title; Collapse of Europe and the United States Of America ...vengence is mine say the living god psalms 104:16 of israel who's name is JEHOVAH deuteronomy 32:35 & romans 12:19-21..john hopkins mount sinai nyu medical bellvue hospital fraudulet med scam bill penis breath clinton irish shit god of luck death trap robert & patrick kennedy section 508 mental illness research nazi's... article title; The Clinton Crime Family...vengence is mine say's JEHOVAH the god of israel deuteronomy 32:35..bill penis breath clinton irish god of luck death trap section 508 disability... article title; Willie Lynch letter: The Making of a Slave...bill penis breath clinton great white satan irish god of luck ...","post_message":"“[Refugee children] are indistinguishable from any child in America,” President Barack Obama said. “The notion that we should somehow be fearful of them, that our politics would somehow leave them to turn our sights away from their plight, is not representative of the best of who we are.”"},{"comment_id":"10154467991806162","commenter_b":"Put down the pipe lady.","commenter_a":"And I am so tired of the argument that white America doesn't understand the history of slavery, or they are so \"ignorant\" about the contemporary machinations of racism. The claim of ignorance is part of the diabolical ruse but this mess is all cooly calculated and designed to preserve the racial hierarchy, which these days is often called \"racial disparities.\" Which I say is a bureaucratic term used to obscure the genocidal potential of white supremacy. How could a culture of people who have so meticulously sought to prove their superiority in all things, be so intellectually dense about how racism works? Slavery is well understood by white America because for the past 150 years it has ingeniously recreated it over and over again and called it by another name while playing dumb. FOH!","post_message":"The store owner, Abdullah Muflahi, released a video that he said he shot from a slightly different angle. He said Sterling was not holding a gun during the shooting but that he saw officers remove one from his pocket afterward. His video shows an officer reaching into Sterling's pocket to grab an object."},{"comment_id":"1072716372784891","commenter_b":"You want \"the happy, secure, tested and moderate side of life every day\" ? Happiness? Even Russia is above the US : en.wikipedia.org/wiki/World_Happiness_Report Tested ? Europe says hi. Moderate ? Bernie is centrist left here.","commenter_a":"I read something the other day from my pal and it's stuck with me all week. I'm paraphrasing here but in a nut shell... He said \"I don't like extremes. We have one guy saying he's \"going to make America great again\" and on the opposite end of extremes we have another fella shouting for \"revolution\"!! \" I'll take the happy, secure, tested and moderate side of life every day. #ImWithHer","post_message":"\"The most qualified candidate, and someone who is, by all reality-based measures, progressive.\""},{"comment_id":"10154062164657042","commenter_b":"Let's dip her legs","commenter_a":"Poor baby,, how can she be such a horrible person,, well prison will be her first hell, then when she die, her other REAL HELL IS WAITING FOR HER,, she have no place in heaven .","post_message":"A child has died after his stepmother dipped his legs into scalding hot water."},{"comment_id":"1095394503811232","commenter_b":"sounds racist to me. peggy pauley.","commenter_a":"I am so tired of people saying, we're going to take this country back, it's not been anywhere but here! Give it a break !!!!!!!!!!!","post_message":""},{"comment_id":"1167345089975985","commenter_b":"The real unemployment rate is 14% and the only people seeing their wages go up are professionals. So the middle class is not seeing any sort of economic relief.","commenter_a":"the new way the jobs report is calculated was a bi-partisan effort to lower the number of unemployed statistically (94 million americans are not participating in the job market) The GDP number is now a much better statistic about the economy. That number is LOW. way to low.","post_message":"Trump says the economy is in a deep hole. The latest jobs data suggests otherwise."},{"comment_id":"10154618646328812","commenter_b":"Europe will never be the same again thanks to refugees","commenter_a":"Ever notice how politicians insist on framing the narrative?","post_message":"French President François Hollande said today's attack and hostage situation at a church in Normandy was carried out by \"terrorists who claimed allegiance to ISIS.\""}]
