[{"comment_id":"10153222967261378","commenter_b":"Time for her to be shot in the face.","commenter_a":"Time for her to be released from her position.","post_message":"READY FOR MORE JAIL: Back at work and continuing to refuse same-sex marriage licenses, Kentucky clerk Kim Davis said she'll go back to jail again if that's what it comes to. Watch her tearful interview..."},{"comment_id":"10153764229426323","commenter_b":"It certainly is for most women. :)","commenter_a":"To be brutally honest, the female body starts to prepare for a possible pregnancy every month growing a miniscule placenta in the womb. If the conception doesn't happen the pre-placenta is rejected as menstruation blood and all.","post_message":"\"It's relief for a lot of us to finally see periods being talked about in a frank, forward-looking way.\""},{"comment_id":"10154075665287377","commenter_b":"Denounce your US Citizenship,,proclaim illegal alien status anf receive FREE Medical from the Government!!!!","commenter_a":"Can't repeal it fast enough for me! My own insurance costs went up 700 bucks once Obamacare kicked in. Seems I'm paying for some family that can't afford their own insurance. Well... I can't afford their insurance either!","post_message":"Sen. Rand Paul slammed the Affordable Care Act, also known as Obamacare, saying Congress will, \"as its first course of action, vote to repeal Obamacare. It cannot happen soon enough.\""},{"comment_id":"10154361925736336","commenter_b":"@username Post the video of your interview with Dr. Jasser!","commenter_a":"Thank you President Obama for speaking up on this issue. It's sad that this event had to happen during Ramadan. Something needs to be done about assault rifles now!","post_message":"“We know enough to say that this was an act of terror and an act of hate.”   Moments ago, President Barack Obama addressed the city of Orlando facing the tragedy of the deadliest shooting in modern U.S. history."},{"comment_id":"1762909607309407","commenter_b":"Hey Trump you going to build a wall for these people.","commenter_a":"Idiot","post_message":"During a Colorado rally on Sunday, Trump unfurled an upside-down rainbow flag with the words \"LGBTs for Trump\" written on it."},{"comment_id":"1357571687635909","commenter_b":"Kidult fan!","commenter_a":"That's what the fans should be saying to you","post_message":"Don't get us thrown out of Euro 2016"},{"comment_id":"10153230871447708","commenter_b":"It's a good talk but you shouldn't make promises u can't keep. But you still have my vote","commenter_a":"Until AFTER election.....Read my lips...All the same","post_message":"I will oppose and veto ANY and ALL efforts to increase taxes. Join me in standing up for American taxpayers.  Click here now!"}]
