[{"comment_id":"1016134698454262","commenter_b":"She'll just speak to someone else. Challenge her!","commenter_a":"I hate Hopkins as much or more than they do. But this behaviour is just babyish. If you want to defeat her, debate her with facts and the moral superiority of your argument. This is just forfeiting the chair to a racist moron.","post_message":"Brunel students just gave us all a masterclass in how to deal with Hopkins"},{"comment_id":"1147885218663043","commenter_b":"@username , no wall is going up! 😂","commenter_a":"His supporters don't care having an asshole for president , they just wanted a white man .","post_message":"Trump's supporters are not going to be happy about this."},{"comment_id":"1158653037490292","commenter_b":"HOW can he be such a hypocrite??? His companies ship jobs overseas, and he ships in illegals to work for cheap saying Americans won't do the jobs","commenter_a":"When his ties are made in China really dude???","post_message":"Donald J. Trump lamented Nabisco's decision to move jobs to Mexico, then pointed to Chris Christie: \"You're not eating Oreos anymore, are you?\" @webpagelink"},{"comment_id":"10156690146685231","commenter_b":"You beating her implies you didn't educated her about her role in society or her worth. Beating her is so drastic & dramatic. Talking & educating her would be much more powerful.","commenter_a":"If that girl were mine I'd slap her into next week but then again no child of mine would refer to herself as meat or be that cheap","post_message":"A high school boy asked a girl to prom with a sign that said, 'I prefer dark meat. Prom?'.... There's some things wrong here."},{"comment_id":"1731162717167272","commenter_b":"Rob Reiner is a slut! Liberal twit, rich and ignorant as a bowl of dung!","commenter_a":"The rich and stupid strike again...","post_message":"You mean racist like the race-baiters who back Hillary Clinton?   Kinda like that, Rob?"},{"comment_id":"395997370588557","commenter_b":"all these weman want is his money and 15 minutes of fame ,,,REALLY","commenter_a":"Had to tell her name because not getting any attention.","post_message":"Do you believe Jane Doe #2, Jennifer Thompson, considering she said she took the $700 Bill Cosby reportedly gave her after this act???"},{"comment_id":"1377436272296841","commenter_b":"Go girl.","commenter_a":"Iowa thanks you Hillary! God, what an embarrassment King is to our great state.","post_message":"Clinton isn’t letting this bigotry go unnoticed."}]
