[{"comment_id":"465593756969394","commenter_b":"I agree with you Hector. The point Mrs. Trump is making is that these spoiled American young adults have ZERO idea of what hard work is. They want to live the life they see on TV but don't understand that you need to work for it, hard. The jobs that these spoiled kids don't want will get filled by immigrants.","commenter_a":"It's easy to get angry about that statement. Seems inflammatory and unreasonable right? But consider this.....we have a generation of dummies who are demanding $15 an hour to flip burgers, wash cars, and other mindless entry level jobs. When these boneheads get what they ask for, and are replaced by technology, what's left? The mopping and sweeping jobs. They already think they're too good for those jobs now, so who do you think takes the jobs? The immigrants. Put the PC sensitivity away and face facts. The spoiled, entitled, millennial cry babies created this. Let them wallow in it. @username Robby Gould","post_message":"Donald J. Trump's ex-wife spoke out in support of the GOP candidate and the need for legal immigrants."},{"comment_id":"10156346841015725","commenter_b":"Build the wall","commenter_a":"America should close the borders. You do not lock the front door of your house because you hate the people outside. You lock it because you love the people inside. A country's border is its front door.","post_message":"From South Carolina last night- this is what I call a real supporter! #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"1006176036165841","commenter_b":"Just why is this bitch here ??","commenter_a":"You're right. I didn't see anything about this on the news networks.","post_message":"You will DEFINITELY not see THIS on CNN. Nor, will you hear BHO condemn her violent, F-bomb laden, BS. @webpagelink"},{"comment_id":"10152742608351491","commenter_b":"I am amazed at how many women are so poorly informed on the issue and then let the world know how little they know. Amin wage woman does not have access to a mike and thankfully Patricia did and took advantage of it.","commenter_a":"Says a women riding home in a limo! Political rant to get attention. She is a actress","post_message":"“It’s our time to have wage equality once and for all and equal rights for women in the United States of America.”"},{"comment_id":"10154310503686519","commenter_b":"I'm sure the travel site is a very bad site and many people are saying that the site is bad, disgusting and their reviews are a disaster. Trump won't subscribe to the site until they say he is great and then the site will be good. But it's very sad now. His hotel is the greatest hotel and anyone who doesn't think so is a looooser.","commenter_a":"Banktrump International Hotels, get over it!!","post_message":"You have to read their review of Trump's hotel for yourself."},{"comment_id":"1702389236690262","commenter_b":"#NRAWhore","commenter_a":"Screaming about process that eliminates the ability to make progress is criminal.","post_message":"The sit-in by House Democrats is nothing more than a publicity stunt. The bill they're talking about was already defeated in the United States Senate. It's time for them to #StopTheStunt."},{"comment_id":"1834190730158366","commenter_b":"You get out bitch!","commenter_a":"Thank god its her last ! Disgrace America one more Time. ThanX 4 Nothing. Wear w/e ya Want.... Just Get Out !!","post_message":"Gorgeous!"}]
