[{"comment_id":"932842660117117","commenter_b":"wait so confused why that chick pushed her lol","commenter_a":"Sydney Robles","post_message":"Meanwhile In New Jersey"},{"comment_id":"1681074165464529","commenter_b":"All the deplorables need to donate a brick for the wall with their name on it for the illegals to see who wants them gone....","commenter_a":"NO REFUGEES AND SEND THE ONES THAT ARE HERE BACK!!!!!","post_message":"Donald Trump LIVE! WATCH NOW     Best Conservative NEWS-----> Freedom Daily LIKE OUR PAGE!  Donald J. Trump Donald Trump For President #maga"},{"comment_id":"10154038010859205","commenter_b":"That's because it turns out she actually is a nasty woman. With a lot to hide.","commenter_a":"Robbie Mook is a terrible liar. Look at that body language!","post_message":"A blog called “True Pundit” said there were reports of Hillary Clinton asking why the government couldn’t just assassinate Julian Assange via drone strike. Hillary Clinton’s denial is less than convincing."},{"comment_id":"10153615401338010","commenter_b":"I live in a beautiful city in LA County. Our city sales tax is 10.25 per cent. I voted for this sales increase to pay for the improvements that put my city on the list of one of the best cities to live. Low crime, lush, great shopping, great roads, many services, about 15 parks, good schools and I live in a well kept condo complex where my HOA dues are over 300.00. The only blight I ever see are the smelly, stained mattresses and unwanted cheap furniture that slobs leave next to the more than amble sized trash areas. They dump in the middle of the night bec they're too cheap to pay to have them hauled away properly. My neighbors and I have concluded it is the renters here. They have no stake in keeping up the complex. The HOA pays for the removal weekly. The trash man ...","commenter_a":"Disgraceful.","post_message":"Do you have a discarded mattress on your block? How long has it been there? How many times have you reported it?"},{"comment_id":"10153230146462439","commenter_b":"Why do you say that?","commenter_a":"The use of the Neutron Bomb comes closer.....","post_message":"Iran is the world’s leading state sponsor of terrorism. Hizb’Allah is its client in Lebanon. Hussein Obama has apparently joined the axis of evil…and that will be his legacy. “Iran is placing guided warheads on Hezbollah rockets,'” by Yaakov Lappin, …"},{"comment_id":"10153605944168984","commenter_b":"No more abortions no more planparnthood","commenter_a":"My niece had a baby at four months completely formed , she is still so sad about it death , they held and took pictures. I don't know how this is not murder in the womb ? Cause a abortion is! !!","post_message":"Even with all evidence going against them, Planned Parenthood keeps on coming out with one unbelievable excuse after another.  Do you think it's time to defund and get rid of Planned Parenthood?"},{"comment_id":"10153089934495329","commenter_b":"Nasty ass hoe lol","commenter_a":"Dude this is so fucking ugly @username @username","post_message":"NSFW, obviously."}]
