[{"comment_id":"10152956831331130","commenter_b":"Wow... talk about a student taking the teachers to school.","commenter_a":"Her parents really wrote a good speech.","post_message":"Somebody give this little girl a medal!"},{"comment_id":"1700109030241371","commenter_b":"@username @username lol this lady","commenter_a":"@username I so see this being you in like 100 years","post_message":"This 105-year-old woman has the best reason for ignoring her doctor's advice about drinking soda."},{"comment_id":"777290672402535","commenter_b":"She is a whiny bitch","commenter_a":"Yes","post_message":"Megyn Kelly Stabs Fellow Fox News Stars In The Back, This Is Horrible   She should be ashamed of herself.  Do you think Megyn Kelly should be fired?"},{"comment_id":"10153904664428010","commenter_b":"Illegals deserve to be deported not unseat Americans for health care.","commenter_a":"Anyone who has ever worked in a hospital could have told you. So many before the ACA never would have qualified or been able to afford. Everybody in this nation deserves access to our health care system.","post_message":"California's version of Medicaid will test the power of the Affordable Care Act."},{"comment_id":"1267659423273512","commenter_b":"JUST SHOOT THIS BITCH==PLEASE.","commenter_a":"SOMETHING TO THINK ABOUT -- do you know that Hillary will be bringing into the USA thousand of Refugees and Illegals just within the first year. ISIS has told the US that they will be sending in ISIS men and Rascal Islamic's in with them. Do you want to keep your family safe from the Radical Islamic's and the Illegals along with the threat of Sharia Law . Also the threats that the BLM has made to all Americans and Hillary is behind them also. Then you need to put your family first and vote for TRUMP . Because if you vote for Hillary you might just as well kiss your ass and the USA goodbye. We need to take our Country back Hillary has already proven that she is trying to destroy us. Don't forget our men in Benghazi and all the Email scandal and the Clinton Foundation . ...","post_message":"It's even WORSE than you thought!! @webpagelink"},{"comment_id":"1073989012671274","commenter_b":"LOCK HER UP !!!!!! LOCK HER UP!!!!!!!!!! LOCK HER UP!!!!!!","commenter_a":"Yea to Iran and Syria to send there trash here while our jobs and wealth leaves while you trash the country to get rich???? Yea ok...#TRUMP2016","post_message":"\"Next week in Philadelphia, we will offer a very different vision for our country, one that is about building bridges, not walls.\"  In introducing her running mate U.S. Senator Tim Kaine, Hillary Clinton promised the DNC would look quite different than the RNC. bit.ly/2a3iybw"},{"comment_id":"10152914795481336","commenter_b":"Women, in particular, need to be observant, especially at night! Plus, they would be well-served to get their CCW and learn how to use their weapon---proficiently...!!!","commenter_a":"One of us would not have left there.","post_message":"Police in Texas are searching for a man seen on surveillance video forcing a woman into the trunk of her car at an ATM."}]
