[{"comment_id":"10152731683061234","commenter_b":"Hey Mary... Go suck some cock","commenter_a":"yes, we the teachers, fire fighters, and police tried to tell you all! He is a liar and a crook and a bully","post_message":"Gov. Christie is probably hoping his 2016 presidential aspirations don't hinge on New Jersey voters. That's because a new Rutgers-Eagleton poll shows most Garden State voters believe he's a poor fit for the Oval Office."},{"comment_id":"10152895696909342","commenter_b":"shoot her in the face..","commenter_a":"Smh","post_message":"Police: Woman tosses baby out of car window during traffic stop. abc13.com/@username/"},{"comment_id":"10154245909881130","commenter_b":"Oh, better step back, she threatened him with the janitor!!!!","commenter_a":"Suzane Al Ahmad","post_message":"Boy, bye. 😂"},{"comment_id":"692204600931973","commenter_b":"RIGHTTTTT","commenter_a":"@username WHAT THE","post_message":"This robot wants a family...and to destroy humans."},{"comment_id":"953451111362414","commenter_b":"Feminists are annoying","commenter_a":"I think there all cunts so I suppose I am humanist ha...","post_message":"Tonight, Ed Sheeran performed a song about his love life. Feminist Taylor Swift wants to know why no one called him sexist. #Grammys"},{"comment_id":"10153213932211051","commenter_b":"Dumb fucking bitch","commenter_a":"Tabby Witt This lion was in a protected park and was lured out by a dead animal carcus on a stic. Then shot by the dentist with a bow and arrow and after 2 days went by the dentist finally caught up with the lion and then shot him. If you can't see the problem here then you are part of the problem.","post_message":"The hits just keep coming for Cecil The Lion's pride."},{"comment_id":"10154331295400695","commenter_b":"Praying","commenter_a":"Lord I pray for these families. Unless you have lost a child no one can even imagine the heart break they feel right now. I ask you Father to walk along side of each one of the family members wrap your arms around them to let them know you are right there for them to lean on you or carry them thru this. They have now entered the choir of angels . God bless all","post_message":"#PrayforUGA: We just received these photos of Christina Semeria, Halle Scott, Kayla Canedo and Brittany Feldman, the four UGA students killed in last night's tragic crash. Our hearts go out to their families and friends. @webpagelink"}]
