[{"comment_id":"10153718263126028","commenter_b":"So they take a class to prove they're old enough to safely operate a vehicle that had the potential to kill themselves and other and its ok. But they also learn about the dangers of smoking and drinking at age 13 (give or take a year) in mandatory health class yet can't smoke or drink till 18(now 21) and 21? The logic is just weird.","commenter_a":"Why is it that we don't let people smoke till 18 and drink till 21(both of which mainly affect their own health) yet we trust teenagers as young as 15 and a half to drive a vehicle with the potential to kill others? Seems a little backwards doesn't it? Saving people from themselves but not saving them from others.","post_message":"The smoking age in California is now 21. @webpagelink"},{"comment_id":"10153723751980667","commenter_b":"I wonder how many people actually read Hillary's dumped emails on wiki leak. I'd strongly encourage people to do their homework before voting for her. Be prepared for some stomach turning, treasonous info. #scary #makeamericagreat","commenter_a":"ROFLMAO. I'm thinking that kindergarten name-calling is *not* an effective general election strategy.","post_message":"\"She should get an award from them as the founder of ISIS,\" Trump said Wednesday."},{"comment_id":"10153554179988984","commenter_b":"This twat is too dumb to breathe on her own","commenter_a":"Ignorant. I wonder what rock they found her under.","post_message":"I've heard a lot of crazy things from liberals, but this has to be right up there at the top of the list...  Has this woman's PC \"outrage\" gone too far?"},{"comment_id":"832521843510736","commenter_b":"All of them boobs!","commenter_a":"\"Mess NBC\" IS A JOKE! Less than 150,000 viewers. Now, compare this with FOX - with 2.7 Million each each NIGHT!","post_message":"Bouncing back?"},{"comment_id":"10156393794945725","commenter_b":"Bitch","commenter_a":"The law is broken as in Chicago for the murder of Laquan McDonald who was shot 16 times in god dam animals because was In Africa American","post_message":"This is a look at the scene on the streets of downtown Chicago right now. LIVE COVERAGE -----> @webpagelink"},{"comment_id":"1725539231054043","commenter_b":"Big wall!!","commenter_a":"I read the interview with Kirsten. It was great and it does reveal a side of Donald Trump that we don't see at rallies. Very nice!!! Trump 2016!!!","post_message":"A very interesting piece, by a very good writer, Kirsten Powers."},{"comment_id":"10153090058473984","commenter_b":"Fry her dam ass","commenter_a":"GOOD!!!","post_message":"She probably thought she had gotten away with it. Not so fast, Hillary...  Should she face criminal charges for this?"}]
