[{"comment_id":"10155770026010354","commenter_b":"She would England better than America.","commenter_a":"And I will remember not to vote for you!","post_message":"Facebook pool: how long until there's a hunting photo op to show how much Hillary understands sportsmen?"},{"comment_id":"1063081163723447","commenter_b":"Get em outta here!","commenter_a":"With all the hate in this country should the media be publicizing this to stir it up. Give those people a chance... They have had enough conflict.","post_message":"Eighty-two Syrian refugees have resettled in Ohio.   >>SEE what cities they have moved to: @webpagelink"},{"comment_id":"10154266616104714","commenter_b":"@username hey wanna help us build the wall when trump gets elected","commenter_a":"Good you can celebrate without my dollars goodbye target fn libtard fruitcakes","post_message":"\"Inclusivity is a core belief at Target\" said the retailer in a statement. \"It's something we celebrate.\""},{"comment_id":"10156410898495725","commenter_b":"@username he does not have to insult Hillary's looks. She does a good job of insulting herself.","commenter_a":"I would love to watch Donald Trump debate Hillary Clinton! He will tear her a new one!","post_message":"The last person Hillary Clinton wants to run against - is Trump! I will be her worst nightmare! #Trump2016"},{"comment_id":"10152869187276336","commenter_b":"Yes ... where ??...","commenter_a":"Islamic Cleric: \"Islam is Not a Religion of Peace!\" www,thetrumpet.me","post_message":"In Thursday’s Talking Points Memo, Bill O'Reilly asked: where is America's policy to fight the Islamic jihad?  Watch and weigh in: @webpagelink"},{"comment_id":"10154628102671800","commenter_b":"@username You're saying bullying didn't work in 3rd grade so it won't work now, but most of Trump's campaign IS based on bullying and it's gotten him pretty far. And Trump has had multiple scandals of his own, including email scandals. It's also a known fact that every politician in history has had some sort of scandal in the course of their career.","commenter_a":"And according to James comey if you do what Hillary Clinton did you would be reprimanded, probably fired and have your clearance pulled if not have criminal charges like in the military, but you can still run for president. Oh the hypocrisy. Say bad things, shouldn't be able to be president, compromise national security and the lives of Americans, no problem.","post_message":"Billy Bush was suspended indefinitely from NBC following the leaked Trump tapes.  ►Full video: @webpagelink"},{"comment_id":"10153641394251350","commenter_b":"I think she would be a skank in a princess gown.","commenter_a":"Hilarious ! She has guts. Good for her!","post_message":"What did you think of Miley Cyrus' first outfit of the night at the MTV Video Music Awards?"}]
