[{"comment_id":"10153871025190579","commenter_b":"How many more innocent people must die before we outlaw gun free zones?","commenter_a":"😩😫😨😱Smh... ..... How many more innocent people have to die before we regulate gun control? If we can save (((1)))) innocent person then that's 1 less family that have to suffer in pain because they loss their love one to violence. 😒😞😢 Numbers don't lie. It's time for gun regulations NOW!!!! 😒😞 I understand that there's no way you can get criminals to obey the laws, that's why they are \"criminals \" because they break the laws but we need to make it a little more difficult for them to get their hands on a gun like they did in Australia in 1996 after a mass shooting there .... Law abiding citizens still should have their rights to own a gun for protection hunting and recreation. @webpagelink","post_message":" politics has to change. President Obama answers two questions on guns at a press conference.  Watch the full video here: @webpagelink"},{"comment_id":"2053445024754213","commenter_b":"Just the opposite he carry a 3.95 GPA and has all he life. he Just married that MUSLIM pile of pig shit and was told by Obama you need to rebel.","commenter_a":"He probably doesn't know how to read or write.","post_message":""},{"comment_id":"631371687022892","commenter_b":"What a chump","commenter_a":"Doesn't it make you wonder what Trump is holding over these guys?? I'm so dang curious but it will be years before it seeps out.","post_message":"\"After months of careful consideration, of prayer and searching my own conscience, I have decided that on Election Day, I will vote for the Republican nominee, Donald J. Trump.\""},{"comment_id":"1044948272235591","commenter_b":"The RINOS & Dumocrats ALL SLEEP IN THE SAME BED. THEY are disgraceful group of piglets!","commenter_a":"Your a lier just like Obama you have so many people out here out of work and homeless what planet are you living on why don't you idiots venture outside the District of Columbia and visit the real Americans.","post_message":"Get in line, Americans. Paul Ryan knows best."},{"comment_id":"10155900570730354","commenter_b":"IRAN PUT OUT A MESSAGE TODAY SAYING \"DEATH TO AMERICANS\". THAT WAS TODAY FOLKS TODAY....OBAMA IS THE WORST MAN IN THE HISTORY OF THE WORLD. HE WILL HAVE PAY FOR WHAT HE IS DOING TO THIS COUNTRY. IT WONT BE TOMORROW BUT IT WILL HAPPEN. KARMA IS A BITCH.","commenter_a":"AND IS ANYBODY REALLY SURPRISED OR SHOCKED THAT OBAMA LIED? THAT'S WHAT HE DOES BEST.","post_message":"See the updated language comparison... this just keeps getting more PATHETIC:"},{"comment_id":"919423778080478","commenter_b":"You'd have a point (kinda) if it was a white girl. But shes black. So she has no argument. Neither do you.","commenter_a":"Wow I gotta admit I'm surprised at all the responses. As a dark skin man I understand that woman. If u an Artist and u preach something u should be about that something. Now as humans u love who u love but when u are a celebrity u open yourself to critisim good or bad.","post_message":"\"Dark Skin Activist\" Slams Kendrick Lamar Over Light-Skinned Fianceé: “I Will Never Support Him”"},{"comment_id":"687214161469162","commenter_b":"Working class Americans can't & choose not to have more children then they can afford. Immigrants, illegals have as many as they want & working class pay for everyone of them, sick. Disgusting. Send anyone one assistance to the employment center. Get a job or get out. No more free ride.","commenter_a":"Yes, for sure","post_message":"This Muslim father of 11 has been receiving insane amounts of welfare for the past 10 years. He say’s the government is basically raising his children for him. Should this lazy father be cut off from all welfare?"}]
