[{"comment_id":"1046312712073631","commenter_b":"Back in the,day, I was called a baby killer. My response to the pussy was that I was ALSO A MOTHER FKR, SO KEEP YOUR MOMMA OFF THE STREET.","commenter_a":"All those who believe in abortion so passionately, please line up on the left for your very own personal post partum abortion. Lead by example........ :-)","post_message":"Does this about sum it up?"},{"comment_id":"1559763640995949","commenter_b":"What the hell is wrong with this women? What the hell was she thinking? She is going to jail. What a slime bag.","commenter_a":"Good! She should!","post_message":"Dani Mathers could now face criminal charges"},{"comment_id":"1514959711853944","commenter_b":"This reminded me of The Series of Unfortunate Events .... But this way wayyy cuter","commenter_a":"Alicia Thomas","post_message":"This is so cute!"},{"comment_id":"10156744379040093","commenter_b":"@username Have you SEEN Trump on the debate stage? He doesn't know policy, he doesn't think ahead, and he stumbles when it comes to content. Add to that the media penchant for tailoring questions to compliment the dem candidate, and <bam> Hillary looks like a freaking scholar on the stage. The thought makes me physically ill. On top of that, Trump has considerable damning words and actions the media and dems (but I repeat myself) will toss like confetti upon constituents. In multiple polls, Trump sits in the mid-30s, without waver. This is going to suck.","commenter_a":"Do the right thing and vote for Cruz. I write such because the thought of Trump facing Hillary in debate makes me cringe. Kasich, the newest favorite of the GOP, cannot win. I love my home state, but Ohio doesn't save Kasich from toppling.","post_message":"Not budging."},{"comment_id":"10154439835324203","commenter_b":"It takes brain power to watch a documentary? Lol","commenter_a":"not many of Trump's supporters read these guys, nor watch PBS documentaries, too much brainpower needed.","post_message":"David McCullough, Robert A. Caro, Ken Burns (PBS), and more have stepped up."},{"comment_id":"688195661362262","commenter_b":"You are awesome president Obama! !!! Thank you for all you've done","commenter_a":"This guy is a crook 2","post_message":"LIVE - President Obama on the Election Night win of President-elect Donald Trump."},{"comment_id":"10154026224212869","commenter_b":"I agree! There are plenty of legitimate issues that should convince anyone paying attention that Clinton does not belong in the White House. I feel like spinning 100 different (and in many cases overwhelmingly mean spirited) conspiracy theories makes the relevant confirmed issues on either side carry a lot less weight. I'm not saying that I don't think her health may be an issue, or even that it shouldn't even be written about, but there are 100 different reasons for a vehicle like that to include a wheelchair lift.","commenter_a":"Is anyone else tired of these feeding frenzies, I for one am.","post_message":""}]
