[{"comment_id":"10153656346543352","commenter_b":"I could careless about all that bullshit it's a proven fact your ugly ass hell & I damn sure look better than you on my bad day, you look old & wash up do your hair & get some better make up stop acting like your a model , you don't have ninjas checking for you mines face looks. Better than yours hoe","commenter_a":"Remove this dumb bitches ovaries make sure she doesn't get the chance to even enjoy a child if she ever wanted one after you take her shit out throw her away in jail","post_message":"Woman Hit With Murder Charges For Aborting Her Own 5-Month-Old Fetus In Her Car With Illegal Abortion Pill, Causing Baby To Die 30 Minutes After Abortion"},{"comment_id":"578880512291528","commenter_b":"I have a daughter and if she decided to not wear a bra, and wore clothing appropriate for that. Obviously not some plunging v neck cut out, crop top but a shirt sure. Bras are a cause for back pain and unless it's comfortable for the woman to wear it she shouldn't have to. If you insist we wear bras, I insist that your man boobs must also be held with a wire bra. You're pecks offend me!","commenter_a":"If I had a daughter ain't no way she going to school with no bra on. So I think the parents are to blame also. What are they teaching her letting her go to school like that??....that's tacky and careless parenting in my opinion..","post_message":"These high school students brilliantly stood up against sexist dress codes."},{"comment_id":"10153536791141717","commenter_b":"Stupid, dumb BITCH!","commenter_a":"I guess she never met Alexander the Great.. lol","post_message":"A gay man could never be a \"warrior.\""},{"comment_id":"10154593126179614","commenter_b":"Kassandra Alvarez","commenter_a":"Women beater no mercy for him","post_message":"Update: Chris Brown has been transported to downtown Los Angeles where he is expected to be arrested on suspicion of assault with a deadly weapon.   The singer initially refused to come outside and was not allowing police into his home, an LAPD official said."},{"comment_id":"1705584226349949","commenter_b":"IF HITLER TRUMP GETS IN WE THE LITTLE PEOPLE CAN KISS OUR ASSSSSSSETS GOOD BY CAUSE HE WILL BE FOR THE RICH AND MAILNLY HIMSELF WAKE UP AMERICA BEFORE WE HAVE ANOTHER MAD MAN IN CHARGE","commenter_a":"What an Idiot..mathsssssssss you cant","post_message":""},{"comment_id":"876368152479964","commenter_b":"She is ugly.","commenter_a":"wow","post_message":"OUCH!!!!! This is a MUST WATCH! This video of a serious Michelle Obama takedown is going viral fast.  'LIKE' if you think Michelle gets exactly what she deserves. @webpagelink"},{"comment_id":"1681195205453281","commenter_b":"Barbara just needs to go away!","commenter_a":"Her opinion doesn't matter!","post_message":"Barbra Streisand blasted “narcissist” Donald Trump in a 1,228-word Huffington Post op-ed."}]
