[{"comment_id":"10153058619121051","commenter_b":"She should go to prison for years and starved on a day bases! She is disgusting!!","commenter_a":"Poor little baby","post_message":"Even the police were stunned that someone would treat a dog like this for no reason."},{"comment_id":"10154056014236336","commenter_b":"I've heard liberals say that the Constitution is a living,breathing thing so many times! This is because they want to change America's FIRM laws to fit their Anti American agenda! Obama and the Anti American socialist judges do not have the right to make law! Thats how Obama's illegal Obama care was approved! I fear that our once free country is in grave jeopardy of being overrun by these evil Marxist! I think it will get so bad that people will be forced into defending their family s, themselves,their neighbors, their freedom,the Constitution and their Country in what ever means necessary! My God protect us!","commenter_a":"Guns and ammo.... Buy them now while you still can. God Bless America (what's left of her)","post_message":"U.S. Supreme Court Justice Antonin Scalia defended interpreting the Constitution as it was originally written and intended.  Scalia passed today after serving on the nation's highest court for 30 years. fxn.ws/1obcGnN"},{"comment_id":"10154243663794160","commenter_b":"I bet he's caring a lot more women. As a woman, couldn't vote for Clinton. As a woman, she's an embarrassment to women.","commenter_a":"I pray, I pray, I pray","post_message":"Donald J. Trump is losing female voters."},{"comment_id":"10152603189787894","commenter_b":"She's Just NASTY & wants White people to think it's a Race thing","commenter_a":"Nasty bitch","post_message":"Say What Now? Naya Rivera Insists White People Shower More Than 'Ethnics' on 'The View' [Video]"},{"comment_id":"658477470966222","commenter_b":"I'm sorry this woman is no good for this country I'm sure there is the woman that be a Great president for this country but she is not the one she is evil and corruptive I see a whole lot of old women who think I got 1 foot in the grave I should vote for a womanwrong","commenter_a":"It still look's like a trash bag on her.","post_message":"Hillary Perón"},{"comment_id":"10154691937306509","commenter_b":"She's a big crock!","commenter_a":"Great job @username....this debate is @username attacking Bernie Sanders....your agenda is so obvious....I'm not sure why I bother to watch this.","post_message":"\"Talk about the kinds of problems he had answering questions about even his core issue: breaking up the banks...\"  Hillary Clinton criticizes Bernie Sanders' answers to questions from The New York Daily News.   Live updates from the #DemDebate: @webpagelink"},{"comment_id":"10153400875176833","commenter_b":"my Vote WILL NOT BE FOR HER!!! I want to Keep the Constitution. We she get in the white house you can kiss this Country and are Constitution good bye..","commenter_a":"Where's sirhan sirhan when you need him ?","post_message":"Never mind all the rhetoric about how Hillary Clinton can get the Democrat Party presidential nomination because some fringe elements don think she radical enough. The Hill reports that  for gun control [an increasingly fringe group in their own right] have high hopes for Hillary Clinton presidential run, seeing her as  ally who can finish the push for tightened background checks that has stalled in President Barack Obama second term.  Indeed, Clinton has been a vocal gun control supporter for more than 20 years."}]
