[{"comment_id":"1038851362838059","commenter_b":"Merry Christmas from your Muslim neighbors! Fighting for #AmericanUnity Like us on FB #AMOT American Muslims in Opposition of Terror","commenter_a":"Merry Christmas, Hillary & to your family!","post_message":"Can't think of a better day than one with family, food, and the best gift of all: a new grandchild on the way! Merry Christmas. -H"},{"comment_id":"10153139193807377","commenter_b":"It's very hard to forget that he was voted in not only by the majority but by illegal aliens and dead people. Yes that's true, and just because he was voted in doesn't mean that there are more people who want him out of office. He is not a leader, he doesn't know foreign policies . Isis is his fault! He removed all our military from Afghanistan and the other countries. Had we stayed they would not be where they are today! Hellery Will follow obuma in his running this country, and if You think he is Bad you Haven't seen anything yet. Her lies and deceit hopefully will Take her out for Good. Do you know that more than likely he will Go down in history as one of the worse presidents in our country so you might rethink that statement.","commenter_a":"Why can't you impeach him? If the majority agrees that he needs to be impeached, so what are you waiting for?","post_message":"The top Republican lawmaker joined half of US state governors in urging President Barack Obama to suspend the scheme. Do you support Speaker Ryan's efforts on this? Vote Here: @webpagelink"},{"comment_id":"10153919396826509","commenter_b":"White people have killed 300 million people","commenter_a":"Agree...Tony..history...no human life should died..in wars...but happens.","post_message":"The world still struggles to fully understand the events on August 6, 1945. Hiroshima survivors and artifacts link us to the past: @webpagelink"},{"comment_id":"10153107776462377","commenter_b":"Trump 2016","commenter_a":"The American people.","post_message":"Newsmax is conducting an urgent online poll asking Americans who won the 3rd GOP Debate hosted by CNBC. Was it Trump, Carson, Rubio or another candidate? Vote here now: @webpagelink"},{"comment_id":"10153190295751336","commenter_b":"Nothing better than a HOT conservative woman.","commenter_a":"Looks like the Catatonic Parkway. No cowboys in that area, maybe a few cowgirls, but they ride English.","post_message":"Fifteen buffalo who escaped an upstate New York farm have been shot and killed."},{"comment_id":"1008491449210603","commenter_b":"@username You are scum simple as that!","commenter_a":"she was a drug taking piece of trash...","post_message":"Bobby Brown: 'Bobbi Kristina Brown was and is an angel'"},{"comment_id":"10152715468475736","commenter_b":"Well, it would also be illegal to shoot undocumented immigrants.","commenter_a":"SHOOT ON SIGHT.","post_message":"The sea lions are making their way into town now! (Well one of them is.)"}]
