[{"comment_id":"10153464006023132","commenter_b":"IAN!!!!! Noooooo!!! We had plans to run away! Well, I did anyway! Oh well, Nikki rocks so that's cool!!!","commenter_a":"@username @username I am so sorry to hear of your loss!!! ;-)","post_message":"Nikki Reed and Ian Somerhalder aren't the only ones."},{"comment_id":"891950114161178","commenter_b":"That's her claim to fame, now and forever! Smh!","commenter_a":"Uh...that's a lie because I had never heard of her prior to the tape shenanigans! !!","post_message":"Kim Kardashian Says Her Biggest Regret Is Sex Tape With Ray J, But Shuts Down Claims That It Made Her Famous @webpagelink"},{"comment_id":"546896738832150","commenter_b":"Don't worry just go vote under a dead guys name or pick up a few illegals and get them to vote too. What democrats do all the time .","commenter_a":"I accidentally vote for Cain, so the four percent is a little high.","post_message":"POLL: Who won the VP debate?"},{"comment_id":"1571786566441790","commenter_b":"What good will it do, congress passes these laws.","commenter_a":"These people make me sick.","post_message":"These welfare abusers need to be taught a lesson.  Way to go Judge Judy!"},{"comment_id":"1477131165645723","commenter_b":"She is a phony douche like her old man.","commenter_a":"Lying runs in the family!!!!","post_message":"Of course it is..."},{"comment_id":"10152715652847293","commenter_b":"Way to bury your head in the sand. Typical liberal","commenter_a":"we have chosen not to see the film because we don't support war/killing...either way, the good thing is it got people thinking/talking...or, at least, trying to talk/think...","post_message":"Regardless of what Bradley Cooper wants, his movie American Sniper has become political."},{"comment_id":"1154229454616510","commenter_b":"Our family women don't fit in that poll.","commenter_a":"Someone is getting the wrong polls . I will only vote Trump . #He gets us","post_message":"2/3 of Women Hold UNFAVORABLE Opinion of TRUMP.  One of his senior advisors says not to worry...  details: @webpagelink"}]
