[{"comment_id":"10154085235841717","commenter_b":"I believe two females can already, though not commercially available and always produces girls","commenter_a":"Perhaps a little off topic, but I wonder how long it will be- or indeed if it's possible now- for a same-sex couple to have a natural child using a similar method. I imagine it would be complicated, but not impossible for, say, two men to have a biological child using a \"blank\" egg cell.","post_message":"To help women with mitochondria problems from passing them down to their children, scientists remove the nucleus DNA from the egg of a prospective mother and insert it into a donor egg from which the donor DNA has been removed."},{"comment_id":"1720867398159945","commenter_b":"She's a basket case.","commenter_a":"@username he absolutely rekt her","post_message":"Sparks just flew at the Democratic debate. Bernie to Hillary Clinton: \"Excuse me, I'm talking.\"  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154553793429712","commenter_b":"They work harder, are ambitious, and always have the American Dream end goal in mind to own a business. If there are all these loop holes and advantages that a non-native English speaking LEGAL immigrant can utilize, how the hell can a English speaking American familiar with the system not be able to take advantage? The answer is some do and the others complain. Want a hint? Take a job in a profession like trade work, food, cleaning, retail, etc work there for years to establish yourself financially and become experienced. Take a calculated risk in opening up your business with all your set up in mind, keep working your butt off and you've done it. People say ohhh ILLEGAL not legal immigrants, as if a lot of Trump don't already see anyone darker than Macklemore as an illegal immigrant, terrorist, or possible threat.","commenter_a":"Lazy entitled Trump voters think it's unfair how immigrants do better than them by working smarter and harder and willing to be entrepreneurs.","post_message":"In Baltimore, foreign-born residents make up 9 percent of the city's population but own nearly 21 percent of the city's businesses, according to a 2012 report from the Fiscal Policy Institute."},{"comment_id":"569607529880232","commenter_b":"Karma is a bitch!","commenter_a":"Reap the whirlwind...","post_message":"The students he ripped off are about to get their revenge."},{"comment_id":"1756313234607564","commenter_b":"Hillary the Corrupt Witch Bitch !","commenter_a":"#NeverHillary!","post_message":"***UNPRECEDENTED CORRUPTION***"},{"comment_id":"1777981479109906","commenter_b":"Karma will catch this hag","commenter_a":"Vote her out !!!!!","post_message":"This Florida prosecutor tried 77 kids as adults in a year  65 of them were black.  #MicBrights"},{"comment_id":"1250171008375949","commenter_b":"NO She is a BAD EGG!!","commenter_a":"No I detest liars. I don't know how she gets away with all the junk that she's done.","post_message":"Hillary Clinton was voted the most admired woman in America in a Gallup poll. Do you admire her?"}]
