[{"comment_id":"10153628855141336","commenter_b":"What is wrong with this girl?","commenter_a":"Her poor parents. Bet they wish they could raise her all over again.","post_message":"What did you think of Miley Cyrus' barely-there ensemble?"},{"comment_id":"762861520482540","commenter_b":"Your lady isnt going to win lol thats a joke","commenter_a":"Hmmm but notice how all places she wins have issues with the polls.. Shes a cheat and a fraud whos bought out..","post_message":"Bernie Sanders went just one for five on Tuesday, bagging only Rhode Island."},{"comment_id":"1703915029828450","commenter_b":"Mitt you looking for your10 mintues of fame????.... you lost get over it.....How can you allohw a Party to say mine and millions of people vo te don't count.....????..we don't like Rubio.and by the way llook hard in Flordia about his pass!!! we don't like Ted Cruz.. which i think thie Chistian voter shows that... Donald Trump for President 2016 has grown your Party... I am 60yrs old i have been a Dem all my adult life.. this year,, i changed to Rep Party....to vote for Donald Trump for President 2016... and now it doesn't matter?? because the GOP says so.... pure Goverment !!! trying to hold on to there ways the hell wi th the people e.... ok i you keep your crap up.. just won't vote.....and we can have another 4 years of Obama... and i am sure i am not a lone on this....th an you have ...","commenter_a":"And I put a hundred hours and a lot of cash working for Romney. A RINO at heart and a man that can't close the deal.","post_message":"Donald J. Trump responded to Mitt Romney, calling him \"one of the dumbest and worst candidates in the history of Republican politics.\""},{"comment_id":"1349219015129494","commenter_b":"Stfu","commenter_a":"Trumpers 2 days ago: yay Castro is dead! yuge win for free speech and human rights! CheetoJesus: citizens whom use their rights of free speech and ability to protest should be jailed or deported! Trumpers today: praise our Dear Leader! deport those commies!","post_message":"A fiery debate erupted over President-elect Donald J. Trump's proposed penalty for burning the American flag"},{"comment_id":"10153905516506178","commenter_b":"I always say Merry Christmas at that is just the way it is.","commenter_a":"Fitting that a NUTCRACKER be in the back ground. :-)","post_message":""},{"comment_id":"10156385367815354","commenter_b":"Stop the influx NOW!!! It's sheer INSANITY!!!","commenter_a":"how do we stop Obama from doing this?","post_message":"“President Obama and Hillary Clinton’s idea that we should bring tens of thousands of Syrian Muslim refugees to America is nothing less than lunacy...I recognize that Barack Obama does not wish to defend this country, that he may have been tired of war, but our enemies are not tired of killing us, and they’re getting stronger....\""},{"comment_id":"10153377279001756","commenter_b":"It's not just women. I had to go to the ER with a legit panic attack and they accused me of being on cocaine.","commenter_a":"A medical professional assuming that a woman is having a panic attack instead of a real problem? Shocking!","post_message":"Often, doctors reinforced women's fears of pulling a false alarm, automatically assuming that those with heart attack symptoms were suffering from indigestion, or maybe a panic attack."}]
