[{"comment_id":"487115881470292","commenter_b":"What a perverted, sick and depraved asshole!!","commenter_a":"Fucktard","post_message":"God will put rainbows and sunshine over the house of every straight, white, christian cis man!"},{"comment_id":"10155007053899641","commenter_b":"Wow people","commenter_a":"Good for them. Sad dt did this to them.","post_message":"Mexico is ready to hit the US where it hurts: Corn."},{"comment_id":"10152922830971491","commenter_b":"@username, you killed my sides.","commenter_a":"So many hateful comments. Why?!","post_message":"“God chose us to take care of these babies.”"},{"comment_id":"10153830280558145","commenter_b":"We should ban you Elena","commenter_a":"Sad but another gun happy state like this one dumb hicks and beers","post_message":"A popular reporter and her son were fatally stabbed by another son, who then fatally stabbed himself, police say."},{"comment_id":"10153974696736943","commenter_b":"Double talk.!","commenter_a":"This is how you stand for law in government?","post_message":"Wednesday, June 01, 2016 Judicial Watch Director of Research and Investigations Chris Farrell appeared on\"America's Newsroom\" on Fox News Channel to discuss the latest developments in the depositions of Former Secretary of State Hillary Clinton inner circle regarding her use of private email while serving at the State Department."},{"comment_id":"10153690719066130","commenter_b":"Andrew Ritchie","commenter_a":"Woof, there are some dumbass people on this feed. The benefits outweigh the risks.","post_message":"This vaccine is drastically reducing HPV cases in teenage girls, but some parents can't get over the stigma."},{"comment_id":"10155222561152316","commenter_b":"Can you prove she rigged the election?","commenter_a":"Killary is our threat not TRUMP. Why wasn't she arrested for rigging the election? Yall are not covering her criminal acts, are you ?","post_message":"Republican presidential nominee Donald Trump is asserting that countries like France that he says are compromised by terrorism may be subjected to the \"extreme vetting\" he proposes as a deterrent to attacks in the U.S."}]
