[{"comment_id":"10154341988949203","commenter_b":"Hillary can gfh, I'm writing Bernie in!","commenter_a":"If you are for Clinton then you are for more jobs moving abroad. NAFTA, TPP, etc. It might be your job or your town next that is affected.","post_message":"Hillary Clinton has long pushed to regulate access to guns."},{"comment_id":"1046361932108447","commenter_b":"Wow, stupid bitch","commenter_a":"Kiss off Obama you are worthless !!! Go Donald Trump For President !!! Would be Great if Obama was for us Americans like he is for all the out siders !!!","post_message":"President Obama is urging the Senate to pass a bill to help Puerto Rico with their recession and debt crisis. What do you think about this?"},{"comment_id":"10154886159283010","commenter_b":"Hippie bitch is a nobody","commenter_a":"The left is still jockeying for attention...and this is the best they've got..Less than impressive..","post_message":"A political twist on a holiday classic."},{"comment_id":"981969021843756","commenter_b":"Republicans want to end abortions so that they will have more population to draw on for their future wars. Think about it: End abortions, brings on many children that the parents can't care for (likely because of finances). The child likely grows up in poverty, being told (by the same people that ended abortions) he/she is a leech on society (parents likely getting assistance), so that child will grow up and most likely do one of two things (a few will take a different path, of course). 1) begin a criminal career 2) join the military to be fodder Republicans want to abort YOUR children when they are adults....THAT is why they want to end the termination of unwanted pregnancies.","commenter_a":"Attack on women!!!!! All you saying baby killers start adopting them then...start helping poor young women survive during pregnancy and after child is born, start fighting for wic, head start, etc...how many severely disabled children have you adopted? Big mouths refuse to help real babies only care for fetus","post_message":"Every child is a gift from God.  That's why the House just passed some of the most pro-life legislation to ever come before Congress – banning abortions after 20 weeks."},{"comment_id":"1279396932093344","commenter_b":"This is why I hate narcan","commenter_a":"Horrible heroin.","post_message":"\"This child can't speak for himself but we are hopeful his story can convince another user to think twice about injecting this poison while having a child in their custody.\""},{"comment_id":"10154455305884087","commenter_b":"Mike I'm with you exept the pre_existing what are people to do just die after the doctors and hospitals have done taking everything that is just morally wrong","commenter_a":"These people are so ignorant and out of touch it is ridiculous, that is one of the issues that got Trump elected. Repeal and replace, I am for a free market insurance health care. We do need to make sure that pre-existing conditions are covered, and letting parents insure their children until 26 is a good idea. If they need medical attention they are insured, and the taxpayer will not have to foot the bill.","post_message":"47 percent of Americans oppose repealing ObamaCare, while only 20 percent want it repealed immediately."},{"comment_id":"10153660533997235","commenter_b":"She'll be fired for feminist ideology being expressed at FOX on air.","commenter_a":"Why is that \"news\"?","post_message":"In a rare lucid moment, Fox News' Andrea Tantaros NAILS IT."}]
