[{"comment_id":"10153231679439071","commenter_b":"But they're so nasty lol","commenter_a":"Hnsh Ltif ewwwww","post_message":"A company has created a replacement for water bottles that you can actually eat."},{"comment_id":"10155084835104203","commenter_b":"Has she tried cbd oil?","commenter_a":"My mom who has stage 4 cancer... Tried juicing for almost a year, cutting out eating \"real\" food almost all together... Ended up doing more damage to her gut than good. Bodies are made to eat food and not meant to get over loaded with vitamins and nuetrints from juicing 40 carrots. I think in small doses it can be beneficial but not as a replacement","post_message":"Even in Trump's America, juicing is still awful."},{"comment_id":"10153324881199312","commenter_b":"1 in 100,000 people infected with measles died before the measles vaccine, meaning even if EVERYONE caught measles in the USA today only 3,000 would die, BUT thats if EVERYONE in America caught it, not millions, and because we take care of ourselves and wash our hands and eat slightly healthier that would not be the amount today anyhow, measles does not mean instant death, and if one more person tries to spread \"herd immunity\" crap I'm gonna lose it, it's not real! We do NOT have herd immunity!","commenter_a":"What concern. Everybody got measles when I was a kid.","post_message":"More than 1,000 students are exempted from measles vaccine in St. Louis area schools. Tonight at 10, 5 On Your Side investigates the concern, the controversy and how quickly an outbreak could occur."},{"comment_id":"610480015827201","commenter_b":"I'm a New Yorker and I don't like this weather lol","commenter_a":"If you're a New Yorker you should be used to this weather","post_message":"A winter weather advisory is in effect tonight from 6pm to 6am. Meteorologist Jeff Smith talks forecasting and answers your questions."},{"comment_id":"593592797513564","commenter_b":"Absolutely. Bitches get treated!","commenter_a":"@username 😂","post_message":"Watch out"},{"comment_id":"10153649045287994","commenter_b":"People are so dumb... That's all...","commenter_a":"Is a phone really worth your life","post_message":"A man was killed at Cedar Point when he entered a restricted area to look for his cell phone."},{"comment_id":"892853017418706","commenter_b":"This my friends is a true leader","commenter_a":"We'll never see Obama supporting our wounded Vets like Bush. Bush was a true patriot","post_message":"George W. Bush said the ride will highlight the \"bravery\" of America's veterans:  \"It’s a ride to herald people who were dealt a severe blow and said, ‘I’m not going to let it tear me down.’”"}]
