[{"comment_id":"590455354461864","commenter_b":"FEELTHEBERN AMERICA ! With occupy we had no leader ! Now with the peoples political REVOLUTION we have Bernie Sanders ! Look out corporations were coming to take our government back , your trickle-down has trickled out !","commenter_a":"He one ONE more delegate in MI and LOST by 20 in MS! That is not a win!","post_message":"WOW!"},{"comment_id":"925335920856271","commenter_b":"What has she done is any of her \"jobs\" ??","commenter_a":"let's see.... do nothing, do nothing. who cares.. liar, philanderer, cheat.....","post_message":"Some familiar faces on Roosevelt Island."},{"comment_id":"1756628007939155","commenter_b":"Stop and think!....before you vote for Hillary just to have a female as President...You are hanging yourself for women making it again in the future. Stop and think!","commenter_a":"DUNP THE TRUMP & GUILIANI!","post_message":"MAYOR RUDY GIULIANI STATEMENT ON LATEST CLINTON FOUNDATION DONOR SCANDAL:                           (New York, NY) – Former New York City Mayor and U.S. Attorney Rudy Giuliani today released the following statement on the Associated Press’ analysis revealing that 55 percent of Hillary Clinton’s non-government meetings while at the State Department were Clinton Foundation donors whose contributions totaled at least $156 million:   “From the facts revealed to-date, it is impossible to figure out where the Clinton Foundation ends and the State Department begins. It is now abundantly clear that the Clintons set up a business to profit from public office. They sold access and specific actions by and to them for money. This makes a mockery of her promise to Congress and the President to keep the Clinton Foundation and the Clinton State Department entirely separate. In other words, they merged the two into the Clinton Family racketeering enterprise. The need for a Special Prosecutor to investigate these apparent crimes mounts with every passing day and the revelation of new sets of e-mails and phone logs. I’m sure all we’ve seen is the tip of the iceberg and there will be more to follow.” -Rudy Giuliani"},{"comment_id":"743858605712748","commenter_b":"I know another PENNY ,and she is worth much more that as a friend !","commenter_a":"Good grief!! And people say pennies are worthless.","post_message":"Are they nuts?"},{"comment_id":"10153396919359087","commenter_b":"X Liberal Pussies who Pimp for Islam! It's Simply one of the MOST Bizzzzaaarre Psychological Spectacles of our Time! The ODD Relationship (do I say \"Love Affair\") between ISLAM and LIBERALISM is a WEIRD thing to watch. HELLO!! Liberal FEMINIST Women!! Islam is a SEXIST Male Dominated, Woman TRASHING \"Religion\"!! Liberals MOCK, RIDICULE Christianity, then turn around and Protect Islam's 1400 Year \"War on Women\" which Treats women like Chattel, and Stones Women to DEATH for adultery. \"Honor Kills\" women when their men feel their women aren't obedient, Muslim MEN FORCE Women into castration, Slavery, to wear scarves, and Burkas!! Muslim Women aren't allowed to Drive and be Educated yet Liberals want to be \"tolerant\" to Islam, but want Christianity to CHANGE!!?? Oh, and GAYS end up on the wrong side of the Stones/BladesToo!!","commenter_a":"Thank you President Obama. I'm so glad I'm not a pussy like most of the commenters here that live in fear of the great big scary Muslims. It must suck to go to bed at night clinging to their guns and religion wetting their pants afraid that Muslims are coming to kill their family. I'm glad I have a president that rises above that childish fear. I'm blessed that God hasn't made me a coward like so many of my countrymen who would gladly trade their freedoms for the veined vail of security. Cowards all of you. And I already know their response. They will call me a delusional libtard that loves Muslims. Without realizing the irony that these were the same people that called white civil rights activists \"n***ger lovers\". This generation of dolts, will too, be wiped away with time.","post_message":"“It was so moving for Michelle and myself in part because it was so representative of the country. You had people from every background, every faith,” President Barack Obama  said after meeting the families of San Bernardino victims.  “Some described their loved ones who had come to this country as immigrants; others who had lived in the area all their lives — all of them extraordinarily proud of the work they were doing to keep people healthy and safe here in this community.”"},{"comment_id":"752107674943648","commenter_b":"Loretta Lynch is a corrupt dirty rotten scoundrel is about to be charged herself for crime. Why? Stay tuned for more Wikileaks coming to a theater near you.! Loretta and Obama on the hit list for being nasty dirty people who have smirked and abused their positions in the greatest country. They will meet their maker on earth.","commenter_a":"HilLIARy has already admitted guilt and felonious actions??? She has admitted that her staff reviewed all her emails so they could delete her \"Personal emails\", right? Since this occurred AFTER she left the government, it is an admission of guilt!!! Why? It is a violation of law to reveal or share classified information with anyone that does not have a current active security clearance equal to or exceeding the classification of the material. Further it is required that the person have a \"need to know\" even if they have security clearance. Since her staff has neither a current and active security clearance or even if some did they did not have a need to know. Since it is now known that some of those emails were Top Secret SAP it is virtually certain none of those staff were listed as having access. The argument that none of the released emails ...","post_message":"President Bill Clinton – whose wife is currently in the crosshairs of the Justice Department over her use of a private email server – met privately with Attorney General Loretta Lynch."},{"comment_id":"10153530679413984","commenter_b":"I hope she gets jail time!","commenter_a":"Some beasty mom will kick her face in I'm sure. As a Juvinal little will happen to her in our current legal system.","post_message":"The extremely disturbing video of a young girl brutally attacking a schoolmate who was holding a small child went viral, now the attacker is facing some serious consequences...  Are you hoping justice is served?"}]
