[{"comment_id":"10153582261225950","commenter_b":"Making it easier to make the Darwin awards a picture book.","commenter_a":"Surprise surprise...another one bites the dust.","post_message":"There have been at least 49 selfie-linked deaths on record since 2014."},{"comment_id":"1581710041881753","commenter_b":"Maybe Madonna should offer the terrorists the same blowjobs that she offered for votes for Hillary!!!","commenter_a":"GO TO SYRIAand see what happens you stupid women","post_message":"Quite a national security position..."},{"comment_id":"10154700832214369","commenter_b":"Stfu crackers","commenter_a":"Time to play the National Anthem.... they will all take a knee then they can swoop in for a mass arrest.","post_message":"Violent protesters rampaged through Charlotte as anger continued to build over the deadly police shooting of Keith Lamont Scott"},{"comment_id":"10153318281418984","commenter_b":"Racist and Illegal!","commenter_a":"Not very inclusive.","post_message":"Imagine a \"whites only\" field trip. Al Sharpton would be licking his chops and hopping on the first plane to Indiana.  Do you think what this school did is wrong?"},{"comment_id":"10154310503686519","commenter_b":"I'm sure the travel site is a very bad site and many people are saying that the site is bad, disgusting and their reviews are a disaster. Trump won't subscribe to the site until they say he is great and then the site will be good. But it's very sad now. His hotel is the greatest hotel and anyone who doesn't think so is a looooser.","commenter_a":"Banktrump International Hotels, get over it!!","post_message":"You have to read their review of Trump's hotel for yourself."},{"comment_id":"10154129008215329","commenter_b":"Sharon lol i couldnt find the woooorrddd","commenter_a":"I'm 15... i mean, i know how to use a CD player, and i know how to listen to a CD. i also know how to use a cassette and all but now a days, most computers don't even have a slot... we also got rid of our CD player ages ago... i haven't bought a movie on DVD in soooo long because everything is digital now","post_message":"So you've purchased Adele's \"compact disc\"..."},{"comment_id":"317547525326742","commenter_b":"To pay the illegals","commenter_a":"GREAT NEWS!! You just keep spiking those taxes..why stop there..RAISE TAXES ON EVERYTHING....YOUR GOING TO NEED IT! Besides..dont you left winged morons believe in taxing yourselves into welfare?? Good job!! GO CALIFUCKUP!!","post_message":"Robbing Peter to pay Paul..."}]
