[{"comment_id":"1030297853698998","commenter_b":"Wow NOW THIS IS A TRAGEDY! A YOUNG BOY GUNED DOWN FOR NO REASON BY A THUG GANG MEMBER ! I GUESS IF A BLACK MAN KILLS A BLACK CHILD IT DOESN'T MATTER! BUT IF A WHITE COP KILLS A BLACK THUG COMMITTING A CRIME IT'S A BIG DEAL ! LORD FATHER GOD TAKE THIS PRECIOUS CHILD AND HOLD AND CHERISH HIM IN YOUR ARMS ! COMFORT HIS FAMILY AND SEE THE JUSTICE IS FOUND FOR THIS CHILD ! AMEN","commenter_a":"So where is the Black Lives Matter group now?","post_message":"Chicago Black Gang Member Lured Child From Playground And Executed Him Point Blank  You mean #blackLivesMatter protestors are not rallying for this 9 year old boy who was executed by a thug! I guess his Black Life Didn't matter   @webpagelink"},{"comment_id":"10154741316933812","commenter_b":"Hillary will be president","commenter_a":"Remember when Hillary Clinton said the 50,000 emails she kept from the State Department (in violation of the Federal Records Act) were about yoga and her daughter's wedding? How many of the most recent set of 14,900 emails ordered made public by a federal court are about yoga or her daughter's wedding? I'm thinking zero. But hey: pertinent falsehoods under oath aren't criminal when you're aspiring to become the First Woman President (TM).","post_message":"Meet Meatball: The adorable, friendly and rotund pit bull mix that can't help but flash his brightest smile as soon as he sees a camera. \"As soon as the camera turns on he just gets this huge grin on his face.\""},{"comment_id":"10152824862457212","commenter_b":"Yes of course. The middle aged woman who comes from a upper middle class family. Is going to tell people how to make it. Please go on.....................","commenter_a":"Cue the Conservatives of this state to tell how they worked so hard for their money, and it is everyone elses fault the don't have the means they do. In 1...2...3...","post_message":"Seeking to assess if the Horatio Alger, \"rags to riches\" narrative...remains viable, researchers measured the odds of a child born to parents in the bottom 20% of income earners reaching the top 20%. They then contrasted the chances of climbing the ladder in the U.S. to that in other developed countries. #News9 #CBSNews"},{"comment_id":"1001794969843293","commenter_b":"Feminism is cancer.","commenter_a":"Sorry lady but I put my arm around my wife because I lover her. She does the same to me and we have been married for 49 years. Maybe you ought to try a little bit of love instead of hate.","post_message":"The Dame has spoken."},{"comment_id":"10153760568196162","commenter_b":"I wish except i don't think my mom would know how to play the lotto lol!!!","commenter_a":"@username your mom won","post_message":"POWERBALL WINNER: Someone in Michigan just won the second largest Powerball jackpot this year. @webpagelink   The winning ticket is worth $310.5 million.  Here are the winning numbers:"},{"comment_id":"936644226390980","commenter_b":"The typical holiness young woman will argue with a tree and maybe this is why they got together and removed this mother from the church the reason refused to listen to anyone else way of thinking you be bless and I hope you live as long as the 103, may the same happen to you","commenter_a":"From what the article said... she thinks he's trying to change the denomination of the church. .. this beautiful 103 mother misunderstands that Holiness is a way of life.. not a denomination.. the Pastor could have handled this better. .. there's no need to put her out of the church. . To be sanctified means to live a life separated from sin.. that's not a denomination either. .. sounds to me that teaching through love and kindness is in order.. people seem to fear what they don't understand. . To call her names and disrespect her by leaving her in a dark church is not right and does not reflect Holy living . They need to repent of that.. always respect your elders regardless. .. but also remember .. just because your old does not mean you know all the way of the Lord... no one does.. that's why we ...","post_message":"A 103-year-old Georgia woman was banned from the Elberton church she’s served for 92 years after she voiced concerns about the pastor’s sermons.  After ignoring the ban and attending church the weeks after getting the letter, the pastor dismissed the service and left her sitting in the pew with the lights off. Police were notified, but refused to throw a 103-year-old woman out of church.   She was also subjected to slurs from their former fellow churchgoers. MORE ----->  @webpagelink"},{"comment_id":"812160358905862","commenter_b":"Please make sure you are registered REPUBLICAN to vote for TRUMP. He's our only hope. Corrupt Washington DC will continue as usual with the rest who are beholden to big donors/super pacs. This corruption has been going on for 35 plus years. Vote TRUMP to take back our country. If Trump don't win our children and grandchildren will have a miserable life with Muslims and illegals taking over our country and to top it off we have no jobs.","commenter_a":"Question: If #BillClinton is campaigning for #HillaryClinton, does this mean he can charge any fee he sees fit? In other words, no matter the outcome, the #Clintons are making bank! Also, is this true? HIGH Treason Traitor Hillary Rodham Clinton UNITED States of America - As Wanta-Reagan-Mitterrand Protocols implementation remains imminent with an April 1st U.S. Supreme Court ordered deadline, it can now be reported that former U.S. Secretary of State Hillary Rodham Clinton has been placed under house arrest by the U.S. military on charges of financial treason. On week ago Friday, the same day Jack Lew was sworn in as U.S. Treasury Secretary, sociopath Hillary attempted to illegally divert $1.7 TRILLION of U.S. Treasury funds to a secret CIA proprietary account in the People Republic of China. Both Chelsea Clinton (Hillary daughter) and former Citibank CEO and Clinton era Treasury Secretary Robert Rubin have power of attorney over ...","post_message":"Good morning America! Thank you for your support in the latest national Reuters poll. TOGETHER, we will #MakeAmericaGreatAgain!"}]
