[{"comment_id":"10154684897643872","commenter_b":"Cow Patty is a crooked Hillary corporate baby killing whore and will lose in November!!!!","commenter_a":"Yeah, I'm voting you out for voting for TPP, freedumb act planned unparenthood and supporting crooked Hillary, enjoy unemployment Cow Patty!!!!","post_message":"Voting starts today! Got questions? Visit iwillvote.com for answers."},{"comment_id":"1281953805157000","commenter_b":"Fuck Obama and his white trash skank bitch Hillary","commenter_a":"Our wonderful President, sorry to see you and your family go.","post_message":"President Obama has been known to break into song from time to time..."},{"comment_id":"10153592500342235","commenter_b":"Stepford wife! A woman with no dignity!","commenter_a":"Brave woman. ...","post_message":"This is sick."},{"comment_id":"10154331327221320","commenter_b":"Sounds like Jane is drunk. See Jane get drunk.","commenter_a":"The Dad was making a legal turn on red. The child didn't understand that this was a legal thing to do. I know plenty of kids who have become upset, because their parents take a sip of a soft drink while driving. They take \"don't drink and drive\" literally.","post_message":"A little boy rats his dad out to 9-1-1. Listen to the call: @webpagelink"},{"comment_id":"10156102482195615","commenter_b":"State officials are supposed to be non-bias. If she can comply, she can find another occupation.","commenter_a":"You really don't have one KIM!!!!","post_message":"And here we finally have the truth, folks!"},{"comment_id":"845732068898255","commenter_b":"bring all our soldiers home to protect us from the illegals, n's, and queers. let those other countries fight their own battles. money paid by americans stays in america","commenter_a":"I told you from day 1. We Americans are so super sick and tired of you liberals and media trying to water down America. We're sick and tired of you trying to pussify America. We're sick and tired of you trying to force liberalism down our throat. So guess what ? Open wide because now you forced us to shove Trump down your throat !! Enjoy !! We just got our balls back !! Liberals and socialists suck ... They don't like guns, So they don't think you should have one. They like social programs, So they think you should pay for them They don't like religion, So they don't think you should be religious They like abortion, So they think you should like abortion They hate success, So they think you should pay more taxes. They elected the first Muslim president, So they think you are a racist.","post_message":"ClashDaily.com"},{"comment_id":"991950690936939","commenter_b":"Looks can be deceiving. The slob has way too much power and his history is terrible.","commenter_a":"How is Bannon so canny?? He always looks like he just work up in a bus stop with a bad hangover and isn't 100 percent sure where he left his pants.","post_message":"Trump's aides also reportedly don't know how to properly turn the White House lights on and off."}]
