[{"comment_id":"479633975574097","commenter_b":"Every time she opens her mouth ... ........I smell !","commenter_a":"BUSTED! What's done in the dark will get exposed to the light!","post_message":"Hillary Clinton has previously claimed that she and Bill Clinton were “dead broke” when he left the White House, but the two have since amassed millions of dollars in wealth."},{"comment_id":"10153416517971051","commenter_b":"She should not face any charges. She protects her child.","commenter_a":"You go girl he got off easy","post_message":"When this wife discovered what her husband did to her 7-year-old, she set him on fire."},{"comment_id":"10156338941645615","commenter_b":"Yup let's get busy creating more terrorists.","commenter_a":"Jesus. Blind, and deaf to his own words.","post_message":"Do you hear yourself talking, Rick?"},{"comment_id":"10156552625375354","commenter_b":"Let me try this again without hitting the return button prematurely. The Hijrah is mandated in the Qu'ran. It seems to be proceeding according to their plan. So long as Merkel and her other Western apologists permit unfettered entry in their respective countries, Islamic conquest via mass immigration will have been accomplished even ahead of schedule.","commenter_a":"Islam is not a religion or a race. It is an illegitimate organized group of murderous thugs and has been since it began. Their modus operandi is always the same. The videos in the links are about Islam. @webpagelink . There is more here @webpagelink . Watch the first one. The second link has many more videos by Dr. Bill Warner.","post_message":"Tensions are rising on the Mediterranean Island of Corsica, a province of France, where authorities have banned all public protest..."},{"comment_id":"10153798240092869","commenter_b":"Leave this woman alone . A human life always comes first ....","commenter_a":"I disagree raising children is a great responsibility and absolutely no one is perfect that is why we have axcidents. The zoo done what had to be done at the time they were not aware that a child could get into the cage or I'm sure it would have been fixed","post_message":"Cincinnati Zoo keepers had no choice but to kill a gorilla that might have harmed a small child that somehow got into its enclosure.  But the Internet has been lit aflame by animal lovers furious at the parents for allowing the situation to happen.  They’ve reportedly received death threats and demands that they be prosecuted.     But animal expert and TV host Jeff Corwin points out that it’s nothing new.  One study showed that 42% of deaths and injuries from captive tiger attacks involved visitors, many of them kids, and not zoo keepers.  He has an important message for all zoo visitors, especially parents:    “When you go to these places, the zoo is not your babysitter. You have a responsibility.”   I wonder if our constant immersion in TV, movies and virtual reality is making people forget how to behave in “real” reality. The same obliviousness that allows people to yak on cell phones in Broadway theaters just as if they’re sitting at home in front of their TVs is also leading them to assume that real zoo animals are no more dangerous than those in a video game.  In real reality, you don’t get to press the Reset button for an endless number of lives.        Read the full article for some possibly life-saving tips for your next real trip to the real zoo."},{"comment_id":"1007291799323583","commenter_b":"Social Media: What a bunch of freakin half wits. I wish we could send them all out on a barge in the middle of the ocean sink the barge and see how many swim back. Social media morons the world would be a better place if we took your cell phones away until you learn what they are supposed to be used for. One irresponsible person does not make everyone irresponsible. Wake up! This is exactly what Obama wants, take our guns so he can declare the U.S. a dictatorship and he would be the dictator!","commenter_a":"no","post_message":"Here we go..."},{"comment_id":"10153039868668984","commenter_b":"Bitch....","commenter_a":"Filthy rich don't need any more money but their filthy greed demand more and more.","post_message":"I can't believe she did this. There are plenty of people out there who would kill for even a small fraction off that money...."}]
