[{"comment_id":"10154116667236002","commenter_b":"If this is true (drowning and family defense) she and her family need to be removed from the gene pool","commenter_a":"If people witnessed her letting her children drown, why didn't they help them?","post_message":"The family of a Texas woman accused of allowing three of her children to drown in a swimming pool is defending her."},{"comment_id":"10153141690015861","commenter_b":"@username she can ride that motorcycle off into the sunset away from here.","commenter_a":"Class act!! Thank you obama for showing Oklahoma some love... Unlike our governor.","post_message":"President Obama released a powerful statement to the friends and family of the people who lost their lives in the Oklahoma City Bombing, referencing the strength and unity of our community."},{"comment_id":"392158754326577","commenter_b":"I hope Trump wins the nomination. Then The Americans will for sure vote for a demokrat, whether it be Hillary or Bernie. No way the Americans are that stupid!!","commenter_a":"Isn't his stand against Muslims prohibitive by the Constitution and therefore automatically eliminates him from presidential nomination?","post_message":"Let’s stop the racism. Let’s stop the xenophobia. Let's stop Trump. #GOPDebate"},{"comment_id":"10153236038721336","commenter_b":"See this is what I mean, we know this guy is a terrorist. He admits so on TV and trains other MUSLIMS the most effective ways to be a terrorist. Why is he allowed to walk the streets? We need a force not answerable to normal athority that can move in on MUSLIM terrorist like this without constraints and not having to watch them for 10 years then wait a week after they attack to make an arrest. Get the job done and move on to the next one.","commenter_a":"Why giving your air time to this evil, wicked man","post_message":"Imam Choudary: \"The United States of America are the champions of murdering innocent people!\"  Muhammad contest organizer Pamela Geller: \"[We're] the champions of freedom, sir!\""},{"comment_id":"10153216710121051","commenter_b":"Piss poor radical Muslim a$$holes!","commenter_a":"Piss poor life guards...","post_message":"Lifeguards desperately wanted to save this drowning woman - but her father refused to let them do it."},{"comment_id":"10153898443761770","commenter_b":"In GOD we TRUST....Vote for Trump/Pence 2016..Hillary hate guns because dangerous to the toddlers!!! But In the GOD's name why she's ok to rip out the unborn 9 months in the womb...and Hillary sharing our national classify to others and exchange to pay her ...GOD bless American people to support Trump... because only Trump/Pence can stop government corrupt, bring job, boom the economy, protect our family and help veterans, military and make America safe and great again... that Hillary been extremely careless to protect our national security....and Trump will stop Hillary accepting money from foreign country that treat LGBTQ and women like animal... and Hillary call all my Africa-American friends \"SUPER PREDATOR \" and insulting all my Latinos & Latinas \"NEEDY & BOWL of TACO\"","commenter_a":"Who gives a damn","post_message":"Nate Schmidt of the Washington Capitals sits down with David Hookstead to talk about life as an NHL player."},{"comment_id":"10156451475900500","commenter_b":"Fire her","commenter_a":"So this woman or all the people she was ordering food for did not have a cell phone to order lunch? It should have never been done with a 911 phone.","post_message":"DANGEROUS SITUATION- What do you think of her punishment?  @webpagelink"}]
