[{"comment_id":"10155035206479369","commenter_b":"Build that wall!!!","commenter_a":"BUILD THE WALL","post_message":"Immigration fees are being hiked for the first time in six years."},{"comment_id":"1711261402459148","commenter_b":"Hilly would be in the slammer if she wasn't in the cartel","commenter_a":"BERNIE","post_message":"Chaos on the convention floor as the Stop Trump delegates chant for a \"roll call vote.\" RNC officials officials denied the roll call vote over the rules.  Fuill convention coverage: @webpagelink"},{"comment_id":"10154847976925560","commenter_b":"This is so sad and disgusting...and women kill for these bags.","commenter_a":"This is just bullshit","post_message":"This is why Hermes & Louis Vuitton bags have those bumps on them. [GRAPHIC]"},{"comment_id":"1735996146651286","commenter_b":"@username You are just a Con Man Two Faced Liar who is spreading false hope promises with zero substance to back up what your saying. You are playing America the same way you played the Americans that went to your scam Trump University","commenter_a":"Clinton is a close friend of the big banks, big pharma, and everything else that corresponds to corporate capitalism, millions of Americans already struggling will sink even further under the waves. Rental and housing prices, already astronomical, will rise to more heights of unaffordability. Drug prices and health care costs, which soared under Obama. Then, police shootings. @webpagelink","post_message":"America led by Hillary will be an AMERICA where things get even WORSE than it is now.  Higher taxes, rampant TERRORISM and MORE CORRUPTION from Washington, DC!  TOGETHER, we WILL Make America Great Again!"},{"comment_id":"10154364862976336","commenter_b":"Shes an accomplice then! Lock her up too!","commenter_a":"Put her in jail or kill him. Sounds like she knew!!!","post_message":"The gunman's wife said that he scouted both Pulse, the nightclub where the mass shooting took place, and Downtown Disney, recently renamed Disney Springs."},{"comment_id":"10155008881554411","commenter_b":"Zeyad Hopkins : @webpagelink","commenter_a":"She didn't spark anger, in fact Saudis didn't care. But @username has a case against Saudi and the USA, and yes I don't like Saudi but let's not start spreading bullshit and hate","post_message":"Just days after Merkel said burka should be banned in her own country."},{"comment_id":"10152841288932061","commenter_b":"I LOVE Johnny Depp and most of his movies. This is disappointing. He should just send them home. Save their lives. They should not have to pay for his stupidity!","commenter_a":"Everyone else has to do this and so do you,Depp!","post_message":"Depp is in Australia to shoot the fifth edition of  of the Caribbean, called  Men Tell No Tales.\""}]
