[{"comment_id":"10154611725268445","commenter_b":"you are an idiot. I wish you were here right now bitch","commenter_a":"Natives don't want jobs just government hand outs","post_message":"Cannabis becomes the great equalizer and provides a level playing field for tribal nations, including those who did not benefit from casino's."},{"comment_id":"10152847429722623","commenter_b":"Yeah because throwing fish chunks attracts puppies","commenter_a":"Jessica Kennedy South","post_message":"Check out this photo:"},{"comment_id":"1289659341093811","commenter_b":"So someone stole a car that means they deserved to get raped? Sickening","commenter_a":"But you stole and you went to prison, perhaps you shouldn't steal so that you can practice your transgender in your house","post_message":"Horrifying.  (via Daily Mail Australia)"},{"comment_id":"1762539284023573","commenter_b":"Adrian Chapman, Anyone that thinks trump is a racist has their head up their ass. Do you even know what the definition of racism is? Illegal immigrants are not a race. Stopping the flow of terrorism from Muslim dominate countries is a precaution to stop terrorism. Not all Muslims are terrorist but terrorist come from Muslim nations. Common sense not racism.","commenter_a":"How many TRUMP SUPPORTERS do you see on national news blocking highways, trying to stop other candidate's supporters legal right to rally.","post_message":"15-year-old groped and pepper sprayed at Trump rally"},{"comment_id":"10154506488603487","commenter_b":"Non-issue. Couldn't and wouldn't happen. Too much of our power structure is in Texas.","commenter_a":"If they do not want their Social Security, Medicare, Medicaid, and Veteran Benefits. We will gladly keep their share for the USA. Of course Hillary has a chance to win Texas.","post_message":"Hypothetical question: Would you support or oppose Texas seceding from the United States?"},{"comment_id":"10154716865434586","commenter_b":"Omg idiots","commenter_a":"What's wrong with people they don't use there heads","post_message":"Dear everyone: Animals are NOT selfie props. This has to stop."},{"comment_id":"1664084467202646","commenter_b":"Then I would campaign for congressional term limits Allow the country to decide if abortion is to be legal or not. The same with gay marriages. The supreme court should not be involved in these maters. If the is challenged and reversed. So be it. I would not allow mass illegal immigration. Illegal is wrong by definition. As to radical Muslims. Not welcomed. Peaceful Muslims who migrate legally are welcomed as long as they assimilate . And do not try to impose sharia law. This country has its laws made by its citizens. If you come here. You need to assimulate. I would ask for voter IDs. Driver license are not proof citizenship. Sorry.","commenter_a":"I would dump Obama care and replace it with something that makes sense. Eliminate the following depts. Education, environment and agriculture. TSA homeland security plus the irs. Treasury dept can handle collecting a flat tax. Eliminate the federal minimum wage. No need for the federal govt to be involved in these areas. Then I would walk away from the Iran nuke deal and global warming. Bad policies. Then I would invite the Mexican president to the white house and bitch slap him. Cut the budget across the board by 10% for each of the 1st 4 years Have a flat federal tax of 17.5 on everyone. Period. No deductions. Nothing. Flat. Period. I would then review all of BHS executive orders and reverse or modify what I decide what is needed.","post_message":"If you were president what is the first problem you would address?"}]
