[{"comment_id":"1245719035484009","commenter_b":"Is the translation is correct? If yes why he should bother. He can marry any time and breed","commenter_a":"This is why America has never nor should have open borders.","post_message":"Video captures a Syrian mother and father preparing their two daughters, ages 7 and 9, for jihad suicide missions."},{"comment_id":"992066754146411","commenter_b":"No, we don't want their kind here.","commenter_a":"How great it this to see! The same people who have always looked down upon us Tacoma people are now wanting to live here. Sweet justice is here. :)","post_message":"#Seattle workers are moving from the city to #Tacoma -- in the search for more affordable living! [kiro.tv/SEAtoTAC] Do you think:   A. Seattlites shouldn't have to move, rent control please! B. This is making Seattle traffic worse.  C. Moving to Tacoma or a suburb is a good solution.  D. (Your own answer)"},{"comment_id":"466981083492472","commenter_b":"Fuck them get out if our country Fucking terrorists","commenter_a":"No,","post_message":"Should Christianity Be Banned To Please Muslims?  Comment 'yes' or 'no'."},{"comment_id":"763776567072060","commenter_b":"F**k em both... Let's \"take em out\" ....","commenter_a":"Anyone who couldn't see this before is blind. Those two have always been allies.","post_message":""},{"comment_id":"10153514058971336","commenter_b":"We are all illegal one point American got started by illegals","commenter_a":"13 million illegal aliens keep me up at night.","post_message":"Attorney General Loretta Lynch said that a cyber-attack by the Islamic State is perhaps the terror group’s biggest, emerging threat."},{"comment_id":"1062386963799539","commenter_b":"@username Much like one refinances one's house at a lower rate. Sure sounds Republican to me.","commenter_a":"And this political cartoon shows why he should. Personally I'd prefer that he wait and allow a Democrat president appoint him to the Supreme Court.","post_message":"Does this about sum it up?"},{"comment_id":"1680131802273932","commenter_b":"Just because you have a blinker doesn't mean you can automatically change lanes. What an idiot! She's lucky to be alive. Remember never change lanes in front of a big rig, They purposely leave that space open, they need a lot of room to stop.","commenter_a":"the world is full of stupid once while going to work a farm truck loaded with green beans tried to pass him as of the right as he was making a right turn little car was broken","post_message":"LESSON: don't mess with truckers."}]
