[{"comment_id":"10154338817664411","commenter_b":"Arabic jews were never persecuted. This crap comes from your corrupted zionist controlled medias. Actually the white European jews were always persecuted by europea christians and Hitler etc. Can't you see the difference between a white European non-semitic jew with blonde hairs and blue eyes and a semitic middle eastern jew? Obviously you can't. You're a trash.","commenter_a":"There are calls by scientists and engineers, presidents etc etc etc etc etc to re - open the 911 case for new investigation. Suddenly the Saudi propaganda is out just at a time when the world is waking up to the 911 israeli zionist connection. Truth will prevail 😂","post_message":"Man wants to buy a plane & an abandoned building to 'prove it once and for all: Was 9/11 a hoax or was it real?'"},{"comment_id":"1736119296633923","commenter_b":"SURE --- IF THEY PAY BACK ALL THE WELFARE AND ABORTIONS WE'VE PAID FOR FIRST --- ------ GET A FREAKING JOB.","commenter_a":"I have never believed in Slavery and have not supported anyone who did. In fact I believe we fought a war and won to free anyone who was inslaved. And Blacks are not the only people that others use as slaves, there is still human trafficing going on and woman that are used as sex slaves... Get over the past as none of us alive can be responsible for what people before us did except not let it happen again.","post_message":"Bernie Sanders Apologizes For Slavery, Demands We Compensate African Americans He can use his own money for that. Will you compensate African Americans for slavery?"},{"comment_id":"486035008253746","commenter_b":"Cover her ugly ass back up. Been eating too many Chitterlings","commenter_a":"Cover her face??","post_message":"A woman is suing the police department... over a hijab?  This woman broke the law, the police are completely in the right.  Do you support our police?"},{"comment_id":"579381068889728","commenter_b":"BUILD THAT WALL AROUND TRUMP","commenter_a":"#BUILDTHATWALL","post_message":"Donald J. Trump joins supporters in chanting, \"Build that wall!\""},{"comment_id":"10154784936184614","commenter_b":"We keep building houses, taking away the land near the hills. where else are these animals supposed to go? if you want to live out there, keep your little ones inside. the animals were there first.","commenter_a":"Lol i guess those dogs was watching to much YouTube where people had their dogs chasing away mountain lions and big cats thinking they was really scared of a dog lol guess again.","post_message":"\"This video is heart wrenching,\" says a Rancho Cucamonga animal-lover whose security cameras captured his dog being dragged to its death by a coyote.   Oliver, a 9-year-old dachshund, was chasing the intruder coyote away from his sister dog when the wild animal grabbed him.  \"Even a 7- foot wall won't keep your pets safe,\" the homeowner warns.  Read KTLA's story here: @webpagelink"},{"comment_id":"10153779454116336","commenter_b":"She's a snake!","commenter_a":"Shes all done for now, goodbye Hillary","post_message":"WATCH: Rep. Jim Jordan questioned Hillary Clinton on emails she sent regarding the motive for the #Benghazi attack.   “You tell the American people one thing. You tell your family an entirely different story,” he said."},{"comment_id":"10153577909221756","commenter_b":"And finally, Jesse Jackson IV, since I think he likes Kendrick Lamar too?","commenter_a":"@username Mata Though I'm sure you have seen this...","post_message":"High school teacher Brian Mooney used rapper Kendrick Lamar's latest album to teach a unit on Toni Morrison's novel, \"The Bluest Eye.\" Lamar found out about it, and decided to stop in for a visit. Full story here: @webpagelink"}]
