[{"comment_id":"10153061426624411","commenter_b":"In prison in U.S. A child killer is gang raped and beat to death they hate child killers !","commenter_a":"Well it sparred prisoners a job of having to kill her. Deserves to die child killer!","post_message":""},{"comment_id":"10153608717341491","commenter_b":"You can't win when 74% of women hate you","commenter_a":"They're saying \"it's the beginning of the end of Donald Trump\" since the first quarter of 2015. It's the beginning of the end of USA.","post_message":"Elise Jordan writes that Donald Trump's treatment of women will destroy his chances of being elected"},{"comment_id":"10153134733596037","commenter_b":"A lot of women where I live buy as much jewelry. I don't think its extraordinary.","commenter_a":"As with Obama, the focus on a first lady is just a witch hunt. Jeb has enough of his own baggage to drag around.","post_message":"#JebBush's wife #ColumbaBush joins a long list of political spouses with a taste for extravagance. Yahoo News' Dylan Stableford reports."},{"comment_id":"10153447411644087","commenter_b":"Sexist.","commenter_a":"Jennifer Pinto","post_message":"“It’s imperative that you vote. I want you to vote for [Hillary Clinton]. It’s time for women to be seen as real equals,” soccer hero Abby Wambach said at an event for the Democratic front-runner. “That is one hell of a badass woman in my opinion.”"},{"comment_id":"965589516846855","commenter_b":"Rubbish. MUSLIMS are 90%terrorist","commenter_a":"If someone calls themselves a Christian and then goes and shoots people at a movie theatre, are you going to then say all Christians are bad? The thing is, all Muslims are not terrorists. My fiance is a Muslim his family are Muslim but they are not terrorists. Why should he have to wear a badge and be watched when he did absolutely nothing. Terrorists do not have a religion they don't have a \"look\" anyone can be a terrorist and saying we should badge all Muslims is just plain hate.","post_message":"\"Being Muslim doesn't make me any less American than you are,\" she wrote in a letter to Donald J. Trump that's now gone viral."},{"comment_id":"739998596133321","commenter_b":"Jesus Christ the arguments against guns here are fucking stupid. To fellow pro 2a people, don't play into their hands like this. Look. Let's pretend you were right. That the good guy with a gun scenario doesn't really deter anything. fine. Let's pretend you are right. That having guns so that people can defend themselves against tyranny isn't going to do anything. Fine. Let's pretend that we can depend on our government officials to protect us against foreign invaders 100 percent of the time without fail. Fine. Let's also pretend that you get all the gun control laws you want passed. Done. Now let's pretend that so far a vast majority of the recent shootings weren't perpetrated by individuals who up until the shooting had little to no signs of deteriorating mental health and zero criminal history. Let's also pretend that those same individuals did not purchase their firearms LEGALLY ...","commenter_a":"Liberal code. NEVER TAKE RESPONSIBILITY!!! Blame blame blame","post_message":"I know he's a grieving father but this is so WRONG."},{"comment_id":"1004293156333603","commenter_b":"Truth hurts if ou weren't an illegal you wouldn't have taken offense.","commenter_a":"Keep them out the US we have enough problems with illegals already. Deadbeats sucking the economy dry","post_message":"This year, nearly 200,000 people have landed on Greek shores, another 110,000 have arrived by sea to Italy and more than 120,000 by land to Hungary. Germany has just announced that it expects to receive 800,000 asylum applications in 2015."}]
