[{"comment_id":"10154387812405329","commenter_b":"Pretty ladies :)","commenter_a":"My mom and I get asked if we're sister's whenever we're out","post_message":"Um....................................."},{"comment_id":"10154101108342217","commenter_b":"TRUMPERS: Instead of saying get rid of abortion, why not use POSITIVE REINFORCEMENT by encouraging safe sex, and making birth control available in stores - WITHOUT HAVING TO GET A PRESCRIPTION. SILLY goose. SSSOOOO, are you saying that if a mentally retarded person is raped, then they should have the baby? Even though they don't have the mental capacity to care for themselves?.......... thats really stupid to state that they would have to go to another state in order for them to have an abortion, or to exclude ALL abortions. WOW. I bet you didn't consider mentally handicapped people being raped, or even 10 year olds. The youngest parents ever recorded, from my knowledge are the age of 10. Do you see the issue here? Think about it. Seriously. THINK people.","commenter_a":"TRUMPERS: Instead of saying get rid of abortion, why not use POSITIVE REINFORCEMENT by encouraging safe sex, and making birth control available in stores - WITHOUT HAVING TO GET A PRESCRIPTION. SILLY goose. SSSOOOO, are you saying that if a mentally retarded person is raped, then they should have the baby? Even though they don't have the mental capacity to care for themselves?.......... thats really stupid to state that they would have to go to another state in order for them to have an abortion, or to exclude ALL abortions. WOW. I bet you didn't consider mentally handicapped people being raped, or even 10 year olds. The youngest parents ever recorded, from my knowledge are the age of 10. Do you see the issue here? Think about it. Seriously. THINK people.","post_message":"The BBC's newsroom does the #MannequinChallenge.  BBC Children in Need."},{"comment_id":"1158142194215832","commenter_b":"aw poor huntsman","commenter_a":"Sergio Andrade Sergio Andrade Vergara Gisella Casillas","post_message":"A good reason to always flush the toilet.  Barry Morrissey captured video of a Huntsman spider hiding in a toilet bowl in Australia.  The video has been viewed more than 30-million times around the world."},{"comment_id":"10153122322244705","commenter_b":"Rehan Perera Damith Wickramarathne","commenter_a":"It never looked black! Blue n Brown. On the right it's got black with blue.","post_message":"And there you have it, folks!"},{"comment_id":"650282881785927","commenter_b":"She is such a fool. And not even a human. She needs to be in jail","commenter_a":"Putin looks at Killary, like you are in way over your head old lady. Don't even try to match wits with me.","post_message":"Busted: Clinton News Network's \"Fact-Check\" Proven 100% False!"},{"comment_id":"582952285239212","commenter_b":"Vote Trump! Not crooked Hillary","commenter_a":"Trump is nothing but a narcissistic coward. He likes to dish it out but he can't take it. Semper Fi","post_message":"Watch: POWERFUL and MOVING... This WWII Veteran and former POW is literally brought to tears in this impassioned plea to Americans to keep Donald Trump away from the presidency. Let's make this brave veteran go viral.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154151058422756","commenter_b":"To see how idiots can find an angle to go against clean energy. Wind turbines kill birds? A far less amount then any oil spill I have seen. Or pipeline that explodes. We could do this all day but this country is long past the need to go clean energy. I hope you idiots are paid to post all these ridiculous comments.","commenter_a":"Wind and solar don't make any sense, you have to cut down large areas of forest's to put up windmills on mountain tops to construct them, and they end up killing many birds. Same goes for solar, you would have to blanket the continental US with solar panels to replace fossil fuels. It's got nothing to do with \"evil big business\", wind and solar will just never be as efficient and reliable as coal, oil, and natural gas.","post_message":"A natural gas plant in Lycoming County is now complete, and it provides energy to nearly 1 million families in our area and other parts of the northeast."}]
