[{"comment_id":"794329380660118","commenter_b":"Away with dumb blonde teleprompter readers, away!!!","commenter_a":"Considering it's the only one she has, you'd think she'd find a better use for it.","post_message":"Sorry, Fox News! The 2015 Obamacare enrollment numbers just came out, and once again they smashed expectations.   Read more here: @webpagelink Image by Occupy Democrats."},{"comment_id":"837605946394236","commenter_b":"Another dumb southern woman","commenter_a":"If y'all vote Killary in, You are the dumbest people that walk the face of this earth. Obama has done enough damage. Military people do not want Killary as their commander and chief. If you think of no one else, think of our military. She has NO CLUE how to run this country.","post_message":"Donald Trump has landed at Dallas Love Field.  WATCH LIVE coverage of visit: @webpagelink READ latest updates & see photos: @webpagelink"},{"comment_id":"1751693101711200","commenter_b":"Who is this women?...wait nevermind. I don't care!","commenter_a":"Everything we say anymore is considered to be racist","post_message":"Blake Lively is being accused of racism after using a famous line from Sir Mix-a-Lot’s 1992 song “Baby Got Back (I Like Big Butts)” to describe her assets."},{"comment_id":"10154186263231336","commenter_b":"@username how did she give in to he bully? By becoming strong and accomplishing something at 9 that her bullies will likely never even attempt? By showing them that she has more aptitude and resolve in her pinky than her bullies do in their entire body? That she doesn't need to bully someone else to make herself feel better, but instead made herself better? If you ask me, that's not giving, that's stepping up and issuing a whole new challenge. There are 29 year olds in this world that could stand to learn a few things from this young lady.","commenter_a":"We need more parents who inspire their kids to do somethng like this. Instead of creating a safe space for their feelings for those who are bullied or feel bullied by micro agression.","post_message":"✓ 36-mile race ✓ 8-kilometer swim ✓ 25 obstacles   Her reason for completing the race? She was bullied in school. (CC: U.S. Navy)"},{"comment_id":"10155973648509199","commenter_b":"This Woman is money smart. Say it with me. This Woman is money smart. She will wind up moving up at her job to the highest position, paying more taxes, and bettering her life. People around her will be better from her life. She will put out better quality in everything she does or touches. It can all start with positivity here and with acknowledging that this Woman is money smart.","commenter_a":"Those berating the mom...it is her employer who is getting the \"subsidy\" by being able to make more profits by paying wages families cannot live on - of course they also can sell things for less, so consumers pay less, so they benefit. Wondering where she lives that that's a years rent, where I live that's a couple of months. Messed up system, but glad for her fam.","post_message":"\"Instead of buying my kids the latest Jordans or fancy electronics, I paid my rent for the YEAR. I a single mom and I do it all by myself on a minimum wage job.\""},{"comment_id":"1130843966969767","commenter_b":"Good keep them there and deport them","commenter_a":"Like packs of hyneas.","post_message":"UNREAL! SOMALI MUSLIMS RAMPAGE Through Mall Of America In Minnesota...10 Arrested [Video]"},{"comment_id":"1558210104487104","commenter_b":"So we fib a little bit.","commenter_a":"Lol BRUHHHHH 😲😲😲 Mike Scott","post_message":"This skydiver performed some of the stunts when Iron Man 3 was filmed in NC. Tomorrow night on FOX, he's performing a huge stunt without a parachute. Will you be watching?"}]
