[{"comment_id":"1736127839964656","commenter_b":"Maybe she should be mad at the powers to be who wanted it kept quiet.","commenter_a":"Maybe tptb should have done thing differently but since it all came out kelly has been a spoiled hateful spiteful bitch. If tomorrow is his last day I hope puts her on blast through the entire show.","post_message":"She’s reportedly not making things easy for him."},{"comment_id":"10153527468435399","commenter_b":"Now,that's got to be a bunch of crock,they don't even know that hag.","commenter_a":"Why is a rally in Peru for a clerk in Kentucky hard to fathom? Does Rob Schneider work for this firm?","post_message":"According to a report by ThinkProgress, the rally never actually happened."},{"comment_id":"552107031615918","commenter_b":"Jordan get out of here with that nonsense.","commenter_a":"Doesn't affect me. I'll be voting for Bernie.","post_message":"In response to a VICE News FOIA request, a federal judge on Thursday ordered the State Department to release the bulk of the remaining Clinton emails before the February 27 contest."},{"comment_id":"10157577335255389","commenter_b":"Gonna rain in wall street. The same ones you took millions from you pathetic lying hag","commenter_a":"its hard to listen to her speaks! the first thing came out of her mouth was Trump says did and Trump says that and what Trump did! nothing change she offer nothing! she looks doll up but still a liar!!","post_message":"Journalism. Is. Dead."},{"comment_id":"10154006195498984","commenter_b":"The witches on the view can't understand normal thinking!","commenter_a":"Moron","post_message":"Ouch. It has to be embarrassing for Whoopi to get set straight in front of her own fans like that. She was no match for Rand Paul. After one of Whoopi's famous rants, Rand Paul pointed out exactly what is so ridiculous and silly about her argument.  Do you agree with Rand Paul?"},{"comment_id":"880663015326781","commenter_b":"Alex Peterson hahahaha","commenter_a":"Tyler Simmonds @username Ashley Mckendrick","post_message":"Dolphin seduced me, claims man who had sex with marine mammal."},{"comment_id":"1213204015381722","commenter_b":"Trash talk was and currently still is part LJ personality. Nice try though . Gotcha bitch","commenter_a":"STICK TO BASKETBALL.","post_message":"LeBron is leaving no room for interpretation here."}]
