[{"comment_id":"10153992733094726","commenter_b":"Beautiful, smart elegant lady","commenter_a":"Let Ivanka rest for a while . she will have a new Baby soon .","post_message":"Trump's wife Melania steps into the spotlight, joining his daughter Ivanka"},{"comment_id":"941353829241191","commenter_b":"I know who im voting out of office. Bye bitch","commenter_a":"Bullcrap","post_message":"A recent legislative proposal from Rep. Carolyn Maloney (D-N.Y.) would require Americans to obtain liability insurance before exercising their 2nd Amendment rights. Maloney claims her legislation, the Firearms Risk Protection Act, would make gun owners act more responsibly. @webpagelink"},{"comment_id":"10154974354758984","commenter_b":"lock her up","commenter_a":"Both are ignorant bitches!","post_message":"In Wisconsin, the recount had gotten Hillary Clinton one extra vote. Now, though, the recount in Pennsylvania is in, and here's how many votes it netted Jill and Hillary...  This is NOT what they expected."},{"comment_id":"10154136814559411","commenter_b":"@username how is Rupert Murdoch theses days in sunny oz.","commenter_a":"Valdimir Putin will be proud!!! But this this newspaper is tied to a very sinister movement. Not all papers crytical of the government are shut down.","post_message":"Turkish authorities took control of Zaman last Friday, sales drop from 650,000 to 6,000 a day"},{"comment_id":"10150900817029999","commenter_b":"Well Said and Thank You!","commenter_a":"Have the rest of you bothered to read his comments? He says he does not hate the flag. Does not hate America. He doesn't sound \"spoiled\" to me (and I am an affluent, old, white guy). He has used his position to stimulate conversation about a very important issue. (Why IS it that a lot of black people out for a walk end up getting shot without many repercussions?) I like the guy (except when he plays the Broncos!)","post_message":"Colin Kaepernick explains his protest against racial injustice.  Read more: @webpagelink"},{"comment_id":"10153285964496749","commenter_b":"White Americans are sexy","commenter_a":":P","post_message":"Add your name if you support the Clean Power Plan—the biggest step America has ever taken in the fight against climate change. @webpagelink"},{"comment_id":"10154284155303908","commenter_b":"Alexandria Lindquist Larry bought the lease for 14 million, Bumped up his policies just prior and netted a 4.5 bn dollar payout. Funny that!","commenter_a":"Tallest structure in the world. Located in the middle of one of the largest and most populated cities. And you're telling me that the developers didn't take into account the possibility of the structures collapsing? I think they did. And in the midst of a terrorist attack, the split second decision had to be made; whether or not to take down the Structures in a controlled explosion ( which was probably designed during conception ) How would they have known whether or not any more explosives were going to go off? Tough call","post_message":"Were the twin towers, and more specifically, building 7 blown up by bombs on 9/11? Researchers at the University of Alaska are about to find out."}]
