[{"comment_id":"10154052672876051","commenter_b":"You deserve crooked Hillary!","commenter_a":"LMFAO, Clinton has SECURED enough electoral votes that she doesn't even NEED TO campaign anymore. Nice try there. It's pretty goddam pathetic that the absolute BEST the \"party of values\" could scrape up is a con artist who cheated on wife #1 with wife #2, has FIVE children from three different wives, wife #3 lied about having a degree and may possibly be an illegal immigrant; Trump appeared on the cover of Playboy and owned strip clubs AND gambling casinos; admits he wants to bang his own daughter; mocked the handicapped; supports torture; numerous business failures; bribed Florida AG Pam Bondi; is facing ethics lawsuit regarding Trump University, and that's just off the top of my head - yeah, right. Some \"Presidential\" material. So shove your fake-ass BULLSHIT stories about emails and Benghazi, you cheap phony \"patriots\" supporting Trump.","post_message":"Election swing: Donald Trump is now leading Hillary Clinton by two points in a major nationwide poll. Would you like to see Trump shock the world and win this November?"},{"comment_id":"10153179691834091","commenter_b":"Hmm...not as bright as WE thought, are you???","commenter_a":"See there, its already fixed. I'm sure it's not the first time this has happened. Everyone have a great night.","post_message":"YIKES!!!"},{"comment_id":"547039675478904","commenter_b":"trump is not going to build a wall or deport. sorry","commenter_a":"Make America great again build that wall","post_message":"\"I want America First - so do voters!\"  Hear from Donald J. Trump tonight on protesters, the Indiana primary and more at 10p ET. #Hannity @webpagelink"},{"comment_id":"10153494400717093","commenter_b":"They some hoes","commenter_a":"@username Mayra Castaneda","post_message":"Instead of going into a legal battle, the Dallas owners want the public's help picking a new name for the restaurant. @webpagelink"},{"comment_id":"1478041665558122","commenter_b":"@username - very serious! Just wait and you will see!! Thanks for allowing Clinton to be our next president!!","commenter_a":"Sorry- false!! Most military is for Trump!! Voting for Johnson is a vote for Clinton!! Why would the military want a person who believes in open borders!!","post_message":"These pushups are more than Trump has done."},{"comment_id":"842682652588978","commenter_b":"She needs to be kicked out of our country, we don't need trash like her kind around.","commenter_a":"Here's another puke, wants everything America has to offer but can't be happy with that, maybe the next time she appears in public, the police should not lift a finger to give it any protection, then she'll probably get stomped under the crowd, and she deserves every foot that would trample her arse!","post_message":"It is people like her that perpetuate hate.  Police are the people that keep her safe.  Do you think Beyonce needs to learn some respect?"},{"comment_id":"10153368528042217","commenter_b":"i might put some tinfoil hats on eBay...","commenter_a":"if this crap conspiracy rubbish was true, the yanks would of asked us to extradite him, which we would have done. its that simple.","post_message":"A UN panel will conclude the Wikileaks founder is being \"arbitrarily detained\" in the UK, the Swedish foreign ministry has said."}]
