[{"comment_id":"10156419798640354","commenter_b":"John Lansing Hillary is a right winger?? She is the queen of liars!1","commenter_a":"What a tool Brokaw is.. people actually saw it too.. WE KNOW who is spreading lies and it's not Donald J. Trump","post_message":"You saw what Tom Brokaw said on-air this morning, right?   If not, we've got the VIDEO for you here..."},{"comment_id":"10152697342252894","commenter_b":"Having a major craptastical, mitch, attituded 24/7 365 makes him a loser!! He is a jack hole!!","commenter_a":"Father, CEO, 100+ million in album sales from his music production (Jay-Z, Madonna, Mariah Carey, Ciara, Janet Jackson etc.), 30+ million in album sales and 21 Grammys. Being successful makes someone a loser? Ok","post_message":"Petty! If You Visit Loser.com, It Redirects to Kanye West's Wikipedia Page"},{"comment_id":"959675597399526","commenter_b":"Hillary 2016 Hillary 2020","commenter_a":"Hillary!","post_message":"It sounds like voters have already decided who they are going to vote for in the presidential election. Have you?"},{"comment_id":"1201817856581131","commenter_b":"I had idiots spit on me and throw eggs, rocks etc when I protested illegal immigration peacefully in California. I do not care if you are a man, woman or someone confused about their gender, if you spit on me or attack me I am going to do my best to make you eat teeth. I am fed up with these anti american liberals illegal aliens etc etc acting like animals. I would be by myself protesting and be outnumbered by a pack of thugs like this and I stood my ground and waved MY FLAG. You scumbag liberals and illegal aliens want some come and get some.","commenter_a":"Fellow liberals, this violence against Drumpf minions needs to stop. We cannot stoop to their level. The GOP will use this violence to court people to their side and we cannot allow that to happen. I get your passion but we need to use more voices but no violence.","post_message":"One woman wearing a Trump jersey was cornered, spat on, and pelted with eggs and water bottles."},{"comment_id":"10153979603521509","commenter_b":"Time for all illegals to go home","commenter_a":"Rather have trump in kkk then black panther party","post_message":"Former Ku Klux Klan leader David Duke said Donald J. Trump is the \"best of the lot\" -- but didn't endorse him for 2016: @webpagelink"},{"comment_id":"437108856413709","commenter_b":"He will CERTAINLY BE BETTER THAN THE MORON IN THE WHITE HOUSE NOW!","commenter_a":"Agree","post_message":"\"I will be the greatest jobs president that God ever created\". Agree or disagree?"},{"comment_id":"1589692694655762","commenter_b":"Nothing racist about, I have the same problem. Some do not understand us and takes forever","commenter_a":"How can you criticize this? Who actually likes calling those?","post_message":"\"So I called up, under the guise I’m checking on my card. I say, 'Where are you from?' They say, 'We are from India.' Oh, great. That's wonderful. Thank you very much,\" Donald J. Trump said, signaling as if hanging up a phone."}]
