[{"comment_id":"10153521877313822","commenter_b":"That skank!","commenter_a":"She has an incredible voice.","post_message":"JUST IN: The NFL announces that Lady Gaga will perform the National Anthem at Super Bowl 50.    SUPER BOWL COVERAGE: @webpagelink  What do you think of the choice?   (Gareth Cattermole/ Getty Images)"},{"comment_id":"1119477664770356","commenter_b":"Who needs to pay for the wall .? Ya want it ya pay for it . Smh","commenter_a":"You Goooo Mr Trump. .i am outraged over Fox ex prez of Mexico, how dare he tell us Americans what is best for our country, I can't wait for you to be our president, ..i can't wait until they pay for that wall, and you as our president, will make it happen, from houston texas along with myself and 8 family members will be voting for the next president v Donald Trump. .God bless you and your family,","post_message":"What I would do on my first day in office. #MakeAmericaGreatAgain  Text TRUMP to 88022 to join the #TrumpTrain"},{"comment_id":"10153293008086350","commenter_b":"Ugh totally agree! I would love a competent and brilliant female to become president! Just not Hillary..","commenter_a":"We need a woman president..just not Hilly! My opinion!","post_message":"\"I think women can do anything and be anything, but the president, I feel, is for a man...That does not mean we cannot be successful  run businesses, be doctors, be lawyers  I was only speaking of one specific position...and again, it's just my opinion.\""},{"comment_id":"10152950805022452","commenter_b":"Donald Trump should be proud that an \"Illegal Immigrant\" did not win. We don't want them to take the jobs from the \"White\" women! Next year they are going to have a new catagory called guess who is behind the sheets.","commenter_a":"Awesome","post_message":"Miss Oklahoma, Olivia Jordan, has won the 64th annual Miss USA contest. @webpagelink  This year's contest, held in Baton Rouge, Louisiana, had been largely overshadowed by comments made by pageant co-owner and real estate mogul Donald Trump while running for president."},{"comment_id":"650948841696821","commenter_b":"Yup","commenter_a":"@username smh crazy sheeeet","post_message":"Damn."},{"comment_id":"10154512331514087","commenter_b":"I don't blame them! I wouldn't want to work with the Chump either. But is that more inexperienced, mindless sheep the Chump can put in their place?","commenter_a":"LOL, I wasn't fired, I quit","post_message":"BREAKING: All State Department senior management officials have abruptly resigned."},{"comment_id":"10152660171235950","commenter_b":"My favorite science fiction tv show and movies i like them all i grew up watching Star Trek Spock was my favorite","commenter_a":"I have been and always I shall be your friends. Star Trek II.","post_message":"What's your favorite \"Star Trek\" moment involving the Enterprise's chief science officer?"}]
