[{"comment_id":"10153836700616636","commenter_b":" Classic","commenter_a":"Stop your lies and propaganda against muslims! Muslims would never do this cause they are peaceful! Tell the truth! This was an orchestrated conspiracy by the scientologists!","post_message":"He was 84"},{"comment_id":"10157293666220725","commenter_b":"Did you hear what Hillary said? She intends to talk to \"the white people\". She makes me sick!","commenter_a":"we need trump for president in 2016 go trump","post_message":"I am the Law and Order candidate!"},{"comment_id":"10153628863174575","commenter_b":"She's just a troll, Crystal. Ignore her.","commenter_a":"I stand with Kim Davis","post_message":"Rowan County Clerk Kim Davis is under fire for defying a judge’s order to issue same-sex marriage licenses.  \"This is how gay people are treated in this country.If nothing comes of this, at least I hope that other people understand that this is wrong. It's just wrong,” said David Ermold who was denied a marriage license."},{"comment_id":"10154705927224255","commenter_b":"Pence is no more Christian then I am, but at least I am not a hypocrite. I don't believe at all.","commenter_a":"For as bad as Trump is, Pence is just as horrible and probably more terrifying since he tries to hide his awfulness behind his bible and has no problem signing bills into law that he doesn't even read. With Trump being \"one of the most impeachment-ready candidates ever” Pence is who would be running the White House. Here are just a few of the deplorable and insane things that Pence has done in his career of screwing over Indiana and what we could expect as a Pence run administration. - He looks up to Dick Cheney as a role model for Vice President...that alone should scare the crap out of folks. - He regularly goes blank, forgetting what he was saying, and seemingly losing track where he is and what he is doing. - He is anti-science. - He has made a career out of destroying Planned Parenthood, Roe v ...","post_message":"Bravo, Tim Kaine!"},{"comment_id":"10155376064740389","commenter_b":"She's needs to be prosecuted for breaking the law!","commenter_a":"OF COURSE..... She is a huge narcissist, just like Obama. I am thoroughly disgusted!!!","post_message":"The White House tried to push past the Hillary Clinton email controversy on Wednesday, with Press Secretary Josh Earnest telling reporters he's \"not particularly interested in\" discussing the issue.   Question of the Day: Do you believe the former secretary of state's explanation for using one email account for work and personal use?"},{"comment_id":"10153319556628352","commenter_b":"She's got meth face.","commenter_a":"Fuck y r sum moms like dat not fair for children they deserve better","post_message":"Mother arrested for child neglect after her young daughters traveled barefoot trying to sell their toys door to door as she slept"},{"comment_id":"10152899941331336","commenter_b":"Sick woman","commenter_a":"This young lady will burn in her afterlife.","post_message":"A New Jersey woman who authorities say put her newborn baby in the middle of a road and set the child on fire was charged with murder."}]
