[{"comment_id":"1238709539473364","commenter_b":"You are one disturbed individual...","commenter_a":"That is a symbol of bigotry and hatred towards gay people, and Chris Pratt should know better than to insult an entire sexuality with this stunt.","post_message":"Actor Chris Pratt spent Easter building a giant cross."},{"comment_id":"1732269190330470","commenter_b":"Lol sure","commenter_a":"This just in, scientists baffled that the universe is not that old, may have been created by a a Supernatural being....\" I can't wait.","post_message":"The breakthrough could offer greater understanding of the Big Bang among other things. @webpagelink"},{"comment_id":"991707680869704","commenter_b":"Sorry ladies - simply not a fan and not willing to jump on her bandwagon because she seems to be the only female who's interested and has the ability to pursue it.","commenter_a":"Wouldn't vote for her if you paid me.","post_message":"If Republicans want to wage a war on women, they'll have to go through Hillary first."},{"comment_id":"463669483844276","commenter_b":"OHHHH.....now I understand. We have been talking past one another for half an hour.","commenter_a":"If Cruz is not a natural born citizen, but the offspring of two illegals who came here 2 weeks ago is, there is something SERIOUSLY wrong with our system.","post_message":"Ted Cruz was born in Canada and was a Canadian citizen until 15 months ago. Lawsuits have just been filed with more to follow. I told you so!"},{"comment_id":"10154672765359760","commenter_b":"Why? Ugly horse face bitch!","commenter_a":"Hell No! She didn't belong there in the first place. Garbage.","post_message":"Michelle Obama was loved by millions of people around the world as First Lady. Do you miss seeing her in the White House?"},{"comment_id":"10153127568784877","commenter_b":"This whole story interests me lol. This lady clearly has some issues, as u said. Smh","commenter_a":"They couldn't tell she is white? We need to be questioning the people who voted her in more than her!!!","post_message":"Rachel Dolezal gave lectures on ‘nappiness’ and ‘the brown paper bag test’, once told student she didn’t look ‘Hispanic enough.’ People from her past are coming out of the woodwork!   Grio fam, do you think the claims that Dolezal is a hypocrite are valid?"},{"comment_id":"1096402407066897","commenter_b":"Girl, bye. If you indeed weren't trying to get over on our great state, you have nothing to worry about, right?? Hey, you may very well be a crook...","commenter_a":"He said.....she said. Truth is most likely somewhere in the middle. Pffffffft...","post_message":"It does kind of smell like revenge. What do you think?"}]
