[{"comment_id":"537541949759320","commenter_b":"She needs to go","commenter_a":"Love you Judge!","post_message":"“As the world comes crashing down around her - Hillary Clinton in panic mode - displays what kind of president she would be. One who simply can't cope, can't take the pressure and would be a danger to this country.”  Judge Jeanine Pirro slammed Clinton for lashing out at an activist while on the campaign trail earlier this week. @webpagelink"},{"comment_id":"905141892877096","commenter_b":"You are a gruberized voter.","commenter_a":"Based on the polling from this thread Roy should keep his money and not bother to get re-elected. @webpagelink","post_message":"Missouri was one of the first states in the nation to reject President Obama’s fundamentally flawed health care law. For the past five years, I’ve heard from countless Missouri workers, seniors, and families who are facing higher costs and fewer choices due to the president’s health care take-over. As we mark the 5th anniversary of #ObamaCare becoming law today, I’m still fighting to repeal this flawed law and replace it with common-sense health care solutions."},{"comment_id":"1245886292171089","commenter_b":"@username me too","commenter_a":"Maybe they were afraid the non-white people were not going to use the proper restroom for the gender on their birth certificate. Hey, do we have to bring our birth certificates along if we visit your fine state so we can pee? Oh, nevermind, I forgot...NO ONE IS GOING THERE, so we don't need to know! As long as you have McCrory as your governor, you best get used to this kind of thing happening. (Note: this bit of sarcasm was aimed at this Nightclub, not the City of Charlotte. Charlotte is the city that passed an ordinance on Anti-Discrimination to protect the LBGTQ community, which lead to the stupid HB2 being passed by the state legislature. Too bad Charlotte suffers along with the rest of the State for trying to be open and fair.)","post_message":"This is an outrage."},{"comment_id":"453308998193014","commenter_b":"She's in AMERICA and that gives her the right to display the flag. Leave it up !!!","commenter_a":"Yes","post_message":"Do You Support This Woman's Refusal To Remove Her Flag?  Comment 'yes' or 'no'."},{"comment_id":"10156449945205354","commenter_b":"NOOOOOO! Stay there!","commenter_a":"Haha nah Texas is is good on that","post_message":"Obama's Hero, Ahmed \"Clock Boy\" Mohamed, Now Misses Texas!  “I want to go back to a place where everyone knows me.”"},{"comment_id":"975168282518593","commenter_b":"Better be sure. Our us h hospital are not allowing this.....What. If. Patient wants non Islamic nurse. Because is this practice?","commenter_a":"STOP with the offending of muslims.....this is the United States of America...land of the free.... Who gives a crap if your offended....","post_message":"Whoa!"},{"comment_id":"1703915029828450","commenter_b":"Mitt you looking for your10 mintues of fame????.... you lost get over it.....How can you allohw a Party to say mine and millions of people vo te don't count.....????..we don't like Rubio.and by the way llook hard in Flordia about his pass!!! we don't like Ted Cruz.. which i think thie Chistian voter shows that... Donald Trump for President 2016 has grown your Party... I am 60yrs old i have been a Dem all my adult life.. this year,, i changed to Rep Party....to vote for Donald Trump for President 2016... and now it doesn't matter?? because the GOP says so.... pure Goverment !!! trying to hold on to there ways the hell wi th the people e.... ok i you keep your crap up.. just won't vote.....and we can have another 4 years of Obama... and i am sure i am not a lone on this....th an you have ...","commenter_a":"And I put a hundred hours and a lot of cash working for Romney. A RINO at heart and a man that can't close the deal.","post_message":"Donald J. Trump responded to Mitt Romney, calling him \"one of the dumbest and worst candidates in the history of Republican politics.\""}]
