[{"comment_id":"10152854969571051","commenter_b":"Let behead these scumbags..What the F**k is wrong with people..Your parents should get their asses kicked","commenter_a":"Tell me where they live. I'll do the rest...","post_message":"These teens beheaded a puppy with a machete and posted the video to Snapchat. Then they picked up another puppy and did it again. And they didn’t stop there."},{"comment_id":"842856589085016","commenter_b":"Jesus never existed. It's all in your head woman.","commenter_a":"The should stop being christian then","post_message":"\"...a most agonizing situation.\""},{"comment_id":"10154061349648352","commenter_b":"Sick woman you are","commenter_a":"He is taking care of both of them and about to marry her so what. If it works for them who cares. And if your in the church every last prophet had more than one wife. Having only one wife is a western and new thing.","post_message":"‘I try not to get jealous’: Pastor, 60 marries his pregnant girlfriend, 19, with the blessing of his wife, 44, with both women to live in different wings of Ohio home"},{"comment_id":"10155421751074062","commenter_b":"Another idiot...","commenter_a":"To late to act like your civil now !","post_message":"Black Lives Matter activists led a peaceful march in Houston on Saturday."},{"comment_id":"1361756670528336","commenter_b":"Vengeance is mine saith the Lord.","commenter_a":"Disgusting and low class","post_message":"More tolerance from our friends on the left."},{"comment_id":"922274701162393","commenter_b":"Wait, she is the old hag looting America, and the rest of the world.","commenter_a":"@username - Such an inspiring woman. You are okay with a old hag looting America but not a woman with great accomplishment trying to occupy White Office. #Hillary4WH #MadamPresident","post_message":"Hillary's new favorite singer."},{"comment_id":"1006273402742336","commenter_b":"You kiss your mother with that mouth?","commenter_a":"How funny, lot of idiots on here don't realize that bin laden in the white house tremendously cut funding to nasa a while back.... This is probably giving back what he took...... Lib and Bernie voters aren't expected to","post_message":"That even more than Barack Obama asked for."}]
