[{"comment_id":"519371271599548","commenter_b":"He did not mention deporting a large number of illegals, he did not mention anything about building walls, that's why he failed to stop the influx of illegal immigrants that we have now. Nothing is impossible, if we want to do it. If we can dig tunnels below, we can build walls above.","commenter_a":"It doesn't sound like trump at all. That's most probably what trump should have said. Everything bill Clinton said has been implemented. He doesn't mention deporting 12 million people (impossible to execute), he doesn't mention building a wall (idiotic and impossible to execute)... So no, doesn't sound like trump at all. This sounds like someone that actually has a executable plan, unlike trump. Not to mention calling a whole nation rapists, murders and drug dealers.","post_message":"Do you think this sounds a lot like Donald J. Trump?   MORE: @webpagelink"},{"comment_id":"844885798949835","commenter_b":"Hillary was responsible for keeping wages at slave wage, oh and she sits on the Walmart board of directors too, if ya didn't know. Hillary sure likes to pull out the ACE cards for protection, still doesn't exclude that she is a liar, and a criminal of the highest order. As truly Democratic Trump holds the GOP hostage, and Cruz is stupid, full of shit, and a wingnut, and Hillary is a criminal: @webpagelink TRUMP BFF and CRIMINAL? REALLY! Get the word out, SHARE THIS! FEEL THE BERN! DOES USA WANT A KNOWN CRIMINAL IN THE MOST POWERFUL SEAT IN THE NATION/WORLD?","commenter_a":"Good for them Walmart can afford it, don't forget Walmart is the reason most of the factories closed b/c they brought cheap shite from China and the working man bought a TV or whatever from China that was cheaper so factories couldn't compete which is what Walmart wanted. I never have and never will shop there.","post_message":"Walmart faces another lawsuit loss..."},{"comment_id":"10154419020458812","commenter_b":"@username check your facts. You're showing how ignorant of the law you really are. IF it happens, remember that's all part of what YOU wanted.","commenter_a":"The people allowed leadership into power who passed the bill. Vote them out or put pressure on them. You, the people are responsible. So losing out on economic activity and entertainment is the price. Soon comes loss of education funding. Whats more important?","post_message":"JUST IN: Maroon 5 canceling upcoming shows in North Carolina because of the recent passage of the HB2 legislation. \"Everyone should be treated equally.\" @webpagelink"},{"comment_id":"1308394922562170","commenter_b":"Go build the wall then","commenter_a":"Put them in jail and large fine, deport the illegal immigrants now, cut federal funding, build the border wall, close all sanctuary cities/schools, take care of Americans/veterans first, if they legal learn our laws, constitution, and English , this is our country and if they don't like, they leave.","post_message":"A protester burns an American flag during marches through Olympia today. Video from The Olympian.  Latest updates: bit.ly/2j3yanl"},{"comment_id":"10153222530101167","commenter_b":"Ken, We still don't have all the emails she deleted several so we really don't have the entire story. But if we did get anything on Obama that would make Impeachment even better.","commenter_a":"They need to close down the Benghazi Committee and put those resources to the Hillary Email scandal.","post_message":"Stunning news: It's not just that Republicans are using the committee to launch partisan attacks on Hillary Clinton. The committee is also accused of illegally retaliating against an active duty investigator."},{"comment_id":"1238174809572379","commenter_b":"Con-woman!.....criminal.","commenter_a":"And you believe that both Pence and The Wall Street journal are saying the truth!! Pence is campaigning although, as an honest Republican, he'd better stay silence. And WSJ, I have not seen it but it sounds like somebody's opinion.","post_message":"Labor Day is a time to pause and honor the hard-working Americans who have built our nation's infrastructure, and powered our economy for generations."},{"comment_id":"10154160437056943","commenter_b":"Of course she did !","commenter_a":"Yes","post_message":"Share if you agree!"}]
