[{"comment_id":"10154378235307061","commenter_b":"ironic since even king himself thought malcolm x was a hack","commenter_a":"I am a white man, but it seems to me that Islam provided to Afro-Americans a system of faith and structure that Christianity failed to do. These people took names of Islamic heroes, rather than the surnames of their owners. Muhammad Ali took stature when he changed his name from Cassius (Roman name) Clay (ancestor white owner?). In America we stand up for who are and what we believe to be right.","post_message":"Malcolm X was killed on this day 52 years ago. @webpagelink"},{"comment_id":"10153703978899087","commenter_b":"How about the thousands that are killed by blacks themselves ! Never hear about that !","commenter_a":"Bernie listens, Hillary laughs and walks away!!'","post_message":"Emotional video posted by the Black Lives Matter movement shows Bernie Sanders comforting a woman whose brother was killed by police. READ MORE: @webpagelink"},{"comment_id":"1783246305275728","commenter_b":"@username Yes She did","commenter_a":"I am Dutch. Sylvana Simons said \"All White people are Racists\". Now everybody is angry at her. She never changed her opinion and never said sorry. She is a member of Denk, a Dutch Turkeys political party. The party has very extreme opinions and backs Erdogan without questions. They like sharia law, and child marriage.","post_message":"\"People shouldn't turn it into something negative,\" says one mum whose son dressed up as 'Black Pete' for a parade."},{"comment_id":"909362045826715","commenter_b":"NO!","commenter_a":"You idiot libs! Most of us conservatives carry a gun everywhere we go. You just dont know it. And if a criminal tries to go on a killing spree, we will save your dumb a$$es too.","post_message":"Should guns be allowed in parks and playgrounds?   What do you think? Sound off below!"},{"comment_id":"10155013986101162","commenter_b":"Lmfao!!","commenter_a":"@username just because I saw your shopaholic post lol","post_message":"LATE PACKAGES: Amazon may experience some holiday turbulence in its shipping due to a contract dispute with pilots..: @webpagelink"},{"comment_id":"666476586876253","commenter_b":"She needs to worry about herself ugly!!!!","commenter_a":"No me jodas... ...","post_message":"Controversial video just leaked that shows what Michelle thinks about white people.  This is extremely offensive. We need to spread this, and show the country she's a racist.  Do you agree Michelle Obama is the worst first lady ever?"},{"comment_id":"1609193876054360","commenter_b":"Karma has a lot of work ahead of her!","commenter_a":"Shame on all that participated! My thoughts and prayers are with you and your family. Thank you for your sacrifice and for your sons. He is a true HERO! I'm heart goes out to all of you. God bless!","post_message":"“When he made that announcement, there was some hissing and some booing behind us,” Stewart Perry, father of Sgt. John Perry, told the Army Times."}]
