[{"comment_id":"10156386712435354","commenter_b":"Dumb asses.. Nuclear terrorism ( round the corner) is far worse than gradual climate change..","commenter_a":"And he is a greater threat than Climate change. So I guess that makes him a greater threat than terrorism too !","post_message":"A DEVASTATING indictment every American should see..."},{"comment_id":"1096005223798926","commenter_b":"Here we go with the wall...","commenter_a":"Trump would have never left that Marine in Mexico like Obama did...","post_message":"Donald J. Trump and Mexican President Enrique Peña Nieto give statements after meeting in Mexico City."},{"comment_id":"10154945345047439","commenter_b":"How about America waking up? You have elected a Muslim President and Muslim administration twice, and sat back idly whilst a Muslim has destroyed America and flooded it with millions of Muslims and illegals. Unbelievably, after 9/11 with almost three thousand victims, America elected a Muslim, built a further 1000 mosques and sent $770 million of US tax payers money, to restore mosques overseas. Since 9/11, you have suffered a further 51 Islamic related/honour killing attacks, with another long list of victims. Millions of illegals have simply walked into America and massively include, rapists, drug users, hardened criminals and sex traffickers. Despite thousands upon thousands of unscreened Syrians entering America each month, millions of white Americans are voting a 550% increase in unscreened Muslims, amnesty to over 11 million illegals and 650 miles of open borders. Trump is telling the world that American's are an absolute embarrassment, on how they ...","commenter_a":"Europe needed to wakeup 10 years ago, at this rate they are FINISHED, I hate to say it but this is what You get when You let Females rule countries... I know that sounds sexist, but there are not many M. Thatchers out there!","post_message":""},{"comment_id":"1280286192042365","commenter_b":"^^^ That is porn for some women...","commenter_a":"Do some actually people make that face when looking at porn?","post_message":"Browsing porn on your smartphone requires more than just anti-virus protection.   Let us help."},{"comment_id":"10153394655753908","commenter_b":"is anyone here surprised by this information?","commenter_a":"Get a grip","post_message":"For those who haven't seen this yet. \"Ever single terrorist attack in the US was a false flag attack.\"  There is a tremendous amount of research to back up this statement."},{"comment_id":"537541949759320","commenter_b":"She needs to go","commenter_a":"Love you Judge!","post_message":"“As the world comes crashing down around her - Hillary Clinton in panic mode - displays what kind of president she would be. One who simply can't cope, can't take the pressure and would be a danger to this country.”  Judge Jeanine Pirro slammed Clinton for lashing out at an activist while on the campaign trail earlier this week. @webpagelink"},{"comment_id":"10153549714052014","commenter_b":"She should've closed her legs.","commenter_a":"Unfortunately this POS will get an attorney who will say she is mentally ill, then she will go to some mental hospital. She will be there few years and they will say she is better, she will be back having more babies. I don't care what the reason, crazy, postpartum, bad day, whatever she deserves jail for the rest of her life!! She should have just whacked herself, sorry I have absolutely no pity for her.","post_message":"HORRIFIC UPDATE: Police are now saying the mother who killed her 3 children also partially dismembered them. Two of the kids were placed in closet & the 2-month-old baby was \"stuffed into a case.\""}]
