[{"comment_id":"10154378040854024","commenter_b":"Wow! That woman is looking dumber every day!","commenter_a":"Flippin greedy, deranged, bitch whore!","post_message":"“Now this is just getting ridiculous. She didn’t actually meet the standards in PA to have a recount, so she’s going to try to evade them by calling them ‘unconstitutional’. She raised enough money specifically to deal with the fees and then pulled out when asked for it. The whole point is to tie up the electors so they can’t vote for Trump.”"},{"comment_id":"1397444103681973","commenter_b":"Welcome to the internet hun.","commenter_a":"90% percent of the people calling others cry babies are the same who were crying and complaining when obama was president.","post_message":"This one sums up today's women's rights marches beautifully..."},{"comment_id":"10152889300511051","commenter_b":"Prosecute these fools ASAP!","commenter_a":"Once again this is the reason for the death penalty, see if they would be laughing then!","post_message":"This group ran out of a restaurant without taking care of their bill. When a waitress followed them, they decided to make her pay."},{"comment_id":"10153203722519614","commenter_b":"You must talk a lot huh? I said NOT ALL Pitts... Damnnn women take a deep breath. Move on peace out, relax.","commenter_a":"Another Pitbull attack! Unfortunately we all probably knew this was the case even before reading the story. I'll be shouted down by Pit defenders as is their norm, but I don't care. No other breed is killing other dogs and humans like this, and this breed needs a re-set NOW.","post_message":"A French bulldog puppy that died after being attacked by another dog while in the care of a Petco-owned dog-boarding facility has prompted calls for #justiceforboggs.  The Pooch Hotel Hollywood representatives initially told the dog's owner that Boggs was taken to a vet as a precaution after an altercation, according to the owner's roommate. About 45 minutes later, an ER vet called to say the puppy was in critical condition with a torn trachea and multiple internal injuries.   Described as \"13 pounds of pure joy,\" Boggs was put down as her out-of-town owner listened helplessly on the phone. Now she is considering legal action.  Read KTLA's story here: @webpagelink"},{"comment_id":"1867582453468544","commenter_b":"Stupid bitch","commenter_a":"you make it like i did , hard work bitch , no hand outs","post_message":"One of the co-founders of Black Lives Matter just said that \"white folks\" need to \"sacrifice\" THIS for her movement... this is an outrage.  America needs to know the goals of this movement... they're not going to like this."},{"comment_id":"10154094208712483","commenter_b":"I always love the people who shout about \"Damn SJWs always trying to shut down things they don't like! Get over it!\" because they're the same people that whine about things like the \"War on Christmas\". Who needs those safe spaces again?","commenter_a":"Oh no! Somebody got offended again so let's shut it down!","post_message":"The series, which has elicited a fierce backlash, will be shelved."},{"comment_id":"1158142194215832","commenter_b":"aw poor huntsman","commenter_a":"Sergio Andrade Sergio Andrade Vergara Gisella Casillas","post_message":"A good reason to always flush the toilet.  Barry Morrissey captured video of a Huntsman spider hiding in a toilet bowl in Australia.  The video has been viewed more than 30-million times around the world."}]
