[{"comment_id":"10153148918692217","commenter_b":"@username yeah because he will send you back to Mexico..... and will put a full stop to cross jumping.... All those tunnels on the US border in Texas will also be sealed.","commenter_a":"old news.","post_message":"Using their tune? Donald J. Trump needs to \"Dream On\" 🎶"},{"comment_id":"10152942568911636","commenter_b":"She has to Post some Nudes on the Internet for the People to Comment about Her Sexuality! :D","commenter_a":"I love yo voice","post_message":"Michelle Rodriguez praises Cara Delevigne"},{"comment_id":"10153597569599411","commenter_b":"@Zoran...again, you get a life...we are pretty happy and fine. Not like a poor illegal immigrants as Zoran trying to stay in the west....","commenter_a":"No one should feed barbarian Russian junta fascism invaders.","post_message":""},{"comment_id":"10153855338620047","commenter_b":"Nothing will happen to any of this mafia, unless Trump is elected. I hope everyone saw the video on TV, where Obama actually told an illegal to vote tomorrow and to tell her friends it was OK for illegals to vote. It is simply a TAKE OVER OF AMERICA!!!! It is a WAR by ballot!!!! Wake up Americans because if we lose tomorrow, we lose America!","commenter_a":"Prosecution","post_message":"Sign and Share our urgent petition to demand the Attorney General's immediate resignation for breaking the sacred trust of the American people."},{"comment_id":"1680894471939506","commenter_b":"Other people need jobs. Quit and you don't draw unemployment. Saves tax payers some money","commenter_a":"Which means 28% of our \"public sector servants\" are actually partisan political hacks. Liberals embedded like ticks. About right.","post_message":"I hope they're mostly from the IRS."},{"comment_id":"10153428772146509","commenter_b":"Cause she was worthless and weak that's why!!","commenter_a":"Why would you choose the classroom to do that?","post_message":"There was no indication of foul play, and every indication that she took her own life, officials said. @webpagelink"},{"comment_id":"966205513390919","commenter_b":"Ms Quintana what a selfish, entitled attitude you have. Who is going to pay to train the temp, who is going to have to take on the extra duty of getting them up to speed, and who is going to pick up the slack while they get adjusted? Someone has to make up for that lost productivity. So the woman makes a decision to have a baby, and everyone around her pays for that decision. How is that fair? And not only that, but she expects to waltz back in a year later like nothing happened! She will most likely have to be retrained, creating yet another burden on top of kicking out the person who has done her job for the past year. Why should that temp have to step aside because queen mommy came back? Shouldn't that be HER job now? Why should she have to step aside ...","commenter_a":"How very \"pro-life\" of them ;). It's no wonder some women need abortions, if you can lose your job or be forced to go on unpaid leave while pregnant, and there's no maternity leave after you have your child... having a child can seriously cause you financial distress to the point of ruin! States need to pick one or the other! You can't be pro-life if you're not going to support a woman who has a child at all.","post_message":"\"I loved my job. I was really hurt.”"}]
