[{"comment_id":"10152570108341770","commenter_b":"She's not upset about the coat, it's that her father is a turd and her mother is a pig.","commenter_a":"I guess so","post_message":"What do you expect when you dress your toddler in a $3,500 fur coat, Kim Kardashian?"},{"comment_id":"871197372940012","commenter_b":"What a vile creature! Hope she rots in jail!!!","commenter_a":"Some people don't deserve to work in child care, I worked in child care for 25 yrs & I have seen some things as well, I worked in a nursery room at my last job( where I got injured & can't work again) & my assistant at the time picked up a 7 month old baby by 1 arm which is a major NO NO, carried him across the room & dropped him 1 metre onto cushions, I spoke to her about it & told her it wasn't on & she went & dobbed to the directors & i was the one who got into trouble, at another centre I sw someone tie a 5 yrs feet up & put them in the resource cupboard so they wouldn't wander around during sleep time, they lost their job for it. so many sickos.","post_message":"Footage shows her attacking girl who fell asleep on nursery floor cuddling her teddy bear"},{"comment_id":"913240742032115","commenter_b":"this is not true...try 99999999x","commenter_a":"When you stand 10 x","post_message":"You Know You’re In A Black Church When…"},{"comment_id":"635093840035049","commenter_b":"The only duty this bitch understands is money and do what frump trump Hitler wants !!","commenter_a":"Hopefully she will realize that she is in way over her head and resign.","post_message":"Betsy DeVos has demonstrated she has a rudimentary understanding of the issues facing our students, teachers, and schools, which should have disqualified her from serving as Secretary of Education. She possesses no experience with the public education system as either a student, parent of a student, educator, or professional working on education policy. Now that Ms. DeVos is confirmed, she is charged with the responsibility of advocating for and protecting ALL students regardless of their background. I hope that she will fully embrace this duty."},{"comment_id":"879451945423561","commenter_b":"The Bimbo queen herself Sarah Palin.","commenter_a":"I hope she doth","post_message":"This is criminal!"},{"comment_id":"10152810357076130","commenter_b":"Dike supporter? Leave the USA then","commenter_a":"Too bad they can't be fired for being worthless POS's and I'm talking about the people the staffers work for","post_message":"Under current House rules, congressional staffers can legally be fired for their sexual orientation, gender identity or gender expression."},{"comment_id":"10152763206590950","commenter_b":"I guess she thinks shes all that.....but no!!!!!","commenter_a":"I do not care that the towing company is predatory, this cashier just works there and does not own the company. Try yelling at the cashier at Walmart or some other heinous company because you hate the company or corporation, same thing. Misplaced and misdirected hate is never productive and just shows your true character :(","post_message":"A pretty television personality opened up her mouth and showed a lot of ugliness in a video that went viral this week. Washington D.C. reporter Britt McHenry was caught on camera giving the business to an impound clerk while retrieving her towed car. Now the people on the other end of her tirade are responding."}]
