[{"comment_id":"472703329582291","commenter_b":"How does Trump make Mexico pay for the wall, When America has no authority over Mexico ?","commenter_a":"We need the good people of Florida to Vote Trump!","post_message":"FLORIDA: Early voting is now open! Do not miss this opportunity to #MakeAmericaGreatAgain #Trump2016 Ivanka Trump  Find Florida early polling locations: @webpagelink"},{"comment_id":"10153910519885695","commenter_b":"What a pig.","commenter_a":"He should be castrated .","post_message":"Jared Fogle's attorneys asked a judge for leniency, saying he is \"profoundly sorry.\""},{"comment_id":"536114256579154","commenter_b":"the only thing she needs to do is run straight out of this country.....begone.","commenter_a":"I thought Its name was Michael","post_message":"Michelle Obama could be running for president.  This is a joke. She needs to keep her mouth shut.  Do you agree Michelle Obama is a joke?"},{"comment_id":"10153321708401955","commenter_b":"She does have Huma.","commenter_a":"Even Hilary needs a man once in a while !","post_message":"Hillary allows men at 'women-only' event amid weak turnout..."},{"comment_id":"1082800578422029","commenter_b":"She can squat but that don't put bread on the table!","commenter_a":"who makes up these polls for you ?","post_message":"BREAKING"},{"comment_id":"444744122316849","commenter_b":"YES IMPEACH Obama and his Administration","commenter_a":"The state of affairs in America is so sad. All about obama.","post_message":"Did President Obama do this on purpose or could it have been by accident?"},{"comment_id":"978703995520079","commenter_b":"And so does everyone else or they would not even bother if they did not","commenter_a":"The comments are always good for a laugh. You put up something positive & life affirming & there are sad, silly people feeling sorry for themselves who bad mouth it because it came from a successful actor. Ever wonder why he's successful? Maybe he had the right attitude & didn't blame all his problems on someone else!","post_message":""}]
