[{"comment_id":"10154474961664062","commenter_b":"And please don't be a coward and read my msg and don't reply...I wanna know your comeback and actually be real about it...","commenter_a":"I'm sure it was taken out of context by the biased media","post_message":"\"You've got to see this guy.\" He then ridiculed Kovaleski's appearance by bending his wrists and jerking his arms around."},{"comment_id":"1202278743181685","commenter_b":"Lots of estrogen.","commenter_a":"Causation or correlation? Lol","post_message":"Men Supporting Hillary Clinton Have Lower Testosterone"},{"comment_id":"10153594324081336","commenter_b":"These animals should be disposed of! Don't waste the tax-payers money on public defenders, trials and a life in prison!","commenter_a":"This animals need to be caught and put away for life!","post_message":"The Lash family had just returned home from vacation when a group of teens came to the door and asked to borrow a jack for their car, then tried to force their way into the home."},{"comment_id":"10156282327890294","commenter_b":"screw u u hateful witch\\\\","commenter_a":"Society isn't the problem. Men dressing like women and visa versa is the problem. Also, walking in to traffic is a problem. Don't walk in to traffic. Don't blame other people for your actions.","post_message":"“From a very young age I was told that people like me are freaks and abominations, that we are sick in the head and society hates us. This made me hate who I was, \" she said in the post.    She asked others to share her story and said, \"Please help fix society;\" then she did something heartbreaking:"},{"comment_id":"10154889313644411","commenter_b":"Well hes planning to shut alot of military bases around the world, and hes said hes not paying into nato waist of money he said, at the end of the day we all have to wait and see what hes going to do, you never know he might do a better job than all the other so called politicians in the past.....see how","commenter_a":"He has a point, and America needs a business man to balance the books and help the American people.","post_message":""},{"comment_id":"10153969418599575","commenter_b":"Mike Carter was it ever great? Living on credit was the way to create happiness, no one is talking about the pitfalls!","commenter_a":"None of the other Candidates are even mentioning Veterans! They have already had 6 Debates. I am going to watch the other channel and vote for Trump!","post_message":"Donald Trump is going to skip Thursday's GOP debate.   “We’ll have an event here in Iowa, with potentially another network, to raise money for wounded warriors,” he said. “And Fox will go from probably having 24 million viewers to about 2 million.”"},{"comment_id":"1157451387627650","commenter_b":"Another sidetracking trick.","commenter_a":"Ah yeah. That should do the trick.","post_message":"OBAMA'S NEXT MOVE TO SCREW AMERICANS and protect illegal aliens...  @webpagelink"}]
