[{"comment_id":"653037578220154","commenter_b":"We always saluted the flag every day at school. And sais the Pledge of alligence. Also prayed.","commenter_a":"YOU CANT BE SERIOUS !!!! RULED AGAINST' THE AMERICAN FLAG ???? NO WAY IN HELL SHOULD THIS HAPPEN !!! NO WAY !!!! .","post_message":"The court has just ruled against the American flag.  This is un-American. We stand for the flag forever and always.  Can we get 30,000 'LIKES' for the American flag?"},{"comment_id":"619138891610023","commenter_b":"that alright. She can just leave the white","commenter_a":"Just shut up","post_message":"Michelle Obama wants America's sympathy for all that she has to put up with.  Nobody cares. What a joke.  Do you agree Michelle Obama should keep her mouth shut?"},{"comment_id":"1723070871241628","commenter_b":"The Republican party better start listening, the real American People are speaking LOUD AND CLEAR!!!! WE WANT DONALD TRUMP!!!!","commenter_a":"Trump 2016!! The GOP is fighting for his failure, they should unite and back our choice. We need a smart President with common sense can build and secure borders, create jobs and a better future for the USA and puts the American people first. That man is Mr. Trump, lets do this!","post_message":"Thank you AMERICA! So grateful for your support- as we work EVERYDAY to MAKE AMERICA GREAT AGAIN! En route to Wisconsin now!"},{"comment_id":"592533384204588","commenter_b":"Matt, she's just another dumbass liberal !!","commenter_a":"TRUMP THE GREAT {ONE AWESOME GUY }","post_message":"Trump: \"We must replace the present policy of globalism....and replace it with a new policy of Americanism.\" How do you feel about this?"},{"comment_id":"934836243223515","commenter_b":"Take the cop dick out of your mouth, June. It's not a good look for you.","commenter_a":"This is ridiculous! Officers, please forgive the Mayor for having a more \"balanced\" perspective, because of the diversity of his family. He is in a unique position to be able to \"see both sides.\" It would behoove you, officers , to learn something from him and his family!","post_message":"America has told the NYPD in no uncertain terms that using a funeral to make a political point is not okay, and they just did it again."},{"comment_id":"1234200423314954","commenter_b":"Yes they are I seen it. \"All white people to the back of the line\"","commenter_a":"It is! People need to get over it. Standing on freeways and burning buildings is not the answer!","post_message":"Do you support or oppose anti-Trump protests?"},{"comment_id":"1328759877154299","commenter_b":"Karen >>> Integrity is not exactly an attribute of the Leftists. BIRDS of FEATHER, flock TOGETHER!","commenter_a":"My message to these \"journalists\". I don't care if you're talking about Trump, Obama, Clinton, or aliens. Using that kind of language is a disgrace to your job, which you obviously don't deserve. Your blatant disregard for any kind of integrity obliterates any credibility or respect you had with me. If you expect people to listen to you, make your use of language worth listening to or find another career that better employs your lack of ethics, if such a thing exists. Good luck with that.","post_message":"If a journalist said this about Barack Obama, the collective outrage from the press could be measured on the Richter scale."}]
