[{"comment_id":"818380371637006","commenter_b":"These women supporting Hillary are the most delusion bunch I have ever encountered... I'll leave this video of a woman providing facts about Hillary, so that you know just how delusional to are, and if you still support her after watch this video, you are just as bad as she is. ALL WOMEN SHOULD WATCH THIS BEFORE VOTING FOR HILLARY CLINTON: @webpagelink","commenter_a":"I was delighted and elated to put my vote for y-o-u Hillary! Ive been waiting for this moment and plan to bake cookies to celebrate your election. Much love kindness snd goodwill, Jean","post_message":"\"Get this Donald: Nasty women are tough. Nasty women are smart. And nasty women vote.\" —Elizabeth Warren IWillVote.com"},{"comment_id":"10153089934495329","commenter_b":"Nasty ass hoe lol","commenter_a":"Dude this is so fucking ugly @username @username","post_message":"NSFW, obviously."},{"comment_id":"10153919484005950","commenter_b":"I'm not copying, I'm telling the truth. You also look like a witch. It's catching.","commenter_a":"Angelina ruined him once, now she's trying again. She should have kept her man eater claws out if his first \"real\" marriage. I swear, I think she's a dark witch, casting dark spells.","post_message":"The LAPD released a statement to Entertainment Tonight to clear up reports that they were investigating Brad Pitt for allegedly being physically and verbally abusive with one of his children."},{"comment_id":"10153404609274170","commenter_b":"I use roaches. She is like a roach, nasty.","commenter_a":"Good news here .. 57% *of* 47% only comes to 26.69% overall. This places me among the 73.31 who think she's a lying skunk (and those are her good points).","post_message":"53% of voters say Hillary is not trustworthy. ...But 57% of Dems still support her.  Why?"},{"comment_id":"10153400875176833","commenter_b":"my Vote WILL NOT BE FOR HER!!! I want to Keep the Constitution. We she get in the white house you can kiss this Country and are Constitution good bye..","commenter_a":"Where's sirhan sirhan when you need him ?","post_message":"Never mind all the rhetoric about how Hillary Clinton can get the Democrat Party presidential nomination because some fringe elements don think she radical enough. The Hill reports that  for gun control [an increasingly fringe group in their own right] have high hopes for Hillary Clinton presidential run, seeing her as  ally who can finish the push for tightened background checks that has stalled in President Barack Obama second term.  Indeed, Clinton has been a vocal gun control supporter for more than 20 years."},{"comment_id":"1029984087043663","commenter_b":"Lying Bitch!!","commenter_a":"Now that Hillary has come up with the idea of barking like a dog if a Republican or Bernie lies,I think its a super idea and should be applied to her. The problem is if you barked at her everytime she lied it would sound like a pound and never stop!","post_message":"Hillary claims she's always tried to tell the truth to the American people - but I think many of them would beg to differ...  Do you think Hillary Clinton has been dishonest?"},{"comment_id":"10152854969571051","commenter_b":"Let behead these scumbags..What the F**k is wrong with people..Your parents should get their asses kicked","commenter_a":"Tell me where they live. I'll do the rest...","post_message":"These teens beheaded a puppy with a machete and posted the video to Snapchat. Then they picked up another puppy and did it again. And they didn’t stop there."}]
