[{"comment_id":"10153588995871943","commenter_b":"With her I the White House nothing will change. Don't forget we will get a sexual predator along with her. What a deal.","commenter_a":"I WANT TO KNOW WHY - OUR PEOPLE WERE ABANDONED?!!! Just like Clinton's hubby refused adequate forces for BlackHawk Down - I'll NEVER get the images of OUR PEOPLE BEING DRAGGED THROUGH THE STREETS.....NEVER. That's the REAL RECRUITING Message: \"America is WEAK!!!\"","post_message":" Obama administration and Clinton officials hid this compelling Benghazi email for years, said Judicial Watch President Tom Fitton.   The email makes readily apparent that the military was prepared to launch immediate assistance. The fact that the Obama administration withheld this email for so long only worsens the scandal of Benghazi. Please SHARE!"},{"comment_id":"1157488834340407","commenter_b":"I thought she was leaving. No one cares what she says","commenter_a":"She lies as much as killery","post_message":"Miley Cyrus, a Hillary Clinton supporter, is extremely sad."},{"comment_id":"10154426729152446","commenter_b":"Wtf. Who do they think they are. Little unqualified woman","commenter_a":"wth???","post_message":"@webpagelink"},{"comment_id":"10153248513449087","commenter_b":"Stupid liberals so hope you run that old white socialist ass wipe.","commenter_a":"and democrats blame all the world's problems on Republicans, you old fart shut up","post_message":"\"In their world, every problem that you can possibly imagine is caused by Barack Obama,” Bernie Sanders quipped at a campaign rally in Boston. \"If there is rain, if it’s too hot, if there’s a mosquito in the room, it is all Barack Obama.”"},{"comment_id":"1038851362838059","commenter_b":"Merry Christmas from your Muslim neighbors! Fighting for #AmericanUnity Like us on FB #AMOT American Muslims in Opposition of Terror","commenter_a":"Merry Christmas, Hillary & to your family!","post_message":"Can't think of a better day than one with family, food, and the best gift of all: a new grandchild on the way! Merry Christmas. -H"},{"comment_id":"1789900814667772","commenter_b":"She needs to leave this country ....POS !!!","commenter_a":"Idiot!","post_message":"Actress and activist Ashley Judd delivered harsh words aimed at President Trump from a poem written by a 19-year-old girl from Tennessee."},{"comment_id":"10153823736048128","commenter_b":"Gee Rickie: thanks for clarifying this And, I know my geography idiot; I was referring to Europe in a cultural sense. Did you forget to take your Autism meds Rain Man? By the way, we thick Yanks haven't allowed an invasion of Muslims into our Country on a scale no where near proportional to your own Country. Your Nation is finished you morons! So, go choke on a hookah you snarly toothed Lime!","commenter_a":"Why bother at this point when they are allowing millions of Islamists to openly invade Europe?!?! Seems like an exercise in futility or just some good media PR to appease scared & irate native Europeans.","post_message":"Authorities in Italy, Germany, Switzerland, the U.K. and Scandinavia searched 26 premises and seized electronic devices and documents."}]
