[{"comment_id":"865398446828911","commenter_b":"She got what she got! Gee if you talk back to the KING media anymore you get taken down!!! Shut up Savannah!","commenter_a":"Certainly not unbiased. It's wrong, but not shocking at all that the so-called journalists have an agenda. I don't think Rand Paul was being sexist or rude at all. On the contrary, I think he was polite considering. He simply didn't let her tank-roll over him. I loved it!","post_message":"Liberal media is NO MATCH for Rand Paul!  Watch him completely DESTROY NBC host who tries to put words in his mouth!"},{"comment_id":"10154080413671162","commenter_b":"You must be a star chaser or useless female cop.","commenter_a":"What a bunch of ignorant aholes....do me a favor and NEVER CALL THE COPS to help your pathetic selves...none of you are worth it....all loser thug scum bags","post_message":"Police say they were trying to pull a car over when it smashed into their patrol SUV in the Loop."},{"comment_id":"738344672965380","commenter_b":"They'll never get in!","commenter_a":"I wouldn't say he told Obama off...more like explaining the way of things in Radical Islam...because that moron needs to have it explained to him...2016...get here quick!!!","post_message":"Ohhhhhhbama."},{"comment_id":"10154425900258366","commenter_b":"There is no wall","commenter_a":"Who f****** cares. Now it will be a party. They're gonna roast him like never before.","post_message":"BREAKING: President Trump has officially announced that he will not attend this year's White House Correspondents' Dinner."},{"comment_id":"1182572491799444","commenter_b":"Mj we are talking about the ones that come here and are here illegally. You became a marine and I bet you did it the right way. Now we have a big problem with terrorist that are sneaking into all the countries. Sorry but we have to take care of all Americans first. You have to admit a country can only hold so many. Thank you for your service I am a vet myself so are my son and daughter.","commenter_a":"All these racist comments and generalizations. You should all be ashamed. I am cuban and came to the US. Im sure not many of you can say the same but i actually benefitted from government programs. I served our countries military as a marine, i hold three different degrees - accounting, finance and im a registered nurse- sonif an immigrant is taking your jobs then you didnt take full advantage of what the US has to offer, no just arrived unprepared laborer will ever take any of thoae jobs from me. I love thia country but i hate people like you that put down immigranta that only want to make a better life for themselves and family. You are whats wrong with the US today!","post_message":"Right?"},{"comment_id":"1219528801419908","commenter_b":"^^^dumb bitch","commenter_a":"The one and only way it could have been prevented was if he complied with the officers instead of resisting after being tasered twice and thrown to the ground.","post_message":"CASE CLOSED....  @webpagelink"},{"comment_id":"10157276340925354","commenter_b":"Round up every muslim ship them home unless they are legal immigrants that speak english and have a job and no ties to isis otherwise build a wall shoot everyone of them that comes into the u s","commenter_a":"Vote Billary or Bernie for more lies, deceit, corruption,treason, gun control, Homophobia under Islam and 4 more years of obama. Almost forgot no more Country Girls having fun in the water. Cowboys, Liquor Stores, Smoking Marijuana are next. NOTE: Comments protected under the 1st Amendment.","post_message":"VIDEO:"}]
