[{"comment_id":"1409042789109576","commenter_b":"@username no they didn't. Both were smart enough to use classified systems to access classified information...","commenter_a":"The problem is that his supporters are not intelligent enough to care about any of this. The one true thing he has said is that he could commit a murder in Times Square and his supporters will still support him. That's why he panders to the low intellect crowd.","post_message":"ALERT! Yet another corruption scandal threatens the whole Trump family."},{"comment_id":"10152991363976336","commenter_b":"We know what we have to do!So what's the holdup !! Being our borders are wide open where just gonna wait till it starts in America! The longer this builds the harder it will be to totally defeat!","commenter_a":"Well, we could talk about why the government is giving Tonto National forest to a foreign mining company. Gold?","post_message":"Attorney General Eric Holder lashed out at Fox News, defending the Obama administration's reluctance to say \"Islamic extremism.\"  \"If Fox didn't talk about this, they’d have nothing else to talk about,\" Holder said."},{"comment_id":"364315750438606","commenter_b":"Orrrrrrrrrrrrrrrr, build a big wall around it and let in any idiot who wants to live like an animal.","commenter_a":"Solution for Baltimore. Dismantle the police department and incorporate law enforcement into the Department of Social Services. Terminate all police officers. Fund the law inforcement portion of social services with Federal dollars. Social Services pay gang members $100,000 plus benefits and pension to each gang member, no identification or proof of residence required. Pay each adult $500,000 for new housing or relocation. No identification or proof of residence required. No follow up for use of housing fund. Encourage business owners to allow no cost to their merchandise (free) .","post_message":"Democrat Candidate for Senate in Maryland Blames Republican Governor for Baltimore Education Problems"},{"comment_id":"10153189105981336","commenter_b":"The pansies out there today would be a total embarrassment to this country. They would all turn tail and run. No backbone, no moral compass, no strength and no sense of reality. I blame the coddling society and the progressive liberal media.","commenter_a":"start the draft back up ...let these boys do a few years in the service","post_message":"Frat boys from the University of Florida and Emory University have been accused of urinating on an American flag, spitting on a vet and a service dog, and making derogatory comments toward veterans’ wives.  And that was just the beginning…"},{"comment_id":"10157033906465725","commenter_b":"STOP Crooked Hillary from winning the general election! Together we can turn this country back around in the right direction by getting out and voting! TRUMP 2016!","commenter_a":"NO way!!!","post_message":"It is so important to get out and VOTE in 2016. Crooked Hillary Clinton cannot be our next POTUS! Senator Jeff Sessions just warned, \"This will be the end of law in America.\" Get out & VOTE TRUMP! We will MAKE AMERICA GREAT AGAIN!"},{"comment_id":"984777404931920","commenter_b":"Our weak border has made Mexico Drug Cartel stronger and made Mexico's government weak with corruption. Mexico has some of the most beautiful beaches in the world that are controlled by some of the most deadliest drug cartels. Mexico is losing billions in tourism because of the Cartel. Mexico is a culturally rich country that is being destroyed by these drug cartels. By building this wall it will help both the Mexican and the American economies by stopping drug trade. The Cartels will lose many because supply will be cut of and Mexico will gain strength. 95% of illegal drugs that come across the border will be stopped by a wall. It will in turn save our communities and our youth. Our youth will be able to flourish instead of turning to drugs. Americans will no longer have to depend on Liberal Politicians asking for help, they will be able ...","commenter_a":"Take away handouts and people committing welfare fraud and put them to work. Seems like there's quit a bit of places hiring where I live. I do believe trump is our our hope and is the best choice for president. Bernie is a joke and Hillary is a liar.","post_message":"I will bring our jobs back to the U.S., and keep our companies from leaving. Nobody else can do it. Our economy will \"sing\" again."},{"comment_id":"10153198531370950","commenter_b":"Yes, she was just hoping some cop would come in and throw her across the room. See how stupid that sounds?","commenter_a":"def smell a get rich quick scheme in the works :( ugh ...........it was all her own damned fault ,,,,,,,,,,,no payment is deserved !!!!","post_message":"\"She now has a cast on her arm, she has neck and back injuries. She has a Band-Aid on her forehead where she suffered rug burn...,\" the student's attorney told ABC's \"Good Morning America.\""}]
