[{"comment_id":"1022408774478552","commenter_b":"Why is she walking free?","commenter_a":"since when can a low life irs agent speak with the doj,fbi to cause harm to a tax payer","post_message":"Jaw-dropping abuse of power:"},{"comment_id":"573149506180643","commenter_b":"They don't get nearly enough credit. Donald is right....stop them from entering the U.S. temporarily. We are in danger.","commenter_a":"Obama will probably have him fired for roughing up a terrorrist.","post_message":"Federal Agent Risks Everything To Stop ISIS Terrorist Disguised As Refugee From Setting Off Bomb In Texas  This man is a hero. Let's show him our support.  Can we get 50,000 'LIKES' for this federal agent?"},{"comment_id":"10152864481646336","commenter_b":"Zeke...you're the kind of kid that gave the bully in school your lunch money every day thinking it would make him like you. Never worked did it. This is a religious war. It's in their unholy book and no amount of appeasement will fix them. Their founders motto was \"CONVERT or DIE\". This is simple stuff. Read it. Understand it and don't give in to it. I admire the cartoonists for their bravery. That COEXIST bumper sticker should be pulled off every car on every liberal college campus and off every Subaru in liberal Minnesota and sent to some Islamist nation. We coexist VERY well. Our early settlers didn't kill the Indians who didn't convert. Our Founders didn't work that way either. We are not the ones who need the lecture. We wrote the book on getting along. They don't care to read it.","commenter_a":"Dear Muslims....COEXIST.... Or get out... or else.","post_message":"They were four of France’s most fearless and best known political cartoonists – all sought out and summarily executed by gunmen in Wednesday's massacre inside the offices of #CharlieHebdo: Stephane Charbonnier, Georges Wolinski, Jean Cabut and Bernard Verlhac."},{"comment_id":"1589593461282497","commenter_b":"What a dork...........","commenter_a":"This guy is putting himself in the same catagory as Trump when he talks this way about anyone. He could have made his point without all the cursing.","post_message":"The very end is the best part.  Thanks to The Liberal Redneck. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153290694163279","commenter_b":"Shut up.","commenter_a":"@webpagelink David W. Blight described the day: This was the first Memorial Day. African Americans invented Memorial Day in Charleston, South Carolina. What you have there is black Americans recently freed from slavery announcing to the world with their flowers, their feet, and their songs what the war had been about. What they basically were creating was the Independence Day of a Second American Revolution.","post_message":"As part of our Memorial Day special, watch this speech by former Rep. Pat Schroeder recorded at the conference, \"Vietnam: The Power of Protest.\""},{"comment_id":"10152949136921130","commenter_b":"Instinct ?most times women don't know what they want","commenter_a":"This is why women are usually attracted to them. It's instinct. Beard equals protection and strong genes. Science is fun.","post_message":"It's just evolution."},{"comment_id":"10153198327501051","commenter_b":"Love the whole idea!!","commenter_a":"They have French one's in Canada","post_message":"Are you okay with requiring all businesses to conduct their dealings in English only?"}]
