[{"comment_id":"10153524858391130","commenter_b":"I think the border should be closed to everyone until there is no violence in the USA! Or at least get it under control! There's gangs, rapist and terrorist roaming the streets! People under the fly alert were able to purchase guns yet half of American's aren't aloud to! Smh This government needs an overhaul, the system needs an overhaul!! People are homeless, going hungry and much more yet we still allow people in and they get free food, clothing and housing? Come on now!! This is suppose to be a place for dream's & opportunity!! USA has lost everything it built!!","commenter_a":"how is being again Islam racist ? it's a religion not a bloody race,,ban all organised religion,, there all fucking nutters","post_message":"Trump wants a \"total and complete shutdown of Muslims entering the United States.\""},{"comment_id":"1668611910083188","commenter_b":"She ain't done nothing I wouldn't have done. I do not think any red blooded American should have to put up with this nonsense!!","commenter_a":"Stacey said what we all think, good for her.","post_message":"Stacey Dash has been suspended by Fox News for saying this to Obama. She needs our support. Should Stacey Dash be reinstated?"},{"comment_id":"1259980317411527","commenter_b":"That says alot about him.... smh. He hasn't given any serious amount of attention to our military and now he wants them to turn on the new commander in chief. #HURRYUPJANUARY#","commenter_a":"Will be so glad when POS OBAMA is GONE!!! WORST President EVER!!! A racist TRAITOR!!!","post_message":"OBAMA TELLS TROOPS To Rise Up Against Trump…Protest His Authority…Feel Free To Criticize Him [VIDEO]  43 more days..."},{"comment_id":"10154048881589753","commenter_b":"They both need to be charged she was sorry as hell to let him do that your kids come first","commenter_a":"I sure hope they don't place that child back with her. Lock her up until she is too old to bear any more kids. Where are the Fathers nd Grandparents of these abused kids?","post_message":"An Arkansas mother and her boyfriend were taken into custody and charged with first-degree domestic battery after the woman’s four-year-old daughter was found zip-tied to her bed, reports KTLA. Jennifer Diane Denen, 30, and her 47-year-old live-in boyfriend, Clarence Eugene Reed, both residents of Hot Springs, were taken into custody last week after a staff member at the Cooper-Anthony Mercy Child Advocacy Center found Denen’s daughter to be severely malnourished and abused, according to The... @webpagelink"},{"comment_id":"10153514058971336","commenter_b":"We are all illegal one point American got started by illegals","commenter_a":"13 million illegal aliens keep me up at night.","post_message":"Attorney General Loretta Lynch said that a cyber-attack by the Islamic State is perhaps the terror group’s biggest, emerging threat."},{"comment_id":"895405060572025","commenter_b":"Just like that nut","commenter_a":"Looks to me Democrats are pretty scared of Trump and that way they send these people to his campaigning events and start up problems, fights in crowds. Democrats can't play fair cause they know they are not going to win people are tired of being lied to and their rights being striped away...people this is a wake up call!!!! If you value your freedom you better dig deep in who your voting for...because all Democrats are trying to take our rights away!!!","post_message":"This is hilarious.  Video by the Canadian comedy show 'This Hour Has 22 Minutes.' Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153412861986167","commenter_b":"A bunch of false prophets and their followers, sickening.","commenter_a":"First of all, for those who wish to criticize my typos complain to google translate. I'm dictating this and I don't have time to go back and correct typos. When it comes to SOCIAL ISSUES, topics like gun control, abortion, gay marriage etc voters who latch on to these things miss the big picture. The big picture involves having a viable economy in which to have debate about social issues. An economy cannot survive on social issue focus. It is a fact that 70% of all entitlement Dollar goes to bureaucrats not to the poor. @webpagelink To this day paychecks from the government are being dispersed to illegal immigrants, prisoners and dead people. There are perhaps hundreds to thousands of programs that have been budgeted by the government which always end up taking longer to implement and always cost more than expected. Under Hillary Clinton and Obama, six billion dollars ...","post_message":"He also thanked the star of Duck Dynasty."}]
