[{"comment_id":"1751204798479851","commenter_b":"thiswoman has onebrain cell and it dont work","commenter_a":"If Nancy had a brain her Face Lift wouldn't Sag So b","post_message":"Nancy Pelosi blasted her Republican colleagues for not taking action on gun control, saying after every shooting there is a moment of silence, which means nothing without action. Pelosi states \"a moment of silence just left there is a moment of denial.\" Do you agree?"},{"comment_id":"10153134788679411","commenter_b":"Punk assed bitch!","commenter_a":"Blah! Blah! Blah!","post_message":""},{"comment_id":"10153782621653869","commenter_b":"That's been exactly the narrative. It's about time for a woman president. There's a special place in hell. Bernie girls are just boy-crazy. It's her turn. Thou shalt not question Her Inevitability.","commenter_a":"The media have been crowning her daily since 2015. Your daily reminder that at this point in 2008, her backers (motto: \"Party Unity My Ass!\") were still promising a bloody floor fight at the convention and demanding she be awarded all the illegal Florida delegates. Something to remember when you hear Hillarrhoids calling for you to \"line up behind her.\"","post_message":"Today's Daily Cartoon by Kim Warp. See more cartoons with our randomizer: @webpagelink"},{"comment_id":"763958360369439","commenter_b":"A child should not have that choice any more than she can legally choose to smoke and drink.","commenter_a":"With all the people out there fighting for a woman's right to make choices for her body (abortion and birth control) how can you justify forcing medical treatments on someone? Either a person has total control of their body or they don't. Can't have it both ways.","post_message":"After treatment, she's in remission."},{"comment_id":"10155182978984369","commenter_b":"We are animals no different then lions killing each other in self self-defense. i believe killing for money power drugs and such is a sin. Killing for self-defense would be justified","commenter_a":"A few people on here are saying that a gambling debt or drug debt isnt a good enough reason to kill someone. Maybe not for you but obviously a good enough reason for someone who kills...","post_message":"NEW INFO: The victim girlfriend told investigators she drove her boyfriend to the location of the shooting to collect on a Super Bowl bet and when he exited the vehicle, he was shot"},{"comment_id":"891235850923043","commenter_b":"She is such a disgusting, hateful, ugly hag!","commenter_a":"Democrats are ALREADY on record favoring abortion AFTER birth.","post_message":"Unreal.  So the Supreme Court's imposed policy of abortion-on-demand for the full nine months of pregnancy isn't enough for Hillary?   Enough is enough.  Sign the petition to defend unborn babies from radicals like Hillary! Click here! @webpagelink"},{"comment_id":"10153117989439342","commenter_b":"Stfu","commenter_a":"Why is this breaking news??? So what!! You glorify more sin than good!! Tell the world about Jesus!! Stop caressing this foolishness like its normal! I see why God clearly warned us not to be of this world!!","post_message":"The first image of Caitlyn Jenner, formerly known as Bruce, has been released by Vanity Fair magazine --> @webpagelink"}]
