[{"comment_id":"10154672765359760","commenter_b":"Why? Ugly horse face bitch!","commenter_a":"Hell No! She didn't belong there in the first place. Garbage.","post_message":"Michelle Obama was loved by millions of people around the world as First Lady. Do you miss seeing her in the White House?"},{"comment_id":"10154429082261378","commenter_b":"Yes...fix her a$$...so she can't bring any more babies in the world...","commenter_a":"Yes","post_message":"A judge ordered a drug-addicted mother of 4 who has worked as a prostitute not to get pregnant again. Is this order fair?"},{"comment_id":"907300286012867","commenter_b":"She gives blondes a bad name.","commenter_a":"There's no such thing as liberal intelligence","post_message":""},{"comment_id":"10154231827133797","commenter_b":"How you like them bad apples","commenter_a":"So all of you WANT another war? The Obama hate is getting really old. Let me guess. Your all republican wealthy suburban mini van driving ,entitled Starbucks drinking pricks. I like how you alllll forget Bush's presidency. By far the worst president. Ever.","post_message":"OBAMA ADDRESSES PARIS ATTACKS: President Barack Obama says putting large numbers of U.S. troops on the ground to combat the threat from the Islamic State would be \"a mistake.\""},{"comment_id":"10152701811618067","commenter_b":"What about Asians! We have more wealth than whites! ;)","commenter_a":"CNN thought process: Pot? Check. Ladle? Check. Add racial mixture. Add perceived racial sleight. Stir vigorously. Serve on CNN Special, \"[fill in gap] in America\"","post_message":"The latest report about financial inequality makes for uncomfortable reading... @webpagelink"},{"comment_id":"10153697709133984","commenter_b":"He'd never make it to prison if that was my daughter or granddaughter. But since he will hopefully go to prison, its a shame someone never showed him an illustration on a blackboard about the size of your asshole before prison and the size it is when/if you get out. Maybe he would then have had sense enough not to rape a child. When he goes to prison he's going to find out what real rape is like...good.","commenter_a":"Castration sounds good to me. He wouldn't do it again","post_message":"This sick punk raped a young girl and admitted to it... but the disgusting thing is his absurd excuse.  Our country is in deep trouble and this proves it... this little girl did nothing to deserve this."},{"comment_id":"10154040772674778","commenter_b":"You're an idiot and idiots should not reproduce!","commenter_a":"Same sex marriage is not about love....it's about lust and sex...and it's nasty","post_message":"Here's the final paragraph of the Supreme Court decision legalizing same sex marriage across the nation. @webpagelink"}]
