[{"comment_id":"10154343776387061","commenter_b":"@username , just wait till he is done,The Republican Party!","commenter_a":"He was a great president, didn't help republicans but republicans don't help democrats. I'd like it if people met in the middle more rather than so far right or left. Obama is professional, polite, and articulate none of that fits Trump. And now that the new Trumpism is \"Alternative Facts,\" I am concerned.","post_message":"A look inside the Washington, D.C. residence the Obamas are moving to: @webpagelink"},{"comment_id":"10153302141658812","commenter_b":"women wearing tuxs are on fashion runways @webpagelink so why can't she wear one?","commenter_a":"Every single girl should show up in a tux, and every single guy should show up in a dress.","post_message":"Principal says gay student can't wear tuxedo to prom. @webpagelink"},{"comment_id":"10153561023428984","commenter_b":"Go back home you stupid little bitch!!!","commenter_a":"Twitter Bomb her page till she leaves! REMOVE ALL of the spoiled \"idols\" your kids listen too, that say they Hate the Country that gave them the Opportunities to influence them!","post_message":"Globally known, pop-star diva Ariana Grande just told the world that she hates America... so karma just got its PERFECT revenge.  Her snobbery and selfishness are famous so this is not a huge surprise... she deserves what she gets."},{"comment_id":"867849870028244","commenter_b":"I love this video! I can't stand the woman!","commenter_a":"Donald J. Trump should play, over and over, when she said, 'What difference does it make now?\" - regarding Benghazi. !!","post_message":""},{"comment_id":"10154033103686065","commenter_b":"he is just telling it like it is....and i am him now","commenter_a":"On point and going after the media . Media is so bias and they are being called out for what they are.","post_message":"What do you think?"},{"comment_id":"1042018525819158","commenter_b":"This ladies dumb AF","commenter_a":"It should have been there when it could have helped my husband before he died. It doesn't matter much now whether they develop it or not. It can't help him now.","post_message":"A breath test for lung cancer could be on the horizon."},{"comment_id":"10154357824606037","commenter_b":"Trump doesnt want muslims in the US..period..so","commenter_a":"Trump... ISIS...Today","post_message":"A man armed with guns and explosives told police he was in the area for West Hollywood's gay pride parade."}]
