[{"comment_id":"467972453396342","commenter_b":"I love it Sloths are so cool","commenter_a":"Lindsey Miller we can quit school","post_message":"This is just too cute for words."},{"comment_id":"1044665095680389","commenter_b":"Women wouldn't exist without men we build your houses your roads your public offices we farm the food etc etc shut the duck up ungrateful twat your couldn't survive 2'days in the wild without a man to hunt or scavenge for you","commenter_a":"I love this. If a man posted a picture of a cup that said \"tears of women\" or some other bullshit these women would be up in arms. Ridiculous.","post_message":"so this I guess is a thing now???-mo  Shop.tacticalshit.com"},{"comment_id":"10153035798681336","commenter_b":"Do you support PETA? They are know as animal killers! And it's part of their manifesto!","commenter_a":"I don't support circuses just for the reason that they are notorious for abusing animals.","post_message":"Ringling Bros. and Barnum & Bailey Circus will phase out the show's iconic elephants by 2018 because of growing public concern over how the animals are treated."},{"comment_id":"1163546927012391","commenter_b":"Janette Smith just wow I can't even!! U are delusional do u have kids? I hope not","commenter_a":"I hope he escapes.","post_message":"MISSING: Louis Dean Rende, 12, has run away from his Spring Hill home. He is 4-foot-6, and was wearing a red or orange shirt, dark shorts, and might be wearing hiking boots. He has a scar above the right knee. If you see him please call 911 or the Pasco sheriff at 727-847-8102. Leave a tip at 800-706-2488."},{"comment_id":"578454362315144","commenter_b":"Jesus look at that horse mouth...damn that is one ugly woman","commenter_a":"I wonder if Chelsea knows the blood that comes with that Money?","post_message":"The hypocrisy is thick..."},{"comment_id":"10154074344751336","commenter_b":"You're an idiot.","commenter_a":"It looks like the liberal PC police culture have hit the Miami police department. Their feelings are hurt so they will be boycotting Beyonce by not doing their job. We need to make sure to send enough panties for them to wear so they can cry comfortably at the boycott. Our officers used to have thicker skin than this. This is a sad day in America when our police officers are crying and boycotting for hurt feelings.","post_message":"Usher, Demi Lovato, Yolanda Adams and The Band Perry are among the contemporary artists heading to The White House to celebrate the late Ray Charles."},{"comment_id":"1050118365055120","commenter_b":"I couldn't even watch, turned the channel. Didn't need to hear another black actor bitch!","commenter_a":"Too bad there was not a black actor or actress that was good enough to be nominated or win a oscar!!!!!","post_message":"Well, Chris Rock didn't hold anything back. What did you think of his monologue?"}]
