[{"comment_id":"741319736029564","commenter_b":"@username. That's ridiculous.","commenter_a":"It's just sad. Sad. You are more worried about getting the United States into a war than you are taking care of the people of your own state. @username - makes a great point why, why Tom do you keep opening yourself up to this and then turning around and bragging about Trump being as good as his word. That's worked well for this country so far hasn't it?","post_message":"The president said we were putting Iran on notice, and I'm glad to see he's as good as his word. Iran's ayatollahs will stop their provocations only if the U.S. shows strength and resolve. These sanctions are long overdue, and they're sending the right message to the regime in Tehran: Cease and desist immediately."},{"comment_id":"10152730591461545","commenter_b":"^^Is there some kind of cream for that you think? LOL","commenter_a":"Just because it's on paper doesn't mean it is acceptable to God. Period.","post_message":"Sarah Goodfriend and Suzanne Bryant became Texas' first same-sex couple to receive a marriage license this morning. This is them speaking at a press conference in Austin.  MORE: @webpagelink"},{"comment_id":"10154307174989411","commenter_b":"the reasons for building a wall are based on racism. Migrants dont steal jobs, dont increase crime, and create more wealth for everyone given the correct conditions. only reason to appose migration is fear of differences.","commenter_a":"Think the candidates suck? vote libertarian. check out Gary Johnson. Some socialists might not get it at first but its really the political party that represents the most freedom. Are you for gay marriage? so are libertarians. Are you for smoking weed? so are libertarians. Are you against foreign wars of aggression? so are libertarians. are you against corporate collusion with the government? so are libertarians. Are you against too big to fail banks? so are libertarians. hold on republicans, theres stuff for you too. Are you for lower taxes? so are libertarians. Are you for property rights? so are libertarians. Are you for a business owners right to deny service to whomever he pleases? so are libertarians. are you for gun rights? so are libertaria","post_message":"#DropOutHillary: 300,000+ tweets"},{"comment_id":"751318988350209","commenter_b":"Wondering if Melania has to listen to the snorting every night in bed!!!","commenter_a":"Why doesn't he realize that he has this problem with his nose, which only appears at the debates and not at any other occasions.","post_message":"It's just allergies, right? Right?! --Andrew"},{"comment_id":"545764515614128","commenter_b":"Is she that dense ??","commenter_a":"If she was subjected to shariah law, she sold wished it never happen. Major mistreatment of women","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way.  What a disgrace. She needs to deported to the Middle East.  Do you think Nicole Kidman is a sell out?"},{"comment_id":"10152845458146336","commenter_b":"you must be of yourr meds you moronic female","commenter_a":"A million and a half babies aborted each year in the United States and we are horrified by this?","post_message":"Zookeepers were horrified to discover 5-week-old cubs had been killed and eaten by their mother."},{"comment_id":"884938878291056","commenter_b":"I'll fuck her up","commenter_a":"@username let matce do this she won't ever have that boy again!!!!!! I'll do everything in my power to get him from her","post_message":"Woman Checks A Mother Abusing Her Autistic Son At A Wafflehouse!"}]
