[{"comment_id":"784296501703530","commenter_b":"Gross! It smells like Hitler up in this bitch.","commenter_a":"Isn't this another thing he can be impeached for?","post_message":"BREAKING NEWS...."},{"comment_id":"10154979828776729","commenter_b":"Is a mean evil witch all she wants to do is kill us Americans in line her Pockets with more money how can she even be running for president? What is this country turned into?","commenter_a":"Bet she has an allergic reaction tonight !","post_message":"Holy cow!"},{"comment_id":"10154584084924166","commenter_b":"no more cover girl for me","commenter_a":"How stupid!","post_message":"The makeup manufacturer calls him a \"boundary breaker\" who will appear in an upcoming commercial. What are your thoughts on guys and makeup?"},{"comment_id":"10152868852711336","commenter_b":"I approve. What else should we call them? They are illegals.","commenter_a":"Americans should be able to freely shoot border jumpers no questions asked in protection of our country!","post_message":"A California newspaper will continue to use the term \"illegals\" to describe people who enter the U.S. without permission, despite an attack on its building by vandals believed to object to the term."},{"comment_id":"10154527348963352","commenter_b":"Kiss his ass","commenter_a":"I agree with him!","post_message":"RUSSELL SIMMONS GOES OFF ON OBAMA WITH NO KIND OF RESPECT! BASICALLY SAYS OBAMA AIN'T SH*T! (PHOTOS) @webpagelink"},{"comment_id":"10153631429237098","commenter_b":"Get your mind out of the gutter ladies.","commenter_a":"What a pig, No little girl's first introduction to sex should be with some slime like this.","post_message":"#BREAKING - The dental assistant was arrested over the weekend for allegedly molesting a sedated 8-year-old girl  Police say there may be more potential victims"},{"comment_id":"10155422567365615","commenter_b":"Assholes","commenter_a":"I hope Greg Abbott gets HIV.","post_message":"They say a budget is a document that turns values into money."}]
