[{"comment_id":"10153416828258525","commenter_b":"Sure hope he's single so girlfriend or wife don't wipe him out and leave him with nothing JS","commenter_a":"Paige Zirkle Calhoun","post_message":"$2 MILLION FLORIDA WINNER: Not only did the Sanford teenager match all five numbers, it was his first time playing and he used a play slip that he found that was already filled out!  STORY: @webpagelink"},{"comment_id":"10153757259492293","commenter_b":"It's really about saving cash if you don't need boxes remotes and other material it cheaper on your end but much cheaper for them","commenter_a":"Awesome! Tired of the wires and boxes! Yay!","post_message":"This could be a win-win."},{"comment_id":"10153396663904170","commenter_b":"She would HAMMER Hillary.. :)","commenter_a":"If Fiorina is blocked from the Republican debate in New Hampshire she should challenge Hillary to a debate there. Woman VS Woman. Hillary would never take the challenge, still the gauntlet will have been thrown.","post_message":"I love seeing GOP candidates use the media's \"gotcha\" questions to their advantage. Fiorina is turning it into an art form."},{"comment_id":"1701436866776634","commenter_b":"Tell hr to quit being one then","commenter_a":"PAC Lapdog","post_message":"You heard about the whole \"whore\" comment, right?  Well, after Dr. Paul Song said it, the hashtag #DemocraticWhores began trending..."},{"comment_id":"10154522993923854","commenter_b":"She's a crazy idiot!","commenter_a":"TIME TO END THE CLINTONS POLITICAL CAREERS NOW..","post_message":"IT TURNS OUT HILLARY CLINTON IS THE ONLY PRESIDENTIAL CANDIDATE WITH TIES TO THE KKK"},{"comment_id":"10152807177319753","commenter_b":"There's a lot that factors into our timely death. We can decide to die early. I.e. Suicide. And we can die cus of our own stupidity... Jumping off a building without a parachute. It can be because of health problems. But even with all these possibilities God is the one who truly decides when we go. That's why we have so many stories that are miracle stories. Ppl surviving when they shouldn't. And sometimes unfortunately we are taken so soon. The reason being that we are all here to serve a purpose on this world for God. And when we have done such... Then God brings us home. If you read her nieces comment she lived a fulfilling life. And what ever the reason may be she completed her life. Losing a loved one is hard. I have lost a dad, and seven friends and my own kid being 23. ...","commenter_a":"GOD MAKES NO MISTAKES. SHE DIED 7 DAYS LATER. THE NUMBER 7 MEANS COMPLETION. HER LIFE WAS FULFILLED. GOD MADE THIS DECISION. I SYMPATHIZE WITH THE FAMILY, HOWEVER GOD WILL MAKE SURE THOSE CHILDREN ARE LOVED THROUGH FAMILY AND ALL THAT LOVE HER. HER LEGACY CONTINUES THROUGH HER SONS.","post_message":"After 20 years of being unable to conceive naturally, the mother had spent a decade going through various fertility treatments in hopes of having children. After 30 long years, Lisa’s dream came true and she found out she was not only pregnant, but pregnant with twins. Unfortunately, the joy was short-lived, as she passed away just seven days after her babies’ births."},{"comment_id":"10153656490006107","commenter_b":"Mrs. Paul rocks!!!! Ron put down that economics book and take Carol to dinner!!!","commenter_a":"This election cycle by far has been the craziest one I've ever witnessed. The one question I can't seem to get an answer to is this,,, WHY??? Why are both sides attacking Trump? Why is China attacking Trump, Why is the pope attacking Trump? Why is Mexico attacking Trump? Why are the Republicans going against their own pledge and attacking their own front runner? Why is HilLIARy so afraid of Trump? Why does Trump have this Republican Party split? Why is Mitt Romney going after Trump? Why are the Koch brothers dumping in 75 million dollars to go against Trump? This isn't normal, something doesn't add up and we need to be smart enough to see through the the smoke and mirrors why they are quickly exposing themselves as the try to take down Trump before #SuperTuesday Here's my theory, it goes back to the age old question how to ...","post_message":"Happy Birthday to Carol Paul, an amazing woman, mother, and advocate for liberty. Thanks for making me the man I am today, Mom. Happy Birthday."}]
