[{"comment_id":"560732980781661","commenter_b":"GOOD, SHE IS SUCH A RACIST, GET HER OWN SECURITY.","commenter_a":"Good for them let her pay for the security and take a little less pay home...she'll get the message","post_message":"HAHAHA!!! THIS NEEDS 10,000 LIKES!!!"},{"comment_id":"10153248489871037","commenter_b":"Rob your a pussy.","commenter_a":"Hillary for Prison 2016","post_message":"A variety of sources in the Clinton orbit say they are anticipating an imminent announcement of #Hillary2016."},{"comment_id":"496246340568716","commenter_b":"She has been fired for lying / watergate mess -/ all she is corrupt lying old pruney bitch !!!","commenter_a":"Absolutely","post_message":"Hillary is now denying a MAJOR part of her original response to the Benghazi attack. It's unbelievable to think that she believes she can pull this over on the American people. Everyone needs to know about this...  Is Hillary Clinton unfit to be president?"},{"comment_id":"1699015597030344","commenter_b":"A no vote IS a vote - for the candidate you least want.","commenter_a":"Adding or not adding the next Scalia to the Court seems like something that will have pretty wide implications for the next couple decades.","post_message":"\"I'm not interested anymore. I don't see any immediate, significant changes happening. I don't see voting as a means to an end.\""},{"comment_id":"10154725073385935","commenter_b":"So many silent racist ppl out there that voted for him. It's so sad","commenter_a":"That's what you think you orange buffoon!!! #FuckTrump #Resist","post_message":"President Donald J. Trump says his executive order banning immigrants from seven Muslim-majority countries is \"working out very nicely.\" @webpagelink"},{"comment_id":"10156340374100354","commenter_b":"You my dear are a moron who is helping to destroy your people.","commenter_a":"Scumbag.","post_message":"\"Safe negro\"?!  Can you IMAGINE the FIRESTORM liberal media would have generated had a conservative said this?!"},{"comment_id":"10152968850756519","commenter_b":"Affirmative action laws are in place. Maybe she could work to eliminate them all so that we all get a equal opportunity in education, employment and business instead of posing as a woman of color and cutting in front of EVERYONE ELSE in line..lol, Caitlin Jenner can cut in right behind her.","commenter_a":"1 Rachel Dolezal = appropriation/ race traitor and an abomination. 1 million \"Rachel Dolezals\" = 1 million \"less racist\" white people, who are fighting for the advancement of colored people. Weird to think about.","post_message":"Rachel Dolezal finally speaks: \"As you probably know by now, there are questions and assumptions swirling in national and global news...\""}]
