[{"comment_id":"10158282673955294","commenter_b":"Today????????","commenter_a":"Does this mean Chris Jericho, aka Y2J, has been signed to a lifetime contract with WWE? If not, they're stupid idiots!","post_message":"A group of scientists have moved the \"Doomsday Clock,\" a symbolic countdown to the end of the world, to two and a half minutes to midnight."},{"comment_id":"1824334044515363","commenter_b":"She won't do anything","commenter_a":"Undocumented immigrants pay more taxes than Donald Trump plus a lot of them bring fresh vegetable and cheap food to american tables.. Hillary President !!","post_message":"Donald J. Trump on immigration during final presidential #debate: \"We have some bad hombres\" @webpagelink"},{"comment_id":"10153563054238984","commenter_b":"Stop!","commenter_a":"Subject Prophecy Fulfillment At the time of Messiah's coming, Israel would have unfit leaders. Zechariah 11:4-6 Matthew 23:1-4 The Messiah's brothers would disbelieve him. Psalm 69:8 John 7:3-5 The Messiah would be the \"stone\" rejected by the Jews. Psalm 118:22 Matthew 21:42-43 The Jews would have a hardened heart against the Messiah. Isaiah 6:9-10a John 12:37-40 The Messiah would be a \"stumbling stone\" for the Jews. Isaiah 8:14 Matthew 21:43-44 The unbelief of Israel's leaders would force the Messiah to reject them. Zechariah 11:8 Matthew 23:33 The Messiah would stop ministering to the those who rejected Him. Zechariah 11:9 Matthew 13:10-11 The Messiah would be distressed over the Jews unbelief. Isaiah 49:4 Luke 19:41-42 The Messiah's own people would not believe he was the Christ. Isaiah 53:1 John 12:37-38 The Messiah would be rejected. Zechariah 11:12-13b Matthew 26:14-15 The Messiah would be rejected. Isaiah 53:3 Matthew 27:21-23 The Messiah would ...","post_message":"This former governor can speak from firsthand experience, and that experience has her taking a BIG stand for 'The Donald.'  Do you agree with Jan Brewer?"},{"comment_id":"10153900355041378","commenter_b":"They are all crooked! This is what happens to women who try to play (and cause trouble) in the all boys club that is politics.","commenter_a":"Clinton should of appointed her to be her VP","post_message":"#BREAKING - One day after she was convicted of perjury and other offenses, Pa's Attorney General answers calls for her resignation. @webpagelink"},{"comment_id":"10154925152646320","commenter_b":"Omg bottom left woman.. I hope after seeing her fkn face she would stop doing drugs !!","commenter_a":"Dam, they should've left Tiffany Dawn Evans alone. If that girl can make money from sex, cudos to her.. poor thang!","post_message":"Almost a dozen people in South Carolina were arrested on prostitution charges. Some of them were also charged with drug-related offenses...  @webpagelink"},{"comment_id":"10153535797471336","commenter_b":"That's because they have a thug for a governor ..A Hood Rat..","commenter_a":"It's pretty obvious why there is so much crime in Baltimore. The cops are afraid to do their jobs! I'm surprised most cops haven't left Baltimore!","post_message":"Ten federal agents will work with Baltimore's homicide detectives in the latest bid to curb a surge in violent crime."},{"comment_id":"798452466914476","commenter_b":"thank you againe Mr President for saving your citizens from the corporate wolves","commenter_a":"Question: wasn't the FCC suppose to have public comments?","post_message":"BREAKING: This is a huge victory for American consumers.  Share the good news!  Read more: @webpagelink Image by Occupy Democrats."}]
