[{"comment_id":"1124493864242596","commenter_b":"I'm not sure why he was with her to begin with if that's the way she feels. She apparently doesn't have the same Christian values, which could only result in disaster for any potential marriage. Tim, you can do much, much better!","commenter_a":"Tebow is a good man......I couldn't care less about his football abilities...","post_message":"Tim Tebow loses girlfriend over Christian values."},{"comment_id":"10153792604111746","commenter_b":"Two fools!","commenter_a":"Not at all. I love them both and i hope they are the host on 10/19 which is my Birthday.","post_message":"People on both sides of the aisle thought the two were biased."},{"comment_id":"10153641200792235","commenter_b":"Fame whores","commenter_a":"Take your pick...lol","post_message":"Petty, childish and HILARIOUS all at the same time!"},{"comment_id":"787010171427640","commenter_b":"so much for tolerance","commenter_a":"I'd of accepted her resignation effective right then!","post_message":"Citing \"separation of church and state,\" the councilwoman resigned.  What she did almost immediately afterwards is raising eyebrows."},{"comment_id":"985465168182267","commenter_b":"You don't support our troops, you don't support tradional marriage, I would think support you.","commenter_a":"Good I don't go there now.","post_message":"Starbucks CEO: If You Support Traditional Marriage, We Don Want Your Business  ttp://woundedamericanwarrior.com/starbucks-ceo-if-you-support-traditional-marriage-we-dont-want-your-business/"},{"comment_id":"1069939893102262","commenter_b":"Agree ^^^","commenter_a":"More far right wing Christian terrorism supported by fox news and the NRA.","post_message":"Anti-Muslim rhetoric has spiked since San Bernardino."},{"comment_id":"10154454599501162","commenter_b":"That lady is an idiot","commenter_a":"What the f @username Angela Lemonjello Caringella Care Re","post_message":"Harbor seal pup euthanized after being carried off a beach in a plastic shopping bag."}]
