[{"comment_id":"725495814307663","commenter_b":"Hillary is a virus!","commenter_a":"That's Tillery when we're not really being serious about lives of American citizens. She's a disgrace to represent any American. Trump 2016!","post_message":"Trump Just Leaked A Video Of Hillary Clinton That Could End Her Campaign [VIDEO]  She is panicking. See this video before it gets scrubbed from the internet.  Do you think Hillary has no place in our White House?"},{"comment_id":"10153238053014586","commenter_b":"plants are living things too... so eat sand... all human should eat sand.","commenter_a":"literally feel sick watching this how can people still let this happen? disgusting","post_message":"Can you imagine having that huge metal tube shoved down your throat?!   This is just 60 seconds of how #FoieGras ducks spend THEIR ENTIRE LIVES.   They sound so terrified. :("},{"comment_id":"1390719824302205","commenter_b":"Our 4 rescue babies. We couldn't be happier, love them with all our heart.","commenter_a":"If I were granted 3 wishes it would be health and wealth for all my family and friends and that Clyde could talk. We stare into each other's eyes and I ask him about his family and living on the street and all his circumstance and history. I call him a bunch of names to see his reaction, Blackie, Shadow, Coal, Midnight. Larry hates that \"his name is Clyde, you're confusing him.\" I'm also proud to wear a tshirt that says \"all I want to do is drink wine and rescue dogs\" and it has a real red wine stain on the front!","post_message":"This comic shows a dog's heartwarming journey from the shelter to his forever home."},{"comment_id":"10152746311166519","commenter_b":"Thus hes still a bitch!!!","commenter_a":"This igit wouldnt last .5 nanoseconds in the south bronx","post_message":"Ladies and gentlemen, this is pure Fox News: “If I see a group of blacks coming at me with hoods on, I’m walking to the other side of the street.\""},{"comment_id":"10154453767181729","commenter_b":"Liar liar pants in flames","commenter_a":"BHO will pardon her.","post_message":"And she still thinks she's going to get off scot-free..."},{"comment_id":"758408480932531","commenter_b":"A BRAVE WOMAN!","commenter_a":"Brave lady. Stay safe!","post_message":"Thanaa Jawabreh prompts a heated debate following a public apology for the ‘horrendous’ shooting attack that killed aIsraeli couple."},{"comment_id":"1104176122983583","commenter_b":"Fire her sorry Ass!","commenter_a":"traitor, as a senator you have more of a way of fighting for what you believe in than 99.9% of us ....Do what you were elected to do and stand up for flag and country, or get the h out of the goverment","post_message":"What?! Man!!!"}]
