[{"comment_id":"1015647588491215","commenter_b":"@username Hillary hasn't officially won the nomination there my dude... Did I say I was voting for her?","commenter_a":"In his defense, and I am in no way voting for this guy, he said the economy ran better under democrats but it SHOULD NOT be that way. So, that plays into him wanting to be a different option within the party. But whatever, the guy is a moron and I'm voting DEM!!","post_message":"LOL, WOW. You could ask this guy what he had for breakfast, and his answer would change from one minute to the next.   Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154513663831051","commenter_b":"A bitch will always be a bitch","commenter_a":"I am sorry, what is her position in the administration? Oh right nothing.","post_message":"This photo of Ivanka Trump is sparking tons of controversy after people realized something about what's right there in plain sight. Look closer."},{"comment_id":"918834358153905","commenter_b":"It's not liberalism it's victimism. Justifing everything you do and tring to force others to change by acting like everything that happens is victimizing you","commenter_a":"Agreed.","post_message":"The latest COMMENTARY from Matt Walsh:"},{"comment_id":"10153894836055579","commenter_b":"Deport Muslims and illegals, provide help for the mentally ill. Uphold current laws. Problem solved.","commenter_a":"Can somebody explain to me the connection between the NRA and this 20 year mentally disturbed individual in Oregon? How come we don't hear Obama or Hillary talking about the thousands killed every year via violent criminals in major cities all over the US? Where's their plan to stop that violence? How many law abiding gun carrying citizens have been involved in a mass shooting in the US?","post_message":"Hillary Clinton on guns:  is wrong with us that we can stand up to the NRA? Watch full video here: @webpagelink"},{"comment_id":"10154970022528690","commenter_b":"The world and so call United Nation have no interest in alepo people just because they are muslim, if its christian region this is happening the UN will have take action, but we the muslims are just folding our arm doing nothing, the only thing is to back to Allah, by saying; HASBUNALLAHU WANI'IMAL WAKIL, WANI'IMAL MAULA WANI'IMAL WAKIL,","commenter_a":"there is tubelight, internet, electricity bla bla. it seemed she is speaking from hotel pan pacific Singapore. we didn't heard even a sound of bullet fired. weird.","post_message":"Residents of East Aleppo are giving their final messages to the world."},{"comment_id":"10153672451109062","commenter_b":"He's a lady","commenter_a":"Michael Keaton was robbed!","post_message":"BEST ACTOR goes to Eddie Redmayne for \"The Theory of Everything.\" More: @webpagelink  Photo: Dan MacMedan, USA Today"},{"comment_id":"1735291753418932","commenter_b":"Tyler","commenter_a":"Julia Lynch yay","post_message":"Wristbands allow festivalgoers to return to the empty field after a trip to the parking lot to retrieve more MDMA, mephedrone, 2-DPMP, Benzo Fury, Adderall, or synthetic cannabinoids."}]
