[{"comment_id":"10152817308146491","commenter_b":"She's a fatass skank","commenter_a":"We don't have a first lady. She is a low class idiot.","post_message":"“If Barack was a helium balloon, Michelle was the one holding the string.”"},{"comment_id":"1349180015160531","commenter_b":"I'm guessing it won't be Christians?","commenter_a":"Now we know what iran is using all that money obama gave them for. Old Valerie has been running the government for some time. Once these nuts get you guns guess who will march in.","post_message":"In a sickening op-ed piece for The Huffington Post, Valerie Jarrett basically \"killed off\" her own grandpa in order to push for her agenda... GUN CONTROL.  This is absolutely revolting... take a look at what she did."},{"comment_id":"10153086110919411","commenter_b":"she is a child","commenter_a":"She just got out of jail 2 weeks prior for car theft and now was in another stolen car and tried getting away using the car as a deadly weapon, the cops have no idea who is behind the wheel, it doesn't matter at that point. Dumbass brought it on herself!","post_message":""},{"comment_id":"10153186374039497","commenter_b":"If only this were all fiction........","commenter_a":"James Tatham. I very much like @username's humour.","post_message":"This Week Last Year:"},{"comment_id":"164458724060246","commenter_b":"Should give all their jobs to legal immigrants","commenter_a":"Good for the owner. Behind him all the way.","post_message":"30 WORKERS FIRED For Skipping Work To Protest On Behalf Of Illegal Immigrants…Calls Employer Who Fired Them A \"Racist\" [VIDEO]"},{"comment_id":"10153972084976336","commenter_b":"Pretty white chick..Thug?...heck no...let her go....","commenter_a":"Thugs come in all shapes, sizes, genders and races! Thanks to the Law Enforcement for removing this thug from our streets.","post_message":"Abigail Lee Kemp was taken into custody in Smyrna without incident, the FBI’s Jacksonville, Florida, office announced."},{"comment_id":"10152797115634117","commenter_b":"Matthew, most of you gun totters don't have the balls to pull the trigger. But if you need a gun to make you feel like a man, knock yourself out. Guns are there for men who's wives wont let them have a penis truck. Have a nice day.","commenter_a":"And the evil liberal Democrats want to take our guns away because the police are here to protect you.","post_message":"U.S. marshal's effort to censor a citizen's recording was foiled by yet another citizen recording in this small town that collects millions in asset forfeiture revenue."}]
