[{"comment_id":"10154608447428690","commenter_b":"@username - Did I hurt your feelings? While you're defending her she's planning on how she'll enjoy all her wealth somewhere in the world while you'll be paying taxes up the wonker. It's called Sod's law.","commenter_a":"She is every color on the a--hole rainbow.","post_message":"\"I am innocent, I am an honest person and I have never committed a crime.\" @webpagelink"},{"comment_id":"10154406846618734","commenter_b":"Really lady get over yourself. All you want is Money!!","commenter_a":"This is where feminism has brought womyn: seeing themselves victimhood is the highest calling of all.","post_message":"Do you think the claim is too much? Or just right?"},{"comment_id":"10152582294965047","commenter_b":"Can't she just go away!","commenter_a":"Help us all!","post_message":"The Obama Administration tried to trick the American people through a lack of transparency.  ObamaCare has been a complete disaster, and it's time for it to go.    Sign & Share our petition to defeat ObamaCare today: @webpagelink"},{"comment_id":"1010418702314511","commenter_b":"It nothing to do with race. She is a moron!","commenter_a":"they say everything is racist","post_message":"Is racism hampering Serena Williams' career?"},{"comment_id":"10153595833422439","commenter_b":"@username - stop them in their tracks? When? So far we've done nothing and the media's not reporting on stuff as ordered by our gay muslim prez! Meanwhile he's flying hundreds of thousands more in and setting up cells all over our Country. Trey Gowdy tried to stop it in SC and the planes and buses keep coming and dumping them.","commenter_a":"I don't think the muslims fully understand that the American people will unite and stop them in there track. God Bless America","post_message":"Coming to America. It’s just a matter of time. The only difference between Islam in Europe and Islam in America is we started importing whole Muslim communities a lot later than Europe. But we are on the same path to ruin."},{"comment_id":"10153154705006051","commenter_b":"Can't stand your ass either","commenter_a":"Can't stand Al Sharpton!! He is an evil racist!","post_message":"Al Sharpton was asked if the $5.9 million settlement for Eric Garner's death was enough. His response: No. He also has another demand. Do you agree or disagree with Sharpton?"},{"comment_id":"10152744813956094","commenter_b":"What is your alternative, Scott?? Just curious.","commenter_a":"Liz Warren is pissed off. Anyone who •isn't• pissed off, isn't paying attention!","post_message":"Yves Smith shreds the the Obama administration's rebuttal to Elizabeth Warren's critiques of the secret trade panels proposed in the TPP and TTIP treaties."}]
