[{"comment_id":"10153108653466770","commenter_b":"Psycho woman.","commenter_a":"Ho hum!!!","post_message":"Debbie Wasserman Schultz says Donald J. Trump's “misogynistic comments” are “reflective of what the entire Republican Party stands for.”"},{"comment_id":"10153069426151770","commenter_b":"GIVE ME A BREAK. !!!!!!!! WHITE LIVES MATTER. LATINO LIVES MATTER. ASIAN LIVES MATTER. NATIVE AMERICAN LIVES MATTER. BLACKS ARE NOT THE ONLY ONES THAT MATTER","commenter_a":"Blue lives come in all colors, both sexes all nationalities. What a moron.","post_message":"TheGrio, the segregated NBC News website, and MSNBC claim racism and \"controversy\" in caring about the lives of police officers."},{"comment_id":"10153400875176833","commenter_b":"my Vote WILL NOT BE FOR HER!!! I want to Keep the Constitution. We she get in the white house you can kiss this Country and are Constitution good bye..","commenter_a":"Where's sirhan sirhan when you need him ?","post_message":"Never mind all the rhetoric about how Hillary Clinton can get the Democrat Party presidential nomination because some fringe elements don think she radical enough. The Hill reports that  for gun control [an increasingly fringe group in their own right] have high hopes for Hillary Clinton presidential run, seeing her as  ally who can finish the push for tightened background checks that has stalled in President Barack Obama second term.  Indeed, Clinton has been a vocal gun control supporter for more than 20 years."},{"comment_id":"1517317031907717","commenter_b":"Lol! I know right! Hate that woman! This,Chicana is for #trump2016 !!","commenter_a":"The most satisfying thing in the world to see, EVER, is watching Megyn Kelly say Trump wins!!!!!!!","post_message":"BREAKING: Initial reports indicate Donald Trump has won the Republican primary in South Carolina. Let's take a poll of our own...would you like to see Trump as the next US president?"},{"comment_id":"10154061329228352","commenter_b":"Fucking neither of them. Both pieces of dog shit.","commenter_a":"These two look alike younger you vs newer you ewwwww","post_message":""},{"comment_id":"10153053821551051","commenter_b":"Nazi bitch. Do that in front of me. Evil","commenter_a":"Again school employees who think they have the answers this is awful and someone should take her food away from her","post_message":"A school official walked up to this little girl, picked up her lunch and threw it in the trash in front of everyone. The girl immediately began to cry."},{"comment_id":"1017808354978885","commenter_b":"This is bullshit lady","commenter_a":"Trump is no different than isis and we need to recognize the radical christians in america trying to take our country.","post_message":"After today, when Trump said he would ban ALL Muslims from entering America (even Muslim-Americans who just happen to be traveling overseas) it's easier than ever to see the frightening similarities.  Image shared by Occupy Democrats, like our page for more."}]
