[{"comment_id":"10156246277170725","commenter_b":"But I don't support Trump's fantasy plan about deporting 11 million people illegals with criminal records should be deported immediately!!!...we should build a wall too....and we should give work permits, make them pay fines, and adopt an E-verify system. ....that's more realistic and rational. Switzerland has a population of 8 million people, according to Trump's plan, he would deport the equivalent of every single person living in Switzerland and then SOME not only it is CRAZY, it's impossible. ..for the sake of argument let's say it was possible, it would cost billions and billions of dollars and take decades to accomplish that.","commenter_a":"I think people are going to vote donald trump for president","post_message":"Saying goodbye to some of my great workers at Trump National Doral Miami."},{"comment_id":"598881613578354","commenter_b":"Just shoot her!","commenter_a":"Piece of shit!!!!! Hit up some of the dicks that got you there","post_message":"Cry.............me...........a.............RIVER!"},{"comment_id":"378200662557944","commenter_b":"Three of them are real ladies - the other two cannot even spell the word!","commenter_a":"Nancy Regan","post_message":"Who is your favorite First Lady ?"},{"comment_id":"10153974974065329","commenter_b":"Bye bitch","commenter_a":"My belief she is every bit as responsible of what that animal inflicted on the child. As a mother, you are to protect your child by any means necessary. Battered or not she bought that animal in her baby's life and chose him over her child. Save your hate post siding for the battered women of the world the only person I care about that needed defending is the child.","post_message":"Tondalo Hall will not be released early from her 30-year sentence in Mary Fallin's Oklahoma for failing to protect her children from her abusive partner. The man who actually harmed her child got just two years. (via BuzzFeed News)"},{"comment_id":"10153265757247061","commenter_b":"No, he was too busy lighting our disgraced white house Christmas tree.","commenter_a":"If you have no interest in hearing President Obama, why comment? I'm sure he's not reading your negative comments. He's much too busy and has other more important things to focus on, unlike you, who clearly have too much time on your hands!","post_message":"BREAKING: President Barack Obama to address the nation from the Oval Office on Sunday night at 8pm ET, White House says. @webpagelink"},{"comment_id":"10152650786516491","commenter_b":"^^hoes got problems","commenter_a":"Dont like him, Dont Respect him can care less where , Rapist, Thief and total idiot goes except to jail","post_message":"Winston lost only one game as a starting quarterback."},{"comment_id":"1161811247205145","commenter_b":"Lock her up","commenter_a":"\"LOCK HER UP\"FOR SURE!!!","post_message":""}]
