[{"comment_id":"10153087486466162","commenter_b":"She is hot","commenter_a":"Sicko","post_message":"STUDENT SAYS THEY HAD SEX AGAIN: A high school teacher charged with having sex with several students is back in jail after one student claimed that they continued to have sex while she was free on bail @webpagelink"},{"comment_id":"1436165433143173","commenter_b":"We non-native people are all illegal immigrants. Nobody gave us permission to live here.","commenter_a":"Somebody needs to read History books this country was owned by Native American Indians (@username) we all are immigrants in this country","post_message":"This mother speaks for the millions of people who live in fear of Trump's deportation squads."},{"comment_id":"554818391394376","commenter_b":"@username you said it. Now it's trumps turn. AND HES GOING TO HEAR it... Loud and clear.","commenter_a":"@username TRUMP IS OUR PRESIDENT, Have some respect, stop showing our kids it's ok to disrespect our President, our country. Can't wait for the day, your boat sinks, and you hate mongering reporters drown.","post_message":"He wrote a book alleging corruption between the Clintons and their philanthropy. Now he says he sees similar conflicts of interest between Donald Trump and his business."},{"comment_id":"1420936454624649","commenter_b":"I hope that this administration will figure out how to keep us safe without becoming totally isolationist. Not all immigrants or Muslims are terrorists. Weed out the bad but don't turn away those who honestly need our help and who only want to make this counrty a better place.","commenter_a":"Do you know you have done more than every other country to help?","post_message":"Senior Politics Writer John Haltiwanger is at JFK International Airport where there's a massive protest against President Donald Trump's refugee and Muslim traveler ban."},{"comment_id":"10153564532183984","commenter_b":"@username All immigrants who enter LEGALLY are welcome!! We dont need or welcome ILLEGALS. There is a difference.","commenter_a":"I don't understand good, law-abiding Latinos taking a position against following our immigration law and supporting programs that shelter criminals just because they too are Latino. I would be incensed that my good name and that of my race was being damaged by those lawless usurpers.","post_message":"Donald Trump isn’t backing away from his position on illegal immigration and his disgust for sanctuary cities. These policies endanger the lives of innocent Americans, and they must be put to an end.   Obama needs to rethink his plans for amnesty before more Americans die at the hand of violent illegal immigrant criminals.   Sign the petition to block Obama’s plans for amnesty!"},{"comment_id":"10154507187503690","commenter_b":"By expressing these words u r only humiliating blacks,u r suitable pig to work as the puppet of western world to defeat the black pride.how unfortunate u r","commenter_a":"imagine arabs without islam, great scientist, musicians, world class pretty models, sport heroes, legendary actors both male n female but islam brought d vice. without oil plus islam saudi and d rest would have been worst than somalia. I cause the day that rapist dirty war mongering piglet (mohhamed) was born","post_message":"\"Some people skydive, some people race cars, and some people like to fight.\""},{"comment_id":"10154283340572061","commenter_b":"You need an education woman. The president has already spoken. People like you really scare me. Your like a lose cannon with no direction, hurting the innocent! I don't agree with you but would never think of slamming you or causing you hurt. Everyone needs to figure out how to get along or there's not going to be a world to live in for any of us.","commenter_a":"Where are words from the president? Words, that's right, he has a short vocabulary. He can't say it's going to be great, really, really, great. When I tell you, it's going to be yuge. Sad America, when disaster strikes, your president is somewhere eating caviar sulking about his weak inauguration numbers. smh","post_message":"At least 16 people have died over the last 48 hours due to tornadoes, as a violent system of storms works its way across the Florida Panhandle and parts Georgia and Alabama: @webpagelink"}]
