[{"comment_id":"1187241994648589","commenter_b":"Clinton is dangerous to kids and adults! Lots of her associates end up dead. And she is still married to a pervert! I'm voting for Trump!","commenter_a":"Hillary could care less.","post_message":"CLINTON claims TRUMP PRESIDENCY puts KIDS in DANGER  @webpagelink"},{"comment_id":"1090152371065873","commenter_b":"NO! All the illegals should be put there until they can be legalized.","commenter_a":"No,never.","post_message":"The White House says it is committed to closing Guantanamo Bay and will overcome the obstacles Congress is causing to prevent this. Should Guantanamo be closed?"},{"comment_id":"10152728783180950","commenter_b":"No China, it comes from China !","commenter_a":"Florida.. of course..","post_message":"\"We're starting to see a rash of cases of a syndrome referred to as excited delirium.\""},{"comment_id":"10153250256602439","commenter_b":"All female firing squad","commenter_a":"His last meal should be bacon. Pour pig's blood all over his body before firing squad. Don't forget to soak those bullets in pig's blood.","post_message":"Death penalty is too good for this savage. Boston (CNN)[Breaking news update, posted at 2:32 p.m. ET] Jurors in the Boston Marathon bombing trial have found Dzhokhar Tsarnaev guilty of all 17 counts that carry a possible penalty of death. The jury …"},{"comment_id":"10154189668593352","commenter_b":"Husbands fault!!","commenter_a":"She's young and does not realize the damage that she's doing and the fact that she cannot deny it!","post_message":"Sidechick Embarrasses Wife on Social Media – Posts Videos of Her And The Husband Doing 'You-Know-What'! (PHOTOS)"},{"comment_id":"10155174752479916","commenter_b":"now suck it!","commenter_a":"Fuck that cop, fuck all cops","post_message":"Protests are ongoing in Anaheim today after an off-duty cop discharged his firearm in a crowd of young teens."},{"comment_id":"489295787927668","commenter_b":"screw her","commenter_a":"first explain what 20,000 likes will accomplish ......","post_message":"Hillary Clinton is attempting to make it punishable by law to criticize Islam.  She just crossed the line. We can put a stop to this, let's end this right now.  Can we get 20,000 'LIKES' for freedom of speech?"}]
