[{"comment_id":"10153279358959087","commenter_b":"You're a stupid bitch","commenter_a":"Democrats have become the party that endorses Corrupt Liars. Next time a Democrat points a finger at Republicans they should point 5 back at themselves first.","post_message":"Nearly twice as many Americans say they are unsatisfied with Hillary Clinton’s response to the 2012 attacks in Benghazi as say they are satisfied, according to a new NBC News/Wall Street Journal poll released today."},{"comment_id":"10154724621788984","commenter_b":"Hey Walmart has glasses 2 for the Price of one One for your dumb Head and one for Your your brown spot","commenter_a":"Lady you need to get your head out!Quit your job cause you are not of sound mind like Hillary Clinton","post_message":"Attorney General Loretta Lynch just issued a message to Charlotte rioters - and something about it immediately raised eyebrows."},{"comment_id":"894821663947420","commenter_b":"more idiots!","commenter_a":"I blame Obama","post_message":"Don't be quick to blame California's drought on plush lawns and swimming pools ..."},{"comment_id":"10152526898447623","commenter_b":"No. The statue was in HONOR of our fallen heroes. You are a disgrace.","commenter_a":"King should be ashamed. ..","post_message":"The kneeling soldier statue will be removed from the King Veteran’s Memorial after Tuesday night's city council meeting."},{"comment_id":"10153126312326028","commenter_b":"I don't understand Americans... This is the land of the free, right? No one's free! One is not free to speak Spanish and the other one is not free to be stupid. All my respect for the Latina lady, because at least she tries to speak English, thing that doesn't happen often.","commenter_a":"White 'Murican hates a woman that speaks TWO languages and she can't even form proper sentences, or thoughts, in one language..","post_message":"\"I FELT AWFUL\": All Norma Vazquez wanted was to treat her son to some birthday IHOP on her time off from her job cleaning office buildings. Instead she was berated by another patron who told her to \"stop speaking Spanish\" and invoked the Nazis, Castro and Russia.  Watch the entire exchange, which Vazquez's son recorded on his cell phone: @webpagelink"},{"comment_id":"10153732380134091","commenter_b":"Perras mamadas no hay derecho probe criatura","commenter_a":"Terrible","post_message":"\"Take everything please. Don't kill me please.\" Those were the tragic dying words of an 11-year-old boy who was killed this week on his walk home from school."},{"comment_id":"1201176699902507","commenter_b":"Beverly, there's already plenty of porn out there. I highly doubt anybody's going to get their jollies from our veiny mom-boobs. In all seriousness, though, in 99℅ of cases, you can't see any more breast than you would if wearing a bikini. And yet, we don't shun the beach for fear of perverts with cell phones, right?","commenter_a":"There is a big difference between how breastfeeding is depicted here and what the majority actually look while breastfeeding in society. , Here its done Discreetly and beautifully, If all women breast fed like this NO one would have issues with it,","post_message":"\"Let's support mothers to breastfeed anytime, anywhere.\""}]
