[{"comment_id":"1741105056106659","commenter_b":"BWAHAHAH AND THAT'S WHAT MAKES AMERICA GREAT!","commenter_a":"Carla Stovall Jeanne' Cleopatra Thompson Anthony Stovall BLOOP!!!!","post_message":"TRUTH: Kaepernick's critics are failing to see the larger point. Roland Martin nailed it with this one.  Shared by Occupy Democrats, LIKE our page for more. Video from MSNBC."},{"comment_id":"10154230150699411","commenter_b":"Bastard british dog ottoman sunnis was wrost enemy of wahhabi saudis.check your history motherfucker.your resourceless England speard wahhabism all over world by supporting saudis.check your own history!muslim world is uniting when we unite your britain have large number of street beggars.your Uk have only tourism!end of Uk signs apeared yesterday when English team beat by West Indies!haha","commenter_a":"At least it's not as bad as the destruction of the Giant Buddhas of Bamiyan, or the mass destruction of priceless World treasures like the Hindu, Buddhist & Sikh Temples in India or the destruction at Palmyra!! Sunnism is the World's problem!!","post_message":" vandalism"},{"comment_id":"10154258845019087","commenter_b":"Crooked Hillary, Star Trek, and a wussy looking dog......that fits you. #dbap","commenter_a":"Too many fail to realize that had the shoe been on the other foot, DT and his supporters would be screaming to high heaven about the system being rigged - so stuff it.","post_message":"A petition calling on the Electoral College voters to cast their ballot for Hillary Clinton instead of Trump has amassed over 600,000 signatures in less than a day."},{"comment_id":"10156071527715354","commenter_b":"@username... we are talking about illegal aliens. Not the Mexican race. You should set yourself on fire -","commenter_a":"then you go ahead Ricky and pay for all the welfare benefits, health insur, food stamps, free college tuition (Dream Act) for ALLLLL the illegals pouring into the country. Cause we cannot keep paying for all this under the radical liberal orders--the pot has run out--this is why we SCREAM and beg for a man like Donald J. Trump to stop all this madness.","post_message":"BEHOLD, America!   One of liberalism's finest minds--a political Zeus!--hath spoken!   #Livin’LaVidaLoca"},{"comment_id":"1698523013768491","commenter_b":"Women making decisions over a man's body","commenter_a":"It's not for fucking cosmetic reasons. It's for hygiene and it prevent a large amount of penile infections.","post_message":"Y'all should probably still stop cutting baby's dicks for cosmetic reasons though."},{"comment_id":"10154262927371519","commenter_b":"What a faggot","commenter_a":"She was just on Rachel Maddow. I was in tears. This has to stop.","post_message":"He also threatened to rip off her hijab."},{"comment_id":"620315121449719","commenter_b":"Would make a great couple . Two freaks .","commenter_a":"HE likes. HE likes. HE aint a SHE!!!","post_message":"Caitlyn Jenner says she likes Ted Cruz because “he's very conservative, and a great constitutionalist.” @webpagelink"}]
