[{"comment_id":"469971939860053","commenter_b":"look its him the bitch","commenter_a":"No way Michelle we have the right. Guns don't look for people to shoot look and see who are the vandals and thieves that are doing the shooting killing their own people","post_message":"Michelle Obama just made a major move on gun confiscation.  This is ridiculous, restrictive gun laws cause HIGHER murder rates.  Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"793004177467954","commenter_b":"cuck","commenter_a":"Go take some selfies Obama you fucking disgrace","post_message":"Obama is a _______________."},{"comment_id":"10152943088035950","commenter_b":"OMG, this woman is beyond ridiculous. WTF for real.","commenter_a":"@username. Then we have these morons !","post_message":"A special education teacher accused of holding an autistic boy upside-down and lowering him head-first into a trash says she was trying to \"shake out that trashy behavior.\""},{"comment_id":"10153440458394087","commenter_b":"God please give us her in the White House so we can see her on TV everyday!!","commenter_a":"just a dumb shit for hanging with trump","post_message":"“Do I agree with him all the time? No,\" Melania Trump says of her husband Donald J. Trump. \"I think it is good for a healthy relationship. I am not a ‘yes’ person. No matter who you are married to, you still need to lead your life.”"},{"comment_id":"10152826899201051","commenter_b":"How would she like if someone caught her on fire in a cage! This woman is sick!","commenter_a":"Put her in cage, set on fire","post_message":"First she made sure the puppies were securely locked up in the pet shop. Then she set it on fire."},{"comment_id":"10153174163477452","commenter_b":"he better not get fired. @username","commenter_a":"GET SOME!!!!","post_message":"Big Mac attack!   A McDonald's worker wasn't \"Lovin' it\" when an irate and apparently drunken customer launched into a vicious attack at the drive-thru window. But the worker wasn't going down without a fight. abc7.la/1KYEgIq  It's just the latest case of a service worker attacked on the job."},{"comment_id":"1548076978821767","commenter_b":"@username Illegals are already criminals by definition.","commenter_a":"These liberal are making more and more people want to vote for Trump.","post_message":"Top progressives are terrified the Democrat mob attacks on Americans will send millions of voters running to Trump."}]
