[{"comment_id":"10152963504506130","commenter_b":"What was she thinking? Dumb model!","commenter_a":"Well they can't fire her now that the world is laughing at it. PR, people, PR.","post_message":"Whoops."},{"comment_id":"10153080456176051","commenter_b":"Feral pigs are a huge problem in this country.","commenter_a":"I am NOT a liberal, and do not believe in hunting for sport! Why do people who hunt, feel the need to post morbid pictures of \"their kill\" Is it to prove something?! Not many people want to see that!!","post_message":"These hunters have one message and one message only for their critics: get over it."},{"comment_id":"10153778405133854","commenter_b":"Who cares what she told her daughter","commenter_a":"She is above the Law, Richard Nixon looks like a choir boy \" truth has no meany, Anymore\"","post_message":"Hillary Told Daughter Chelsea That Terrorists Were Behind Benghazi Attack The Night It Happened [VIDEO]"},{"comment_id":"941193142664131","commenter_b":"Hope it blind the liberal bitch! LOL","commenter_a":"Get more of them","post_message":"Mace to the face = ouch. Did she deserve it? Did the old man deserve getting punched by her? And for a bonus for being nice I've added a video of a high protester doing a backflip and landing on his head. #theplacewecallthezoo @webpagelink"},{"comment_id":"10155784573999657","commenter_b":"Does this woman ever smile?","commenter_a":"Has she and all other politicians done this already or are planning to follow what she wants?? If not why should Mr Trump do something no other politician has ever done!! Can't hold him to a standard that no one else is following or has ever followed!!!","post_message":"Ethics and Intellectual Consistency."},{"comment_id":"401125753409052","commenter_b":"Josh go live with the muzzies and obey THEIR laws in their land!!!","commenter_a":"It should be like that in America, too!","post_message":"\"I don't want to take off my Muslim Head Covering in Court\"..."},{"comment_id":"10153628863174575","commenter_b":"She's just a troll, Crystal. Ignore her.","commenter_a":"I stand with Kim Davis","post_message":"Rowan County Clerk Kim Davis is under fire for defying a judge’s order to issue same-sex marriage licenses.  \"This is how gay people are treated in this country.If nothing comes of this, at least I hope that other people understand that this is wrong. It's just wrong,” said David Ermold who was denied a marriage license."}]
