[{"comment_id":"1840806586176177","commenter_b":"Will someone get this dumb bitch to shut up. let her crawl back into the hole she came from","commenter_a":"And I believe Conway has four children.","post_message":"Apparently the Trump team still thinks it's 1955."},{"comment_id":"10153170103931770","commenter_b":"She's improved at lying ! And she makes Barb not feel like such a hag.","commenter_a":"Crap","post_message":"Barbra Streisand said she thinks Hillary Clinton's campaign strategies have improved a lot over the last few months."},{"comment_id":"10152578505267217","commenter_b":"Can't stand the woman!","commenter_a":"Congrats Serena","post_message":"Serena Williams  jumped for joy on winning the Australian Open and her 19th Grand Slam."},{"comment_id":"10153764229426323","commenter_b":"It certainly is for most women. :)","commenter_a":"To be brutally honest, the female body starts to prepare for a possible pregnancy every month growing a miniscule placenta in the womb. If the conception doesn't happen the pre-placenta is rejected as menstruation blood and all.","post_message":"\"It's relief for a lot of us to finally see periods being talked about in a frank, forward-looking way.\""},{"comment_id":"977190145651659","commenter_b":"Hey ship them all to Canada they like the trouble makers. Attention Muslims get out of the USA we don't want you here!","commenter_a":"Private school or home school. It's worth the sacrifice.","post_message":"#IStandWithAhmed was trending on social media nationwide as people expressed their support for the teenager."},{"comment_id":"1015237518591880","commenter_b":"When I look at her boobs she spins all the way around. Her face goes halfway then comes back","commenter_a":"Prefer not to care","post_message":"Is she spinning right or left?"},{"comment_id":"10153778405133854","commenter_b":"Who cares what she told her daughter","commenter_a":"She is above the Law, Richard Nixon looks like a choir boy \" truth has no meany, Anymore\"","post_message":"Hillary Told Daughter Chelsea That Terrorists Were Behind Benghazi Attack The Night It Happened [VIDEO]"}]
