[{"comment_id":"10153857256601051","commenter_b":"Learn how to spell, dumb bitch","commenter_a":"This will happen more and more, as Obama has made the back lives matter a protected class! Waite to the refugees start! As they will be a protected class also! All the while Obama is trying to disarm the law bidding citizens!","post_message":"Eight teens trapped a teen gold in a home, held her down and sexually assaulted her. But that wasn't enough for them."},{"comment_id":"979014955531025","commenter_b":"Yes yes Milana the porn star.","commenter_a":"Did anyone besides me have flash backs to Jackie Kennedy when Melania walked out Classy dressed to the nines This lady loves America This lady will be a great first lady","post_message":"Donald J. Trump made a dramatic entrance at the GOP convention and introduced his wife Melania Trump. #RNCinCLE @webpagelink"},{"comment_id":"564500333698743","commenter_b":"Liz is either stoned or drunk on the kool aide.","commenter_a":"yeah right","post_message":"Hmm...gratitude was not exactly the word I had in mind."},{"comment_id":"1168212589885878","commenter_b":"Yikes!","commenter_a":"Ben may be a fair to middling Doctor but he needs a major lesson in history and about 20 years political experience.","post_message":"America deserves better."},{"comment_id":"10154029353788352","commenter_b":"dont save these hoes","commenter_a":"Wow","post_message":"17-Year Marriage Ends in Three Dead When Wife Drops Husband Off to Catch Flight, But He Follows Her Instead – Catches Her Meeting Lover at Hotel: Husband Murders Man, Wife and Self"},{"comment_id":"1211910735512691","commenter_b":"Duck you you racist old bitch","commenter_a":"Stop drinking you juice head.","post_message":"This racist woman went off on two Hispanic shoppers with a racist rant  and no one did anything to stop her.  More on this story here: @webpagelink"},{"comment_id":"10156338941645615","commenter_b":"Yup let's get busy creating more terrorists.","commenter_a":"Jesus. Blind, and deaf to his own words.","post_message":"Do you hear yourself talking, Rick?"}]
