[{"comment_id":"1333179716775079","commenter_b":"Um isn't that the parents job? How is this not just instantly obvious?...","commenter_a":"Pssst......they only care about the fetus until the second it is born. When it is a child they lose all interest. They don't feed, clothe, vaccinate, educate, protect, nurture, house, inspire, enrich or love it.","post_message":""},{"comment_id":"10153265076161602","commenter_b":"They're asking for regulations--there is no compromise from the gun lobby.","commenter_a":"I think we can all agree that there are some people that should not have firearms. However, if you support the second amendment like I do, you need to be part of the solution. Because if we let those that are against the second amendment make the policies, what do you think will happen to 2A? Let's be proactive in this, not reactive.","post_message":"The families made it clear they are not associated with the non-profit Sandy Hook Promise."},{"comment_id":"10153379305754205","commenter_b":"I was more surprised that Kenny Rogers was still alive, but at what cost? What has happened to his face?","commenter_a":"Typical intolerant liberals. Always pointing fingers and putting words in people's mouth. I think your ignorance is actually funny and the final laugh will happen next January. You will have a reason for 8 years of your hate and intolerance.","post_message":"Kenny Rogers Loves Donald Trump"},{"comment_id":"10154469641506051","commenter_b":"Absolutely not. She's a damn joke too.","commenter_a":"I will never claim Trump as my president. What a damn joke!","post_message":"If this goes the way some expect it to, Donald Trump could very well be impeached."},{"comment_id":"854121244730702","commenter_b":"No need to fear - strong, intelligent, powerful women can purchase their own contraceptives or better yet save something special for marriage and then raise the next generation of Americans.","commenter_a":"Dumbass use your butt.Save a child from being liberal.","post_message":"Lena Dunham is absolutely terrified of Trump and his views on abortion."},{"comment_id":"10153107912406051","commenter_b":"I hope she gets eaten by a carnivorous flower","commenter_a":"Or go egg free. Its possible. Vegan all the way!!","post_message":"We're going through the worst egg shortage in US history. What does that mean? It means get ready to pay a lot more for all your food."},{"comment_id":"552483671600179","commenter_b":"Hillary does all of the same things too. Get real.","commenter_a":"Its not really gender...its just more crap to throw at our future PRESIDENT Hillary Rodham Clinton..every week its some other lie or smear..you would think people would figure out what republicans have been doing for decades..!! An yawn like I do each time they raise their ugly heads. !! Tell them no an leave it at that !! Go Hillary Clinton🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸","post_message":"The 'transcripts' hit on Hillary is sexism in its purist form: holding a woman to a different standard because of her gender."}]
