[{"comment_id":"10154241596456491","commenter_b":"Trump has made America great again for sure ! Free coke floating on our shores !!!","commenter_a":"Mom Neelo","post_message":"\"I’ve found marijuana, but never cocaine like this.\""},{"comment_id":"10155000451429228","commenter_b":"When the Ayatollah came to power in Iran, Iran had a major drug problem. They hung their way out of it; they didn't hang anywhere near all the addicts . . . It's just that, apparently, people can get the \"disease\" of the addiction under control if they see government is serious. **** The Nation of Islam cleaned up some housing projects in the 90s, again, with lots of negative reinforcement--then the ACLU and bleeding hearts put a stop to that. **** If such measures here could stop drug-related deaths and murders, and give people in projects safe places to live, we would have a net gain. Kindness to the guilty is cruelty to the innocent.","commenter_a":"Oh, well then . . . If criminals don't care, I guess we shouldn't punish them at all. ***** Getting real, living things seek pleasure and avoid pain. If negative reinforcement does not seem to be working, we're just not using enough of it.","post_message":"Missouri's new Governor is asking for tougher laws.  Some experts say criminals don't care."},{"comment_id":"910630875626359","commenter_b":"They need to be shot!","commenter_a":"These people just need a hug.....around the neck.....with a rope.","post_message":"This could be way more serious than you ever thought possible. Do you think these men need to be stopped?"},{"comment_id":"364315750438606","commenter_b":"Orrrrrrrrrrrrrrrr, build a big wall around it and let in any idiot who wants to live like an animal.","commenter_a":"Solution for Baltimore. Dismantle the police department and incorporate law enforcement into the Department of Social Services. Terminate all police officers. Fund the law inforcement portion of social services with Federal dollars. Social Services pay gang members $100,000 plus benefits and pension to each gang member, no identification or proof of residence required. Pay each adult $500,000 for new housing or relocation. No identification or proof of residence required. No follow up for use of housing fund. Encourage business owners to allow no cost to their merchandise (free) .","post_message":"Democrat Candidate for Senate in Maryland Blames Republican Governor for Baltimore Education Problems"},{"comment_id":"1193495714026101","commenter_b":"If they can live by our laws get out of our country","commenter_a":"Amen !!!!!!!!!! They must be stopped from take over and destruction. All states please follow. Help us keep our great nation. !!!!!!!!!!","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"10153589847823984","commenter_b":"I'll help her pack to get the hell out of America! What a twit...","commenter_a":"If she is on welfare take her check and benefits away. Then make her do community service cleaning the toliets in a national park.","post_message":"Wow. This news makes her challenge even more shocking...  Do you think there should be a punishment for those who desecrate the American flag?"},{"comment_id":"10153511380259641","commenter_b":"I can't believe some of the comments here - So much hate {that's not justified} :/","commenter_a":"RIP the old England, lost to Islam now.","post_message":"#TBT:"}]
