[{"comment_id":"10154178677146943","commenter_b":"Abedin is corrupt woman with an agenda..Hillary's agenda. Watch..if anyone goes down for corruption it will be her, and Hillary Clinton will get off by throwing her under the bus! It seems to me that HC always surrounds herself with live shields for her own protection. Everyone of them should be held accountable..starting with Hillary Clinton!! Why is she even a candidate?","commenter_a":"Lock them up...Lock them up...Lock them up!!!","post_message":"A Clinton Foundation donor and St. Louis-based political consultant begged Huma Abedin to get former Secretary of State Hillary Clinton to meet with her client, the U.S. largest coal company, according to emails released by a conservative legal group.  , I need your help now to intervene please, Joyce Aboussie, a Clinton Foundation donor with close ties to the former First Family, emailed Abedin in June 2009 after Clinton had been leading the State Department for about six months. - via The Daily Caller"},{"comment_id":"953451111362414","commenter_b":"Feminists are annoying","commenter_a":"I think there all cunts so I suppose I am humanist ha...","post_message":"Tonight, Ed Sheeran performed a song about his love life. Feminist Taylor Swift wants to know why no one called him sexist. #Grammys"},{"comment_id":"10153941418821167","commenter_b":"Nope! He's going to insist that the debate was rigged.","commenter_a":"I haven't seen a whooping that bad since my cousin said the F word in front of Grandma. #KillaryKilled #TrumpTucksTinyTail #debates","post_message":"\"Overwhelmingly Hillary Clinton\""},{"comment_id":"10153916227396756","commenter_b":"I'd still prefer to toss Mississippi out of the US. For this exact kind of thing, actually.","commenter_a":"Whenever someone complains about the Confederate Flag i just look over at the ol' Stars and Stripes and think \"guess your times coming too\".","post_message":"After the student senate vote, Mississippi Gov. Phil Bryant said, \"I think college students react a lot emotionally,\""},{"comment_id":"1824366427776560","commenter_b":"Build that wall starting January 20, 2017.","commenter_a":"Build that wall !!!!","post_message":"URGENT: Please vote now.  Do you support building a wall with Mexico?  A new national poll released today says 53% of Americans DO NOT want a wall along our southern border.  The question is, do you?"},{"comment_id":"10153445751101782","commenter_b":"for the people that want abortions i ask you one question why did you allow yourself to get knocked up in the first place?","commenter_a":"Thank God!","post_message":"Gov. Mary Fallin has vetoed Oklahoma's anti-abortion bill."},{"comment_id":"10153480904281162","commenter_b":"I just would like to know, how much money has she spent in tanning salons...","commenter_a":"i've been black since I was 5 yrs. old. look at my pic.","post_message":"BREAKING: Did Rachel Dolezal lie about her race? Dolezal, the woman at the center of the race controversy, has resigned as the president of the Spokane NAACP @webpagelink"}]
