[{"comment_id":"10154594617592235","commenter_b":"Forgot this","commenter_a":"Typical conservative lack of knowledge. And yes, libertarians are conservatives. They are republicans. Believe me, they are republicans. Believe me. Republicans. Libertarians are republicans. Republicans. (Doing my best Trump impersonation, repeating myself over and over again. Repeating myself. Over and over. Believe me. Over and over)","post_message":"What the hell?  They announced victims right from the start."},{"comment_id":"375119059510655","commenter_b":"This woman is very wicked. You can see the evil spirit in her face. She is a demon from \"hell\"!","commenter_a":"Worst people you can meet in your life are LIARS! This administration is full of them!😏","post_message":"CNN has HAD it with Conway and her lies."},{"comment_id":"10154443469472293","commenter_b":"Lady you are what makes liberals look stupid.","commenter_a":"Her rapist will be the next GOP candidate for president.","post_message":"Police were called to his $5 million mansion after a 21-year-old was allegedly assaulted at his annual Halloween gathering."},{"comment_id":"10152512178746316","commenter_b":"Most doctors are not looking out for you, just the bottom dollar. Research apricot kernels","commenter_a":"Cannabis oil all the way! Id never ever do chemo","post_message":"Radiation and surgery provide more burden than benefit, destroying prostate cancer patients' quality of life in their final years. What would you do if you were diagnosed with cancer? @webpagelink"},{"comment_id":"963433877025367","commenter_b":"DICKHEAD","commenter_a":"Do not support his movies. He will have to stop acting. Rotten person","post_message":"Shocking!"},{"comment_id":"1190973280940010","commenter_b":"All these lackluster punks would do anything for the limelight even give Killary 8 years in White House. Just punks selling junk.","commenter_a":"I used to always watch and listen to GB. No more, lost a lot respect for him.","post_message":"GB getting shoot notes from his team."},{"comment_id":"556763161150305","commenter_b":"Steven...do you suck your dad off with that mouth?","commenter_a":"Oh, that's soooo terrible... You think the several thousand people he had killed didn't fear for lives? The ones who were shot, beheaded by chainsaws, scalped & skinned alive, and who had limbs broken and cut off? Extradite Chapo, throw him in ADX Florence for the rest of his life, and admit this bimbo to a psych ward.","post_message":"Emma Coronel: \"I'll follow him wherever because I am in love with him.\""}]
