[{"comment_id":"1113200062092053","commenter_b":"Hillary is the bigger liar and has laundered millions for her own use through the Clinton Foundation. At least Donald actually worked for his money. She is a murderous also. Her stint as Secretary of State and her private e-mail server has put us in great danger from our enemies. If you plan to vote for Hillary raise your right hand and slap yourself in the face!","commenter_a":"I really like you Dr Carson but if this is true why do you support TRUMP, who lies, has no common sense and won't release his tax returns. He's hiding a lot and we all know it.","post_message":"People all over the nation are starved for honesty and common sense."},{"comment_id":"10153524858391130","commenter_b":"I think the border should be closed to everyone until there is no violence in the USA! Or at least get it under control! There's gangs, rapist and terrorist roaming the streets! People under the fly alert were able to purchase guns yet half of American's aren't aloud to! Smh This government needs an overhaul, the system needs an overhaul!! People are homeless, going hungry and much more yet we still allow people in and they get free food, clothing and housing? Come on now!! This is suppose to be a place for dream's & opportunity!! USA has lost everything it built!!","commenter_a":"how is being again Islam racist ? it's a religion not a bloody race,,ban all organised religion,, there all fucking nutters","post_message":"Trump wants a \"total and complete shutdown of Muslims entering the United States.\""},{"comment_id":"1150998668273937","commenter_b":"There are 5 videos.","commenter_a":"This girl was told to leave the classroom. She refused. An officer was called since a teacher cannot physically remove a student from a classroom. The officer asked her to come with him, she refused and pushed him. She had then assaulted a police officer. Which is an arrest-able offense. She then resists arrest while further assaulting the officer (hitting him). Why does anyone think this is ok? These children have no respect for authority. I see most people defending her. Seriously?","post_message":"This guy can bench press 605 pounds, and he threw that tiny girl across the room. And the one they arrest is the girl who was brave enough to stand up to him."},{"comment_id":"10153522197479255","commenter_b":"Fuck you, lady.","commenter_a":"This people have been drinking the Kool-Aid!!!","post_message":"Obama is officially the best president the U.S. has had in a long, looong time.  By Daily Kos user PCalith"},{"comment_id":"10153208792316336","commenter_b":"Fire her immediately!!! Quit pussy footing around with her!!!!","commenter_a":"And if you believe her I imagine you will be voting for Hillary too. Corruption is alive and well.","post_message":"\"You have to understand, it's not holding back. It's responding appropriately.\"  Baltimore Mayor Stephanie Rawlings-Blake told Fox News' Bill Hemmer she did not give an order for police to hold back as riots broke out Monday night. @webpagelink"},{"comment_id":"10153589057371615","commenter_b":"Yep I had a friend who took kick boxing classes 2x a week and she was in her late 60's ! Don't underestimate a woman nomatter how old 😋","commenter_a":"Ya I'm sure she was really able to get her leg high enough to kick you","post_message":"An 80-year-old Penn Township woman is accused of crashing her convertible while drunk … then kicking an officer in the groin while being placed in a patrol vehicle."},{"comment_id":"1115809875115612","commenter_b":"So basically since federal funds cannot go to abortion services you are going to punish tens of thousands of citizens who rely on the other 97% of services that they offer. Nice job. I see you really are the pro life party.","commenter_a":"How can it be that after viewing the videos and seeing the sonograms that people can STILL only talk about the \"rights of the woman\"? How can that be? And the sad thing is the terrible damage abortion does to women and many men.","post_message":"BREAKING: The House has passed #HR3134, my bill to freeze all federal funding to Planned Parenthood. Grateful to every Member of Congress who stood for life and supported this compassionate measure. The fight is just beginning!  #ProLife #DefundPP"}]
