[{"comment_id":"10156327692315725","commenter_b":"What are we going to do about that?","commenter_a":"You are right, Mr. Trump. I wish we could impeach Obama","post_message":"We need new leadership- fast!"},{"comment_id":"1708937832702911","commenter_b":"I would like one illegal immigrant or one Mexican to please answer this question. Why is an American considered a racist because we want a wall to control the people that we allow in this country. You just can't have open borders and allow anybody and everybody to come in that is not a country anymore. Furthermore why is it that Mexico has a Huge fence with Barbwire and guards in towers with rifles by the Mexican Guatemala border??? What hypocrites!!! Maybe because Mexico does not want illegal immigrants coming into their country from the Guatemala border but Americans are racist if we don't want illegal immigrants coming into our country. Totally absurd!!","commenter_a":"And they have the Bundy 's in jail and killed Levoy . These violent protesters get to go home alive .","post_message":"HOW INSANE! Photos and videos you must see from last night:  @webpagelink"},{"comment_id":"10153202858353352","commenter_b":"Nigger Bitch??? Hahaha So Original","commenter_a":"Only because he was a black cop..... If he was a white cop that cracker would be locked up..","post_message":"Gun enthusiast who shot police chief four times during raid walks free because cops 'didn't have enough evidence to charge him'"},{"comment_id":"10153595542620575","commenter_b":"If its pure crap please backup that statement with facts. America is importing more Muslims than ever before in history.","commenter_a":"He IS scary with his beliefs and agenda for Muslim takeover of the world.","post_message":"The Gateway Pundit - Obama Blasts FOX News, Conservative Media for Making Him Look ‘Scary’"},{"comment_id":"10153634086331130","commenter_b":"It's not the point! The point is that it was NOT any of her, or YOUR, for that matter, business what that girl should or should not wear in this FREE society!! Put on your Spanx, cover your own fat, & shut the hell up!","commenter_a":"Sorry but in order for the dress to have the smooth look she does need spanx. She getting upset when she know damn well she put on spanx under her dresses. Many women fat or skinny wear spanx it's part of a woman's closet.","post_message":"\"I hope this is shared and gets back to you...\""},{"comment_id":"10154001175786336","commenter_b":"She should be held to the same standards as men. Clearly she thought that since she's a 100lbs 5'0 female she should get away with it. She should be held to even higher standards because she is a doctor.... For now at least","commenter_a":"Don't complain about equality between the sexes as long as your OK with women not being held accountable for their actions. A man would be in jail right, now where she belongs. We giggle when women break the law and demand justice when men do the same thing.","post_message":"The confrontation reportedly began when the woman got into the Uber car without a reservation."},{"comment_id":"10154274654574641","commenter_b":"criminals together the murderer of the children in iraq","commenter_a":"We will meet at Hague. ...together with Rumsfeld and Cheney","post_message":"\"I will be with you, whatever\" -- Tony Blair to George W. Bush, 28 July 2002"}]
