[{"comment_id":"10153498336211955","commenter_b":"Why would anyone go? Build the freaking wall.","commenter_a":"Are they trying to raise money for the wall?","post_message":"MEXICO ORDERS TOLL TO CROSS IN"},{"comment_id":"462985670577219","commenter_b":"I'm not pro 15, but we need to realize automation would have occurred with or without a min wage hike anyway. This just hastened it. The problem is most jobs can be made automated including yours too. I don't support give intervention but when pharmacists and construction workers find themselves out of jobs there made need to be some government regulation saying no to so much automation in the future. Human labor being supplemented by robots is not only a minimum wage concern, but one for everyone.","commenter_a":"They got what they wanted, you can't blame Wendy's. Or Wendy's could change the \"Dollar menu\" and make it \"Five dollar menu\" then maybe they could afford to keep all the help, but then nobody could afford to eat out. Oh well","post_message":"Congratulations, Democrats! Your push for a $15.00 an hour minimum wage has resulted in the destruction of Wendy's jobs at 6,000 stores!    \"...we work to offset any impacts of future wage inflation through technology initiatives,\" said Wendy's."},{"comment_id":"539522582917416","commenter_b":"Well screw the NBA Players . . . pansy ass bitches!","commenter_a":"WHO GIVES A BIG RATS ASS WHEN YOU BACK A LOSER !!!!!","post_message":""},{"comment_id":"10153133093676491","commenter_b":"OMG IK WIL DIT NU AHH NERD FEELS OVERLOAD","commenter_a":"@username Bram Van der Maat","post_message":"Attention, fans of The Lord of the Rings Trilogy."},{"comment_id":"10154729418265530","commenter_b":"Shut ur mouth Ried,!","commenter_a":"I guess in political land , it's against the law to investigate corruption and scandals to someone who broke the law , but can't be investigated because it may hinder the election ?? Lots and lots of question marks here ?????????","post_message":"\"Through your partisan actions, you may have broken the law,\" Harry Reid tells FBI Director James Comey: @webpagelink"},{"comment_id":"10154468186761051","commenter_b":"She should never be allowed in another classroom!","commenter_a":"GOOD!","post_message":"This teacher was given the boot after video of what she did to Donald Trump went viral."},{"comment_id":"10152707448786051","commenter_b":"Are you calling ma a stupid whore","commenter_a":"Humans aren't very nice they are constantly making fun of people for every reason possible so don't be shocked","post_message":"When this police officer heard his co-workers mocking special needs children, he lost it."}]
