[{"comment_id":"10153141603253352","commenter_b":"Melissa shut the fuck up!","commenter_a":"Those Black Companies are NOT affiliated with ANY Black Supremacy Groups that's the BIG DAMN DIFFERENCE. WAKE THE FUCK UP PEOPLE.","post_message":"KKK erects billboard in Arkansas advertising local White Pride radio station featuring shows 'This is the Klan' and 'White Women’s Perspective'"},{"comment_id":"10153220467940950","commenter_b":"Lets hope for something known as KARMA, mf'r.","commenter_a":"That's so wrong","post_message":"A video showing a McDonald's drive-through worker offering a reportedly homeless man a burger and then throwing water in the man's face is quickly moving through social media waves."},{"comment_id":"1139418446080798","commenter_b":"Cruz, your are lying conniving little bitch! Trump 2016","commenter_a":"Cruz is full of S&$t, they did not VOTE for him or anyone else. They were not allowed to vote.","post_message":"\"Donald Trump 65,000 people voted in the state of Colorado. They just didn’t vote for you. They voted for our campaign. Or to put it more simply, Donald Trump, it ain’t stealing when the voters vote against you.\""},{"comment_id":"992259924200395","commenter_b":"I do not believe recreational marijuana should be legalized. Medicinal marijuana, yes. But there are enough zombies wandering our streets and driving our roads already, we do not need a bunch of stoners driving.","commenter_a":"It's about time, the stigma needs to go.","post_message":"Finally! It's time to stop throwing kids in prison over a little pot."},{"comment_id":"1410115659014394","commenter_b":"Andres Rivera illegals don't belong here","commenter_a":"IMPORTANT *** California, Montana, New Jersey, New Mexico, and South Dakota, please vote for Donald Trump on June 7. We have 126 UNBOUND delegates who can choose to not vote for him on the first ballot. We need 126+ more BOUND delegates to secure a first ballot win and avoid a second ballot! Vote for Mr. Trump on June 7!","post_message":"The good news is that my campaign has perhaps more cash than any campaign in the history of politics. That's because I am standing 100% behind everything we do."},{"comment_id":"10153591914773132","commenter_b":"Ha","commenter_a":"Well I don't think prada makes sandals his size","post_message":"Looking good, Caitlyn Jenner!"},{"comment_id":"1081326848578752","commenter_b":"Should have been impeached a long time ago. I will believe it when I see it","commenter_a":"No I don't agree on that or anything he ever says. He should have been gone a long time ago.","post_message":"Former House Majority Leader Tom DeLay told Newsmax TV  that if President Barack Obama implemented a plan to require background checks on some gun sales by executive order and without congressional approval, the House should consider impeachment proceedings. Like, Share and Vote in Newsmax’s online poll: Do you support Obama’s gun control? Respond here: @webpagelink"}]
