[{"comment_id":"10153962547876519","commenter_b":"@username Wrong. No Muslim structures where they killed real Americans. You have a lot of anger. Try whimpering in a corner.","commenter_a":"Oh shut the fuck up you unhinged idiots. By this standard, I had two health episodes yesterday. It's really scorching in this city right now.","post_message":"Clinton was observed \"fainting\" in a departure area..."},{"comment_id":"10153396919359087","commenter_b":"X Liberal Pussies who Pimp for Islam! It's Simply one of the MOST Bizzzzaaarre Psychological Spectacles of our Time! The ODD Relationship (do I say \"Love Affair\") between ISLAM and LIBERALISM is a WEIRD thing to watch. HELLO!! Liberal FEMINIST Women!! Islam is a SEXIST Male Dominated, Woman TRASHING \"Religion\"!! Liberals MOCK, RIDICULE Christianity, then turn around and Protect Islam's 1400 Year \"War on Women\" which Treats women like Chattel, and Stones Women to DEATH for adultery. \"Honor Kills\" women when their men feel their women aren't obedient, Muslim MEN FORCE Women into castration, Slavery, to wear scarves, and Burkas!! Muslim Women aren't allowed to Drive and be Educated yet Liberals want to be \"tolerant\" to Islam, but want Christianity to CHANGE!!?? Oh, and GAYS end up on the wrong side of the Stones/BladesToo!!","commenter_a":"Thank you President Obama. I'm so glad I'm not a pussy like most of the commenters here that live in fear of the great big scary Muslims. It must suck to go to bed at night clinging to their guns and religion wetting their pants afraid that Muslims are coming to kill their family. I'm glad I have a president that rises above that childish fear. I'm blessed that God hasn't made me a coward like so many of my countrymen who would gladly trade their freedoms for the veined vail of security. Cowards all of you. And I already know their response. They will call me a delusional libtard that loves Muslims. Without realizing the irony that these were the same people that called white civil rights activists \"n***ger lovers\". This generation of dolts, will too, be wiped away with time.","post_message":"“It was so moving for Michelle and myself in part because it was so representative of the country. You had people from every background, every faith,” President Barack Obama  said after meeting the families of San Bernardino victims.  “Some described their loved ones who had come to this country as immigrants; others who had lived in the area all their lives — all of them extraordinarily proud of the work they were doing to keep people healthy and safe here in this community.”"},{"comment_id":"10153625690231130","commenter_b":"typical black racist asshole!!","commenter_a":"This whole comment thread is a perfect example of what white privilege looks like. If you're white, you have no idea what its like to live in a world where people like you are marginalized. To white people, no nominations must mean that there are no great black movie directors this year. No great black actors this year. No great black actresses this year. In the whole world. But Tom Hanks gets nominated for a movie in which he didn't even talk? GTFOH.","post_message":"Zero actors of color are included in the The Academy's best actor or actress categories for the second consecutive year."},{"comment_id":"10152641754716367","commenter_b":"Yes she is!!! She wears Spanx.","commenter_a":"Mucho baggae...g","post_message":"The Hillary Clinton email controversy is a reminder of one inescapable fact: She comes with baggage."},{"comment_id":"889715544460386","commenter_b":"So tired of this progressive rant. If you come here illegally you need to go home. PERIOD!","commenter_a":"Are they trying to lose the election?","post_message":"She says the holiday-season roundups were \"mass deportations\" that are sowing \"division and fear.\""},{"comment_id":"1781647542076913","commenter_b":"I know that's Ivanka on the right, who's that chick on the left side?","commenter_a":"We need a food addict intervention for Mr. Moore. A good barber, too.","post_message":"Michael Moore is a ____________."},{"comment_id":"1250005395092512","commenter_b":"Damn, please fire her & throw her in jail.","commenter_a":"Ugh...","post_message":"Just another day in America."}]
