[{"comment_id":"347098928826955","commenter_b":"Liars never apologize! They wouldn't know how.","commenter_a":"Not only are they lying but they are racist as well! They hate white people!","post_message":"Lies www.eaglerising.com"},{"comment_id":"1057489254266735","commenter_b":"Deport all illegals ..............","commenter_a":"The funny thing is that it's NOT about amnesty. It's about getting control of a situation that's currently OUT of control. If we don't move forward with the current plan, than what? Yes folks we are not in the same situation, but a much worse one. SIMPLE! Think about it, they are already currently living here and paying NO taxes. Unless we can beam these people up bye my calculations, YEP, there still here. Let's look back at what was actually said, the President NEVER said he was going to legalize any body's current status, just give them a chance to apply while working on there current status. Is it such a bad idea to have these people come out of the dark?","post_message":"I've been telling people for I don't know how many years, you know it as well as I do that's what this is all about.  But no Democrat's ever admitted it."},{"comment_id":"1295210740519395","commenter_b":"You bitch need to learn manners and parents to teach you some.","commenter_a":"That bitch needs a straight jacket and a rubber room","post_message":"The video of the assault is appalling."},{"comment_id":"10154156813446926","commenter_b":"It is indeed a colony of the US, and it cannot survive without Billions of dollars of aid from their masters. Israelis should decide what future do they want for their children, one in which they are perpetually fighting a war, or one in which they can make peace and learn to live with mutual respect. --- As far as ethnic cleansing is concerned..this is again the same issue. It is only ethnic cleansing when the Jews are forced out of their homes, it is not ethnic cleansing when ZIonist militants throw out Palestinians from the homes they were living in for centuries.","commenter_a":"The way I see it Israelis will be in the Palestinian villages for a long time..... society whose leaders campaign for a convicted terrorist to be given the Nobel Peace Prize, a society that teaches its children hatred and violence as part of its standard curriculum, a society that unabashedly teaches anti-Semitism through all means available, a society that puts suicide belts on children during political celebrations, a society that honors, glorifies and funds terrorists, a society that uses a hateful version of religion to poison the minds of its children, a society that engages in widespread jubilation when Jews are victims of terrorist attacks, is not a healthy society that can develop peace of any kind.","post_message":"#Israel's occupation forces in the #WestBank have used at least three Palestinian family homes as military posts in recent months"},{"comment_id":"1306332122711020","commenter_b":"This is America. Let them all leave. We love our National Anthem.","commenter_a":"Oh say can you see your way out of here muslims","post_message":"MUSLIMS ARE OFFENDED AT NATIONAL ANTHEM: They Say It Forcing Them...  THEY WILL NEVER ASSIMILATE!"},{"comment_id":"474511766072737","commenter_b":"Can't do that until you remove the Muslim president who encourages them to take over.","commenter_a":"we need to take our Country back. We outnumber them let stop the insanity. Dont let any mosks be built in this country. We cant build Churches in theirs. If they dont like it here than leave. No one would care.","post_message":"Muslims force this school to ban Christian holidays.  America is under attack, this is treasonous.  'LIKE' if banning Easter is WRONG!"},{"comment_id":"963433877025367","commenter_b":"DICKHEAD","commenter_a":"Do not support his movies. He will have to stop acting. Rotten person","post_message":"Shocking!"}]
