[{"comment_id":"10153744773906880","commenter_b":"Huge write-up on a banker. He took billions of dollars from loser investors. Enron? Says it all. The greatest corporate collapse in US history. Great spin on a shark.","commenter_a":"Jason Espeseth Scott Arnebold","post_message":"He's taking on the issues that no one else wants to confront."},{"comment_id":"426081280913499","commenter_b":"Kiss my ass!!","commenter_a":"Not Surprised, a fight to fight, no reason just out of control. Using excuses for what is being done. If you were really protesting over the treatment of the men and women injured and or killed, you would be ranting about this, not burning up a city, and hurting people.","post_message":"Such a racist sign..."},{"comment_id":"1192837800775695","commenter_b":"@username talk about my mother bitch see what happens.","commenter_a":"No Obama, kiss our ass traitor!","post_message":"Not sure what he thought was going to happen when he started with the name calling, but Obama just gave him a political middle finger."},{"comment_id":"10155521409275354","commenter_b":"Europe is more evil but we r getting there","commenter_a":"The US is so backwards when it comes to nudity. It's commonplace in Europe.","post_message":"Free the Nipple!"},{"comment_id":"10154415987472908","commenter_b":"DUMP TRUMP!","commenter_a":"Quite right. Remember Lincoln : \"A house divided agaisnt itself cannot stand\". Tell that to Trump who is SUPPOSED to be a Republican but he's a disgrace to their histoy.","post_message":"I do not want to see the frustration and the despair that so many people feel being picked apart by people like Donald Trump, preyed upon, in order to divide us again. A few months ago we were supposed to hate the Mexicans who according to Trump were all racists and criminals. And now we're supposed to hate the Muslims. That's not what this country is supposed to be about. We are strongest when we stand together."},{"comment_id":"1514959711853944","commenter_b":"This reminded me of The Series of Unfortunate Events .... But this way wayyy cuter","commenter_a":"Alicia Thomas","post_message":"This is so cute!"},{"comment_id":"1069939893102262","commenter_b":"Agree ^^^","commenter_a":"More far right wing Christian terrorism supported by fox news and the NRA.","post_message":"Anti-Muslim rhetoric has spiked since San Bernardino."}]
