[{"comment_id":"10153396046867452","commenter_b":"what if they didn't do it... cut it off anyway????????????????","commenter_a":"Thats the best freaken law ever. Pass it nation wide","post_message":"\"They have marked this child for life, and the punishment should fit the crime.\"  If an Alabama lawmaker gets his way, part of the punishment for people who commit sex crimes against children will be castration."},{"comment_id":"10153656979036130","commenter_b":"I go, \"You know I had pulled a gun on a white girl...\" She goes, \"I knooooow!\" She got her white privilege isn't real wake up call! You know white girls LOVE to call the cops. When the cop didn't do anything and believed the guy she lost it! Long ass Facebook post! Lmao!","commenter_a":"You never hear Asian, Hispanic, African American, or any other race of men crying over the second amendment. One group only.","post_message":"The legislation mostly targets specific kinds of semi-automatic firearms -- such as AR-15s and AK-47s -- and large-capacity magazines, and adds certain registration and licensing requirements."},{"comment_id":"1058824504164459","commenter_b":"@username are they in mexico legally? if they aren't, they'd be in a mexican jail. if they are. then go after your gvt for not preventing the assaults. the fact is this.. ILLEGAL entry to any country, including mexico, is against the LAW. Mexico has enforced their law and the US MUST TOO. That means a wall since mexican cartels have made another business out of smuggling people into the us and those who can't pay the cartels, find a different way. Mexico didn't like it when Guatemala did it to them and we don't like it here either.","commenter_a":"Mexico has the largest border wall on earth bordering Guatemala to the south in order to protect it from the violence and to protect its mexican culture. It shows the historically true nature of mexican politics since Maximilian was executed. Nothing in mexico is good for America at this time. We dont need there people drugs or crime.","post_message":"\"Suicide bombings in Israel went from 1,000 a year to zero a year once they put that fence up.\"  Yesterday, Mike Huckabee spoke to Uma Pemmaraju about walls, using Israel as an example of why they work."},{"comment_id":"1260373737389011","commenter_b":"The Cocaine Carrot.","commenter_a":"Hahaha","post_message":"Nailed it."},{"comment_id":"10155020049345500","commenter_b":"I can see you are a cold-hearted Republican, but are you a veterinarian? Did you ex-ray and scan the dog for injuries? This dog will suffer for this when it ages. You are an evil woman who abuses animals.","commenter_a":"This is ridiculous. I am the biggest dog lover ever and this is blown way out of proportion! The dog is fine!! Geez","post_message":"\"DEAR PETA! CHILL!\" What else Sarah Palin said in response to criticism after posting a controversial dog photo @webpagelink What's your take?  (Image courtesy Sarah Palin's Facebook page)"},{"comment_id":"10153256294124726","commenter_b":"Deport that illegal!","commenter_a":"Put them all on a boat back to Africa and sink it","post_message":"WATCH: Obama on Baltimore: \"Too Many Instances\" of Police Target Poor African Americans"},{"comment_id":"10152608656372894","commenter_b":"Women also cheat with their hearts minds and bodies too soooooooo","commenter_a":"The pic of him with the female outside the car looks like he was taking a pic with someone ... Ppl have cousins sisters groupies fans and friends that they don't sex !!!all these bitter broken hearted ppl jumping the gun obviously wasn't nothing serious he joking about it on Twitter .... Buuuuuut carry on","post_message":"Was Nick Young Caught Creepin' on Iggy Azalea in the Car SHE Bought Him for Christmas? [Photos]"}]
