[{"comment_id":"10152731282606051","commenter_b":"She is one sick bitch.","commenter_a":"She takes care of a disaled child and sick husband , I would worry aout what she would do to them as well. The punishment is far to lienient.","post_message":"This lady arranged to have a woman raped after she outbid her for a home. Some say her punishment should’ve been more severe. Decide for yourselves if that’s true."},{"comment_id":"941353829241191","commenter_b":"I know who im voting out of office. Bye bitch","commenter_a":"Bullcrap","post_message":"A recent legislative proposal from Rep. Carolyn Maloney (D-N.Y.) would require Americans to obtain liability insurance before exercising their 2nd Amendment rights. Maloney claims her legislation, the Firearms Risk Protection Act, would make gun owners act more responsibly. @webpagelink"},{"comment_id":"10153598049151336","commenter_b":"Kill her","commenter_a":"Molly, America loves you.","post_message":"Former Baltimore Ravens cheerleader Molly Shattuck was sentenced to two years of probation after pleading guilty to raping a 15-year-old boy at a vacation rental home in Delaware."},{"comment_id":"10154274654574641","commenter_b":"criminals together the murderer of the children in iraq","commenter_a":"We will meet at Hague. ...together with Rumsfeld and Cheney","post_message":"\"I will be with you, whatever\" -- Tony Blair to George W. Bush, 28 July 2002"},{"comment_id":"10155927830195354","commenter_b":"Donald Trump is going to be the next President...you can take that to the bank...","commenter_a":"Why don't they read these polls, it's too obvious to conservatives like me. Do I trust Trump, not totally, but I do more than most of the GOP minus Ted and Rand. Let's get this country back conservatives, go Trump","post_message":"When over half your voters don't feel like you're looking out for them..."},{"comment_id":"10153387072137869","commenter_b":"Agree, illegal must not be here in American Soil to live and receive any government aide at the first place.Gosh, our Social Security money and taxes we are paying will be given to these illegal people who enter here in our country. BTW, before you No Brain people forget, we have more American Citizens who are diasable, and have low income but working who needs help from our government and now, who gets more benefits, these illegal. Enough is enough.","commenter_a":"STOP THE REFUGEE PLAN! Obama you are shameful sir, putting Americans in harms way! At least France understands what we are up against! You are not a King! We need to cleanup DC and his cartel and vote them all out 2016. Implement term limits and background checks to stop the corrupt career politicians. We want leaders who will enforce our CONSTITUTION the SUPREME law of the land. Enough is enough! Vote Donald trump 2016","post_message":""},{"comment_id":"10154905959166320","commenter_b":"Women hate liars...","commenter_a":"no they just hate the mean ones 😬","post_message":"What do you make of this? In an interview Madonna said, 'Women Betrayed Us' by Voting for Donald Trump.  Also she said that she has not had a good night's sleep since the election.  (Image: Fox News/AP)"}]
