[{"comment_id":"667242780097527","commenter_b":"YES!","commenter_a":"Yes","post_message":"Would Donald Trump be a better president than Obama?"},{"comment_id":"10153325885524087","commenter_b":"Such an ignorant cow!","commenter_a":"Hideous hag.","post_message":"“They can wait if they like until next November for the actual balloting, but Donald J. Trump   was elected president tonight.” Ann Coulter tweeted."},{"comment_id":"1394774427201577","commenter_b":"She shouldn't even have a job because she is an illegal alien.","commenter_a":"Frank tokar maybe if you were in her parents situation would do the same , you do anything to make sure sure your children are safe and have the best you can give them , USA is a líder no a low un respectful selfish heartless country thanks god no every American think that way USA is a country of opportunities no one takes your jobs away all depends on you how hard you work .","post_message":"Rick Santorum and Anna Navarro engage in a passionate exchange with a DREAMer who says she may lose her career if the new administration ends DACA. @webpagelink"},{"comment_id":"10153961213080579","commenter_b":"Right wing ammosexual Xtians kill more people in this country than Muslims.","commenter_a":"obama Will NOT FIGHT HIS BROTHER MUSLIMS.. BUT He WILL Help them.","post_message":"\"France is at war.\" French President Francois Hollande to Joint Session of Parliament.  Watch complete video here: @webpagelink"},{"comment_id":"10153877177851162","commenter_b":"Get raped to death","commenter_a":"I'm not sure if they deserve death or to get raped everyday. Tough call.","post_message":"JUST IN: Two men have been charged with murder in the fatal shooting of a pastor's pregnant wife during a home invasion.  Amanda Blackburn was raped and shot in the head during the attack at the couple's home. She died the next day.  NEW DETAILS: @webpagelink"},{"comment_id":"10153372391166509","commenter_b":"Chris? Am I? Interesting. Here I thought I was just pointing out the facts! :)","commenter_a":"Gotta love Global Warming!","post_message":"It's so cold, #NiagaraFalls froze. Photographers were drawn to the breathtaking icy formations: @webpagelink via CNN iReport"},{"comment_id":"1362078013830431","commenter_b":"Cruz....Kiss that ass.","commenter_a":"Mr. President, Please do not squander this opportunity to put a conservative in the Supreme Court. This is extremely important, we do not need someone who's going to be a straddle of the fence. We have too much anti-American government, anti-Constitution battering happening inside our nations capital and a crossed our nation, we cannot afford to make evening a half step in the wrong direction. Please Mr. President I implore you to please hear my request, my plea.","post_message":"Ted Cruz NAILS it, everyone needs to see this!"}]
