[{"comment_id":"10153752322536523","commenter_b":"He sound dumb then a mfa","commenter_a":"#5 don't count on a police presence to deter being shot .","post_message":"Chief Flynn's four-point plan for not getting shot in Milwaukee is as follows, according to a statement from the Milwaukee Police Association:  1) Don't belong to a gang 2) Don't be a drug dealer 3) Don't carry an \"illegal\" gun 4) Assure you're not going up against someone that has a worse arrest record than yours"},{"comment_id":"888955024560582","commenter_b":"Yeah!!!","commenter_a":"@username @username lunch 2mrw?!","post_message":"When you realize tomorrow is Friday... (click to play)"},{"comment_id":"10155915782125354","commenter_b":"I'll bet the gals concerned about this shirt just flat out don't qualify to wear one.","commenter_a":"dont want one dont buy one...must everything be a crisis?","post_message":"Feminists are up in arms about this T-shirt. Should Target cave to their demands?"},{"comment_id":"10153590637376336","commenter_b":"Nuclear is clean efficient and it's a country's pride! Do you know ordinary Iranians are really nice folks?","commenter_a":"Boy this Iran sure wants nuke power really bad, but what I don't understand is why they need nuke power to light up clay homes in the desert. Does anyone else see a different picture? America used wind, coal, steam as a first time power source.","post_message":"Iran will reportedly be allowed to use its own experts to inspect a site it allegedly used to develop nuclear arms under a secret agreement with the International Atomic Energy Agency."},{"comment_id":"1098657656855065","commenter_b":"She's a DOPE, I don't know about Doped up.","commenter_a":"So stupid Andddddddddddddddd Hillary nearly fell stepping off the podium She looks doped up","post_message":"UNREAL! WATCH JOE BIDEN Point Out The Guy Who \"Follows\" Him Around With The NUCLEAR CODES Right After Saying TRUMP Couldn't Handle The Codes [Video]  And we have THIS clown in charge?"},{"comment_id":"1187171674668927","commenter_b":"She has a brain?","commenter_a":"Alote of Americans support her I think we may be the ones with brain damage","post_message":"Is something wrong with Hillary's brain?"},{"comment_id":"10153086168389411","commenter_b":"that is why she is the ex","commenter_a":"Hell hath no fury like a woman scorned.","post_message":""}]
