[{"comment_id":"367721800082095","commenter_b":"Lol \"rape culture\" sweetie go live in the Congo where the war lords use rape as a tool and come back and tell me this label is \"rape culture\" rape is a serious and horrible crime that doesn't need to be trivialized with your suburban feminist mindset.","commenter_a":"Rape culture nonsense again. The world gone mad. Get a life feminists. A slogan on the beer isnt going to encourage rape for fuck sake.","post_message":"\"The perfect beer for removing 'no' from your vocabulary for the night.\"   What?!?!"},{"comment_id":"10153775506759203","commenter_b":"@username Look over this list....Drugs & guns to YOUR front door, so tell me again how gun control works!!!! @webpagelink","commenter_a":"Gun bans have always had the same effect once implemented: none. They do not create a (sustained) period of increased murders, nor do they reduce the rate of homicides.. @webpagelink","post_message":"\"We can toughen background checks and stop the sale of firearms to folks who have a violent history or history of mental illness.\"  Amy Schumer"},{"comment_id":"1027310527363527","commenter_b":"go girl go!","commenter_a":"Now do it with 40 pounds of gear and a drill instructor screaming at you. lol","post_message":"Meet Milla, a 9-year-old girl that just dominated a Navy Seals obstacle course. (via NowThis)"},{"comment_id":"484307825084431","commenter_b":"Funny women are one of the fastest growing group of gun owners .She loses all credibility when she mentions dicks ....so pitiful and uninformed ...","commenter_a":"300 million guns in this country - not enough?","post_message":"How about not...."},{"comment_id":"1750985641784496","commenter_b":"What that is the craziest thing I have ever heard he's not racist just because he wants to build a wall and stop Muslims from coming into the country until we have a better way of verifying documents he said nothing about that","commenter_a":"are you kidding me. assama has set this country back 50 years","post_message":"Democratic leader says Donald Trump will bring back segregation.  Is he being this obtuse on purpose, or does he really believe this? #TTT16"},{"comment_id":"683878711749701","commenter_b":"By the way, good little robot response, Hudson. Care to elaborate?","commenter_a":"I've always admired Colin Powell. Mr. Powell said the Iran deal is a good deal. That's good enough for me.","post_message":"The nuclear deal with Iran risks the safety and security of America and our allies. It must be stopped. #NoNuclearIran"},{"comment_id":"818380371637006","commenter_b":"These women supporting Hillary are the most delusion bunch I have ever encountered... I'll leave this video of a woman providing facts about Hillary, so that you know just how delusional to are, and if you still support her after watch this video, you are just as bad as she is. ALL WOMEN SHOULD WATCH THIS BEFORE VOTING FOR HILLARY CLINTON: @webpagelink","commenter_a":"I was delighted and elated to put my vote for y-o-u Hillary! Ive been waiting for this moment and plan to bake cookies to celebrate your election. Much love kindness snd goodwill, Jean","post_message":"\"Get this Donald: Nasty women are tough. Nasty women are smart. And nasty women vote.\" —Elizabeth Warren IWillVote.com"}]
