[{"comment_id":"10158094006710354","commenter_b":"Great job! This is why some illegals should be deported","commenter_a":"So sad.","post_message":"HORROR:"},{"comment_id":"10154284247599575","commenter_b":"Throw her in with the hardened inmates. Id love to see how \"pretty \" shed look then","commenter_a":"Oh god not another one...","post_message":"This bad girl is getting lots of social media love for her attractive mugshot.  Just keep in mind she's charged with aggravated robbery, kidnapping, first degree battery, hindering prosecution, and tampering with physical evidence."},{"comment_id":"10150887913809999","commenter_b":"Ya and she is going to jail if she don't win so she will say anything to get her way! She will do what ever it takes.... Murder . lie . steal. #Trump2016 #MakeAmericangreatagain #GodblessAmerican","commenter_a":"I can't believe Americans will vote for this idiotic woman, but they will and bring another 4 years suffering to the world","post_message":"\"Donald Trump has built his campaign on prejudice and paranoia. He is taking hate groups mainstream and helping a radical fringe take over the Republican Party,” Hillary Clinton said."},{"comment_id":"496840043839909","commenter_b":"No she should not!!!!!!","commenter_a":"well at least something can move them","post_message":"America in uproar after this Sarah Palin Picture leaks.  We stand behind her 100%. We need to show her our support.  Should Sarah Palin Refuse To Take Down This Picture?"},{"comment_id":"10153963536777235","commenter_b":"And a large percentage of illegal immigrants simply come here legally with a visa and just don't leave.","commenter_a":"The wall is absolutely absurd. See the ocean? You can use it to go around the big ugly wall. See the airplanes? You can go over the wall. Ask El Chappo about going under things. It's nostril flaringly stupid. Ancient technology. Pre airplane, backhoe and no ocean on either side. It would be funny if there weren't so many truly stupid people believing it. Gag, cough, hurl.","post_message":"BUSTED!"},{"comment_id":"807700012661940","commenter_b":"But she did. Shouldn't no one not have to go anywhere because fools can't handle their jobs.","commenter_a":"She should have never went to TX in the first place TX is not place for decent law abiding people as we see what happened to her over a signal change, TX is a rebel state always has been that way, and their federal support for programs should be stopped right away. Any kind of support needs to be stopped and let them people that love that place pay for their own social ills then see how they like that","post_message":"\"How did switching lanes turn into all of this?\""},{"comment_id":"10154138194905329","commenter_b":"Look it says right here you're a little bitch.","commenter_a":"@username we got a badass over here","post_message":"When even art is tryna make gainz."}]
