[{"comment_id":"10153630304246509","commenter_b":"Guess you've never heard of Irish-American clubs. Guess you've never heard of Italian-American, German-American, Polish-American or perhaps people celebrating their ethnic heritage. So apparently pride in one's ethnic origins is not extended to Black Americans. What is the name Rush? English? I'm betting someone in your family came over on the Mayflower? Proud of that? Why not? Apparently if you were taken against your will in irons on a slave ship you also lose your ability to take pride in your heritage as well?","commenter_a":"There is no such place as \"Africa-America\" therefore there is no such thing as an \"African-American\". They are either Americans or they are Africans. Not all blacks come from Africa and not all Africans are black. Why don't they try and be American's for once in their life's?","post_message":"After recording an ode to Baltimore, #Prince has announced a Mother's Day rally and concert there. Concertgoers are invited to wear something gray: @webpagelink #FreddieGray"},{"comment_id":"10153792774496162","commenter_b":"Anna Silva","commenter_a":"Lisa DeRosa Raphael","post_message":"Lucky Charms has finally created a marshmallow-only version of its cereal: @webpagelink"},{"comment_id":"760411690754543","commenter_b":"We have enough oil in this country for the next 400 years but John Bush wants arab oil imported not american oil","commenter_a":"We've had enough of oil energy and oil families like yours. Get lost. You're not welcome on this planet anymore.","post_message":"If we embrace our energy revolution, we can create millions of jobs and higher wages: @webpagelink"},{"comment_id":"10153580270695575","commenter_b":"If this is true, which I'm sure it is, how sick. But this is what the female liberals want. Oh is saying female liberals not PC?","commenter_a":"The Missing link!","post_message":"The Gateway Pundit - Muslim Dad Kills 4 Year-Old Daughter for Not Covering Her Head"},{"comment_id":"10154026278303812","commenter_b":"She killed herself she was the ignorant idiot","commenter_a":"How about a conviction and prison time for a change, send the message loud and clear.","post_message":"JUST IN: TX grand jury indicts trooper who first stopped Sandra Bland in her car on perjury charge. @webpagelink"},{"comment_id":"10153150995326051","commenter_b":"You see how gay women are not fully gay . They still want dick !!!","commenter_a":"Is it a dildo? I'm not clicking I want to guess","post_message":"The police here had seen a lot of strange things before, but even they had never witnessed something quite like this."},{"comment_id":"939719642754180","commenter_b":"Or he could just drop dead and save his family the embarrassment and the courts the cost.","commenter_a":"IF any of this is even true, if you waited this many years, you own it. Grow up.","post_message":"The once beloved comedian will hopefully not get away with his alleged horrific crimes against women."}]
