[{"comment_id":"10153111531487483","commenter_b":"While yes , abortions do bother me, I can see where they are necessary in some instances HOWEVER, I don't believe the federal and state govts ought to pay for an abortion that is not medically necessary!","commenter_a":"Here we go again..Same poop, different day. Same old narrow-mindedness and folks being too lazy to do ACTUAL research. Some people are so close-minded that even if you had the proof right in front of their face, they wouldn't believe it. \"Oh my God! Planned Parenthood (PP) does abortions!!! We MUST stop them NOW!!!!\" *SMDH* Heaven forbid that they actually admit that PP provides other things to both women AND men as far as health screenings, treatment and counseling. So go ahead you Fools, and defund a program that low-income families have depended on for years. I just don't understand how some folks call themselves \"Christians\".","post_message":"Planned Parenthood says Medicaid patients have a right to choose their health care provider. A 21-year-old woman, who has received contraceptive shots from Planned Parenthood, joined the lawsuit against the state."},{"comment_id":"10154271812178717","commenter_b":"Seems like all women think of is sex lol","commenter_a":"I would love to see the media dig deeper into this story--if possible. So many details baffle me. Why was she with Rood and Ross in the hotel room, sharing a bed? If sexual abuse/assault was part of this web that led to her death, I hope it's exposed and the appropriate people are charged.","post_message":"Jazzmyn Rood was sentenced Friday for her role in the 2015 death of Eve Tarmey. Details here: @webpagelink"},{"comment_id":"10153173280761491","commenter_b":"LMAO this is a joke!!!! Yea right, sure. And the first lady, Kim Kardash can show the sex tape she made in 2003 for company to the White House. This is what gave her fame and made her millions, Something she sure can be proud of and maybe even have her pres hubby pass a law that it be played in all public schools. LMAO","commenter_a":"Bernie Sanders","post_message":"It's still unclear if he's serious."},{"comment_id":"1770447173221488","commenter_b":"She's bitching because Trump will make her put on clothes lol","commenter_a":"She hasn't enough brains to have that much feeling for a cause","post_message":"Miley Cyrus has a clear message about Donald Trump becoming President."},{"comment_id":"684042675091009","commenter_b":"Hillary is guilty as sin . She should be in prison along with all of her Clinton Crime Mafia.","commenter_a":"Maybe he is scared of being the next victim to die like the FBI suspected leaking the emails.","post_message":"BREAKING: CLINTON CLEARED...Was This A Coordinated Last Minute Trick To Energize Hillary's Base?   This only proves why we need TRUMP to DRAIN THE SWAMP! We are a Banana Republic!"},{"comment_id":"507357776079666","commenter_b":"This bitch","commenter_a":"What a whacko...and who says \"keen\" anymore?!","post_message":"Look at me! Look at meeee! I'm better than Hillary!   -Linda"},{"comment_id":"10153550520716336","commenter_b":"Hillary might be in jail.","commenter_a":"It's obvious that @username wants Jeb Bush to be the Republican nominee. On the Debate last night, NO ONE received harder questions than Donald Trump. NO ONE! I don't want Jeb Bush or Donald Trump to be the nominee. @username you're NOT being Fair and Balanced.","post_message":"Which GOP presidential candidate do you think gave the most impressive performance during the Fox News-Facebook prime-time debate?"}]
