[{"comment_id":"1693302644277794","commenter_b":"Great news. She does anything to get publicity","commenter_a":"Good the left wing nut.How does this broad even have a job?","post_message":"Melissa Harris-Perry is refusing to host her show this Saturday due to weeks of pre-emptions that she says has left her \"silenced.\""},{"comment_id":"1695518967374741","commenter_b":"NOW do you understand why Ross Perot ran as an Independent in 1992? The parties are both corrupt and they control who gets elected, no matter how many citizen vote.","commenter_a":"All I'm hearing is boohoo I lost so now I have to blame it on something else. If your as smart as you claim you would have known the rules, moron! And look at all your inbred supporters, they have no idea how the laws or rules work either! Go Cruz!!!","post_message":"At least in Colorado they didn’t even pretend to care about what the voters think!"},{"comment_id":"1021100727949032","commenter_b":"I'm no a socialist I'm a total independent from the corruption government..I'm so proud of myself","commenter_a":"Bernie Sanders it's a socialist.. !!","post_message":"We're live in the #GOPDebate hall!"},{"comment_id":"10153148530580329","commenter_b":"It's not a fuckbuddy it's a weak ass pussy who ain't bout shit","commenter_a":"What is a f*ckboy? I must be getting old...","post_message":""},{"comment_id":"576578859168253","commenter_b":"STRONG.","commenter_a":"C U N T!","post_message":"Describe Hillary Clinton in one word."},{"comment_id":"1825547344399892","commenter_b":"Guess what? They don't want her in their sh*thole!","commenter_a":"Please stop telling them any different! We don't want them coming here!!","post_message":"More liberal condescension and arrogance."},{"comment_id":"10156823156490594","commenter_b":"I don't want my great-granddaughters going into to bathrooms where males are also present. I'm not talking about transgender; there are sick people that will use that as an excuse to be were they shouldn't","commenter_a":"I never really shopped at Target's, I will now. I'm glad your taking a stand for the transgender population. So sad that people's lack of knowledge or fear make them judge.","post_message":"\"Inclusivity is a core belief at Target,\" said the retailer in a statement. \"It's something we celebrate.\""}]
