[{"comment_id":"519399201582629","commenter_b":"I hope one of hillary Clinton refugees knocks on your front door. . . You will probably be dead after that tho. . . She will continue to destroy this country and you want her to. . . Good job","commenter_a":"To bad his parents and Trump feed the poor kid lies. She has not been found guilty of anything and in this country you are innocent until proven guilty. You need to get of the Benghazi kick. The ambassador's family has come out and said it was not the State Department or Secretary Clintons fault. Grow up people. You would rather have a racists , hatred spewing, women hating asshole in office?","post_message":"BOOM!"},{"comment_id":"10153437815231680","commenter_b":"She is worthless!!","commenter_a":"Hillary... Who DA feck Cares!!!","post_message":"Hillary Clinton: \"Well, as one of the more than 65 million Americans who voted to reelect Barack Obama, I’d say my voice is being ignored right now because of their obstructionism.\""},{"comment_id":"10153010443401336","commenter_b":"I bet you don't even know what a p value is lmao.... Please don't reproduce...:)","commenter_a":"should be legal everywhere","post_message":"Possession of marijuana is no longer a crime in Alaska, but smoking it in public can lead to a $100 fine.  Should more states follow suit?"},{"comment_id":"10153641052531509","commenter_b":"@username, I'm willing to bet that Elizabeth up there hasn't murdered any teenagers. It's possible that she's never even been arrested. I won't mourn a guy who can't seem to keep trouble away from him.","commenter_a":"Too bad the gunshot didn't kill the punk.","post_message":"George Zimmerman, acquitted in Trayvon Martin's death, has suffered a minor gunshot wound in Lake Mary, Florida, police tell a CNN affiliate. @webpagelink"},{"comment_id":"10154000261646337","commenter_b":"Tiny Fey and Amy Poehler would so destroy you right now with words of girl power and women unitedness. #Womanizer","commenter_a":"#BETsoBlack am I doing this right or nah?","post_message":"'IT'S A REGRESSION': Will Smith stays positive about the #Oscars and Hollywood's bigger problem with diversity..."},{"comment_id":"10152632992600927","commenter_b":"When has she even known what is going on? The woman is AWOL in the brain department.","commenter_a":"Iranians are our enemies you idiota","post_message":"She's backing Obama's Iran response.  What do you think?"},{"comment_id":"10150514383944999","commenter_b":"All terrorists are Muslim?","commenter_a":"\"Boko Haram (\"Western education is forbidden\"), officially called Jama'atu Ahlis Sunna Lidda'Awati Wal-Jihad (People Committed to the Prophet's Teachings for Propagation and Jihad), is a militant Islamist movement based in northeast Nigeria.\" There's that common denominator again: Islam.","post_message":"Soon after Boko Haram kidnapped nearly 300 teenage girls in Nigeria, the U.S. sent surveillance drones and about 30 intelligence and security experts to help the Nigerian military try to rescue them. Seven months later, not one of the kidnapped girls has been found."}]
