[{"comment_id":"838550182928031","commenter_b":"i feel bad 4 you girls cuz i used my dick tip","commenter_a":"Christoffer Kindmark","post_message":"@webpagelink"},{"comment_id":"963433877025367","commenter_b":"DICKHEAD","commenter_a":"Do not support his movies. He will have to stop acting. Rotten person","post_message":"Shocking!"},{"comment_id":"426004474226175","commenter_b":"Oh, and fuck Conservatives. They're the ones who started anti-gun laws. Reagan and the NRA (racist hypocrites) got restrictions for firearms in California in response to the Black Panthers having a PEACEFUL open-carry demonstration. If Obama did the same thing to OPEN CARRY California, you'd probably be screaming for his head on a pike.","commenter_a":"Killing people sanctioned murder to satisfy blood lust and a wanting for revenge. Sounds pretty medieval and 3rd world to me.","post_message":"We traveled the world to ask people about the the death penalty."},{"comment_id":"780004342132746","commenter_b":"He said he wants all immigrants to be required to carry an ID with their status, which sounds logical to me and he repeated what others said. \"We know not all muslims are terrorists but it appears all of the terrorists are muslims\". When was the last time you saw a Buddhist terrorist, or a sikh terrorist, or for that matter an atheist terrorist? You just don't. Our biggest threats come from the middle east right now. It was perfectly fine while we were at war with the Japanese to pay extra attention to them. It was perfectly fine during WWII to keep an eye on immigrant Germans. What is the difference now? Why are we going to try and justify keeping our sovereign nation secure. Every other country does it. There is no law that says we have to accept immigrants. We are allowed to pick and choose, just ...","commenter_a":"Well, all was well and good until the part that was speaking of hate speech from the presidential candidate. Well he was obviously speaking of Mr. Trump. Unfortunately he is completely wrong. Mr. Trump used no hate speech at all. The only thing said was that he thinks we should stop the middle eastern refugee immigration until we could confidently vet them. This would be a temporary action. But of course the way the bleeding heart liberal media spins it, is that he want to cut off all immigration. This is another one of those stories that is attempting to drive the narrative and falsely force people to have negative opinions without the facts. The media wants people to believe that Mr. Trump said these awful things because the media hasn't been able to manipulate him and force him to fall into step. The media and the establishment are scared ...","post_message":"It's the little things... ;)"},{"comment_id":"1219889091393445","commenter_b":"Is it racist to say pot calling kettle black ?","commenter_a":"Cummings is a walking violation of ethics. Pot call.","post_message":"Whoops."},{"comment_id":"10153188549718812","commenter_b":"Why don't they beat men cuz the guy cant","commenter_a":"Good","post_message":"JUST IN: NASCAR says driver Kurt Busch has been suspended indefinitely: @webpagelink"},{"comment_id":"10152956795647093","commenter_b":"Definitely a woman","commenter_a":"She looks like she could be a man in a wig","post_message":"Arlington police would like your help finding a car burglary suspect caught on camera..."}]
