[{"comment_id":"10153716841688132","commenter_b":"Sorry but he's not BLACK!!","commenter_a":"Ok President Obamas mother was white.His Grandparents were white.How can white people who say he does not care about white people Really ! You r all pissed because our President is Black?thats the issue with ignorant people who continue to blame our President.Im sure George Bush would not have done anything","post_message":"Barack Obama won't be intervening in Kelly Rutherford's international custody battle."},{"comment_id":"10153195743346051","commenter_b":"Bitch need a ass whooping!!!!","commenter_a":"need to stick her head in a toilet a few times til she thinks she's drowning","post_message":"Decide for yourselves if this woman got off too easy."},{"comment_id":"10152510366081813","commenter_b":"Sound like another feminists that loves the idea of discrimination. Gee, imagine finding you here.","commenter_a":"And then ACLU discriminates by stating \" This one is dedicated to all the girls out there\".. LOL","post_message":"This one is dedicated to all the girls out there who prefer reading science fiction and history books to love stories.  @webpagelink"},{"comment_id":"1067424023316727","commenter_b":"Just what the world needs- an entitled fat black woman - how unique....","commenter_a":"i am sorry but i am so sick and tired of la'porsha bashing on FB, that is her opinion which she is entitled to. she was probably raised in a small town with narrow minded views and parents who put those ideas in her head. she is a beautiful talented woman who is raising a child on her own since was a victim of domestic abuse. she is using what she went through to help other women dealing with the same. we need to focus on her talent and contributions to society not her own personal views. i am gay and i have gay friends who are not thrilled with the gay lifestyle either, and it's this kind of unnecessary bashing which causes negative feelings. i voted for the ultimate winner trent who also was from mississippi and i don't see any interviews with him about the lifestyle. so ease ...","post_message":"Should we forgive La'Porsha Renae ?   American Idol"},{"comment_id":"376942655827362","commenter_b":"Go Back To your frickin homeland!! We did not invite you here!!","commenter_a":"Deport them","post_message":"The want to change Easter in \"Spring Break\"..."},{"comment_id":"10153953305054170","commenter_b":"It's really too bad the 'Pinoccio' factor isn't for real, Hillary would have four foot nose by now to go with her bulging eyes! Having made statements in front of people and then denying it, shows that she that she thinks we're all stupid! Well the jokes on you Hillary 'Rotten' Clinton, you're the 'Poster Child' for stupid! Careful what you say 'Hill' people around you do have a memory!","commenter_a":"Nothing has \"doomed\" her yet, doubt this will...","post_message":"Hillary definitively busted in another lie, by the father of one of the Benghazi victims. The media will try their best to ignore this so we're going to have to do their jobs for them."},{"comment_id":"1029260857170166","commenter_b":"What a crock of bull","commenter_a":"Because made in China is cheaper thanks to unions","post_message":"Financial setbacks hit the \"Made in America\" brand."}]
