[{"comment_id":"1135581816480053","commenter_b":"I was just going to say that! I don't even think Taylor Swift could pull off that jacket well. It's apropos for this witch though: an ugly jacket for an ugly person","commenter_a":"What's worse is it looks hideous. She could have found a nicer jacket at Kohls!","post_message":"Does something seem wrong with this picture!"},{"comment_id":"741587372614642","commenter_b":"Won what???","commenter_a":"You blind-hearted Zionists, you just can't bear it that the Iranians have won and you lost: can you; the barbarians!","post_message":"A year after war with Israel, Gaza rulers boast of revitalized efforts to prepare its fighters for the next round of violence."},{"comment_id":"1181915768493312","commenter_b":"This bitch is just flat out stupid.","commenter_a":"Die cunt!!!","post_message":"Hillary Clinton on Wednesday again criticized Sen. Bernie Sanders, for his stance on legal immunity for gun manufacturers."},{"comment_id":"596327983852216","commenter_b":"@username... The woman is CHEATING. She's actually bussing mentally deficient people to the polls to vote for her! She and Bill are colluding to steal elections by interfering with voters at the polls! She is so despicable, and frankly, anyone who knows about this stuff and supports her anyway DESERVES a Trump presidency.","commenter_a":"(DISCLAIMER: YES I VOTED FOR BERNIE IN THE PRIMARY. THE FOLLOWING POST CONCERNS A HYPOTHETICAL SITUATION WHERE HILLARY IS THE NOMINEE) To the Hillary bashers, you do realize that she is ideologically identical to Bill Clinton and almost identical to Obama, right? If you found those presidencies to be solid, ok, or even mediocre, that is a hell of a lot better than the potential authoritarian nightmare we have coming with a Trump presidency or republican control of all of government (see Kansas or Louisiana for what happens when the tea party can do whatever they want unchecked). And yes, again, I voted for Bernie in the primary.","post_message":"One thing is certain: While I’m excited to cast my vote for Bernie Sanders next month, I’ll be more than ready to cast my vote for Hillary Clinton in November."},{"comment_id":"1861021464115839","commenter_b":"Fits his class level.","commenter_a":"Ignorant","post_message":"WARNING: Graphic content"},{"comment_id":"10154064678631336","commenter_b":"@username I won't vote for trump ! I will support the other republicans !","commenter_a":"Donald Trump understands better than anyone why the country is so much in decline. He understands how our politicians have sold us down the river with trade deals that benefits other countries and lines the pockets of foreign lobbyists who give away our wealth and jobs for their own gain. This is why the Establishment hates and fears Trump so much. Our country is 20 trillion dollars in debt because of all the corruption by both sides that are owned by the same people. Trump understands that if we do not get a wall on the border we will lose the country. Because all of the over 12 million illegals in this country are going to vote DEMOCRAT once some RINO or liberal gets into office and gives them Amnesty- THAT will mean the extinction of the Republican party and we will become a third world socialist nation. The Establishment ...","post_message":"“The lessons of 9/11 are being forgotten by a lot of people. And that is: A human condition elsewhere matters to our national security.”  Do you agree with former President George W. Bush? @webpagelink"},{"comment_id":"10153169137025950","commenter_b":"Ella Patrice Nierva","commenter_a":"Ricardo Alvarez","post_message":"WATCH: Little girl can't wait another second to hug her soldier dad, runs to him in the middle of a ceremony @webpagelink"}]
