[{"comment_id":"10153949454199087","commenter_b":"This idiot is a democrat? I bet no one saw THAT coming...","commenter_a":"Send this loser to another planet.","post_message":"Democratic congressman Hank Johnson on Monday compared Israeli settlers to termites while discussing Israel-Palestine relations."},{"comment_id":"10154602840309877","commenter_b":"It's not going against the majority, it's supporting a fascist bigot. Only a fool wouldn't know the difference! Girl bye! Your post was asinine.","commenter_a":"Dang....wow. That was unnecessary. Smh So if you go against the majority then you get fired or blackmailed. Yeah, okay. That's totally okay, just sit down, shut up and get on the broad path like everyone else.","post_message":"It was all good just a week ago."},{"comment_id":"10154498468358690","commenter_b":"Julia I was having discussion with other posters in the same tone.. You should be ashamed that you cannot tell the difference . Who do you think you are to tell others ? Get off my post ! Then hit the block button . Theres a good little troll.","commenter_a":"What nonsense. The trouble began when Islam became the majority religion. ISIL is just a mixture of many Islamic terrorist organizations. The mistake the US made was leaving all the weapons and armory behind thinking Iraq would use them to fight them , instead a lot of the Iraqi army used them against eachother.","post_message":"The Iraqi town of Saadiya's problems began after the 2003 US invasion."},{"comment_id":"902494896546891","commenter_b":"I told you I was going to get her out","commenter_a":"@username she's a chunk! Pictures were a lie! 😁 She's out @username lol","post_message":"Our camera caught the middle school teacher who reportedly got pregnant during an affair with an 8th grader as she left the jail. We had questions, but she didn't have any answers. Full video: @webpagelink"},{"comment_id":"10153229988242293","commenter_b":"And who would that lady be? Certainly not this four times married adulterous who're?","commenter_a":"It takes lady to show the world what TRUE VALUES are; and how STAND UP in those VALUES ...!!","post_message":"Kim Davis entered the Carter County Detention Center under cover of night five days ago. She emerged to Survivor’s “Eye of the Tiger.”"},{"comment_id":"10154475429571336","commenter_b":"One could only hope. But she seems to be too slimy to catch!","commenter_a":"Wikileaks founder, Julian Assange, has said that Wikileaks has obtained information that, when released soon, will guarantee a Hillary Clinton indictment. During a recent interview with ITV, Assange said his next release will “provide enough evidence” to see Hillary arrested.","post_message":"At the Veterans of Foreign Wars VFW convention, Donald J. Trump slammed Democrats for not mentioning ISIS during their DNC speeches. @webpagelink"},{"comment_id":"10153918946326162","commenter_b":"Calling a 15 year old young lady a hoe Definitely shows your maturity level.","commenter_a":"Dear 15yr old girl, you put yourself in that position. Those are the risks of taking nude pics. SUCK IT UP, HOE.","post_message":"EXCLUSIVE: A Bolingbrook High School student says nude pics of her were posted online as retaliation for fight. @webpagelink"}]
