[{"comment_id":"10155900570730354","commenter_b":"IRAN PUT OUT A MESSAGE TODAY SAYING \"DEATH TO AMERICANS\". THAT WAS TODAY FOLKS TODAY....OBAMA IS THE WORST MAN IN THE HISTORY OF THE WORLD. HE WILL HAVE PAY FOR WHAT HE IS DOING TO THIS COUNTRY. IT WONT BE TOMORROW BUT IT WILL HAPPEN. KARMA IS A BITCH.","commenter_a":"AND IS ANYBODY REALLY SURPRISED OR SHOCKED THAT OBAMA LIED? THAT'S WHAT HE DOES BEST.","post_message":"See the updated language comparison... this just keeps getting more PATHETIC:"},{"comment_id":"10153043842829411","commenter_b":"This Germans are only the progeny of the stupid Jews that survived the holocaust.","commenter_a":"Look the Nazi are back.","post_message":""},{"comment_id":"1162468617182722","commenter_b":"The magic number is 2026, half of 4051 . Bernie gets to that number the superdelegates have to support him.","commenter_a":"Bernie could win every state from here on out and Hilary would still be leading in the polls and delegate count. ..","post_message":"Hillary Clinton's margin narrows to just 6 points over rival Bernie Sanders."},{"comment_id":"1412960289011405","commenter_b":"THE CORRUPT NAZICRATS ARE THE ONES THAT WILL BE DEFEATED!!!!!","commenter_a":"That's what you think American people got news for you","post_message":"Thanks Liz, this should increase membership..."},{"comment_id":"10154208733135969","commenter_b":"Why do they want to protect illegals? Wth what about the citizens","commenter_a":"IAGREE YSE","post_message":"The White House Press Secretary Sean Spicer holds the daily press briefing after President Donald J. Trump met with Intel's CEO about investing in America."},{"comment_id":"10151085765109999","commenter_b":"@username, There is an \"illegal alien\" in the penthouse of Trump Tower. She came to this country without a visa but persisted in working illegally until she found a sugar daddy who would marry her out of convenience. ICE needs to go there and interrogate her to determine if her marriage is a sham marriage for legal status or not.","commenter_a":"Let's face it, Trump does not care about Jews or Israel. It is up to Israel to save itself and work on two states solution. It is the only option to maintain a viable democratic Jewish state.","post_message":"\"President Donald J. Trump may be the last man standing between Israel and a complete, self-inflicted disaster,\" Thomas Friedman writes in The New York Times Opinion Section."},{"comment_id":"10153722857026336","commenter_b":"How sad! God be with his family at this time.","commenter_a":"Who won the game ?","post_message":"17-year-old Evan Murray was a victim of internal bleeding caused by a ruptured spleen, an autopsy revealed Monday."}]
