[{"comment_id":"10153992973507439","commenter_b":"Ms Reker is a WHORE","commenter_a":"What is it with the majority of women...do you not get angry, do you not want to beat the crap out of men like that? Whether we like it or not ,women, you are on your own. The only way to fight this is to fight, not because you like it but because we will have to. Your governments and I mean every government is in this together, they have planned the events, they are the movers of the migrants, they are manipulating every inch of this planet..Wake the heck up people. And women you will not only have to physically fight against the men that rape, you will have to fight against the women who are in power. The world for the general population will be returning to a dark time, a time where there were tribes and clans, you will have to be in a group to survive ...","post_message":"The Mayor of the City were hundreds of women were robbed, sexually attacked, molested, even raped on New Years Eve is blaming the victims. Worse still, the Mayor is a woman.  The mayor of Köln, Henriette Reker, intends to publish a behavioral code for the forthcoming carnival in Köln. But if you think that this behavioral code is meant for the muslim mobs, you are wrong. This behavioral code is meant for the victims, the women."},{"comment_id":"838659359573185","commenter_b":"DON'T LISTEN TO THE DUMB BLACK BITCH","commenter_a":"Bigot","post_message":"Oprah: ‘If You Hate Obama You Are Racist, If You’re Racist You Must Die’.  She is the racist.  Do you think Oprah is a bigot?"},{"comment_id":"1103535999742651","commenter_b":"she is at best...an annoyance...go home and look for russia...","commenter_a":"I spent ten years in the military just got home three years ago been through all sorts of problems and have been diagnosed for ptsd and through everything that's been going wrong since I've been back I still never not once didn't have control of myself even when I caught my ex-girlfriend of six years sleeping with a coworker of hers she started seeing when I was on duty.I just asked her to I'll say made her move out. And every brother from the core I was at salute President Obama and there were over hundred of thousands of us there so don't believe what people are saying here about the military disliking President Obama we salute you sir.","post_message":"“What did I say that’s offensive? I don’t regret any comment I made, because I didn’t lay PTSD at the foot of the president.\"  - Sarah Palin"},{"comment_id":"1115942415111321","commenter_b":"You are a woman, you are worthless, you shouldn't vote. See? That's how you sound. Btw, #hillaryforjail.","commenter_a":"I did not know Gov. Mike Pence. Thanks @username, I like his backbone. Voting Trump/Pence Donald J. Trump thanks for standing firm for the safety of America.","post_message":"If you ever had any doubts about Donald J. Trump sticking with his divisive and dangerous plan for America—say hello to his new running mate."},{"comment_id":"1759425104296851","commenter_b":"So how come she is now for crooked Hillary?","commenter_a":"michelle you said that Hillary was not fit for the white house nothing has changed since 2008 except she committed more crimes","post_message":"The first lady who did pushups on Ellen, whose hubby sang Al Green, claims Trump's immature."},{"comment_id":"10154822738529369","commenter_b":"You know she had to be shitting her pants up there","commenter_a":"Shell be alright it another Trump curve ball","post_message":"A Clinton campaign representative told NBC News that the campaign had \"no idea\" what Comey was referencing in the letter he sent Congress on Friday."},{"comment_id":"10153051549632169","commenter_b":"She will always genetically be a she period Cat is not a dog just because someone wants it to be","commenter_a":"Why are my tax dollars and donations going to publish this crap????","post_message":"From FRONTLINE:"}]
