[{"comment_id":"10153885914416336","commenter_b":"Because of the way, they TREAT WOMEN!","commenter_a":"This woman is totally ignorant. How many Muslims live in the US? Are they all terrorists? How many such shooting have taken place in the US? Are these all terrorist acts done by Muslims? Why dont you open your eyes and find out that all these terrorists have links with Pakistan and Saudi? Why nobody dares to say where all these terrorists come from or have link with? Why do you stamps all Muslims as terrorists?","post_message":"“There are jihadists out there… who want to kill all of us because of our way of life... We have to understand that we can no longer be politically correct.”  Judge Jeanine Pirro slammed the White House for being too politically correct when it comes to the threat of terrorism. @webpagelink"},{"comment_id":"10152641754716367","commenter_b":"Yes she is!!! She wears Spanx.","commenter_a":"Mucho baggae...g","post_message":"The Hillary Clinton email controversy is a reminder of one inescapable fact: She comes with baggage."},{"comment_id":"10153263146396833","commenter_b":"She dont need a gun anyway, Shes got a face that would stop a train !","commenter_a":"Start living in the real world, hoodlums are not giving up their guns. Wake up and smell the roses gabby","post_message":"On March 4, gun control proponent Gabby Giffords joined Democrat lawmakers on Capitol Hill to push for expanded background checks on all gun sales.  Anti-gun Representative Mike Thompson (D-CA), who supports banning commonly owned semi-automatic firearms owned by millions of American, is spearheading the push."},{"comment_id":"10153252381712016","commenter_b":"Don't speak for young women. You aren't one.","commenter_a":"Young women see through Hillary..she put up with a cheat for a husband as a ticket to the WH...thats not what young women want for a future...its from the 50s...she lied to protect him through numerous scandals and no longer does it convincingly...she mumbles stock phrases about equality with no real commitment to anyone but her ambition!","post_message":"\"Through a record-breaking voter turnout, we won because we harnessed the energy and the excitement that the Democratic Party will need to succeed in November.\" --Bernie Sanders"},{"comment_id":"10152973367828271","commenter_b":"Now he will have to keep finding more blondes that look like his ex wife","commenter_a":"Where do I apply for this job. I have a lot of worthless information that I would love to be paid for. 😂","post_message":"It's over: @webpagelink"},{"comment_id":"10152978726794342","commenter_b":"Yep that's some more B.S. All of the jobs that illegals are here taking were done by American citizens before you came. Your comment is without any truth whatsoever!!!","commenter_a":"All this jobs yall dnt do the hispanic race does !","post_message":""},{"comment_id":"1252197194828825","commenter_b":"One of the 2 things I don't like","commenter_a":"Smokers are disgusting","post_message":"WARNING TO PET OWNERS: It's not just second-hand smoke that's harmful for your four-legged friends. Pets are also at risk for being exposed to residue that lingers on skin, clothes, carpets, and other household items."}]
