[{"comment_id":"10154874338494641","commenter_b":"Make the wall will be turist attraction !! Turist will puy a lot for walking on the wall-))) US ern on it, every hotel and restaurant and gifts shops","commenter_a":"Una traduzione bizzarra","post_message":"The move would break a key campaign promise when Donald J. Trump repeatedly said he would force Mexico to pay for the construction of the wall along the border"},{"comment_id":"10153950585516491","commenter_b":"I really wish it had been 'Let the bodies hit the floor\" by Drowning Pool","commenter_a":"What this guy have to do with music? This show is a joke nothing to do with real music talent onlyma bunch of show offs","post_message":"Michael Phelps:  \"I might have a lot of gold but this guy’s got all the platinum.\""},{"comment_id":"1270150533061172","commenter_b":"Lock her up","commenter_a":"we all know it was a fake story but the truth is \"SHE IS A TERRORIST \"spreading hate is no different than using a knife or a gun.","post_message":"Fake News: Drunk Trump Supporters Assault Muslim Woman in NYC Subway, Call her a 'F***ing Terrorist'"},{"comment_id":"10154776330225831","commenter_b":"@john, Lets talk abt the difference please.....Lets talk abt the American Citizens who took a gay man, James Byrd Jr.....beat him...tied behind a truck, and then dragged him for miles until some of his body parts started ripping off of him....when they finally stopped to toss his body over a cliff....all that was left was his torso....all done by Americans.....Legal US Citizens, in 1998..... Or better yet......the Oklahoma bombings, in 1995, who was carried out by Timmothy McVeigh.....let me reminded you how this Legal American Citizen; bombed the Alfred P. Murrah Federal Building in downtown, Oklahoma City, killed 168 people, and injured more than 680 others ...here's another legal Citizen attack for you, since we Americans forget how we're our own enemies {but I guess thats okay}.....: Eric Rudolph carried out the Olympic Park bombing in Atlanta during the 1996 Summer Olympics.....that blast killed spectator Alice Hawthorne and wounded 111.....lets ...","commenter_a":"Instead of deporting \"illegal immigrants\" kick out all the Nazis skin heads KKK alt right Moran's and we shouldn't have any problems with the rest of the world","post_message":"The 9th U.S. Circuit Court of Appeals has refused to reinstate President Donald J. Trump's travel ban. In response, President Trump tweeted, \"See you in court\" and \"the security of our nation is at stake.\" Do you agree with the court's decision?"},{"comment_id":"10155065453241323","commenter_b":"You still refuse to answer the question.","commenter_a":"An admirable academic for sure . But; one line in the video had me chuckling \"And then population growth will stop\". Naive to think population growth will ever stop. Deluded dreamy lefty thinking.","post_message":"\"Let me show you the world\", said Swedish academic Hans Rosling, who has died aged 68.   Here he demonstrates the dynamics of population growth, child mortality and carbon dioxide emissions. The challenge for the world is to get everyone out of extreme poverty and get the richest people to use less fossil fuels, he said."},{"comment_id":"1367333429993068","commenter_b":"^^^^ angry feminist.....who'da thunk it","commenter_a":"so much narcicism in society these days...so many women demanding to be seen as \"beautiful\"....its ridiculous. And the kicker, if youre a man, and you say they are fat and unattractive then you are a \"chauvanist\" or \"intolerant\" etc etc etc....but you know what, why do women not go crazy over fat rotund men??? where is the fat acceptance movement for those guys? I rest my case.....no ladies, that isnt attractive.","post_message":"'These are the women you've rolled your eyes at... or joked about with your friends'  (via Daily Mail Australia)"},{"comment_id":"10154288676688445","commenter_b":"Ding Dong: who's there? Your local sheriff lol","commenter_a":"Throw them in the fireplace and share the lovely smell with the whole neighborhood!","post_message":"Grow Q&A: What Can I Do With The Pot Leaves I Trimmed Off?"}]
