[{"comment_id":"1705936436359891","commenter_b":"Oh shut up! The murdering, lynching KKK will be around to continue their hate. It would be great for you all to go back where you came from. The Indians would love it!","commenter_a":"so Black lives matter can protest anywhere and everywhere, but no other group can.hum? not that i agree with the kkk but they do have the same rights as Black lives matter.","post_message":"By the time this KKK rally was over, blood was on the sidewalks and ambulances were on the way:"},{"comment_id":"10153738179686037","commenter_b":"She is looking for $$$. Obamacare is expensive","commenter_a":"Good for her! Everyone else is expected to do their job the way it's suppose to be done..why shouldn't this doctor? Most doctors don't like to be questioned or for you to have an opinion. She ruined this wonderful experience for these parents. Birth is a day to day normal thing for her but for the parents it's something they will never forget. Some docs need to get off their high horse and realize they're not always right!","post_message":"“I can’t be the only person out there this is happening to,” Lindsay Scarborough Switzer tells Yahoo Parenting."},{"comment_id":"10153516438174087","commenter_b":"Only stupid people would let Syrian.people come to the U.S. Or illegals.","commenter_a":"Han er decideret syg i hovedet Oliver Dagn","post_message":"“I’m wondering if you would be able to look at [Syrian refugee children] in the face and tell them that they’re not allowed to go to school [here],” a voter asked Donald J. Trump. \"I can look in their face and say, ‘You can’t come here,’” Trump replied to applause."},{"comment_id":"10155189081740354","commenter_b":"She ought to steam clean the empty space between her ears.","commenter_a":"There's a fool born every minute!!","post_message":"Who Says The Hollywood Left Is Out of Touch?"},{"comment_id":"10154096917590329","commenter_b":"Grade 6 gym class. Ran face first into a cement wall during a game of dodgeball. I had two black eyes, one of which was swollen shut, and a nasty bump on my forehead. Our picture day was the following week. Best school picture ever!","commenter_a":"Jon Maloney you could add a story to this","post_message":"LOL"},{"comment_id":"10154890966160329","commenter_b":"Kacie Rodriguez","commenter_a":"Javier Maisonet oh Neville! ❤️❤️","post_message":"They out here. // Harry Potter"},{"comment_id":"1176638305726030","commenter_b":"My mother told me to never argue with the peasants. I am sure that is what most liberal mothers told their children while most conservative mothers were too busy cleaning their guns in hopes of putting another possum on the table for their snaggled toothed brood.","commenter_a":"I love that all of Killarys posts are getting roasted! Even the left can no longer argue for this traitor! #HILLARY4GITMO2016","post_message":""}]
