[{"comment_id":"1701996636715698","commenter_b":"@username What kind of murder,Cuz whites kill in record numbers in one single act of violence.","commenter_a":"Imagine the riots and violence that would be rampaging across the country had police shot four African Americans overnight - even were they all legitimate uses of force.","post_message":"Ambushed for wearing the badge: Four police officers in cities across the country were shot overnight.   There’s a manhunt for a suspect who shot and killed San Antonio Detective Benjamin Marconi as he sat in his squad car outside police headquarters. @webpagelink"},{"comment_id":"555840684604224","commenter_b":"Look how christianity views woman it's almost as bad","commenter_a":"What confuses me is why women would want to stay in this horrific religion that view women and children less than animal's. Mohammed is dead he isn't coming back !!!","post_message":"Spread this..."},{"comment_id":"533139670207659","commenter_b":"She can take her sorry ass over there and live bet they wouldn't let her stay long","commenter_a":"she is a complete WASTE AND NEEDS TO BE PUT IN JAIL ALONG WITH HER COHORTS..","post_message":"She is DELUSIONAL..."},{"comment_id":"741809245917684","commenter_b":"THOSE 3 BITCHES...ARE GETTING THE SHIT GANG BANGED OUT OF THEM NOW.","commenter_a":"IS is recruiting sluts for sex only son","post_message":"Aqsa Mahmood, 20, left her home in Glasgow in 2013, and married an IS militant in Syria."},{"comment_id":"10154494540149586","commenter_b":"T p dig n jag s denna Jenny!","commenter_a":"Giulia","post_message":"\"I resist the systems that oppress people & animals alike.\" #WomensEqualityDay"},{"comment_id":"596327983852216","commenter_b":"@username... The woman is CHEATING. She's actually bussing mentally deficient people to the polls to vote for her! She and Bill are colluding to steal elections by interfering with voters at the polls! She is so despicable, and frankly, anyone who knows about this stuff and supports her anyway DESERVES a Trump presidency.","commenter_a":"(DISCLAIMER: YES I VOTED FOR BERNIE IN THE PRIMARY. THE FOLLOWING POST CONCERNS A HYPOTHETICAL SITUATION WHERE HILLARY IS THE NOMINEE) To the Hillary bashers, you do realize that she is ideologically identical to Bill Clinton and almost identical to Obama, right? If you found those presidencies to be solid, ok, or even mediocre, that is a hell of a lot better than the potential authoritarian nightmare we have coming with a Trump presidency or republican control of all of government (see Kansas or Louisiana for what happens when the tea party can do whatever they want unchecked). And yes, again, I voted for Bernie in the primary.","post_message":"One thing is certain: While I’m excited to cast my vote for Bernie Sanders next month, I’ll be more than ready to cast my vote for Hillary Clinton in November."},{"comment_id":"981459371894535","commenter_b":"We need more proof than just being a female. gee","commenter_a":"This proves we need a female president !","post_message":"Justice Sonia Sotomayor cornered the conservative justices on the court by framing the Obamacare case as one of federalism vs states rights."}]
