[{"comment_id":"713646192159292","commenter_b":"Illegals wait in line like the rest.My dad came from Mexico when he was 5 years old the right way.He fight in WW2 in the Philippines.When we grew up we only spoke English.My dad said we are Americans.Every nationality has to wait in line.We can say this and that about are country but,this is the greatest country to live in.Citizens have to get off welfare get get a job.Stop being lazy,so illegals won't find work he.Government has to do there job.Find company's that higher illegals.God bless America land of the free.","commenter_a":"Seems simple enough- whatever happened to common sense?","post_message":"Share if you agree."},{"comment_id":"10154371429036491","commenter_b":"@username good luck having sex. I dont mind your sex life... duh","commenter_a":"The best birth control method is abstinence and celibacy.","post_message":"A leading medical group recommended IUDs as the best form of birth control for teenage girls today."},{"comment_id":"1176638305726030","commenter_b":"My mother told me to never argue with the peasants. I am sure that is what most liberal mothers told their children while most conservative mothers were too busy cleaning their guns in hopes of putting another possum on the table for their snaggled toothed brood.","commenter_a":"I love that all of Killarys posts are getting roasted! Even the left can no longer argue for this traitor! #HILLARY4GITMO2016","post_message":""},{"comment_id":"10153287384469714","commenter_b":"We never like skinny models.we love skinned and boned and toned models that should take the run ways","commenter_a":"I think people don't get it. It's attractive to be thin but you don't have to starve yourself. You don't have to be super skinny. People like a nice figure but above all a nice personality. You don't have to kill yourself to have a nice figure. Eating right and working out makes you look nice and feel better .","post_message":""},{"comment_id":"761877867244155","commenter_b":"STFU Shannon....stop raising a queer!","commenter_a":"A lot of folks are making \"wink wink\" comments but she is a sexual predator and you might feel differently if it were your son who was involved. I hope she gets treatment and does not teach again. Find another profession--I can think of one.","post_message":"The running joke was allegedly: \"Who is Ms. Altice sleeping with now?\""},{"comment_id":"10153554129132452","commenter_b":"#motivation","commenter_a":"Leydy","post_message":"Congratulations, Alfonso! The 96-year-old World War II veteran graduated from USC and is the oldest graduate in the school's history."},{"comment_id":"10153786734045329","commenter_b":"Hahahahahahaha!!!! Omg!!!! It's like we're on the Truman Show!!!","commenter_a":"@username!!!! Holy moly!!! Lmao","post_message":"\"If we're still single when we're both 39, can we have babies together?\""}]
