[{"comment_id":"10154722156744749","commenter_b":"The 'girl who prepared' has a name. Her name is Hilary. When this 'dastardly' person can be called by name why not this lady?","commenter_a":"What a terrible statement...Clinton is a terrible example. She is a garbage","post_message":"\"Ten inches shorter, she towered over her rival. In 42 days’ time, Dastardly Donald deserves to get beaten by the girl who prepared.\""},{"comment_id":"10155133952496162","commenter_b":"@username you must be a huge pedophile with the ladies!","commenter_a":"He'll be back later to collect on that investment! We'll hear some sappy story how he's been stalking from afar, & how they got hitched! He left $1000.00 due to them knockers!","post_message":"WAITRESS $1,000 TIP: Waitress Jennifer Peitsch works two jobs a day  to get by.\" Imagine her surprise when a generous diner last week left her a $1,000 tip on a $87.15 bill. Jennifer was moved to tears @webpagelink"},{"comment_id":"10153763916386320","commenter_b":"Who cares? All cops should spend one day arresting all the illegals in NJ and we wouldn't have this problem. All illegals should be made uncomfortable by cops and regular citizens alike.","commenter_a":"and again until you've walked in a cops shoes you don't know what it's like! They deal with scum of the earth a lot and there hands are basically tied. It's a shame and it's frustrating. I did not watch the video and I don't plan too. I'm Sick and tired of orople picking on the cops. Yes I'm sure there are some that aren't the best but most of the cops are good. Start celebrating the good cops for a change!! But sadly no one seems to be recording when they are doing something good","post_message":"A New Jersey cop goes off and is caught on video saying racial comments to three Latinos. Watch here: @webpagelink"},{"comment_id":"1555862094712251","commenter_b":"@username your mom should be happy because I will leave the country","commenter_a":"@username and by the way why is he paying his staff 12$ an hour??","post_message":"\"If you're both screaming at each other, the viewers won't be able to hear either of you\": Bernie Sanders and Hillary Clinton trade back-and-forths on minimum wage.   Live updates from the #DemDebate: @webpagelink"},{"comment_id":"1769034086717767","commenter_b":"and this is terrifying","commenter_a":"It's here @username","post_message":"This robot wants a family...and to destroy humans."},{"comment_id":"595052750663656","commenter_b":"So RACIST I used to really like her. Now o can't stand her..","commenter_a":"And we don't want to hear you talkm","post_message":"THE VIEW’S Whoopie Goldberg To Co-Host: “This Is Why Black People Don’t Wanna Talk To White People” [VIDEO]"},{"comment_id":"10153291728974726","commenter_b":"Is it just me or is it beginning to look like it is just one group of \"slick\" parasites that is destroying America.","commenter_a":"Some people get it. Too bad the entitlement crowd isn't listening! They would rather consider themselves as victims of Whitey.","post_message":"VIDEO: Tavis Smiley: Government Programs Have Led to the Dissolution of the Black Family"}]
