[{"comment_id":"10153181393497377","commenter_b":"Putin gives you a hard on? What's that say about you?","commenter_a":"Yah , They cant hide from the Russians is what he ment .","post_message":"Obama to ISIS Leaders: \"You Cannot Hide\""},{"comment_id":"10152826899201051","commenter_b":"How would she like if someone caught her on fire in a cage! This woman is sick!","commenter_a":"Put her in cage, set on fire","post_message":"First she made sure the puppies were securely locked up in the pet shop. Then she set it on fire."},{"comment_id":"1651334078420186","commenter_b":"Disgusting Banker Thugs.","commenter_a":"cowards shouldn't be cops","post_message":"The woman's vehicle was clearly functionally disabled, but that didn't stop these cops from \"fearing for their lives\". The most disturbing part about it; the cops seemed to enjoy executing her.  Story/Video here: bit.ly/1HARM4N"},{"comment_id":"10153567353788984","commenter_b":"I will have one long after your ass is gone","commenter_a":"that just show the driver of the truck isn't paying attention what is going around his ride. That ass hole would be wearing salt rock in his britches","post_message":"I don't care what your opinion on the Confederate flag is, there's no denying that what this guy did is truly insane..."},{"comment_id":"10153780693499071","commenter_b":"Nina Puspita","commenter_a":"They look for kindred spirits of greed, just ask Hillary.","post_message":"Here's what Goldman Sachs looks for in a résumé."},{"comment_id":"10153071085836051","commenter_b":"Kill that bitch!!!!","commenter_a":"Hell hath no fury, right? Sick, sick, sick.","post_message":"First she threw her ex-boyfriend's puppy into the oven. Then she turned the oven on. And then she called him up and told him where he could find his dog."},{"comment_id":"475937869263460","commenter_b":"what drug is she on these days? Think she's lost it in her old age....","commenter_a":"yes christian should pray all the time","post_message":"Parton delivers strong message to christians everywhere.  This is out of line, we need to show her that this type of public disrespect is unacceptable.   Do you agree that christians should be able to pray in public?"}]
