[{"comment_id":"10153348075419255","commenter_b":"who would want texass anyway","commenter_a":"I laugh every time I see these two big wusses trying to play badass.","post_message":"Idiots."},{"comment_id":"1811602825768086","commenter_b":"@username they voted for TRUMP because Hillary is lying criminal that should be locked up","commenter_a":"not surprising.... the KKK IS a dem organization so it makes perfect sense that they would be able to get the uniforms.","post_message":""},{"comment_id":"10154456467843717","commenter_b":"Real Feminists Don't Kill Babies You just can't ban abortion. You can only ban safe abortion.","commenter_a":"You just can't ban abortion. You can only ban safe abortion.","post_message":"The ban is expected to be challenged in court."},{"comment_id":"10154478058311320","commenter_b":"She needs to be fired.","commenter_a":"Angela Russo","post_message":"Shameful...  are going to have to take me off the line, because I am not serving that.  And that was how a uniformed police officer was treated at Noodles & Company when she was denied service. @webpagelink"},{"comment_id":"1581710041881753","commenter_b":"Maybe Madonna should offer the terrorists the same blowjobs that she offered for votes for Hillary!!!","commenter_a":"GO TO SYRIAand see what happens you stupid women","post_message":"Quite a national security position..."},{"comment_id":"10153996640170326","commenter_b":"Illegal aliens have Constitutional rights?","commenter_a":"Why is it every time Donald gives a semi sane speech, the media says he's pivoting? How many times is this now? His speeches are the same old thing. I'm going to build the wall. I'm going to ban Muslims. I don't care about constitutional rights. I will trample over all those that oppose me. I will be ruler of America!","post_message":""},{"comment_id":"1724833864402419","commenter_b":"We're going to drive one right up that midgets rectum","commenter_a":"Hey its cool. He's just demonstrating our first amendment rights. Lol","post_message":"NKorea claims could wipe out Manhattan with hydrogen bomb..."}]
