[{"comment_id":"10152698391808717","commenter_b":"She's no Zumba instructor but she's not","commenter_a":"She's a hottie","post_message":"Claremont police say two people face charges after selling cocaine, crack cocaine and heroin in a school zone. @webpagelink"},{"comment_id":"793075604079241","commenter_b":"Thank you SIR!","commenter_a":"Thanks, the GOP needs more people like you, Scott.","post_message":"I voted against the \"clean\" DHS funding bill today. I will not compromise when it comes to our Constitution. President Obama has shown he has no regard for the principles our nation was founded on. If Congressional Republicans won't hold the line against this president, then who will?"},{"comment_id":"10153424422192377","commenter_b":"cruz wants megyn on his side, strong women has nothing to do with it.","commenter_a":"Give me a break!!","post_message":"\"Listen, I know that Donald — it makes him feel really tough; it makes him feel like a very, very big man to threaten people. And in particular, he seems to have a problem with strong women,\" Cruz said. \"I don't know why that is, but it seems to really bother him.\""},{"comment_id":"10153672228046130","commenter_b":"She's not plus size... She's average!!!!!","commenter_a":"How hilarious.","post_message":"A trailblazing move by Sports Illustrated Swimsuit."},{"comment_id":"788206447982585","commenter_b":"The trump train is heading for the trump wall. toot toot.","commenter_a":"Hurry Hillary call Wall Street call @username call AL Sharpton because your gunna need all the help you can get. The Trump Train is rolling straight for the White House !!!","post_message":"Hillary Clinton and her allies are preparing for the fight against Donald J. Trump."},{"comment_id":"10153621420851045","commenter_b":"Uncle had custody of her, I don't think it's what it sounds like. Parents don't just lose custody.","commenter_a":"🙏🙏🙏","post_message":"We have some fantastic news to share with you. Carlie Trent has been found safe and her uncle is in custody! #BringCarlieHome"},{"comment_id":"10154040772674778","commenter_b":"You're an idiot and idiots should not reproduce!","commenter_a":"Same sex marriage is not about love....it's about lust and sex...and it's nasty","post_message":"Here's the final paragraph of the Supreme Court decision legalizing same sex marriage across the nation. @webpagelink"}]
