[{"comment_id":"962385683823549","commenter_b":"Why in the hell did he stand there and listen to that s*** slam the door in that w**** face after about three words out of her mouth","commenter_a":"Racist","post_message":" HATE YOU WHITE MOTHER F-CKERS': Thug Chick Goes Nuts On White Neighbor (VIDEO)  @webpagelink"},{"comment_id":"1758000121104260","commenter_b":"It doesn't take a week to get your citizenship, however there is help to those who can't afford the fees.","commenter_a":"What is wrong w ppl this country is about FREEDOM I don't agree w trump but that doesn't mean I will hurt or disrespect anyone that does..","post_message":"WATCH: Trump rally riots - supporters attacked by a mob of protesters at a rally in California."},{"comment_id":"1203461079770668","commenter_b":"how did you idiots elect this stupid liberal bitch","commenter_a":"So ignorant..","post_message":"ClashDaily.com"},{"comment_id":"667325733458005","commenter_b":"Gloria I agree. Get their muslim butt back where they came from","commenter_a":"Muslims if you don't like the way America's are then leave. Clint Eastwood has every right to be artistic and make true movies about who you really are then leave AMERICA. We have freedoms you do not have so leave because we will not stop being Americans. The movie was very well done and true to the ooint.","post_message":"This angry Muslim group wants Clint's head, but he's not backing down.  He is a true American, and a real patriot.  Can we get 125,000 'LIKES' for Clint Eastwood?"},{"comment_id":"1066446510115069","commenter_b":"THIS DUMB FK ,THINKS ,PEOPLE, WITH MONEY .WILL REALLY ,DONATE MONEY, IF THEY,GET TAX BREAKS ,WHILE PUT ALL THERE ,MONEY IN OVERSEA ,ACCOUNTS ,AND SHIPPING OFF MIDDLE CLASS JOBS OVERSEAS ...REALLY ,YOU DUMB AZZ MORONS ,,,WHO VOTE ,WITHOUT ,COMMONSENSE!! THESE FKS HATE FKGERS HATE THE POORPEOPLE ,VETERANS ,SENIORS ,AND OTHER AMERICANS ,,REALLY DUMB AZZES REAGAN ,TRICKLE DOWN ,MY AZZ ,YOU FOOLS ...THIS GUY IS A FRICKEN CARPET BAGGER,,,FOOLS !!!!!!!!!!!!!REALLY!!!! LMFAO!!!!!","commenter_a":"Following in the footsteps of Reagan and Bush Jr.","post_message":"Just like the rest of the GOP candidates, Rubio's tax plan is a massive handout to the wealthiest of Americans."},{"comment_id":"376942655827362","commenter_b":"Go Back To your frickin homeland!! We did not invite you here!!","commenter_a":"Deport them","post_message":"The want to change Easter in \"Spring Break\"..."},{"comment_id":"10153809413306101","commenter_b":"Oh give me a break. This silly leftist woman is acting like a jerk.","commenter_a":"I cannot believe what you have said. I myself really don't care what she has to say and I would disagree 100% with her!!!!","post_message":"Donald J. Trump may want to listen to Eva Schloss about what racism looks like."}]
