[{"comment_id":"494289207428326","commenter_b":"I'm surprised the husband let her swim at all.","commenter_a":"Our Country our way of life. DON'T TREAD ON ME!!","post_message":"Two Muslim women wore their 'burkinis' to the pool and then something amazing happened.  Awesome. Muslim immigrants need to assimilate or leave.  Do you agree Muslims need to abide by our laws?"},{"comment_id":"1250738951649087","commenter_b":"Only women to ever get you to take your bandana off","commenter_a":"@username when meg would come help you","post_message":"Oh boy!  #WSHH"},{"comment_id":"899557670234809","commenter_b":"This is the STUPID BITCH that just spent 8 years in the White House, what a piece of shit she is","commenter_a":"She has always been a JOKE","post_message":"He stepped to Michelle in a way she probably never thought anyone would.  Serious respect for this man. Let's get his back.  Let's get 3,000 'LIKES' for this soldier!"},{"comment_id":"1203426363052812","commenter_b":"@username AND SHE WANTS TO BRING THOUSANDS MORE INTO THIS COUNTRY' WAKE UP PEOPLE","commenter_a":"The cop should have called for backup and arrested the whole lot of them for inciting a riot. They should have been told it was none of their business what the woman was wearing. If they can't live by the laws of the countries they are in, they should be sent back home where their laws are enforced.","post_message":"WATCH This Muslim Scumbag Harass Women or Wearing Jeans Deemed too Tight By Islamic Standard! Then The POLICE Show up and teach him a lesson on Freedom! (VIDEO)  This is the problem with islam, they believe EVERYONE is subject to their bullsh*t!"},{"comment_id":"896237380506542","commenter_b":"Guess what all you fools there are just as many women that talk a hell of a lot worst then Trump dreamed of all you holier-than-thou women out there quit acting like Polly pure bread get a grip. What's worse is that all that comes out of Killarrys mouth is diarrhea 💩💩💩😈😈😈😈","commenter_a":"If Hillary & Supporters are so butthurt over something Trump said 11 yrs ago, then why would Clinton accept endorsements from \"Rappers\" who had said FAR Worse things about Women then Donald said in Private 11 yrs ago? Some of the Vile things said by these Musicians is so demeaning to Women but yet Clinton doesn't reject their Support?? Nor does Her Supporters?? Calling the Kettle black!!! Copied","post_message":"“It’s the kind of locker room and frat house talk that personally infuriates me. But guess what? I still, without a doubt, support [Donald J. Trump].\"  Watch Judge Jeanine Pirro's full opening statement."},{"comment_id":"10152745138297093","commenter_b":"Way to go Steve!! You put this guy on blast!!! Look out people.","commenter_a":"Busted !","post_message":"Consumer reporter Steve Noviello was invited to a demo for a safety and security window film, but things didn't quite go as planned... @webpagelink"},{"comment_id":"10153953240508984","commenter_b":"We are AMERICANS! As are all legal CITIZENS! We believe in the LAW, THE CONSTITUTION and what it stands for! I don't have a problem with blacks, Mexicans or Muslims! But they seem to have a problem with us! They shoot or hurt us first and because we fight back we are racists? What the heck s wrong with this! Our Lord Jesus gave us two great laws, to love God above all else and to love our neighbors as ourselves! It doesn't say our neighbors have to be white, black, brow, or purple!","commenter_a":"Americans are done with the media as well as p.c.We are not racists or bigots..or hateful people as we are portrayed.We are patriots who are not going to let this country fall.","post_message":"This 8 word statement from the Republican debate was the most important and influential of the evening. Whether or not the candidate who said it becomes the GOP nominee, its far-reaching impact will be felt for the rest of the campaign.  Do you support this candidate's position?"}]
