[{"comment_id":"1392014810811452","commenter_b":"That is so inspiring.","commenter_a":" I despair, I remember that all through history the way of truth and love have always won. There have been tyrants and murderers, and for a time, they can seem invincible, but in the end, they always fall. Think of it--always. Mahatma Gandhi","post_message":"Just when you thought it couldn't get any worse!"},{"comment_id":"1066102216758740","commenter_b":"DON\"T choose Hillary!! Jump aboard the TRUMP TRAIN 2016! He will work for America!!!","commenter_a":"Why should we choose Hillary ???? Bill didn't he choose every other women BUT Hillary","post_message":"\"She's a natural leader, she's a good organizer, and she's the best darn change-maker I ever met in my entire life.\"  President Bill Clinton said Hillary Clinton is \"worth every single year she's put into making people's lives better.\""},{"comment_id":"1637686876527430","commenter_b":"I don't rbecall we doing this Obama some needs to stop this it is un-American to do this not happy leave the country that has let you make millions of dollar from the same people you bash we are sick of all this go cry to Hillary or better sit on her husband lap","commenter_a":"How stupid can they get? Pathetic!!","post_message":"Some celebrities will show up to Trump's inauguration....to protest."},{"comment_id":"10153006139081602","commenter_b":"I think it would help lessen the burden on other welfare programs, if some benefit recipients were getting educated and coming off programs.","commenter_a":"Better to pay for this than all the bums on welfare and any state run handout that people take advantage of.","post_message":"Two years of community college could now be free for all, according to a plan President Obama is scheduled to propose Friday."},{"comment_id":"10154373142406509","commenter_b":"It's bc she's white and rich.","commenter_a":"When you have money the law work for you and when you're poor it don't","post_message":"Tonya Couch, the mother of so-called \"affluenza\" teen Ethan Couch, had her bond lowered from $1 million to $75,000 at a hearing on Monday."},{"comment_id":"10153992409688132","commenter_b":"Bet she can't do it again! Lol","commenter_a":"Bye Felisha","post_message":"The force of the blast tore her body apart, complicating officials' efforts to identify her."},{"comment_id":"1190105204361047","commenter_b":"Hang the bitch!","commenter_a":"Takes time to plan a coronation!!","post_message":"Hillary thinks she's already won. This kind of sick behavior is UNACCEPTABLE in a constitutional republic!"}]
