[{"comment_id":"387550718099889","commenter_b":"That is a good point.","commenter_a":"It's time to blame and hold congress accountable for allowing him to stay in office.","post_message":"I cannot believe it..."},{"comment_id":"10153738613786955","commenter_b":"And black people wonder why white people view them the way they do. When you act like a classless piece of crap, we are going to view you as a classless piece of crap. And this woman is a classless piece of crap","commenter_a":"Should have dragged this Nappy-headed skank out by her hair & shown her the gutter where she belongs......Good luck in Prison Ho'","post_message":"WHAT HAPPENED TO MANNERS IN THIS COUNTRY?"},{"comment_id":"10154478152135326","commenter_b":"Lying hyena she worse than she dog","commenter_a":"We all got something to say about Donald Trump, and his supporters and helpers but he still the president and he's still putting our lives in danger.","post_message":""},{"comment_id":"10153647228236336","commenter_b":"Hello...Mr. Mahon? You there? Anything else you can steal from the white race and make you feel like a real man? Got our heritage, took over football, basketball, baseball. What's next? Hunting, nascar, women. Oh well...guess your are a superior race. Except in my neighborhood.","commenter_a":"Execution is exactly what the criminal who did this deserves.","post_message":"An estimated 11,000 people attended Texas Deputy Darren Goforth’s funeral today. The husband and father was killed \"execution-style\" at a suburban Houston gas station last week."},{"comment_id":"10154189232436603","commenter_b":"Haaaaaaaaa am avut 12!!!!","commenter_a":"@username 11/18 sa vedem daca ma bati","post_message":"Quiz to be taken whilst listening to \"Smelly Cat.\""},{"comment_id":"1421875981165778","commenter_b":"I had heard that too but I'm not sure where to pick up meatloaf in D.C. . I wouldn't put it on the taxpayer to feed me at the White House, I just want to have the face to face.","commenter_a":"Invite me for dinner at the White House, I'll say it to your face. For real, I'll even spring for the Kentucky Fried Chicken.","post_message":"Trump sounds off on what he considers fake news: \"A source says that Donald Trump is a horrible, horrible human being. Let em' say it to my face.\""},{"comment_id":"10154767533793258","commenter_b":"Definitely a paid for astroturfer, Delphi technique plant. Real people are not this stupid.","commenter_a":"No one cares about her emails","post_message":"Security briefings for Hillary Clinton should be suspended until investigation is over, says Paul Ryan."}]
