[{"comment_id":"373546919515489","commenter_b":"She's retarded.","commenter_a":"I'm so sick of her BS, she needs to just plain go away and leave America alone.","post_message":"Pro-Gay, Pro-Abortion Nancy Pelosi Calls Marco Rubio a Bad Catholic"},{"comment_id":"10157349438290354","commenter_b":"She needs to shut up! We don't care!","commenter_a":"Rosie needs to check in at the local mental health clinic ASAP","post_message":"And that's not all Rosie O'Donnell said about Donald Trump either..."},{"comment_id":"10153754425932431","commenter_b":"Americans are so evil they kill 99% of us and steal our land and then when we stand up to them, they say hey you better kiss our ass or we won't help you","commenter_a":"If americans want their pipeline then just put it on their land over their water not ours, They should have to pay the price for their greed not us, I am tired of americans living good lives off our suffering.","post_message":"Video: 7 Arrested After Pipeline Protesters 'Invade'  Enbridge's Duluth Offices  bit.ly/1Ms7Sjy"},{"comment_id":"10154830070756337","commenter_b":"I feel good Hillary is going to win","commenter_a":"I'm with her!","post_message":"We're counting down to Tuesday's election. Tell us how you feel..."},{"comment_id":"10153204026980090","commenter_b":"I will NEVER EVER forget her saying \" What Difference at this point does it make\" Americans died Hillary don't you get it?","commenter_a":"FOUR MOTHERS, that's Mothers, NOT MILLIONS, that's The Difference Hillary it's Time to get Right with God, you will be glad all through out Eternity!!!","post_message":"Hillary Clinton still owes us answers.  SHARE & SIGN to support Republicans fighting for the answers: @webpagelink"},{"comment_id":"10153405463063132","commenter_b":"5 year cancer survivor right here. I flew everywhere, because I didn't want to stay at home alone, my guy is a commercial pilot and I can fly for free..so why not?Because my cbc count was low, I had to fly with a mask on, because I had to. I even flew on Alaska airlines from Denver to anchorage. I believe this to be an isolated incident...I was always treated with dignity and respect and allowed to go down first because I said I felt weak..Because I did! So tell me what's the difference between if an elderly person says they feel weak and a cancer patient says it?","commenter_a":"Dear America, your bottom line is not more important than common courtesy or basic human rights.","post_message":"\"We need to make sure that ... corporations aren't so concerned with liability and bottom line that they overlook common sense and common decency.\""},{"comment_id":"10153526551574497","commenter_b":"Now those fuckers will manage to rename their country as \"Aaaamerica\" to undisputably top the list...","commenter_a":"Not if you use America","post_message":"Via ClickHole"}]
