[{"comment_id":"486046958252551","commenter_b":"What gets me though is why are these atheist bitches so offended by something they don't even believe exists Just proving their true ignorance I guess...!","commenter_a":"GOD BLESS AMERICA!!!!!!!(keep it going!)","post_message":"This student was told not say 'God bless America', but he's not backing down.  Amen. We stand strong with this student and his flag.  Do you support 'God bless America' staying in schools?"},{"comment_id":"10153218446741051","commenter_b":"she wont care, she has another kid to take her spot. i bet she will continue to see him, and probly get married. sick nasty world!","commenter_a":"That is one sick family hope that mother feels real good abouit that sex, it cost her daughter and grandchild[s life.","post_message":"A pregnant lady walked in on her husband with another woman. When she realized who the woman was, she killed herself."},{"comment_id":"1250451044993129","commenter_b":"Her supporters are indebted to her for what she has connected them with of course you're not going to spit in her eye the whole group including her supported just crave Power by any means necessary and feel they are much Superior to all other beings and should be allowed to run the world according to their plan blow them all out of the water please go vote for the one who loves his country it's the only hope we have","commenter_a":"The love of money is the root of all evil. They should be in jail. Anyone else who did this would be.","post_message":"This is important."},{"comment_id":"10152627900846680","commenter_b":"We need to get rid of lowlife like Amy Klobuchar and her fellow treasonous, America-hating Democrat scum...Loretta Lynch is proving she'll be another Holder...we don't want nor need her to continue breaking laws for Barry O.","commenter_a":"The now extreme right GOP, are now preaching that all democrats/Liberals are lawless. Ted Cruz as a the son of an exiled ultra conservative and enraged anti-Castro Cuban, was brought up to think by his father, that all Liberlas are Communist and are out to overthrow the US government. I quess according to the GOP and Ted Cruz's definiton of Liberalism, which he defines as lawless, John Locke, one of the fathers of Western liberallism, who inspired the writers of the American Declaration of Independnece like Thomas Jeffersen, were all lawless! If this is true who is then lawless...","post_message":"Sen. Amy Klobuchar: \"So why has her nomination languished for nearly four months — longer than any nominee for attorney general in recent memory? And why have senators like my colleague Ted Cruz insisted that she is somehow lawless?"},{"comment_id":"10153377125868984","commenter_b":"This administration doesn't WANT to bring people together. They constantly pit people against each other with inflammatory, insulting rhetoric - while involving themselves with the worst of the worst (like Al Sharpton). The entire world is up in flames and it's getting worse and not better.","commenter_a":"She's just pathetic.","post_message":"Michelle Obama just issued a message to black America about what white people do to \"folks like you and me.\"  This woman needs to be exposed for what she is telling our youth... spread this everywhere so Americans know who's REALLY trying to divide the country."},{"comment_id":"1069058776465409","commenter_b":"You an illegal alien?","commenter_a":"You can't uphold your weenie Trump","post_message":"I'll appoint judges who will uphold the Constitution of the United States."},{"comment_id":"1761764947438429","commenter_b":"@username you do realize Hilary wants to deport illegal immigrants too right? She announced it this last week.","commenter_a":"Women should feel insulted that the first female ever to be nominated also happens to be a corrupt, cold, calculating, ruthless, lying crook. If we're going to give the distinction of 'first woman nominee' or, God forbid, 'first woman president' to anyone, she is, quite literally, the last woman in the country who deserves the honor.","post_message":""}]
