[{"comment_id":"10153873855796037","commenter_b":"He was perhaps just as bad but we will all suffer the negative consequences of their actions.","commenter_a":"Obama's abuse the executive privilege and failure to uphold the constitution has set a dangerous precedent for all those who follow, whatever political party they may belong to...","post_message":"Here’s why President Barack Obama’s actions could empower Donald J. Trump’s Muslim ban in the future."},{"comment_id":"1763050483964389","commenter_b":"@username it's sad that you believe this corrupt liar, she panders to do nothing but destroy American interests. You will have a hard life since you choose to ignore the research that many gave to you on this post. You rather remain blind then actually see the POS that you're defending.","commenter_a":"Here's an idea, everyone who DOESNT like Hillary, don't comment. Go comment on how much you love Donald Trump and how you hate everyone except white people. And how you hate refugees fleeing their countries that are being bombed by USA and how you hate everyone. And if you like Hillary and/or voting for her... Then you comment.","post_message":"Even before his hateful speech this week, Trump has never been vague about his feelings toward immigrants."},{"comment_id":"502464629957050","commenter_b":"NOOOOOOOOOOOO GO HOME WHERE YOU RUINED YOUR OWN COUNTRY","commenter_a":"If they are offended by the anthem of the country they chose to live in....the country that is giving them the right to spew their BS....the country that provides their safety and many welfare services....then I guess they can just GTFO.......","post_message":"Multiple Choice Quiz time, kiddies! Which answer did you chose? A or B?"},{"comment_id":"10153254470474330","commenter_b":"I do not have girls, but if I did I would not let them wear either one of the dress below. they both look trashy, Asking for Trouble","commenter_a":"The guidelines may be appropriate.....yet they would have been honored if not considered had they come a month (or more) ago while these young women were shopping for the dresses!! Kids need to learn dress code acceptance to match the occasion...and while not promoting prudeism - if that is a word, my parents in the 60's would encourage us to leave some stuff to the imagination!","post_message":"Some controversy is brewing over prom dresses at Shelton High School. On Friday, the headmaster announced that dresses with slits, cutouts and backless styles wouldn't be allowed at prom. However, students and parents say the crackdown comes too late. They already bought the dresses. ---> @webpagelink  What do you think? Should the dresses be allowed or not?"},{"comment_id":"971423549572732","commenter_b":"Girl, is there any other?","commenter_a":"Dukes!!","post_message":"FOLLOW UP: We asked this morning about whether you like banana and mayonnaise sandwiches….if you say YUM, what mayo are you using?"},{"comment_id":"10156577107260725","commenter_b":"Rand Paul is already crying he is your typical corrupt out of touch Washington politician. He wants to rid us of the US military. So that jerk will be at the debate.","commenter_a":"I can make a difference between Winning & Losing & i really want Donald Trump to Win. I have lots of valuable inputs to give. How do i get in touch with you. Warm Regards, @username...","post_message":""},{"comment_id":"10152746114636545","commenter_b":"That's bootylicious","commenter_a":"Kaci, Ryan, Anthony and Cory - get home ASAP but do so in a safe manner.","post_message":"The roads are getting worse everywhere in North Texas and accidents are starting to pile up. Check the traffic conditions if you need to go anywhere.   TRAFFIC: @webpagelink"}]
