[{"comment_id":"10154563720189087","commenter_b":"Religion and government is intertwined...Muslim ban that include pushing Christian refugees to the top of the list. Unconstitutional violates church state seperation however her trump wanta to also allow tax exempt churches to be allowed to donate to politicians. And if you don't understand why that's wrong please re-read your constitution.","commenter_a":"I am so proud of Muslims, Hispanics & Women. To be abused and treated so badly by Mango Mussolini, and to still hold their head so high, is truly wonderful!\"","post_message":"President Donald J. Trump: \"I am so proud of my daughter Ivanka. To be abused and treated so badly by the media, and to still hold her head so high, is truly wonderful!\""},{"comment_id":"10153442882309087","commenter_b":"@username No Edna is the one with the brains, you however should go get and education and then come back to the table. Nevermind don't bring that stupidity back, you may let the men in your family rule your body but they definitely will not rule mine. Whether you like it or not abortion is legal in this country ..... why would any self respecting woman let any GOP teabagger try and rule their bodies....,.I just don't get it and never will. If you won't vote for the women in your lives I certainly will !!","commenter_a":"Obama is ISIS! That's why he didn't cry before!","post_message":"“I was affected by [President Obama crying during Monday's gun control speech] but I thought we should’ve had the same kind of reaction when James Foley was beheaded, when San Bernardino and Paris occurred,\" Speaker Paul Ryan said. \"That’s the kind of reaction I had when those occurred.”"},{"comment_id":"10153087493924641","commenter_b":"Castration ? Wicked ladies always love that","commenter_a":"Rape cases are very high in India....those men need castration","post_message":"India has banned a controversial rape documentary. Are they protecting women or restricting free speech?"},{"comment_id":"10153697405309712","commenter_b":"Libs can flush millions on social programs and illegal non-citizens, but get their panties in a bunch over a blimp downed for not paying \"air tax\".","commenter_a":"Ikr","post_message":"An Army surveillance balloon's escape seemed a bit of a lark, but the long running program has been beset by high costs, low reliability and questionable performance."},{"comment_id":"10154092848234087","commenter_b":"A special letter to Republican nominee Donald J. Trump: Dear Sir, In a way, you are no better than your narcissistic alter ego. When told what you say is considered sexist, racist, classless, hurtful, and you say it more, you are a self-centered narcissist. Speaking off the top of your head, yelling hurtful insults, slinging mud, your unsophisticated intellect comes as somewhat surprising. It is apparent there is no limit to what you will say. For starters you are unapologetically low class: women ooze blood Hillary cofounded ISIS \"Hillary Clinton is a bigot!\" punish women for abortions kill terrorists and their families proposed mass deportation force African Americans use food stamps extreme vetting of Muslim immigrants if Ivanka wasn't daughter, he'd date her Mexican immigrant murderer rapists cancel Obamacare (offers no alternative) \"you have to be wealthy in order to be great\" \"putting a wife to work is a dangerous ...","commenter_a":"WE ARE CONCERNED ABOUT YOUR QUESTIONABLE BUSINESS DEALINGS OVERSEAS AND YOUR FINANCIAL TIES TO THE MOB AND OTHER COUNTRIES 1.\\tWill you sever ties with your company linked to foreign leaders, questionable organizations, and criminals if you become president? 2.\\tHow will you handle non-cancelable contractual obligations with parties whose interests conflict with those of the United States? 3.\\tWhile refusing to release your tax returns, how will you confirm that you do not have dangerous financial ties to bad actors abroad? 4.\\tIf you were willing to work with Qaddafi known terrorist and dictator there anyone you aren't willing to make a deal with? Who? 5.\\tHow can you be tough on Iran, given your business partnership with someone connected to Iranian money laundering? 6.\\tGiven that you've already questioned our commitments to NATO allies, what is your answer to this? For example, how would you handle the millions of dollars flowing into your organization ...","post_message":"Bernie Sanders ripped the media for letting itself be manipulated so easily by Trump."},{"comment_id":"980020968705428","commenter_b":"It's been a long time coming. Let's make this happen so our daughters and granddaughters are free from the harassment that we were told to \"just deal with it\".","commenter_a":"We need something like this! Jasmyne","post_message":"The video is intense, but its message is so needed. - Parker Marie Molloy"},{"comment_id":"10155199620894411","commenter_b":"Unlike in shithole Islamic countries pedophiles actually go to jail here, instead of marry them. Get dunked on bitch.","commenter_a":"Ah yes, Islam propaganda to tell women to embrace their own slavery & destruction.","post_message":"Protesters claim that the full-face veil is an instrument of women 'self-empowerment'"}]
