[{"comment_id":"10152833385031749","commenter_b":" .","commenter_a":"You are right Brent!","post_message":"\"America’s resurgence is real. And now that we’ve got some calmer waters, if we all do our part, if we all pitch in, we can make sure that tide starts lifting all boats again. We can make sure that the middle class is the engine that powers America’s prosperity for decades to come.\" —President Obama  Watch the weekly address: @webpagelink"},{"comment_id":"1046596102028067","commenter_b":"I hope you'll be the pregnant one cause you're a bitch >:(","commenter_a":"Lol wut @username","post_message":"No women required."},{"comment_id":"1800961159929656","commenter_b":"This is not the true Ekklesia of Christ! I keep saying it, the true Ekklesia of Christ will have to return to the home, where it never should've come out from!","commenter_a":"You can't call this a Christian church if it goes totally against Gods word and if all that is allowed it is totally wrong to change the bible to fit your agenda. The bible says beware of wolves in sheep clothing it also says we are in this world but not of it. We true Christians are to be aware of these wolves and Not join in the sin with them but we are to pray that God will remove the scales from there eyes and pierce there heart so they can see and repent of what is so wrong that they think is right.may God have mercy on these people","post_message":""},{"comment_id":"10154985295149614","commenter_b":" this woman is simply amazing","commenter_a":"This story is inspirational n definitely tells us never to give up no matter what!!","post_message":"Karen Klein walked through 26 freezing miles, subsisting on just twigs and her urine, in order to get help for her husband and 10-year-old son after their car fell in a ditch off a secluded road.    kept her going ... is she didn want her mother to bury her daughter. She didn want her son to be without a mother, Klein's twin sister said."},{"comment_id":"1041804329212648","commenter_b":"The same family will bring in refugees, no doubt, and will regret that as well.","commenter_a":"At the shelter in my city they put all pits and even half pits to sleep, they don't even adopt them out.","post_message":"Pit bull rescued from 'death row' attacks daughter just minutes after arriving at family home"},{"comment_id":"10153892680026680","commenter_b":"Get a grip Republicans! Don't get weak and give up on Trump! The stakes are much too high! Our lives as we have known them will never be the same if Hillary Clinton wins this election! Donald Trump apologized for things that were said in private 11 years ago but Bill Clinton has yet to apologize for putting his cigar in places it shouldn't be while in the Oval Office and being paid by the taxpayer! There is no low that Killary and team will not stoop to in order to steal this election! October 6, 2016 Clinton Foundation HACKED – Now We KNOW Hillary Clinton Stole More Than Taxpayer Dollars! barney-frank Americans may have been disappointed when Julian Assange announced that he didn’t have an October Surprise for Hillary Clinton, but they weren’t disappointed for long. Another hacker stepped up with an explosive leak. Going by the name “Guccifer ...","commenter_a":"This is too far. You can't start talking about someone is father specially if they are deceased.","post_message":"The file is all of eight pages in length, suggesting the bureau never subjected Fred Trump to any serious scrutiny prior to his death in 1999."},{"comment_id":"1380609545301335","commenter_b":"GOOO NORTH DAKOTA, WISCONSIN, CA. , NEW YORK BRING IT ON IN!!!!! ALL ABOARD NEXT STOP THE WHITE HOUSE!!! ADDING COAL TO THE TRAIN!!! MEDIA,MEDIA, MEDIA!!! NO MATTER HOW YOU TRY YOU CAN'T TRUMP THE DONALD!!!! CRUZ KASICH =ESTABLISHMENT'S COCKROACHES!!! A VOTE FOR THEM IS A VOTE FOR HILLARY OR BERNIE!!!!!! ALL ABOARD !!!! NEXT STOP THE WHITE HOUSE!! T TRAIN R ROLLING U UNITED M MOVED BY THE PEOPLE P PRESIDENT TRUMP","commenter_a":"Any word on royal booze taster Glenn Beeks and his daily abuse of Christianity. I mean what a embarrassment that guy is using God and Christianity to prop up that disgusting philanderer Cruz","post_message":"It's a super religious day or something, he maybe thinks."}]
