[{"comment_id":"10154341988949203","commenter_b":"Hillary can gfh, I'm writing Bernie in!","commenter_a":"If you are for Clinton then you are for more jobs moving abroad. NAFTA, TPP, etc. It might be your job or your town next that is affected.","post_message":"Hillary Clinton has long pushed to regulate access to guns."},{"comment_id":"642161199307792","commenter_b":"If she get to say what she wants ,WHY can't the other people say what they want ,She talks down to ALL the people You could say that bitch pist me off and kelly would so you think all women are bitches no just the ONE THAT PIST ME OFF She just think she is everything do no wrong.","commenter_a":"No","post_message":"Megyn Kelly may be getting kicked off the air...  FOX needs our support, let's give it to them.  Do you support FOX News?"},{"comment_id":"937869812915107","commenter_b":"I hope they suspend her license and hope the liar loses her job!","commenter_a":"She should loose her job & be required to stand on corner with sign showing what she is","post_message":"Our favorite ‘just deserts’ of the week!"},{"comment_id":"10153350460578690","commenter_b":"Haha innocent people. You're funny Ceyda. A Muslim living in Germany saying hitler, who is dead by the way, should finish all the Jews. I hope the west wakes up to the problem of you disgusting vermin and destroys you. You have been sent by the devil through your peodo prophet.","commenter_a":"This stupid Israelis how long would they continue harming innocent people Israel is behaving as if even that land is there's forgetting then were also refugees I wish Hitler could finish all jews","post_message":"Anyone who's received a letter has 30 days to leave Israel. If they refuse to leave they will face a hearing to determine their indefinite imprisonment. @webpagelink"},{"comment_id":"1247572008614366","commenter_b":"Her pants should have caught fire. She needs a choke collar.","commenter_a":"Yes","post_message":"Surprised? Neither are we."},{"comment_id":"523635814493665","commenter_b":"Give the lady her job back, NOW!!!!!!","commenter_a":"Too bad- Boo Hoo Hoo","post_message":"A lunch lady was fired for serving pork to a Muslim student.  We are in America, give that poor lady her job back.  Do you agree Muslims have to Assimilate if they want to stay?"},{"comment_id":"678380735661527","commenter_b":"@username idiot","commenter_a":"well, well, well, so hillary's leaks are coming out! She makes fun of Catholics and Evangelicals, are you going to report on this? Well probably not since another leak talks about how you in the media and donna Brazile help her by giving her question that will be asked in the debates with Bernie, so she could memorise her answers. Hemmmm ,poor Bernie. They even told her when to smile. But guess you won't be report this becuase you're as guilty as she is. What a shame that we can no longer trust the media, the FBI, and of course lying bigoted hillary. We already knew she found millions of people deplorable and unredeemable, but now she hates Catholics and Evangelicals. . Thanks Wickie Leaks for giving us the truth because we know the media won't.","post_message":"\"I regret coming to the Trump support event, and in particular allowing my son to be a part of it,\" one donor said."}]
