[{"comment_id":"1066337003492628","commenter_b":"The woman is delusional.","commenter_a":"That is exactly what they are afraid of, that he will do something that never could do or would do. They just want to keep the people dependent on the government and not be able to stand on there own two feet?","post_message":"Hypocrisy, thy name is \"Democrat.\""},{"comment_id":"1571937346447279","commenter_b":"Get a new woman then!","commenter_a":"In the singing voice of Brad Paisley: Im gonna miss her.... I love my husband AND my guns!","post_message":"\"Sex strike\"  WATCH:"},{"comment_id":"1829950227225236","commenter_b":"William, true but there were two shots to the head though.","commenter_a":"These are the kind of people that \"commit suicide\" with two gun shots to the back of the head.","post_message":"He joins a host of whistleblowers who have been saying this for YEARS!!"},{"comment_id":"443037622487945","commenter_b":"Lol leftist get out","commenter_a":"Wrong, it isn't the IRS it is all the rich corporate fascists. The pentagon spends how much on the military? I hardly think taxation on the regular guy is so bad, but when the rich fail to pay and the greedy steal it all well, you gotta blame somebody, right?","post_message":"The Anti-Media radio show from tonight can be heard here: @webpagelink"},{"comment_id":"1224050534299847","commenter_b":"Give her hell","commenter_a":"If this really occurred, the person should be discharged from Military Service.","post_message":"How sad is it that protesting the National Anthem has even extended to here?"},{"comment_id":"1187297661307572","commenter_b":"@username well, fair enough. Lol.","commenter_a":"The comments here have be idiotic, as I expected. Most likely, this was an attack due to their religious identification. I love how when the victim is not Muslim, these (commenters here) jump to radical Islam. However, when a Muslim is the victim, they want to wait for the facts and not jump the gun. Can't have it both ways.","post_message":"Shot in the back."},{"comment_id":"10154686014913010","commenter_b":"That idiot grabs my pussy and makes it hurt and I dont even have one","commenter_a":"Wow I can sleep better","post_message":"At least one prominent Republican is still backing Trump."}]
