[{"comment_id":"1827275810826011","commenter_b":"Fuck you, bitch. Your head is up your little ass.","commenter_a":"vote for none of the above, the masses need to start a revolution and jail the corrupt 1% who pretend to give democracy in a nwo dictatorship , wake up and fight for your human rights","post_message":""},{"comment_id":"1013476458674427","commenter_b":"It was a lady Marine, she could have kicked his tear","commenter_a":"There are not enough words to describe what a worthless piece of crap this man is & idiots voted for him twice.","post_message":"I'm sure he's really proud of himself."},{"comment_id":"1493733267320483","commenter_b":"Please go to Danney Williams-Clinton FB page he posted a video called Banished. We need to help this young man by spreading his message far and wide. He may or may not be Bill's son.","commenter_a":"Donald Trump continually tries to deflect his inappropriate behavior towards women by turning it back onto Bill's indiscretions. One issue that everyone seems to be missing is that Bill is NOT running for President. Donald is.","post_message":"Thank you, Michelle Obama."},{"comment_id":"10154394102516336","commenter_b":"So true having spent tons of time over there for many years it has changed to be almost unrecognizable sad that my grandkids will never know how wonderful London and England was","commenter_a":"We are next. TRUMP will win.","post_message":"“I think that the British people have had it. They fear terrorism just as the American people fear terrorism.”   Bill O'Reilly breaks down #Brexit, saying it’s not about economics but rather immigration. @webpagelink"},{"comment_id":"1439256216084684","commenter_b":"I ONLY HOPE FOR THE PEOPLE OF MASSACHUSETTS SEE WHAT A PHONY LIBERAL DOLT SHE IS.","commenter_a":"Caught Red-Handed! Elizabeth Warren's Big Secret Just Got Exposed for All to See... @webpagelink","post_message":"Is Elizabeth Warren in political trouble in Massachusetts?"},{"comment_id":"1287351561304298","commenter_b":"Pneumonia?! Doubtful!!! Maybe her conscience raised its despicable, dishonest head and gave her a little peak at her destiny - a one way trip to spend eternity in Hell - now that ought to make her swoon!!! Still...Doubtful!!!","commenter_a":"Just another lie...","post_message":"New News Is Hillary has pneumonia.  FOR THOSE WHO WERE OFF THE GRID TODAY MOST, here is all you need to know about Hillary's \"medical episode\"  (aka fainting) during the 9/11 ceremonies in NYC.  All the videos you need to see:  @webpagelink"},{"comment_id":"10152962610452894","commenter_b":"Lady, what a dumb comment","commenter_a":"So what. If Bruce Jenner can be a woman, she can be black. People can be whatever they want.","post_message":"Exposed! Spokane NAACP Leader Rachel Dolezal Lied About Being Black — She’s Actually a White Woman from Montana [Photos + Video]"}]
