[{"comment_id":"1268420859891333","commenter_b":"Stfu lol","commenter_a":"Amanda merry christmas lmao","post_message":"Bruh!  #Gifts #WSHH"},{"comment_id":"10154602642789062","commenter_b":"They need to close all of them they are evil an come from tha devil","commenter_a":"I hate Walmart.","post_message":"Wal-Mart is closing 269 stores, more than half of them in the U.S. - YOUR THOUGHTS?  UPDATE: 2 Houston stores closing -> @webpagelink"},{"comment_id":"10153185044695950","commenter_b":"And without reading anything, you're a jealous dumb girl who don't know kids are kids.","commenter_a":"Yeah except when you read his school behavior record you realize he's a little shit.","post_message":"Ahmed Mohamed attended Astronomy Night at the White House last night, where he met scientific stars, astronauts and President Obama. During his visit, he had a chance to chat with the president, passing along a valuable lesson: \"...You shouldn't judge a person by what they look like. You should always judge a person by their heart.\""},{"comment_id":"10152822135907434","commenter_b":"You are no gentleman.","commenter_a":"Sure, dude.","post_message":"\"It’s not just about me. It’s about all of us accepting one another.”"},{"comment_id":"10155481461845405","commenter_b":"And I mean prosecute the farmers not the illegal immigrants. You can't blame them for coming here and getting a job . My point is Republicans won't deal with the issue in a responsible manner.","commenter_a":"And they vote Republican and employ the largest number of illegal immigrants and get away with it. The one that do should be prosecuted for it .","post_message":"Did you know that 97% of Wisconsin farms are family-owned? Wisconsin agriculture also employs 413,500 employees and that's 12% of the workforce."},{"comment_id":"10153179691834091","commenter_b":"Hmm...not as bright as WE thought, are you???","commenter_a":"See there, its already fixed. I'm sure it's not the first time this has happened. Everyone have a great night.","post_message":"YIKES!!!"},{"comment_id":"1091142627573414","commenter_b":"You're a pussy","commenter_a":"Vaccines cause Autism. The risk of giving a few kids Autism outweighs the risk of the diseases vaccines prevent. The government will never admit this but it's the truth.","post_message":"How much more time and money do we have to waste investigating this?"}]
