[{"comment_id":"453039741550986","commenter_b":"Pretty and can shoot too !","commenter_a":"This maybe my new favorite person,what a gal!!!! She has more balls than the entire dem party,and half the repubs too!!! Thankyou girl!!!","post_message":""},{"comment_id":"10153281372196323","commenter_b":"You are a whore?","commenter_a":"Well, that was a disappointing click through. Thought it was equal parity for cocks but it turned out to be just one modest member. Ah well. At least I get to see plenty on a daily basis.","post_message":"This season cocks are in – or, perhaps more specifically – out."},{"comment_id":"10153496846973132","commenter_b":"I highly doubt they kept having them JUST to have a girl.","commenter_a":"How selfish, to keep having kids only hoping for a gender. That 13th boy will someday realize he was only born because his parents hoped he'd be a girl.","post_message":"Maybe the 14th time's the charm?"},{"comment_id":"10153203365116615","commenter_b":"your right she shouldn't be. she should be just shot!","commenter_a":"Good. She shouldn't be.","post_message":"Her baby was just hours old and still had his umbilical cord when he was found by a church custodian who heard him crying."},{"comment_id":"10153930448466323","commenter_b":"And you are a very unattractive white woman","commenter_a":"She is a fat, untalented negro who should have made the best political statement by boycotting the super bowl... It's disgusting that stupid entertainment pays people so much while so many are suffering... My husband saves lives for a living and paid way more for his education than any of those people and makes a fraction of what they do... All of them disgusting","post_message":"\"This is not some sudden awakening for Beyoncé – she has given millions to the homeless in Houston, her home city, she and her husband Jay Z have bailed out Black Lives Matter protesters in Ferguson and Baltimore. But now she is moving this highly visible assertion of identity centre stage. Her blackness, her femaleness, her pride, her politics, are not some kind of mysterious subtext.\""},{"comment_id":"10153098697497522","commenter_b":"Let's see how \"sassy\" you dumb bitches are when ISIS gets you. Take your #raisesassygirls bullshit to syria.","commenter_a":"#VOTE The Republican Radical Christian Crazy #PARTYOFHATE out of local state and Federal Government #ENOUGH #VOTE #GUNSENSE #VOTE #Hillary2016 #WitchHunt #BroomsUp #BlackLivesMatter #RAISESASSYGIRLS #FeVoteRising #DontBeAwaLLfloWer #VOTE","post_message":"Is Donald Trump suffering from imposter syndrome?"},{"comment_id":"10153457478146770","commenter_b":"She can't stand herself either!","commenter_a":"Fright night with the Obamas","post_message":"We did NOT see this coming..."}]
