[{"comment_id":"10154024832271756","commenter_b":"Garbage men make a shitload of money. pun intended.","commenter_a":"I found a great way to pay off my student loans....after college I got a job","post_message":"The government estimates that some 41 million students together owe more than $1.2 trillion."},{"comment_id":"10153536003698967","commenter_b":"God... I would love to work here JUST so that I can belittle upper management when they fire my ass for pulling an \"Office Space\"... Also... I can see a documentary in their near future.. Similar to the one about Walmart... ... Can't wait!!!","commenter_a":"I hate to hear that they run Amazon like a Randian dystopia. I use them for so much stuff now. What a shame.","post_message":"Amazon's corporate culture is terrifying."},{"comment_id":"1311217235558559","commenter_b":"I watched and every single one of the questions by Greta and the so-called voters sounded handwritten by Trump henchmen... they each read off their question all just like they were part of Trump 's typical campaign stump speeches... That was nothing more than free air time for a Trump speech... Greta where was Ted or John?''' I am done with Greta and Hannity you just cannot trust anything they would report on again... I used to think better of Greta giving everyone a fair shake but this is just too blatantly biased... hope her ratings tank and Fox gets rid of her!!!","commenter_a":"Gutfield is a moron. Flip the channel whenever he is on.","post_message":"Gutfeld now openly mocking fellow Fox News hosts."},{"comment_id":"1131104760243867","commenter_b":"Because no feminist says that.","commenter_a":"So when feminists say, genders should be separated in school, it's just a valid opinion. But if a straight white male says the same thing about science labs, it's sexist? How does this logic work? Oh, sorry, I forgot it isn't logic, it's stupidity. ;)","post_message":"I'm crying with laughter over some of these."},{"comment_id":"1043755919078659","commenter_b":"White people...now hear this...You have no right to tell us black people, when, where, why, and most definitely how to protest anything at all. Besides, your ancestors brought us here, enslaved us here, discriminate us here, hang, and shoot us here...We're still trying to figure out why? 95% of the last 15 shootings since Kaepernick starting protesting, like many before, have been unarmed black males. He just started protesting 3-4 weeks ago. Do the math on that. There is an eradication of my people in progress. We're fed up. It won't be long before WE start shooting back. Bank on it","commenter_a":"322 white people killed by police this year vs 172 backs. How come the media doesn't report on those lives. Stop reporting 1/2 truths and creating race riots.","post_message":"Police confront protesters in Charlotte, N.C., who were demonstrating after police confirmed they'd shot and killed a man while seeking a different person.  FULL STORY: @webpagelink"},{"comment_id":"1245414865499369","commenter_b":"Bad argument ladies...gentleman... Whatever you started out as","commenter_a":"If it's not a mental illness then they don't need therapy, you can't have it both ways... But oh wait, that's what you people do anyway lmmfao","post_message":"The bill goes directly against most counseling associations' codes of ethics. (via The Huffington Post)"},{"comment_id":"924477534340446","commenter_b":"@username your mother should have swallowed","commenter_a":"If she really wants to make America whole again, she should do the right thing, and GTFO of politics altogether. It's a start at least.","post_message":"Do you agree with Hillary Clinton? #SCPrimary"}]
