[{"comment_id":"1055522267818446","commenter_b":"We're sick of Reruns. Turn the channel. Clintons are history. Make them go away.","commenter_a":"Close, but no cigar","post_message":"“Donald Trump has called your dad an abuser of women, and your mom his enabler. What do you think of his attacks on your parents?”"},{"comment_id":"10154658880931178","commenter_b":"just some dumb f****** n*****","commenter_a":"I still have no idea who this guy is.","post_message":"Under fire music star Chris Brown ranted against the cops and praised #BlackLivesMatter."},{"comment_id":"10157872915845354","commenter_b":"Sadly, anyone can be an American these days, just run across the border or call yourself a refugee. Too many problems...","commenter_a":"I'd prefer \"firearmS\"","post_message":"Amen!"},{"comment_id":"1746275522311169","commenter_b":"Larry, I didn't say \"fire a weapon,\" I said \"purchase and carry a firearm\" Should a gun shop sell a firearm to an 11 year old?","commenter_a":"Back then it was muskets against muskets. Now we have semi autos and the government has fully autos. Seems like we are already behind with the second amendment.","post_message":"#LiberalLogic"},{"comment_id":"10154004343429440","commenter_b":"@username and if you call me sweetheart again, I will find you and feed you your balls. \"Figuratively\"","commenter_a":"Trump has the worst politfact record of any candidate for president ever. Hillary is among the best. Making all of your reports 50-50 so you don't have to listen to Republican whining distorts the truth","post_message":"Denver Post Politics takes a look at how Hillary's statements stack up to the facts."},{"comment_id":"10152938707421130","commenter_b":"So did God fall of his throne and let Obama take over until he's better . I think not Obamas words are and have the hissss of a ankle butting supreme.","commenter_a":"I agree with the president. BB is a dick","post_message":"President Barack Obama tells HuffPost that he dismisses Israeli Prime Minister Benjamin Netanyahu's backtrack on Palestinian statehood."},{"comment_id":"10153334360476051","commenter_b":"Put that mother fucker in jail","commenter_a":"Now now you did it now.","post_message":"Officials took one look at what this government employee was trading food stamps for and arrested him immediately."}]
