[{"comment_id":"10154087270880047","commenter_b":"Oh hell no - the responsibility lady falls on the dingbats having unprotected sex for hell sakes...","commenter_a":"Wonderful.... Just incredible how everyone is so consumed with life at conception. I have yet to hear a plan from the Pro-Life movement that will ensure these \"life begins at conception\" babies will receive all of the necessary love and care that a child so rightful needs & deserves. This becomes YOUR responsibility!","post_message":"VICTORY: The U.S. House of Representatives passed the \"No Taxpayer Funding of Abortion Act\" by a vote of 238-183.        This is a significant, bipartisan step forward for the pro-life movement."},{"comment_id":"10154874760616037","commenter_b":"He said he was deporting illegal CRIMINALS not all illegals.","commenter_a":"it would cause a shitstorm...seeing police officers pulling parents out of their homes while kid's look on crying...meanwhile it would be all over CNN...and the divide between people and officers would be even greater","post_message":"Officers are \"not going to engage in law enforcement activities solely based on somebody's immigration status.\""},{"comment_id":"10154377682500575","commenter_b":"She is done. She knows that she can't beat Trump. So she is play the frail feel sorry for me tactic. She is no good for our Country she hates American citizens she hates minority's she is only after fame and fortune from crooked dealings. Drop out of the race Hillary save yourself the embarrassment of getting your ass beat in a landslide.","commenter_a":"What attack in minnasota n when","post_message":"Get this poor tired woman to bed! Hillary looks like she's going to pass out after speech in DC and bombs in New York."},{"comment_id":"10152996037727869","commenter_b":"Abortions are legal, fingerbanging little kids illegal. Change the law if you want to stop abortions and legalize kid screwing. Oh, but you have Christians like the Duggars fighting for you. Good luck with that. I'll pray that you elect pedophiles so you can pray away the sin and let the criminals walk around molesting new victims. Jesus forgives. but society should prosecute crimes. He admitted to committing CRIMES!","commenter_a":"you might wanna find out more about the Duggars before you endorsed supporting them today..this is why YOU WILL NOT BE PRESIDENT. america doesn't want a president who thinks sexual abuse of children is ok or normal.","post_message":"We’re headed into Memorial Day weekend.  That means more than just picnics and sales and the start of summer.  It’s a time to offer tribute, prayers and thanks to the heroic men and women of America’s military who for over two centuries have laid down their lives to protect our freedoms.    But we should also remember the many wounded warriors who survived the battles, but came home with deep and lasting scars.  They deserve the very best care we can give them.  Not only through the Veterans Administration, but through private aid groups, like K9s For Warriors.  It’s a non-profit group that provides service dogs to vets with PTSD, traumatic brain injuries and other disabilities, to help them return to civilian life with independence and dignity.  100 percent of individual donations go to the program.  And 95 percent of the service dogs they train are rescued from shelters.  So when you donate to them, you don’t just help a veteran, you save a dog, too. Talk about doubling your money!  To learn more, go online to K9sForWarriors.org."},{"comment_id":"10153605944168984","commenter_b":"No more abortions no more planparnthood","commenter_a":"My niece had a baby at four months completely formed , she is still so sad about it death , they held and took pictures. I don't know how this is not murder in the womb ? Cause a abortion is! !!","post_message":"Even with all evidence going against them, Planned Parenthood keeps on coming out with one unbelievable excuse after another.  Do you think it's time to defund and get rid of Planned Parenthood?"},{"comment_id":"10156234250125192","commenter_b":"Nope she belongs to a group.","commenter_a":"I think a gofundme acct should be set up for HER bravery for standing up for our children. (In my case grandchildren). This testing bs in today's teaching in beyond rediculous. The \"common core\" math is crazy. My 12 yr old grandson just got a low grade in math and son in law said he doesn't understand it. There are mire letters than numbers in his math class. He is getting what we had in advanced 12th grade and it is just too difficult for that age to understand and too busy testing for tests to see what he doesn't understand. I pitty Florida kids in public school. Something needs to change before we lose more teachers like this. Please start teaching our kids to love learning and let our kids learn to love learning.","post_message":"A Polk County teacher recently resigned, citing what she calls 'educational malpractice,' resulting from too much standardized testing:"},{"comment_id":"1697499920518952","commenter_b":"Um that's the point! Either way a wall effects their economy and they don't want it! As far as causing more immigrants to come here, that's the benefit of the wall! How stupid can people to to listen to and believe the lines off bullshit that people like oboma feed us?!","commenter_a":"fuck obama","post_message":"Here ya go...  WATCH:"}]
