[{"comment_id":"10153783824626523","commenter_b":"she's hideous","commenter_a":"Who cares","post_message":"Chelsea Clinton has given birth to her second child, a boy."},{"comment_id":"1193495714026101","commenter_b":"If they can live by our laws get out of our country","commenter_a":"Amen !!!!!!!!!! They must be stopped from take over and destruction. All states please follow. Help us keep our great nation. !!!!!!!!!!","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"10155909073040354","commenter_b":"Yea I've been seeing her dumb ass everywhere lately","commenter_a":"Mike Romano this woman is crazy.","post_message":"SHOCK! Nancy Pelosi backs Planned Parenthood."},{"comment_id":"10153321006269087","commenter_b":"What fucking jobs are the illegal immigrants are taking dum ass?? Please fucking tell me!!!","commenter_a":"94 million Americans are not working. Is it because they have become dependent upon the government? Or is it because the Illegal immigrants have all the jobs? 30 percent of all federal prisoners are illegal immigrants. Immigrants are killing Americans: According to the Center for Immigration Studies, 57 percent of the 76 fugitive murderers wanted by the FBI in 2009 immigrants entering the country illegally have a criminal record in the U.S.: In 2010, the Border Patrol reported that 212,000 illegals were caught in the Tucson, Ariz., sector alone, and as many as 30 percent of them already had a criminal record in the U.S. The Pew Research Center estimated that there are nearly 12 million illegal aliens in the nation and the key word is \"estimated\". What's wrong with deportation of illegals? The answer is: nothing. The country would be greater without them.","post_message":"\"The idea of tracking down and deporting 11 million people is absurd, inhumane, and un-American,\" Hillary Clinton tweeted. \"No, Trump.\""},{"comment_id":"10153833789564411","commenter_b":"Israel has been there 3000+ years as proven by archaeology. it's palestine who are the invaders. It's the SECOND palestine if you've studied history. They're Syrians and Egyptians as confessed by the PA itself. They even use the flag of Jordan.","commenter_a":"Guys Guys Guys u no one thing turkey is number one trading partner of isreal....And turkey is first country who excapt isreal as a brother Nation......And turkey is N.A.T.O mamber what N.A.T.O did in libya Afghanistan Iraq and somaliya u no batter then me......Down with Erdogan Down with Turkey...long live Palistayin","post_message":""},{"comment_id":"1672143779721068","commenter_b":"Holy cow. This woman is aging in dog years. In four years, she'll be a shrunken head.","commenter_a":"That's because only stupid woman will vote for her just because she's a woman.just like people voted for Obama just because he was black.","post_message":"A great defender of women's rights? You decide."},{"comment_id":"10153161344347507","commenter_b":"with balls like that, she is a man","commenter_a":"Maybe she'll find same sex love in jail and change her tune","post_message":"If she didn't want to do the job she was elected to do, why is she still there?"}]
