[{"comment_id":"10155973415020354","commenter_b":"Shame on you Fox. Personal feelings are so beyond this forum. You putzes might as well learn how to say, \"large sized or regular?\"","commenter_a":"I'm for Ted all the way, but if Fox wanted to hurt trump it was a mistake,","post_message":"Trumpnado!"},{"comment_id":"1424826404224494","commenter_b":"Evil creeps just like their daddy.","commenter_a":"Assholes someone needs to hunt them down !!","post_message":"Madonna just called out Donald Trump’s privileged sons and it’s EPIC."},{"comment_id":"10152966731859342","commenter_b":"She needs a hanging.","commenter_a":"Sierra Gotti","post_message":"\"Not just one kid, but multiple kids. That's a plan. You're making a plan and continue to do it. I think you are sorry for the last two years, but frankly you're just sorry that you got caught,\" a judge said of a former special education teacher.  WATCH THE TEARFUL COURT PROCEEDINGS:"},{"comment_id":"1131302460296897","commenter_b":"@username let Bill Clinton around them it might really happen.","commenter_a":"Pandering 101 taught by Professor @username. African Americans KNOW that you will ignore them again once the election is over. Your KKK ties and hot sauce lies are blatantly obvious. #NeverHillary #HotSauce #HillaryLies #TRUMPPENCE2016","post_message":"\"You want to give me a good send off? Go vote!\" —President Obama IWillVote.com"},{"comment_id":"10154089965446336","commenter_b":"Yeah, lice likes very clean hair. If you put products in their hair it's likely they won't get it. Oily hair care products are","commenter_a":"It's not super lice it's called...ignorance. Schools inform by sending a note that lice has been found in the classroom. The person is not identified at all..not even to the parent. Infested child goes untreated. Why? The same reason some are abused and some are not, the same reason some parents care about their children and others don't. Children are going untreated and/or not treated properly. This has been going on for years.","post_message":"What can you do if your child is affected?"},{"comment_id":"10152564935772217","commenter_b":"pussy","commenter_a":"D man is a fool is dis how you catch a thief","post_message":"Brave or stupid? This passer-by tackled a robber who'd just raided a jewellery shop in London: @webpagelink"},{"comment_id":"1049317721755905","commenter_b":"full retard mode: engaged","commenter_a":"This is the evidence of existence of Allah !!!","post_message":"Our brains are truly amazing.  By Emily's Quotes, via AsapSCIENCE."}]
