[{"comment_id":"1250171008375949","commenter_b":"NO She is a BAD EGG!!","commenter_a":"No I detest liars. I don't know how she gets away with all the junk that she's done.","post_message":"Hillary Clinton was voted the most admired woman in America in a Gallup poll. Do you admire her?"},{"comment_id":"1212113488867185","commenter_b":"Why is it that the LIBERALS are the one who ALWAYS scream the loudest whenever Voter I.D. is even mentioned let along being considered?","commenter_a":"DESPERATE DEMOCRATS KNOW THEY CANNOT WIN FAIR AND SQUARE, THEY RESORT TO UNDERHANDED AND DEMORALIZING TACTICS!!","post_message":"Libs everywhere were thrilled when Texas' voter ID law was struck down by the courts, which ruled it it was too restrictive. That's when they read the fine print, though...  All of a sudden, liberal jubilation turned to rage and tears."},{"comment_id":"10152943088035950","commenter_b":"OMG, this woman is beyond ridiculous. WTF for real.","commenter_a":"@username. Then we have these morons !","post_message":"A special education teacher accused of holding an autistic boy upside-down and lowering him head-first into a trash says she was trying to \"shake out that trashy behavior.\""},{"comment_id":"10154831195946729","commenter_b":"Well, turns out Michelle Obama herself was accused of plagiarizing part of her speech. In fact, the Democrats who are using last night’s speech as a means to cast aspersions might have done well to pause and consider the list of their own high-profile leaders who have been caught plagiarizing.","commenter_a":"Melania Trump Did NOT Plagiarize Michelle Obama’s Speech And This Is Why… The accusation is that Melania Trump “plagiarized” a speech made by Michelle Obama in 2008. Well I’m sorry liberals, she did not. Here are the comments from Michelle Obama in 2008: \"And Barack and I were raised with so many of the same values: that you work hard for what you want in life; that your word is your bond and you do what you say you’re going to do; that you treat people with dignity and respect, even if you don’t know them, and even if you don’t agree with them. And Barack and I set out to build lives guided by these values, and pass them on to the next generation. Because we want our children — and all children in this nation — to know that the only limit to the height of your achievements ...","post_message":"Wow..."},{"comment_id":"10154394358144062","commenter_b":"I don't trust these hoes","commenter_a":"\"According to the police report, Crowley was intoxicated and made inconsistent statements about Manziel's actions. \" Dem hoes!","post_message":"Johnny Manziel could face NFL discipline for Ohio incident..."},{"comment_id":"10152816075404753","commenter_b":"Wtf?? They should def prosecute dem bitches fym.. they gone go and do that same shit over over again smh","commenter_a":"When we know better we do better.so much apparently went wrong way before the baby was born. Let's solve all the issues leading up to the drop off.lack of birth control lack of medical attention for both mother and child.lack of protection from sexuality transmitted diseases.we all failed here.so let's beat up the mother who had the cottage to face up to the fact that she lacked the ability to raise this child.we can do better than this","post_message":"Colorado has a Safe Haven for Newborns Law, which means a parent can drop off a baby at a hospital or fire station within 72 hours after birth without being prosecuted."},{"comment_id":"10153006629032756","commenter_b":"no it isn't all urine its sweat also, you ever lean on a couch and your arms start itching well that usually sweat, other bodily liquids like tears, saliva and other related stuff can cause the burning of the eyes too","commenter_a":"Jason Meade","post_message":""}]
