[{"comment_id":"10153349534435667","commenter_b":"Nice rack, Mary","commenter_a":"Bengazi butcher leading the uneducated I assume because a smart common sense person would never vote for her.","post_message":"\"We're not taking anyone, and we're not taking anything, for granted.\""},{"comment_id":"1110149189061308","commenter_b":"criminals do know each other and apparently marry their offspring to each other's families!","commenter_a":"Father a criminal politician, Ex., asked for Clinton's support in Mizzou 2 years ago, not to be, and there is some concern that Hillary supported with information received as Secratery of State, investments made by Mezvinskey the younger, including a deep water construction opportunity...............!","post_message":"Allen West Republic"},{"comment_id":"10154994816928256","commenter_b":"US tax payers are going to pay for that wall that Trump wants built, no skin off his back, he don't pay taxes. Suckers","commenter_a":"Deficits only matter when Democrats run the show. How long until you learn this very simple truth?","post_message":"Republican leaders would not say how they would prevent the massive project from adding to federal deficits."},{"comment_id":"10153089911647483","commenter_b":"Noo, not this sweet looking nice white lady!!","commenter_a":"That's sad","post_message":"She was arrested for stealing an 8-foot HDMI cable priced at $39.99 from the Best Buy."},{"comment_id":"10153513260681770","commenter_b":"I have something to say to this wet back. Guess.","commenter_a":"Yeah I don't like him at all !","post_message":"George Lopez has something to say about Donald Trump."},{"comment_id":"10157033906465725","commenter_b":"STOP Crooked Hillary from winning the general election! Together we can turn this country back around in the right direction by getting out and voting! TRUMP 2016!","commenter_a":"NO way!!!","post_message":"It is so important to get out and VOTE in 2016. Crooked Hillary Clinton cannot be our next POTUS! Senator Jeff Sessions just warned, \"This will be the end of law in America.\" Get out & VOTE TRUMP! We will MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10154082239191545","commenter_b":"No, I hope she goes to CNN that's where she belongs!","commenter_a":"I love strong women. She's one to not let anyone run all over her. I like her more and more as time passes.","post_message":"Are you a Megyn Kelly fan?"}]
