[{"comment_id":"10154976296372789","commenter_b":"@username Wanting President Trump to fail is wicked. I don't ascribe to that just as I did not ascribe to it when the right vowed to block the former president and cause him to fail. But seeking truth and speaking truth to power is not wicked","commenter_a":"The left will fail. Wickedness will not prevail.","post_message":"'What I don't like about what is going on now, is there is an absolutely frenzied and concerted attempt to delegitimize, sabotage and destroy the Trump presidency before it even started.\"  Piers Morgan believes that the mainstream media is fueling \"hysterical\" attacks on President Donald J. Trump, and it's fundamentally \"un-American.\" What do you think? @webpagelink"},{"comment_id":"10152653302261167","commenter_b":"Females can't pass Marine tests. In other words, they can't get out of a foxhole with loaded backpack on. What harm could that cause?","commenter_a":"Those women go through the same training as the men, do they not? Are you going to insult all of our enlisted women by telling them they aren't combat capable?","post_message":"The man who the U.S. military kicked out of Iraq for divulging  sensitive information about troop locations has some thoughts on women in combat."},{"comment_id":"10155127516070294","commenter_b":"A**hole","commenter_a":"Blacks,, that's all they know.","post_message":"You may have seen the video circulating online...  Now, because of social media, police say two people have been arrested in the large brawl at Beachwood Place Mall the day after Christmas. More here: @webpagelink"},{"comment_id":"573913712787669","commenter_b":"Yada, yada, yada. This woman(?) Is so full of BS she makes me ill.","commenter_a":"Get over it!","post_message":""},{"comment_id":"903161916494805","commenter_b":"@username because of disparate impact and disparate action. White people can get up out of bed, run a comb/brush through their hair and be out the door in five minutes. Blacks cannot do that so much, unless their hair is cut to their head--shaved. The rules negatively impact Blacks because without those styles, there isn't much left without using relaxers or paying for extensions. When rules or laws are placed for everyone as is here, but negatively impact one racial, religious, gender group, then it's discrimination and needs to be stopped.","commenter_a":"Can I ask an honest question? In that school, is there a ban on long slick hair, mullets or any other \"white hairstyles\". If so then I can actually understand the ban. But if there is no ban on \"white hairstyles\" like long slick hair, but there is a ban on \"black hairstyles,\" then yeah, i agree, it is discriminatory.","post_message":"This school just banned traditionally black hairstyles  and people are outraged.  #MicBrights"},{"comment_id":"10154963330566509","commenter_b":"Not if we can help it....She is criminal","commenter_a":"Glad to see all the Democrat converts. Hillary will crush Trump in the general.","post_message":"The conservative columnist George Will is advocating that others do the same."},{"comment_id":"10153635830302061","commenter_b":"@username Wow.....you are a wicked mean nasty woman!!!","commenter_a":"It was a great dance to encompass her whole journey on the show, but in no way does it compare to Nyle's or Paige's.","post_message":"WATCH: Ginger Zee & Valentin Chmerkovskiy's take the dance floor by storm in last night's Contemporary Dance to a cover of Coldplay's \"Adventure of a Lifetime.\" Dancing with the Stars Season Finale continues TONIGHT!"}]
