[{"comment_id":"1202853869734641","commenter_b":"Muslim go home","commenter_a":"I don't believe we should elect a president so delusional he believes the Earth is only 6000 years old and that going to prison can make a person be gay...","post_message":"\"I would not advocate that we put a Muslim in charge of this nation,\" Dr. Ben Carson told Meet the Press."},{"comment_id":"941945919231796","commenter_b":"Lol. They immigrated too #landbridge","commenter_a":"Should learn wut? Now listen here sis... You are just brainles jerky What the hell is American? You mean English????","post_message":"She fits right in with Donald Trump."},{"comment_id":"10154426729152446","commenter_b":"Wtf. Who do they think they are. Little unqualified woman","commenter_a":"wth???","post_message":"@webpagelink"},{"comment_id":"10156577107260725","commenter_b":"Rand Paul is already crying he is your typical corrupt out of touch Washington politician. He wants to rid us of the US military. So that jerk will be at the debate.","commenter_a":"I can make a difference between Winning & Losing & i really want Donald Trump to Win. I have lots of valuable inputs to give. How do i get in touch with you. Warm Regards, @username...","post_message":""},{"comment_id":"10154118857949087","commenter_b":"Stop it with the memes already! I wish @username would disable them.","commenter_a":"He will be just fine. It's Hillary The Post needs to be concerned about.","post_message":"“It’s beyond debate that Donald Trump is unfit to be president.\""},{"comment_id":"658477470966222","commenter_b":"I'm sorry this woman is no good for this country I'm sure there is the woman that be a Great president for this country but she is not the one she is evil and corruptive I see a whole lot of old women who think I got 1 foot in the grave I should vote for a womanwrong","commenter_a":"It still look's like a trash bag on her.","post_message":"Hillary Perón"},{"comment_id":"10153252381712016","commenter_b":"Don't speak for young women. You aren't one.","commenter_a":"Young women see through Hillary..she put up with a cheat for a husband as a ticket to the WH...thats not what young women want for a future...its from the 50s...she lied to protect him through numerous scandals and no longer does it convincingly...she mumbles stock phrases about equality with no real commitment to anyone but her ambition!","post_message":"\"Through a record-breaking voter turnout, we won because we harnessed the energy and the excitement that the Democratic Party will need to succeed in November.\" --Bernie Sanders"}]
