[{"comment_id":"887798031255619","commenter_b":"@username oh he knows and has known what he and his commies have planned for years. The plan of his has always been to take over the U.S.A. There are a lot like him supporting him and giving the cash as they all support evil and destruction. They are up to no good and they count on the uninformed and their party followers to go along with their evil. But they needed the illegals and open borders to aid and abet them even more. He is a muslim too and look at the damage they do to mind body soul and spirit. God, the Creator of Heaven and Earth will eventually take care of all evil. We have to be patient and know our true God wins. Lo, to those who are against him.","commenter_a":"He should be in prison LIFE.","post_message":"A global threat of terrorism, and THIS is what Obama does?  Time to IMPEACH!"},{"comment_id":"1031698180201852","commenter_b":"why did this piece of shit get a job on T V anyway ??????? tampons for ear rings that is one sick hoe !!!!!!!!!!!!!!!!!!!!!","commenter_a":"Good","post_message":"\"While MSNBC may believe that I am worthless, I know better.\""},{"comment_id":"10153962435457235","commenter_b":"ive got a few vulgar words for this trump ish.... can not stand her face, her voice, or any damned thing that comes out of her mouth. this woman is a vile creature that needs to crawl back under whatever rock she slithered out from.","commenter_a":"Founding father of porn.","post_message":"It's hard to imagine the GOP getting more juvenile than this -- but let's see what happens tomorrow!"},{"comment_id":"10154165590671746","commenter_b":"Yes ! Now the lazy legal Immigrants have no excuse of not being able to find jobs","commenter_a":"Please restaurant owners get new workers","post_message":"Two South Shore restaurant owners were put on notice by their staff either early Thursday morning or Wednesday evening: Workers would be no-shows for the 16th \"out of protest.\""},{"comment_id":"10150900817029999","commenter_b":"Well Said and Thank You!","commenter_a":"Have the rest of you bothered to read his comments? He says he does not hate the flag. Does not hate America. He doesn't sound \"spoiled\" to me (and I am an affluent, old, white guy). He has used his position to stimulate conversation about a very important issue. (Why IS it that a lot of black people out for a walk end up getting shot without many repercussions?) I like the guy (except when he plays the Broncos!)","post_message":"Colin Kaepernick explains his protest against racial injustice.  Read more: @webpagelink"},{"comment_id":"1090268744329629","commenter_b":"at least all those illegals your allowing in here are getting to work.","commenter_a":"14.4 million part time jobs.","post_message":"Another positive jobs report out this morning. 215,000 private-sector jobs were added in March.  That's 73 straight months of private-sector job growth."},{"comment_id":"1091281260931621","commenter_b":"False? He plead guilty and was a registered sex offender.","commenter_a":"Best known for being a paedophile.","post_message":"RIP Jackass star Vincent 'Don Vito' Margera"}]
