[{"comment_id":"693308824147234","commenter_b":"and being hoes..laaag","commenter_a":"This shit here is crazy. All week we been talking bout Kylie like she beyond famous. Her family is known for fucking and being hoes. Malala opens up a school and nobody don't say nothing the worlds view point on things is fucked up.","post_message":"Quit making stupid people famous."},{"comment_id":"1018456324917286","commenter_b":"It's not Trumps place to judge. Isn't that what the gays and muslims are always complaining about?","commenter_a":"I can hardly believe that I even watched that whole segment on The Last Word With Lawrence O'Donnell.","post_message":"Donald Trump lets a supporter calling President Obama a Muslim slide."},{"comment_id":"10153532462028352","commenter_b":"And nobody in those stores were killed btw","commenter_a":"Use your brains people, this story isn't getting plastered all over the news because she's a good mother,AMERICA GETS OFF ON SEEING BLACK MEN GETTING ATTACKED.. And this is a perfect way to hide behind the actions of his mother. They love seeing black men being put in \"check\" and being demeaned in public....AND Have you ever seen a black mother hit her son for enlisting in the military to fight some people that has no effect on the oppression of blacks in America ?","post_message":"‘I didn’t want him to be another Freddie Gray': America’s favorite mom speaks out after smacking masked son and dragging him from riot"},{"comment_id":"1189205214435858","commenter_b":"Go suck or the black dicks racist bitch","commenter_a":"Look black on black crime is the number death rate among blacks! They need to talk to each other. They also need to fix their family unit, that's how young kids make it in life!","post_message":"#BlackLivesMatter were not happy with this speech"},{"comment_id":"2202427943315983","commenter_b":"@username go beat your wife old man","commenter_a":"The ole draft dodger than said McCain wasn't a war hero because he was captured in battle. Yeah he really respects our military to nominate someone who is already part of the problem with the VA. I am a Republican at heart but I'm not going to blindly follow this man like some are. Words have meaning.","post_message":"Watch: President-elect Donald J. Trump and Vice President-elect Mike Pence lay a wreath to honor the nation's fallen soldiers at Arlington National Cemetery."},{"comment_id":"10153286809849726","commenter_b":"She is a racist","commenter_a":"What a loser ..Disgrace to the United States..","post_message":"WATCH: Ann Coulter Blasts Michelle Obama on Race: 'I Think She's Just Letting Out Her Reverend Wright Now'"},{"comment_id":"10152868223844342","commenter_b":"You all ladies is nutts","commenter_a":"The mom went looking for trouble. This all would not have happened if she would have been the adult and just let it go, but she couldn't. She payed the ultimate price and now this teen is going to have to answer to a judge. No one wins in this situation. Two families lifes are forever changed. Smfh","post_message":"Police tweeted this photo of the suspect in a road rage case that left a #LasVegas mother dead  FULL STORY @webpagelink/  Photo courtesy Las Vegas Police Department"}]
