[{"comment_id":"1199514790068549","commenter_b":"\"Tear Down This Wall!!\"","commenter_a":"Reagan might but Eisenhower would not as he was too far left for todays GOP.","post_message":"When you compare self-identified Republicans today to those of 1990, you have to wonder how well Reagan would do in the 2016 race."},{"comment_id":"10154838138336509","commenter_b":"If she does a good job, why should anyone care that she is single?","commenter_a":"China, it's non of your business. So proud of our new president.","post_message":"\"As a single female politician, she has no emotional encumbrances of love, no family restraint, no children to worry about. Her political style and tactics are often emotional, personalized, and extreme.\""},{"comment_id":"10153512973605671","commenter_b":"It was her idea. Men don't gaf","commenter_a":"Hahaha thought this was funny Brock. Idiots","post_message":"The massive metal pieces were found in an odd place—a backyard wedding"},{"comment_id":"608933979286362","commenter_b":"Gennifer Flowers: Bill Clinton Told Me 'Hillary Had Eaten More Pu**y Than He Had'","commenter_a":"i like hillary clinton","post_message":"If we unite together, we will rise together."},{"comment_id":"10154455305884087","commenter_b":"Mike I'm with you exept the pre_existing what are people to do just die after the doctors and hospitals have done taking everything that is just morally wrong","commenter_a":"These people are so ignorant and out of touch it is ridiculous, that is one of the issues that got Trump elected. Repeal and replace, I am for a free market insurance health care. We do need to make sure that pre-existing conditions are covered, and letting parents insure their children until 26 is a good idea. If they need medical attention they are insured, and the taxpayer will not have to foot the bill.","post_message":"47 percent of Americans oppose repealing ObamaCare, while only 20 percent want it repealed immediately."},{"comment_id":"920378308055224","commenter_b":"Chris, stupid bitch, For Real, and there's the hate card you stupid impotent motherfucker.","commenter_a":"Hey it could have been done sooner. White priveledged males prevented it.","post_message":"EXCELLENT news!"},{"comment_id":"10153172465199255","commenter_b":"Bye Felicia!","commenter_a":"Thank God!!","post_message":"Whoa."}]
