[{"comment_id":"1210841148970887","commenter_b":"Be honest, if it was anyone other than Trump, would you STILL vote for her? Fact is she would have already packed up her tent and left town to sell more books if this was 't Donald frigging Trump she was running against? That's something to be proud of? The second worst? You see that's where a candidate needs to be a good candidate to get my vote. In my book she's not, if your Presidential standards are that much lower, ok, vote for her. Mine aren't.","commenter_a":"Sorry Bernie, but I can't sit here and watch you degrade yourself into just another shill for her. You used to hate what she stands for. Now you endorse it. I hope you find your way again Bernie. But for now. I gotta unlike ya.","post_message":""},{"comment_id":"10153148435072098","commenter_b":"Wrong person died","commenter_a":"Guess his high heels got stuck on the gas pedal haha 😂","post_message":"BREAKING..."},{"comment_id":"913998228643418","commenter_b":"As if inflation isn't a tax increase unto itself. Total money grubbers...","commenter_a":"The present gas tax money, originally intended to maintain or build our roads is not being used exclusively for that purpose. If it was we'd know exactly how much money we need to do this job","post_message":"The nation’s gas tax will be raised to 30 cents per gallon and increase at pace with inflation if a bipartisan group of House lawmakers get their way in seeking funding for a new transportation bill. @webpagelink"},{"comment_id":"10154116780129749","commenter_b":"Stick with the real story... Isis killers murdered people in Brussels and Paris... They are Muslim., not all muslims are like that. FACT. Focus on hunting down these Arab Dog sh*t murderers... The politically correct are part of the problem. So shut the f*ck up about this clown.","commenter_a":"OMG. Are you stupid, ignorant or both? surely this is a joke!","post_message":"\"Croydon\" started trending as Twitter was flooded with scores of tweets condemning his comments."},{"comment_id":"1735291753418932","commenter_b":"Tyler","commenter_a":"Julia Lynch yay","post_message":"Wristbands allow festivalgoers to return to the empty field after a trip to the parking lot to retrieve more MDMA, mephedrone, 2-DPMP, Benzo Fury, Adderall, or synthetic cannabinoids."},{"comment_id":"10153954150653606","commenter_b":"actually I love me some Tom Collins","commenter_a":"Love me some Pat Collins","post_message":"FUNNY MOMENT OF THE MORNING: \"I have more layers than a Smith Island Cake\"- Pat Collins"},{"comment_id":"10154438861719726","commenter_b":"While I can understand the basis for some of these observations, the main thing I firmly believe is that perhaps just over half the Democrats who actually voted for Obama in the last election will turn out to vote this cycle. I do not see near the support, energy, emotion, or urgency that I saw in the last two Obama campaigns, and lets be honest here folks... Hillary Clinton IS NOT barak obama. She does not have the well-oiled campaign machine Obama had. All she has is a character-assassination campaign, that's it, and it's exactly what I expected from her too. It honestly would not surprise me if Trump carried a lot of the swing states simply because democrat voters know she's a damaged candidate. Add to that that about half of the Democrat voter bloc in play this cycle was Bernie Sanders supporters of which many of them won't ...","commenter_a":"HIllary doesn't want to talk about the issues because she has no plans except what Obama has told her to say.","post_message":"This is the strategy Trump can use to defeat Clinton:"}]
