[{"comment_id":"737426566424213","commenter_b":"Good Lord, this woman doesn't have a clue.","commenter_a":"Michelle Marjan","post_message":"Betsy DeVos, Trump nominee for Secretary of Education, is remarkably unqualified for the job.  Full video: @webpagelink"},{"comment_id":"872299812875772","commenter_b":"Hillary is spreading disgust. She's a shameless, pathological liar with no morals at all.","commenter_a":"She is a complete idiot as well as a liar.","post_message":"Hillary Clinton says Donald J. Trump is spreading fear. Thoughts?"},{"comment_id":"636847006505878","commenter_b":"who said she was a lady","commenter_a":"She is by far the worst First Lady of all time.","post_message":"What Michelle just said is one of the dumbest things we've ever heard.  This is just absurd. Michelle is moronic and un-American.  Is Michelle the worst First Lady of all time?"},{"comment_id":"10153744436512894","commenter_b":"Her weaves be the worst. .lol","commenter_a":"Wish them all blessing in life , hope God,s in the equation","post_message":"Pregnant Blac Chyna Goes Glam to Film Upcoming Reality TV Show -- See Her Latest Look!"},{"comment_id":"822546624556646","commenter_b":"Trying to straight-wash and white wash the situation is terrible. Not only was this guy scoping out gay bars before, he also chose to go on Latinx night, when most of the patrons were PoC, generally of Latin descent. So this was a hate crime. It had to do with race, it had to do with sexual orientation. You trying to bury those facts is deplorable.","commenter_a":"This isn't a gay attack. It's a terrorist attack that's being portrayed as homophobic because that's a cause people will rally for. Anything to further your agenda. No one wants to believe it's radical Islam, but that's what this is. Of course his family and even his own tweets blame gays. A gay bar is a perfect target so we can blame homophobes and call it a a hate crime. Well terror is also a hate crime and gay or straight these people are dead.","post_message":"President Obama on Sunday morning's mass shooting at a gay nightclub in Orlando, Fla. It's the deadliest mass shooting in U.S. history. @webpagelink"},{"comment_id":"1297175820325446","commenter_b":"IF TRUMP IS SO PRO-ISRAEL THEN WHY NOT A 2 TIER SYSTEM AND HUMANE PRISON REFORM SYSTEM HERE 2?!!!!!!!!!!","commenter_a":"Once the ACA is dismantled, people are in for a RUDE awakening. If you thought premiums/pricing was bad before, they will only get higher once \"Obamacare\" is gone. Trump voters are, essentially, like the dog with the bone who sees a reflection in the water of another dog with a bone, and tries to snatch it, losing both bones. I guarantee that you will be severely disappointed.","post_message":"LIVE: Sen. Bernie Sanders is holding a town hall meeting on CNN, talking about how we can fight back against Trump's bigotry and fascism.   *** audio is missing from the first few seconds, please stay tuned and it comes on shortly***  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154712376336756","commenter_b":"He was a pastor in the Southern Baptist Conference whose strict, written doctrine is anti-LGBT. Whether rabidly or tacitly he was promoting anti-LGBT beliefs by choosing to hold that job.","commenter_a":"The story doesn't address how the pastor felt about gays before his son 'came out' ? Did he always think that gays should be loved, treated fairly, equally like every one else, or is he just coming to that realization because of his son.","post_message":"After the pastor told his congregation about his son's coming out, \"I felt like this weight had just been lifted out of me, and people knew where we stood.\""}]
