[{"comment_id":"486046958252551","commenter_b":"What gets me though is why are these atheist bitches so offended by something they don't even believe exists Just proving their true ignorance I guess...!","commenter_a":"GOD BLESS AMERICA!!!!!!!(keep it going!)","post_message":"This student was told not say 'God bless America', but he's not backing down.  Amen. We stand strong with this student and his flag.  Do you support 'God bless America' staying in schools?"},{"comment_id":"10153750563214497","commenter_b":"Liar. You're not a prostitute.","commenter_a":"As an African American prostitute I find this offensive.","post_message":"For more world-renowned reportage, visit theonion.com."},{"comment_id":"1960555887503751","commenter_b":"TRUMP! Go, go go ... Defeat that evil woman and make America great AGAIN!","commenter_a":"Killary is a beast and needs to be in prison........TRUMP is the only candidate that deserves to be president","post_message":"I will defeat Hillary Clinton - and MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10154517298243132","commenter_b":"@username It has already been released that the arresting officer was a open lesbian in a relationship. Also that according to court documents, that her ex was terrified of Amber after the \"assault\" took place and that there was property that belonged to the ex that was damaged. Funny how records show one thing and now the ex is stating something different.","commenter_a":"Why isn't @username publishing the story Daily Mail and TMZ did about Amber Heard's domestic violence charge from her ex \"wife\". She obviously has a violent past and I'm not say that \"if\" she was abused that what happened to her was justified. The fact maybe they had a volatile relationship. She could have also beat on him as well as he her, again abuse is abuse. But for all the victims out there, if she is lying for the money that's basically a slap to the face for those who were actually abused.","post_message":"iO Wright says Amber Heard suffered at the hands of Johnny Depp."},{"comment_id":"1200289290023832","commenter_b":"It just needs to be remembered do this with no violence unless it is used on them and if the illegal aliens respond with violence deal with them direct and swiftly. No questions just stomp them and dump them back across the border.","commenter_a":"She just deserve a raspberry. It is the to be said to her. Our immigration system needs work but she is really talking about letting illegal aliens in. The term illegal means we have acknowledged that they have committed a non-legal act, thus becoming a criminal. That means do not pass Go do not collect 200 dollars. They are already being coddled at our expense. If, they are caught they should be taken direct to be fingerprinted and photographed, then directly to a border. If, they are identified as having done it before. We should setup a location far away to ship them to. This non-American needs to mind her own business, instead of trying to shovel her troubles on to us.","post_message":"Oh really?"},{"comment_id":"10154082437051051","commenter_b":"As usual she is lying.","commenter_a":"Wrongagain.","post_message":"Hillary Clinton says there's no question Obama will go down in history as a successful president. Is she right?"},{"comment_id":"10153681874356130","commenter_b":"Did he build the wall?","commenter_a":"The Pope is a hypocrite. Take down the Vatican walls and let people enter freely and demand to be taken care of.","post_message":"Satan For President? @webpagelink"}]
