[{"comment_id":"10153335826619714","commenter_b":"Finally!!!","commenter_a":"@username Durrah Afyouni Masah Azar @username Maya Maaytah","post_message":"Vogue shoots & profiles Andreja Pejić"},{"comment_id":"10154246184914609","commenter_b":"BUILD THE WALL","commenter_a":"Good because if you bothered watching the full video, you would see those guys attacking trump supporters and taking their signs. Those thugs (not protestors) got what they deserved.","post_message":"About that photo widely circulated across social media: “It started burning – burning really, really bad. I couldn’t open my eyes for probably 40 minutes,” the man hit says. @webpagelink"},{"comment_id":"10153362119139087","commenter_b":"IF I WERE A JEW ,,,, i would not want this broad on my side shes a idiot !!!!!","commenter_a":"Oh, please nitwit.","post_message":"“Our country turned [900 Jewish refugees fleeing Germany] away, and many who were sent back to mainland Europe were killed in the Holocaust,” said Democratic National Committee Chairwoman Rep. Debbie Wasserman Schultz. “Instead of learning from that mistake, Republican candidates and politicians were eager to repeat it.”"},{"comment_id":"10153715482507452","commenter_b":"@username my point is just because the government calls it illegal doesn't mean so that's my point and hector no conspiracy you just like to believe everything the government tells you","commenter_a":"Even if the lady were to have been illegal, the US low key appreciates the narcotics the government sells it themselves on the side where else can they seize the dirty $$$ that keeps circulating","post_message":"A San Diego woman traveling from Mexico was busted at LAX trying to smuggle in more than 11 pounds of crystal meth tucked away in the lining of her suitcase."},{"comment_id":"10153231132726336","commenter_b":"they should leave and not allowed back","commenter_a":"Look all black","post_message":"\"If you don't like what that flag stands for... leave!\"  On 'Fox & Friends,' Medal of Honor recipient Dakota Meyer called for a social media campaign to counter a movement encouraging Americans to stomp on the flag."},{"comment_id":"10153906415276545","commenter_b":"@username You are correct, we have plenty of citizens/legal residents committing crimes we don't need those who aren't supposed to be here in the first place compounding the problem. It is time for sanctuary cities to end. Either you are part of the U.S. and adhere to U.S. law which should be enforced or you secede.","commenter_a":"Is this guy a legal citizen?","post_message":"Laura Ostteen took a hit so hard that it hurts to see. All because of a 5 a.m. run for milk to a convenience store as the city of Dallas sees increase in violent attacks."},{"comment_id":"1783246305275728","commenter_b":"@username Yes She did","commenter_a":"I am Dutch. Sylvana Simons said \"All White people are Racists\". Now everybody is angry at her. She never changed her opinion and never said sorry. She is a member of Denk, a Dutch Turkeys political party. The party has very extreme opinions and backs Erdogan without questions. They like sharia law, and child marriage.","post_message":"\"People shouldn't turn it into something negative,\" says one mum whose son dressed up as 'Black Pete' for a parade."}]
