[{"comment_id":"853431768039181","commenter_b":"I notice that there were over 5,000 views I'm sure with the government controlled internet that is about 5,700 over raided so like no one cares.... BUT more scandals and more lies... she will be just like obama,,, she wants to take your right's away just like obama... and she will win by the votes of all the illegals that MUSLIM obama let in..","commenter_a":"Scandal after scandal after scandal from the early years until now. No wonder 57% of all of American's find her untrustworthy !!! The other 43% are Liberal morons.","post_message":"New York Times reporter Maggie Haberman says that Hillary Clinton looked “very defensive” answering questions."},{"comment_id":"1053111538057600","commenter_b":"Both of these mooches need to get out.Better make sure they don't steal anything, like clinton did when she left the whitehouse.","commenter_a":"She looks bored big time.","post_message":"I agree!"},{"comment_id":"10153078341498812","commenter_b":"Can't we just all agree that Muslims should just be wiped off the face of the earth?","commenter_a":"\"Not afraid.....hey America you guys are still coming right????\"","post_message":"\"NOT AFRAID\" - Thousands in France gather to a send message after Charlie Hebdo attack: @webpagelink"},{"comment_id":"1603960996557680","commenter_b":"Deport her","commenter_a":"Racist pig!","post_message":"Ridiculous...  Take Oprah Winfrey off TV right now."},{"comment_id":"1588672124482344","commenter_b":"Shut up phonies","commenter_a":"U need to find out mr trump how much killary and obama paid her to do that","post_message":"Meryl Streep blasted Donald Trump and the people who voted for him at the Golden Globes. She received thunderous applause from most of the celebrities gathered there. Do you agree with Trump's assessment of her career?"},{"comment_id":"10155155433964778","commenter_b":"She wasn't a black swimmer to me until the media and people who keep stressing the fact of the first \"African American\" ... First off the has been in the past but what I see of anyone in the Olympics is an athlete who trained very hard and worked through their own adversities to reach their goals. To me African Americans want the dividing line to diminish, I know I treat people as people so I think the media should stop putting a dividing line there. I don't care who you are if you want to do a sport and make it to the Olympics with hard work and perseverance you can make it, it's not your color that helps you make it.","commenter_a":"She was just another amazing swimmer to me. I didn't think about her race...SHE made that the issue. It's hard to be colorblind when it keeps getting made an issue BY THE ONES COMPLAINING!! WTF!","post_message":"\"I want to be an inspiration, but I would like there to be a day when it is not ‘Simone the black swimmer.’"},{"comment_id":"1685131825099212","commenter_b":"Bitch!","commenter_a":"Bitch","post_message":"Can you describe #Trump with 1 word?  The Free Thought Project.com (y)"}]
