[{"comment_id":"1777765929177182","commenter_b":"Hillary Clinton is pure evil! Most vile, lieing, thieving, corrupt witch on the planet!","commenter_a":"She lied and lied and has lied about her lies, all the while breaking the law, and half America still thinks she should be president. I would as soon a bank robber or one who had commited treason be president. Her lawbreaking and lying has been such a lifestyle for so long I can't imagine her being president no matter what skunk is running against her.","post_message":"An iconic photograph of Hillary Clinton using her BlackBerry while wearing sunglasses on a military plane prompted an official in her office to inquire about whether Clinton had been assigned a government email address...  The information came out in sworn testimony in a Judicial Watch deposition of Karin Lang, a former State Department official. Please SHARE!"},{"comment_id":"727863887335286","commenter_b":", WRONG, No way, get real, he had every right as well as a duty to make the case of Israel to America's ears. I learned more from his talk then from our ever non-transparent utopian president who believes the world will all sing kumbaya together because of his ever lovin idealistic, progressive, warped world view.","commenter_a":"Tha.no Mr john Boehner for inviting The PM. Thank you","post_message":"Do you agree? Jerusalem Post \\\\ Opinion & Blogs"},{"comment_id":"10154295602821037","commenter_b":"Claude, women who use the term \"Feminist libtard\" are sexy.","commenter_a":"Good lord! If men couldn't get a job because they hit on a woman at one time or another throughout the years, there wouldn't be any in the workplace! Women like this give us all a bad name. She must me a feminist Libtard! I'm sorry....some people will do anything to get attention and they are coming out of the woodwork! She acts like he raped her! I'm guessing she's trying to make a name for herself through Trump since she couldn't with her writing skills.","post_message":"Our reporter attended a Donald J. Trump event in 1987: \"Trump said there would be an even better afterparty and I was welcome to join him, but only if I came alone.\""},{"comment_id":"10153869125358812","commenter_b":"Why are Christians punished for praying. No one says others have to follow.","commenter_a":"Wow","post_message":"High school football coach suspended for praying at games attends as a spectator while  Satanists gathered outside of the stadium: @webpagelink"},{"comment_id":"1030585200364962","commenter_b":"DON'T TRUST HER ... Obama and Hillary want to rescue 200,000 Muslims. This is the same two that couldn't rescue four Americans in Benghazi. ... #VoteTrump2016","commenter_a":"Hillary's background If you happen to see the Bill Clinton 5-minute TV ad for Hillary in which he introduces the commercial by saying he wants to share some things we may not know about Hillary's background, beware. A person who was there for most of their presidency and knows them better than just about anyone has listed a few corrections. Bill says: \"In law school, Hillary worked on legal services for the poor.\" The facts are: Hillary's main extra-curricular activity in law school was helping the Black Panthers, on trial in Connecticut for torturing and killing a federal agent. She went to court every day as part of a law student monitoring committee trying to spot civil rights violations and develop grounds for appeal. Bill says: \"Hillary spent a year after graduation working on a children's rights project for poor kids.\" The facts are: Hillary interned with Bob Truehaft, the ...","post_message":"Hoy, el Departamento del Trabajo acaba de anunciar nuevas reglas laborales que garantizarán el pago de horas extras a trabajadores que ganan hasta $913 dólares a la semana o $47,476 al año. Esto es más del doble que el límite pasado de $455 a la semana.   Hillary: \"Aplaudo al presidente Obama y al Secretario del Trabajo, Pérez, por estas reglas sobre horas extras laborales, las cuales levantarán a trabajadores a nivel nacional y ayudará a que los salarios aumenten nuevamente para las familias trabajadoras. Durante el primer año de la implementación de estas reglas, millones de trabajadores adicionales serán elegibles para el pago de horas extras, finalmente cobrando totalmente por las horas que le dedican a sus trabajos... Nadie que trabaje 40 horas a la semana debería tener que mantener una familia en la pobreza”."},{"comment_id":"1790041197906165","commenter_b":"She should behead you #deplorable","commenter_a":"Hillary could behead a school bus full of children on national TV and she wouldn't get arrested.","post_message":"\"Based on our review, we have not changed our conclusions that we expressed in July with respect to Secretary Clinton,\" FBI Director James Comey wrote."},{"comment_id":"10153448214053984","commenter_b":"That lady has a problem nice in front of kids","commenter_a":"He was absolutely right in what he did. People like her should be called out. They have no respect for any rules, they think they don't apply to them.","post_message":"I would have done the same thing.  What do you think?"}]
