[{"comment_id":"10153362031969087","commenter_b":"BAN ISLAM! BAN MUSLIMS! CLOSE THE MOSQUES NOW!!!","commenter_a":"I see we owe the NRA and Republican a big thank you for allowing another mass shooting DROP DEAD YOU MOTHER FUCKERS","post_message":"\"Upwards of 14\" people are dead and \"upwards of 14\" people are injured after \"up to three people\" opened fire at a holiday party inside the Inland Regional Center building in #SanBernardino, California. WATCH LIVE:"},{"comment_id":"1164340116952083","commenter_b":"That is the stupidest thing I ever heard. Why don't she give up here ARMED BODYGUARDS.","commenter_a":"Never ever going to happen!!!","post_message":"She must have PTSD from all that sniper fire in Bosnia...."},{"comment_id":"1473249136068163","commenter_b":"Men don't walk around campaigning for free the japs eye so why do women do this","commenter_a":"That's bold.","post_message":"Nude York City!"},{"comment_id":"10153172465199255","commenter_b":"Bye Felicia!","commenter_a":"Thank God!!","post_message":"Whoa."},{"comment_id":"848307568693153","commenter_b":"GO stuff your FAT ,UGLY, RACIST face!","commenter_a":"What IF I ONLY HATE \\bOBAMA'S \"WHITE\" Half???","post_message":"If you hate Oprah does that make you a racist..."},{"comment_id":"10154563993751336","commenter_b":"No illegals. Period. No other country puts up with this crap. Not even Mexico. No more paying Welfare, etc., for these people. They break our laws and then steal from us. Those of us that actually pay federal taxes are sick and tired of working so they can have Free Medical, welfare, EBT cards, educate THEIR children, Welfare..Etc., Out they go. Deport them and build the wall.","commenter_a":"I'm all for Trump winning this upcoming election, but building the wall is a joke, and thinking he can make Mexico pay for it is a bigger one. Wall or not you're going to have illegals come in.","post_message":"\"[Donald J. Trump] has stuck to his guns on the idea that we're going to have a border, we're going to enforce the border.\"  Gov. Mike Huckabee joined Howard Kurtz on \"MediaBuzz\" today to react to the GOP presidential nominee \"softening\" his tone on immigration. @webpagelink"},{"comment_id":"447635222089017","commenter_b":"You are probably pro abortion cause you hate child support...","commenter_a":"This is great. You idiots that are against abortion are just that Idiots. Quite trying to take rights from Women . Plus Planned Parenthood doesn't pay for abortions. The client does. They provide health care. Get your facts right.","post_message":"JUST IN: A Houston grand jury investigating undercover footage of Planned Parenthood found no wrongdoing by the abortion provider but instead indicted anti-abortion activists involved in making the videos that provoked outrage among Republican leaders nationwide."}]
