[{"comment_id":"10153742314476336","commenter_b":"The woman sounds like a idiot.","commenter_a":"How can they say women's clothes?? I though we didn't have gender clothing anymore??","post_message":"Do you think this mom went too far?"},{"comment_id":"10154965744184641","commenter_b":"I would agree that would be a good reason to March however that March said absolutely nothing about this. As a matter of fact the lady running the March believes in Sharia law and in her belief system this is perfectly acceptable","commenter_a":"This why we march. This is not acceptable for ANY culture.","post_message":"When she was 12, she was sold into \"marriage\" with a 70-year-old man -- and there are hundreds like her."},{"comment_id":"10153220883066491","commenter_b":"Unnecessary! Girls that are having their period don't play with barbies","commenter_a":"LOL - that is just rich.","post_message":"“It’s just what happens in real life.”"},{"comment_id":"10152623544456680","commenter_b":"Yes, I want our economy ran into the ground by having a college drop-out as our president. Said no one. Ever.","commenter_a":"I would rather see him run than Walker! I'm scared of Walker. After what he's done in WI, our economy would be in shambles after one year under him. @webpagelink","post_message":"Jeb Bush isn’t playing well among Republicans, Peggy Noonan writes in a new Wall Street Journal op-ed."},{"comment_id":"10153247148866130","commenter_b":"I am educated and that's my opinion and I stand by it !!!!","commenter_a":"I don't believe in post pardum depression !!! I believe it's women loosing their precious freedom and freaking out about it !!! That's why there are a limited amount of cases!!!!!!","post_message":"New research could allow women to get help before they even give birth"},{"comment_id":"10152882725317807","commenter_b":"More trolling stupidity. Shuster, you are pitiful.","commenter_a":"Does this give you pause @username??????@webpagelink","post_message":"It’s tax day, but the American people certainly don’t need another reminder that the federal government is taking too much of their money.    In what ways do you believe government is over taxing you?"},{"comment_id":"774995235932418","commenter_b":"^Oh Lord, the grammar/spelling in that last response. Anyway,saw photos, she's white but husband and kids arent, for those who care one way or another.","commenter_a":"Why doesn't the headline read white officer killed by a person of color?","post_message":"A very sad story."}]
