[{"comment_id":"1548781162079004","commenter_b":"Found the stupid feminist.","commenter_a":"if U want to End ALL Abortions, eliminate the NEED for abortions!! STOP RAPE First!!!","post_message":"Flip the Script is back!  We asked pro-lifers why they think abortion is murder  and then they sorta threatened to kill us."},{"comment_id":"496037443910043","commenter_b":"MR TRUMP WHEN YOU BECOME PREZ> HANG A FEW DRUG DEALERS ON COURT SQUARE THEN THEY WOULD THINK TWICE ABOUT SELLING DRUGS TO YOUNG CHILDREN AND DESTROYING ENTIRE FAMILIES!!!!!!!!","commenter_a":"Get them out!!!!!!!!!!!!!!","post_message":"Drug dealers are pouring in from the southern border. We will build a wall on time and on budget. #GOPDebate"},{"comment_id":"10154744279541323","commenter_b":"ooh, you bitch you. i wouldn't invite you to your own funeral","commenter_a":"Hillary looked like she could use a shower and some crayons when she slithered out from under her rock last night.","post_message":"\"None are without controversy.\""},{"comment_id":"10153602906656509","commenter_b":"You can buy them too.","commenter_a":"I think she means she wants to make a lot of money. Those GEDs aren't cheap.","post_message":"Is America ready for #marijuana moguls? Follow one young couple's journey as they attempt to franchise legal marijuana  @webpagelink #HighProfits"},{"comment_id":"10154009646005695","commenter_b":"Add this to the list of reasons why #ChikFilA is so awesome","commenter_a":"That's bc CFL is a Christian company....no PB sandwiches....love it, gives u hope nation has not completely brought into 'crap on everybody while I make my millions' type of company.","post_message":"AWESOME! Volunteers delivered free sandwiches to first responders and victims of the storms."},{"comment_id":"10152742608351491","commenter_b":"I am amazed at how many women are so poorly informed on the issue and then let the world know how little they know. Amin wage woman does not have access to a mike and thankfully Patricia did and took advantage of it.","commenter_a":"Says a women riding home in a limo! Political rant to get attention. She is a actress","post_message":"“It’s our time to have wage equality once and for all and equal rights for women in the United States of America.”"},{"comment_id":"931654693541670","commenter_b":"It's not just barbaric, it is one more tool of the rich used to keep the not-rich \"in their place\".","commenter_a":"I guess when you have universal medical coverage you don't realize what a nightmare our system is.","post_message":"The headline really begs the question, who the hell would ever want to visit the United States knowing they could be bankrupted if they should need medical care while they are here?/"}]
