[{"comment_id":"10153358491932217","commenter_b":"where were these anti-facists when Women were attacked in Cologne","commenter_a":"Natalie","post_message":"Bricks were thrown as far-right & anti-racism protesters clashed in Dover."},{"comment_id":"10153043089801519","commenter_b":"Right? Because...ick.","commenter_a":"#dontbethatguy","post_message":"\"He then sent me five nude photos of him lying in bed, his penis prominently displayed...\""},{"comment_id":"10153242127461680","commenter_b":"Divided Nation? You people talk about a divided Nation? Kids are being harrassed at school for \"appearing\" to be Muslim, some are Indians. Muslim's are of every nationality and not just middle eastern. Donald Trump has created HATE amongst people of a brown tone. That's more than 3/4 of the Nation. You people are scum that support Trump. American Mexican's are being mis-treated too. I guarantee you that Donald Trump will turn this country 3rd world with his talk of our \"wages are too high\" and \"we must COMPETE with wages of Mexico, Japan and China\". YES, he is a 'business man\" and that's why HE sent his own manufacturing jobs out of the U.S. Think, people, think.","commenter_a":"I find it hilarious when Obama is blamed by Republicans for everything under the sun, but now he's being blamed for helping create Donald Trump. That's a stretch, even by Jeb Bush standards. This country has had a bitter partisan divide ever since Republicans decided they weren't going to allow a Democrat to be successful way back in 1992.","post_message":"Not only is Donald Trump a “jerk” in the eyes of Republican presidential candidate Jeb Bush, but he’s also “a creature of Barack Obama.”"},{"comment_id":"10155032769051757","commenter_b":"Great","commenter_a":"Excellent! I hope to see you do many more of Fox's interviews with President Trump. You deserve it. Thank you for always reporting the truth when others didn't.","post_message":"Question of the Day: What did you think of my interview with President Donald J. Trump?"},{"comment_id":"973903779296042","commenter_b":"One of the stories the parents were arrested because they did it:( it wasn't an accident.","commenter_a":"I really enjoy reading all the comments by individuals who apparently parent in the most perfect way. (*said sarcastically*) It is so easy to judge someone else, heaven forbid some terrible accident happens on your watch and you have complete strangers calling for your head. In any case, my heart breaks for this family and the loss of their child.","post_message":"#BREAKING A 2-year-old has died after falling into an unsecured septic well near Burlington. >> kiro.tv/SepticWell  Henry Rosoff is heading to the area to learn more on this heartbreaking story."},{"comment_id":"10158044055455391","commenter_b":"@username Obama has dumped over 10,000 mostly Muslim Somalis in Minnesota, Tennessee, and other States. A Somali-born student at Ohio State University injured 11 people, one of them critically, when he attacked a crowd of pedestrians on campus in an incident one lawmaker said \"bears all the hallmarks of a terror attack.\" Authorities said Abdul Razak Ali Artan, 18, plowed a small gray Honda into the crowd outside Watts HalI, then jumped out and attacked with a butcher knife. Authorities believe he was inspired by ISIS. The latest from America’s immigrant sex crime epidemic. One refugee, Mohamed Dirshe, raped two boys at a Kansas Catholic high school, after Catholic charities gave him a home and a job there while entrusting him with their youth. In Minnesota, authorities charged Somali born Ahmed Hersi Abdi with two degrees of first-degree sexual misconduct for allegedly raping a 10-year-old girl in her apartment. According ...","commenter_a":"The United States of America should have the right to protect itself from those people who would do it harm it's not about religion or race it's about keeping very bad people out of this country","post_message":"Federal Court Rules Against Reinstating Travel Ban  Your reaction?"},{"comment_id":"10154601814298812","commenter_b":"Beaver girl you are the lowest BS, send you to middle east good luck, Israel girls know how to fight, and the Frenchie girls know how to fight, you know like the French under ground","commenter_a":"Maybe they could present plans to \"Make America Great/Safe/White/America again\" Instead of hosting the \"We hate Hillary\" show. They really do just pander do the lowest common denominator.","post_message":"So far, speakers have mentioned Hillary Clinton an average of just over six times in evening speeches at the GOP Convention."}]
