[{"comment_id":"10152624556380667","commenter_b":"He was a true man in every word about iranian government. Thanks Mr President","commenter_a":"America gives you billions, trillions over time and when you include weapons, Iron dome, etc and America does it while American children and American poor struggle and as America infrastructure crumbles, really?????","post_message":"Israeli Prime Minister Benjamin Netanyahu pleaded with Congress  on Tuesday to take a harder line against Iran, saying the nuclear deal being negotiated \"doesn't block Iran's path to the bomb; it paves Iran's path to the bomb.\""},{"comment_id":"10155481461845405","commenter_b":"And I mean prosecute the farmers not the illegal immigrants. You can't blame them for coming here and getting a job . My point is Republicans won't deal with the issue in a responsible manner.","commenter_a":"And they vote Republican and employ the largest number of illegal immigrants and get away with it. The one that do should be prosecuted for it .","post_message":"Did you know that 97% of Wisconsin farms are family-owned? Wisconsin agriculture also employs 413,500 employees and that's 12% of the workforce."},{"comment_id":"1181580438601675","commenter_b":"That's not true but i'm glad she got away with it,I can't wait till she starts debating Trump.","commenter_a":"Not","post_message":"True story..."},{"comment_id":"10154257550106491","commenter_b":"Beyonce is racist scum","commenter_a":"Fuching nightmare.","post_message":"It's the ultimate playdate."},{"comment_id":"1521502694809851","commenter_b":"And once again we don't riot , block busy streets and and make up bullshit like a certain group of people--- absolutely this is murder and a hate crime!!","commenter_a":"absolutely","post_message":"A black man in Baltimore poured gasoline on two white men, and there is nothing on the news.  No riots, no protests, no media coverage.   Do you think he should be charged with a hate crime?"},{"comment_id":"1361368557222876","commenter_b":"Toni, I never commented previously so I don't know what your delusion of reality is. Trump never banned all Muslims. My buddy Wayne Allen is very capable of comprehending what the fuck Trump said. He isn't an intellectually lacking derelict who has lost his way and found himself sucking Democratic titty. What Trump stated is that he would implement a vetting procedure to insure ISIS doesn't send men in with the hundred thousand other young refugees this piece of shit Democratic government is wanting to allow in. I fight for the people, brotha. Not the government. I protect this land we walk on from those who wish to impose radicalism here. Those people are our government. I am the mother fucker that will bleed on my home soil, for the real interest of our nation, not individual interests. As far as Native Americans suffering from our conquering; yeah, well, that's ...","commenter_a":"You people are the most ignorant people around. Your even more so then the Trump idiots. Leave these people alone. You should be more afraid of your neighbors. More Americans kill Americans then Muslims do. Watch the news.","post_message":"More than 20 people were stung by a swarm of bees outside a mosque in Phoenix, Arizona."},{"comment_id":"10153969418599575","commenter_b":"Mike Carter was it ever great? Living on credit was the way to create happiness, no one is talking about the pitfalls!","commenter_a":"None of the other Candidates are even mentioning Veterans! They have already had 6 Debates. I am going to watch the other channel and vote for Trump!","post_message":"Donald Trump is going to skip Thursday's GOP debate.   “We’ll have an event here in Iowa, with potentially another network, to raise money for wounded warriors,” he said. “And Fox will go from probably having 24 million viewers to about 2 million.”"}]
