[{"comment_id":"584218068426739","commenter_b":"For sure playing the women card. Wouldnt have 5% of the vote without a vagina. Whos voting for vagina????","commenter_a":"Are you going to play the women card for the rest of the election? it's getting really old really quick....","post_message":"Like a boss."},{"comment_id":"10154511519316337","commenter_b":"So you're mad cause you're a poor bitch?","commenter_a":"They didn't add he is sitting on a seat worth about $10,000 every on of his jet/ helicopter has gold leaf in on it and don't won't to get it dirty","post_message":"Donald J. Trump tried to be an everyman... on his private jet."},{"comment_id":"1672517186342699","commenter_b":"Kiss my white ass.I don't owe you anything","commenter_a":"White lives matter","post_message":"“...white folks actually gotta give up something. You have to actually sacrifice yourself. You have to be willing to give up the things that you currently benefit from.”"},{"comment_id":"1064358433623633","commenter_b":"TRUMP GO back TO Hell","commenter_a":"Can these idiots be any more reprehensible?! The Repugs care only about the top 1%.","post_message":"The right's hostility toward the working poor is now front and center."},{"comment_id":"10153948812912434","commenter_b":"@username you are a AntiWhite and you are for White Genocide that is why you call me a Nazi. ALL White countries and ONLY White countries are being flooded with third-world non-whites, and Whites are forced by law to integrate with them so as to “assimilate,” i.e. intermarry and be blended out of existence. Massive immigration and forced assimilation is genocide when it’s done to Tibetans in Tibet. When it’s done to Whites in White countries, it’s called “diversity.” By UN Convention, it’s genocide: “Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part.” Diversity is a code word for #WhiteGenocide!","commenter_a":"White genocide is real and we can prove it. Learn the truth. @webpagelink","post_message":"The threat of ‘white genocide’ is a conspiracy theory, promoted by elements of the so-called alt-right and fueled by anxiety over fertility and immigration trends, that was popularized by South Carolina segregationist Bob Whitaker. The idea also comes up in the writings of Dylann Roof, who murdered nine black parishioners at a church in Charleston."},{"comment_id":"10153796714106636","commenter_b":"Lady please..take a seat!!","commenter_a":"Obama has destroyed this country and race relations in US","post_message":"\"Black men dying and being forgotten. People retaliating against the people that are sworn to defend us. We have to come together and end all of this.\""},{"comment_id":"863625973741296","commenter_b":"Absolutely. ...praying for him and his family","commenter_a":"Allready did","post_message":"Kentucky Police Officer Shot Down In Cold Blood, Killer Still On The Loose The media is silent, no Al Sharpton, no Obama, nothing. Will you pray for him and his family?"}]
