[{"comment_id":"10159170889790206","commenter_b":"Oh he will make it 8. So grow up big sissy babies.","commenter_a":"Good. He's embarrassing enough here. We don't need him going abroad and doing his clown act live for the rest of the world.","post_message":"JUST IN:"},{"comment_id":"10153203209001336","commenter_b":"THANK GOD THERE ARE MOTHERS LIKE HER I WOULD DO THE SAME THING IF IT WAS MY KID!!","commenter_a":"Lets hope she isn't accused of child abuse!","post_message":"VIDEO: A woman is seen beating a rioter in Baltimore. It turns out he is her son."},{"comment_id":"10153770178735736","commenter_b":"Hillary is Hillary, not Bill. Duh!","commenter_a":"She should resign.","post_message":" Trump comments in 2005  11 years ago were made when he was a Democrat. The hypocrisy of Hillary Clinton to say Trump does not belong in the White House when her husband defined this behavior."},{"comment_id":"10152603189787894","commenter_b":"She's Just NASTY & wants White people to think it's a Race thing","commenter_a":"Nasty bitch","post_message":"Say What Now? Naya Rivera Insists White People Shower More Than 'Ethnics' on 'The View' [Video]"},{"comment_id":"10153355392014087","commenter_b":"Frank, public services are for the good of the whole. Socialism is when you have a garden with beautiful tomatoes and I, being too lazy to grow a garden, get my share of your tomatoes. Not because I deserve them, because the government said you have to give them. How ling do you think you will continue to grow that garden to feed my lazy butt? Socialism fails because the workers quit working also because there is no reward to their labor. The workers will become the lazy also and there will be no tomatoes. Figured I had better break it down to kindergarten level for you.","commenter_a":"If you support sanders, go live in Cuba. Democratic socialism there already.","post_message":"Bernie Sanders is increasing the size of his campaign staff and boosting state budgets, according to a new report."},{"comment_id":"10153469864552144","commenter_b":"Damn illegal immigrants voting illegally!","commenter_a":"His mother is on the voting rolls in Canada in 1974. You cannot have dual citizenship and vote in Canada. The question becomes, when did she renounce her American citizenship to vote in Canada? Or did she vote illegally?","post_message":"Hahahaha."},{"comment_id":"958150317529772","commenter_b":"The NCAA brass is a bunch of hypocrites.","commenter_a":"Oh Please this is 2015 people move on, get out of the dark ages.","post_message":"Recreational marijuana use is legal in Oregon"}]
