[{"comment_id":"10153294684803132","commenter_b":"This witch is EVIL!","commenter_a":"She should be charged with murder.","post_message":"\"When he actually started to carry out the act, he got scared again and exited his truck, but instead of telling him to stay out of the truck ... Carter told him to 'get back in.'\""},{"comment_id":"10157399464465093","commenter_b":"A hun will never kill anyone! Its the people that use them! People kill people! Criminals get them illegally and you can't stop that! It is not possible! Give me a reason why you think criminals should only have guns?","commenter_a":"Yes but 100% of gun crimes involve guns, so start with the legal gun owners because it's way easier, and it looks like we're doing something.","post_message":"Pass it on."},{"comment_id":"10153695152617507","commenter_b":"No difference, Bullshit, it is the same as endorsing him, even worse, it is a cowardly way of endorsement.","commenter_a":"He didn't endorse Trump, he just doesn't care if they play his music, big difference","post_message":"Wait. What?"},{"comment_id":"972848449477340","commenter_b":"@username YOUR PARENTS MADE A BAD DECISION WHEN THEY CONCEIVED YOU...YOU ASSHOLE!!!!","commenter_a":"Does anyone really think Hillary Clinton is presidential material or qualified to be president of the United States? Think about that for a sec. She's made bad decisions and poor choices all of her life. From whitewater to Benghazi. She's incompetent to say the least and can't be trusted in her decision making abilities. She's been fired for being unethical or ethics violations and just recently had national security issues with her email. Not to mention being a lying ass crook. Presidential? Not hardly!","post_message":"Early polls show Hillary Clinton would handily beat both Trump and Cruz in a general election. Are you hoping to see Clinton become America's next president?"},{"comment_id":"1349633901749900","commenter_b":"@username, real women protect their babies, not kill them","commenter_a":"Any \"man\" who wants to try to control what women do with their body is a worthless piece of feces and they will be treated as such.","post_message":"The gift of life must be protected from the slaughter!  Click here to sign your petition in support of the Life at Conception Act!  @webpagelink"},{"comment_id":"10153396408061130","commenter_b":"Why are these men so obsessed with a uterus? I mean I've never obsessed over a prostate...what is going on?","commenter_a":"The same thing happened to Joe McCarthy. Everyone was all for outing Communists, then they watched him bully people at hearings on the TV and realized what a witch hunt it was.","post_message":"\"This hearing is why everyone hates Washington, D.C.\""},{"comment_id":"10154761177058812","commenter_b":"She's a lying sick woman","commenter_a":"Amazing how you say you are happy to answer questions about the Clinton Foundation, but you NEVER DO! You have done more dirty deeds in your lifetime than one person can imagine. I love how you are like a child. You get called out for your own wrongdoings ( and then tell the FBI you have a concussion and cannot remember anything.. BS) so to take off the heat you try to point fingers at the other guy. If you win, American deserves what they get.","post_message":"In an exclusive interview with ABC News David Muir, Hillary Clinton calls for scrutiny of \"questionable\" Trump Foundation dealings in light of IRS fine: abcn.ws/2c4YKqd"}]
