[{"comment_id":"10153160382606491","commenter_b":"Lauren Kirby","commenter_a":"1577961212219543s","post_message":"\"Amy and I were creatively made for each other,\" Jennifer Lawrence said."},{"comment_id":"10152949187346130","commenter_b":"Heheheh I don't need a beard to attract women and prove dominance. It's all in confidence and your attitude. You want dominance? Push me far enough and you'll find out your place real quick! ;)","commenter_a":"lol","post_message":"It's just evolution."},{"comment_id":"957822790936024","commenter_b":"Let's get all them bitches","commenter_a":"👌👍👊","post_message":"Human excrement gets flushed! Australia's most wanted ISIS terrorists just got smoked in Iraq. ~Will"},{"comment_id":"10153888153653352","commenter_b":"You said it all...Thank you!","commenter_a":"I feel she should have been fired.... possibly fined. Holding her in jail until she changes her mind is a waste of tax dollars and time.... yes this woman stood up for what she believed but she still had a job to do .... not only did she refuse to issue same sex marriage license but she didn't allow the people under her who were willing to issue them either.... that is wrong..... this woman used her title and athority and held an entire government staff to her religious beliefs ... she didn't have to issue them she could have let someone else do that and still be faithful to God's law.... this country was built on freedom of religion. That means no law can be withheld or upheld based on religious beliefs.... she made an oath to follow the laws of the US , as soon as the laws ...","post_message":"Defiant Court Clerk, Kim Davis, Will Be Held In Jail Until She Agrees To Issue Same-Sex Marriage Licenses!   CHRISTIANS WHAT IS YOUR REACTION?"},{"comment_id":"10153288827596523","commenter_b":"@username her momma should have taught her manners, and respect, you might consider doing the same.","commenter_a":"That poor little girl just learned she can cause problems, then ignore her teacher and the school administrator and the police. She really learned a lesson, didn't she?","post_message":"The South Carolina deputy who slammed a disruptive student on the floor and tossed her several feet has been fired."},{"comment_id":"10156449945205354","commenter_b":"NOOOOOO! Stay there!","commenter_a":"Haha nah Texas is is good on that","post_message":"Obama's Hero, Ahmed \"Clock Boy\" Mohamed, Now Misses Texas!  “I want to go back to a place where everyone knows me.”"},{"comment_id":"1087993101236110","commenter_b":"Obummer is a trader to America. He is full of lies and bullshit.","commenter_a":"He's still trying to destroy America","post_message":"**BREAKING NEWS**  What the HELL!?!?"}]
