[{"comment_id":"10153235652851519","commenter_b":"He has a brain?","commenter_a":"Trump's hair is getting into his brain, not Mansanto.","post_message":"Very presidential..."},{"comment_id":"1205517149514372","commenter_b":"Go away, Racist, Tax Evader, Liar, Sharkton! No more White House Visits! Hopefully Sharkton and Hillary share the Big House soon!","commenter_a":"Loser!","post_message":"Rev. Al Sharpton warned that \"all that many of us have fought for all our lives is at stake\" following Donald Trump's victory in the presidential election and vowed that \"we are not going down without a fight and Donald Trump needs to know that.\""},{"comment_id":"10153640013936636","commenter_b":"O questo o un procione non voglio altro siamo io e te li vedi li vedi Dio pinolo?!","commenter_a":"Luca sparati in bocca con me","post_message":"Red pandas have an adorable wrestling competition  Via Detroit Zoo"},{"comment_id":"10154767711621729","commenter_b":"There is a possibility that he wont be Trumps VP ,....because he is considering the VP job with Hilary....just saying","commenter_a":"don't wanthe little bitch","post_message":"Never say never?"},{"comment_id":"10154985622284687","commenter_b":"She schould blame her father for this","commenter_a":"Brilliant ! Will do","post_message":" is just  it's a wonderful line. I own some of it. I fully  I'm going to give a free commercial here. Go buy it today, everybody. You can find it online."},{"comment_id":"10153554565881615","commenter_b":"... Murder is obviously horrible... But I would like to expand capital punishment beyond that... To a crime I put equal to murder... Child molestation ... Or child RAPE. Unthinkable. Monsters like that should be eliminated as well.","commenter_a":"Will waste even more money to keep him in our prison system or on \"death row\" ... Please use capital punishment in cases like this and actually FOLLOW THROUGH WITH IT!","post_message":"BREAKING: Allen Wade has been found guilty on all counts in the murders of Susan and Sarah Wolfe, who were killed in their East Liberty home more than two years ago."},{"comment_id":"10154734900826509","commenter_b":"U know muslims r gangraping british girls in UK","commenter_a":"RIP europe, immigrants will destroy europe, it has started from turkey , so i request all people to visit europe before it gets turn into europistan , after there would be many restrictions of burqua etc. And be ready to see ETHNIC EUROPEAN MIGRANTS LEAVING EUROPE FOR ELESWHERE.","post_message":"Terror suspect Salah Abdeslam has been extradited from Belgium to France, Belgian authorities say. The Belgium-born French citizen faces prosecution there in relation to the Paris terror attacks in November."}]
