[{"comment_id":"1072525059447912","commenter_b":"Well actually Tara bring em all to your house ok AMERICA FOR AMERICANS !","commenter_a":"Correct me if I'm wrong but majority is suppose to rule in AMERICA and you only have 4 States that want these people and 20 that don't keep them the F out of America !!! AMERICA FOR AMERICANS !!!","post_message":"\"There is absolutely no constitutional power for a state to exclude anyone from its territories,\" said one legal scholar."},{"comment_id":"1785088471737718","commenter_b":"LOCK HER UP!","commenter_a":"TRUMP NUMBER ONE ALWAYS PRESIDENT TRUMP 2016","post_message":"Thank you OHIO! I am in this to win it - we are going to MAKE AMERICA SAFE AND GREAT AGAIN! Off to Ohio now! -DJT"},{"comment_id":"10154138263431323","commenter_b":"It's about what you want to do. Maybe a younger person follows what is 'the done thing' but with age and life experience, I think women just do what they want!","commenter_a":"It's just like the shaved pubes issue - all the same arguments. 'I do it for myself' etc etc. Look, virtually no young women shaved their pubes before porn videos made men expect it. And virtually no older women dyed their hair before looking our age became unacceptable. I've had enough of all this 'I do it for me' nonsense - look a bit deeper for god's sake and let's be a bit more honest about our motives and the forces that drive us.","post_message":"“We’ve been groomed – by the media, by advertisers, and now by ourselves – to understand that our gender has to try harder, to consume more, when it comes to our appearance. We’ve been taught to fear growing old.”"},{"comment_id":"10153030361596636","commenter_b":"y'all feminists need some patriarchy","commenter_a":"Well when it comes to equality between the sexes I can easily say that Sweden is equally retarded and out of touch as Saudi Arabia in regards to the rights of women in society. This whole feminism movement has gone totally out of control here in Sweden and become something like the Catholic church.","post_message":"Maybe it's time we did the same?"},{"comment_id":"449908955134145","commenter_b":"Can't answer the question, Joey?","commenter_a":"This is absolute overkill. I get we should police the police but come on. You're going out of your way to stop an officer from doing his job","post_message":"This baby faced cop looks fresh out of the academy and willing to follow any order he is given. Luckily this veteran government accountability activist planted some seeds in his mind about who he is actually working for and how liberty is a better solution.  Watch the epic schooling RANT: @webpagelink"},{"comment_id":"10152839812269753","commenter_b":"It's the POLIC WHO ARE PAID TO USE EXTRA FORCE (excessive force). It's not the job of employees, unless it's a security guard. They can RESTRAIN A PERSON UNTIL THE POLICE GET THERE.","commenter_a":"no she deserves it","post_message":"Even though she was able to successfully open the driver’s door of her getaway car, the man did not allow her to get much farther than that. He grabbed the shoplifting woman as she opened the door, turned her on her back and slammed her on the ground seconds later.  You think he used excessive force?"},{"comment_id":"1867582453468544","commenter_b":"Stupid bitch","commenter_a":"you make it like i did , hard work bitch , no hand outs","post_message":"One of the co-founders of Black Lives Matter just said that \"white folks\" need to \"sacrifice\" THIS for her movement... this is an outrage.  America needs to know the goals of this movement... they're not going to like this."}]
