[{"comment_id":"1785088471737718","commenter_b":"LOCK HER UP!","commenter_a":"TRUMP NUMBER ONE ALWAYS PRESIDENT TRUMP 2016","post_message":"Thank you OHIO! I am in this to win it - we are going to MAKE AMERICA SAFE AND GREAT AGAIN! Off to Ohio now! -DJT"},{"comment_id":"677415119050364","commenter_b":"Yes....","commenter_a":"yes","post_message":"Take the poll!"},{"comment_id":"10154133413586350","commenter_b":"Not cow milk. We are the only species who drinks another animals milk. You've been sold to drink milk because it gives you calcium but it does the complete opposite. It's all about $$$ Do your research, people! Cow's milk is not good for us.","commenter_a":"My siblings and I were fed carnation milk from a can and then whole raw milk from the bulk tank in the barn We're are all healthy and allergic to nothing.","post_message":"Is nonfat, low-fat, reduced-fat or whole milk best for your children?"},{"comment_id":"10153528994604641","commenter_b":"What's up with her fingers?!!!","commenter_a":"Karolynn Cevidanes","post_message":"Taiwan puts porn star on metro cards. They sell out."},{"comment_id":"1315269151829205","commenter_b":"Somebody need to give this Scum, a History lesson !","commenter_a":"This idiot is truly deranged.","post_message":"White nationalist Richard Spencer held a conference in support of Donald J. Trump and claimed that America belongs to white men.   1,000 protesters met him outside."},{"comment_id":"10153533558288984","commenter_b":"EXCELLENT!!!!!!!!","commenter_a":"Yes, Christians need to stand together. The Supreme Court opened the door to more then gay's rights.","post_message":"Black pastors just made a drastic announcement about gay marriage... and they're refusing to back down.  This shows just how far they're willing to go to stand for their beliefs... spread this everywhere if you support them."},{"comment_id":"1563584047268472","commenter_b":"Our society does not need assault weapons!!!The politicians have blood on their hands, because of their inaction when it comes to the NRA!!!!","commenter_a":"President Obama tried to enforce stricter gun regulations but Congress voted against it. They voted for individuals on the terror watch list to keep rights to own assault weapons and now they're blaming Isis. How convenient.","post_message":"This is infuriating.  Image by Occupy Democrats, like our page for more."}]
