[{"comment_id":"736103763189471","commenter_b":"I hope the police are called for every item he, or anyone else, takes to school that appears to be an explosive device of any sort. Truly Americans can't be this ignorant. Oh, wait! We are! Obama is president and was not only elected once, but twice! For those that truly believe in tolerance and are willing to allow Islam to infiltrate our country, just wait and see how tolerant they are of you, your children, and your children's children when they become the majority. Remember this, Obama is moving in thousands of \"refugees: next year and the current Muslim population is already having children at a much higher rate than the average American family. SURPRISE!!!!!","commenter_a":"No, comments.","post_message":"Of COURSE."},{"comment_id":"10153884646907183","commenter_b":"Why you picking on us white folk here in Georgia? Keep that bitch far away from us!","commenter_a":"Katrina Pierson should be in Milwaukee or Georgia. The media is paid to review everything Trump said and to soil it. They don't care about the real news, another cop assassinated through race- baiting rhetoric from Obama and HRC. Milwaukee is rioting. The streets of Chicago are still killing fields. Clinton is racketeering money through the foundation in pay for play schemes. Yet Ms Pierson has only one thing to do on this Sunday. Find dirt on what Trump said and exploit it. Is this the kind of values we should accept from these UnAmerican sewer-valued people?","post_message":"Did you ever hear of a \"novelty tradition\" in politics?"},{"comment_id":"10154141723616509","commenter_b":"Just name a hotter chick","commenter_a":"Y'all tripping like Beyonce doesn't exist or something. Emilia is fine but sexiest woman alive?","post_message":"Who would you have picked? The Game of Thrones actress has been named  Esquire's \"Sexiest Woman Alive.\" @webpagelink"},{"comment_id":"1066102216758740","commenter_b":"DON\"T choose Hillary!! Jump aboard the TRUMP TRAIN 2016! He will work for America!!!","commenter_a":"Why should we choose Hillary ???? Bill didn't he choose every other women BUT Hillary","post_message":"\"She's a natural leader, she's a good organizer, and she's the best darn change-maker I ever met in my entire life.\"  President Bill Clinton said Hillary Clinton is \"worth every single year she's put into making people's lives better.\""},{"comment_id":"1737893789788061","commenter_b":"HE LIST THEM ALL WITH NAFTA AND BANK DEREGULATION TRY AND LEARN TRUE HISTORY.","commenter_a":"he has a great track record on creating jobs, just not in the USA","post_message":"Hillary Clinton is making plans for the future."},{"comment_id":"10153122884761130","commenter_b":"This article suggests I'll never find a smart woman to have kids with. That's disheartening","commenter_a":"Hmmmm.....","post_message":"As if being a woman is just about having kids."},{"comment_id":"10153656490006107","commenter_b":"Mrs. Paul rocks!!!! Ron put down that economics book and take Carol to dinner!!!","commenter_a":"This election cycle by far has been the craziest one I've ever witnessed. The one question I can't seem to get an answer to is this,,, WHY??? Why are both sides attacking Trump? Why is China attacking Trump, Why is the pope attacking Trump? Why is Mexico attacking Trump? Why are the Republicans going against their own pledge and attacking their own front runner? Why is HilLIARy so afraid of Trump? Why does Trump have this Republican Party split? Why is Mitt Romney going after Trump? Why are the Koch brothers dumping in 75 million dollars to go against Trump? This isn't normal, something doesn't add up and we need to be smart enough to see through the the smoke and mirrors why they are quickly exposing themselves as the try to take down Trump before #SuperTuesday Here's my theory, it goes back to the age old question how to ...","post_message":"Happy Birthday to Carol Paul, an amazing woman, mother, and advocate for liberty. Thanks for making me the man I am today, Mom. Happy Birthday."}]
