[{"comment_id":"450316191825628","commenter_b":"Fuck that dumb bitch!!!!!!!!","commenter_a":"bye bye Michelle, go peddle crazy some place else. Go ask the thugs in Chicago for their guns first. Try going there without a cop. LOL","post_message":"Will You Refuse To Turn Over Your 2nd Amendment Rights To Michelle?  Comment 'yes' or 'no'."},{"comment_id":"1048332608520428","commenter_b":"Lmao Persian women though.. Gorgeous.","commenter_a":"You are free to choose between Arab uneducated fundamental extremists and moderate enlightened Persian Cats..","post_message":"Iranian Foreign Minister Mohammad Javad Zarif said on Wednesday a new U.S. law putting visa restrictions on Iranians and those who had visited Iran would, if implemented, breach a nuclear deal Tehran had struck with world powers earlier this year. Read more: @webpagelink"},{"comment_id":"10152878429492690","commenter_b":"Pothead thinking= had she been toking a doobie she would have been mellowed and not been on the pump jack. But then her parent or adult supervision may have been smoking one and thought it was funny.","commenter_a":"Hemp > crude","post_message":"Authorities say an 11-year-old Texas girl has died after falling from an oil field pump jack over the weekend. @webpagelink"},{"comment_id":"1072715589511885","commenter_b":"I would call him much worse than a monkey.","commenter_a":"That's insulting to monkeys the world over!!! Ann PLEASE think before bad mouthing the monkeys...","post_message":"VIDEO: Ann Coulter Just Created A HUGE Firestorm, Outrage after Calling Obama A  On National TV Ann Coulter is under attack over this.  Can we get 5,000 'LIKES' for Ann Coulter?  @webpagelink"},{"comment_id":"10153246796329607","commenter_b":"Stop them now!!!","commenter_a":"Yes","post_message":"QUESTION OF THE DAY:   Should the U.S. stop accepting Syrian refugees? #FOX45QOD"},{"comment_id":"1783677398519787","commenter_b":"@username TRUMP IS OUR NEXT PRESIDENT.GET OVER IT.","commenter_a":"I am really not a trump fan.. But if his election gets rid of half the asshats that say they will leave he's got my vote","post_message":"She's out."},{"comment_id":"10153549006508984","commenter_b":"Never mind i remember now ......she made one bad porn with that BIG A!!","commenter_a":"I side with Meg Kelly. Kim's a dumb fat ass bitch!","post_message":"Look out, Kim Kardashian. I don't think you realize who you're messing with...  Do you side with Megyn Kelly on this one?"}]
