[{"comment_id":"1028231380578058","commenter_b":"Tha bitch!!","commenter_a":"WHAT DOES SHE OWE THEM IN RETURN...THINK ABOUT IT. WHY WOULD THEY GIVE MONEY","post_message":"Americas Freedom Fighters"},{"comment_id":"10154023438494486","commenter_b":"WHERE IS HILLARY? SHE SHOULD BE THERE, SHE WOULD HAVE GIVE HIM A BIG HUG OR A BIG KISS.....LMAO","commenter_a":"I don't think Obama was trying to shake his hand. it was almost like he tried to put his arm around Castro's shoulder and Castro stopped him or something. It was weird.","post_message":"Be careful! That's his THROWING ARM"},{"comment_id":"10153918946326162","commenter_b":"Calling a 15 year old young lady a hoe Definitely shows your maturity level.","commenter_a":"Dear 15yr old girl, you put yourself in that position. Those are the risks of taking nude pics. SUCK IT UP, HOE.","post_message":"EXCLUSIVE: A Bolingbrook High School student says nude pics of her were posted online as retaliation for fight. @webpagelink"},{"comment_id":"10153083234283837","commenter_b":"What does sleeping have to do with a woman running over someone with her car?","commenter_a":"Thus is why elderly should not be sleeping","post_message":"APPALLING ACCIDENT - An elderly woman accidentally ran over a man, believed to be her husband, in the driveway of their Fort Lauderdale home."},{"comment_id":"10153542533598352","commenter_b":"Wtf.....it's not like her f ing nipple is sowing or something.....how about telling the girl who come with the dress so short they can't bend down to pick up something.....how about telling the girl with their clothes so tight they can't breathe.....sweetheart enjoy your time screw them.....if they still messing with you just let hulk out and tare the place apart....well I would....I can't have fun no body having fun","commenter_a":"That's messed up they just trying to find things wrong","post_message":"Mother slams school officials who insisted her daughter's floor-length, long-sleeved prom dress was 'too revealing', claiming they 'targeted' her because she is 'plus-size'"},{"comment_id":"10152920261777014","commenter_b":"White people belong in Arizona, unlawful criminals do not.","commenter_a":"Sheriff Joe is TRYING to do the job he was elected to do. The Feds do not like it !!!!","post_message":"YAY or NAY: Do you approve of the job that Sheriff Joe is doing?"},{"comment_id":"590770071125294","commenter_b":"Now if these douche bags will leave they know where their bread is buttered.","commenter_a":"They have money! They can easily move wherever they want, away from old bigot Trump and his supporters.","post_message":"Remember the celebrities who said they would leave the country if Donald J. Trump was elected president... @webpagelink"}]
