[{"comment_id":"10155086902812235","commenter_b":"UK agrees Americans you created this problem now fix it Europe do not want a war","commenter_a":"How much longer are the American people, the ones who didn't vote this idiot in, going to let this go on, this ego maniac is ruining your beloved country, it is the laughing stock of the world thanks to him, how can any government anywhere take this moron seriously and trust him with anything, he lies through his teeth, blames everyone else for whatever is going on, it has only been 4 weeks and look at the state of things ! My thoughts are with the American people who didn't vote for this buffoon, i hope your country can get rid quick and recover from his dreadful influence !","post_message":"\"I was hoping you could tell me what the f*ck is going on over there?\" - European security services ask."},{"comment_id":"10156715676250725","commenter_b":"Reilly Steidle they're calling for you","commenter_a":"Lauren Lynn","post_message":"MTV is on the search for the next reality stars of the “Real World,” and fans living in the Chicago area have a chance to be a part of the show this weekend. How to apply ----->   @webpagelink"},{"comment_id":"1023375851016759","commenter_b":"You're wasting every body else's.","commenter_a":"67 out of the HOW MANY THOUSANDS of people that visit daily? Get your shit straight IFLS. scaring people for no reason. Pathetic.","post_message":"Way to go, anti-vaxxers."},{"comment_id":"10153813340919342","commenter_b":"I am also. But unfortunately not all women have that same luxury.","commenter_a":"They don't do thorough background checks?!!!!!!! My heart hurts every time I see stories like this! That's why I'm a stay at home mom. Can't trust anyone now a days.","post_message":"A parent's worst nightmare comes true. #abc13"},{"comment_id":"10153528204119497","commenter_b":"Ha!","commenter_a":"I see the girl inviting us to like her page is already here.","post_message":"\"I could make somebody happy, I am loving, and I deserve to be happy, too.\""},{"comment_id":"10152731683061234","commenter_b":"Hey Mary... Go suck some cock","commenter_a":"yes, we the teachers, fire fighters, and police tried to tell you all! He is a liar and a crook and a bully","post_message":"Gov. Christie is probably hoping his 2016 presidential aspirations don't hinge on New Jersey voters. That's because a new Rutgers-Eagleton poll shows most Garden State voters believe he's a poor fit for the Oval Office."},{"comment_id":"1305722922778581","commenter_b":"Sean Connolly","commenter_a":"Logan Laybolt","post_message":"Tian Tian the panda enjoyed the snow this morning!  Video via the Smithsonian’s National Zoo and Conservation Biology Institute"}]
