[{"comment_id":"10154496338258525","commenter_b":"Would love to see more of Bindi, Robert and Terri would love a show from the zoo. Steve will always be one of the greatest wildlife conservationist to have ever graced us with knowledge and just a fun loving man truly missed","commenter_a":"Crykie I miss him","post_message":"REMEMBERING STEVE IRWIN: His daughter, Bindi, who continues to walk in her father's footsteps, posted a touching tribute to The Crocodile Hunter on what would have been his 55th birthday. Rest in peace, Steve Irwin. \"Always in our hearts.\"  STORY: @webpagelink"},{"comment_id":"10153028815641336","commenter_b":"Netanyahu is a coward he's trying he's best coz he's scared of Iran","commenter_a":"I don't know what history books Obama has been reading but it would do him good to listen to this leader of the free world for America as we know it will disappear from us and our future....","post_message":"Today, Israeli Prime Minister Benjamin Netanyahu - בנימין נתניהו will make his case to Congress – and the American people – for why a pending nuclear agreement with Iran would risk his country’s security.  Tune in to Fox News Channel at 11:00a ET for live coverage of Netanyahu’s speech."},{"comment_id":"962385683823549","commenter_b":"Why in the hell did he stand there and listen to that s*** slam the door in that w**** face after about three words out of her mouth","commenter_a":"Racist","post_message":" HATE YOU WHITE MOTHER F-CKERS': Thug Chick Goes Nuts On White Neighbor (VIDEO)  @webpagelink"},{"comment_id":"10153059830708984","commenter_b":"F--k her, no I wouldn't","commenter_a":"Are you kidding?","post_message":"I can tell you right off the bat that I WON'T be participating in this. But I am not surprised to see this from Dems. Every chance they get..."},{"comment_id":"505124579675835","commenter_b":"Kiss my ass!!","commenter_a":"You have no rights!","post_message":"The most chilling and honest interview about Islam you’ll ever watch…"},{"comment_id":"10152608268042452","commenter_b":"I know right she's thick not plus size","commenter_a":"She doesn't look so plus to some of us who are","post_message":"There's a big change coming to Sports Illustrated's swimsuit edition. For the first time, the magazine will feature a plus-sized model on its pages.  Model Ashley Graham will appear in a campaign for \"Swimsuits For All\", heralding a new chapter in the magazine's famous swimsuit issue.  So what do you think about a plus-sized model gracing the pages of SI? A sneak peek tonight at 11 from ABC7 Eyewitness News. abc7.la/1zifFNK"},{"comment_id":"943744942348702","commenter_b":"To those of you who think the federal government can raise incomes do yourself a favor and take an economics class. And pay attention.","commenter_a":"Someone please perform a partial birth abortion on this woman.","post_message":"\"The defining economic challenge of our time is clear: We must raise incomes for hard-working Americans so they can afford a middle-class life.\" Read Hillary's ideas for the economy in her own words:"}]
