[{"comment_id":"10154135870346336","commenter_b":"@username OMG---More Trump Fabricated LIES!!!Trump Played Everyone Like A FIDDLE With Those TRUMP Planted PAID Protesters, Trump Now Has 20 Secret Service Guys Guarding Him At His Rally, EGO IS THE WORD...He Really Knows How To Play the Media & Followers *NEVER TRUMP* TRUMP Wants to TURN Our Military INTO ZOMBIE TeRRORIST Animals To Beat ISIS...BUT OUR MILITARY IS AN ELITE GROUP & Has Rules & Morals.... ISIS is A BAND Of MURDERS & CRIMINALS.... TRUMP Wants A WAR $$.....People Are Blinded by Trump's Rhetoric and can't SEE Trump Sending Our Young Adults To Fight An All OUT WAR AGAIN! Government Welfare KING DUMP Trump doesn't need anyone's HELP exposing His LIES Trumps own EGO Is His Own Nemesis.. ??Has Trump Gone From Selling Realestate Properties To Selling Our Whole Country!TRUMP wants to Do Away with Social Security & Medicaid For Our ELDERLY!!! HOW is Trump Helping American JOBS when ...","commenter_a":"Typical Trump...talking about anything other than specifically HOW he is going to make AMERICA great again!! Just saying it won't make it so!! Maybe that's why he gets no more than 35% of the vote. The other 65% are on to his BS...He only cares about Trump not one of his supporters! Wake up people!!!","post_message":"\"[Marco Rubio] made a statement that I had small hands. He made it up. He's a politician. Politicians lie.\"  Today on \"MediaBuzz,\" Donald J. Trump talked about the \"hands\" story."},{"comment_id":"911829685530326","commenter_b":"She is a pig!!","commenter_a":"Sickening!","post_message":"Pro-abortion Congresswoman and DNC Chairwoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb baby that's not born yet. Her response? No restrictions. Period.  Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"934315223319642","commenter_b":"Michelle Owen Nyki KiKi 😂😂😂😂","commenter_a":"AHAHAHAGA help","post_message":"Via The Everlasting GOP Stoppers"},{"comment_id":"875157552546363","commenter_b":"This is going to happen in every state these Illegas are in!!! Will there ever be a way to get them out of this country.. We need a great Wall of the United States just like the great wall of China!!","commenter_a":"who could have seen that coming? Not Obummer. He's got blinders on.","post_message":"Texas Man Murdered Execution-Style By An Illegal Immigrant Who Had Already Been Deported  @webpagelink"},{"comment_id":"10154490094079342","commenter_b":"@username so it's okay for a woman to put her hands on a man and act like a man but the second she get treated like a man she wanna cry and say, \"I'm a girl!\" FOH! Keep your hands to yourself. Period!","commenter_a":"Kindergarten lesson, first rule. Keep your hands to yourself.","post_message":"The video shows the woman shove Mixon, then he punches her in the face."},{"comment_id":"10153816653768854","commenter_b":"Did you see the gaggle of stupid white girls in the \"shield?\" I wonder why they hate their daddies so much.","commenter_a":"All that money spent, all the debt incurred, to produce kids like that.","post_message":"Liberalism is a Mental Disorder: Professor of Media Threatens Media with Mob Violence for Trying to Film Protest  [VIDEO]"},{"comment_id":"1784144245187941","commenter_b":"Oh shut up!","commenter_a":"If African Americans don't understand that they're being exploited and used for their votes by this woman, well then they'll get what they deserve after they elect her, a lot of nothing! So sad to see them falling for this. She's using a black rapper to pull in votes, amongst other things. Using a group of people for a vote is so wrong, nothing more. She's disgusting to do this.","post_message":"Hillary Clinton quotes Jay-Z during Cleveland rally: “Rosa Parks sat so Martin Luther could walk, and Martin Luther walked so Barack Obama could run, and Barack Obama ran so all the children could fly.”  Read more here: @webpagelink"}]
