[{"comment_id":"10152745138297093","commenter_b":"Way to go Steve!! You put this guy on blast!!! Look out people.","commenter_a":"Busted !","post_message":"Consumer reporter Steve Noviello was invited to a demo for a safety and security window film, but things didn't quite go as planned... @webpagelink"},{"comment_id":"1795134364108592","commenter_b":"Lock them up! Bunch of crybabies","commenter_a":"Pull out a bull whip and whip these bitches","post_message":"FOX 12's Mega Sugianto is live as protesters march for a fifth night in downtown Portland."},{"comment_id":"1673680616215825","commenter_b":"Stop letting this mother fucker control our future","commenter_a":"Nope","post_message":"Obama Gives 1.5 Billion Dollars To Muslim Brotherhood For THIS SICKENING Reason.  This shows you where his allegiance really lies.  Do you think Obama is a traitor?"},{"comment_id":"607266949431150","commenter_b":"You are So Right. Walter Biscardi Jr","commenter_a":"Wow, that is a match made in heaven. Just when you thought it couldn't get any worse than McCain / Palin, the Republican Party proves us all wrong again......","post_message":"Just in: Ted Cruz will name Carly Fiorina as his vice presidential running mate, according to two sources."},{"comment_id":"10154233484170496","commenter_b":"She's a smart woman","commenter_a":"At least she kept her yap shut","post_message":"What do you think of Lady Gaga's Super Bowl halftime performance?  PHOTOS: @webpagelink  (Photo by Patrick Smith/Getty Images)"},{"comment_id":"919874341467572","commenter_b":"WOW...THAT IS A AWESOME BEAUTIFUL PICTURE...GOD BLESS YOU ISRAEL...","commenter_a":"Beautiful!!!","post_message":"#TelAviv by Chief Eran Yerushalmi  #PicoftheDay #Israel #Beach"},{"comment_id":"768694459925723","commenter_b":"With alll the evil this Bitch has done. She should be disqualified from living!","commenter_a":"Since Hillary is under investigation she should be disqualified to run for President .","post_message":"Can America survive more of the same?"}]
