[{"comment_id":"1114298202002104","commenter_b":"What do you mean? It's a horrible thing to say. But we have freedom of speech in this country. Her speech is protected by the constitution. She shouldn't get fired for it.","commenter_a":"So its only freedom of speech if it's against Republicans? If the Democrats played on a level field they would get destroyed even more!","post_message":"The director of a nonprofit agency who called Michelle Obama \"an ape in heels\" has been fired."},{"comment_id":"10153973009181409","commenter_b":"Considering Hillary shouldn't even be allowed to run she should be the one stepping down","commenter_a":"Then he should step down from running ... it's the right thing to do","post_message":""},{"comment_id":"1370390752974540","commenter_b":"Please go after Hillary next.","commenter_a":"None of them in Washington are honest anymore. Only to themselves lining their pockets.","post_message":"We thought Democrats were supposed to be the honest ones!"},{"comment_id":"458263531022194","commenter_b":"I sure don't consider Ann Coulter a Patriot! She is a vile and hate spewing!","commenter_a":"What an ass!","post_message":"Even for Coulter this is outrageous."},{"comment_id":"963407697102775","commenter_b":"she wont get elected,,,she will be placed! Voter Fraud accomplishes much! Thats why she is not worried about winning","commenter_a":"If she does get elected, invest in body-bag manufacturers....guaranteed 1000% return on investment assuming you don't get killed by her goons.","post_message":""},{"comment_id":"1155155194501829","commenter_b":"Get over it. There are two different justice systems, if not more; operating within one....","commenter_a":"white privilege","post_message":""},{"comment_id":"10153832005601162","commenter_b":"Not a girl if you have boy parts, sorry.","commenter_a":"What about the rights of every girl at this school. This is insanity.","post_message":"30-DAY DEADLINE: The U.S. Department of Education says Palatine Township School District 211 is violating the rights of a transgender student by refusing to allow her the unrestricted use of a girls' locker room: @webpagelink"}]
