[{"comment_id":"1271814732856760","commenter_b":"she will be felon. unable to run for office.","commenter_a":"No! Just NO!","post_message":"Just when you thought it was over, look at this..."},{"comment_id":"10154099189924071","commenter_b":"Killary is an Embarrassment ,she evidently has no idea how to run an office Legally or with Class. What she poured into this election was ill gotten money. She sure didn't use her own. I Honestly feel her major Dissapointment is her self absorbed issues that would have only added more money to the Clintons Fraudulent Foundation . Being a Great Nation is now much more attainable without corrupt Killary and the rest of her lackeys.","commenter_a":"Wow. So much hate on these posts. I hear a lot of people upset about the protests going after she lost but it seems like there are just as many sore winners out there. Whether you like her or not, people need to learn some respect. I guarantee 99.9% of the people on here haven't the foggiest idea what it takes to hold a high ranking position in our government or run for president. She poured a lot of time and effort into her campaign and to still come up short must be a major disappointment. I'm sure a lot of people have done less and been more hurt by their own failures. I thought this was a country of conscience and good will. This election has proved we are much further from being a great nation than we claim.","post_message":"“I know that over the past week a lot of people have asked themselves if America is the country we thought it was.\""},{"comment_id":"10156149159940354","commenter_b":"There's NO MYTH! ASSHOLE! I RESCUE PIT BULLS TOO, It's Dumb F**KS like you and your brother James that give Pit Bulls a bad Rap! Also DumB F**KS like this woman in the article! Check Cesar Milan, Pit Bulls & Parolees, Etc etc! OH NEVER MIND You're probably a Liberal Obama lover too!","commenter_a":"I OWN PIT BULLS, It would be impossible for me to order mine to attack ANYBODY! I could leave them in a room with an infant crawling on the floor without a worry! THIS woman IS THE REASON Pits have a bad Rap! These dogs were trained to be mean! Lock her ass up for 25 YRS! I Doubt the two dogs can be saved, they'll have to be put down!","post_message":"***WARNING: GRAPHIC VIDEO***"},{"comment_id":"1353532451354276","commenter_b":"Said the blond headed, blue-eyed white woman.","commenter_a":"I am so sorry if this happens, your fear, only because your skin is darker than mine. But I kinda think all of this has happened to white skinned people as well. If we could all walk argh nd inside out we would see assholes right up and recognise good when we see it. Its not about race for everyone. Some of us see us all as people!!!","post_message":"This man shares his haunting testimony: He too is afraid of being killed by the police. (via KevOnStage)"},{"comment_id":"1505789769441048","commenter_b":"Boycott NBC","commenter_a":"When has NBC ever put a spot light on Trump in a positive way? Lol.","post_message":"The 2016 election has been quite the seesaw ride."},{"comment_id":"10153328314986051","commenter_b":"she a bitch who needs to be euthanized,,,","commenter_a":"Lost a lot of the respect that I was feeling for the pope. I don't care who he decides to visit, but why the \"secrecy\"?","post_message":"Pope Francis’s message to Kim Davis during their meeting was short and sincere: Stay strong. Do you support or oppose the stand Davis is taking?"},{"comment_id":"1097693670320210","commenter_b":"Triple gross, have their hair all over my sheets, NO WAY!!!!","commenter_a":"Gross","post_message":"One New York couple has successfully acquired a bed large enough so that they and all 8 of their rescue pups can sleep comfortably. \"They love to just be near us. So however we can make that happen, they're happy.\""}]
