[{"comment_id":"10152892200414753","commenter_b":"Bitch","commenter_a":"how incredibly low and self absorbed are you that you could steal money and attention this way.hope you get all the attention you want now.","post_message":"A Florida woman is facing felony charges after cops determined that she faked having breast cancer in order to swindle thousands of dollars out of friends, family, and her supporters in the community."},{"comment_id":"10153737198202235","commenter_b":"Fucking dumb women.","commenter_a":"Carson will never be elected because the majority of American women will never vote for this clown","post_message":"What a horrible person he is. Just awful."},{"comment_id":"10153356905187439","commenter_b":"Mussies I swear they're really just opressed homosexuals","commenter_a":"Bastards.","post_message":"@webpagelink"},{"comment_id":"10153629866881336","commenter_b":"She is pathetic and out of control.","commenter_a":"Miley is a marginally talented girl with very little respect for herself. Billy Ray should be ashamed.","post_message":"What did you think of Miley Cyrus' barely-there ensemble?"},{"comment_id":"1188648117842550","commenter_b":"America shouldn't change Muslims need to adapt to our cultures","commenter_a":"UN","post_message":"MUSLIMS FLIP OUT! McDonald, Pizza Hut And KFC Refuse Muslim Demands To Serve Halal...  Time to go eat a Big Mac! Can we get 10K LIKES for this!"},{"comment_id":"10150859556744999","commenter_b":"Did she calll Monica Lewinsky ? It is only a mediocre actress and above is false as it was her husband","commenter_a":"Only in America is it possible that the president of the state --otac son candidate second son, husband and wife ..","post_message":"President Barack Obama: “We’re going to carry Hillary to victory this fall, because that’s what the moment demands.”  More photos: @webpagelink  Photo: Doug Mills/The New York Times"},{"comment_id":"10153199106634071","commenter_b":"Get her a group of body guards while you're at it","commenter_a":"M","post_message":"A $48.5 million diamond for a 7-year-old girl."}]
