[{"comment_id":"10153708814028010","commenter_b":"shut your filthy mouth","commenter_a":"Nutella is gross. Nothing is worth assaulting the elderly, especially poo-tasting Nutella.","post_message":"The 24-year-old had snagged several samples when the elderly shopper told him to take just one, police said."},{"comment_id":"10154723895793734","commenter_b":"Of course that's the type of trash that wants Clinton elected","commenter_a":"The guy who did this is a Republican","post_message":"Donald Trump's campaign manager is saying without evidence that a Trump protester involved in a disturbance at a rally in Reno, Nevada, was \"a Democratic plant or operative.\""},{"comment_id":"981872948594888","commenter_b":"Ugly garment..her Mamma didn't teach her well at all.","commenter_a":"Yeah","post_message":"Hillary Perón"},{"comment_id":"1015647588491215","commenter_b":"@username Hillary hasn't officially won the nomination there my dude... Did I say I was voting for her?","commenter_a":"In his defense, and I am in no way voting for this guy, he said the economy ran better under democrats but it SHOULD NOT be that way. So, that plays into him wanting to be a different option within the party. But whatever, the guy is a moron and I'm voting DEM!!","post_message":"LOL, WOW. You could ask this guy what he had for breakfast, and his answer would change from one minute to the next.   Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154704030031323","commenter_b":"@username Or you could just admit that you are fundamentally incorrect. That would be the mature thing to do here. You can't just use the serious topic of misogyny and sexism as an argument whenever you like. It plays a great disservice to the genuine areas where such a discourse is absolutely valid. This is about holding a proven heavily corrupted, belligerent war-mongerer to account, who happens to be a woman. End of story.","commenter_a":"Sorry Guardian, but no one actually buys the 'its because she's a woman' argument when it comes to Clinton. There are actually legitimate reasons why many do not like her. You're wasting your time.","post_message":"\"Hillary Clinton irritates people not just because of her gender, but because we simply can’t process her narrative. There are no stories that prepare us for her trajectory through life and, therefore, we react to her as if she’s a disruption in our reality, rather than a person. We love public women best when they are losers, when they’re humiliated, defeated, or (in some instances) just plain killed. Yet Clinton, despite the disapproval that rains down on her, continues to go out there and chalk up wins.\""},{"comment_id":"855684411135567","commenter_b":"what mexicans smuggling drugs into our country? no WAY! shoot them","commenter_a":"Hmmm... hemp mattresses.","post_message":"Nice try."},{"comment_id":"10154679787223751","commenter_b":"we dont want to lecture anyone on how to govern their own country, but Canadians will lead by example","commenter_a":"That's whet they need to be.","post_message":"Canada's border has seen a surge in people crossing illegally from the U.S., with a 230% increase in people crossing into Quebec in January compared to a year ago. @webpagelink"}]
