[{"comment_id":"10153507690103812","commenter_b":"They attack to eat. It's a risk of going into an ocean. Yet millions do multiple times yearly. Safely.","commenter_a":"I wish they could stop telling the lie... \"Sharks don attack humans\".... Yes they do!!","post_message":"UPDATE: Officials: Girl and boy may have lost parts of limbs in separate shark attacks on same stretch of NC beach: @webpagelink"},{"comment_id":"10152555972045667","commenter_b":"They will make some inmate a great bride.","commenter_a":"Despicable fools.","post_message":"Former Vanderbilt University football players Brandon Vandenburg and Cory Batey were found guilty on all counts for the 2013 campus rape of an unconscious woman."},{"comment_id":"853456421380774","commenter_b":"She can only be arrested if she goes to Egypt so best she stays away . But good she speaks out","commenter_a":"Good","post_message":"Clooney’s wife threatened with arrest."},{"comment_id":"10153165565220399","commenter_b":"The Democratic President Lyndon B Johnson, the father of the \"Great Society\" that was the rebuilding of the Urban Center for the Black communities to populate and be the new beginning for the poor blacks.. How did that workout... Detroit was setup as the model city.. As was Baltimore and Chicago... In reality, all the democrats did was move the blacks from the southern plantations to the Urban Plantations and laugh as they did it!! Here is the quote from LBJ as he did this: \"These Negroes, they're getting pretty uppity these days and that's a problem for us since they've got something now they never had before, the political pull to back up their uppityness. Now we've got to do something about this, we've got to give them a little something, just enough to quiet them down, not enough to make a difference... I'll have them niggers voting Democratic ...","commenter_a":"Blame it on anyone else but your OWN failed policies, GOP.","post_message":"The conservative blame game is in full effect."},{"comment_id":"382025331922062","commenter_b":"When pigs fly","commenter_a":"Yes","post_message":"Is this good or bad news for the GOP?"},{"comment_id":"1150086235078889","commenter_b":"Hillary Clinton for President!","commenter_a":"This guy.....God help us all if he's elected!!!! Gary Johnson!!!! Love how he talks about jobs when he's notorious for trying to break up unions and has his own clothing line made in China!!! l","post_message":"WATCH LIVE: Donald J. Trump holds rally in Florida"},{"comment_id":"1766923240187480","commenter_b":"What is the purpose of the wall on the border of Guatemala, I for one am sick of the illegals working here not paying taxes but taking their wages back to mexico and supporting their families over there.. Is this perhaps why a wall is not in the best interest of mexico?","commenter_a":"@username that's probably the truest state I have heard yet! Hilary is a monster and yes gets away with anything Would be impossible to impeach!","post_message":"Mexico's foreign minister Claudia Ruiz Massieu dismissed Donald J. Trump's campaign promise her government would pay for a U.S.-Mexico border wall."}]
