[{"comment_id":"678004185692498","commenter_b":"What self respecting woman wouldn't lash out at a woman trying to seduce her husband?","commenter_a":"“Bimbo eruptions.” “I would crucify her.” “We have to destroy her story.” These are just some of the things said and done by @username to undermine women who accused her husband, Bill Clinton, of infidelity and even assault. Hypocrites!","post_message":"\"This is not something that we can ignore. It's not something we can just sweep under the rug as just another disturbing footnote...this was not just a lewd conversation, this was not just locker room banter. This was a powerful individual, speaking freely and openly about sexually predatory behavior.\" —First Lady Michelle Obama on Trump"},{"comment_id":"1568371310121541","commenter_b":"Cut their balls off and make them eat them.","commenter_a":"Hang them","post_message":"Group Of Muslim Migrants That Gang Raped 16 Year Old White Girl Get Devastating News  They deserve much worse than this.  What do you their punishment should be?"},{"comment_id":"10153200495384411","commenter_b":"leave the fukers there ,revoke their passports","commenter_a":"They weren't British....","post_message":""},{"comment_id":"1034922753266951","commenter_b":"Dumb bitch","commenter_a":"Sarah Palin humiliates herself every time she opens her mouth. Do us all a favor - shut up.","post_message":"She just picked the WRONG fight."},{"comment_id":"506647236198456","commenter_b":"That will get her dinner at the White House.","commenter_a":"I want proof. Then it's not just a vague fb post...","post_message":"Beyonce Posted Letter Hours Before Dallas Shooting, Calling Blacks to  Against Police, That Murder Should Not Go   CHARGE HER WITH INCITING VIOLENCE!   Let's get 5000 SHARES if you think she should be held accountable!"},{"comment_id":"10152833310366051","commenter_b":"She prostituted herself out for the Republican party without thinking of the fall out from orally satisfying the president. He never did anything with her. He allowed her to get on her knees and prostrate and prostitute herself. She and the ugly woman with her ruined their own lives, not his.","commenter_a":"Good job Mr. Shanks. The worst part is that he carelessly wrecked the life of a young vibrant Monica Lewinsky. What a man! What a man! Jerk!","post_message":"The man who created Bill Clinton’s official portrait hid something in plain sight – and the Clintons aren’t happy about it."},{"comment_id":"451215538402360","commenter_b":"I will refuse, fuc her and the dirty dog she rode in this on!","commenter_a":"YES","post_message":"Will You Refuse To Turn Over Your 2nd Amendment Rights To Michelle?  Comment 'yes' or 'no'."}]
