[{"comment_id":"399694993488875","commenter_b":"You dumb fuck the president has nothing to do with gas prices.","commenter_a":"Ain't nobody complaining bout them gas prices though","post_message":"Ironically, Manning was imprisoned and nominated for the same act."},{"comment_id":"1009572635788547","commenter_b":"That's terrible!!! I worry about my children everyday at school!!!!","commenter_a":"Really. Bullying. Is wrong","post_message":"A sixth-grader died Tuesday after a bully stomped on his chest during a P.E. class at a Colton elementary school, the boy's parents told KTLA.  \"This kid did it on purpose,\" said Jose Gallegos, whose 12-year-old son Dominick died after losing consciousness on the field.   However, detectives who went to the hospital where Dominick was taken said there was no evidence of an assault or physical injury that would have caused his death. Investigators are waiting for a report from the coroner's office.   Read KTLA's story here: @webpagelink"},{"comment_id":"10153106076119255","commenter_b":"We have so many publications on both side that are mudslingers with out facts--about time both sides clean up their act and print thing to promote and support","commenter_a":"@username only wants to stir the pot recently!","post_message":"They were insiders. Home grown. Godly. Our neighbors, friends, and kin. People like us.  By Bill Moyers"},{"comment_id":"10153588597752042","commenter_b":"Its not indecent exposure. Breasts arent genitals and they are legal in ny. Also its 2015, so if they ban toplessness in nyc or just the times square section, men jogging around topless or wearing loose tanktops showing nipples should be banned as well. Its the same body part. As a matter of fact men in beach should wear something to cover their bare chests as well. Its only fair to women.","commenter_a":"Nope! First Amendment vs. Decency! The problem was old-styled Garbage at Times Square, that problem was solved by then-Mayor Giuliani in late 1990s. DeBlasio was too socialist today!","post_message":"NO MORE NUDITY: After several calls of criticism about topless, body painted women in Times Square, a Bronx politician has introduced legislation to ban toplessness across New York. Do you think this should be passed?"},{"comment_id":"479436158913631","commenter_b":"She is a POS that has never done anything but take all she can get. She's an entitlement ho that plays the race card to get her way.","commenter_a":"VETERANS I'VE GOT NO RESPECT FOR THIS WOMAN WHAT SO EVER.","post_message":"Michelle Obama just made an outrageous claim...  Our soldiers fight and die for our country, Michelle takes lavish vacations.  Do you respect our veterans over Michelle?"},{"comment_id":"697292770461301","commenter_b":"I hope you're right Jim!! God help us all if she gets in!!","commenter_a":"She is a major disgrace to the Democratic party. If she is all they got, Forget next year's election. They don't a chance in hell.","post_message":"FBI wants to take down Hillary Clinton after she is caught in huge act of espionage. She needs to be thrown in prison. We can't let her get away again. Do you think Hillary Clinton should be arrested?"},{"comment_id":"10153620766011337","commenter_b":"I would only wish there were black only sororities, but no, whites are free to join and pollute the heritage","commenter_a":"So I'm just asking. On campus at Grambling University pretty sure there are ALL BLACK sorority houses. Why no uproar over that ?;","post_message":"RACIALLY INSENSITIVE? This Alabama sorority video had to be deleted after a diversity backlash.  Watch it and judge for yourself..."}]
