[{"comment_id":"10154119887406167","commenter_b":"LOCK HER UP!","commenter_a":"Why hasn't Hillary been arrested for money laundering and racketeering?","post_message":"It's not just Trump that's the problem -- it's his family too."},{"comment_id":"10153964436169705","commenter_b":"@username but did he attend the funeral for Lady Bird Johnson? Gasp.","commenter_a":"Obama will probably attend HIS funeral!","post_message":"The co-founder of the annual South by Southwest festival Louis Meyers has died."},{"comment_id":"10154645130189062","commenter_b":"Woman should be lucky for not being arrested ,for interfering with \"police business \".","commenter_a":"So he was a really nice guy she said. But, let's post this to social media to ensure really nice guy loses his job instead of giving him the opportunity to learn from his mistakes.","post_message":"\"The reason I pulled you over today...I just want to know, what's the emergency?\" said the woman."},{"comment_id":"1160001747368578","commenter_b":"@username What Does Hillary Clinton Really Want? WARNING: up America As you may know, Hillary Clinton mentor was Saul Alinsky. She wrote her thesis based on his writings. Saul Alinsky died 44 years ago and was the author of a piece called for Radicals. He wrote about how to create a State. President Obama prescribe to this philosophy as well as Elizabeth Warren and Bernie Sanders. Don fool yourselves, this is their mission and their purpose! There are eight levels of that must be obtained before you are able to create a social state: 1. Healthcare Control Healthcare and you control the people 2. Poverty Increase the poverty level as high as possible; poor people are easier to control and will not fight back if you are providing them everything to live. 3. Debt Increase the Debt to an unsustainable level. That way you are able to increase taxes which ...","commenter_a":"This information has all been checked, then double checked... It is 100% Correct. Maybe Trump knows something we should That's why there is such an alarm within US government, since Trump's statement about temporary suspension of migration of Muslims to US till US authorities make sure there is a proper concept of safe penetration of US territory. People are stunned to learn that the head of the U.S. CIA is a Muslim! Do hope this wakes up some! Until it hits you like a ton of bricks read it again, until you understand! We now have a Muslim government! John Brennan, current head of the CIA converted to Islam while stationed in Saudi Arabia. Obama's top adviser, Valerie Jarrett, is a Muslim who was born in Iran where her parents still live. Hillary Clinton's top adviser, Huma Abedin is a Muslim, whose mother and brother are still involved in the ...","post_message":"Hillary Clinton belongs in prison!"},{"comment_id":"10154404205156130","commenter_b":"Holy crap, what a bunch of drama queens.","commenter_a":"Done","post_message":"It's a tiny gesture, but it speaks volumes."},{"comment_id":"1683425098577634","commenter_b":"It will never happen to that cockroach!","commenter_a":"Yes, it should have happened a long time ago.","post_message":"BREAKING: GOP Threatens Obama With Active Impeachment.  Stop threatening, and just do it already.  Would you be happy if they actually followed through with this?"},{"comment_id":"473465766111797","commenter_b":"@username you mother should have swallowed your nasty ass.","commenter_a":"They are both true. And that cannot be argued. They are both true","post_message":"Full story: @webpagelink/ Graphic by: The Free Thought Project.com <-- 'Like' (y)"}]
