[{"comment_id":"1639738129419643","commenter_b":"@username he hasn't done anything yet. He is the President elect. He won because People are tired of the false unemployment rate Obama is pushing. Tired of the rising cost of Insurance except for people like you who probably get it for free. Tired of the war with radical Islam that he has no strategy for winning. Tired of illegal aliens pushed on us and tired of sanctuary cities and tired of people like Kate Steinle being murdered by them. You certainly can't blame Trump for any of those things. Have a nice day in your la-la land world.","commenter_a":"Actually, Barack Obama is responsible for Trumps win because he has screwed this country so badly and people are sick of his shit and knew that Killary is not only unqualified, dishonest as hell, and a total liar but that she would continue Obamas agenda to destroy our country.","post_message":"Barack Obama said that Russia is responsible for Donald J. Trump's win, but he didn't expect Sean Hannity to knock his lies right back in his face. The democrats just got schooled.  Let's get 2,000 shares to show that America can't wait to get Obama out of office."},{"comment_id":"10153867165952144","commenter_b":"Obviously not Mike. If she belonged in jail, they'd have put her there.","commenter_a":"So instead of corrupt it's lazy, stupid, or incompetent...hardly QUALIFICATIONS.","post_message":"This is a really smart piece from David Corn."},{"comment_id":"1795750557330111","commenter_b":"Couldn't agree more!! Set up! All the drama, theatrics all made for Reality TV!! Kardashian styling! #Whinylittlebitch","commenter_a":"I believe THAT was completely stage set up!!!!! How can possibly someone can get through with a gun if someone did try to do something.... Complete set up","post_message":"The Secret Service rushed Donald J. Trump off the stage at a rally on Nov. 5 in Reno, Nev.: @webpagelink"},{"comment_id":"10154535471263812","commenter_b":"I'm a white female, and I sure as hell don't trust her","commenter_a":"\"Voters of Donald Trump are sexist idiots that rather vote for a fellow idiot than a woman\"","post_message":"Poll shows 18% of people who say they will vote for Donald J. Trump think the real estate mogul is not qualified to be president."},{"comment_id":"10153284422191323","commenter_b":"White people are often unaware of their privilege as it is invisible a lot of the time. Happened to me when I got pulled over by a cop for cutting in front of them. I got an angry warning. If I were black, there's a better chance I would have gotten a ticket. I'm not 100% white, but eh, close enough in terms of looks to get the benefits of privilege most of the time. Except at hoity toity Connecticut country clubs.","commenter_a":"Do you understand now white folks?? Its not about you as a person but the system that programs these prejudice biases into you without you knowing consciously.... So when we speak out about institutional racism and bias...its not a direct knock against you as ppl but the fabric your ancestors created and is still maintained today.....","post_message":"Racism is a business. Its marketing is so successful that even Akala looks sideways at a young black man holding a lot of cash"},{"comment_id":"10153447709650667","commenter_b":"If this would ever happen to my mom. I would make room so she can live with me.","commenter_a":"Good just because your old , you still have to follow the rules . If they make exemptions based on age that would be discrimination .","post_message":"“I have four grandsons, but I don’t want to be dependent on them. I can’t be a burden to my family. They don’t have room for me. That happens in life.”"},{"comment_id":"10152774435682144","commenter_b":"Misogyny FTW !!!","commenter_a":"Suck my pussy hag","post_message":"Another indication the Supreme Court is likely to rule in favor of gay marriage this June, when justices will hear a monumental case deciding if the Constitution provides the right for same-sex marriages."}]
