[{"comment_id":"10153148435072098","commenter_b":"Wrong person died","commenter_a":"Guess his high heels got stuck on the gas pedal haha 😂","post_message":"BREAKING..."},{"comment_id":"1748972275334787","commenter_b":"Even if the woman was standing to pee, they are inside a stall with the door shut, Us woman don't peek under the stall to watch other woman pee...only pervs do that","commenter_a":"The thing that makes me LAUGH is people have most likely ALREADY shared a bathroom with someone who is trans and didn't even know it!","post_message":"It doesn't make ANY sense…  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153429657851323","commenter_b":"You are the ugliest woman I have ever seen","commenter_a":"My biggest headache: is being a gay a choice or disorder? Please someone help me out.","post_message":"\"Marriage equality is just one front for LGBT rights: full LGBT equality, which includes economic justice, gender identity, immigration rights and racial liberation, is far from assured. [...] But today, one chapter in our fight is closed. Love has triumphed.\""},{"comment_id":"942535009139581","commenter_b":"get over yourself girl","commenter_a":"So girls/ladies do you go phoarrrrr when poldark shows you his chest? If so you cant complain.","post_message":"The wolf whistling debate has got VERY heated"},{"comment_id":"10155938644580354","commenter_b":"OF COURSE NOT! Did anyone actually think these weasels with their blood money in their pockets would do anyting to regulate Planned Parenthood? LOLOLOLOL Fell off the dumb truck, did ya?","commenter_a":"Go back to work useless bastards","post_message":"GOP consultants who hate the grassroots--and their values--continually boast about the historic majority they won in the House, purely by their own DC insider wisdom.  But if these are the best results we can get from that majority, what have they actually accomplished?"},{"comment_id":"1673203152922095","commenter_b":"Fucktards.","commenter_a":"Oh come on....we have laws for a reason..I don't care what color your skin is...if you urinate in public..you need to be arrested!!! What is this world coming to???","post_message":"New York City’s city council is set to dilute a host of criminal laws including laws against public urination and excessive noise because council members believe too many members of minorities are getting arrested."},{"comment_id":"434085210113797","commenter_b":"You've gotta love all the women on here tooting their own horns, huh? lol","commenter_a":"My kids aren't teens quite yet (11 and 6 year old).. But people always thing thy're my brothers... They're in shock when I tell them I've been married for 12 years and my actual age LOL","post_message":"Mom genes.  Which of these women gave birth to the other two?"}]
