[{"comment_id":"10154436669806509","commenter_b":"Hillary is a lying hag. #feelthebern","commenter_a":"Hillary Clinton is a chameleon. She changes her beliefs faster than I change socks. She's a liar and we all know it. The only supporters she has are middle-aged feminists.","post_message":"Can Hillary Clinton assure voters that, as president, she would not expand U.S. military involvement abroad?   Live updates from #DemTownHall: @webpagelink"},{"comment_id":"10154379177365579","commenter_b":"Thats illegal zach. You have to come here to get it.","commenter_a":"If only he lowered the debt, defeated terrorists, raised the employment level, etc. as well as he cracked jokes.","post_message":"FULL REMARKS from President Obama at his final White House Correspondents' Dinner."},{"comment_id":"10150721738224999","commenter_b":"To bad nothing could have been done to stop the shooting of the first graders. If Obama wants to stop senseless violence he should stop pursuing senseless executive orders and do something like support Kates law. Crimes that are preventable through deTerence and viligiliant police enforcement can actually stop senseless gun violence. Almost nothing at all can stop a crazy person from attacking an elementary school and killing first graders. Fortunately it is an extremely rare event. The vast majority of senseless killings are actually far more preventable. Obamas convictions are misdirected. How about deporting all the illegals from the country. That right there would prevent thousands of senseless violent crimes. Read the stats. Not all illegals are criminals but none of them have the right to be here so if one of them commits a murder its because our goverment is to spineless to enforce the law. Enforce the ...","commenter_a":"I still think about Sandy Hook so much. I can't get past it. My heart still aches for those precious little ones & I still cry. Thank you Mr. President for taking a step in gun control.","post_message":"Shedding tears over the 2012 deaths of children in a Newtown elementary school, President Barack Obama announced executive actions he will take on gun laws. @webpagelink"},{"comment_id":"1823139327950230","commenter_b":"As long as these people want to be citizens. No illegals allowed. Why are we babysitting other countries people?","commenter_a":"IMPEACH TRUMP Call and write your representative @webpagelink/ talking points 1 wants to lift sanctions on Russia so Tillerson and Exxon can drill big conflict of interest maybe even treason 2 where are his tax returns 2 unconstitutional act re immigration, the 3 Muslim countries NOT banned are those where he has business dealings conflict of interest 4 every president has had a White House medical exam, not Trump is he mentally ill 5 we can't wait for Painter and Eisen (Bush and Clinton ethics lawyers) law suit for disclosure Find Your Representative · House.gov Not sure of your congressional district or who your member is? This service will assist you by matching your ZIP code to your congressional district, with links to your member's website and contact page. HOUSE.GOV Find Your Representative · House.gov Not sure of your congressional district or who your member is? This service will assist ...","post_message":"Americans are making it clear: Trump's unconstitutional Muslim ban isn't going to fly.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10155124264189679","commenter_b":"Lock this old hag up....","commenter_a":"No No No","post_message":"LIKE to support, comment to discuss."},{"comment_id":"10155107351709062","commenter_b":"Grow a uterus then be concerned with this issue.","commenter_a":"The baby killers' excuses are absurd. They claim women's health concerns, yet having access to a sanitary hospital is unfair. And, it it's about health, how does killing a baby make them healthier???? Wouldn't keeping their legs closed keep the baby healthier??!","post_message":"Davis led an 11-hour filibuster of the restrictive legislation."},{"comment_id":"10153287384469714","commenter_b":"We never like skinny models.we love skinned and boned and toned models that should take the run ways","commenter_a":"I think people don't get it. It's attractive to be thin but you don't have to starve yourself. You don't have to be super skinny. People like a nice figure but above all a nice personality. You don't have to kill yourself to have a nice figure. Eating right and working out makes you look nice and feel better .","post_message":""}]
