[{"comment_id":"845673835565796","commenter_b":"@username - As usual, the liberal fails to consider the unintended consequences of their actions. Transgenders make up only .3% of the population so the threat from them is minimal. The threat from perverts who will abuse this decision to commit assaults will far outnumber the Transgenders who simply want to go pee. It will be the innocent among the majority of Target's customers that will face the consequences of Target's liberal, feel good decision.","commenter_a":"Well I guess my kids will not be using the fitting rooms. I to will be reconsidering using their bathrooms and even shopping there. This country has lost it's damn mind!","post_message":"Are you kidding me?!"},{"comment_id":"1017395615037845","commenter_b":"@username Border security is far more lax than it has ever been. Obama gives the border patrol and ICE orders to stand down all the time, which is a major contributing factor of the explosion in the illegal alien population in the US. The illegal population here is at an all-time high. There should never have been a healthcare mandate. This isn't a socialist regime. The people (or at least the majority of us) don't like the mandates, individual or business. I assert that you condoned Fast-N-Furious because you're the one who said things are better than they were \"under the misery of Bush\". Businesses salivated at the prospect of cheap labor, so when Bill Clinton signed NAFTA into law they didn't mind one bit firing millions of employees -many of whom had to seek any type of welfare they could in order to get by. Not good for economy ...","commenter_a":"You are MOST WELCOME here in the great state of Pittsburgh, Pennsylvania Mr. Trump!! I cannot WAIT to see you tomorrow!! You build that wall and we'll provide the steel!!! Come on Yinzers!!! Vote Trump!!!","post_message":"THANK YOU CALIFORNIA, MARYLAND, PENNSYLVANIA, & NEW YORK! I appreciate your unbelievable support. Together, WE will MAKE AMERICA SAFE & GREAT AGAIN!"},{"comment_id":"1342427385796715","commenter_b":"Lock her up!","commenter_a":"How can people be voting for this woman I just don't understand we are doomed","post_message":"BOOM.... !! Judicial Watch comes out with a powerful STATEMENT.  @webpagelink"},{"comment_id":"647855782048269","commenter_b":"@username, no, she's a \"feminist\" and \"peace activist\" from Argentina. All my friends would describe themselves as feminists (male and female). None of them support Trump. Funny that.","commenter_a":"The insult 'a basket of deplorables', is the best exhibit of Hillary Clinton discriminating personality. There is a big number of registered democrats (like myself) for Donald J. Trump. So all democrats and independents (forget the republicans) supporting Trump, are that? That is how cheat this woman is. If elected, she will do the same to any ethnic group rejecting her, and will blow up one country after another, starting with Russia. Deplorable, is Hillary Clinton for expressing herself that way about the 75% of US citizens. (Ivan Mintz/Eric Trump)","post_message":"Republicans slammed Hillary Clinton for saying that half of Donald J. Trump’s supporters fit into a “basket of deplorables.\""},{"comment_id":"1044965742191103","commenter_b":"So lern ich ja vielleicht doch noch was Mathe 😂","commenter_a":"@username :D","post_message":"Original image by Cath Ennis"},{"comment_id":"790580904351473","commenter_b":"You shouldn't be in office if you can't stand by your convictions! You were elected b/c the voters trusted you! You were given a mandate to turn the tide in this Country! Now do it!","commenter_a":"gutless bast---s","post_message":"What are your thoughts on this reasoning? 'Many' Reps. Afraid of 'Retribution' If They Voted Against Boehner"},{"comment_id":"10154983391004138","commenter_b":"@username so all white men are evil? Racist!!","commenter_a":"Being US citizen, I was planning to leave the US for the first time ever to visit Africa and Dubia. Now I can't even leave and visit my love ones that I haven't seen them since 1996. I am Somali American who is proud to be Muslim but also love this country just like many Muslims. . We're all the children of Adam and Eve, one nation under God, we're all immigrants. Ban Donald trump not Muslims.","post_message":"Approximately 500 to 700 people gathered at Terminal 1 to protest President Donald Trump's ban on immigrants from seven Muslim-majority countries entering the U.S."}]
