[{"comment_id":"769546029761706","commenter_b":"karmas a bitch","commenter_a":"Tolerance! Take their Allah and Mohammed, tear up and urinate on it. Then we will talk tolerance.","post_message":"Italy: Muslims Destroy and Urinate on Virgin Mary Statue   @webpagelink"},{"comment_id":"1505789769441048","commenter_b":"Boycott NBC","commenter_a":"When has NBC ever put a spot light on Trump in a positive way? Lol.","post_message":"The 2016 election has been quite the seesaw ride."},{"comment_id":"10153844148480579","commenter_b":"Only when they try to use it as the basis of their platform or legislation. Then it is a big negative.","commenter_a":"Media Silent As Muslims Ethnically Cleanse 60,000 Christians In Philippines By: Daniel Greenfield When thousands of Muslims become refugees, then you can’t get the media to shut up about it for weeks. Thousands of Muslim migrants... jewsnews.co.il","post_message":"Do you consider religion when evaluating a candidate?"},{"comment_id":"1137397219630950","commenter_b":"Hey Josh this chick is tripping. Lol","commenter_a":"#newyorkvalues","post_message":"“I don’t want money, I’m going to rape you.”"},{"comment_id":"1109305832420099","commenter_b":"It's time for a female to make some real changes...","commenter_a":"Hes no match for #Hillary","post_message":""},{"comment_id":"10154094458574087","commenter_b":"What a bitch. She's utter trash. Go kiss your daddy. Seems like a thing you're into to.","commenter_a":"Ivanka needs to quit playing around and marry me already.","post_message":"Ivanka Trump returns fire after an interview in Cosmopolitan magazine turned unexpected heated."},{"comment_id":"593792507477995","commenter_b":"Leave the girls alone.","commenter_a":"In all fairness now, you'd take Drugs too if you had those two Lying Muslim Idiots for parents! LOL","post_message":"The White House is in uproar after Obama daughters caught doing THIS.  This is outlandish. These are the daughters of our president.  Would you vote to kick the Obamas out of the White House?"}]
