[{"comment_id":"512912212228885","commenter_b":"Beyonce!!!!!!!! Gave them the green light.. They wAnt what you have but don't want to educate themselves or help themselves. LAZY","commenter_a":"I think that this man that served alongside of every single race in the world as a brother, was assaulted by black thugs representing their selves as Black Lives Matter. Now let's see if someone from BLM will stand up and condone this behavior, or embrace it. There is racism in every race, but the citizens that stand alongside each other and condone this, are the true brotherhood.","post_message":"*****BREAKING NEWS*****  They said these 6 words..."},{"comment_id":"10153906940493812","commenter_b":"Are you American? If your pro bringing terrorists into the country and giving them free benefits like Medicaid etc. while American citizens starve, how about we send a few to stay with you? Wait... I get it... 'Nuff said!","commenter_a":"After all, some Americans do have a heart. Way to go Pres. Obama.","post_message":"\"Apparently, they are scared of widows and orphans coming into the United States of America.\""},{"comment_id":"870445706335391","commenter_b":"Life starts when your born. Read the Bible partically when god breathed into Adams lungs and life started","commenter_a":"Every life matters!! Save the unborn today","post_message":"Tell Congress to protect the unborn!  Click below to urge your Congressman and Senators to cosponsor the Life at Conception Act!"},{"comment_id":"10153002903836323","commenter_b":"Aaaw u want him to suck your lil prick?","commenter_a":"Fuckin Jew cock sucker","post_message":"Rupert Murdoch has been strongly criticised after tweeting that “most Muslims” – even if peaceful – must be held responsible for the religion’s “growing jihadist cancer” in the wake of the terror attacks in France."},{"comment_id":"1282583651782104","commenter_b":"People are starting to pee on the streets, into fountains, garbage cans, on car tires, between parked cars, the state is stinking like a outhouse what if confused people take to shitting between parked cars?????","commenter_a":"If you go in the bathroom with my daughter I will.","post_message":"These people are literally threatening murder on a public forum."},{"comment_id":"10154641640883145","commenter_b":"Yes 3 station, back in the day....... Family time is lost to the streets now.","commenter_a":"Its sad that some ppl don't have a life n wanna ruin it for everyone else","post_message":"Over the weekend they announced the circus would end in May. @webpagelink"},{"comment_id":"10155215673171337","commenter_b":"He better quit smoking crack with lamar odem","commenter_a":"Someone summon Bill Nye to drop knowledge on him.","post_message":"Um... what?"}]
