[{"comment_id":"10153391178593132","commenter_b":"And there's that mentality, \"if you're white you can't have an opinion.\" Yet we're the racist ones right? You do know every time you say that you shame someone of color who is dignified and intelligent, because they get lumped in with the likes of you.","commenter_a":"I don't like playing the race card!! But this is proof!!! Wow!! If she was Latin or a African American person! She wouldn't get off so easily! They shoot to kill us... Jt saying","post_message":"Ouyang told authorities that her behavior was a cry for help."},{"comment_id":"10153282421385779","commenter_b":"Eat a bag of dicks.","commenter_a":"White Privilege: Being held accountable for the actions of your ancestors by people who refuse to be accountable for the actions of thier children","post_message":"Late last week, Macklemore and Ryan Lewis released a new song called \"White Privilege II,\" featuring the poet and singer Jamila Woods. The song immediately inspired praise, scorn and conversation. Here are four things Macklemore told us about the track."},{"comment_id":"10157626698695603","commenter_b":"Stupid woman needs to be arrested .","commenter_a":"Thank God someone called the police and didn't just stand around videotaping it.","post_message":"Thankfully, the cats were not injured during the rampage."},{"comment_id":"817688164952017","commenter_b":"Chesimard is a scum pig who needs to be extradited back to NJ to finish her punishment.","commenter_a":"And they wonder why there is racism in American. They are the worst and the rest of us are reacting to this sort of crap and the disproportionate numbers of black's in prison. Clean up your own house first and quit committing crimes and we might actually start to listen. Until then FY.","post_message":"[Video] INSANE LIST OF DEMANDS BY BLACK COLLEGE STUDENTS Includes Naming College Hall After Notorious Cop Killer"},{"comment_id":"10155234645559199","commenter_b":"Kerri Andreson","commenter_a":"Janie Marsh","post_message":"A man in his 30s drowned at the Wild Waves theme park in Federal Way."},{"comment_id":"10153853920168145","commenter_b":"Athena Marigold absolutely","commenter_a":"Athena Marigold it's in the paper","post_message":"#BREAKING A shot fired during a domestic dispute hit new father Brian Mortensen as he worked on a nearby fence. On Wednesday, he died."},{"comment_id":"629437257246853","commenter_b":"All I can say she is a stupid bossy bitch. Wtf they need to be kicked out of the whitehouse on their ass and put in prison all the laws they have broken. Don't know why they haven't impeached him yet. It's not racist.","commenter_a":"ugly worthless nigger","post_message":"You'll never guess which word Michelle is trying to ban.  This is ridiculous. Michelle needs to be booted OUT of the White House immediately.  Would you be happy if Michelle was kicked out?"}]
