[{"comment_id":"987574278005491","commenter_b":"Killary for prison 16","commenter_a":"Very true, Hillary has been called horrible things not just by men but women to. HILLARY 2016.","post_message":"\"I don’t know that a man would be treated the same way that Hillary is.”   - Senator Bernie Sanders"},{"comment_id":"10153877660438812","commenter_b":"Wow, you're just full of fear. They're just people that want to use the bathroom. Get over yourself. No one wants to look at you or your ugly daughter anyway","commenter_a":"This just in! All teenage boys are claiming to be trans to gain access to girls' locker rooms.","post_message":"The DOE says an Illinois school district is violating the rights of a trans student by denying her access to the girls' locker room."},{"comment_id":"10154159520288037","commenter_b":"They weren't misbehaving.im sure this girl was engaging in the drama as well","commenter_a":"Should've gone home and put on a Trump for prison shirt. I bet you the administration wouldn't have a problem with a short bashing a conservative","post_message":"She says she was told to change her shirt or go to in school suspension for the rest of the day because her shirt caused a classroom disruption."},{"comment_id":"10153987601378908","commenter_b":"And another commenter who didn't read the article.","commenter_a":"And this is the article that should prove to all of you that collective evolution spreads bullshit ... Yellowstone has a big herd over 4000 bison .... And they are to slaughter 4-600 of them to prevent spread of disease !!!!!","post_message":"Park rangers have begun capturing wild bison in the Stephens Creek trap within Yellowstone National Park. Since Feb. 20, approximately 150 of America last wild buffalo have been trapped. According to park officials, all are destined for slaughter."},{"comment_id":"10153715295681336","commenter_b":"Nancy Pelosi ? What are you smoking?","commenter_a":"As a GOP Tea Party, it's the best news I have heard this whole year! This RINO had to go, he's dishonest, he campaign as a Tea Party Patriot and then became a Liberal hack as many of them usually do! When I saw Nancy Pelosi defending this clown, I knew we were betrayed.","post_message":"“It’s become clear to me that this prolonged leadership turmoil would do irreparable harm to the institution… This morning, I woke up and I said my prayers...and I decided, you know, today is the day I’m going to do this.”  Moments ago,  Speaker John Boehner announced why he has decided to resign this year."},{"comment_id":"10153541648111336","commenter_b":"Trump is in favor of obumercare or something like it.","commenter_a":"WE HAD AN ELECTION AND WERE PROMISED BY THOSE WHE ELECTED THAT THEY WOULD DEFUND AND REPEAL OBAMACARE they haven't done either or even tried looks like both sides are out to destroy us!!!!!TRUMP FOR PRESIDENT!!!!!!","post_message":"The first Obamacare-created insurer to go under could cost federal taxpayers up to $140 million, according to a new court filing."},{"comment_id":"579741315536254","commenter_b":"How is she a bigot? Because you disagree with her. She is speaking the truth. I don't like her method. She be out in front of the building doing this, not in the store.","commenter_a":"Biggest bigot I've seen so far. Who died and made her thee Almighty?","post_message":"The woman, a mother of 12, screams throughout the video and says that she wouldn't spend a penny at Target because of what she calls their \"wicked practice.\""}]
