[{"comment_id":"1096918067034607","commenter_b":"It's up to a woman if she wants to wear both rings or just 1 of the rings. She is married now so she has the choice","commenter_a":"I thought it was the plain gold wedding band that was important, not the engagement ring. That's why it's called an engagement ring. You don't have to wear it once you're married.","post_message":"Amal Clooney wants a smaller engagement ring"},{"comment_id":"10153321569596615","commenter_b":"The mask is part of hiding from an insecure woman so she can never find me again.","commenter_a":"Insecure women ruin more lives than drugs.","post_message":"\"Some people are commenting that she must be insecure or something, but it’s quite the opposite. People tell us we have the best marriage they’ve ever seen.\""},{"comment_id":"10153178663173854","commenter_b":"i think this has been going since christ was born these people have been fighting all this time","commenter_a":"Yes Sir on that one! God bless you","post_message":"Rev. Franklin Graham: Imagine the Outcry if 21 Muslims Had Been Beheaded by Christians"},{"comment_id":"10153677801340530","commenter_b":"Wow dicks can talk. .","commenter_a":"But, the SCOTUS said there is no racism in America.","post_message":"Community and city leaders are strongly condemning a racist flyer against blacks that was circulated in Southfield tied to an upcoming mayoral election."},{"comment_id":"1333179716775079","commenter_b":"Um isn't that the parents job? How is this not just instantly obvious?...","commenter_a":"Pssst......they only care about the fetus until the second it is born. When it is a child they lose all interest. They don't feed, clothe, vaccinate, educate, protect, nurture, house, inspire, enrich or love it.","post_message":""},{"comment_id":"10152740585827426","commenter_b":"You are happy a man is now dead? Does that make you better than him? If you claim that he was a bad man, how do u know the people he wanted dead weren't bad men too? I'm glad you find satisfaction in a human beings death like some sort of animal","commenter_a":"Heck yeah!","post_message":"An internal investigation into Shannon Crane’s death is underway."},{"comment_id":"10153339835009087","commenter_b":"Does this apply to Christian refugees too ?","commenter_a":"youtube title; William Blum - CIA murder and torture of Hundreds of thousands of people...use transgenders & lesbians deuteronomy 22:5 man should not wear the headdress of a woman & a woman should not wear the headdress of a man... youtube title; Collapse of Europe and the United States Of America ...vengence is mine say the living god psalms 104:16 of israel who's name is JEHOVAH deuteronomy 32:35 & romans 12:19-21..john hopkins mount sinai nyu medical bellvue hospital fraudulet med scam bill penis breath clinton irish shit god of luck death trap robert & patrick kennedy section 508 mental illness research nazi's... article title; The Clinton Crime Family...vengence is mine say's JEHOVAH the god of israel deuteronomy 32:35..bill penis breath clinton irish god of luck death trap section 508 disability... article title; Willie Lynch letter: The Making of a Slave...bill penis breath clinton great white satan irish god of luck ...","post_message":"“[Refugee children] are indistinguishable from any child in America,” President Barack Obama said. “The notion that we should somehow be fearful of them, that our politics would somehow leave them to turn our sights away from their plight, is not representative of the best of who we are.”"}]
