[{"comment_id":"10154315699286509","commenter_b":"No laws were broken She just happened to cross paths with a power hungry pig","commenter_a":"She also wouldn't have been in police custody if she were a law abiding citizen","post_message":"Bernie Sanders said that Sandra Bland wouldn't have died in police custody \"if she were a white woman.\""},{"comment_id":"10153780150441509","commenter_b":"That's nasty","commenter_a":"Shave your freakin pits.","post_message":"What do you think about the growing trend? The \"free to be hairy\" notion has caught the attention of some of Hollywood's most notable stars, too. @webpagelink"},{"comment_id":"10153977158805329","commenter_b":"Tia Guilbert","commenter_a":"@username this is me","post_message":"jump in! (via BuzzFeed Animals)"},{"comment_id":"1750223515225265","commenter_b":"The other video was funnier and because you didn't get as many likes as her shes a dumb bitch. That's what made this video suck","commenter_a":"She had fun so you call her a dumb bitch. This kinda attitude is what gives pro 2a a bad rap. That and the stupid shit the NRA says.","post_message":"Remember that dumb bitch who went viral for laughing at herself?  @drewhopkins has outdone her.  Shop.TacticalShit.com"},{"comment_id":"10153088404166770","commenter_b":"Yeah really. She's more worried about herself than anyone. More lies from Billary!!!!","commenter_a":"They only lose sleep about how to deal with Clinton when she is elected President!!!","post_message":"\"I would imagine that I’ve thought about what happened more than all of you put together. I’ve lost more sleep than all of you put together. I have been wracking my brain about what more could have been done or what should have been done.\""},{"comment_id":"10154303194092042","commenter_b":"Id take anyone over Hillary. Shes a liar, a deceiver and manipulator and its all on record.","commenter_a":"That is what Donald Trump gets for once again trying to go after Hillary Clinton. If he keeps it up, well then, it's absolutely over for him. No one, I mean, NO ONE, would ever trust Donald Trump as president of the United States. It just isn't going to work.","post_message":"#DeleteYourAccount: Hillary Clinton has had enough of Donald J. Trump's comments on Twitter."},{"comment_id":"10153842036026336","commenter_b":"Is that all....disgusting? We can rid the nation of this vermin if we decide to get together and do it.","commenter_a":"Oh he didn't misread anything. He knows exactly what's going on and it's all part of his agenda to destroy America. Disgusting.","post_message":"Charles Krauthammer said that Obama's strategy to fight ISIS is not working because \"he thinks radical Islam is a passing phase.\""}]
