[{"comment_id":"630472157108961","commenter_b":"@username you too bitch","commenter_a":"This is not a man.........he's a crazy kid........wanting notarization. Why not go after Obama who continues to destroy our country and it's citizens!","post_message":"Here is the man who tried to kill Donald Trump yesterday:"},{"comment_id":"1066337003492628","commenter_b":"The woman is delusional.","commenter_a":"That is exactly what they are afraid of, that he will do something that never could do or would do. They just want to keep the people dependent on the government and not be able to stand on there own two feet?","post_message":"Hypocrisy, thy name is \"Democrat.\""},{"comment_id":"10154580142688132","commenter_b":"Me too! Those hot mamas work for those bodies!!","commenter_a":"I personally loved it","post_message":"Fergie is making a statement!"},{"comment_id":"1227346897337998","commenter_b":"Idiot sick woman","commenter_a":"Good thing we have wikileaks and Project Veritas for the truth. Trump/Pence 2016 #draintheswamp #hillaryforprison #spiritcooking","post_message":"JAY Z said he doesn't have any \"ill will\" toward Donald J. Trump, but he \"cannot be our president.\" Before introducing Hillary Clinton onstage with Beyoncé at the Cleveland, Ohio, rally, Jay Z repeated this twice: \"Once you divide us, you weaken us. We're stronger together\" @webpagelink"},{"comment_id":"10153582261225950","commenter_b":"Making it easier to make the Darwin awards a picture book.","commenter_a":"Surprise surprise...another one bites the dust.","post_message":"There have been at least 49 selfie-linked deaths on record since 2014."},{"comment_id":"484838455040068","commenter_b":"Yes, ban Sharia Law in the USA","commenter_a":"I hope tsa patted her down throughly to make sure she wasn't carry bombs, I think the whole thing is a set up!","post_message":"She walked on the plane wearing her Hijab, boy was that a mistake.  Shariah Law is dangerous, we support the patriots that stand against it.  Should Shariah be banned in all 50 states?"},{"comment_id":"10152892448302894","commenter_b":"Guess she should be a chemistry teacher now!","commenter_a":"Damn shame","post_message":"Say What Now? Elementary School Teacher Busted for Having a Meth Lab in Her Home"}]
