[{"comment_id":"10153130654836973","commenter_b":"Having read the Koran and the bible, it's clear that ISIS is justified by their faith. And so where the bigoted bakers, Faith is not an excuse to treat others poorly. You say murder is never okay yet both books are full of it. You are intolerant of both the bible and the Koran. Yet you somehow think a bigoted bakers faith is an excuse? That's a double standards","commenter_a":"The intolerance level for religion on this thread is too dang high! Get yourselves together. If you're going to claim \"BE TOLERANT\" to things, you gotta be tolerant to religion also. They will always exist. There will always be someone or some thing to worship or praise. Spirituality is a great thing. It brings positivity to people's lives. There's nothing wrong with that.","post_message":"But the story isn't as simple as nature versus religion, experts say."},{"comment_id":"10153544235856880","commenter_b":"My money is on Donald getting it done.","commenter_a":"Trump 20 16. Yes they will I am business man and I know I would make them pay it. Cost 30 billion","post_message":"Sorry, Donald."},{"comment_id":"1859752354244114","commenter_b":"She is very stupid...and very mixed up..crazed..","commenter_a":"FUCK-YOU,YOU LYING ESTABLISHMENT PIECE-OF-SHIT...THIS BOOTLICKING PUBLICATION ISNT EVEN WORTH WHIPING YOUR ASS WITH...NO RIGHT-MINDED UNDIVIDUAL/FREETHINKING PERSON CARES ABOUT THE PARTISAN-CORRUPT GARBAGE THAT YOU CREATE OUT OF FABRICATED LIES...SO,GO SHOVE YOUR HEAD RIGHT BACK UP #MADAMEINMATE666'S FATASS AND QUIT PRETENDING TO BE A JOURNALIST PUBLISHING NEWS...FUK-OFF.","post_message":"It’s official now: Jill Stein—and the Green party if it agrees with her—is/are a waste of space.  By Daily Kos user BoGardiner"},{"comment_id":"10153283544784170","commenter_b":"Stick the crust between her buns. She'll never know.","commenter_a":"Straining so hard to see what isn't and not see what is. Sad.","post_message":"A word of advice to the legacy media:  If this is the best the Clintons can do with their \"re-branding exercise,\" you should jump ship immediately.   ...Because this is absolutely pathetic. VIDEO."},{"comment_id":"10155993779265389","commenter_b":"Carson and Fiorina PERIOD","commenter_a":"Dr. Carson","post_message":"From fiery criticism of ObamaCare and the Iran nuclear deal to support for Israel and the rights of the unborn, the top 10 Republican presidential candidates did all they could to define and separate themselves Thursday night during the Fox News debate in Cleveland, Ohio.  Who do you think won?"},{"comment_id":"1767519713512114","commenter_b":"She's a joke","commenter_a":"She is running the lowest, dirtiest campaign in USA history","post_message":"Clinton to voters: \"Reject the dark and divisive and hateful campaign that is being run by my opponent.\" What do you think?"},{"comment_id":"10154973446391509","commenter_b":"Shuttt up!!","commenter_a":"This is not fair because Turkey had an explosion in the airport today with few deaths and few injured. But yesterday in my country Lebanon had 6 to 7 suicide bombings through out the day in less than 24 hours in one village called Kaa which is a Christian village with 5 deaths and 28 injured some are deadly injuries. And there was not one news coverage of that.","post_message":"BREAKING: Explosions and gunfire reported at Istanbul’s Ataturk Airport, the Turkish interior ministry said @webpagelink"}]
