[{"comment_id":"1072525059447912","commenter_b":"Well actually Tara bring em all to your house ok AMERICA FOR AMERICANS !","commenter_a":"Correct me if I'm wrong but majority is suppose to rule in AMERICA and you only have 4 States that want these people and 20 that don't keep them the F out of America !!! AMERICA FOR AMERICANS !!!","post_message":"\"There is absolutely no constitutional power for a state to exclude anyone from its territories,\" said one legal scholar."},{"comment_id":"1466756690087245","commenter_b":"Flynn has resigned!!!","commenter_a":"IMPEACH TRUMP NOW","post_message":"\"I think this guy is somebody who might want to think twice about whether he stays in the position that he has.\" -- Bernie Sanders"},{"comment_id":"10154165020726943","commenter_b":"Hillary, you look really tired. Even with all that makeup on. Just think how tired and hot you'd be if you were in Louisiana now like Donald Trump. Think how tired you would be if you had his schedule. Think how exhausted you would be trying to be President every single day. Please just give up now. With all your money, wouldn't it be nice to just stay home and spend time with your grandchildren?","commenter_a":"keep up the good work","post_message":"A federal judge in Washington, D.C. ruled Friday that Hillary Clinton must answer written questions from a group that filed a lawsuit over her private email server.  Lawyers for Judicial Watch, a conservative government watchdog organization, asked to interview her under oath as part of their Freedom of Information Act lawsuit against the State Department. - via NBC News"},{"comment_id":"10155014119221178","commenter_b":"Democrats have always gotten away with MURDER!!","commenter_a":"Accountability was not a word he knew--or enjoyed.","post_message":"Talk about a major understatement from The Daily Beast."},{"comment_id":"988047007995144","commenter_b":"She's just womansplaining to him","commenter_a":"That stupid bitch next to him needs to respect other people's turn to speak. How are you going to disrespect another adult like that on national tv? Shushing him?? What a fucking cunt","post_message":"I've literally watched this about a dozen times now (and it gets better every single time)..."},{"comment_id":"977002452335214","commenter_b":"Slaves","commenter_a":"the American people need to rebel against this. Citizens of a nation( especially one a great as america) should not have to live in fear of police persecution. The whole police force needs reform. The dirty cops, racist cops and just dam right bad police officers need to go. If your a trigger happy racist peace of shit who hides behind a badge and a gun to only parade around saying your a protector of peace, you need to be weeded out. Police in america don't know how to be police. Other countries around the world have polices forces that can control far greater numbers than america and without the casualties.","post_message":"Very disturbing video shows police killing a restrained man with three shots to the back."},{"comment_id":"10152869358831336","commenter_b":"We should get rid of the Kkk. This is not their land either.","commenter_a":"We should Deport Obama and his Kind back to Kenya or where they all came from this is our Land Not their's!!!","post_message":"In Thursday’s Talking Points Memo, Bill O'Reilly asked: where is America's policy to fight the Islamic jihad?  Watch and weigh in: @webpagelink"}]
