[{"comment_id":"1751204798479851","commenter_b":"thiswoman has onebrain cell and it dont work","commenter_a":"If Nancy had a brain her Face Lift wouldn't Sag So b","post_message":"Nancy Pelosi blasted her Republican colleagues for not taking action on gun control, saying after every shooting there is a moment of silence, which means nothing without action. Pelosi states \"a moment of silence just left there is a moment of denial.\" Do you agree?"},{"comment_id":"10153363200377452","commenter_b":"Praying for the family, so heartbreaking.","commenter_a":"So sorry can't imagine the pain their families","post_message":"HEARTBREAKING: Just a few months after his sister died from leukemia, a distraught teen was struck and killed while riding his bike by a hit-and-run driver."},{"comment_id":"10154542806314497","commenter_b":"Andrew Wright","commenter_a":"This title Matt Strzalkowski","post_message":"Via ClickHole:"},{"comment_id":"10153528994604641","commenter_b":"What's up with her fingers?!!!","commenter_a":"Karolynn Cevidanes","post_message":"Taiwan puts porn star on metro cards. They sell out."},{"comment_id":"1684251881603765","commenter_b":"Both if possible. The Press. Too much disregard for the truth.","commenter_a":"Can we drain them together ?","post_message":"Which swamp would you drain first?"},{"comment_id":"10152776407520047","commenter_b":"Good someone see him for what he is , wake up. Before its to late .","commenter_a":"Thank you ACLJ","post_message":"Today, a federal appeals court upheld a previous ruling against the Obama Administration's unconstitutional Executive overreach.  Impatient Presidents don't get to change the law. READ MORE."},{"comment_id":"460760697382304","commenter_b":"Ummm... Not sure what that has to do with the U.N. but ok.","commenter_a":"The UN has been one of the greatest propaganda tools in history! They serve no actual purpose other than releasing statements from time to time with the appearance of having morality supporting it.","post_message":"The UN commission claims that Israel exercised \"great restraint\" while bombing elementary schools in Gaza which resulted in the deaths of 519 Palestinian children last summer."}]
