[{"comment_id":"10152885307051336","commenter_b":"Totally totalitarian and just plain wrong","commenter_a":"Start pushing back people!!! They care nothing about your kids.","post_message":"UPDATE: The Goochland County School Board has now voted down the controversial policy on religious homeschooling. @webpagelink   Virginia parents are outraged over a new policy that demands home-schooled children justify their religious beliefs to a school board within 30 days of their 14th birthday."},{"comment_id":"1510863505601322","commenter_b":"Probably the shittest article to ever feature on ifl, absolute horse shit","commenter_a":"Read the article! It should say vitamin pills are not necessary, a balanced diet provides all you need","post_message":"Some vitamins can actually be dangerous - but these are the ones worth taking, according to the available evidence."},{"comment_id":"670200283170550","commenter_b":"Yeah,Yeah,Yeah...I keep hearing this on FB but NOT anywhere on any news network....I just HOPE this true and NOT a fantasy!","commenter_a":"The sooner the better!!! Hopefully he will take Biden, Kerry, Pelosi, Killary, Harry Reid, Al and Jesse with him when he goes. Preferably out of the country. Let them go live with the Muslim terrorist that they love so much.","post_message":"Obama's time in the white house could be coming to a screeching halt.  This is the best news of the year. Get rid of him.  Would you be happy if Obama was forced out of office?"},{"comment_id":"1207167835973058","commenter_b":"It's not true for entrepreneurs but workplace","commenter_a":"What if this statistic isn't true? Check out what John Stossel uncovered: @webpagelink","post_message":"Kristen Bell introduces Pinksourcing, where women are a bargain at the workplace, since you only have to pay them 77 cents on the dollar! It's the first episode of our new series, #CelebsHaveIssues."},{"comment_id":"778536202281765","commenter_b":"Lynette Houdek You really need to take a class in comprehension. Trump said he would renegotiate the trade deals so America gets a fair deal. You speak of the Colorado fiasco. What is crooked about it is that they locked the Trump delegates out and removed their names from the ballot. That is called rigging the election. Please take the class I suggested.","commenter_a":"Krauthammer, you think Cruz could handle China. Trump has done business with the Chinese. He know's what he is doing. The business in Colorado is a disgrace. Trump delegates were turned away and their names scratched off the ballot. Does that make you proud of our \"Banana Republic\"???","post_message":"Is Krauthammer right?  WATCH:"},{"comment_id":"1673680616215825","commenter_b":"Stop letting this mother fucker control our future","commenter_a":"Nope","post_message":"Obama Gives 1.5 Billion Dollars To Muslim Brotherhood For THIS SICKENING Reason.  This shows you where his allegiance really lies.  Do you think Obama is a traitor?"},{"comment_id":"1741083142832713","commenter_b":"She plagiarized!","commenter_a":"Keeping it classy!","post_message":"\"On July 28, 2006, I was very proud to become a citizen of the United States – the greatest privilege on planet Earth.\"  Melania Trump, wife of presumptive GOP nominee Donald J. Trump, spoke about her pathway to U.S. citizenship and thanked veterans who protect the freedoms we enjoy as Americans. @webpagelink"}]
