[{"comment_id":"1620932058215182","commenter_b":"Cse'Doobie Major bruh.. she can blink and ash that bih","commenter_a":"Brittlynn Jacob Ygnacio","post_message":""},{"comment_id":"10153032834297452","commenter_b":"I was waiting for Hillary Clintons campaign team to do this, desperate move. The army rangers officially lead the way of u know what. Ooooo rah to the hoooo ya","commenter_a":"Well done!!","post_message":"U.S. Army Capt. Kristen Griest (left) and U.S. Army 1st Lt. Shaye Haver (right) will graduate Friday at Fort Benning, Georgia along with 94 men. They will be the first women to graduate from the Army's notoriously grueling Ranger School. @webpagelink  Griest said her successful completion of the two-month program shows that women \"can deal with the same stresses and training that men can.\""},{"comment_id":"1377436272296841","commenter_b":"Go girl.","commenter_a":"Iowa thanks you Hillary! God, what an embarrassment King is to our great state.","post_message":"Clinton isn’t letting this bigotry go unnoticed."},{"comment_id":"10154266616104714","commenter_b":"@username hey wanna help us build the wall when trump gets elected","commenter_a":"Good you can celebrate without my dollars goodbye target fn libtard fruitcakes","post_message":"\"Inclusivity is a core belief at Target\" said the retailer in a statement. \"It's something we celebrate.\""},{"comment_id":"1041402059258074","commenter_b":"But Brandon. . .who do you think PAYS for their jail time? You do and are you willing to pay for all illegal's jail time along with all the criminals we already have in our prisons?","commenter_a":"Why we would give anything to a illgale alien is news to me.don't get me wrong immergration is great if done legaly. All illeagle aliens need is about 5 years in prison then immeaditly deported.","post_message":"Ready for Americans to put American priorities first!? It's that easy!  FOLLOW US!----> Freedom Daily"},{"comment_id":"979292718775058","commenter_b":"Y hell yeah. I know is I do stupid stuff I would be locked up. She should be treated the same. That don't mess with her because she has money. The poor folks pay the price. The rich walk around like that are untouchable. It bs.","commenter_a":"False!","post_message":"BREAKING: FBI Finally Makes Move To Arrest Hillary Clinton…   Her time is coming to end. Say goodbye.  Would you be happy if Hillary was arrested?"},{"comment_id":"10153465913933145","commenter_b":"Your mom took the time to raise you right....take the time to raise your children right !","commenter_a":"This kid didn't have to go thru this were was the mama, I hope the kid has been taken out of the home? Why did the grandmother didn't do anything for the girls. We live in a crazy world?","post_message":"A father is facing child abuse and drug charges after police say he beat his daughter because she didn't get enough candy while trick-or-treating."}]
