[{"comment_id":"10154376028466509","commenter_b":"He's dead lady.","commenter_a":"Biden would be a better president than Hillary.","post_message":"President Barack Obama presents \"four big questions that we as a country have to answer \" during his State of the Union address.   #SOTU updates: @webpagelink"},{"comment_id":"465186890273018","commenter_b":"This....this is brilliant lol","commenter_a":"No this nation was bast of God an build around it get it right dumbass","post_message":"The Anti-Media radio show is live at NOW! Listen from your computer or phone here: www.UCY.tv/TAMR  Call in and join the conversation: 1-718-717-8296  via Murica Today"},{"comment_id":"1088733604470282","commenter_b":"If these teachers are not immediately fired, you can assume that there is something pretty sinister going on at that school. And just where are they getting their lesson plans, and who is allowing this?","commenter_a":"Muslims are the fastest growing bloc of Immigrants published by the Center for Immigration Studies. Also another study by American Community Survey (ACS) finds that foreign-born population in the U.S. hit a new record high 42.4 million in July 2014. Since 2008-2013, according to (ORR) Office of Refugee Resettlement, U.S. has admitted 115,617' Refugees from the Middle East and granted another 10,026 asylum. Granted Green Cards to 308,805 immigrants from the Middle Eastern countries identified by ORR as Refugee Nations making them lawful Permanent resident (LPR`s) eligible for citizenship in [5] years and petition their family members to come to the U.S.. Middle Eastern Refugees are immediately eligible for Public benefits -to the U.S. particularly the Syrian Refugees. ORR defines asylaes from the Middle East as being: Afghanistan, Iran, Iraq, Jordan, Kuwait, Lebanon, Saudi Arabia, Turkey and Yemen. As of 2013, top ten Countries for admission to the U.S. were ...","post_message":"Middle school instructs students to create ISIS propaganda"},{"comment_id":"10153488967916336","commenter_b":"He does not love America, he should be removed from office. The President has a sworn duty to protect the Constitution and the People of this Republic which he never has. He serves illegals, thugs and his fellow Muslims.","commenter_a":"they served our country they need respect but cannot change stupid","post_message":"\"This administration’s decision on who gets memorialized and who doesn’t is puzzling,\" Todd Starnes wrote."},{"comment_id":"10156253683750594","commenter_b":"Tickets better get cheaper!","commenter_a":"He got too confident and thought maybe too good and should have stayed a little more humble and kept his head down in his work. But the whole team was over hyped these last two seasons","post_message":"Just three years ago, Colin Kaepernick was considered the prototype for the quarterback of the future."},{"comment_id":"10153189678699342","commenter_b":"Its just a restrainin b device the kid will learn to be still nithing wrong here ppl get upset about anything ive had to ohysically jold my 18 month old down to get his shots this would have been better","commenter_a":"There is the option of oral sedation.","post_message":" couldn see my kid in the body bag just strapped down to the bed, I couldn handle it.\"  A man heard his daughter screaming during a dental checkup and then found her like this: Restrained in place with a device known as a \"papoose board. It's legal for dentists to use them."},{"comment_id":"1244894375530590","commenter_b":"all the illegals are not accounted for, so this is false!!!","commenter_a":"Hope it's true","post_message":"There was one big reason for leaving."}]
