[{"comment_id":"1048025435218467","commenter_b":"Lol I really do it's weird, this morning I saw white gold but then it changed and has been black n blue since haha!!!","commenter_a":"I see black and blue","post_message":"And no, it's not magic."},{"comment_id":"10153223686721336","commenter_b":"Why is she still walking around and not in an orange jumpsuit?","commenter_a":"Is she resigning? That would help B'more get better.","post_message":"Moments ago, Mayor Stephanie Rawlings-Blake said Baltimore will get through the devastation of the last few days and that the city will only get better."},{"comment_id":"1016358938401725","commenter_b":"MONEY !!!!! That's all they care about !","commenter_a":"probably worried about all the money they have stashed in offshore funds they may have to pay tax now","post_message":"\"I don't think I've ever wanted magic more.\" J.K. Rowling, James Corden and more British celebrities react to the historical #EURef vote. @webpagelink"},{"comment_id":"561569204031372","commenter_b":"Sounds like grounds for a great law suit.","commenter_a":"I absolutly think it's wrong. Who has the right to tell someone to take of the flag when it fly's high and proud for our country. I'm proud to be an American but absolutly hate our govt.","post_message":"lorida Man Fired For Refusing To Remove His American Flag Pin  This man is a patriot, we live in AMERICA.  Do you think this is wrong?"},{"comment_id":"10153401880031336","commenter_b":"Way to show tolerance","commenter_a":"pft just toss it in the garbage with all the other religious hog wash biblical nonsense!","post_message":"Police have recovered a relic believed by some to be the Holy Grail – the cup Christ drank from at the Last Supper."},{"comment_id":"10153508194124087","commenter_b":"Paid shills","commenter_a":"Twenty-six years ago when Savvy Woman ran him on the cover, four of the eight people in Trump innermost circle were women, including his then wife Ivana, who was not in any of these particular photos but who was running the Plaza Hotel at the time. The others, all executive vice presidents, were: Barbara Res, who was in charge of construction of Trump Tower and then the Plaza; Blanche Sprague, head of project development; and Susan Heilbron, who was Trump chief lawyer.","post_message":"“Nobody has more respect for women than I do,” Donald J. Trump said. “Thirty years ago I had a woman building a major construction project in New York City. That never happens. I’ve been great to women and they’ve been great to me. I’ve had so many women executives [and] they’ve done a great job.”"},{"comment_id":"10153857549396157","commenter_b":"Illegals? All I see are people trying to make a living to feed their families.","commenter_a":"Funny just realizing that? Been happening since for ever. What's worse is our own Mexican Americans doing that to them. No shame.","post_message":"'ve realized that [employers] prefer us for being undocumented because we just keep our heads down to get jobs. [We] can't afford to complain. They take advantage of us being undocumented."}]
