[{"comment_id":"859334654119032","commenter_b":"Btw, military grade doesn't always mean what you think it means.","commenter_a":"There is no such thing as an assault rifle. It's a made up term to scare ppl.","post_message":"DEVELOPING - Father of Patient Takes Hostages at Houston Hospital with Rifle   Hoping for a peaceful resolution."},{"comment_id":"10153103899511336","commenter_b":"HEHEHEHEHEHEHEHEH YEP THEY DO BELIEVE WE THE PEOPLE ARE STUPID\" WHAT A INSULT TO OUR INTELLIGENCE GRRRRRRRR....@webpagelink","commenter_a":"I didn't vote for obama or agree with any of the daily mistakes this administration makes. With that being said, we the people must find a way to be heard and stop any deal with Iran. Our congress can't let one man with no foreign policy skills, put the world in danger. Everyone knows that Iran can't be trusted and after the Bergdahl disaster, can we trust Obama.","post_message":"The U.S. is considering letting Iran run hundreds of centrifuges at a once-secret bunker in exchange for limits on centrifuge work and research and development at other sites."},{"comment_id":"975822185786810","commenter_b":"@username...I never have been a democrate I'm an independent. I chose the best man/woman for the job. And without the independent vote...hrc will lose. So...tell me again HRC is gonna be Prez, cuz it's not gonna happen without us and my fellow Bernicrates","commenter_a":"Yet you lose to Trump. All numbers say he will wipe the floor with you! BERNIE is the only one to Win against all GOP. Numbers show it. And he's winning national polls. I WILL NEVER CAST A VOTE FOR YOU...EVER","post_message":"Know someone in South Carolina who’s not sure who to vote for today? Share this."},{"comment_id":"10153259409494060","commenter_b":"Having engaged in a few discussions on the subject of party politics, I think the results of this quiz might suprise some of you. Go on give it a go.","commenter_a":"Could be good if it was resposnsive!","post_message":"Attention all eligible Britons! Not sure how to vote in this year's election? Take our election quiz: a blind test of the parties' policies. Then get yourself to a booth on May 7th @webpagelink"},{"comment_id":"10154690577255329","commenter_b":"Yeah, like. Hey white girls: YOU ARE FREAKING EVERYWHERE. Chill.","commenter_a":"Please don't come on here saying white girl magic and all prom dresses are beautiful cause i swear to god.","post_message":"#BlackGirlMagic is real."},{"comment_id":"10157626698695603","commenter_b":"Stupid woman needs to be arrested .","commenter_a":"Thank God someone called the police and didn't just stand around videotaping it.","post_message":"Thankfully, the cats were not injured during the rampage."},{"comment_id":"10153333676096680","commenter_b":"Yep, karma is a bit*h !!","commenter_a":"This is the best election ever! The irony of Republicans being upset about the Pope questioning the religion of a politician is absolutely overwhelming...considering the constant questioning and outright ignorance about the faith of President Obama. And do not get me started on them running a Canadian after 8 years of racist birthers.","post_message":"He's mad."}]
