[{"comment_id":"392182107608412","commenter_b":"He had a gun in front of him , h9w do you know his hands were uo you cant see shit . You fuckers are stupid to believe that its the cops fault or the military fault if not for either you fucking scumbags wouldnt have a place to trash , rob and i really can care less if you dont cosider me a fellow american if you believe that fuck was innocent your as bid of a piece of shit as he WAS dont even call yourself an american you fucking soft liberal scumbag go catch a bullet.and if you th8nk i cant handle a weapon then come up to ny and find out get the fuck out of my country and go fuck your allah in the ass","commenter_a":"Dont hate the cops, hate yourselves for breaking the law and being to stupid and lazy to get a job","post_message":"\"I ain't doing nothing. I'm not reaching for nothing, bro.\""},{"comment_id":"10155405289876729","commenter_b":"@username I can respect that and pretty much agree.","commenter_a":"Anyone that takes the time to read this case will side with Ventura. Kyle bandwagon jumpers will say Chris Kyle was incapable of any wrong like Jesus. He made a mistake and his insurance was there for this very reason. In short, Chris Kyle should of never made up that story in the first place. I am disappointed with you @username.","post_message":"Finally."},{"comment_id":"591608484297524","commenter_b":"smh....","commenter_a":"John","post_message":""},{"comment_id":"1776189505982322","commenter_b":"dumb blonde","commenter_a":"You can't act like a 10 year old threatening to nuke someone if you don't get your way -- that's what Trump would do. Donald Trump doesn't have the temperament, the intelligence or the conscience to have these codes.#imwithher","post_message":"Republicans agree: We can't give Donald Trump control of our nuclear codes."},{"comment_id":"10153385776126323","commenter_b":"\"Studied film and literature\"... Bahahaha bitch please...you are obviously no intellectual titan","commenter_a":"Though at least as far as the so-called \"New Atheists\" go Dawkins - along with Daniel Dennett - actually has substance to what he says and knows how to contextualise his arguments (some of the time). Christopher Hitchens sounded like an intellectual but acted like a thug. And Sam Harris is frankly one of the most pathetic and risible writers to garner an otherwise intelligent audience in this century so far. Ego the size of a planet - with a humourless sense of his own importance despite the impotence and unoriginality of his work - without even the charisma of Hitchens or the intellect of Dawkins/Dennett to back it up.","post_message":"“How dare you force your dopey unsubstantiated superstitions on innocent children too young to resist? How DARE you?”  Is Richard Dawkins a hero, a heathen, or a liability?"},{"comment_id":"10152594345774071","commenter_b":"What girl with an f cup wants to wear a bra with half inch width straps? VS bras aren't comfy anyways.","commenter_a":"The bigger the size the harder is must be to line up the targeted areas with the proper tie downs ...","post_message":"Thousands of people have signed petitions calling for Victoria's Secret to offer sizes that fit more women."},{"comment_id":"859150960886345","commenter_b":"You weren't forced to come either bitch!","commenter_a":"It kills me that someone who is not even from America can say such racist crap @username. Just remember or learn about the history of slavery and the continued discrimination today from immigrants like you who wasn't forced on a boat to come here. It's because of African Americans you have the freedoms you have today. Please don't comment on something you know nothing about and actually learn about the injustices African American people are facing today. You sound just like these ignorant people who always got something to say behind closed doors. I guess you wouldn't know about white supremacy because you've bought in to this bs white people have taught you in America. I guess all the killings by white police is something new. You have no idea what it's like to be black and to get even immigrants being racist towards you the same immigrants Martin Luther ...","post_message":"The Debt Collection Industry Is the Epitome of Systematic Racism"}]
