[{"comment_id":"10153525353934170","commenter_b":"Hillary Rodham Clinton: Not qualified to clean my toilet.","commenter_a":"That picture looks like she has an empty head. Oh! That's Hillary Clinton! !!!","post_message":"CNN asks Hillary about tax policy, spending, the collapse of Greece, the Iran nuclear deal, the future of ObamaCare . . . just kidding! They didn't ask about any of this. They wasted almost the entire interview on trivial nonsense. The VIDEO will have you shaking your head."},{"comment_id":"10158098604455192","commenter_b":"Awww look at the snowflake. Upset because she can't find the safe room.","commenter_a":"Who really cares what these celebrities think.","post_message":"Streep noted that \"Hollywood\" is a reviled place. But in reviewing the backgrounds of several of her colleagues surrounding her at the Globes, she said that it's really a community filled with people from other places united in the mission to show different people and make audiences feel what they feel."},{"comment_id":"10153189347462550","commenter_b":"Filthy pig","commenter_a":"You almost wanna teach you child at home what's going on these days","post_message":"#BreakingNews - Former Cumberland County school principal David Edwards pleads guilty to sex offenses with students.  More here shortly ---> @webpagelink"},{"comment_id":"10153095720526051","commenter_b":"You poor sick woman, you must have never gone to school ever.","commenter_a":"Not saying what he did by any means was right.... But blacks are openly threatening to kill us everyday... The Black panthers said they were going to bomb white nurseries and how they need to rape and kill all white women and children. All this can be looked up. There are numerous hate crimes committed by blacks against whites everyday yet finally a white boy snaps and it's everywhere on fb and everyone wants him publicly hung. Obama is now pushing his gun control bs again over this but why doesn't he do that over the thousands of shootings everyday pointed towards the black on black crimes? Open your eyes people... I think you're all missing the much larger picture here.....","post_message":"Dylann Roof just confessed to the #CharlestonShooting. He says he had just one goal in mind when he opened fire."},{"comment_id":"10153580270695575","commenter_b":"If this is true, which I'm sure it is, how sick. But this is what the female liberals want. Oh is saying female liberals not PC?","commenter_a":"The Missing link!","post_message":"The Gateway Pundit - Muslim Dad Kills 4 Year-Old Daughter for Not Covering Her Head"},{"comment_id":"10153087733461350","commenter_b":"She is truly fit and very pretty but sorry I still do NOT think seeing a huge belly and huge belly button sticking out is that appealing. Pregnancy is a beautiful thing, but come one get some class. I know all of you that think showing everything is great will have a fit over my comment. But if people would be honest, see through material showing huge bellies with huge belly buttons is not that appealing. I guess nothing is supposed to be left to the imagination or in the bedroom. I have seen some very sexy maternity outfits and this is not one.","commenter_a":"When is Jenna due ? Amazing fitness ! Love all y'all !","post_message":"Do you have questions for our #startTODAY experts? Ask below!  Jean Chatzky, Joy Bauer, Jill Martin and Jenna Wolfe are taking your questions on money, diet, fitness and getting organized. questions."},{"comment_id":"10153694890631323","commenter_b":"What are black women always the ones who show so much ignorance","commenter_a":"If they aren't defined by it than why change your sex medically? Come on","post_message":"They could have made something positive, but the new Channel 4 series Girls to Men is demeaning to trans people on so many levels: \"Greater visibility for trans people should not mean even more close-up shots of genitalia and 'Ooh, don’t they look different – almost like real men' montages. It should be about taking the focus off surgery, suffering and sensation, because a transgender man is not defined by those things any more than the next person\""}]
