[{"comment_id":"10155218043119411","commenter_b":"But I am American...maybe its not just what is in your dna but what is in your ideals and thoughts","commenter_a":"Just because he lives in one of the countries of europe does't make him a European, Europeans are people just like Asians, Africans or Indians with roots and ancestry from the said places. If I moved to Japan I wouldn't automatically become an Asian.","post_message":"'He European, just like you. [He] has a university degree, a figure that you never have, and a beautiful wife at home (who is white and blond)'"},{"comment_id":"10154985023891192","commenter_b":"Because life on Earth is the only life we can observe and study, so it makes sense to look for other life within the scope of life as we know it. How could we even begin to look for other forms of life if we don't have a clue what to look for?","commenter_a":"I really don't understand the definition of \"alien life\" and why scientists think the environment needs to be remotely similar to ours to support \"life\". HUMANS need the right temperature and water.... \"aliens\" may not....??!","post_message":"BREAKING"},{"comment_id":"1665486166837473","commenter_b":"Globalization needs to be ended for this country. Fight against UN agenda 2021/30 with every breathe you have!!!!","commenter_a":"It's a new day the second revolution has come we are taking back America and there will be some changes around here.Joinn us or leave us it's your choice.","post_message":"Everyday patriots..."},{"comment_id":"10153290694163279","commenter_b":"Shut up.","commenter_a":"@webpagelink David W. Blight described the day: This was the first Memorial Day. African Americans invented Memorial Day in Charleston, South Carolina. What you have there is black Americans recently freed from slavery announcing to the world with their flowers, their feet, and their songs what the war had been about. What they basically were creating was the Independence Day of a Second American Revolution.","post_message":"As part of our Memorial Day special, watch this speech by former Rep. Pat Schroeder recorded at the conference, \"Vietnam: The Power of Protest.\""},{"comment_id":"841624465874895","commenter_b":"Feminazi to the ugly bone!","commenter_a":"Good for him, shame on his wife.","post_message":"\"When the doctor came out, he said 'there’s a real problem with your son.'\""},{"comment_id":"10153049017301323","commenter_b":"Leave her alone, can't we just all be pleased that Andy is through to the final. There were very tense moments in the match!","commenter_a":"Stone her","post_message":"F is for ferociously supportive, amongst other things.  What was Kim Sears saying to Andy Murray's opponent at the Australian Open?"},{"comment_id":"1096195137073807","commenter_b":"Why are democratic women so scary looking? See what lies do to your face?","commenter_a":"Obama praising himself Hillary looks like she needs to go to the restroom while being admired","post_message":"A note for 2016: the Democrats are the party that abandoned #Israel, enabled the rise of #ISIS and is now helping #Iran to get a nuclear bomb."}]
