[{"comment_id":"687880108038609","commenter_b":"of course they arn't all murders and gang members that's why the wall will have a door or did you miss that part in the cnn chopped up version of that speech? the ones who want to be Americans can stay the rest can f off.","commenter_a":"These comments are disturbing. These are parents, children, families...not murders, drug dealers or rapists. Instead of \"building a wall\" or treating them like shit we should be coming together with Mexico so that they don't need to come here. They need help, we have a problem, so why are the two countries not putting their heads together to figure out a way to HELP","post_message":"Thousands of Central American children and families are arriving in Texas."},{"comment_id":"10155455512331509","commenter_b":"Victim shaming is another way trump supporters are deplorable","commenter_a":"Ok time for JIMMY to come forward! Killery Klinton once fatshamed me at an OutBack SteakHouse in St Louis MIssouri! When eating i accidently flung my porkchop underneath her table where her dog was ( guess SHE is allowed to bring dogs). When i was wrestling the dog to get my porkchop back she called me a FAT idiot! #JimmyComesForward #FatShamerKillery","post_message":"Another woman is accusing Donald J. Trump of groping her, saying he allegedly put his fingers up her skirt"},{"comment_id":"551295498386832","commenter_b":"Hillary is crooked af it's the perfect excuse.. Get a life.","commenter_a":"Love you Bernie but I can't support your endorsement. I know you'll continue to do what you can from your position and if given the opportunity to support you I will do so. But it looks like I will have to change my vote to Trump this year. I will not support Hillary under any circumstances.","post_message":"Thank you, Bernie Sanders. Proud to fight alongside you."},{"comment_id":"1857903094453796","commenter_b":"@username AND U DON'T YOURSELF.","commenter_a":"Please leave MLK's son alone. Focus black people, stop criticizing on something or someone you know nothing about or the reason behind it. You do you. Keep out of everyone else's business! We're black/African Americans but we're individuals.","post_message":"He went off on the Civil Rights icon's son."},{"comment_id":"10156951027285725","commenter_b":"Redicous...sounds French.","commenter_a":"THIS IS REDICOUS","post_message":"Hold on to your $20s, they'll soon be a piece of history. @webpagelink"},{"comment_id":"1844278629192581","commenter_b":"Yep, only the melon and spice tips make sense.","commenter_a":"It's all a bounch of whooie! Put Kerry in the frig and forget about it!","post_message":"Check your fridge ASAP."},{"comment_id":"1354400067935066","commenter_b":"Just try it you fucking bitch! Just try it!","commenter_a":"PRESIDENT TRUMP, PRESIDENT TRUMP, PRESIDENT TRUMP!!!! WE THE PEOPLE SAID SO!","post_message":"Discuss.   SHARE THIS and FOLLOW US at Reverb Press and Stories That Resonate for progressive news and opinion that you can trust."}]
