[{"comment_id":"10153121748346615","commenter_b":"Ok. Let them run free then","commenter_a":"Start turning in the shooters.... It's that simple","post_message":"A call for peace and justice: Coming up on Channel 11 News at 6, see how dozens of residents in Homewood held a rally to honor lives lost to violence in the city."},{"comment_id":"10152740585827426","commenter_b":"You are happy a man is now dead? Does that make you better than him? If you claim that he was a bad man, how do u know the people he wanted dead weren't bad men too? I'm glad you find satisfaction in a human beings death like some sort of animal","commenter_a":"Heck yeah!","post_message":"An internal investigation into Shannon Crane’s death is underway."},{"comment_id":"10153197187718132","commenter_b":"The other woman is nuts and seriously needs to commit herself. She's making a bad name for herself doing stupid things like billing other children.","commenter_a":"Both parents failed here!! Poor kids.","post_message":"This is serious business."},{"comment_id":"10154189232436603","commenter_b":"Haaaaaaaaa am avut 12!!!!","commenter_a":"@username 11/18 sa vedem daca ma bati","post_message":"Quiz to be taken whilst listening to \"Smelly Cat.\""},{"comment_id":"1650724908525555","commenter_b":"Let's see, she and Obama, on one hand, want to take our guns, and on the other hand, want open borders of illegal aliens and possible terrorists to enter the Country. They are aiming to make all of America a soft target. Whose side are they on, anyway? Never mind, I think we know. Vote out all liberal, progressive, Democrats. Obviously, they are mentally ill.","commenter_a":"Gun control my a$$ - We ALL need to be armed!","post_message":"Wasting no time..."},{"comment_id":"1320166798020657","commenter_b":"You are Sooo Pretty, Young Lady!","commenter_a":"Why is right. Totally agree, Brandon!!","post_message":"TheBlaze news update with Sara Gonzales and Brandon Morse."},{"comment_id":"10153350644952212","commenter_b":"Bet it was you","commenter_a":"JhonnySSodas what you finess","post_message":"An Oklahoma City Whataburger was robbed at gunpoint early Monday morning #News9"}]
