[{"comment_id":"10153442792427232","commenter_b":"Have you seen all the arrest of that originations leaders?","commenter_a":"Much like their spoksperson...LoL","post_message":"The civil rights group approved the measure Saturday at its national convention in Philadelphia to end the boycott of tourism and other economic activity. STORY HERE: @webpagelink"},{"comment_id":"10155008790239214","commenter_b":"@username please educate me as to exactly how NM receipt of federal dollars will be affected by the senator's boycott of the inauguration.","commenter_a":"Please don't join that ship of fools boycotting the inauguration. New Mexico needs those federal dollars.","post_message":"The president-elect is taking to twitter this weekend to harass a civil rights icon and the Director of National Intelligence. I think we can all agree that is not how Donald Trump should be spending his time."},{"comment_id":"10156612932690354","commenter_b":"Washed up schmuck","commenter_a":"The difficulties were not due to him being black.","post_message":"WATCH Geraldo Rivera blame, well, YOU for Obama's failed presidency!"},{"comment_id":"847817905266758","commenter_b":"You people are a bunch of whack jobs!","commenter_a":"Any kind of animal","post_message":"AWFUL: A family who routinely fed a mother duck and her 11 ducklings said they watched in horror as a landscaper intentionally mowed them down:"},{"comment_id":"10154428619792144","commenter_b":"Kimberly, other than Melania Trump, you wouldn't know an illegal immigrant from a U.S citizen if your life depended on it. Get ahold of yourself woman!","commenter_a":"Seriously????? Let it go.....He's done, THANK GOD!!!!!! The end of an ERROR....","post_message":"Thank God."},{"comment_id":"10153478653615950","commenter_b":"Here come the pro-trump/Hillary is the devil comments. I stand by Hillary and will gladly vote for her in November. #Hillary2016","commenter_a":"She does not care, just wants them votes!!!","post_message":"Hillary Clinton  takes a swipe at Donald J. Trump's \"neutrality\" during her AIPAC speech: America \"can't ever be neutral when it comes to Israel's security or survival\" @webpagelink"},{"comment_id":"10154105809967908","commenter_b":"Feel the Bern! Gonna be the first time I vote thanks to this man Bernie2016","commenter_a":"Yes, it is appalling.","post_message":""}]
