[{"comment_id":"10155025508527577","commenter_b":"Ya genius. We don't want to pay for more illegals shit.","commenter_a":"maybe he just doesnt want to pay for someone else shit .. just like any normal person doesnt want to pay for anyone elses shit .. especially for something as stupid as a wall . didnt work for china back when they made one what makes you think itll work today.. there will always be someone smarter than the measures put in place to stop advancement ... explosives arent hard to get in mexico especially if you are a well connected cartel ... people will be getting killed while the wall is being built kidnapped and the likes the wall if stupid for so many reasons .. just increase personnel and the available resources to combat the problem and it will in turn become easier to manage the flow of illegal immigrants coming in ... and if you think we as the u.s. government doesnt profit off cartel youre dumb","post_message":"The Mexican President was funded by the Juarez Cartel and that’s why he is against the Trump border plan:"},{"comment_id":"650948841696821","commenter_b":"Yup","commenter_a":"@username smh crazy sheeeet","post_message":"Damn."},{"comment_id":"10155873946605354","commenter_b":"Ass wipe.","commenter_a":"Because he's a Libtard","post_message":"Why would a Cuban rapper take offense at remarks against crime by Mexican illegal immigrants?"},{"comment_id":"1167920019941418","commenter_b":"@username and real men don't use emojis to other men over the Internet","commenter_a":"Donald trump used to endorse boxing a lot. That's why don king and Tyson support him. They actually know him instead of judging him based on the Internet and tv","post_message":"#DonKing is advocating for #DonaldTrump now! #WSHH"},{"comment_id":"10154786679373984","commenter_b":"What a shame that this ladies after so many many years will fall for Hillary's BS and the press that are now panicking cause things are getting worse to them and the campaign. Keep wondering how much money is floating around to pay all this people that suddenly have brought this stories and this will continue until Election Day, desperation is the mother of FU. \"GO TRUMP \"","commenter_a":"There is no one that is for Trump that is going to believe this. If it was true theses (ladies) would have spoken up sooner, so you see you people are not talking to morans as you think.","post_message":"Michele Bachmann has gone on national radio and revealed what happened to her when Donald J. Trump hosted her for breakfast -- alone -- in his penthouse.  Every American needs to hear her story. It says a LOT about Trump..."},{"comment_id":"10153610330463132","commenter_b":"Scum","commenter_a":"This concept of if someone slap you and you give your other cheek instead of smacking back doesn't apply here. He killed 9 innocent, unarmed and specifically in a worship place, the crime is much bigger and what is the guarantee he won't do it again??? So no mercy, or leniency must be shown to deal with this BABY-CUT apparently innocent looking monster....","post_message":"\"You have killed some of the most beautifulest people that I know And it will never be the same. But as we said in Bible study, we enjoyed you. May God have mercy on you.\" #CharlestonShooting"},{"comment_id":"10154024532730950","commenter_b":"Yes, those woman do.","commenter_a":"He is right. A rapist and an evader of taxes like him, is running for president and might win. Indeed, a third world country.","post_message":"“Folks, we’re living in a third world country,” said Trump while talking about Clinton’s emails. @webpagelink"}]
