[{"comment_id":"763776567072060","commenter_b":"F**k em both... Let's \"take em out\" ....","commenter_a":"Anyone who couldn't see this before is blind. Those two have always been allies.","post_message":""},{"comment_id":"10153509889673132","commenter_b":"Is there a required dress code? Why are both women wearing the exact 2 shades of blue?","commenter_a":"I thought the Queen always wears a hat in public. I'm surprised to see her here without a hat. I love the Queen.","post_message":"Prince Harry and Queen Elizabeth II make quite the team!"},{"comment_id":"10153814688651337","commenter_b":"Fox might dump it if these rating keep up.","commenter_a":"Nah since fox has money.","post_message":"YIKES!   This big ratings drop should concern all Family Guy fans..."},{"comment_id":"257235498048585","commenter_b":"BYE BITCH!","commenter_a":"When we get to the \"Stupid\" ones...your name will be among the first !!","post_message":"NY-Born Governor: 'If There is a Move to Deport Immigrants, I Say Then Start With Me' [VIDEO]"},{"comment_id":"1084559504898393","commenter_b":"It altars your natural hormomes! Explains why there are so many beta bitches running around. Wonder if the artificial hormones affect future children somehow too","commenter_a":"@username 😬","post_message":"Could the pill be altering your brain?"},{"comment_id":"927870117281087","commenter_b":"How many illegitame grandkids does it take to keep her quiet","commenter_a":"I'm with you Sarah","post_message":"Sarah Palin goes off on Obama to his face. What a woman. Let's show her our support. Can we get 10,000 'LIKES' for Sarah Palin's stand against Obama?"},{"comment_id":"10155528648886729","commenter_b":"Let those people lose a day's wage and let those business' lose a day's earnings. Who cares. We should have no illegals working, instead the long term welfare kings and queens should be working to earn those welfare checks.","commenter_a":"I have a question. If all the Chavez supermarkets, which the Hispanic community supports by shopping there, closes for the day where will a mother go to get that gallon of milk she needs? Also, will the supermarket pay any employee that doesn't work today?","post_message":"Oops."}]
