[{"comment_id":"10153436202258855","commenter_b":"No a chick with a dick Courtney Danielle Banks","commenter_a":"That one ugly dude","post_message":"Go get 'em, Vanessa!"},{"comment_id":"10154156813446926","commenter_b":"It is indeed a colony of the US, and it cannot survive without Billions of dollars of aid from their masters. Israelis should decide what future do they want for their children, one in which they are perpetually fighting a war, or one in which they can make peace and learn to live with mutual respect. --- As far as ethnic cleansing is concerned..this is again the same issue. It is only ethnic cleansing when the Jews are forced out of their homes, it is not ethnic cleansing when ZIonist militants throw out Palestinians from the homes they were living in for centuries.","commenter_a":"The way I see it Israelis will be in the Palestinian villages for a long time..... society whose leaders campaign for a convicted terrorist to be given the Nobel Peace Prize, a society that teaches its children hatred and violence as part of its standard curriculum, a society that unabashedly teaches anti-Semitism through all means available, a society that puts suicide belts on children during political celebrations, a society that honors, glorifies and funds terrorists, a society that uses a hateful version of religion to poison the minds of its children, a society that engages in widespread jubilation when Jews are victims of terrorist attacks, is not a healthy society that can develop peace of any kind.","post_message":"#Israel's occupation forces in the #WestBank have used at least three Palestinian family homes as military posts in recent months"},{"comment_id":"10154941890619705","commenter_b":"Yeesh and I feel bad for my soy chai latte. I can't drink milk so its soy but I still feel bad about a special order. Not anymore!","commenter_a":"Melissa Lane","post_message":"And you thought your Starbucks order was complicated."},{"comment_id":"573261456173658","commenter_b":"Praying for you Dr.Carson you can do this","commenter_a":"they don't persecute christians alone. innocent people of all faiths and lack of faiths are persecuted, i think its wrong to focus on only the christian victims","post_message":"Our country faces grave national security threats. We must act boldly and decisively to protect American citizens from terrorists at home and abroad. We can no longer dawdle while ISIS continues to persecute Christians, enslave young girls, oppress civil societies and perpetrate terrorist attacks against the free world. We must destroy their caliphate and prevent their terrorists from infiltrating our homeland. We must also secure our borders, identify radical Islamic extremism by name and root out its agents and collaborators in our own country. My \"Seven Steps for a Safer America\" offers a path forward for confronting these threats and protecting this great country.  1. Congress should immediately issue a formal declaration of war on the Islamic State, which is also known as ISIL or ISIS.  2. The United States should lead the immediate formation of – and provide substantial advisory, financial and military support to – a military coalition in the Middle East to wage war against ISIS. Such a regional coalition would consist of countries such as Egypt, Saudi Arabia and Jordan.  3. The United States should urge its allies and partners in the Middle East to engage in massive recruitment and training of Sunni Syrian men based in Saudi Arabia and the Gulf and of Sunni Syrian male refugees in Jordan – to establish a military force to destroy ISIS and to establish a protection zone for the victims of the terrorist state.  4. The United States should deploy its military resources and work with moderate Arab nations – as well as extend strategic support to Kurdish, Christian and Sunni tribes in the free al-Hasakah Province in northeast Syria – to establish a refugee safe zone in the Province. All refugees should be directed to that free area and to other liberated areas later, and be put under international protection.  5. Congress should immediately establish a war-time emergency visa and immigration policy; establish an emergency inter-agency task force to review all visa and immigration policies; and limit visitor visas to three months with mandatory check-ins for extensions no longer than three months.  6. President Barack Obama and Congress should immediately deploy the National Guard and military troops to patrol the U.S. southern border as well as designated spots along the northern border.  7. The Department of State should designate the Muslim Brotherhood and other organizations that propagate or support Islamic terrorism as terrorist organizations, and fully investigate the Council on American-Islamic Relations (CAIR) as an offshoot of the Muslim Brotherhood and a supporter of terrorism."},{"comment_id":"453039741550986","commenter_b":"Pretty and can shoot too !","commenter_a":"This maybe my new favorite person,what a gal!!!! She has more balls than the entire dem party,and half the repubs too!!! Thankyou girl!!!","post_message":""},{"comment_id":"10153884127193854","commenter_b":"I do not now abut you ..but me ? I am jew ...","commenter_a":"One day Michael Moore you're going to get what's coming to you youre a evil lowlife person and disgusting and Stephen Colbert had you on his show last night I wouldn't watch that democratic hypocrite of a show","post_message":""},{"comment_id":"10153268885327452","commenter_b":"COWARDS","commenter_a":"Nancy, you cannot be serious surely...better for who? It's always been dreadful since the concept of Zionism reared its ugly head and will never be any better only worse until Zionism is banished totally and the Palestinian people allowed to dictate their own terms. Israel should have no say in the matter, only the people who lived in Palestine and can prove it, no matter what their religion, should have the say in the reconstruction of Palestine. If squatters are to be repatriated whence they came so be it including Government ministers down to the last one of them.","post_message":"Mahmoud Alayan was fatally shot by an Israeli soldier while carrying a stone in his hand"}]
