[{"comment_id":"10154136361277293","commenter_b":"@username Oh! Just saw the guns!!!! You can live in your own basket. Would not want you as my neighbor. I'll live near a refugee.","commenter_a":"All these \"deplorable\" comments make me truly ashamed of my fellow Americans. SMDH at all the lies, irrational hate and fear mongering.","post_message":"Kerry told lawmakers \"that if it is possible to do more\" in terms of accepting refugees, \"we would.\""},{"comment_id":"10154347399052045","commenter_b":"@username well those kids shouldn't be causing trouble then no incident would have to end up like that. Just go school then go home then trouble won't follow you, like the old saying if you walk like a duck, talk like a duck, act like a duck then you're a duck... don't hang out with ignorant bad apple kids just be smart about it...","commenter_a":"These people ars out protesting, these 2 teenage kids that assaulted an off duty police officer. And because of one of these kids comes up from behind and hits this officer while holding his friend by the shirt he pulls out his gun and fires it into the ground, NOT INTO THE AIR, people protest. If these kids got the butt handed to them in there home growing up they wouldnt be out in the streets causing problems. The kids r lucky they dont have a bullet wound in the A $$","post_message":"Protesters in Anaheim are blocking streets to demonstrate against an off-duty LAPD officer's confrontation with a teen in which he fired his gun. @webpagelink"},{"comment_id":"10153018811005927","commenter_b":"@webpagelink #dontbesilent this woman can NOT be the President of our country","commenter_a":"Wrong wrong wrong, what has happened to the USA and right and wrong?","post_message":"How did the media miss this?"},{"comment_id":"10153955830944087","commenter_b":"Never trust a woman in a white pants suit.","commenter_a":"No bitch, that's not how this works!","post_message":"#BREAKING: Hillary Clinton accepted the Democratic Party’s nomination for president Thursday, making history as the first woman to lead a major political party."},{"comment_id":"639140816274210","commenter_b":"Just like your whore mother.","commenter_a":"She is a pig.","post_message":"I am sick and tired of Michelle Obama and her family in the White House...GET OUT!"},{"comment_id":"10156075719260389","commenter_b":"kill the rapist please","commenter_a":"The Military is a disgrace. What the heck has happened to our military?","post_message":"“Your behavior is inexcusable and incompatible with the high standards of performance, military discipline and operational readiness of Special Forces,” the memo states."},{"comment_id":"10156388002150389","commenter_b":"Muslims are the problem!","commenter_a":"He was a Muslim. What else is there to know?","post_message":""}]
