[{"comment_id":"10152978726794342","commenter_b":"Yep that's some more B.S. All of the jobs that illegals are here taking were done by American citizens before you came. Your comment is without any truth whatsoever!!!","commenter_a":"All this jobs yall dnt do the hispanic race does !","post_message":""},{"comment_id":"755539251303319","commenter_b":"Send the bitch to jail and strip the bed sheets off of her","commenter_a":"Your in US lady you must obey the law... I'm sure when your in Muslim country your not even allowed to drive ....","post_message":"Burqa-Clad Woman Pulls Race Card On Cop, Gets Brutal Wakeup Call That's not how it works in America... Sorry. Do you think she got what she deserved?"},{"comment_id":"826031280920782","commenter_b":"She's just disgusting to look at..","commenter_a":"About time now she can pack so she can leave !!#!!","post_message":"Liberal trash has no place on tv.  This is the best news all year.  Do you think Whoopi deserves to be kicked off the air?"},{"comment_id":"709686039165167","commenter_b":"@username Illegals don't have insurance.","commenter_a":"Norway has a single payer health system as does every other civilized country in the world but us. Get insurance companies out of the middle of my health care. They jack up the prices on everything, not just drugs. UPDATE: every other civilized country has either single payer or two-tier system. I included a link below. Scroll down.","post_message":"U.S. drug prices are higher for 93% of 40 top branded drugs compared to Norway. That is unacceptable. We should use our buying power to get better deals for the American people."},{"comment_id":"10153002585681770","commenter_b":"All conservative women are stupid!!!","commenter_a":"All liberal women are stupid!","post_message":"During a keynote address at the New York State Fair Wednesday, Democrat New York Senator Kirsten Gillibrand erroneously referenced the Constitution’s Fourteenth Amendment as the law that gives women the right to vote."},{"comment_id":"1041804329212648","commenter_b":"The same family will bring in refugees, no doubt, and will regret that as well.","commenter_a":"At the shelter in my city they put all pits and even half pits to sleep, they don't even adopt them out.","post_message":"Pit bull rescued from 'death row' attacks daughter just minutes after arriving at family home"},{"comment_id":"531107707082073","commenter_b":"What a bunch of trash. Next time get up and yell back and pin them against the wall. Come on white people stop taking this shit from these thugs!","commenter_a":"We need to start taking care of business.","post_message":"\"...screaming racially motivated chants such as, “F*ck you, you filthy white f*cks!”, “F*ck you and your comfort!”, and “F*ck you, you racist sh*ts!” One girl was even reported to have been pinned by protesters against a wall, who allegedly shouted “filthy white b*tch” in her face.\""}]
