[{"comment_id":"961733343862087","commenter_b":"Because she's an evil witch!","commenter_a":"She does not speak the truth !!!!","post_message":"No way, no how do I want her in the White House!"},{"comment_id":"10153728622221336","commenter_b":"Women do have their own football league, Jake...","commenter_a":"A lot of sexist men just cried.","post_message":"The Oakland Athletics have hired Justine Siegal, MLB's first female coach.  Siegal is also the founder of Baseball For All, a nonprofit organization that provides meaningful instruction and opportunity in baseball, especially for girls. @webpagelink"},{"comment_id":"1012758612153724","commenter_b":"Well, now that she will be sitting at the grown-ups table, we will notice just exactly how much food she gets all over her face.","commenter_a":"I think DT,were say that she was ugly!!!","post_message":"Carly Fiorina will finally get her chance in prime-time."},{"comment_id":"892938524096132","commenter_b":"Don't hate immigrants--- hate law breakers. Invaders have to be stopped. Tax payers can't afford them. Do it legal or don't come at all.","commenter_a":"Why do you all hate immigrants? Your grandparents were immigrants.","post_message":"In the U.S. House Judiciary Committee, we introduced legislation to strengthen the interior enforcement of our immigration laws by allowing state and local governments to enforce federal immigration law. By doing so, we remove the ability of this or future Presidents – of either party – to systematically shut down portions of the law to suit their political purposes. WATCH:"},{"comment_id":"1082607271804819","commenter_b":"Lynne Longoria Torres","commenter_a":"the BBC is for the birds.","post_message":"Donald J. Trump has yet to comment!"},{"comment_id":"987574278005491","commenter_b":"Killary for prison 16","commenter_a":"Very true, Hillary has been called horrible things not just by men but women to. HILLARY 2016.","post_message":"\"I don’t know that a man would be treated the same way that Hillary is.”   - Senator Bernie Sanders"},{"comment_id":"415868471934780","commenter_b":"as soon as they put one foot on our soil we must be ready to drop bombs on them.","commenter_a":"I am ready for them arats.","post_message":"They're here!!"}]
