[{"comment_id":"10154506488603487","commenter_b":"Non-issue. Couldn't and wouldn't happen. Too much of our power structure is in Texas.","commenter_a":"If they do not want their Social Security, Medicare, Medicaid, and Veteran Benefits. We will gladly keep their share for the USA. Of course Hillary has a chance to win Texas.","post_message":"Hypothetical question: Would you support or oppose Texas seceding from the United States?"},{"comment_id":"1117171088374939","commenter_b":"Amen","commenter_a":"Sir where have you been to be so incredibly deceived?","post_message":"Live from the MGM Grand Las Vegas lazy river pool: Dana Perino and Chris Stirewalt record their pre-debate podcast, \"I'll Tell You What.\" #debates"},{"comment_id":"1620928861543005","commenter_b":"No one should hit ANYONE. Its assault. Penis or vagina.","commenter_a":"Im confused....she put her hands on him first. This shouldn't even be a thing.","post_message":"This football star was filmed punching a woman in the face. He's still allowed to play."},{"comment_id":"10153706069823717","commenter_b":"Best part about this is her age, she's not an 18 or 20 year old like most ad models.","commenter_a":"Oh thank heavens. The world is a safer place.","post_message":"People magazine has named Jennifer Aniston the \"World's Most Beautiful Woman\" for 2016."},{"comment_id":"470357549819863","commenter_b":"Another Blind Bitch!!!!!","commenter_a":"Wow. How sad he has really done a lot to get us back on track after what GW bush left him with and am sorry that all these post are being done by redneck asshole","post_message":"How would you define President Obama in one word?"},{"comment_id":"1723070871241628","commenter_b":"The Republican party better start listening, the real American People are speaking LOUD AND CLEAR!!!! WE WANT DONALD TRUMP!!!!","commenter_a":"Trump 2016!! The GOP is fighting for his failure, they should unite and back our choice. We need a smart President with common sense can build and secure borders, create jobs and a better future for the USA and puts the American people first. That man is Mr. Trump, lets do this!","post_message":"Thank you AMERICA! So grateful for your support- as we work EVERYDAY to MAKE AMERICA GREAT AGAIN! En route to Wisconsin now!"},{"comment_id":"1651334078420186","commenter_b":"Disgusting Banker Thugs.","commenter_a":"cowards shouldn't be cops","post_message":"The woman's vehicle was clearly functionally disabled, but that didn't stop these cops from \"fearing for their lives\". The most disturbing part about it; the cops seemed to enjoy executing her.  Story/Video here: bit.ly/1HARM4N"}]
