[{"comment_id":"1645030555784057","commenter_b":"Every woman who wants an abortion should see this. Children are truly gifts from God!","commenter_a":"If everyone showed that much love for their mother and all their family. This world would not be in the shape its in today. Most beautiful example for everyone!, thanks","post_message":"Incredible."},{"comment_id":"906810012772083","commenter_b":"He hit that hoe!","commenter_a":"@username found it","post_message":"Chik-Fil-A Stays Lit!"},{"comment_id":"1499235536803237","commenter_b":"Oh I am pissed, then the ones that need help, can not get it. And that lazy ass gets everything for free and that for 15 years. They should tell her to get her ass out and work, and stop spreading her legs.","commenter_a":"parasites","post_message":"Are you angry yet? Just listen to what she has to say about it!"},{"comment_id":"642967212548589","commenter_b":"YOU ARE ALL IMMIGRANTS UNLESS YOURE NATIVE AMERICAN. DEPORT YOURSELF.","commenter_a":"Trump they going to kill you man you are trouble man","post_message":"WATCH LIVE: A large group of people protesting President-Elect Donald Trump are marching in downtown St. Paul, Minnesota. Similar protests are also taking place in Chicago, New York, Washington, D.C., Philadelphia, Portland and Atlanta.  @webpagelink"},{"comment_id":"892853017418706","commenter_b":"This my friends is a true leader","commenter_a":"We'll never see Obama supporting our wounded Vets like Bush. Bush was a true patriot","post_message":"George W. Bush said the ride will highlight the \"bravery\" of America's veterans:  \"It’s a ride to herald people who were dealt a severe blow and said, ‘I’m not going to let it tear me down.’”"},{"comment_id":"10153636855342426","commenter_b":"What a tragedy","commenter_a":"R.I.P. D'Marco you fought a good fight","post_message":"D'Marco Jackson passed away this morning. You may remember D'Marco from an inspirational speech he delivered last year at the Hermitage High School graduation.  “If I had to pick a singular piece of advice to give you all, I’d say this … do not let the realities of the past or the possibilities of the future negatively affect the peace, joy and happiness that the present has to offer,” he said.  Read more: @webpagelink"},{"comment_id":"10156496631915354","commenter_b":"Send her back, bitch!!!","commenter_a":"She is simply unqualified...","post_message":"This radical Leftist principal is out of control.  The principal's name is Eujin Jaela Kim. And what she's up to will infuriate most Americans."}]
