[{"comment_id":"594388797376563","commenter_b":"To all of you saying fair game and all that.... You are no better than the republicans that did it Michelle Obama, you should be ashamed of yourselves","commenter_a":"People of character do not talk negatively about someones' spouse nor kids. End of that discussion. With that said, I sincerely hope Carson never holds any public office at this stage of his life due to what appears to be his deteriorating mental faculties. He is running for president of my country so that is a legitimate comment of my concern of his abilities. This comment does not in any way extend to any members of his family.","post_message":"He's a candidate, so that means she is automatically in the spotlight - but do people really need to be so cruel?"},{"comment_id":"10152713958671051","commenter_b":"Note, Date women closer to your age.","commenter_a":"Be careful in what you want!","post_message":"A 69-year-old man thought he and his 17-year-old girlfriend had something truly special. You can probably guess how this story ends."},{"comment_id":"10153420149016350","commenter_b":"Awesome!!!!!!! Congrats to the graduates!","commenter_a":"This is Awesome!!","post_message":"The seniors only took two days to learn the performance!"},{"comment_id":"10153398381514364","commenter_b":"Social security is the world's biggest pyramid scheme. It will eventually crumble, and I have no doubt it will do so in my lifetime.","commenter_a":"I'd love to have my social security tax, 6.2% of my income, go into my 401k or Roth. I don't need the government to help me save for retirement.","post_message":"They aren’t being straight with the American people, and they know that."},{"comment_id":"10156149888525389","commenter_b":"Now they are coming over by sea they are still illegalls","commenter_a":"Oh Great,more people coming in !!","post_message":"A Miami Beach Police spokesperson said it is unknown how long the group were at sea."},{"comment_id":"10153482227782377","commenter_b":"The corruption mongers who have like leeches suck the blood and financial life out of this country find being with Trump is of no benefit to them therefore its a matter of running scared when we find out who they are their done!","commenter_a":"were never conservitves in the first place @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@2","post_message":"In the wake of his Indiana primary victory, some Republicans are breaking with party tradition and refusing to support Donald Trump under any circumstances."},{"comment_id":"10153694817752293","commenter_b":"All they have to do is ask and I'd let a nurse snap all the dick pics she wanted.","commenter_a":"And her name is Johnson ....","post_message":"Police discovered a photo and video on the nurse’s laptop."}]
