[{"comment_id":"1658721937683357","commenter_b":"It is a machine for women. Google it.","commenter_a":"Who's Sibian?","post_message":"This may be  to a beach near you!  @webpagelink"},{"comment_id":"10153315672229091","commenter_b":"It's not cheap, it's very expensive. the apartments on either side, below and floors above have to be treated to truly eradicate the pest from the building. All that cost big $$$$ It's not funny. I don't blame her for looking for an inexpensive way to kill them. She should have done more research tho","commenter_a":"Theres people laughing and then I'm reading \"Stop being cheap and call an exterminator...... Who knows if this woman call an exterminator for an estimate and it was way above her budget none of us know that everyone go through different things I wouldn't recommend dousing yourself in rubbing alcohol but I'm sure if she would have looked on line she could have found a more better way. I don't understand how people can sit here and judge the next person like as if their better than the next. At least she apologized if that's the case and if thats how you feel then you should reach out and help her afford an exterminator","post_message":"The woman said doused herself with rubbing alcohol before it was ignited by a stove and oven. She said she had turned on the stove and oven the previous day to heat up her apartment, on advice from a neighbor, as part of the effort to kill the bedbugs."},{"comment_id":"10157544266265206","commenter_b":"Pervert","commenter_a":"Manzoor Hassan @username ye kon ha ?","post_message":"“My heart dropped into my stomach, and I was immediately hysterical,\" the woman said."},{"comment_id":"10153686388831320","commenter_b":"Disgusting these women","commenter_a":"I know it's o.k.-u know it's o.k.-get over it. body paint is o.k.- don't go if it's NOT o.k. w/u!- nuff said??","post_message":"Art or offensive? Women in nothing more than body paint and a thong are taking pictures with tourists in Times Square. How do you feel about what they do? @webpagelink"},{"comment_id":"1769361876675571","commenter_b":"Chinguen su puta madre ,al igual sigana trump nos seguiremos pasando i cruzando la frontera ,pongan ipongan sercas siempre los burlaremos 100% mexicanos gustele aquien leguste somos los #1 .","commenter_a":"Nice honest, rich family.","post_message":"In an impassioned speech, Eric Trump called on Americans to \"vote for the candidate who can’t be bought, sold, purchased, bribed, coerced, intimidated or steered from the path that is right and just and true!\" @webpagelink"},{"comment_id":"10155107253330557","commenter_b":"White people riot","commenter_a":"Must of been a black on black murder .... No riots","post_message":"#BREAKING: 2 people in custody, another still at large in the murder of a man in Reading. Developing details in the story below and in a live report on 69 News at 5:30."},{"comment_id":"10152973367828271","commenter_b":"Now he will have to keep finding more blondes that look like his ex wife","commenter_a":"Where do I apply for this job. I have a lot of worthless information that I would love to be paid for. 😂","post_message":"It's over: @webpagelink"}]
