[{"comment_id":"1139241312762564","commenter_b":"Woman? Never will be. With or without IT.","commenter_a":"Be happy Caitlyn. You are a strong woman.","post_message":"Monica Lewinsky: \"BEAUTIFUL\" Rosie Perez: \"Wow\" Questlove: \"Respect\""},{"comment_id":"793075604079241","commenter_b":"Thank you SIR!","commenter_a":"Thanks, the GOP needs more people like you, Scott.","post_message":"I voted against the \"clean\" DHS funding bill today. I will not compromise when it comes to our Constitution. President Obama has shown he has no regard for the principles our nation was founded on. If Congressional Republicans won't hold the line against this president, then who will?"},{"comment_id":"10154099091164203","commenter_b":"No BITCH, .it's a blog like TRUMP my mind works faster than my finger on a kindle and this blogging is not the most important issue in my life, now run along I graduated HS over 40 years ago, so you grading me is MEANINGLESS......specially since your from Canada.......","commenter_a":"Really? Bull SHIT BLACK LIVES MATTER have been showing up to all the rallies. Only TRUMP supporters are standing up to the fucking ghetto rat's. Go ahead talk OUT both sides of your MOUTH, you just keep confirming the NEED FOR THE TRUMP MOVEMENT.","post_message":"\"My own personal observation is that there is a cycle of behavior that is escalating and it's happening exclusively at Donald Trump events.\""},{"comment_id":"477247782478735","commenter_b":"All of that and his arrogance!","commenter_a":"All of the above and more","post_message":"How will you Remember Obama? www.eaglerising.com"},{"comment_id":"958116217578241","commenter_b":"Hillary had two terms (8) years in the White House. Hillary was involved in everything bill Clinton did!! Hillary had two terms (8) as a New York senator. Hillary had a term (4) years as Secretary of State. Yet, the old girl thought she could have her own server and NOT be held accountable for classified emails... When are Americans going to get pissed enough to hold the shrew responsible?? Hillary left four AMERICAN men to be tortured until dead in Benghazi. Could this be what she and her aids are hiding? As of Friday, as per a JUDGES order nothing has been turned over. The two aids hide behind an attorney and Hillary just never answered... Monday such be very interesting!","commenter_a":"She needs to STOP Monsanto instead of defending them. We all have a right to know what is in our food.","post_message":"Join Hillary's fight to build an America where we don't leave anyone out or anyone behind: @webpagelink"},{"comment_id":"10152653934397169","commenter_b":"A woman should never lose her chic!","commenter_a":"Go girl!","post_message":"Part of a growing trend of older fashion icons:"},{"comment_id":"10153368825000329","commenter_b":"Christine, go read the bible or something.","commenter_a":"Congratulations... you all look like lesbians.","post_message":"The students coordinated wearing flannel shirts and wrote \"anti-gay\" on their hands, after the school's Gay-Straight Alliance held a \"Day of Silence.\" (via BuzzFeed News)"}]
