[{"comment_id":"10153482997507550","commenter_b":"All illegals go back to where you came from. You are breaking the law. Get out.","commenter_a":"Arrest. Deport. Go back to Mexico and protest.","post_message":"View from #Chopper11HD of the #HB318 (immigration bill) protest in Raleigh abc11.tv/20e0DVL"},{"comment_id":"10153122066896037","commenter_b":"Porter up there is absolutely right","commenter_a":"no, we have no backbone in the US so we will let Russia take what it wants.","post_message":"The leaders of #Ukraine, #Germany, #France and #Russia pledged renewed support for a tattered ceasefire in eastern Ukraine despite violations -- including the storming of a key town by pro-Russian rebels.  Do you think peace will happen?"},{"comment_id":"1059210544118408","commenter_b":"Ramos is a Mexican so he won't listen to reason. When we lived in Temecula, Ca., our Mexican neighbors next door would go down to the Mexico/San Diego border & pick up illegals & bring them up to live in their garage!!! So I know firsthand what goes on at the border!!!","commenter_a":"Immigrants aren't the root of this country's problem. #scapegoat.","post_message":"Do you agree with Bill O'Reilly here?"},{"comment_id":"1161811247205145","commenter_b":"Lock her up","commenter_a":"\"LOCK HER UP\"FOR SURE!!!","post_message":""},{"comment_id":"1058824504164459","commenter_b":"@username are they in mexico legally? if they aren't, they'd be in a mexican jail. if they are. then go after your gvt for not preventing the assaults. the fact is this.. ILLEGAL entry to any country, including mexico, is against the LAW. Mexico has enforced their law and the US MUST TOO. That means a wall since mexican cartels have made another business out of smuggling people into the us and those who can't pay the cartels, find a different way. Mexico didn't like it when Guatemala did it to them and we don't like it here either.","commenter_a":"Mexico has the largest border wall on earth bordering Guatemala to the south in order to protect it from the violence and to protect its mexican culture. It shows the historically true nature of mexican politics since Maximilian was executed. Nothing in mexico is good for America at this time. We dont need there people drugs or crime.","post_message":"\"Suicide bombings in Israel went from 1,000 a year to zero a year once they put that fence up.\"  Yesterday, Mike Huckabee spoke to Uma Pemmaraju about walls, using Israel as an example of why they work."},{"comment_id":"598881613578354","commenter_b":"Just shoot her!","commenter_a":"Piece of shit!!!!! Hit up some of the dicks that got you there","post_message":"Cry.............me...........a.............RIVER!"},{"comment_id":"1797699957184669","commenter_b":"Gowdy is a total bad A!","commenter_a":"I must say that I have never heard of you before today, however after watching many you tube videos and a bit of research I am impressed by you in every way. You would make an amazing Attorney General.","post_message":"There will never be enough words to adequately express our gratitude for the brave men and women who have selflessly fought for our freedom. Thank you to all of our veterans, past and present, for your service and sacrifice to our country. May God bless you."}]
