[{"comment_id":"523485051181568","commenter_b":"Such a lying witch.","commenter_a":"She has dealt ace of spades. Let her bare the consequences!","post_message":"\"Donald Trump says I’m playing the woman card. Well you know what I say if fighting for child care, paid leave, and equal pay is playing the woman card – then deal me in!”  Moments ago, Hillary Clinton gave a speech responding to Donald J. Trump's criticism."},{"comment_id":"10153848285134497","commenter_b":"In others words BITCH, BYE!! Am I speaking your language now?","commenter_a":"But on a real level...this is what all parents should do with their offspring when traveling.","post_message":"\"Look at that, she not even stirringwhat a perfect sleepy angel!\""},{"comment_id":"10154732730043132","commenter_b":"BUT is he jewish?!","commenter_a":"Daniel Foisset","post_message":"It looks like Aly Raisman has plans for after Rio!"},{"comment_id":"631924593629516","commenter_b":"STUPID C..T","commenter_a":"Cheers for Hillary from Seddique Mateen, father of Pulse Nightclub Terrorist – and ideologue supporter of the Taliban and Critic of the LGBTQ community! • Seddique Mateen, the father of Orlando Pulse nightclub terrorist Omar Mateen, was spotted sitting behind Hillary Clinton at her campaign rally on Monday, August 8, in Kissimmee, Florida. • Clinton was paying tribute to the victims of the Pulse nightclub massacre at the rally when an employee of NBC affiliate WPTV noticed that one of the rally goers seated directly behind the Democratic presidential nominee was Seddique Mateen, the mass shooter’s father. • When asked about how Mateen received this preferred seating at her rally, Hillary Clinton, walked away without answering any questions. • Who instructed that Seddique Mateen be placed in such prominent seating at the Florida rally and why would they do so? • If it was a judgment error by Clinton’s staff ...","post_message":"\"I don't think what Donald J. Trump says is worse than actually what Hillary Clinton in fact has done.\"  - Green Party presidential nominee Dr. Jill Stein"},{"comment_id":"10153820090941336","commenter_b":"Queers are perverted sickos...","commenter_a":"Don't be a pervert. Churches don't have to tolerate your Perversions","post_message":"\"It feels like they are extending an olive branch and hitting you with it,\" said Wendy Montgomery, who is Mormon and has a 17-year-old gay son. \"It's like this emotional whiplash.\""},{"comment_id":"10154689857838487","commenter_b":"What a complete idiot","commenter_a":"He gave his brain away, didn't he. That's got to be the reason. He was selfless and gave his brain away.","post_message":"Carson accused Kay of making him  bad guy, and asked Joe Scarborough, the show's host, to  her microphone off so I can talk."},{"comment_id":"10153511898009087","commenter_b":"Look at the lies thay have in office today everyone of them for nothing but money .and there's nothing wrong with what trump personally done. .there trash on everyone .","commenter_a":"You will not turn a single vote away from trump support ers .you will only make more people for trump .","post_message":"\"I stand by every question I asked [Donald Trump] and he was not the only one who had tough questions,” Megyn Kelly said. “He was the only one, however, who complained.” WATCH:"}]
