[{"comment_id":"10154339492484087","commenter_b":"@username, good luck trying to deport a Native, you racist bigoted POS.","commenter_a":"Meanwhile, Boeing stocks take a hit because of this asshole.","post_message":"Boeing released a statement saying it was under a $170 million contract with the Air Force, not $4 billion as Trump claimed."},{"comment_id":"884237991635950","commenter_b":"It just makes me disgusted with some of the women of today,maybe like u.","commenter_a":"Woman will perish in disgust trying to do everything man does.....","post_message":"Should every woman SHAVE her face?"},{"comment_id":"10154383747512908","commenter_b":"Pussy","commenter_a":"It will never stop. Americans absolutely love guns and violence. The NRA owns this country. I got my passport so I'm outta here.","post_message":"Mass shootings are becoming an almost-everyday occurrence in this country. This sickening and senseless gun violence must stop."},{"comment_id":"10154138321738837","commenter_b":"I read she was with the lady already in line she just had more items for her. She did'nt skip the line. That racist pos was out of line enough said! Pendeja!!!!!","commenter_a":"Realistically speaking if you're with someone and they're at the counter cashing out who's going to go to the back of the line if they were \"Together\" and you're only adding an item or two?? saying she should have went to the back of the line is both irrational and impractical... part of the problem is making excuses for the inexcusable...","post_message":"#RACIST RANT RECORDED: A woman's Tuesday night racist rant while Christmas shopping goes viral on social media."},{"comment_id":"846989298730657","commenter_b":"I thin Aaran Afalava needs to do some homework about the way marriage has been done in the past.","commenter_a":"Why is this so special? My parents were together for 57 years...... If lesbians and gays want to be treated like everyone else why do they (and you) feel that everything they do is a milestone, or 'historic' or ...something! If they want to be treated like everyone else then they need to quit acting like they are something special.","post_message":"\"People seem to understand our relationship with no difficulty at all. They seem to know what we want them to know, which is that we are a loving couple, living a normal, happy life, just as we hope they are.\"  - Lennie Gerber and Pearl Berlin"},{"comment_id":"10156646291425093","commenter_b":"@username there is such a thing as legal immigration !","commenter_a":"You traitor establishment Repubicans are a discrase. Donald Trump for President of the United States","post_message":"Donald J. Trump wasn't against  interests. He was special interests -- and did his best to run people out of their own homes."},{"comment_id":"1645030555784057","commenter_b":"Every woman who wants an abortion should see this. Children are truly gifts from God!","commenter_a":"If everyone showed that much love for their mother and all their family. This world would not be in the shape its in today. Most beautiful example for everyone!, thanks","post_message":"Incredible."}]
