[{"comment_id":"911760225550393","commenter_b":"and she's just ugly","commenter_a":"Gabbie Dib","post_message":"One Direction's Zayn Malik  spotted holding hands with girl who’s NOT Perrie   (Via Daily Mail Celebrity)"},{"comment_id":"1265448890160011","commenter_b":"Dana, what if it's you who's the bitch and not Hillary?","commenter_a":"There isn't a nail in the coffin. At this point in time either you see her for the corrupt lying bitch that she is and refuse to vote for her or you vote for her in spite of it. No one can say she's not a corrupt liar. Either you admit she is and you're voting for her anyway or you are not. The table is set. The pieces are moving.","post_message":"JUST IN!"},{"comment_id":"10153416483736162","commenter_b":"Her heels are scratching up the scoop and that just kills airflow efficiency!","commenter_a":"ALL OF US have pictures like this.","post_message":"A Chicago flight attendant for Spirit Airlines is in trouble for some photos taken on the tarmac at O'Hare Airport @webpagelink  For the stories you care about - \"Like\" ABC 7 Chicago!  Instagram.com/abc7chicago"},{"comment_id":"1089823474413307","commenter_b":"Rhonda, your ignorance of reality is amazing!","commenter_a":"This administration MUST GO, PERIOD. Why is O allowed to take actions that have harmed this country in the eyes of the world???","post_message":"Yesterday, the Pentagon announced that the Russians could be told the location of our ground Special Operations troops in Syria, so that their Russian Air Force avoids them. This is a grave mistake. Once again, the President's administration demonstrates their inability to lead as Commander-in-Chief. Because he does not have an effective strategy for defeating ISIL/ISIS, he is putting troops on the ground without the protection of our air forces and asking the Russians, politely, to not bomb them. For over 50 years, our air forces have ensured no member of the American military has been killed by an enemy airstrike. I hope the Administration’s poor decision-making does not change this fact.  @webpagelink"},{"comment_id":"773517859455693","commenter_b":"They should both go to jail","commenter_a":"Bill can't keep his pecker in his dried up wife's vagina and her server was unprotected. She is a liar, corrupt corrupt blood money.","post_message":"His reaction was..."},{"comment_id":"10153865214066680","commenter_b":"Yea she can teach them how to lie, cheat, and steal.","commenter_a":"Oh yeah","post_message":"“Hillary has spent her entire career bringing folks together on behalf of our kids,\" she says."},{"comment_id":"10152949187346130","commenter_b":"Heheheh I don't need a beard to attract women and prove dominance. It's all in confidence and your attitude. You want dominance? Push me far enough and you'll find out your place real quick! ;)","commenter_a":"lol","post_message":"It's just evolution."}]
