[{"comment_id":"10153184111444877","commenter_b":"these now women were looking for an easy ride to stardom so was their mothers who allowed them to be around a grown man in some hotel.","commenter_a":"I think she's screwed up!! I can understand her need to defend black folks but this guy??,","post_message":"Whoopi Goldberg defends Bill Cosby: 'He has not been proven a rapist.' Watch what else Whoopi had to say below.   Grio fam, what do you think of Whoopi's comments?"},{"comment_id":"549880968533529","commenter_b":"The ones who say they are refugees are young muslim men . I never see women or children in the pictures. This is what obummer wants to bring to America.","commenter_a":"It's funny how you people think all Muslims are bad, but I never heard you talk about all the Muslims in California who raised over 200k dollars for the victims of the San Bernardino shooting. Or what about the Muslims in Africa who protected Christians from getting shot on a bus.","post_message":"This makes me SICK!!!"},{"comment_id":"541637449341656","commenter_b":"Pls sign here here and here","commenter_a":"Wow, big shock. The state who elects the most insanely leftist politicians went for Trump. I wonder why. I can't wrap my head around it. Man, so bizarre.","post_message":""},{"comment_id":"1800692713478186","commenter_b":"Your first woman president wants to bring ISIS TO AMERICA. IF SHE WINS YOU BETTER START PACKING HEAT AND GET ON YOUR KNEES AND PRAY. YOU WILL NEED IT.","commenter_a":"An America that believes it's ok that Americans have lost jobs? An America that believes healthcare costs for many Americans should increase? I get that the Affordable Healthcare Act has helped millions Americans, but at the expense of millions of other Americans. Also, an America that believes it's ok to accept donations from countries that house terrorists and are suspected of funding them? An America that let's people get away with breaking certain laws? This is the reality of @username America. FYI, not supporting Trump Chris Keniston, Veteran's Party of America supporter.","post_message":"Tomorrow, we have the chance to stand up for the America we believe in. Share this if you're voting. hillaryclinton.com/makeaplan"},{"comment_id":"10153689557537434","commenter_b":"Always. I have a dirty job so it is necessary.","commenter_a":"Nope.","post_message":"Please take this poll so we can figure out how gross we all are."},{"comment_id":"10155794432670354","commenter_b":"she'll never get that stink off her!","commenter_a":"What was that idiot doing there anyway.","post_message":"What was she thinking?"},{"comment_id":"10153921301277217","commenter_b":"@username has lost their integrity!","commenter_a":"Hahaha.sorry for the laugh. But @username Please investigate first before you conclude on this report. These are all accusations to our beloved president . even his rival denied those witnesses that testified in the senate. sad to say our president's rival now is doing the best they can to destroy our only hope to have a drastic change in this country . BTW You need to go to our country first to know more abt the facts and whats really happening here. :3 -_- #PostResponsibly -_-","post_message":"Gruesome gangland-style hits, including feeding one victim to a crocodile, were described to a Senate hearing by a former death squad member."}]
