[{"comment_id":"1012396785523240","commenter_b":"BUSH AND CHENEY WAR CRIMINALS!","commenter_a":"BENGHAZI, EMAILS, Feckless Foreign Policy , He is a Muslim , look at this snow ball Mr, President... Im not a Scientist , repeal Obama Care and shutting down the government again ?","post_message":"11 days and one massive to-do list."},{"comment_id":"10154428205019087","commenter_b":"@username How is hiring illegal immigrants here in the USA \"putting 741915279236631s first\"? @webpagelink","commenter_a":"As an @username and a veteran I do not understand how anyone, but especially a fellow veteran, could support a disgraceful chickenhawk like Donnie. @webpagelink","post_message":"Several leading veterans groups who skipped President Obama's inaugural parades will march down Pennsylvania Avenue to celebrate the inauguration of President Donald J. Trump."},{"comment_id":"1143755872353195","commenter_b":"If you don't like rules there move back to Kuwait!","commenter_a":"OLD POST, YOU GUYS.","post_message":"Muslim Welfare Diva Refuses To Take Off Headscarf Gets BRUTAL Message From Judge (VIDEO)  BOOM! This judge smacks her silly! Can we get 1K Likes for this awesome JUDGE!"},{"comment_id":"10154090084173690","commenter_b":"That will not happen, they will NEVER dominate Europeans. It would take a better class of people than the rough beasts who are now slouching toward Europe.","commenter_a":"Saudi Arabia and other rich muslim countries take in muslim refugees,,,,muslims have a big plan to dominate europ and later force Sharia laws on them","post_message":"Four Balkans countries have announced a daily cap on how many people can pass through and Austria has restricted entry for hundreds of thousands."},{"comment_id":"10153653816037377","commenter_b":"NO AMERICAN FLAGS!","commenter_a":"The color of Hillary stage is UN blue. No America to be found.","post_message":"As the Democratic National Convention entered its second day, presumptive presidential nominee Hillary Clinton's campaign is getting ready for Wikileaks to release more purloined emails and downplaying their potential impact."},{"comment_id":"684786888378556","commenter_b":"everyone has a right to their opinion, some are better than others, Go Clint","commenter_a":"He is furious with Clint but LOVES all the celebrities that pander to him........","post_message":"Obama wants Clint Eastwood finished, but he is holding his ground. H's in trouble. Let's show him our support. Can we get 100,000 'LIKES' for Clint Eastwood?"},{"comment_id":"1353378344701619","commenter_b":"Bring it bitches...Without the U.S. China will starve.","commenter_a":"EFF CHINA!!!!!","post_message":"CHINA WARNS TRUMP.    @webpagelink"}]
