[{"comment_id":"10154369349733812","commenter_b":"Take your hate, elsewhere, lady.","commenter_a":"Big f'n deal","post_message":"Pres. Barack Obama and First Lady Michelle Obama announce their daughter Malia will attend Harvard University in the fall of 2017, taking a gap year after her high school graduation next month."},{"comment_id":"10153482045808984","commenter_b":"She is a nut","commenter_a":"I would hate to have lived under her roof , she is not fit to be president. Or anything else.","post_message":"Hillary Clinton is known for her liberal view on just about every topic she chooses to sink her teeth into. And looking at this, her next move might be to include children in her agenda...  Do you think Hillary needs to be stopped?"},{"comment_id":"1110152195742243","commenter_b":"IF Hillary does get in I cannot wait to see people like YOU have to bend over and grab their ankles because of all the Radical Muslims and Syrians she plans to bring into the USA. Within her first 100 days she wants totally open borders and wants to bring in a minimum of 65,000 more Syrians. And within her time as president she plans to bring in a minimum of 1 MILLION Muslims! ....IF Trump does not get in, you can kiss your azz goodby and say hello to ILLEGALS, MUSLIMS, THUGS, and SYRIANS who will rape (you and your family), rob, and want everything you have worked for...........and they will get it! .The USA will go into total bankruptcy, and become a totally socialist nation!............IF this happens, Just Remember: \"I Told You So\"....AND YOU DESERVE IT!","commenter_a":"Republican nominee Donald Trump disdain for the American worker is legendary at this point. He been caught refusing to pay people for doing their jobs, told them that they don deserve a minimum wage, and offers benefit plans that actually won help working families, and scammed thousands of Americans out of their hard-earned money with his fraudulent . He doubled down on insulting the American working class in a truly insulting fashion earlier today when speaking about how too many Americans are working two jobs just to make ends meet, but told the crowd that , I working harder also, so I don feel sorry for any of you. It true. You think this is easy? Mr. Trump has never truly done a day of in his life. After graduating from his high-priced university, he was given a loan of a million dollars from his father, with which he began ...","post_message":"Today - I outlined a plan for American economic revival - it is bold, ambitious, forward-looking plan to massively INCREASE JOBS, WAGES, INCOMES and opportunities for the people of our country!"},{"comment_id":"1065131623520589","commenter_b":"R.I.P.","commenter_a":"Awwww, RIP, Al","post_message":"RIP Al from Happy Days. He passed away on Friday at age 96."},{"comment_id":"10153789765316770","commenter_b":"All for it don't need to spend our hard earn money on racists black bastards that haven't Done anything for our country America ! ! ! But disrespect our American laws our American Flag and our national anthem along with discriminating against white Americans and our American Veterans","commenter_a":"Boycott all nfl games and their sponsors.","post_message":"If they thought their fans would blindly go along with any insult to their country, they were sorely mistaken..."},{"comment_id":"1680894471939506","commenter_b":"Other people need jobs. Quit and you don't draw unemployment. Saves tax payers some money","commenter_a":"Which means 28% of our \"public sector servants\" are actually partisan political hacks. Liberals embedded like ticks. About right.","post_message":"I hope they're mostly from the IRS."},{"comment_id":"1023562641110247","commenter_b":"Conservatives can also be whiny. Like, OMG THE IMMIGRANTS ARE STEALING OUR JOBS OH NO I HAVE TO GO RE-TRAIN. I'M ENTITLED TO JOBS HERE.","commenter_a":"I don't know about my liberal comrades, but I went to work, paid bills, look after my kids, helped my neighbor fix his car, and drank. In fact I don't know a single liberal friend that did any of those","post_message":"It's a scary thought..."}]
