[{"comment_id":"1724919811095083","commenter_b":"^^ for a woman that's a very clever reply","commenter_a":"I think a more interesting question would be, will women cycle differently on other planets? I'm no scientitian, but it seems to me it's a helluva coincidence (that we take for granted) that the female menstrual cycle is in line with the lunar cycle. Our bodies are 2/3rds water and the moon controls the tides. Am I talking out my ass if I suggest maybe the moon can can influence the fluids in our bodies? So on a dfferent planet, with different moons (and presumably after having been there for several generations), would women cycle differently?","post_message":""},{"comment_id":"10153405102629255","commenter_b":"Josh Duggar,Dennis Hastert,who's next.. Gawd let it be Ted Cruz!","commenter_a":"I think he's another Sandusky","post_message":"This scandal is getting dark—fast."},{"comment_id":"935435836504943","commenter_b":"Mexicans dont pose much of a threat like ISIS refugees picked a wrong time to come over","commenter_a":"The Federal government cant property vet any of these refugees because there are no records on any of them! Hickenlooper is putting Colorado communities at risk as well as the Federal Government! 26 States as of today have refused to take any. Less States mean more refugees per State. Obama wants upwards of 200,000 refugees! If we would have wiped them out early, the world would not be in this position! How many refugees would we receive in your State if only 10, 5 or 2 States allow them? They will migrate to other states and most will go on welfare, food stamps and Obama care, not to mention the cost to educate them or the real cost of American lives from terrorist attacks in our communities! What price do you put on that Mr Speaker!? Hickenlooper as well as the Federal is putting our communities at a security risk ...","post_message":"Our nation has always been welcoming, but we can’t let terrorists take advantage of our compassion. We should not bring Syrian refugees into this country unless we can be 100 percent confident that they are not here to do us harm."},{"comment_id":"10152965639377690","commenter_b":"Evil women have already stole my soul. It's too late.","commenter_a":"Really? Really?","post_message":"Texans hold prayer vigil for Blue Bell Ice Cream after massive recall @webpagelink"},{"comment_id":"10153491435486880","commenter_b":"Wal-Mart will fall fast, probably years from now when \"Fresh\" is in Full Force! @webpagelink","commenter_a":"Cj Gennaro","post_message":"Amazon.com had a really good day."},{"comment_id":"10154224264151500","commenter_b":"@username ur queen is pregnant","commenter_a":"Kristina Vinson twins omg","post_message":"The Carter family grows."},{"comment_id":"1482796298404171","commenter_b":"@username that's such a nice thing to say","commenter_a":"As an Asian non-American, I have a lot of similar feelings with people from the video. However, one thing I do not share is the that even I am not American, not born here, you still don't get to say \"go back to China\" to me. I go where I want and I came here legally. America could be more friendly.","post_message":"An editor for The New York Times wrote an open letter to a woman who told him to \"go back to China.\" Asian-Americans responded by sharing their own racist moments using #thisis2016. Here are some of those moments.  Warning: This video includes racial slurs and vulgarities."}]
