[{"comment_id":"1386824984689067","commenter_b":"She's a fucking drunk, wake up, she needs to be removed and institutionalized..","commenter_a":"Someone tie her arms by her side, maybe with a straight jacket!","post_message":"Something seems really off here..."},{"comment_id":"1795134364108592","commenter_b":"Lock them up! Bunch of crybabies","commenter_a":"Pull out a bull whip and whip these bitches","post_message":"FOX 12's Mega Sugianto is live as protesters march for a fifth night in downtown Portland."},{"comment_id":"10153842833302756","commenter_b":"Racist? Ok then. Keep letting the Muslims in this country to terrorize. Let the BLM people go unchecked and keep killing our Police. Let illegal Mexicans in to drain our already overtaxed healthcare system and bring more drug violence. No, no more. It ends now.","commenter_a":"I can't wrap my head around how anyone comprehends what he's saying. He literally says the same thing OVER AND OVER, but I guess that's the only way his racist, small-minded supporters can understand him.","post_message":"Republican presidential nominee Donald Trump spoke with Newswatch 16 after his rally in Scranton on Wednesday. See more here: @webpagelink"},{"comment_id":"10155124264189679","commenter_b":"Lock this old hag up....","commenter_a":"No No No","post_message":"LIKE to support, comment to discuss."},{"comment_id":"10152651937258067","commenter_b":"You're wrong. Red letters mean it was quoted, a parable told by Jesus. If you don't believe the Bible Stephanie Morris, that's fine. But you can't question why a church would make a decision if you don't believe in the book that the church is built around.","commenter_a":"Question is, why did that church invest in money-changers? What would Jesus think?","post_message":"A church in Indianapolis claims JPMorgan intentionally mismanaged church funds and only cared about maximizing fees. @webpagelink"},{"comment_id":"1033897839973602","commenter_b":"God bless you and your mommy","commenter_a":"Welcome little one","post_message":"Do you remember our story of the pregnant woman who was carjacked on the way to the hospital?  Story --> @webpagelink Well, she had her baby yesterday. Help us in welcoming the adorable Malcolm."},{"comment_id":"815444651917532","commenter_b":"Pathetic woman.","commenter_a":"I now understand why she has those dark bags under her eyes. She stays awake all night long thinking and writing down excuses she will have to use the following day to explain her ignorance and untruthful behavior.","post_message":"\"Well, I don't know,\" Clinton said. \"That's what they offered.\""}]
