[{"comment_id":"1473249136068163","commenter_b":"Men don't walk around campaigning for free the japs eye so why do women do this","commenter_a":"That's bold.","post_message":"Nude York City!"},{"comment_id":"1131244553635264","commenter_b":"#BernieOrBust #BernieAllTheWay #DropOutHillary","commenter_a":"Either way it will be a Democrat all the way to the White House again for another eight years along with a Democratic majority in Congress! Many thanks to the GOP for putting up unelectable candidates election after election,those dumb idiots will never learn","post_message":"Trump must be stopped.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"550509575137335","commenter_b":"So do it already arrest her corrupt ass because she is dangerous to our society.","commenter_a":"yeah...won't hold my breath !! 'smh'","post_message":"FINALLY..."},{"comment_id":"1036956366325374","commenter_b":"Your mom is a joke.","commenter_a":"America the land of the free .. Your gun laws are a joke","post_message":"The first wolf spotted in the Grand Canyon for 70 years has been confirmed to have been shot dead."},{"comment_id":"10153308747171037","commenter_b":"Failing to report 1,100 donations and $145 million in donations isn't sinister. It's just a small bookkeeping error. This is how totally out of touch this moron and his wife are.","commenter_a":"And, I did not have sexual relations with that lady, Miss Lewinski.","post_message":"Former President Bill Clinton used his first interview since Hillary Clinton announced her 2016 campaign to address questions about the Clinton Foundation - by Dylan Stableford in Yahoo Politics."},{"comment_id":"10154678664866037","commenter_b":"#CutHerLoose","commenter_a":"She should stay in jail where she belongs.","post_message":"Tulsa police officer Betty Shelby turns herself in after being charged with first-degree manslaughter — but has since been released on $50,000 bond."},{"comment_id":"10154618646328812","commenter_b":"Europe will never be the same again thanks to refugees","commenter_a":"Ever notice how politicians insist on framing the narrative?","post_message":"French President François Hollande said today's attack and hostage situation at a church in Normandy was carried out by \"terrorists who claimed allegiance to ISIS.\""}]
