[{"comment_id":"10154081807932212","commenter_b":"Women are not a minority.","commenter_a":"The DNC proves once again that dividing the people is their mantra. These women are being used and they do not even know it. The Democrats are using these women the same way as they use all minorities. It's disgusting..... @webpagelink","post_message":"#WomensMarch OK about to begin at the Capitol. Grant Hermes News 9 says an OCPD officer just estimated up to 6,000 people there right now. #News9"},{"comment_id":"10158501442080389","commenter_b":"Why is she in our country?","commenter_a":"March away and try not to get run over by a car or truck. Most of us have jobs and families to tend to.","post_message":"Despicable."},{"comment_id":"10153288973431051","commenter_b":"If you don't like the words In God We Trust then you need to fing a country that don't put it on their Curancy. It needs to be placed in more places.","commenter_a":"Which God? Lol","post_message":"Do you like or dislike this decision by Kentucky?"},{"comment_id":"1165586973515562","commenter_b":"ABSOLUTLY","commenter_a":"Why not keep an open mind ( and a closed mouth) until the evidence is in?","post_message":"Attorneys for the family of Keith Lamont Scott hold a news conference."},{"comment_id":"959095867528667","commenter_b":"I want to hear the story too","commenter_a":"Trump fix SS","post_message":"DML discusses the best way to fund Social Security, and how the media disrespects veterans.  Please watch and share."},{"comment_id":"10152739568860779","commenter_b":"Get off Kobain's dick, retard committed suicide.","commenter_a":"Jody Bombay VanderZouwen buy me this !!","post_message":"Kurt Cobain appears on the cover of our latest issue, on newsstands today. In a 1994 feature, David Fricke looks back at the Nirvana frontman's music and legacy. \"As a man of riffs and letters, Cobain was a sly dog who rarely stooped to the obvious…nothing in Cobain's music was ever quite what it initially seemed; his best-known song was named after a deodorant,\" Fricke wrote."},{"comment_id":"1703427863256710","commenter_b":"Like Hillary thinking people should vote for her just because she's a woman.","commenter_a":"Race is not what matters. It is what is in your cranium! Dr. Ben Carson said this and he is correct. How stupid is this woman and those who think race and gender are the most important things in this life!","post_message":"Too much skin in the game?"}]
