[{"comment_id":"10154727514062235","commenter_b":"Between crooked Trumpkin and crooked Hillary I'm going to vote for Hillary.","commenter_a":"A vote for Donald Trump or any politician who supports his candidacy is a vote for discrimination. Period. No exceptions. No excuses. You might as well tell your Black, Latino, Asian, LGBTQ, Muslim, Jewish, Native American, non-Christian, disabled and woman fellow Americans they are not welcome in the U.S.","post_message":"Okay, Mr. Trump adviser, there is a big difference between a fact and just something you wish was true."},{"comment_id":"886400474789539","commenter_b":"so many thugs trying to kill cops what do you expect?","commenter_a":"Crooked cops what would you expect?","post_message":"\"I just tried to cover my face from all the beating that the officer was giving me.\"  -Floyd Dent"},{"comment_id":"800175416791290","commenter_b":"shes disgusting!","commenter_a":"I don't know anyone personally that thinks Amy Schumer is funny . Her only following is a bunch of feminist that think her over the top vulgarity makes her equal to men but even most men aren't as perverted as her .she tries to hard and it just isn't funny or entertaining.","post_message":"\"Of course, we're in Florida, you're going to boo.\" - Amy Schumer after being booed for making jokes about Donald J. Trump"},{"comment_id":"10154392449762235","commenter_b":"Having a \"break down \"?","commenter_a":"Suicide by cop! The young man didn't comply from the beginning. The young man also shouted \"I hate my life\". It's a shame but you have to comply with the law. It is sad though. \"JUST DO WHAT THE COPS SAY\"!","post_message":"Dylan Noble’s mother has filed a wrongful-death claim against the police department."},{"comment_id":"841598805896172","commenter_b":"Ok. And then we Will kill you and take OUR White House back !!!!!!!!","commenter_a":"Nah....he'll invite you in.","post_message":"Who has Obama betrayed the most, us or them? Uh oh...  ~Bandit"},{"comment_id":"10153304939531350","commenter_b":"He's a combo look of Chandler from \"Friends\" and her ex-husband","commenter_a":"Courtney Cox marrying band member Johnny McDaid from Snow Patrol. My favorite \"Friends\" and my favorite band!","post_message":"\"She wants to be the flower girl, all the bridesmaids. She's very excited about it.\"  CC: The Ellen DeGeneres Show"},{"comment_id":"1813003575594431","commenter_b":"Us white people got to go yuh eard meh","commenter_a":"Were pray tell is this \"white rage\"? I am white and I feel no rage nor the desire to go out in public and carry signs around. I am not happy with where this country is going but I am not out all day every day protesting and tearing things up..oh wait a minute...I work all day.","post_message":"According to a new book by Emory historian Dr. Carol Anderson, many of the struggles faced by the African-American community are the result of \"white rage.\""}]
