[{"comment_id":"10153724000373132","commenter_b":"Then she will have another kid.","commenter_a":"If she's stupid they will. So yes they'll end up back together","post_message":"In this week's PEOPLE, we learn why Scott Disick blew a second chance with Kourtney Kardashian.  Do you think they'll ever get back together?"},{"comment_id":"704906709652228","commenter_b":"What a joke this lady is. I bet she is protected by Guns every single day... But she doesn't want Americans to be able to protect themselves. Just ridiculous","commenter_a":"Yah, just fill out form ID-10T and they'll ship a gun right to your doorstep Mrs. Douchebag. This is exactly why the establishment left cannot have nice things.","post_message":"“You shouldn’t be able to exploit loopholes and evade criminal background checks by buying online or at a gun show…We have to make it harder for people who should not have those weapons of war.”  – Hillary Clinton reacts to the #OrlandoShooting @webpagelink"},{"comment_id":"1025085544195452","commenter_b":"@username , are you Canadian ? If so , we will gladly ship a few million muslims to your neighborhood","commenter_a":"That \"teacher\" should be fired!!","post_message":"“My daughter wanted to know why she was asking her that.”"},{"comment_id":"674830109374234","commenter_b":"This America and every body should be able to fly our flag and if any muslim feels threaned then they can just leave your country and go back to where they belong and stay there","commenter_a":"I say- \"TOUGH\"","post_message":"You'll never believe why this man was forced to remove his flag.  This is absolutely wrong. If you're offended by the flag, LEAVE.  Can we get 20,000 'LIKES' in support of the American Flag?"},{"comment_id":"10155835827900615","commenter_b":"About damn time they got these creeps off the air!","commenter_a":"Unfortunately another network will probably pick them up.","post_message":"BIG BREAKING NEWS –"},{"comment_id":"1676407832621088","commenter_b":"#TrumpTrain #StopHillary #BernieSucksCock","commenter_a":"Based Ben AMIRIGHT @username","post_message":"Thank you Dr. Ben Carson! An honor to receive your endorsement this morning."},{"comment_id":"10155007854069170","commenter_b":"Suck it up and move on lady","commenter_a":"this occurs when they go off their medication","post_message":"Enjoy this video. Watch it repeatedly. Savor it like a fine wine..."}]
