[{"comment_id":"469971939860053","commenter_b":"look its him the bitch","commenter_a":"No way Michelle we have the right. Guns don't look for people to shoot look and see who are the vandals and thieves that are doing the shooting killing their own people","post_message":"Michelle Obama just made a major move on gun confiscation.  This is ridiculous, restrictive gun laws cause HIGHER murder rates.  Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10153177942114170","commenter_b":"Once a LIAR, always a LIAR! But what difference does it make at this point! Hillary is Obama in a skirt! Another Democrat that Bows to ISLAM and leaves Americans being attacked by Muslim Terrorists, TOO DIE!","commenter_a":"She should go to jail rather than the White House. Worst Secretary of State ever along with Obama the worst President ever.","post_message":"How stupid does she think we are?"},{"comment_id":"635910406556387","commenter_b":"Go away stupid black man","commenter_a":"Always has the Muslims in the forefront of his talks before even condolences ... God forbid we upset the Muslims because they practice the religion of peace!","post_message":"President Barack Obama addressed the horrific terror attacks in Nice, France and called suggestions to target Muslims in America \"repugnant.\""},{"comment_id":"560619820771155","commenter_b":"Happy Thanksgiving Dr. Carson and family!","commenter_a":"God bless and keep you both always,many more Thanksgiving to share our blessings.","post_message":""},{"comment_id":"10152729868175667","commenter_b":"Oh calm yer tits..it's just fun","commenter_a":"I may stop following USA Today because of this specific post. The guy isn't even old enough to run and you're reporting it like its important, which just means you made a joke out of yourself.","post_message":"President Flame would be a pretty epic name. Just saying."},{"comment_id":"1176020919129046","commenter_b":"People are saying trump is unfit to lead the country","commenter_a":"Guys I'm scared... Polls are showing crooked Hillary leading by double digits now.... Someone please give me a virtual hug and tell me everything is going to be okay","post_message":"Many people are saying that the Iranians killed the scientist who helped the U.S. because of Hillary Clinton's hacked emails."},{"comment_id":"10153545478606162","commenter_b":"She is a fake little creep","commenter_a":"hmmmmm, if she hates the way Americans eat why was she in a donut shop?","post_message":"ARIANA DRAMA: \"What the **** is that? I hate Americans. I hate America! That's disgusting,\" Grande said when a tray of doughnuts appeared in front of her."}]
