[{"comment_id":"10154538565137178","commenter_b":"@username illegal guns in Chicago are the guns killing people there, not the ones owned by legal owners, all the guns in Chicago have not slowed the death tole, cities that allow guns have less violence less killing, it's history and its fact! Taking guns from legal citizens makes them defenseless and easier for the government to control! Outlaws will always have guns!","commenter_a":"The problem is he considers the dangerous few the Legal Gun Owners in America, Not the Illegal gun owners in south Chicago!","post_message":"Executive action? President Barack Obama is exploring ways to keep guns out of the hands of \"a dangerous few\" without depending on Congress to pass a law. Steps to strengthen background checks could come this week. >>> wral.com/@username"},{"comment_id":"10153095975513606","commenter_b":"Unreal. Where I grew up the \"N\" word was used frequently. Every time I was called that I retaliated. Im not a thug or a criminal. The teacher has to respect the students and vice versa. In hindsight the student should have went to the principal and then to his parents. Im in no way condoning what the student did but its a 2 way street. Dont bash the student when we dont know exactly what rhe teacher said. Racial slurs or any other forms of racism has no place in society. My kids or the kids I coach cant even say anything like that. Either way whatever was said isn't the problem. It was the lack of respect from the teacher and STUDENT.","commenter_a":"@username you say teachers need to watch what they say. I don't get it. What about the child. Dosen't he need to be taught. I don't like what you said so I punch you. There are other ways of handling verbal abuse. This is disgraceful.","post_message":"Witnesses say a Prince George's County Schools student punched his teacher over a racially insensitive comment: @webpagelink"},{"comment_id":"370042553184039","commenter_b":"marriage was not meant to be a shitty relationship depends have a market I would like to invest","commenter_a":"evolution and same sex cannot coexist","post_message":"POLL: God's design for marriage? (man and woman)"},{"comment_id":"846208402083168","commenter_b":"Sounds like she has her head screwed on pretty straight !","commenter_a":"Amazing !!i am actually so happy for this girl... Finally, someone who I think really deserves and will truely appreciate what has just happened to her...","post_message":"\"I’m just grateful for this moment.\""},{"comment_id":"1770447173221488","commenter_b":"She's bitching because Trump will make her put on clothes lol","commenter_a":"She hasn't enough brains to have that much feeling for a cause","post_message":"Miley Cyrus has a clear message about Donald Trump becoming President."},{"comment_id":"10154478058311320","commenter_b":"She needs to be fired.","commenter_a":"Angela Russo","post_message":"Shameful...  are going to have to take me off the line, because I am not serving that.  And that was how a uniformed police officer was treated at Noodles & Company when she was denied service. @webpagelink"},{"comment_id":"418283194962942","commenter_b":"They are all criminals, that why they call them Illegals.","commenter_a":"So you want to prioritize sending back students & children before the criminals. I see.","post_message":"This Texas judge is boldly standing up to the White House. Should more follow his lead?"}]
