[{"comment_id":"10153595852746336","commenter_b":"Which one is the women??","commenter_a":"Girl power!!!!","post_message":"26-year-old Capt. Kristen Griest and 25-year-old 1st Lt. Shaye Haver will become the first women to wear the U.S. Army's coveted Ranger tab when they graduate alongside 94 male soldiers Friday at Fort Benning."},{"comment_id":"10153100917462994","commenter_b":"And crazy women too","commenter_a":"Try a tour of Detroit, New York, and Green Bay. Anyone can do Florida lol.","post_message":"\"I get treated really horribly. Actually the emotional part is much worse than any physical pain I go through.\""},{"comment_id":"10158795471470206","commenter_b":"My smartphone is a machine-gun!","commenter_a":"Journalism....there's the headline, then there's the complete opposite being stated in the article. Maybe the journalist just didn't understand that big word 'refuted'.","post_message":"The Superior Court of Justice decided to punish the players for failing to play their match."},{"comment_id":"598436243672056","commenter_b":"Henry Kissinger told Hillary that she can delete the emails too.","commenter_a":"Sure Killary doing what she does best: lie and blame somebody else for what she has done wrong.","post_message":"Hillary Clinton told the FBI that Colin Powell twice recommended using a private email account, according to sources."},{"comment_id":"1513630462010754","commenter_b":"Be careful what you wish for; you might just get it.","commenter_a":"jijijiji....","post_message":""},{"comment_id":"1678077472472997","commenter_b":"Fuck all Muslims and let them go to hell!!!!!","commenter_a":"So sad. It's bad enough that the boy lost his life, but for the Father of the murderer to defame his character is just too much.","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack  This is tragic. His died with honor, let's send our prayers for his family.  Can we get 100,000 'LIKES' for him and his family?"},{"comment_id":"10153844548482894","commenter_b":"Girls dem suga 😁 get well mi fellow Jamaican .","commenter_a":"Aww cmon now not Beenie Man","post_message":"Beenie Man Contracts Zika Virus, Forced to Miss OVO Fest Performance"}]
