[{"comment_id":"10152782186121130","commenter_b":"I can't even blame her decision(which I do feel is extreme) but seriously what's with these whacky doctors who are willing to do these surgeries, where's THEIR head? Enormous breasts, huge ridiculous lips, \"body fillers\" etc it's disgusting.","commenter_a":"Miss dumbdumb. Shame ppl just can't accept what nature gave them. Or at least find safer ways to enhance/change.","post_message":"\"I'm paying now for my vanity.\""},{"comment_id":"10154539619803433","commenter_b":"he has never cared about facts, just rambles, surprised that so many people are taken in...oh wait many people were taken in by Hitler also, very similar","commenter_a":"Trump, pay attention; you are wrong!","post_message":"In an attempt to defend his recently linked offensive comments, Trump claimed Clinton laughed at a 12-year-old rape victim. False. @webpagelink"},{"comment_id":"966993893421492","commenter_b":"Republicans and Democrats been divided .. how did he divide us.. two different view points","commenter_a":"Can't wait for Obama to get out of there so things can go back to normal once Trumps in there to clean up the mess!","post_message":"UPDATE: The White House lockdown has been lifted. Secret Service agent shot an armed suspect outside the White House compound after he refused to drop his weapon.  Breaking News: The White House is on lockdown after reports of a shooting nearby. Secret Service members and police officers are getting people off of the White House North Lawn. @webpagelink"},{"comment_id":"596965907173588","commenter_b":"They BORN there.need to FIX their OWN Country..DON'T COME MESSING UP 'OURS;~~","commenter_a":"Trump will make american tax payers build the wall not mexico","post_message":"Trump Better be Serious about Border Security Promises"},{"comment_id":"1163757976970226","commenter_b":"The man was certainly considerate in this instance.","commenter_a":"During his eight-year presidency, [George W.] Bush did take 879 days of vacation, including 77 trips to his Texas ranch.","post_message":"Wow. I never knew this about George W. Bush. When he was in the White House, he would never leave for Christmas vacation until the day after Christmas. His reason for doing so was simply amazing...  This story really illustrates the difference between Bush and Barack Obama..."},{"comment_id":"10153474525188812","commenter_b":"Is she a Mormon? Cause those kinds believe differently.","commenter_a":"This is not ok!! he has said God made him wrong, God is NOT a liar and He makes no mistakes....repent cause looking like you made a true blasphemy against God, please don't comment ignorance, if you have an issue take it to God.....","post_message":"NEW: Meet Caitlyn Jenner -- formerly known as Bruce Jenner: @webpagelink"},{"comment_id":"10152856733741051","commenter_b":"Cheryl, get real, freak!!","commenter_a":"He is a Race Baiter distracting from what he is secretly doing to America. His agenda is clear to me, DESTROY AMERICAN FROM WITHIN!!!","post_message":"President Obama hopes that Wednesday night's shooting of two police officers doesn't distract people from one really important fact about Ferguson."}]
