[{"comment_id":"10154390282749411","commenter_b":"Yeah, only to let them in later since we have open borders with yhem","commenter_a":"@username Lessa Katherine but sure.. let them into europe haha","post_message":"'This is my sincere thought'"},{"comment_id":"660877367410427","commenter_b":"RACISTpig fucker","commenter_a":"Fuck you nigger u suck anyway","post_message":"Can i get a collective \"______this Guy\"?  Shop.tacticalshit.com"},{"comment_id":"10153363571284087","commenter_b":"Gun control is always pushed by angry racist white people @webpagelink","commenter_a":"We lost the battle for gun control when Republicans refused to do anything after Sandy Hook. If over 20 dead children doesn't motivate them to do anything, nothing will.","post_message":"“When are we really going to stand up and do something? Just who has to die? Your mother, your wife, your son or just how many?” Rep. Robin Kelly asked her colleagues in Congress. “We need to stand up, speak up and take action, rather than another moment of silence. It’s deafening, and it’s killing us.\""},{"comment_id":"984113211608432","commenter_b":"Why are girls doing this! It's so ugly!","commenter_a":"Elle Paiva-Wilson","post_message":"In a dangerous new beauty ritual, teens are sucking on shot glasses to pump their lips, then posting photos of the disastrous results on social media. >>@webpagelink"},{"comment_id":"10153336327911770","commenter_b":"She looks like a c#m dumpster.","commenter_a":"Hillary is a liar murder a criminal and mocks them what a shame","post_message":"Hillary Clinton's campaign mocked the Thursday Republican debate, calling it a \"dumpster fire.\""},{"comment_id":"522223391280988","commenter_b":"@username you do not get it David. Bernie Sanders and Donald Trump are so popular because people are sick and tired of what is currently available. He is not unelectable and Hillary Clinton is going to lose the Donald Trump if she wins and that is not good for anybody in this country. She's going to kill this country","commenter_a":"Why are you so biased towards Hillary? You are supposed to represent ALL democrats!","post_message":"Hillary Clinton was just announced the winner of today's Democratic caucus in Nevada. Congratulations to her and her supporters!  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"870392283014938","commenter_b":"Just deport them","commenter_a":"Let them starve","post_message":"ILLEGAL ALIEN CRIMINALS ON HUNGER STRIKE IN AZ PRISON Give List Of Demands Including Removal Of Threat Of Deportation"}]
