[{"comment_id":"10152608656372894","commenter_b":"Women also cheat with their hearts minds and bodies too soooooooo","commenter_a":"The pic of him with the female outside the car looks like he was taking a pic with someone ... Ppl have cousins sisters groupies fans and friends that they don't sex !!!all these bitter broken hearted ppl jumping the gun obviously wasn't nothing serious he joking about it on Twitter .... Buuuuuut carry on","post_message":"Was Nick Young Caught Creepin' on Iggy Azalea in the Car SHE Bought Him for Christmas? [Photos]"},{"comment_id":"10152967828847061","commenter_b":"Yes legal immigrants ma'am","commenter_a":"I am ashamed at the negative narrow minded comments. Check your heritage. We are all immigrants","post_message":"America Ferrera to Donald Trump: Thanks, your comments will send more Latino voters to polls: abcn.ws/1Iw7NNn"},{"comment_id":"10153111787816051","commenter_b":"I think girls are more likely to want to fight for what they feel at the moment and most of the time it's about nothing. Hopefully when they grow up they will become ladies","commenter_a":"Awwww. Look at that gentle giant trying to help that girl up off that park bench","post_message":"This girl was holding a baby when they surrounded her. She didn't want any trouble, but it didn't matter."},{"comment_id":"910295292400057","commenter_b":"God bless that woman. Sure hope some jerk doesn`t get on her for hitting her kid. He deserved it.","commenter_a":"This is a great mother! I would have done the same thing!","post_message":"A Baltimore mother hailed as #momoftheyear after disciplining her son in the middle of yesterday's riots. That moment was caught on camera: @webpagelink"},{"comment_id":"10153278165616336","commenter_b":"Put down the assault fork and nobody will get hurt!","commenter_a":"Ummm.. Say what fattie? You can't handle food ownership.","post_message":"\"Americans do not seem to be able to handle gun ownership in a way that permits maintenance of a civil society.\""},{"comment_id":"10153381593334411","commenter_b":"If you've been in brothel, you are worse than a prostitute, as prostitutes might were forced to do it, you go there at you own will, which makes you a sleaze-ball","commenter_a":"idk, a Russian backed news organization saying America is a police state? Maybe, but few people are being jailed for being gay here as opposed to your \"glorious\": homeland","post_message":""},{"comment_id":"992066754146411","commenter_b":"No, we don't want their kind here.","commenter_a":"How great it this to see! The same people who have always looked down upon us Tacoma people are now wanting to live here. Sweet justice is here. :)","post_message":"#Seattle workers are moving from the city to #Tacoma -- in the search for more affordable living! [kiro.tv/SEAtoTAC] Do you think:   A. Seattlites shouldn't have to move, rent control please! B. This is making Seattle traffic worse.  C. Moving to Tacoma or a suburb is a good solution.  D. (Your own answer)"}]
