[{"comment_id":"911844395571846","commenter_b":"Hillary is Hillaryous!!!","commenter_a":"Oh great, more solar energy... Solyndra anyone? $535 million more in gov't grants to a failed technology? Better to build a nuke plant AND it doesn't take up as much space, it would take miles and miles of solar panels to even come close to a nuke plants energy output!","post_message":"Do you agree with Hillary Clinton? #DemDebate"},{"comment_id":"1184765608230962","commenter_b":"That works too","commenter_a":"Jenni Mahtinez","post_message":"Have you ever wondered how voting in the caucus even works? Because the answer is pretty weird. - Jon Comulada"},{"comment_id":"10153086796225927","commenter_b":"That's funny cause white asain Mexican Irish an all the others can do it..but somehow the black father is the victim for leaving families an going to make another broken home","commenter_a":"That's crap. You choose your own way like everybody else.","post_message":"LISTEN as Reverend Cecil Blye CONDEMNS government's role in destroying the black family:  \"[T]here can be no Great Society when government involvement incentivizes family disintegration, making it more profitable to cohabit than to be married. ...\""},{"comment_id":"1207705529241702","commenter_b":"@username the majority of Americans correctly believe these people are nothing more than an a animal. They are correct","commenter_a":"Christian values are under attack. The moral fiber of our country.","post_message":"\"The 'struggle for LGBT rights' in America is and has always been nothing more than a pretext for the complete disenfranchisement of Christians.\""},{"comment_id":"806494949541082","commenter_b":"The same way , but don't get caught . You will go to jail and stay . They get a pat on the back !","commenter_a":"Bullet to the head","post_message":"Muslim Terrorist Arrested After Threatening FOX In The Worst Way Possible.  Radical Islam is becoming a domestic threat.  How should America respond?"},{"comment_id":"819559654746124","commenter_b":"PS I certainly hope he doesn't think he's in the same league as Martin Luther King he's not fit to carry his shoes","commenter_a":"MLK Jr. Yes, Al Hell No !!!","post_message":"Martin Luther King, Jr. was a principled Christian who stood for his morals and convictions when fighting the Jim Crow in the Democrat-controlled South. For his courageous efforts, he paid the ultimate price.   Do you support MLK, Jr. and oppose Al Sharpton?"},{"comment_id":"1095120020511481","commenter_b":"Can you imagine a women asking for that to happen What an ass","commenter_a":"rapper bitch needs to be hung .....","post_message":"BOOM."}]
