[{"comment_id":"10153262591601051","commenter_b":"Hahaha, what the hell are you? Nothing but a Hispanic niigger. But you think you're better.","commenter_a":"Fu¢k niggas","post_message":"Here's what these protesters chanted while they were being escorted by police."},{"comment_id":"10153745269073984","commenter_b":"that bitch needs to be in prison, hell yeah she and this country need her to just go away.","commenter_a":"Yes. She is wasting our time!","post_message":"A Fox News correspondent just revealed one surprising thing about this Hillary event that you won't see on TV, and it's definitely an embarrassing moment for the Clinton campaign.  Do you think Hillary Clinton should drop out of the presidential race?"},{"comment_id":"1136767329692020","commenter_b":"Poor Bill has to wake up next to this. OMG no wonder he did Monica.","commenter_a":"Sorry had to leave, Now back To the Butcher of Benghazi Karma Hillary Clinton","post_message":"Hillary, EXPOSED!!"},{"comment_id":"1611331605832486","commenter_b":"Just the fact that Hillary has a list long enough to get e locked up for life, and she's still a president candidate shows how rigged the whole system is...","commenter_a":"Lier.","post_message":"“Of course the elections will not be rigged. What does that even mean?”   President Obama called Donald J. Trump’s claim of a rigged election “ridiculous,” saying \"At the end of the day it's the American people's decision.\" @webpagelink"},{"comment_id":"10153315866223812","commenter_b":"Still none of this warrants being shot in the back...","commenter_a":"The officer has the suspects identification so was a foot chase even warranted since his address is on the ID...this man could have been picked up at anytime...seems like the officer used extremely poor judgement.....","post_message":"WATCH: Newly released dash cam audio and video shows Ofc. Michael Slager and Walter Scott before fatal shooting: @webpagelink"},{"comment_id":"949813105041545","commenter_b":"Yes cuz girls are such disappointments. SMH.","commenter_a":"3Girls.....maybe a son in the future","post_message":"“I Am Up Every Three Hours With The Baby.\" Ludacris On Diaper Duty With Newborn, Cadence"},{"comment_id":"10153134788679411","commenter_b":"Punk assed bitch!","commenter_a":"Blah! Blah! Blah!","post_message":""}]
