[{"comment_id":"10153542533598352","commenter_b":"Wtf.....it's not like her f ing nipple is sowing or something.....how about telling the girl who come with the dress so short they can't bend down to pick up something.....how about telling the girl with their clothes so tight they can't breathe.....sweetheart enjoy your time screw them.....if they still messing with you just let hulk out and tare the place apart....well I would....I can't have fun no body having fun","commenter_a":"That's messed up they just trying to find things wrong","post_message":"Mother slams school officials who insisted her daughter's floor-length, long-sleeved prom dress was 'too revealing', claiming they 'targeted' her because she is 'plus-size'"},{"comment_id":"1877645852479520","commenter_b":"Me thinks Conservatives protest to much! There was no outrage when Sen.Foley was exposed for pedophilia, in fact 36 other senators wrote impassioned letters begging for mercy for Foley. Trump bragged about oggling young girls naked at Teen Miss America and 46 million people didn't think it was a big enough issue to prevent a pedophile from becoming President. It is clear Conservatives sexual icing children is okay!","commenter_a":"Karma!","post_message":"BREAKING"},{"comment_id":"609436732514253","commenter_b":"She is a bitch","commenter_a":"Obama deserves no respect People who turn away from the very truth that is staring them in the face, will learn all too soon what these represent. This will be the beginning of the end. People have no idea what Hilary and Obama are doing behind our backs. Their evil and hatred goes much deeper and more wide spread than you can imagine. This is not a joke, it is coming.","post_message":"Some say this sign is extremely disrespectful to President Obama and should be removed on that basis alone. This man says it's his property, and the First Amendment gives him the right to keep the sign up. Decide for yourselves who is right."},{"comment_id":"481936961966259","commenter_b":"He was the saviour of Manchester last season You fickle lot Haha","commenter_a":"When i read what those nukes are capable of,and that there are people who'd use them,I honestly despair for the human race...","post_message":"Each warhead has an explosive power about 22 2/3 times larger than the Hiroshima blast."},{"comment_id":"10153746096543984","commenter_b":"shut Obama down, stop paying congress until they do their jobs","commenter_a":"not a dime til this is resolved","post_message":"Obama has just announced the number of Syrian refugees the U.S. will take in, and liberals aren't too happy about it.   What do you think the U.S. should do about the Syrian refugee crisis?"},{"comment_id":"10152746929711167","commenter_b":"Name a lie, Grace? You've apparently chosen to forget the lie about \"sharia no-go zones in France!!!!\" that Fox had to retract. Of course you forgot it--you wipe your brain before turning on Fox News, don't you?","commenter_a":"You've got to love the weasel attempt by the corporate media to create a special category of \"non-journalism journalism\" for Fox News and Bill O'Reilly, whereby they get to brag about being \"Fair and Balanced No-Spin Zone\" news reporters and join the White House press corps, but get a free pass to lie to their audience.","post_message":"Normally, you can't get this many Americans to agree what color the sky is."},{"comment_id":"1788613674701059","commenter_b":"Shut up hoe","commenter_a":"It amazes me how rude some of you people can be . They're having a fucking child! Like come on now , stop being so immature talking about \" he's carrying the baby , \" or \" his girlfriend looks like a man\". Smh people 😒😑. Congratulations Dj Khaled & Nicole Turk ❤️","post_message":"Baby Alert! "}]
