[{"comment_id":"10155973648509199","commenter_b":"This Woman is money smart. Say it with me. This Woman is money smart. She will wind up moving up at her job to the highest position, paying more taxes, and bettering her life. People around her will be better from her life. She will put out better quality in everything she does or touches. It can all start with positivity here and with acknowledging that this Woman is money smart.","commenter_a":"Those berating the mom...it is her employer who is getting the \"subsidy\" by being able to make more profits by paying wages families cannot live on - of course they also can sell things for less, so consumers pay less, so they benefit. Wondering where she lives that that's a years rent, where I live that's a couple of months. Messed up system, but glad for her fam.","post_message":"\"Instead of buying my kids the latest Jordans or fancy electronics, I paid my rent for the YEAR. I a single mom and I do it all by myself on a minimum wage job.\""},{"comment_id":"10153132227035326","commenter_b":"great white mess","commenter_a":"White Affirmative Action.. Donald Trump- another great White Hope! Trump joins a long list of rich entitled white boys who, were it not for their daddies, handing them everything on a silver platter, would have probably ended up on public assistance. Trump represents everything that is wrong with America. He is a gaudy bully and fake gold plated braggart who has showcased his business and moral acumen through a unending series of bankruptcies and divorces. He is a racist grifter and a criminal environmental rapist. In terms of patriotism and service to country, Bush, Romney, Cheney, Trump did not serve this country that they profess to love. But none of these fake ass patriots apparently have any qualms about sending other American children into harms way. For this crowd of \"real Americans\" it's all about the Benjamins and what's in it for me. If America needs a cautionary tale as ...","post_message":""},{"comment_id":"510533845803862","commenter_b":"Leave you camel humpers","commenter_a":"get OUT","post_message":"This Fox News reporter was absolutely disrespected by these Muslims.  They are out of control. If Muslims are going to live in our country they need to learn some manners.  Do you agree Muslims have to assimilate or get out?"},{"comment_id":"10153877840551337","commenter_b":"I always hated rousey I'm glad her ass got knock the fuck out","commenter_a":"Truth is holly Holm is a real fighter n Dana white thought he picked another easy girl for Ronda to destroy well plan back fired ,Holm is a real fighter and real champion now let's see her n cyborg fight two top fighters Rousey is finished","post_message":"DAMN: Holly Holm didn't hold back with these comments about Ronda Rousey."},{"comment_id":"10153372677575950","commenter_b":"And Kaye Townsend you are an example of an ignorant Bitch","commenter_a":"Screw going to the hospital to better anymore. Lets post getting shot and see how many likes i get","post_message":"Shortly after being shot in her car, a woman turned to Facebook to send a video message to loved ones: \"Mama I'm bleeding. I know they shot me but it's good. It's good.\""},{"comment_id":"1003105503069410","commenter_b":"Taryn ignore her, she will forever think she is right about everything even though she's not","commenter_a":"Or we could just let every woman decide for herself.. If you don't agree with abortion, just don't get one. But that doesn't mean other people should be forced into the way you think..","post_message":"Not a bad thought - Let us know if you agree!"},{"comment_id":"10154099189924071","commenter_b":"Killary is an Embarrassment ,she evidently has no idea how to run an office Legally or with Class. What she poured into this election was ill gotten money. She sure didn't use her own. I Honestly feel her major Dissapointment is her self absorbed issues that would have only added more money to the Clintons Fraudulent Foundation . Being a Great Nation is now much more attainable without corrupt Killary and the rest of her lackeys.","commenter_a":"Wow. So much hate on these posts. I hear a lot of people upset about the protests going after she lost but it seems like there are just as many sore winners out there. Whether you like her or not, people need to learn some respect. I guarantee 99.9% of the people on here haven't the foggiest idea what it takes to hold a high ranking position in our government or run for president. She poured a lot of time and effort into her campaign and to still come up short must be a major disappointment. I'm sure a lot of people have done less and been more hurt by their own failures. I thought this was a country of conscience and good will. This election has proved we are much further from being a great nation than we claim.","post_message":"“I know that over the past week a lot of people have asked themselves if America is the country we thought it was.\""}]
