[{"comment_id":"985729194809437","commenter_b":"Having the private server in itself is breaking the law Please get her out of the nomination cycle now","commenter_a":"Coverup","post_message":"Why did the State Department do this?"},{"comment_id":"833282530101334","commenter_b":"Oh Terry your pro pic explains it all lmfao","commenter_a":"Tell me what isn't wrong with this picture.","post_message":"Bush. Romney. Utah. One day only."},{"comment_id":"897157403654934","commenter_b":"she gave her all, wasnt a armchair quarterback","commenter_a":"She did it great","post_message":"“It took heart, guts, determination, falling down and getting up, and a little motivation from the crowd to get across the finish line.   Check this out.”"},{"comment_id":"824116754360678","commenter_b":"Not one of them will be caught, and not one of them feels guilty.","commenter_a":"My gosh, where did these barbarians come from ??","post_message":"“When my son left, he had a broken basket and was hysterically crying,” one mom said."},{"comment_id":"10155058445841509","commenter_b":"Well shoot - if Queen says no to him, how dare he run for President...lol - let the woman with the impeached husband take over!","commenter_a":"Not only was part of Melania Trump's speech plagiarized (word-for-word) from Michelle Obama... Also...Both the guitarist and the record company for Queen refused to authorize Trump Inc (and all political groups) to use their song \"We Are The Champions\"...but of course that boundary was disrespected by Trump. Is this a Prank Show ??? THIS is stranger than fiction. When are they going to say: \"Ta-Dahhh!!! Y'all just got Punk'd!!!\"","post_message":"JUST IN: Speaker Paul Ryan announces Donald J. Trump \"has been selected as the Republican party nominee for President of the United States.\" @webpagelink"},{"comment_id":"1960555887503751","commenter_b":"TRUMP! Go, go go ... Defeat that evil woman and make America great AGAIN!","commenter_a":"Killary is a beast and needs to be in prison........TRUMP is the only candidate that deserves to be president","post_message":"I will defeat Hillary Clinton - and MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153233796523717","commenter_b":"If she did this to one of my children, she would be begging to go to prison or she would beg for the death penalty!","commenter_a":"Judging by similar cases involving females, she will probably get probation.","post_message":"A Concord woman arrested last week faces multiple child pornography charges. The arrest was made in connection with an investigation started by Hollis police: @webpagelink"}]
