[{"comment_id":"10154089965446336","commenter_b":"Yeah, lice likes very clean hair. If you put products in their hair it's likely they won't get it. Oily hair care products are","commenter_a":"It's not super lice it's called...ignorance. Schools inform by sending a note that lice has been found in the classroom. The person is not identified at all..not even to the parent. Infested child goes untreated. Why? The same reason some are abused and some are not, the same reason some parents care about their children and others don't. Children are going untreated and/or not treated properly. This has been going on for years.","post_message":"What can you do if your child is affected?"},{"comment_id":"1041407739283520","commenter_b":"Where's BEYONCE crying out against these BLMers?? Or is she FOR IT ALL???","commenter_a":"When will America wake up these people must go","post_message":"\"We must continue working to build trust between communities and law enforcement.\"   Watch Attorney General Loretta Lynch address the #Dallas sniper shooting that killed five police officers."},{"comment_id":"10154268169886409","commenter_b":"You are just like all the other trump bashes before u run your mouth have your facts straight instead what other haters say","commenter_a":"Hitler Trump should be impeached we need to start a petition like the U.K. did to ban him from the U.S. because his a embarrassment. He is the real criminal, he committed fraud, his involved with Putin and hacking the election in his favor, he refuses to show his taxes because he probably commited fraud if he doesn't have anything to hide then he should show his taxes. He did not put his businesses in a blind trust he continues to profit from his businesses while his in office. He hasn't paid taxes in over 20 years you Trumpeters created this monster by continuesly supporting him now his out of control.","post_message":""},{"comment_id":"10153878198208984","commenter_b":"Decrepit old Hellary needs her fatA$$ ship sunk already!!! DESPERATION makes her even uglier!!!","commenter_a":"everything about this bitch is fake.","post_message":"Wow. Hillary is in a rough spot, and what was just revealed will NOT do her any favors. I knew she had sunk low, but I didn't realize she was this low...  Do you hope Hillary loses in 2016?"},{"comment_id":"1238390432847651","commenter_b":"Shut up Head","commenter_a":"THE FACTS ABOUT MUSLIMS ------ MUSLIMS are not here to assimilate. Muslims have NEVER assimilated to any society. ... THEY COME TO: ... * Force THEIR\" traditions, beliefs & political system upon us. * Delete our Traditions, Beliefs, religions & political systems. TECHNICALLY SPEAKING: Islam is NOT a religion. Islam is a \"political ideology/government\" hell bent on erasing all OTHER religions & ruling the world. Islam is hell on Earth... Eradicate this so called religion. SPREAD THE WORD, COPY & PASTE!!","post_message":"Seven civilians, including three women and a child, have been beheaded by suspected ISIS-linked militants in southern Afghanistan."},{"comment_id":"966104673465761","commenter_b":"Islam. Definitely will Dominate. ....... Hell of Course","commenter_a":"So America here is the hope and change policy everyone voted for. And the new world order. Question. When are we as voting and tax paying Americans going to say enough is enough. These punks can speak bad about God and Jesus. But God forbid if you speak bad about a child molesting prophet like mohmed. Or that false god like allah. Islam is a belief base and history and likes. We all know that Mohamed made promise to entice the people to fight lIke animals by promising them virgins. Where in the middle east are you going to find a virgin. All the goats are taken. Our courts need to grow a spine.","post_message":"Is Obama Trying to Establish Islam as our State Religion?"},{"comment_id":"10153137548926051","commenter_b":"Obviously had to have his eyes closed, or blind to begin with!!! Maybe blind and she had a sexy voice!!! NAH.... Couldn't see something this ugly having anything sexy!!!!","commenter_a":"This unfortunate woman needs anger management & some AA meetings. A bit of dental work and make-up wouldn't hurt either--She was probably brought up in poverty. sandi","post_message":"When this woman's boyfriend refused to get intimate with her, she snapped."}]
