[{"comment_id":"415868471934780","commenter_b":"as soon as they put one foot on our soil we must be ready to drop bombs on them.","commenter_a":"I am ready for them arats.","post_message":"They're here!!"},{"comment_id":"10154810175428812","commenter_b":"@username, sthu sodomite and go back where you illegally camd from before we deport you and your family.","commenter_a":"That deal needs to be voided. Why would the U.S.A provide this animals with more weapons? That is ridiculous,they are responsible for so many deaths of innocent people and some of those terrorists are amongst us her in the USA causing death and destruction.","post_message":"Senate expected to vote this week on a resolution to reject a pending arms sale from the U.S. to Saudi Arabia following reports of civilian casualties in Yemen at the hands of the Saudi-led coalition."},{"comment_id":"608627489270433","commenter_b":"More like the other way around...in Indian culture it's arranged for money issues, not love...and then the wife's are treated like maids...atheist she can be a maid to a person who loves her, for her and not for the money","commenter_a":"At least he didn't end up stuck with her.","post_message":"This has to be the worst Bride OF ALL TIME!"},{"comment_id":"1360485817324205","commenter_b":"She is so stuck on herself. She thinks she's some sex goddess that's all she talks about. Blaaaaa get her gone I say!!!","commenter_a":"Dennis, please read the below with your comments","post_message":"SEAN STRIKES BACK AT MEGYN.  Good.  Now she's at odds with Hannity & O'Reilly.  See what Hannity wrote to her:  @webpagelink"},{"comment_id":"10157769548850725","commenter_b":"Go kick her butt.","commenter_a":"you go donald !","post_message":""},{"comment_id":"1037048666341760","commenter_b":"Cherokee Hinrichs quickly and painlessly?? Maybe for the one having the abortion, but the living baby that's being killed feels it!! Your another disqusing excuse for a woman!! Be ready for your judgement day, God will sent you straight to hell along with all the other disgusting women who kill babies!!","commenter_a":"Stop the madness. Repeal Roe v Wade. It is a choice. Choose life.","post_message":"Real doctors protect the Sanctity of Human Life!  Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb179"},{"comment_id":"1746275522311169","commenter_b":"Larry, I didn't say \"fire a weapon,\" I said \"purchase and carry a firearm\" Should a gun shop sell a firearm to an 11 year old?","commenter_a":"Back then it was muskets against muskets. Now we have semi autos and the government has fully autos. Seems like we are already behind with the second amendment.","post_message":"#LiberalLogic"}]
