[{"comment_id":"857055204364524","commenter_b":"Just proves that he's good at beating up women too. And it's probably more fun since the women can't punch.","commenter_a":"Manny is no angel","post_message":"Floyd Mayweather has been charged with domestic violence on six separate occasions, convicted on five of those charges and has only served two months in prison, never receiving any penalties from the Nevada Athletic Commission regarding his professional boxing career."},{"comment_id":"1333345700010236","commenter_b":"get over it Bitch","commenter_a":"Of course his idiotic supporters fall for it. He's giving himself a massive tax cut which pales in comparison to his pittance of a presidential salary. He forgos the salary and looks like hero as he robs us blind. It's not even a good con but his supporters are great marks","post_message":"Trump says he already has enough money, so he's going to work free of charge as president. Do you admire his decision?"},{"comment_id":"10153528631451955","commenter_b":"What a cunt! I hope she ends up in jail!","commenter_a":"She's been divorced 3 times. If god forgave her for that 3 times, he'll forgive her for issuing a gay marriage license once haha","post_message":"DEFIANT: Judge orders KY clerk to appear in court after she again denies gay marriage licenses..."},{"comment_id":"480214172160463","commenter_b":"Angry old white woman, I wonder where her people came from? Hell?","commenter_a":"The old lady isn't smart enough to know another language.","post_message":"Portrait of a Donald Trump Supporter. (2015)"},{"comment_id":"10153925563166037","commenter_b":"SarahMasanana. Animals kill their young, adultery, kill for food and have no remorse, you just described the human race! Wow.","commenter_a":"If this were an atheist country and atheist world we would be a lot better off. Much fewer wars and conflict and nobody pushing their BS onto anyone else.","post_message":"\"I think one of the reasons God has been good to us is that we have done him honor. Unlike the other countries of the world that do not even invoke his name we do him honor.\""},{"comment_id":"10154716865434586","commenter_b":"Omg idiots","commenter_a":"What's wrong with people they don't use there heads","post_message":"Dear everyone: Animals are NOT selfie props. This has to stop."},{"comment_id":"10153618033509575","commenter_b":"Seriously? Have some compassion lady","commenter_a":"Dude! Buy an eye patch! Nobody wants to look at an empty socket.","post_message":"An Indianapolis veteran diagnosed with ocular melanoma has filed a tort claim against the VA.  By not ordering an MRI, he says they failed to diagnose a cancerous tumor that not only cost him his eyesight but will take his life."}]
