[{"comment_id":"10153622542063188","commenter_b":"No","commenter_a":"Get serious","post_message":"Would you sign it?"},{"comment_id":"10154150197679714","commenter_b":"It'll crack her make-up!","commenter_a":"Maybe they want to see you smile because they want to see you happy. Happy is a beautiful thing. It's not show me your boobs and make ME smile.","post_message":"So how should Hillary Clinton — or anyone — respond the next time it happens?"},{"comment_id":"10153288827596523","commenter_b":"@username her momma should have taught her manners, and respect, you might consider doing the same.","commenter_a":"That poor little girl just learned she can cause problems, then ignore her teacher and the school administrator and the police. She really learned a lesson, didn't she?","post_message":"The South Carolina deputy who slammed a disruptive student on the floor and tossed her several feet has been fired."},{"comment_id":"1157156847640695","commenter_b":"All we need is more illegal Queers !!!!!","commenter_a":"Bullshit people!","post_message":"American taxpayers must now pay for separate facilities for folks who come across the border and don know what gender they are."},{"comment_id":"1022617317773941","commenter_b":"Is the virus an illegal alien?","commenter_a":"Where's you sense of urgency to find and deport illegal alien fellons!","post_message":"Unlike Congress, Zika infected mosquitoes aren’t going to be on recess next week – they’ll be working. The emerging Zika virus poses a serious threat to our public health, and members of Congress should not leave for recess without passing President Obama's emergency funding to fight this virus."},{"comment_id":"634421746711040","commenter_b":"Yur all ignorant fucks","commenter_a":"Of course he's guilty, adults never have the right to release their anger on minors, no matter the situation!! Smh!!","post_message":"Horrifying footage shows a Texas police officer body-slamming a middle school student. #MicBrights"},{"comment_id":"763958360369439","commenter_b":"A child should not have that choice any more than she can legally choose to smoke and drink.","commenter_a":"With all the people out there fighting for a woman's right to make choices for her body (abortion and birth control) how can you justify forcing medical treatments on someone? Either a person has total control of their body or they don't. Can't have it both ways.","post_message":"After treatment, she's in remission."}]
