[{"comment_id":"10158074030495206","commenter_b":"Take the appearance fee and go home","commenter_a":"Has she claimed racism yet?","post_message":"JUST IN:"},{"comment_id":"931654693541670","commenter_b":"It's not just barbaric, it is one more tool of the rich used to keep the not-rich \"in their place\".","commenter_a":"I guess when you have universal medical coverage you don't realize what a nightmare our system is.","post_message":"The headline really begs the question, who the hell would ever want to visit the United States knowing they could be bankrupted if they should need medical care while they are here?/"},{"comment_id":"10153304939531350","commenter_b":"He's a combo look of Chandler from \"Friends\" and her ex-husband","commenter_a":"Courtney Cox marrying band member Johnny McDaid from Snow Patrol. My favorite \"Friends\" and my favorite band!","post_message":"\"She wants to be the flower girl, all the bridesmaids. She's very excited about it.\"  CC: The Ellen DeGeneres Show"},{"comment_id":"10153354234326336","commenter_b":"Women should only be allowed to make the sandwiches.","commenter_a":"Females should not be prison guards for male prisons. And I don't want to hear from all the feminist. That is my personal opinion.","post_message":"BREAKING NEWS: New York state prison employee Joyce Mitchell has been arrested on felony charges for providing material assistance to prison escapees, state police say. @webpagelink"},{"comment_id":"1091142627573414","commenter_b":"You're a pussy","commenter_a":"Vaccines cause Autism. The risk of giving a few kids Autism outweighs the risk of the diseases vaccines prevent. The government will never admit this but it's the truth.","post_message":"How much more time and money do we have to waste investigating this?"},{"comment_id":"10154378040854024","commenter_b":"Wow! That woman is looking dumber every day!","commenter_a":"Flippin greedy, deranged, bitch whore!","post_message":"“Now this is just getting ridiculous. She didn’t actually meet the standards in PA to have a recount, so she’s going to try to evade them by calling them ‘unconstitutional’. She raised enough money specifically to deal with the fees and then pulled out when asked for it. The whole point is to tie up the electors so they can’t vote for Trump.”"},{"comment_id":"824106447706135","commenter_b":"Just revoke her security clearance. How could she be president without clearance?","commenter_a":"Ohhh I wish!!!","post_message":"Former Attorney General Michael Mukasey has been making the rounds .."}]
