[{"comment_id":"10154164608531438","commenter_b":"Can masculine looking lesbians use the bathroom in your world Dina? Doesn't sound so.","commenter_a":"I think this is a positive thing, but most people I've talked to that oppose that bathroom scenario is not from the perspective of the transgender, but from what harm could come from people abusing that system to gain access to bathrooms they wouldn't normally have access to. If there was a way to guarantee kids and women's and men's safety in the bathrooms, then I don't think people would mind..regardless, we should be teaching both genders to not be dick holes to other people, regardless of what bathroom they most identify with.","post_message":"This moving ad on transgender bathroom rights will air for Fox News viewers during the final night of the Republican National Convention."},{"comment_id":"1187034151348219","commenter_b":"On the flip side the battle is going... ok ish","commenter_a":"\"Hold X to flip over\"","post_message":"Caption contest time! ~Josh"},{"comment_id":"10153446072426545","commenter_b":"Why would that CRAP sell out? It looks like a hooker dress. Either that or she LOST the other half.","commenter_a":"I want to hear more about why the SWAT team was deployed in W FTW.","post_message":"The sisters, who have previously collaborated on clothing lines with PacSun and Topshop, celebrated the launch of their \"first-ever ready-to-wear collection.\""},{"comment_id":"1264994986901695","commenter_b":"I am for the national guard to start rounding up these illegal wetbacks.","commenter_a":"Yes!","post_message":"America's Freedom Fighters"},{"comment_id":"10153387915812756","commenter_b":"I guess there's no zoning regulations ?","commenter_a":"Sad","post_message":"We learned on Monday that it was not the first time the owners of a home in Carbon County had animals removed from their property."},{"comment_id":"1777693052452722","commenter_b":"NOTHING BUT A BUNCH OF FILTHY FUCKING NIGGERS KILL THEM NOW!!!","commenter_a":"Come and get it you cowards. I'm just about fed up with idiots like you. Have you ever looked at who's out number.","post_message":"RACISM: Black Panther Promises To Kill All White Babies.  No media outrage, no riots, nothing.  Do you think they should all be arrested?"},{"comment_id":"10152864481646336","commenter_b":"Zeke...you're the kind of kid that gave the bully in school your lunch money every day thinking it would make him like you. Never worked did it. This is a religious war. It's in their unholy book and no amount of appeasement will fix them. Their founders motto was \"CONVERT or DIE\". This is simple stuff. Read it. Understand it and don't give in to it. I admire the cartoonists for their bravery. That COEXIST bumper sticker should be pulled off every car on every liberal college campus and off every Subaru in liberal Minnesota and sent to some Islamist nation. We coexist VERY well. Our early settlers didn't kill the Indians who didn't convert. Our Founders didn't work that way either. We are not the ones who need the lecture. We wrote the book on getting along. They don't care to read it.","commenter_a":"Dear Muslims....COEXIST.... Or get out... or else.","post_message":"They were four of France’s most fearless and best known political cartoonists – all sought out and summarily executed by gunmen in Wednesday's massacre inside the offices of #CharlieHebdo: Stephane Charbonnier, Georges Wolinski, Jean Cabut and Bernard Verlhac."}]
