[{"comment_id":"10153562923228132","commenter_b":"Please go up and down the beach and tell all of those women to put turtle necks on. I'm sick of seeing all of those boobs hanging out. And while we're at it, low cut shirts too. And tank tops (side boob). Stop being a hypocritical idiot.","commenter_a":"She could show a little modesty! Not everybody wants to see boobs hanging out! We used to be more modest, it's called showing a little class!","post_message":"\"I was really very hurt by this act, because I was in no way bothering him, so what gave him the right to shame me?\""},{"comment_id":"1535105376549586","commenter_b":"We need to deport her ass","commenter_a":"Yes","post_message":"Do you think she deserved 7 months in jail for urinating on a war memorial?"},{"comment_id":"10152963225776135","commenter_b":"I don't have daughters. I have sons. I teach them to keep their hands to themselves. When they're old enough to date, they'll be taught not to touch a woman unless invited. We shouldn't have to tell girls how to not get raped. We should be teaching our boys to not rape.","commenter_a":"When I was becoming old enough to go to parties as a teenager my mother started giving me the heads up about how to act when I went to out. One of the things she taught me was never drink so much that you lose control of yourself, watch who you accept drinks from, don't go to rooms with beds with men, etcetera. I'm curious as to what other mothers tell their daughters? And as a mother of sons around this age I wonder why the guy gets charged with rape if they're both drunk? Doesn't seem quite right to me.","post_message":"Former Tigers pitcher Evan Reed has been sentenced to probation after accepting a plea in his assault case. The victim strongly objected to that plea in court. VIDEO here: @webpagelink"},{"comment_id":"10154770011654330","commenter_b":"Janine Beekman","commenter_a":"Thanks Malloy u duetch bag get out of office u suck !","post_message":"The drug company, Bristol-Myers Squibb, is shutting down several of its facilities, including one in Wallingford. ----> @webpagelink"},{"comment_id":"1292836000742177","commenter_b":"Let her out permanently.She will be a bad influence to our children.","commenter_a":"Good!","post_message":""},{"comment_id":"1044939055565842","commenter_b":"Watch out for the showers.","commenter_a":"Disrespectful, Ungrateful Cretins!","post_message":"Refugees in Germany are being housed in a former Nazi concentration camp"},{"comment_id":"1713989815484209","commenter_b":"The Senate's duty is to listen to its constituents. Therefore it should or should not act on this matter based on what they know we want.","commenter_a":"Oh how quickly Obama forgot that he filibustered the nomination of Supreme Court Justice Samuel Alito in 2006. Hypocrite!","post_message":"\"I have fulfilled my constitutional duty. Now it's time for the Senate to do theirs.\"   WATCH: President Barack Obama says if the Senate does not vote on SCOTUS nominee Merrick Garland, \"our democracy will ultimately suffer.\""}]
