[{"comment_id":"1067809293363821","commenter_b":"Trump is sending all illegal aliens to Mexico even if they are NOT from Mexico?","commenter_a":"Lets see now which border are they coming over? Oh that would be the Mexican border you say. So if they are detained at that border, no matter where they come from, why shouldn't they be sent right back over that border? It should be Mexico's responsibility to police those that are breaking their immigration laws and not letting them flow freely over our border. What is so funny and absurd about this?","post_message":"\"See? Justice isn't blind, she just can't tell Hispanics apart.\""},{"comment_id":"895076240539004","commenter_b":"Angela and Sheira close your fucking legs, Whores!!!!!!!!","commenter_a":"Unborn Baby's are Human at the time of conception.....Duh.....that's not hard to figure out. When you abort AKA MURDER a Baby at any time after conception it is very simple.....IT'S MURDER.....just watch our Court system when a drunk kills a pregnant woman they will be charged with the MURDER of the child as well. There are just some people that will argue against the facts to try to justify MURDER but make NO MISTAKE it's MURDER. Just because you get pregnant and it's inconvenient and you call it abortion, does not change the fact everyone knows in their heart IT'S MURDER.","post_message":"How cool is this?"},{"comment_id":"10153751099450575","commenter_b":"get this ass out of office and then let them rape her!!!!!!!!!!!!!","commenter_a":"Yup!!!!! a little common sense, people....she's the leader of Germany...Oh , sorry, look at the leader of the U.S. He's not smart enough to pick up on this.....well I think he is smart enough , but he's on a fast track to destroy america, so, it can do that!!!","post_message":"Now she admits it after she already destroyed Germany. . . ."},{"comment_id":"1038558619518329","commenter_b":"How many more *illegal* guns are gonna kill people before you relize that if these people want guns, they'll get 'em... Illegal or not... #howmany","commenter_a":"There goes a wasted minute that I'll never get back.","post_message":"This video is packed with more celebrities than we could count — and they have one powerful message for the world."},{"comment_id":"956895434364622","commenter_b":"Thats what she talks out of.","commenter_a":"Thats yet to be proved!","post_message":"Apparently race and gender are the only qualifications necessary to become President if you're a Democrat..."},{"comment_id":"10153499650978132","commenter_b":"She's skanky. ...that's a door the should have stayed closed.","commenter_a":"Why can't she just retire and go away.","post_message":"Pink ambition!"},{"comment_id":"653855578126234","commenter_b":"@username so you are ok with men grabbing women's genitalia.","commenter_a":"And this what mango Moussillini's said immediately after Michelle's speech. Trump on the People reporter who said he sexually assaulted her: \"Take a look. You take a look. Look at her. Look at her words. You tell me what you think. I don't think so.” He is grotesque. My husband never speaks like Trump - EVER. And Trumps cult is now tweeting repealrhe19th. Only weak sociopathic narcissist men like Trump, lie, talk and think like Trump. As for women that support it, are beyond words to me right now.","post_message":"Here's the incredible Michelle Obama speech Fox News refused to air: \"Strong men — men who are truly role models — don’t need to put down women to make themselves feel powerful.\""}]
