[{"comment_id":"504925023037210","commenter_b":"Geez. Is that OLD gal still around?","commenter_a":"She might find out how Hilter was if Hillary gets elected that your guns take away your health care tax away all your money distribute people money after the rich and powerful take most of it. OH MY GOODNESS THAY COMMUNISTISM","post_message":"According to the great celebrity-turned-philosopher Cher, Trump is now a genocidal murderer..."},{"comment_id":"1788538208028189","commenter_b":"those look hellllllla good 😍😍😍","commenter_a":"@username LOL DUDE","post_message":"Insanely delicious."},{"comment_id":"1111833728854862","commenter_b":"These women must be screwed up in the head! Why would you throw everything away for a sixteen year old BOY? They should have gotten their kink a little more reasonably.","commenter_a":"\"Endured\"","post_message":"The parents of a male teen student who endured a 9-hour threesome with a pair of blonde high school English teachers have sued the teachers as well as the deep-pocketed local school board."},{"comment_id":"1021502754552734","commenter_b":"Sammy Rose Dunaj Emmett Lally","commenter_a":"Serge Ermakov","post_message":"Save $26 on an Amazon.com Prime subscription."},{"comment_id":"10156562504755354","commenter_b":"Just make sure you have plenty of their special food and make your women cover up head to toe.","commenter_a":"Nope. I wont be where terrorist refugees gather","post_message":"So his plan is to have businesses display his \"Refugees Welcome\" stickers in their windows to attract customers.   Question: If you saw a \"Refugees Welcome\" sticker in a business window, would you reward them with your business?"},{"comment_id":"456392161152491","commenter_b":"i dont spank my daughter and she is extremely well behaved. she says please and thank you and your welcome at the appropriate times. she is VERY advanced for her age. I am enrolling her in MMA classes to teach her not to be a little \"bitch\" as you put it. and because she came from my loins, she will be a force to reckon with","commenter_a":"Spanking children teaches them consequence for actions. It also teaches you not to be a little bitch.","post_message":"So what are the alternatives? We look into them:"},{"comment_id":"10157577335255389","commenter_b":"Gonna rain in wall street. The same ones you took millions from you pathetic lying hag","commenter_a":"its hard to listen to her speaks! the first thing came out of her mouth was Trump says did and Trump says that and what Trump did! nothing change she offer nothing! she looks doll up but still a liar!!","post_message":"Journalism. Is. Dead."}]
