[{"comment_id":"10153216649359705","commenter_b":"Heterosexuals have rights to same sex bathrooms","commenter_a":"PA-THE-TIC! Only country in the world that does this garbage!","post_message":"White House staff now have access to an all-gender bathroom. Here's why it's important."},{"comment_id":"1346176708775407","commenter_b":"Tell that to the two","commenter_a":"God had promised us He will not wipe out humans on the face of the earth any longer therefore the doomsday theory can NEVER happen. It is just a figment of imagination in the mind of the writer of this article. I will rather suggest he asks 'what would happen if Rapture takes place now?","post_message":"What the world would look like if doomsday struck and humans were wiped out"},{"comment_id":"10155894107865389","commenter_b":"I suggested the other day that we send them ours. We send two criminals for every illegal that comes to the U.S.","commenter_a":"We need leaders with strong convictions for the right thing","post_message":"ICYMI: Last night on 'Hannity,' Donald J. Trump doubled down on his stance on illegal immigration, telling Sean that the country of Mexico is “sending us their criminals.”"},{"comment_id":"10153133093676491","commenter_b":"OMG IK WIL DIT NU AHH NERD FEELS OVERLOAD","commenter_a":"@username Bram Van der Maat","post_message":"Attention, fans of The Lord of the Rings Trilogy."},{"comment_id":"10156372477690725","commenter_b":"Just another day of gun violence in America while populace is politically (incorrectly) correct. It is a crippled world, American leading the way as it is not in most other categories! Muslims are top o' the list for violence...they can't convert us, so their gut wish is to kill! Facts speak for themselves!","commenter_a":"Trump 2016","post_message":"CRIPPLED AMERICA is perfect gift for friends & family. Order signed copy & join me tonite live streaming 7:30."},{"comment_id":"653257648132607","commenter_b":"I agree. Fuck Kim Kardashian! She is trash.","commenter_a":"So a woman who's apparently famous for releasing a sex tape of her getting pissed on gets robbed of 10 million dollars worth of jewellery. Who the Fuck cares.?","post_message":""},{"comment_id":"1038233369545417","commenter_b":"Can't stand her!","commenter_a":"I stop to watch her program Always bashing on the same person all the time ! I did think that during the first debate the question was legitimated after all he has to respond because the question was going to be asked from her or somebody else But after all the bashing my trust in what they call fair and balance news under her reports was gone and I was certain that She did have an agenda by starting by this type of question Also what is making me mad is all the spin around her the queen She giggles all the time even when her guests are vulgar in her program It made me laugh when I ear that she is a respectable journalist and fox stands for her Did they listen when she was giggling from her heart when somebody said that during one of the debate \" ...","post_message":"Megyn Kelly didn't hold back! (WATCH)"}]
