[{"comment_id":"10152561774511813","commenter_b":"Gigantic assholes.They should both be ass-raped, and have the first miracle ass-babies. See how they feel about the issue then.","commenter_a":"ACLU Are you helping folks like this from gov't overreach? @webpagelink","post_message":"Are these people who we want to make decisions about a woman’s reproductive care? Tell politicians: don’t turn back the clock on women’s healthcare. @webpagelink"},{"comment_id":"1542774025748103","commenter_b":"As usual women come ro the rescue","commenter_a":"What kind of crap insinuating Hillary in this???","post_message":"YES!"},{"comment_id":"10153223686721336","commenter_b":"Why is she still walking around and not in an orange jumpsuit?","commenter_a":"Is she resigning? That would help B'more get better.","post_message":"Moments ago, Mayor Stephanie Rawlings-Blake said Baltimore will get through the devastation of the last few days and that the city will only get better."},{"comment_id":"10154325825161051","commenter_b":"Um I think this woman is a incredibly ignorant idiot, you can see anything in everything if you are looking for it. It is just a design of lines, what a dumbass","commenter_a":"If it offended you dont buy it.What's wrong with these cry babys","post_message":"Here's the Walgreens wrapping paper that had this lady outraged."},{"comment_id":"10153799327541336","commenter_b":"He was not hitting her I hope.she spends years in jail,she could have killed that officer","commenter_a":"Got Her.","post_message":"A woman used her car as a weapon and knocked over an Auburn Hills police officer to flee a traffic stop. Breianna Smart was caught and arrested."},{"comment_id":"10153064930639135","commenter_b":"She should be returned to New Jersey. So should it's Governor.","commenter_a":"Why wait until the end of August? Drop out now and avoid two weeks of mental anguish. It's over for you, which is a good thing for America.","post_message":"President Obama and Secretary Kerry, now that we have an American flag flying in Cuba, I urge you to demand the immediate return of Joanne Chesimard to New Jersey.  Like so many others, the families of her victims continue to suffer under the Castro regime. Justice must be served."},{"comment_id":"10153991285739091","commenter_b":"How is he disrespecting the vets? I'm confused","commenter_a":"Think of all the people fighting for our country show a little respect 🇺🇸","post_message":"San Francisco 49ers quarterback Colin Kaepernick plans to take his peaceful protest against racial injustice and police brutality \"a step further.\" He says he will donate $1 million to help in the effort."}]
