[{"comment_id":"633195336830149","commenter_b":"Illegal invaders","commenter_a":"Feed them, clothe them. Try to teach them in our schools. Send them back where their parents came from.","post_message":"Where are their parents?"},{"comment_id":"477818462421667","commenter_b":"Good for him, we support him 100%. If the Muslims can burn our Flag we can burn theirs.","commenter_a":"Burn it!!! And send it back to hell where it came from.","post_message":"VIDEO: College Students Burn ISIS Flag And Muslims Are Outraged. SHARE to support these students are taking a stand against those ISIS pigs!"},{"comment_id":"1082747785100183","commenter_b":"Stfu pussy.","commenter_a":"Oh look! Americans shooting animals for fun! why are people shocked by this? Also these are HUNTERS not POACHERS, poachers take things from the body for monetary gain, hunters just kill either to cull or for pleasure. All hunting should be banned! We have no right to kill for pleasure, kill to survive as that's the order of things but never for pleasure.","post_message":"Another iconic animal lost to hunters."},{"comment_id":"10154602840309877","commenter_b":"It's not going against the majority, it's supporting a fascist bigot. Only a fool wouldn't know the difference! Girl bye! Your post was asinine.","commenter_a":"Dang....wow. That was unnecessary. Smh So if you go against the majority then you get fired or blackmailed. Yeah, okay. That's totally okay, just sit down, shut up and get on the broad path like everyone else.","post_message":"It was all good just a week ago."},{"comment_id":"1232217873516420","commenter_b":"Female dog","commenter_a":"Convicted felon","post_message":"I want to see what you all come up with... Describe Hillary in just two words... Ready, set, go!"},{"comment_id":"10153463579731130","commenter_b":"but who knows maybe if she doesn't get her orgasm, she'll cry rape, and because society is bent towards believing women only on their word alone, you will be sent to jail to get butt raped.","commenter_a":"Men don't \"owe\" you orgasms End sexual entitlement","post_message":"🙌"},{"comment_id":"10153645733937217","commenter_b":"@username dude your wife looks like a yeast infection","commenter_a":"Oh god. Hillary can potentially become the next president, yet Nixon was almost impeached for missing tapes and she has thousands of missing emails. Wow people are incredibly stupid these days!","post_message":"\"Next January, I want to be sure that it is Hillary Clinton who takes the oath of office, not Donald J. Trump\" writes California Governor Jerry Brown."}]
