[{"comment_id":"827935373908552","commenter_b":"A straight shooter, she would do this country good","commenter_a":"Barack Obama is NOT furious about anything Sarah Palin does or says; he is the President of the United States, and she is a moron.","post_message":"Sarah Palin lays into Obama for this reckless call!  Do you agree with her?"},{"comment_id":"755539251303319","commenter_b":"Send the bitch to jail and strip the bed sheets off of her","commenter_a":"Your in US lady you must obey the law... I'm sure when your in Muslim country your not even allowed to drive ....","post_message":"Burqa-Clad Woman Pulls Race Card On Cop, Gets Brutal Wakeup Call That's not how it works in America... Sorry. Do you think she got what she deserved?"},{"comment_id":"10154501984339087","commenter_b":"@username So they get deported five or six times then come back and kill innocent people. Did you know that most of them send money back across the border to help their families come here.","commenter_a":"Trump cost himself the popular vote. He already said he is keeping Obama's amnesty in place. So if he's blaming the illegals why would he keep them here? He is such a lying fool and his supporters suck it up.","post_message":"\"He said 3-5 million 'illegals' voted so that's why he lost popular vote,\" one Democratic aide said about President Trump's comments at the meeting."},{"comment_id":"10153754425932431","commenter_b":"Americans are so evil they kill 99% of us and steal our land and then when we stand up to them, they say hey you better kiss our ass or we won't help you","commenter_a":"If americans want their pipeline then just put it on their land over their water not ours, They should have to pay the price for their greed not us, I am tired of americans living good lives off our suffering.","post_message":"Video: 7 Arrested After Pipeline Protesters 'Invade'  Enbridge's Duluth Offices  bit.ly/1Ms7Sjy"},{"comment_id":"10152723762841545","commenter_b":"WE OCCUPY THEIR COUNTRIES FOR MONEY!!!!!!!! how would you feel if that happened here. we had foreign soliders occupy us for 10 years for the elite to make more money based on lies!","commenter_a":"The more you know liberals","post_message":"Three students from campuses including University of North Texas, University of Texas at Arlington, and at University of Texas at Dallas each reported being the targets of anti-Muslim threats this week."},{"comment_id":"10153600253057431","commenter_b":"Well stated @username. Irony received. 😉","commenter_a":"White supremacist exist whether as paramilitary, or the idiotic Trump supporter who thinks he owns everything and everybody telling a Hispanic American (Jorge Ramos) to go back where he came from, to people who will destroy other cultures way of life for a dollar because they have no respect for others. They are so pervasive the only way to resist them is for people of color to band together. To pretend white supremacist don't exist or that they will magically disappear is to ensure their continued control over our lives. Working together to overcome an evil is not anti-American, it's just common sense.","post_message":"Fighting White Supremacists: Don't Forget, We Are In It Together!  @webpagelink"},{"comment_id":"10153327078532411","commenter_b":"So this really can happen? My phone is usually under my pillow","commenter_a":"@username can I have electronics in the bed","post_message":"This is why you don't sleep with your cell phone."}]
