[{"comment_id":"10153113933254071","commenter_b":"Anders Rojas","commenter_a":"Jeyhun OrujovMalek MasAdil Mirzayev","post_message":"$10 million over the already insane $50 million asking price."},{"comment_id":"892479024147549","commenter_b":"The majority of people who act out racism, cry about racism, are the most racist...are black people....you want a safe space where whites won't be around...Liberia...Nigeria...Botswana...many places...but here's the thing...no welfare, no food stamps, no healthcare, no free housing(except in the jungle and you build it), no opportunity for education, ....not one of you would survive in any of these African countries.....because you've been spoon fed for to many generations! I've been to Africa many times, I've spoken to hundreds of Africans.....they will rot and die in poverty because of the black government that runs the countries....take a very close look at who's in charge of America now!!! Except in America the white tax payer affords you the life you don't even deserve.....and now he's giving your life...yes your life to illegals...he's done with you....make the best of it...because that stupid monkey president couldn't care less about you!!!!","commenter_a":"Hell No. There are no more minorities","post_message":"Huffington Post:  Deserve Safe Spaces Without White People  A couple of weeks ago, two students from Ryerson University Journalism program were barred from attending an event organized by the ' BECAUSE THEY WERE WHITE!  @webpagelink"},{"comment_id":"1226004427434976","commenter_b":"Get rid of her please","commenter_a":"Anyone else would have been fired.","post_message":"Do you think The View should be CANCELLED from TV?"},{"comment_id":"1021126491243474","commenter_b":"And yet a student did intervene verbally and is still alive.","commenter_a":"Shame on that teacher for not standing up for that student. Even if she was being disruptive in class she still deserves to be protected and treated with decency.","post_message":"When a white Spring Valley cop brutally assaulted her classmate, Niya Kenny sprung to her defense.  How could she have known what would happen to her next  just for speaking up? #AssaultAtSpringValleyHigh"},{"comment_id":"10153252592734138","commenter_b":"R u mad or naw?","commenter_a":"All the white people would try to escape n end up north side n get beat up","post_message":"Today, Gov. Mark Dayton blasted Newberger's remarks, calling them \"disgraceful.\""},{"comment_id":"10153361519746813","commenter_b":"That's the point. You said it yourself. Men have been using the men's room and women have been using the ladies room without an issue since forever without any problems. My point is that the law allows for men to use the ladies room and women to use the men's room, that is the basis of this law.","commenter_a":"I want to know why this is such a \"hateful\" law. The \"party of science\" is arguing against a law that basically says \"You know this restroom that's for boys/men? Only boys/men can use it. You know this bathroom that's for girls/women? It's only for girls/women\". So you think if women feel uncomfortable that a man that says \"Hey, I feel like a woman\" goes into a woman's locker room must hate LGBT people? Really? It's not the trans people I'm concerned about. It's the people POSING as trans people. Why should women be made to feel uncomfortable just so a man that thinks he's a woman can use the women's restroom/bathroom? Wanting people to use the bathroom of the sex they were BORN with (and actually STILL are, as science dictates) does NOT = hate.","post_message":"After nationwide outcry about North Carolina's harmful anti-LGBT law, Gov. McCrory said let's \"work on solutions that will make this bill better\" because NC is \"a state of inclusiveness, openness and diversity.\" Let’s make it clear - that means REPEAL HB2. Keep the pressure on. Add your name: @webpagelink"},{"comment_id":"10153283544784170","commenter_b":"Stick the crust between her buns. She'll never know.","commenter_a":"Straining so hard to see what isn't and not see what is. Sad.","post_message":"A word of advice to the legacy media:  If this is the best the Clintons can do with their \"re-branding exercise,\" you should jump ship immediately.   ...Because this is absolutely pathetic. VIDEO."}]
