[{"comment_id":"536456796544900","commenter_b":"Go home.. This is not ur country.. To bring ur confusion here....","commenter_a":"Amen !","post_message":"Muslims try to pass Shariah Law in Alabama but these patriots refused to back down.  We are not in the Middle East. No Shariah Law here.  Do you support these patriots’ stand against Shariah Law?"},{"comment_id":"10154129058346509","commenter_b":"Please stay the f**k in Africa!","commenter_a":"With 18 proven ways on overcoming Homosexuality, George's Diary presents to you words of life relevant to this present generation. Homosexuality is not the worst and unbeatable lifestyle, God doesn't hate gays and lesbians. That understanding alone brings hope of overcoming it! You may not be a lesbian or gay but so many people around you are homosexuals, some are secretive about it while some are not! Some wants to change their lifestyle while some doesn't. Your next of kin or even close friend may be a victim of Homosexual without you realising it. Read this article and learn to overcome or help others overcome homosexuality. You can as well do your neighbour good by passing on this article to him or her...... OVERCOMING HOMOSEXUALITY.... Read now!!!!! @webpagelink Or download George's Diary on your Android device @webpagelink","post_message":"Like it wasn't scary enough already. This glass walkway hangs more than a half-mile up a mountain and the glass panel cracked, sending visitors fleeing and screaming. @webpagelink"},{"comment_id":"1143390539087332","commenter_b":"#HillaryALLTheWay #HillaryClinton2016 #ImWithHer #MadamPresident #Hillary2016 #OutForHillary #ShesWithUs #WomanCard #StandWithHillary! #TeamClinton #LoveTrumpsHate #Ready4MadamPresident #DealMeIn #GoHillary #HillaryForMe #HillaryForPresident #Rally4Hill2016","commenter_a":"Oh Lisa Lampanelli never fails....","post_message":"LOL! The look on his face is PRICELESS."},{"comment_id":"1532037343754150","commenter_b":"Forcing an innocent girl to say sorry to China due to afraid of losing a large profit. Good job Communist China and JYPE!! And if Taiwan and Communist China are the same state. Why Taiwan has her own flag, currency, army and diplomacy? And why does her people have the universal suffrage to vote to elect her own president? Why those chinese doesn't have the right to elect their leader directly? A \"small\" state like Taiwan has so many political parties. And A Big China just rule by Communist Party. How good to see democracy and dictatorship really works in! From those I have mentioned and others have talked with. It shows that Taiwan is an independent State. Try show some respect Chinese. Or even China wants to unit Taiwan. They should have guts to take action to invade Taiwan but not by talking those nonsense. And we shall see ...","commenter_a":"Chinese netizens says Lies Obviously is Chinese netizens because she Holding a Taiwan flag Began to attack She","post_message":"Her name is Chou Tzuyu and she is now the focus of attention."},{"comment_id":"10153780337219203","commenter_b":"I am so fucking over this black lives matter shit. But, you know, I'm a basic white bitch so what do you expect?","commenter_a":"Not true....he said all American lives matter. He's the only one who had the balls to say it and you should give him credit for that DB.","post_message":" lives matter, Sanders responded to uproarious cheers."},{"comment_id":"10153725083142464","commenter_b":"@username YOU'RE A COMPLETE MORON !!","commenter_a":"I remember my thanksgiving in Iraq and the Stan. Prayers for all those away from the families eating thanksgiving in a to-go box","post_message":"Tomorrow and every day, don't forget to say a prayer of Thanksgiving for our men and women in uniform spending the holiday away from home."},{"comment_id":"494289207428326","commenter_b":"I'm surprised the husband let her swim at all.","commenter_a":"Our Country our way of life. DON'T TREAD ON ME!!","post_message":"Two Muslim women wore their 'burkinis' to the pool and then something amazing happened.  Awesome. Muslim immigrants need to assimilate or leave.  Do you agree Muslims need to abide by our laws?"}]
