[{"comment_id":"893070080803922","commenter_b":"I wouldn't vote for Killary,If she was last person on Earth! She A Liar and a Bad egg!!","commenter_a":"The movie idiocracy.....we are living it!","post_message":"Jesse Watters: \"What do you think Hillary Clinton's biggest accomplishment has been?\"  Answer: \"She has gone around to certain places – Brooklyn, she's been to Queens.\"  MORE: @webpagelink"},{"comment_id":"10153214804429641","commenter_b":"Why are these counties better to mothers?","commenter_a":"Ironic, the top five are all Nordic!","post_message":"These are the best and worst countries for mothers -- how does your country stack up? @webpagelink"},{"comment_id":"10153436202258855","commenter_b":"No a chick with a dick Courtney Danielle Banks","commenter_a":"That one ugly dude","post_message":"Go get 'em, Vanessa!"},{"comment_id":"546377932240042","commenter_b":"Wage gap seems like it is there but you femminists are being insincere about what it really means. You dont take so many factors into account. Men are more likely to work overtime. Woman take maternity. Woman should be thankful for that! How about that woman tend to get degrees that end up being useless and so they have to take lower paying jobs that arent what they studied for. There are SOOOOOOO many factors yoi ignore but without a doubt a woman WILL BE PAID THE SAME IF SHE DOES THE SAME WORK AS A MAN","commenter_a":"As a guy, I still love this. Great idea to raise awareness and galvanize support for an end to the gender gap and income inequality","post_message":"Take a deep breath, guys."},{"comment_id":"10153813591902293","commenter_b":"Jealous women!","commenter_a":"Hmmm.....now what kind of people would call in and complain about a woman's bare shoulders......any guesses?","post_message":"The station received several e-mails during the broadcast complaining about her bare shoulders."},{"comment_id":"10154315697078984","commenter_b":"That whore needs to go to hell","commenter_a":"She DOES NOT HAVE THE AUTHORITY TO DO THIS. ALL WE NEED TO DO IS IGNORE HER. KEEP BUYING IT SHE WILL BE GONE IN 8 MONTHS","post_message":"Michelle Obama has been messing with our children's food for years, but now she's gone to far.  She just banned one of America's favorite cereals, and there's not a darn thing anyone can do about it.  It's time to throw her and her America-hating husband out of the White House for good."},{"comment_id":"1739251936290298","commenter_b":"exactly. Women belong in the kitchen, this is stupid.","commenter_a":"Great. Ahmed, the suicide bomber, will be next. Anything to appease the muslims, right?","post_message":"The six-year-old girl is the first-ever Afghan Muppet, and she is aimed at promoting female empowerment in Afghanistan."}]
