[{"comment_id":"10153471873556770","commenter_b":"@username - afraid your husband will be deported huh?","commenter_a":"These Clowns are hilarious Dracula aka Cruz and Cruella Devile aka Fiorina ....She was dying for some spotlight....Well she will get if for about another month...Then Bye Bye weirdos","post_message":"During Carly Fiorina’s acceptance speech for running mate with Sen. Ted Cruz, Fiorina sang a made up nursery rhyme to Cruz’s daughters."},{"comment_id":"800418456754419","commenter_b":"She shd be in jail","commenter_a":"Nobody in the GOP can't come to Hillary's standards, there is no comparison.. She is one smart and prepared capable Madam President!","post_message":"The #GOPDebate may have ended, but CNN’s Chris Moody is live, taking your questions from the post-debate spin room in Miami."},{"comment_id":"10154576995593812","commenter_b":"And Hillary gets away with what?","commenter_a":"#Belicheater","post_message":"A federal appeals court has rejected Tom Brady's attempt to get a new hearing on his \"Deflategate\" suspension. @webpagelink"},{"comment_id":"1180918395297096","commenter_b":"@username you come from immigrants, you really believe they should be sent out or kept out. Start packing. Show just how much you believe in this wall.","commenter_a":"Yes","post_message":"Agree or disagree: It's time to build Trump's wall at the border."},{"comment_id":"914159775273545","commenter_b":"She is labeled as dumb!","commenter_a":"Lort.","post_message":"“I’m From Every Continent In Africa” Raven-Symone Continues To Put Her Foot In Her Mouth"},{"comment_id":"10154065307955329","commenter_b":"I leave my sweat for the next guy/gal so they can draw strength from my juices. Welcome.","commenter_a":"And how long are you supposed to wait before you wipe it down after you use it? Dear people that leave sweat stains on the machines and don't wipe it down after they're done, screw you.","post_message":"Pump some iron or nap? Nap."},{"comment_id":"10157822759390389","commenter_b":"She is a joke","commenter_a":"Evil woman","post_message":""}]
