[{"comment_id":"613162948816887","commenter_b":"Try to imagine how little I care about anything this pre-teen brain has to say.","commenter_a":"She's a f*cking but job anyway....","post_message":"She is PSYCHO crazy folks."},{"comment_id":"10156316346195725","commenter_b":"@username , but Muslims will not vote for him","commenter_a":"We need you now Donald Trump!!!","post_message":"Remember, I was the one who said attack the oil (ISIS source of wealth) a long time ago. Everyone scoffed, now they're attacking the oil."},{"comment_id":"10153184382439255","commenter_b":"History has lots of examples of jobs we don't want. Thank of all those guys running the gas chambers who were out of work when the Nazi Death camps closed. You are truly pathetic.","commenter_a":"Stunning. You're actually in favor of businesses shutting their doors, laying off people and possibly going under all in your vendetta against one man? You are truly pathetic","post_message":"A sign of victory."},{"comment_id":"10154099546462377","commenter_b":"How about all of us that approve? No one asked me if I approve the transition? Comon, same old story as we heard during the lection!!!","commenter_a":"Awe !! Get used to it .","post_message":"More than of half of Americans disapprove of how Donald Trump is handling his presidential transition, a new Gallup poll reveals."},{"comment_id":"1739336132953313","commenter_b":"Stupid bitch lmfao","commenter_a":"Obummer has been rode so hard by his tranny boyfriend that he has lost his mind and should be hung for treason.","post_message":"Q: What 4 words would you say to Barack Obama?  The Free Thought Project.com (y)"},{"comment_id":"10153269221051051","commenter_b":"When she gets her own country, she can make any law she wants and decide when she'll break it.","commenter_a":"Gays are getting too demanding. If she will not marry those faggats, then they should go some place else.","post_message":"This court clerk refuses to issue same-sex marriage licenses – even when her decision lands her in legal trouble. Do you respect her dedication to her beliefs?"},{"comment_id":"1137213316374919","commenter_b":"I'm loving it. Turn it Megyn Kelly. you'll enjoy her hate.","commenter_a":"WHY is @username giving stage to these Republican pundits all the time?? Its disgusting! This network has become a pro-Trump propaganda and pro-Repub stage! Two thumbs DOWN!!","post_message":"JUST IN: John Kasich is the projected winner in the Ohio GOP primary.   More: @webpagelink"}]
