[{"comment_id":"919455181533446","commenter_b":"My kids go everywhere. I'm not getting a sitter for something like that. But also, I probably would have whipped out my tit and fed the poor thing.","commenter_a":"A baby should not be at a political rally. Should have found a babysitter.","post_message":"\"What a beautiful baby. It's young and beautiful and healthy, and that’s what we want,' Donald J. Trump mused, before saying he wants it ejected."},{"comment_id":"966246990097370","commenter_b":"Umm Ferguson, Watts Riots, La Riots. White people are out of control? Ok","commenter_a":"I pray for their families","post_message":"White supremacists shoot five people near the #BlackLivesMatter protests for Jamar Clark, a 24-year-old unarmed black man who was shot earlier this month by police.  Protestors took to Twitter after the shooting & described the scene as chaotic, saying police maced the crowd before an ambulance arrived to assist the wounded.  No arrests have yet to be made. DETAILS ----> @webpagelink"},{"comment_id":"10153152969586955","commenter_b":"She'll never be president.","commenter_a":"She's going way down in polls.","post_message":"HILLARY 'WIPED HER SERVER CLEAN'"},{"comment_id":"10153224011251051","commenter_b":"Shoot the the sonofbitch","commenter_a":"Dirt bag!","post_message":"A lot of people considered this man a hero. Then the truth came out."},{"comment_id":"10153693446321037","commenter_b":"Women on women issues unless it's Bills sexual affairs then she doesn't care.","commenter_a":"Maybe she should have first looked to tackle it at the White House when she was living there.","post_message":"Hillary Clinton is the first 2016 presidential contender to address the issue of campus sexual assault on the campaign trail, but she may not be alone for long."},{"comment_id":"10154862382515329","commenter_b":"OHHHH yes yes darkest timeline better forgotten","commenter_a":"April Corey","post_message":"You're gonna want to grab some tissues for this one. // Dawson's Creek"},{"comment_id":"10153490058828352","commenter_b":"Dumbest comment I've read. You're pretty much agreeing with this greedy ass woman.","commenter_a":"Even though this is crazy...thinking about it though if it werent for her he wouldnt be where he is today so...she really shouldnt have to ask...SINCERELY!","post_message":"Former NFL player reveals his mother demanded $1m after he was drafted ‘for raising him for 18 years’"}]
