[{"comment_id":"10153389397913352","commenter_b":"This women is a rachett ass lier! What a waste of space on my news feed, ya girl aint tellin the truth boo","commenter_a":"So weed paralyzes now sheesh isn't this story bullshit hahahah lmfao weed cures not kills or \"paralyzes\"","post_message":"Mother says her daughter, 17, has been left PARALYZED by a pot brownie she bought from a classmate at high school"},{"comment_id":"10153100561240329","commenter_b":"She's a pornstar","commenter_a":"I'm like how'd she land that job..like what conversation took place..how's was the interview conducted..do u interview her or her vagina","post_message":"¯\\\\_(ツ)_/¯"},{"comment_id":"1713306218956490","commenter_b":"Way to go. Ivanic","commenter_a":"If any women want an equal chance in any profession, then Donald Trump is their man for President. He has given women great opportunities in his businesses. He will create many jobs for all Americans","post_message":"Wow, great response!  Ivanka Trump is pure class."},{"comment_id":"800883556714802","commenter_b":"Rheemyck Contreras","commenter_a":"Lexx Kennedy can we get one","post_message":"WATCH: Black panther creeps up on a man not paying attention? Wait for it... wait for it..."},{"comment_id":"676289335864353","commenter_b":"@username that's what I thought. Looks like she would suck a dick for a diet coke.","commenter_a":"I bet not one of you, without google, even knows why the song is racist or if it's even racist at all. You're pathetic. The problem with America is Americans. STOP TRYING TO SHOVE YOUR OPINION ON EVERYONE, just because you don't like what they do doesn't make them wrong. If you really believed in freedom you'd keep your mouth shut but you don't. You believe in shoving your opinion down the throats of everyone.","post_message":"“I don’t even think the song should be our national anthem, because it’s a racist song.\""},{"comment_id":"10153532801498984","commenter_b":"put her in jail and let some women make her their bitch","commenter_a":"JUSTICE FOR ALL?????!!!!!!!!!","post_message":"The extremely disturbing video of a young girl brutally attacking a schoolmate who was holding a small child went viral, now the attacker is facing some serious consequences...  Are you hoping justice is served?"},{"comment_id":"579876898863510","commenter_b":"that chick with the bad bouttabe me in a second","commenter_a":"How cooked Darnell Fraser-Carroll Darnell Rea","post_message":"Ghosts from The Ring and Grudge opened a Japanese baseball game"}]
