[{"comment_id":"10153050931108984","commenter_b":"unbelievable .... if he would not have fought .. they would not have a chance to protest ... arrest them all, through them put of section 8 housing, take their welfare check and foodstamps away .. tye are scum bags of the worst !","commenter_a":"You can't fix culture none of them have served in the armed forces and never worked that's why they have no respect","post_message":"In case you missed it...This is absolutely disgusting. This hero deserves everyone's respect.  Do you support the brave men and women who fight for our freedom?"},{"comment_id":"475707345887193","commenter_b":"If they don't like it here I will help them pack and kick there a##es out of here","commenter_a":"I'm sick of hearing about muslims. How abov you?","post_message":"A butcher was selling this to Muslim customers without them knowing. Now he's going to jail."},{"comment_id":"10154205031258701","commenter_b":"You are clueless chickie....","commenter_a":"Seriously people, faulting the girl for not reporting! It's a small town good-old-boy system. You really think the police chief would arrest his good friend? They were probably laughing about it. Since she went public she is being harassed. Small town politics...","post_message":"A probable cause affidavit states he exposed himself to a female employee at Flowers 'N Fluff at least twice a week for at least two years."},{"comment_id":"10156321873895725","commenter_b":"Global warming is responsible for baby dick","commenter_a":"iIN United States there plenty terrorist as illegal immigrants driving yellow taxi in the cities of United States taking the jobs from American people and ready to do bad things to us here that's why we need DONALD TRUMP to deport all of them","post_message":"As President of the United States, my top priority would be to keep America safe & strong! Thank you for your support."},{"comment_id":"1158864987513588","commenter_b":"\"You're the problem\" lol sound like a bitch","commenter_a":"You guys missed the full story here. See what happened was the person who served the food dropped them exact three fries on the floor, that lady was actually being a good Samaritan and helping the cop and taking the dirty fries away for him so he did not get sick. Long story short don't do anything nice for cops because they are assholes and will do everything they can to abuse their power and fuck over the average civilian. I made all of this up of course but all of us know never even talk to a cop unless you absolutely have to because they are just looking for a opportunity to arrest anyone because they are bored. She should have just waited for her own fries. Stupid decisions get stupid results.","post_message":"A woman was arrested in Northwest D.C. for stealing three French fries from a police officer who was dining at a U Street eatery. #WSHH"},{"comment_id":"1026504997444125","commenter_b":"God Bless this good hearted little boy. May he heal fast. 🙏❤️","commenter_a":"in my prayers...","post_message":"So sad.  A 7-year-old boy who spent 2 years growing his hair out to make wigs for cancer victims has found out he has cancer too.  Prayers for little Vinny. Details:  @webpagelink"},{"comment_id":"10154302113081509","commenter_b":"She had them surgically removed. She also doesn't have a brain or even a modicum of decency. And THAT is why she's running for office! Hellary 2016!","commenter_a":"Hillary would you like to have your husband also in prison ? Or else a dildo is enough ?","post_message":"Hillary Clinton had a message for a supporter's father who is backing Donald J. Trump"}]
