[{"comment_id":"804744199625733","commenter_b":"The Progressive white wash is to say \"America did this\" No You Progressives did this!!!","commenter_a":"BOOM!!!!","post_message":"Watch me take down Cenk Uygur from The Young Turks LIVE at Politicon! Cenk should be a little less smug after this debate. #Politicon2016  Learn more about Hillary's America, in theaters on July 22: hillarysamericathemovie.com."},{"comment_id":"10153759399624228","commenter_b":"Her point, Chad, is that it's not just Muslims who are terrorist. I'm not a supporter of Muslims and have my own views but you can't just pick and choose. If you're going to list terrorists, list them all. Not just a specific religious/culture type","commenter_a":"It's not just ISIS.","post_message":"They want all of us to become hostile"},{"comment_id":"1227002650653096","commenter_b":"The LATIN EMPIRE AWAKENS! They realize that Republicans will get them into American class warfare!","commenter_a":"Latino Republicans? Does such an animal exist?","post_message":"Latino Republicans are mounting a pushback against the more conservative wing of their party."},{"comment_id":"10152584446122014","commenter_b":"No money for illegals!","commenter_a":"He's not an immigrant. He's a POS rock-throwing illegal alien coyote that's had 14 prior incidents with the border patrol.","post_message":"The judge ruled that the officer was not justified in opening fire on the immigrant who was crossing illegally into Arizona."},{"comment_id":"10153641975856234","commenter_b":"I don't know if it is objective or not. Some day we may find a genetic marker for transgendered people. In the mean time, you can travel to a state where you can find a chick with a dick to stand next to you as you pee.","commenter_a":"Interesting that the states with the lowest tax rates are places where I would NEVER want to live. I guess you really do get what you pay for.","post_message":"State and local taxes in the Garden State were 12.2 percent of income. See how that compares to other states."},{"comment_id":"10156455116700354","commenter_b":"Plenty of real women out there that they could have photographed","commenter_a":"A fucking lie from the liberal media why pretend.","post_message":"All 8 PHOTOS here..."},{"comment_id":"10155880167920354","commenter_b":"Uh you don't feel safe here? GO BACK!","commenter_a":"And salon will say that the US military threatened this poor muslim and made him feel unsafe.","post_message":"The Huffington Post Says It's a \"Mystery\" Why Kuwaiti-Born Practicing Muslim Mohammad Youssef Abdulazeez Murdered 4 U.S. Marines During Ramadan."}]
