[{"comment_id":"1143755872353195","commenter_b":"If you don't like rules there move back to Kuwait!","commenter_a":"OLD POST, YOU GUYS.","post_message":"Muslim Welfare Diva Refuses To Take Off Headscarf Gets BRUTAL Message From Judge (VIDEO)  BOOM! This judge smacks her silly! Can we get 1K Likes for this awesome JUDGE!"},{"comment_id":"10153209729066051","commenter_b":"I am a woman but if you not respect the man, specially on from of so many people, how do you spec, he is going to do. My friend you said what you WANT sorry you heard what you DESERVE.","commenter_a":"He has the right to his opinion and here we go again with Kelly, supposedly a conservative, telling someone that they don't have a right to say what they think. War on women, isn't that a liberal jab or stab...you bet it is. Keep talking Mr. Trump and you may win my vote, too!","post_message":"Donald Trump just got banned from a GOP Presidential debate because of this comment about Megyn Kelly."},{"comment_id":"1673236709627945","commenter_b":"I can't stand this big eared liar!","commenter_a":"Bull crap! You say that federal background checks don't work when it relates to gun control but when it relates to checking refugees you say it does so apparently it only works when you are telling the public lies to get what you want = pitiful","post_message":"\"Any refugee coming to the United States, some of them victims of terrorism themselves, will continue to get the most intensive scrutiny of any arrival.\"  After meeting with his national security team, President Barack Obama said that \"our intelligence and counterterrorism professionals do not have any specific and credible information about an attack on the homeland,\" but that \"we have to be vigilant.\""},{"comment_id":"10153202645506350","commenter_b":"This women should go talk to parents.","commenter_a":"Everyone saying \"she could have dealt with this privately, how embarrassing for the kid\". She never even mentioned his name... She is just addressing him along with all the other boys out there who do this. Something similar happened to me when I was in grade school and instead of having my back, all my friends labeled me as a bitch for not giving this guy a chance. He WAS harassing me but it was seen as \"cute\" because women are taught to appreciate male attention no matter the circumstances. We are taught it is the best thing that could ever happen to us. Just bear in mind that if a teenage daughter willingly comes to her mother for help, during a time when most teens seek distance from their parents, there is clearly a huge problem. This is video that can help a lot of other parents and teens ...","post_message":"This mom has a message for the boy repeatedly being rejected by her 14-year-old daughter: No means no."},{"comment_id":"10153039031790329","commenter_b":"Kriti Kothari","commenter_a":"One for you Bella La Verde","post_message":"Find out which one of these redheads will light your fire."},{"comment_id":"10152904940001636","commenter_b":"Death penalty. Make em think twice. We need to set an example out of these murderers.","commenter_a":"Charge the worthless parents. What was he doing alone in a public park with a pellet gun like that and no orange tip and a pistol none the less. Horrible parents","post_message":"A judge found probable cause for multiple charges against the officers involved in the killing of 12-year-old Tamir Rice."},{"comment_id":"1342320752468340","commenter_b":"Happy to see a change in the Mayor's house! See ya!","commenter_a":"if first lady gets this, what can common man expect,...","post_message":"The mayor said she was merely expressing happiness for \"change in the White House.\""}]
