[{"comment_id":"10154051432298445","commenter_b":"Listen you little bitch ur just mad because","commenter_a":"Come on they just want to get paid like everyone else....shut the fuck up and give them their chop...before you end up paying an arm and a leg for mr.college degree but cant find a job in the field i studied for...to show up and try to charge u 30% of ur crop this is America only place they have buffets js","post_message":"#TBT to 2015. \"trimmigrants.\" had trouble finding work, created tension after arriving in Humboldt expecting trim jobs.   Humboldt friends - has the atmosphere changed?"},{"comment_id":"10154203076004087","commenter_b":"Of course Axelrod.... in the mean time we have to keep a corrupted woman out of the WH by massively voting for another candidate... Just get back in the swamp and be happy Axelrod Traitor !","commenter_a":"It has been revealed that part of the Clinton strategy is to incessantly blare from any and all platforms that it's game over, Hillary already won, Trump can't win, etc. Of course the reality is that Hillary can't fill high school gyms with supporters while Trump fills arenas. So, only a few more days till we know if votes still count or if we live in a rigged system controlled by some shadow government and foreign interests.","post_message":"\"I don't know any consultant on either side, any strategist, who privately believes that Donald Trump is going to win this election,\" Obama campaign strategist David Axelrod said."},{"comment_id":"1712583705672199","commenter_b":"What happens when fish over populate and end up eating up their whole ecosystem..","commenter_a":"They're fucking fish were at the top of the food chain","post_message":"If you know anyone who still goes fishing, show them this."},{"comment_id":"10152848525036749","commenter_b":"Happy bday!!!","commenter_a":"Happy Bday!!!","post_message":"Happy birthday to an amazing, inspiring First Lady."},{"comment_id":"1377243338962685","commenter_b":"@username Typical liberal retards dodging the question. This isn't a matter of immigration, it's a matter of letting in the right immigrants.","commenter_a":"Good welcome to all terrorist to Canada ..According to Qubiec attack police arrested two and says......The two suspects are Alexandre Bissonnette and Mohamed Khadir Two students including one of 'Moroccan origin' have been arrested for the slaughter of six people at a Quebec mosque ...Mr. PM you are really trying to kill innocent people ...Idiot. .","post_message":"Six people were killed and eight wounded when gunmen opened fire at a Quebec City mosque during Sunday night prayers, in what Canadian Prime Minister Justin Trudeau called a \"terrorist attack on Muslims\"."},{"comment_id":"10153953240508984","commenter_b":"We are AMERICANS! As are all legal CITIZENS! We believe in the LAW, THE CONSTITUTION and what it stands for! I don't have a problem with blacks, Mexicans or Muslims! But they seem to have a problem with us! They shoot or hurt us first and because we fight back we are racists? What the heck s wrong with this! Our Lord Jesus gave us two great laws, to love God above all else and to love our neighbors as ourselves! It doesn't say our neighbors have to be white, black, brow, or purple!","commenter_a":"Americans are done with the media as well as p.c.We are not racists or bigots..or hateful people as we are portrayed.We are patriots who are not going to let this country fall.","post_message":"This 8 word statement from the Republican debate was the most important and influential of the evening. Whether or not the candidate who said it becomes the GOP nominee, its far-reaching impact will be felt for the rest of the campaign.  Do you support this candidate's position?"},{"comment_id":"10153772701693271","commenter_b":"If you look back, I didn't say \"productive\". I said \"meaningful\" and, I'm hardly \"bent out of shape\". Does this effect me personally? Not really. But, it does effect my community/state/culture...whatever you want to call it. A day to celebrate pot? It's laughable to most. You can think I'm ignorant all you want, I still think it's ridiculous. Again, my opinion. Not sure why you feel the need to argue with me.","commenter_a":"Go to work. Volunteer. Do something meaningful. Beyond ridiculous.","post_message":"Denver's 4/20 rally has been rescheduled."}]
