[{"comment_id":"10153197262606336","commenter_b":"Only GOD, could to do it.!! IN GOD, WE FROM MORE CHAMPION: GOD BLESS YOU Beautiful Family. THE MIRACLE EXISTING, IF YOU BELIVE.!!","commenter_a":"Rest in peace little Angel 👼🏼","post_message":"\"He is now cancer free and running and playing and laughing with God and all of the other precious children,\" a post on \"Danny's Warriors” Facebook page read."},{"comment_id":"10153817478256320","commenter_b":"@username he will never be a woman","commenter_a":"Um. No. Besides i hear she doesnt even want to be a woman anymore.","post_message":"Happy Birthday!  Caitlyn Jenner celebrates what she considers to be her 'first birthday.'"},{"comment_id":"10154447143119087","commenter_b":"Katherine, I hope someone, someday, grabs you by the pussy, you uneducated white trash bitch","commenter_a":"lol he's a hot headed LOSER.... This asshole called his own daughter a Pig And somehow we care what he thinks about Donald Trump","post_message":"Alec Baldwin posted a photo on Instagram in a Russian \"Make America Great Again\" Hat."},{"comment_id":"10155025724612940","commenter_b":"And youre a profile of a pussy chucky","commenter_a":"No she is a political hack","post_message":" Yates is a profile in courage.  ICYMI: Senator Chuck Schumer took a shot at the Trump administration over the firing of acting Attorney General Sally Yates for her refusal to enforce Donald J. Trump refugee order."},{"comment_id":"1041407739283520","commenter_b":"Where's BEYONCE crying out against these BLMers?? Or is she FOR IT ALL???","commenter_a":"When will America wake up these people must go","post_message":"\"We must continue working to build trust between communities and law enforcement.\"   Watch Attorney General Loretta Lynch address the #Dallas sniper shooting that killed five police officers."},{"comment_id":"10153826127084024","commenter_b":"funny how she started all of it and then plays the victim","commenter_a":"With a native name like NO ONE WANTS TO POKE HER TUNA.","post_message":"It’s the latest in a series of Internet “tweetstorms” calling Trump on the carpet for his treatment of women and his insults toward her."},{"comment_id":"1226103374093667","commenter_b":"Yeah go, go away!","commenter_a":"I assume nothing! We have a few days to get people registered! Then we have to get the early vote and day of vote out! Go Trump!","post_message":"\"For those few people knocking me ...\""}]
