[{"comment_id":"805710002902059","commenter_b":"But no one will ever do anything. She is above the law","commenter_a":"My biggest problem with Hillary Clinton is the fact that she condones an abortion minutes prior to birth, leaking national security time limits during a nationally televised presidential debate. She has been held non-accountable for any of her mischievous, murdering, actions. If she gets in she will be following Obama's legacy, and our country is doomed","post_message":"ARREST!"},{"comment_id":"401994746592233","commenter_b":"I haven't done any unlawful thing at all not that big too get my ass in trouble but I get tired of how they treating everyone","commenter_a":"I don't believe they should have their guns taken away. Their are some good cops haven't seen it with my own eyes but, their are some. I want to know why they so scared now. I know their was a dog in this case but, what about the other case where people don't have are unarmed and the officer fears for his life. Cops are pussies now a days this shot didn't happen this often just a few years ago","post_message":"This story is as appalling as it is tragic. The Cop Logic and pure stupidity of this officer is staggering. I still can't wrap my head around it. Yet another case why some people suggest police should be unarmed.  Read more: @webpagelink Via - The Free Thought Project.com <-- (y)"},{"comment_id":"1510101482356438","commenter_b":"Lol that's not even close to what Asexual means.","commenter_a":"Asexual isn't real. Asexual means you reproduce without a partner. Use a different word cause that's not how this word is used in species. Asexual is like a bacteria. You are just without-sexual-wants.","post_message":"\"I fantasize about my future with my partner, achieving a certain level of success in our careers, getting out of debt. Oh, and cake. Don't forget about cake.\""},{"comment_id":"558350940997625","commenter_b":"TRUMP 16 the rest are weak ! Non presidential . The to Cubans will open our borders to Cuba Canada and Mexico because there parents were illegals also . Period","commenter_a":"Donald J. Trump 2016","post_message":"\"...a man who has a multi-decade history of exploiting the immigration laws to take advantage of the little guy is not someone we can trust to stand with the working men and women of this country.\""},{"comment_id":"1163546927012391","commenter_b":"Janette Smith just wow I can't even!! U are delusional do u have kids? I hope not","commenter_a":"I hope he escapes.","post_message":"MISSING: Louis Dean Rende, 12, has run away from his Spring Hill home. He is 4-foot-6, and was wearing a red or orange shirt, dark shorts, and might be wearing hiking boots. He has a scar above the right knee. If you see him please call 911 or the Pasco sheriff at 727-847-8102. Leave a tip at 800-706-2488."},{"comment_id":"10155117976876002","commenter_b":"Lets do a story on bum tenants....thats where it is","commenter_a":"Hanks a tool lol","post_message":"Help Me Hank: Landlord's secret launches investigation (Full story: @webpagelink"},{"comment_id":"10153095836953299","commenter_b":"What does she care, it's not her money.","commenter_a":"no wonder she is flopping around like a boated eel.","post_message":"Almost $1 MILLION on polling alone in just a few months...."}]
