[{"comment_id":"1415272741824926","commenter_b":"If I was as ugly as her I wouldn't be calling attention to my stupidity too !!","commenter_a":"sounds more like Eva Braun more and more!","post_message":"Less than 30 minutes after Donald J. Trump was sworn in as President, MSNBC's Rachel Maddow was calling him Hitler."},{"comment_id":"10153189308491336","commenter_b":"Fuc_k the Muslim Scum Bags. If they don't like the American way of life go to the \"Big Sand Box\" to live. Then they can cook and keep warm with Camel Dung...........","commenter_a":"SHAME SHAME SHAME on these colleges and universities for the disrespect they show to our America and for the disrespect they show our military who have given their all to protect THEM.................... just hard to believe there are people in these positions who let this garbage happen. STAND UP FOIR AMERICA AND DO THE JOB","post_message":"President of the University of Maryland College Republicans: \"This isn't a racist film. It's about a decorated American war hero who [risked] his life for you and me and all the viewers.\""},{"comment_id":"10153148300259575","commenter_b":"You certainly are. \"Judge and be judged\" Crystal. I PROMISE you God is watching your actions as much as he's watching mine. Typing \" under a homosexuals death does not, in fact, secure your ticket to heaven babes.","commenter_a":"Let's see if she can have god change his mind","post_message":"A terminally ill woman whose desire to have her same-sex marriage recognized by Indiana before she died helped galvanize efforts to overturn the state’s gay marriage ban has lost her battle with cancer.  Niki Quasney died Thursday, gay rights advocacy group Lambda Legal said Sunday. She was 38."},{"comment_id":"10154264831942411","commenter_b":"@username Did you even look at the picture?","commenter_a":"Enjoy climate change people humans are to blame for early spring weather.","post_message":"We've never seen anything quite like it."},{"comment_id":"1100432766685506","commenter_b":"F**k Obummer and his illegal aliens...","commenter_a":"Prayers","post_message":"OBAMA'S LEGACY: Veteran Kills Himself After Call To VA Suicide Hotline Goes To Voicemail    Meanwhile Obama Hotline For Illegal Aliens To File Complaints About Border Patrol Remains Fully Staffed"},{"comment_id":"10153896668671990","commenter_b":"She need the flowjob","commenter_a":"Why didn't this happen to my poll areas","post_message":"Two women, naked from the chest up, bust into a Manhattan polling station early Tuesday, shouting:  of our polls Trump, out of our polls Trump! Donald Trump was expected to show up later to cast a vote himself.  Our reporter Mark Matthews was in the basement of PS 59. @webpagelink"},{"comment_id":"10153469105041746","commenter_b":"Lol this chick gets her history from Hamilton","commenter_a":"Think about these 2 statements: \"Make America Great Again,\" and \"America Is Not Great.\" If you support the first one, but are angered by the second, you need to take Logic 101. As for the statement on this woman's hat, \"America Was Never Great,\" I strongly disagree. I saw Hamilton: An American Musical and there was a time when greatness abounded. Since then, we've alternated between great and not so great, sometimes concurrently. It's a big country!","post_message":"Meet the 22-year-old between the controversial hat."}]
