[{"comment_id":"764036443733722","commenter_b":"Absolutely! Throw the Muslims off the bus. When will we be able to do as we please even if the stupid Muslims are offended. WE HAVE RIGHTS AND THE MUSLIMS OFFEND US.","commenter_a":"Were wrong. This is America. Freedom of speech.","post_message":"Woman And Daughter Kicked Off Bus For Singing Nursery Rhyme That Offended Muslim Passengers. She was just trying to soothe her daughter. Do you think this is wrong?"},{"comment_id":"626166684240577","commenter_b":"She is a idiot ass","commenter_a":"She always does that is why nobody watches the show the POS is on.","post_message":"Whoopi Goldberg made a sad attempt to play the race card, big mistake. What liberal filth. She needs to be taken off TV. Are you tired of liberal trash polluting the media?"},{"comment_id":"866091750103560","commenter_b":"What do ya expect Dennis. I go out most days an feel I'm surrounded by backwoods hicks!! It kinda sucks being from a big city","commenter_a":"Its a LED light, idiots!","post_message":"A Tennessee mom claims she saw pentagrams in her kid's school bus brake lights. She says it's a threat to God and parents should be outraged: @webpagelink What do YOU think?"},{"comment_id":"10155438408395354","commenter_b":"If she had a brain, she would be dangerous","commenter_a":"she can also take credit for being a slut.","post_message":"\"sooooo bad a$$ Senator Cottons voicemail box is fulllllllllll!\"  ....we didn't forget the apostrophe, Miley did."},{"comment_id":"661747857265261","commenter_b":"@username in LA-LA Land - Run back to the boarder and GET THE FUXK OUT OF MY COUNTRY!","commenter_a":"Then he obviously didn't listen to the end. Bibi gave 3 more stipulations that were very clear to add to the table","post_message":"US President Barack Obama says that Prime Minister Benjamin Netanyahu “didn’t offer any viable alternatives” to the current P5+1 negotiations in his speech to Congress.   #NetanyahuSpeech"},{"comment_id":"1029260857170166","commenter_b":"What a crock of bull","commenter_a":"Because made in China is cheaper thanks to unions","post_message":"Financial setbacks hit the \"Made in America\" brand."},{"comment_id":"1087153308047587","commenter_b":"I'll vote for a female for our President, but Hillary is not one that I want to vote for for President. I also think that if your spouse, or former spouse was already President, then you should not be allowed to run/be President; I also think that it should at least skip one generation for sons/daughters.","commenter_a":"Voted for President Obama because he is Black. Voting for Hilary because she's a woman. Why did anyone vote for the last 40 white male Presidents?","post_message":"\"Nothing gets me angrier than when someone implies that I'm voting for Hillary Clinton because she's a woman.\"  - Lena Dunham"}]
