[{"comment_id":"10153780337219203","commenter_b":"I am so fucking over this black lives matter shit. But, you know, I'm a basic white bitch so what do you expect?","commenter_a":"Not true....he said all American lives matter. He's the only one who had the balls to say it and you should give him credit for that DB.","post_message":" lives matter, Sanders responded to uproarious cheers."},{"comment_id":"10153551164224753","commenter_b":"This Girl is so hard to watch, treating her Mum like that & she thinks it's okay?If I ever meet her in real life , I will punch her, yes I will...!!","commenter_a":"Farrah is TOXIC and her daughter will have the same TOXIC attitude","post_message":"Farrah Abraham is never content with anything her parents do. Since Teen Mom OG resumed airing, she has been completely disrespectful to her mother Debra. As it turns out, Abraham will also be confronting her father, Michael. There has been a strained relationship between Abraham and her parents, but the conversations between them have gotten increasingly more hateful as the seasons have progressed. The issues Abraham has with her parents are deep, and some of it was addressed when she... @webpagelink"},{"comment_id":"10154235206604203","commenter_b":"Black girl magic. Fucking lol.","commenter_a":"Kathryn, guuuurl. You can find me runway-walking down the street to your house with a bottle and a mission to witness this black girl magic. Let me stop by Red Lobster real quick, tho.","post_message":"Wow."},{"comment_id":"914001441995307","commenter_b":"Awsome woman!","commenter_a":"Barry Sheldon this was what I was talking about earlier","post_message":"BREAKING VIDEO: Mother Beats Her Son When She See Him Rioting in Baltimore  Mother of the Year Award? She goes straight hood on her son.   @webpagelink"},{"comment_id":"10153113933254071","commenter_b":"Anders Rojas","commenter_a":"Jeyhun OrujovMalek MasAdil Mirzayev","post_message":"$10 million over the already insane $50 million asking price."},{"comment_id":"10155065453241323","commenter_b":"You still refuse to answer the question.","commenter_a":"An admirable academic for sure . But; one line in the video had me chuckling \"And then population growth will stop\". Naive to think population growth will ever stop. Deluded dreamy lefty thinking.","post_message":"\"Let me show you the world\", said Swedish academic Hans Rosling, who has died aged 68.   Here he demonstrates the dynamics of population growth, child mortality and carbon dioxide emissions. The challenge for the world is to get everyone out of extreme poverty and get the richest people to use less fossil fuels, he said."},{"comment_id":"10153002783667522","commenter_b":"She will come back with stilettos and her boobs hanging out.","commenter_a":"Oh Rodney I thought this was one of your favorite shows?","post_message":"It looks like Nancy Drew may be getting the Grey's Anatomy treatment:"}]
