[{"comment_id":"1197826636921341","commenter_b":"Yeah. Pointing out the extremely horrifying problems of a crime filled cesspool part of a city and a counter culture no one is allowed to talk about unless theyre approved by liberals first is totes narcissistic. Gtfo.","commenter_a":"He wasn't making it about him, he was saying this will stop! They twist everything!","post_message":"\"Glad you’re not making this about you. Whew!”"},{"comment_id":"679238678931090","commenter_b":"I have been drinking Pepsi since 1966! I will NEVER BUY IT AGAIN, not because of what she said , but because TRUMP HAS SAID FROM THE BEGINNING , This country has sold out to foreign countries that hate us AND PEPSI HAS THIS WOMAN IN CHARGE OF AN AMERICAN COMPANY!!","commenter_a":"When will they ever learn.. Boycotts work..","post_message":"INSTANT JUSTICE... Let's get 5,000 SHARES for TRUMP!"},{"comment_id":"764036443733722","commenter_b":"Absolutely! Throw the Muslims off the bus. When will we be able to do as we please even if the stupid Muslims are offended. WE HAVE RIGHTS AND THE MUSLIMS OFFEND US.","commenter_a":"Were wrong. This is America. Freedom of speech.","post_message":"Woman And Daughter Kicked Off Bus For Singing Nursery Rhyme That Offended Muslim Passengers. She was just trying to soothe her daughter. Do you think this is wrong?"},{"comment_id":"604189559765558","commenter_b":"Hang the fat pig","commenter_a":"Does anybody really think the Demarcate run US justice system is going to Prosecute, NO","post_message":"One can only hope that this ultra left wing hate monger will meet up with some justice soon."},{"comment_id":"1744837412449340","commenter_b":"that depends upon whether they can pass a rigorous background check.","commenter_a":"\"Absolutely!\"😎👍🏽","post_message":"Do you think lawful, gun-owning citizens make America a safer place?"},{"comment_id":"10152888898915496","commenter_b":"But... But... Gay marriage is destroying straight marriage! @webpagelink","commenter_a":"Brenda. I believe that you are right in some of your thoughts. I don't delieve we should judge people. However we are definitely called to judge actions. In the case of same-sex marriage to support same-sex marraige is to supoort something that goes against the Bible's definition of marraige. Same-sex marraige is social, cultural, and traditional. Social, cultural and traditional acceptance will change with time but Biblical truth does not. Therefore I believe that we are to love everyone but support what is right in the eyes of the Lord.","post_message":"Brenda Wood 11Alive looks back at the fast-moving and historic events of last week in Monday's Last Word -- \"Same-sex marriage: Judgement Day.\"  More Last Words: @webpagelink"},{"comment_id":"732442150279696","commenter_b":"close our borders and weed out this cancer trash","commenter_a":"Get registered to vote the right way. Offer your Sr. Neighbors etc a ride to vote. Get things changed in this country!","post_message":"BREAKING: Muslim Civil War Erupts In Ohio After Patriot Rips Apart A Quran [VIDEO] Watch what happens in the crowd right after he started doing this. Do you think we should close our borders?"}]
