[{"comment_id":"1649214788452320","commenter_b":"She is one ugly mofo ..lol","commenter_a":"So true -- just the respect HE deserves, not his (temporary) office.","post_message":"No problem, Crazy Lady."},{"comment_id":"10154412876021491","commenter_b":"Does this tour detour to the location of the White House MLK Bust? I hope they know where it is. Don't depend on Time, though.","commenter_a":"Shruti Maheshwari","post_message":"Here's how to score a major deal on a scenic getaway."},{"comment_id":"455979541241733","commenter_b":"Get a life, lady!","commenter_a":"how many illegals have we settled in nh that are on medicaid using this? what towns are they in, do we have a sanctuary city in nh or are we planning to?","post_message":"Good to see that more than 41,000 Granite Staters have signed up for coverage under Medicaid in the first year of the program. While I continue fighting to improve the Affordable Care Act, I'm glad to see health care reform moving in the right direction in New Hampshire."},{"comment_id":"10153625690231130","commenter_b":"typical black racist asshole!!","commenter_a":"This whole comment thread is a perfect example of what white privilege looks like. If you're white, you have no idea what its like to live in a world where people like you are marginalized. To white people, no nominations must mean that there are no great black movie directors this year. No great black actors this year. No great black actresses this year. In the whole world. But Tom Hanks gets nominated for a movie in which he didn't even talk? GTFOH.","post_message":"Zero actors of color are included in the The Academy's best actor or actress categories for the second consecutive year."},{"comment_id":"10153035820806770","commenter_b":"she can't even lead her servants...","commenter_a":"now she wants to bring in people to vote for her......","post_message":"Democratic presidential candidate Hillary Clinton told “Face the Nation” host John Dickerson Sunday that she hopes the United States will “lead the world” and take in 65,000 Syrian refugees over the next year."},{"comment_id":"10153743944261337","commenter_b":"GO HAWKS! We love you hating little bitches!","commenter_a":"It's okay. Knowing that their jackass coach screwed them out of the Super Bowl last season, it makes it better. Overrated team from Seattle.","post_message":"THEY BLEW IT: The blown call in Monday's Seattle Seahawks -Detroit Lions game inspired some hilarious fan reactions..."},{"comment_id":"10153238053014586","commenter_b":"plants are living things too... so eat sand... all human should eat sand.","commenter_a":"literally feel sick watching this how can people still let this happen? disgusting","post_message":"Can you imagine having that huge metal tube shoved down your throat?!   This is just 60 seconds of how #FoieGras ducks spend THEIR ENTIRE LIVES.   They sound so terrified. :("}]
