[{"comment_id":"525608654307175","commenter_b":"Have dreams that often come true about other people.","commenter_a":"How do you know if you have a gift? My husband thinks I am a empath... I feel energies but don't know how to interpret them.","post_message":"We LIVE with Theresa Caputo! Send us your questions for the Long Island Medium."},{"comment_id":"10156089078040354","commenter_b":"Put The Woman In Jail!","commenter_a":"THROW - HER - IN - JAIL - NOW! What the hell are they waiting for? Drag her ass to jail in handcuffs wearing a sign around her neck that says, \"ALL YOU OTHER CRIMINAL POLITICIANS AND BUREAUCRATS ARE NEXT! NO ONE IS ABOVE THE LAW.\"","post_message":"***BREAKING***"},{"comment_id":"10150700585599999","commenter_b":"Trump is strong enough to protect the country from this invasion. Certainly no one on the Left is even thinking about it.","commenter_a":"Trump is a loud mouth, arrogant, self serving, person. He does not really care about the \"Regular\" folks, he is accustom to just \"Using\" them. I am a republican and can not stand him.","post_message":"Few people can address the circumstances more definitively than John Farmer Jr., who served as senior counsel to the 9/11 commission."},{"comment_id":"10153782447389094","commenter_b":"Ppl are making it one. So just fix it where only one person can use the restroom by themselves.","commenter_a":"Just make all businesses have two restrooms with one stall. And a lock on each door. Problem solved","post_message":"The states allege the government action has “no basis in law.”"},{"comment_id":"1056647814370639","commenter_b":"Let's be honest. HE is not confused. HE is still a MALE. And absolutely a disgrace.","commenter_a":"NO, are you kidding me?","post_message":"Do you agree with MAC's decision? Yes or no?"},{"comment_id":"1563584047268472","commenter_b":"Our society does not need assault weapons!!!The politicians have blood on their hands, because of their inaction when it comes to the NRA!!!!","commenter_a":"President Obama tried to enforce stricter gun regulations but Congress voted against it. They voted for individuals on the terror watch list to keep rights to own assault weapons and now they're blaming Isis. How convenient.","post_message":"This is infuriating.  Image by Occupy Democrats, like our page for more."},{"comment_id":"10158110429230206","commenter_b":"We should get rid of both of them . Say no to Armageddon .","commenter_a":"Donald Trump went from selling luxury condominiums to selling empty dreams .","post_message":"“If somebody wants to go out and say that they voted for this person or that person, they can do it. But that ballot is sacred.”"}]
