[{"comment_id":"1054028271282063","commenter_b":"You know thats an opinion. My grandfather fought some battles i could never even imagine in my worst nightmares. He earned his title and passed it down and if to a woman so be it. I stick with this country has the best military not because of our abilities but the devotion of our troops make it so. If a woman earns a ranger tab she did it because she truly wanted it. She pushed herself beyond her limits and succeeded. So no matter what others think because its only their opinion i am proud of these women and i ambproud of our troops. Sure they may be women but look how many millions of americans wouldnt dream of going to war yet these women are willing to risk it","commenter_a":"You know Russia in world war 2 fought with women on the front and never had an issue. Israel has women in their military and has never had an issue. Heck they have yet to be defeated. My question is why not allow women the opportunity to serve as well? Set a standard and if a man or a woman either one have the skill and determination to achieve it then that is what we need in our military. It reminds me of a story in Vietnam I heard once (Of course before my time) there was an older black man and an older white man I spoke with once. They were best friends and would do anything for each other. They told me that each was in the 1960s very prejudice. The black was raised to hate whites and the white raised to hate blacks. They went to Vietnam ...","post_message":""},{"comment_id":"1021077537953055","commenter_b":"Stupid assbag thug asshole !! Stupid is as stupid does !","commenter_a":"yes","post_message":"Chevez Antwann Fiason wasn’t expecting this homeowner to be armed. This is why Americans have the right to bear arms. Can we get 70,000 ‘LIKES’ for the Second Amendment?"},{"comment_id":"10153878588886545","commenter_b":"Exactly I thought woman that age... can't have kids, no more.","commenter_a":"Why is a 62 year old getting pregnant and having young kids ? Second the 6 year old is only doing what he sees and what he thinks it's right . Do I think he's a bad seed no . Do I think he needs help after this yes.. This is obviously the only behavior that he knows ... I hope the mom suffers in jail .","post_message":"Kathleen Marie Steele of North Redington Beach, near Tampa, Fla., has been charged with aggravated manslaughter and neglect for the infant's death."},{"comment_id":"10153638805358598","commenter_b":"Abortion is NOT legal!","commenter_a":"just go above the supreme court and ban all abortions.","post_message":"BREAKING NEWS: Supreme Court Won’t Let North Dakota Ban Abortions on Unborn Babies After 6 Weeks"},{"comment_id":"10153391185232217","commenter_b":"Lol. First...there are,a lot of people that doesn't know who she is. I personally have seen some of her exploits, but wouldn't recognize her voice. And second most that do follow her \"music\" doesn't care what she does. Nobody gets mad at strippers. Nobody expects her to be smart...just dress in as few clothes as is legal and shake that azz. And lastly...the demographic that was knowledgeable enough to be outraged...went to work.","commenter_a":"Silly racist white people!!!","post_message":"They really weren't happy about Beyoncé's Super Bowl performance, calling it \"racism\"."},{"comment_id":"10153000609386491","commenter_b":"The Russian lady nailed it. For me, I don't want kids and that is unacceptable to so many people. She only wanted one and that was JUST AS UNACCEPTABLE! We know what we want our families to look like. Trust us, we're women!","commenter_a":"I respect your decision to not have kids. Some people don't. It's an important job that should only be done by people who want you. BUT, I think making a decision like that at 28 years old was a little rash. A lot of things change. I had my daughter when I was 39 years old. Things that make you happy in your 20's are not necessarily going to be the same for the rest of your life. And, don't be sad for people who tell you that there is no greater love than one for a child. There isn't!! Don't knock it just because you don't understand.","post_message":"“What I want is to be happy.”"},{"comment_id":"809566335745494","commenter_b":"So women are just as bad as men, better just keep it men. Got it.","commenter_a":"Sorry but all woman in politics have proven just as deviant and en n efficient as men. So let's not rush anything. They should be recognized for there merits. So are the men that have no connections and money. But stile do amazing work","post_message":"Powerful."}]
