[{"comment_id":"10153264748117690","commenter_b":"I Hope she gets fired! She obviously can't do her job.","commenter_a":"Why does she still have a job? Bottom line she should of been fired end of story.","post_message":"A Kentucky courthouse clerk who refuses to issue same-sex marriage licenses is scheduled to appear before a federal judge Thursday. @webpagelink"},{"comment_id":"1260088087350033","commenter_b":"Do not tell her to shut her mouth! That will change the odds of her getting pregnant from 1 outta 3, to 50-50!!!!!","commenter_a":"Her parenting advise is about as competent as her \"abstinence\" advise. Practice what you preach, or better yet, shut your mouth and fade away to oblivion.","post_message":"Pathetic."},{"comment_id":"10154961510296729","commenter_b":"Lying bitch!","commenter_a":"ALWAYS REMEMBER BENGHAZI","post_message":"And I'll tell you EXACTLY what difference it makes..."},{"comment_id":"1095436653882721","commenter_b":"Shut the Hell Up!","commenter_a":"this asshole can;t handle protesters and people actually think he can handle trained killers. Yeah DISASTER BELIEVE ME DISASTER IS TRUMP","post_message":"Exactly.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154994816928256","commenter_b":"US tax payers are going to pay for that wall that Trump wants built, no skin off his back, he don't pay taxes. Suckers","commenter_a":"Deficits only matter when Democrats run the show. How long until you learn this very simple truth?","post_message":"Republican leaders would not say how they would prevent the massive project from adding to federal deficits."},{"comment_id":"378200662557944","commenter_b":"Three of them are real ladies - the other two cannot even spell the word!","commenter_a":"Nancy Regan","post_message":"Who is your favorite First Lady ?"},{"comment_id":"1143755872353195","commenter_b":"If you don't like rules there move back to Kuwait!","commenter_a":"OLD POST, YOU GUYS.","post_message":"Muslim Welfare Diva Refuses To Take Off Headscarf Gets BRUTAL Message From Judge (VIDEO)  BOOM! This judge smacks her silly! Can we get 1K Likes for this awesome JUDGE!"}]
