[{"comment_id":"450484615139832","commenter_b":"Who give dam who she is jealous hater","commenter_a":"He sucks period!","post_message":"White House panicked..."},{"comment_id":"10152943603067217","commenter_b":"Mosks should be destroyed first","commenter_a":"The earthquakes should destroy only churches.","post_message":"New Zealand's Christchurch was struck by a devastating earthquake in 2011"},{"comment_id":"1376753242362908","commenter_b":"o.k you're can't be racist . how about a whiney , hateful bitch ? yeah ,that suits you better .","commenter_a":"Outrageous!","post_message":"These people are insane."},{"comment_id":"1004633596257472","commenter_b":"I would do the same only faster. Highways are for vehicles not pedestrians. Soooo expect to get run down of you are blocking traffic on a tiadwa","commenter_a":"Finished my run thru Arizona, didn't see no protesters ;)","post_message":"WATCH: DRIVER FED UP WITH ANTI-TRUMP Terrorists Blocking Road Drives Through Crowd…Reaction Of AZ Police Officer…Priceless"},{"comment_id":"10155686821610354","commenter_b":"Please were in Big Trouble if the ASSHOLE gets in. It's bad enough the ASS already in office is dismantling our Country little by little she'll just finish it off. Her and her asshole of a husband.","commenter_a":"She could have changed to state ID if she is no longer driving and that information should have come via letter","post_message":"Clinton said that she was fighting “for the grandmother who’s turned away from the polls because her driver’s license expired.”  If she didn't want it to expire, she could have driven once or twice since 1996..."},{"comment_id":"10153128765639586","commenter_b":"<3","commenter_a":"Jessica Thompson this is why we cut those things!!!","post_message":"ALWAYS CUT YOUR PLASTIC SIX-PACK RINGS.   PETA fieldworkers found this poor feral cat reminding us all how dangerous discarded plastic & other trash can be: @webpagelink   SHARE to remind everyone!"},{"comment_id":"10155406467768812","commenter_b":"Didn't miss em. Had same day as any other.","commenter_a":"Idiots. Proof of the problem","post_message":"People protest around the country in support of a \"Day Without Immigrants,\" a protest against President Donald J. Trump's promises to crack down on illegal immigration. abcn.ws/2kX8c5V"}]
