[{"comment_id":"10152961609451336","commenter_b":"Suck my dick!","commenter_a":"Kanye is absolutely right!","post_message":"Kanye West stole the show again at The GRAMMYs after Beck was announced as the winner for “Album of the Year.” @webpagelink But was it funny this time or just offensive?"},{"comment_id":"10152760994092144","commenter_b":"That first comment wins stupid comment of the month on the internet. But you will call a cop who has a gun to save your sorry ass. You won't take any responsible actions to save yourself or family, but you will pay someone ELSE to put their life on the line to do it for you.","commenter_a":"Screw the nra.MELT THE GUNS!!!","post_message":"\"We're basically being forced to repeal these laws at gunpoint… Every local gun law must go!\""},{"comment_id":"1772923492974110","commenter_b":"@username .. Tippu tip, one of the greatest slave traders known to man that had over 10,000 slaves in Zanzibar, grandmother was a muslim slave. The problem with islam is the contradictions. You inherit the greatness of your lineage as well as all of the ills. The first step for Muslims to get passed this & be accepted in the international community is to accept the past for what it is & stop lying, deflecting, & manipulating it. It only creates more RAGE! Everything in this video is FACT and supported with 100's of years of abundant evidence. This video is actually a low ball. The actual number of victims of islamic genocide s 100 - 150 million deaths. Please stop telling me about \"bilal\" that was a slave in the first place by an arab. Abu bakr freed 3 personal pagan slaves for bilal's emancipation. Am I suppose to ...","commenter_a":"This is the blind teaching the blind. A ratings based media hub focusing on the impulses of the ignorant. This is not accurate about Muslims and therefore makes it inaccurate of Arabs. All Arabs aren't white. There was a black Arab named TIPPU TIP, he was one of the biggest contributers to slavery. He was very black. Look him up. Also, a Arab can't teach islam. Because Islam isn't synonymous with Arabs, it's more wide spread with Asians. Indonesia is the largest population of Muslims. All Arabs aren't muslim. And there were many Arabs who rejected Prophet Muhammed. I love history but I hate when people try to each topics of sensitive topics but pose a biased view. Black people must realize we are not all the same. Americans aren't the same a all Africans. We know why we're African, but most don't know we're more American than the white ...","post_message":"10 Facts About The Arab Enslavement Of Black People Not Taught In Schools"},{"comment_id":"1050627531700165","commenter_b":"Go Hillary!","commenter_a":"I don't think Republicans even talk a good game. Nothing but LIES and the people who vote for them are too stupid to see it.","post_message":"\"We cannot – and I will not – put our vets at the mercy of private insurance companies without any care coordination or leave them to fend for themselves with healthcare providers who have no expertise in the unique challenges that are facing our veterans.\"   --Hillary Clinton"},{"comment_id":"637619203037928","commenter_b":"Screw you DOUCHE BAG!","commenter_a":"Death penalty on her to just for giving birth to him and the other syco!","post_message":"This is upsetting."},{"comment_id":"1610722349214878","commenter_b":"wow beautiful.......","commenter_a":"Beautiful","post_message":"Wow. I've got chills.  God is so good."},{"comment_id":"10152762563712894","commenter_b":"I can't stand that Bitch.","commenter_a":"For some reason i like the color & hair, I just don't fuck with Kylie like that tbh . Then again I feel as though she low key disrespecting black folks with this shit. She tried it with the lips & butt but this shit right here just made me feel like she's doing the most now","post_message":"Say What Now? Kylie Jenner Says She Wishes She Looked Like THIS All The Time [Photo]"}]
