[{"comment_id":"782996508468592","commenter_b":"@username You know nothing fool.","commenter_a":"U.S. Attorney General Loretta Lynch is an idiot. Her and the Obama Gang are clearly violating the US Constitution and disregarding the rights and safety concerns of women and children. She should be hauled into congress for questioning.","post_message":"Just in: U.S. Attorney General Loretta Lynch announces that the Justice Department is suing North Carolina over bathroom law. \"This action is about a great deal more than bathrooms.\" @webpagelink"},{"comment_id":"10153237578092144","commenter_b":"So she's dumb n ugly","commenter_a":"she's as smart as she is beautiful...","post_message":"To borrow a line from \"Jaws,\" she's either very very smart or very very dumb."},{"comment_id":"1236409066433862","commenter_b":"Clifford Maclean Losee","commenter_a":"Save your money you bunch of fruit cakes!!!! You might be able to afford things if you would quit donating to lost causes!","post_message":"Michigan certifies President-elect Donald J. Trump's win in the state, awarding him 16 electoral votes. @webpagelink"},{"comment_id":"10153594349921162","commenter_b":"Yolo","commenter_a":"Cesar Orozco @username @username","post_message":"Tomorrow could be the hottest day in nearly 2 years - if we reach 93!"},{"comment_id":"1171664359552992","commenter_b":"Idiots...they should be training Americans how to protect themselves from Muslims","commenter_a":"Hahahahahahahah very funny","post_message":"@webpagelink"},{"comment_id":"10156057897300725","commenter_b":"Who would vote for this guy?! Mexicans are the main ones who supplies you with your food and groceries! They built all the buildings you take advantage of today!","commenter_a":"They aren't crashing. Get real. And what the hell do you think you could do about it, huh?? Kick Walmart out of America? They put China on the map today. Good business people. Anything for a buck.","post_message":"Markets are crashing - all caused by poor planning and allowing China and Asia to dictate the agenda. This could get very messy! Vote Trump."},{"comment_id":"1616274731928330","commenter_b":"Did you see where in California they are registering Illagals to vote, guess who they will vote for?","commenter_a":"Obama distracts us while he slips his executive orders by us with out much attention. Democrats weren't for gay and lesbian or transgender rights until Hillary needed more votes. Last election Hillary ran in, she is on video saying marriage is between a man and woman. She flip flopped and so did the party for more votes.","post_message":"Hey, Leftists: you want to stand up for LGBT folks? How about joining conservatives in speaking forcefully and honestly about the MURDER of gays and lesbians by MUSLIM terrorists inflicting SHARIA LAW?  Oh...that's right, Obama doesn't allow you to talk about that. So instead you \"boldly\" focus on men using women's changing rooms and bathrooms and ignore the DEATHS of hundreds of gays and lesbians, because identifying their killers would require you to utter the words \"Islamic terrorists.\"  Gee, how \"noble\" of you, how \"brave.\"  #phonies #poseurs"}]
