[{"comment_id":"10153381593334411","commenter_b":"If you've been in brothel, you are worse than a prostitute, as prostitutes might were forced to do it, you go there at you own will, which makes you a sleaze-ball","commenter_a":"idk, a Russian backed news organization saying America is a police state? Maybe, but few people are being jailed for being gay here as opposed to your \"glorious\": homeland","post_message":""},{"comment_id":"10155234645559199","commenter_b":"Kerri Andreson","commenter_a":"Janie Marsh","post_message":"A man in his 30s drowned at the Wild Waves theme park in Federal Way."},{"comment_id":"10154742011562908","commenter_b":"Stfu","commenter_a":"Raise taxes on corporations they either go overseas or pass the expense on to the consumer. Bernie can't tax enough to pay for free everything.","post_message":""},{"comment_id":"10153352503921051","commenter_b":"Ha ha bitch","commenter_a":"Don't see a problem with this. Fl. Courts finally got it right","post_message":"The Hello Kitty Rapist, a horrible man whose crimes included sexually assaulting multiple women and attacking a war veteran, just learned his fate."},{"comment_id":"10153492592416336","commenter_b":"Lol, I guess I won't state the obvious...","commenter_a":"No that's not okay, nor professional. What is okay is to speak to the parents and ask them to remove the child until he or she is calmer.","post_message":"Darla Neugebauer, owner of Marcy's Diner, said she’s not sorry for yelling at a 21-month-old for crying in her restaurant because it got the girl to be quiet.  Is it okay for a restaurant employee to yell at a child?"},{"comment_id":"1699094263675768","commenter_b":"Let's review the facts: The shooter was a Muslim. He pledged allegiance to the Islamic State. He targeted people that patronized a gay nightclub in the U.S. Daesh executes homosexuals. Jihadis don't believe in coexistence and they don't spare pacifists. Oh, and you cannot reason with these savages. Questions?","commenter_a":"And Obama and Hillary want to disarm us and bring a hundred thousand of these kind of people over here","post_message":"Breaking News: Police say 50 people were killed and 53 were injured in the Orlando nightclub shooting and are asking the governor to issue a state of emergency.  Fox News can confirm that the gunman is Omar Mateen, 29, of Port St. Lucie County, FL, a US citizen of Afghan origin. @webpagelink"},{"comment_id":"10153936528885695","commenter_b":"You run like a girl","commenter_a":"Jose Arellano that's probably why we saw the traffic earlier today","post_message":"Wait for it...wait for it -- a police officer chased three shoplifting suspects across Georgia 400 after this car crash. See the full video, plus we'll explain how it all started, at 5:14! @webpagelink"}]
