[{"comment_id":"1814189528815874","commenter_b":"Hillary is use to debates Trumps not and can't even deal with a woman with a baby during his speech","commenter_a":"Wait until the debates, when Hildebeast turns into a shrieking harpy on stage when confronted about her many, many schemes, scams & failures. Take a poll then.","post_message":"A new Fox News poll shows Democratic nominee Hillary Clinton leading Republican nominee Donald J. Trump 49 percent to 39 percent among likely voters, while 61 percent of respondents say they consider Clinton to be dishonest."},{"comment_id":"10154662154026323","commenter_b":"God help America and American people if these two women get into the White House.","commenter_a":"The nastiest of women. Apparently Nasty women are UN shills hell bent on overthrowing the rule of law in America, and worldwide. Cunts.","post_message":"“Get this, Donald. Nasty women are tough, nasty women are smart, and nasty women vote, and on November 8, we nasty women are going to march our nasty feet to cast our nasty votes to get you out of our lives forever.”"},{"comment_id":"10153646612799071","commenter_b":"Thank you my sweet. Lucky dog!","commenter_a":"@username here is the video I was talking about 🐶","post_message":"Rumbo Mediterráneo quit his job to kayak the sea with his dog."},{"comment_id":"1314229205273274","commenter_b":"Stupid, greedy women who don't respect themselves LOVE Trump. I mean, look at his wife.","commenter_a":"So they're trying to use looks to get people to vote for a man who half his party do not even like.","post_message":"People started freaking out when the hashtag #TrumpGirlsBreakTheInternet started trending Sunday night."},{"comment_id":"895490467164248","commenter_b":"Married women have abortions too !","commenter_a":"Pro choice is about a woman's right to screw like a whore without any consequences. That's the reason Obama wants it for his kids.","post_message":"Do you agree?"},{"comment_id":"1053645448090460","commenter_b":"Jihad Malik ..get off this post ..your mama was stupid for making you","commenter_a":"Why don't you post a story of the anti Semites throwing people off of buildings in the countries surrounding Israel....they are the people you should be fearing and writing about ...The JP has joined the Shrillary camp","post_message":"Schmitz has called the accusations defamatory, but reports of anti-Semitic tendencies at the top of the Trump team reinforce the narrative."},{"comment_id":"992749454106935","commenter_b":"Truth be told and Trump will get to it publically soon: we're at war with Mexico. Take back southern AZ from the drug cartels. Put the military and night vision drones on the border along with the wall. No way will I go there either. And right on look at labels and BUY AMERICAN!","commenter_a":"Go Trump. Excellent rally. Gotta love truth and intelligence.","post_message":"Donald J. Trump spoke to thousands who braved the heat at a rally in Fountain Hills today. If you missed the event, you can watch it here: @webpagelink"}]
