[{"comment_id":"10153170406841770","commenter_b":"I SAY MERRY CHRISTMAS And Happy Easter !! NO MORE REFUGEES ! THE PEOPLE NEED TO BE REMINDED THAT FDR AND CARTER DID WHAT TRUMP IS SUGGESTING ! THE PEOPLE NEED TO HELP DONALD J TRUMP [ MAKE AMERICA SAFE AND GREAT AGAIN ] VOTE FOR AMERICA ! ABOLISH ALL GUN FREE ZONES AND ESTABLISH A NATIONAL RECOGNIZED CONCEALED CARRY ! NEVER FORGET WHAT THE DEMislamOCRAPS AND obuma HAVE DONE AND ARE TRYING TO DO TO AMERICA ! PASS IT ON !","commenter_a":"Saying a specific group of people matter above others is highly racist and prejudicial.","post_message":"Black Lives Matter protesters are filling the streets of Chicago Wednesday, blocking traffic and disrupting the city to protest police actions relating to the death of 17-year-old Laquan McDonald."},{"comment_id":"10153226681651833","commenter_b":"Thanks Jason - the \"next one\" will probably effect me, though.","commenter_a":"I don't even own an AR, but I sent an e-mail to the ATF \"comments\" site opposing the ban on M855. I also sent e-mails to my congressman and both senators and signed a petition about the same issue. I suspect that the motivation is simply that the government doesn't want those who own ARs to have a source of reasonably priced ammo for their guns. I oppose this mindset.","post_message":"A notice from the Bureau of Alcohol, Tobacco, Firearms, and Explosives (ATF) shows the agency is considering a ban on the popular M855 AR-15 round  by re-categorizing the round as  piercing.  Be sure to contact ATF and let them know you oppose this proposal. Then contact your members of Congress and express your opposition to ATF's ammo ban.  @webpagelink/ #M855"},{"comment_id":"10153127568784877","commenter_b":"This whole story interests me lol. This lady clearly has some issues, as u said. Smh","commenter_a":"They couldn't tell she is white? We need to be questioning the people who voted her in more than her!!!","post_message":"Rachel Dolezal gave lectures on ‘nappiness’ and ‘the brown paper bag test’, once told student she didn’t look ‘Hispanic enough.’ People from her past are coming out of the woodwork!   Grio fam, do you think the claims that Dolezal is a hypocrite are valid?"},{"comment_id":"947171632075323","commenter_b":"She can put them in her house","commenter_a":"She is insignificant.","post_message":"Now Amal Clooney slams Britain!"},{"comment_id":"10154915468813984","commenter_b":"The demasses aren't scared of the end. They're scared none of their demon plans to let illegals run our country will be stopped and their kickbacks will end. Yep it's gonna end. We are not your puppets and you can't control us!!!!!","commenter_a":"right on","post_message":"Ann Coulterjust NAILED it... she is going to infuriate a TON of liberals with this."},{"comment_id":"1099626483393732","commenter_b":"RINO revolt began with Romney. We shall soon see a series of similar dogs.","commenter_a":"Ventura is a jackass!","post_message":"Someone other than Michael Bloomberg is considering a run for president.  Could this controversial figure make an impact on the 2016 race?"},{"comment_id":"10158241911570405","commenter_b":"That part about Kansas is not true. Our state is so far in the hole and we do not have the \"workers\" with that income. It was a pipe dream. The state just passed the largest tax increase in history because of the lack of income. Our budget fell short ever since this governor installed is plans.","commenter_a":"Once again @username when you source things from right wing rags, you lose credibility. Most won't even read it and those who do already support you. It's concerning that these are the only sources you can reference...","post_message":"Welfare Reform & Wisconsin: Walker Is Leading the Way | National Review @webpagelink"}]
