[{"comment_id":"1174610022559026","commenter_b":"Build a wall , deport all illegal but no one will believe you","commenter_a":"Send them and their anchor babies home where they belong ,, Trump in 2016 ,,, I'll help with the roundup for free ,,,","post_message":"@JebBush faces Trump-led headwinds in attempt to change the GOP's tone on immigration."},{"comment_id":"10153595833422439","commenter_b":"@username - stop them in their tracks? When? So far we've done nothing and the media's not reporting on stuff as ordered by our gay muslim prez! Meanwhile he's flying hundreds of thousands more in and setting up cells all over our Country. Trey Gowdy tried to stop it in SC and the planes and buses keep coming and dumping them.","commenter_a":"I don't think the muslims fully understand that the American people will unite and stop them in there track. God Bless America","post_message":"Coming to America. It’s just a matter of time. The only difference between Islam in Europe and Islam in America is we started importing whole Muslim communities a lot later than Europe. But we are on the same path to ruin."},{"comment_id":"10154761177058812","commenter_b":"She's a lying sick woman","commenter_a":"Amazing how you say you are happy to answer questions about the Clinton Foundation, but you NEVER DO! You have done more dirty deeds in your lifetime than one person can imagine. I love how you are like a child. You get called out for your own wrongdoings ( and then tell the FBI you have a concussion and cannot remember anything.. BS) so to take off the heat you try to point fingers at the other guy. If you win, American deserves what they get.","post_message":"In an exclusive interview with ABC News David Muir, Hillary Clinton calls for scrutiny of \"questionable\" Trump Foundation dealings in light of IRS fine: abcn.ws/2c4YKqd"},{"comment_id":"1027522093954929","commenter_b":"And she REALLY makes Alaska look like it's full of idiots. How else did she get elected Governor in the first place?","commenter_a":"And to think that was John McCain's pick for VP. Embarrassing.","post_message":"This one is a CLASSIC."},{"comment_id":"10153686388831320","commenter_b":"Disgusting these women","commenter_a":"I know it's o.k.-u know it's o.k.-get over it. body paint is o.k.- don't go if it's NOT o.k. w/u!- nuff said??","post_message":"Art or offensive? Women in nothing more than body paint and a thong are taking pictures with tourists in Times Square. How do you feel about what they do? @webpagelink"},{"comment_id":"10154786755561438","commenter_b":"Fascist pigs.","commenter_a":"Just like China!","post_message":"All Interior Department Twitter accounts had been ordered shut after the inauguration."},{"comment_id":"10153259880651162","commenter_b":"I wonder what he thought was going to happen to her after he beat her w/ the hammer?","commenter_a":"Hit her in the head with a hammer and get an I bond He's the real MC. HAMMER","post_message":"HAMMER BEATING: An 87-year-old man beats wife with hammer at a hospital to avoid her surgery ..@webpagelink"}]
