[{"comment_id":"10153003184965671","commenter_b":"Remove the millions of illegals. It may be a smaller piece....but it is still huge.","commenter_a":"Somewhat comical given the subject. If you're really worried about climate change and water, STOP GRANTING BUILDING PERMITS that CONTINUE to INCREASE California's population and water requirements.","post_message":"\"Longer fire seasons, extreme weather, and severe droughts aren’t on the horizon, they’re all here – and here to stay. This is the new normal. The climate is changing,\" Brown wrote in a letter addressed to Donald J. Trump.   Thoughts?"},{"comment_id":"10153186802728203","commenter_b":"\" \"There is very little in the Bible which reflects the modern idea of one man and one woman united by love, Jimmerson said explaining her support for gay \" \" Let's see Genesis 1 & 2 gives us the pre-fall structure of marriage. This was reiterated by JESUS in Matt 19 and Mark 10. There is no higher attestation then that.","commenter_a":"That's not up for contemplation if they did be sure to expel them right away","post_message":"Southern Baptist affiliate may expel church for performing same-sex ‘wedding’"},{"comment_id":"550965321772492","commenter_b":"@username I think there's more chance of a war with Clinton. She's voted for a couple already and seems intent on aggregating Russia with unfounded accusations.","commenter_a":"The Clintons always try to \"cover their tracks\" because their corruption is so deep. And they make sure they have info on others who can be manipulated via blackmail at a later date to further the Clinton agenda. PRISON is where they deserve to be!!","post_message":"This is worrisome..."},{"comment_id":"1309167775828422","commenter_b":"Start packing and get the hell out of America now","commenter_a":"Don't forget to take your BS . with you","post_message":"At least one Hollywood celebrity has kept their word. Here's a star who said they'd leave the United States if Donald J. Trump got elected who's actually doing so...  Bon voyage! We can think of a few more you can take with you!"},{"comment_id":"10154359773191519","commenter_b":"I'm sure all the lesbians would disagree.","commenter_a":"A woman's orgasm is measured by the size of a man's bank account","post_message":"The female orgasm has befuddled men, women and scientists for centuries."},{"comment_id":"1205061579572376","commenter_b":"Christina @username you stupid c-unt you clearly can't read into my post. Go suck on Killerys nip..... Trump 2016","commenter_a":"For all of you who want to tell us it's a leased Eastern Airlines plane. Save it we got it and read it.....","post_message":"Barely 24 hours after Donald J. Trump accepted the GOP nomination for president, something incredible happened with his plane.  What Trump ordered for the plane has conservatives cheering and liberals pitching a hissy fit."},{"comment_id":"10152912093186749","commenter_b":"PUKE.","commenter_a":"PUKE","post_message":"This Valentine's Day, Nicholas and Dylan are finally able to celebrate their legal marriage. This is progress. @webpagelink"}]
