[{"comment_id":"10153087733461350","commenter_b":"She is truly fit and very pretty but sorry I still do NOT think seeing a huge belly and huge belly button sticking out is that appealing. Pregnancy is a beautiful thing, but come one get some class. I know all of you that think showing everything is great will have a fit over my comment. But if people would be honest, see through material showing huge bellies with huge belly buttons is not that appealing. I guess nothing is supposed to be left to the imagination or in the bedroom. I have seen some very sexy maternity outfits and this is not one.","commenter_a":"When is Jenna due ? Amazing fitness ! Love all y'all !","post_message":"Do you have questions for our #startTODAY experts? Ask below!  Jean Chatzky, Joy Bauer, Jill Martin and Jenna Wolfe are taking your questions on money, diet, fitness and getting organized. questions."},{"comment_id":"10153118499596955","commenter_b":"Hemlock, anyone?","commenter_a":"These stories are being given as some form of programming... The nation was taken over and completely changed post Lincoln and forever altered for the globalists post JFK... If they want to move a major agenda forward they throw the nation off by creating spectacular distractions... This is subtext leading to a possible grand piece of theater.","post_message":"'Drunk' Secret Service agents disrupted bomb probe..."},{"comment_id":"10153508194124087","commenter_b":"Paid shills","commenter_a":"Twenty-six years ago when Savvy Woman ran him on the cover, four of the eight people in Trump innermost circle were women, including his then wife Ivana, who was not in any of these particular photos but who was running the Plaza Hotel at the time. The others, all executive vice presidents, were: Barbara Res, who was in charge of construction of Trump Tower and then the Plaza; Blanche Sprague, head of project development; and Susan Heilbron, who was Trump chief lawyer.","post_message":"“Nobody has more respect for women than I do,” Donald J. Trump said. “Thirty years ago I had a woman building a major construction project in New York City. That never happens. I’ve been great to women and they’ve been great to me. I’ve had so many women executives [and] they’ve done a great job.”"},{"comment_id":"10153898357108984","commenter_b":"@username - there is a huge difference between then and now regarding \"camps\" and rounding up people; if the refugees were peaceful, they have proven otherwise, but if they were- they would not be in \"camps'- we didn't round up the illegals and place them in camps- the only reason they would be in camps now: time to be thoroughly vetted before allowing them among the citizens in America. Reasonable- yes.","commenter_a":"It seems as though the Founding Fathers knew something like this could happen, and in the Constitution under the 9th, and 10th Amendments gave each State the right to Sovereignty. State's that \"believe\" in the Constitution should be able to break away from those that want excessive government control, and socialism! the de-centralization of power is essential to the preservation of \"Freedom\", Washington has no more right to control us than London does. There is a reason we are defined as \"States\", and not Provinces. we are sovereign state with our own constitutions. Our union was formed as an agreement between the States. Texas itself made it part of the agreement to join the union that they could leave at anytime. America was founded as a Confederation. Abraham Lincoln destroyed our states rights. I can assure you that Washington will not hold us together by force should we choose to ...","post_message":"One state is taking the refugee crisis seriously, and they're now making a huge move to send in the National Guard.  Obama may be able to bully other states, but this one's not having any of it.  Time for the rest of the states to follow their lead!"},{"comment_id":"10153485432146323","commenter_b":"I'm coming niggas!","commenter_a":"@username this was the place I was talking about when we were talking about the travelling think","post_message":"Surfer Mick Fanning makes a lucky escape after being attacked by a shark during the final of the J-Bay surfing competition in South Africa on Sunday. Full story: @webpagelink"},{"comment_id":"1152390574850299","commenter_b":"Wish these women would press charges! That would be wonderful...","commenter_a":"This woman should bring legal charges. It is too bad she did not haul off and slug him then and there. There are too many honest credible women coming forward to ignore. Even die-hard Trump supporters should think twice about supporting such a lech. And no, the Clintons are not paying all these women to come forward. Use spell check if you want to be taken seriously Maynard.","post_message":"This makes 12 women that Trump is accused of not being able to keep his grubby, tiny hands off of."},{"comment_id":"10153374957661051","commenter_b":"Of course, a common sense approach. All sales and transfers should be subject to a background check protocol. Keep up the rhetoric NRA, unless we see some common sense prevail among the gun lobby & gun nuts the eventual backlash is going to greatly affect responsible gun owners.","commenter_a":"To purchase any firearm there are already checks in place.","post_message":"Do you agree or disagree with America's police chiefs on this?"}]
