[{"comment_id":"10153043162846130","commenter_b":"@username do us all a favor get a vasectomy","commenter_a":"You could skip the asking your boss to buy it for you and just buy it? Saved you a step. :)","post_message":"“Ask your doctor if birth control is right for you… then ask your boss if birth control is right for you.\""},{"comment_id":"10153035798681336","commenter_b":"Do you support PETA? They are know as animal killers! And it's part of their manifesto!","commenter_a":"I don't support circuses just for the reason that they are notorious for abusing animals.","post_message":"Ringling Bros. and Barnum & Bailey Circus will phase out the show's iconic elephants by 2018 because of growing public concern over how the animals are treated."},{"comment_id":"1695824464005067","commenter_b":"@username here I even did your researching for you but you can pick from numerous articles about him dodging the draft. @webpagelink","commenter_a":"Trump you spent all night at your rally tonight, calling Cruz a liar and cheater. Your supporters don't seem to concerned about your non polices and non plans. Keep dodging Cruz in a one on one debate, it just proves that you're the real liar! Since you said you wanted a one on one debate with Cruz, you're a dodger in every way.","post_message":"Donald J. Trump said he didn't call Ted Cruz 'Lyin' Ted' in his New York victory speech because \"I thought it would be very undignified for me to get up at that particular moment with ... pretty much the world watching.\""},{"comment_id":"10153391178593132","commenter_b":"And there's that mentality, \"if you're white you can't have an opinion.\" Yet we're the racist ones right? You do know every time you say that you shame someone of color who is dignified and intelligent, because they get lumped in with the likes of you.","commenter_a":"I don't like playing the race card!! But this is proof!!! Wow!! If she was Latin or a African American person! She wouldn't get off so easily! They shoot to kill us... Jt saying","post_message":"Ouyang told authorities that her behavior was a cry for help."},{"comment_id":"10152676040812293","commenter_b":"Really beautiful","commenter_a":"What ever you do . don't feed your mule a carrot ...He or she won't leave you alone. We had BLAST.","post_message":"The full, panoramic view is breathtaking."},{"comment_id":"1765614553704778","commenter_b":"Congress has the power to IMPEACH HILLARY now for all the massive lies & corruption at its highest level. Ask your Congress person WHY THEY ARE NOT?? Where is the integrity of Congress?","commenter_a":"So the White House knew full well about Hillary's email after all .. one false narrative after another. This nation cannot survive another 4 years of corruption like this!","post_message":"\"The IT professionals who whitelist devices at places like the White House only add the email addresses authorized by management.\""},{"comment_id":"10154342587333258","commenter_b":"David Mayhew The problem with your statement is that your assumption is that just because they have been drinking, they are going to use a gun. Just because a guy drove to a bar with his car does not mean that he's going to do something irresponsible with it. I guess we should start seizing the cars of bar hoppers. Or we could categorize those cars that are most often DWI that injure or kill someone as \"assault cars\" and start seizing those.","commenter_a":"Fewer guns would not have stopped this lunatic. We need more good people to be able to lawfully carry guns into more public places because the criminals will carry them wherever they want.","post_message":"The common thread in too many mass shootings was the availability of powerful semiautomatic weapons that serve no purpose but to kill. | Via Boston Globe Opinion"}]
