[{"comment_id":"1303809496299333","commenter_b":"Let us pray all that hard work won't be wasted. Hillary for prison 2016!","commenter_a":"It's going to take a lot of lawyers to keep her out of jail...finally some shovel ready jobs!","post_message":"This investigation shows no signs of slowing down."},{"comment_id":"10154064604487383","commenter_b":"Of course","commenter_a":"Well, so much for the \"Same standards\".","post_message":"The flexed-arm hang might be here to stay."},{"comment_id":"10154399256191162","commenter_b":"@username you're an illegal immigrant you can't vote","commenter_a":"I bet she's a Trump supporter .Maybe that thin skinned racist will pay her legal fees .","post_message":"Woman from Humboldt Park charged in Evanston Target bathroom explosion: @webpagelink"},{"comment_id":"1300733136636619","commenter_b":"Crooked Hilary!! She lose everything ad her life evil woman!","commenter_a":"The Clintons are Milliinaires who t.Trump values over his loser voters","post_message":"They illegally set up a charity to line their pockets for foreign influence...most countries call that treason."},{"comment_id":"10155034112494445","commenter_b":"She's nervous he may grab her by the pussy!!!","commenter_a":"She looks nervous as would I this has been a big day for them, STOP THE HATE, she is a beautiful woman... let's be real how would you be if the entire world was watching you!?","post_message":"President Donald Trump and First Lady Melania Trump share their first dance as the First Couple.  @webpagelink"},{"comment_id":"10153542250533812","commenter_b":"Chriss if you lease a car. Can anybody come in that vehicle and disrespect you. Chriss you happened to get a job that you get assigned a vehicle can anybody come tell you what and how. You're a smart man. You might get a job that requires you to move out of the state or even the country. That job comes with all expenses paid for four years including the house and the car. You tell me who can come in there and disrespect you. Not even the ceo or cfo of that company can do that without proper protocol. You had to move your family. And your doing your best job. Think about that chriss. YOUR A SMART INTELLIGENT MAN","commenter_a":"Pres. Obama. It is America's house we only let you borrow it for a little bit! Respect all people as you desire to be respected. You are in my house and every legal Americans house. Not that they were right but you are wrong!","post_message":"WATCH: Pres. Obama normally lets hecklers speak, but this time, he put his foot down: \"OK, you know what? No, no, no...\""},{"comment_id":"10153877739389205","commenter_b":"Whores these days. Pffffff 😂","commenter_a":"\"The protest has grown larger...\"","post_message":"One college is fighting for the right to carry…dildos."}]
