[{"comment_id":"1265496813476971","commenter_b":"Angry black priviledged woman.","commenter_a":"He likes ugly women , that's as close to nice as I can get.","post_message":"People say during the #Christmas season I should say something nice about Obama, so I wrote Michelle to see if she can think of anything..."},{"comment_id":"10154188943324255","commenter_b":"How is it that these backwoods fucktards are so hopped up about the rights of fetuses, but when that fetus grows up and needs public assistance, they think it's a loser and a piece of shit? Idiots. I guess this is what happens when you fuck your sister.","commenter_a":"yeah lets legislate morality. Like that ever works. Like some others have said, forget getting any of my tourist dollars.","post_message":"All these new restrictions will not make abortions go away. But they will kill women."},{"comment_id":"898756240177140","commenter_b":". . . and it's just going to get worse until we deport them all ! ! ! !","commenter_a":"LOL. LOL. These retarded Liberals! Can't we all just get along... you stupid liberals have brought this into our country... and now it will be like the middle east... Socialist DEMOCRATS SUCK!","post_message":"(Video) Is 2015 the year we see outright war between radical Muslims and Americans on our streets?  As exemplified by the actions of these Texans, Americans will push back against Islamization with highly provocative moves.   Will Obama be able to keep his jihadists in check until he declares Caliphate?  Read More + Video:  @webpagelink"},{"comment_id":"10153721123493132","commenter_b":"Just another hoe looking for her five minutes of fame smh","commenter_a":"Remember when it was shameful and embarrassing to be the other woman.","post_message":"She is no longer an employee of the family."},{"comment_id":"10153329101624087","commenter_b":"Shut em down and bulldoze em!","commenter_a":"HAHAHAHAHAHHAHAHAHAHAH HE HAS 0% CHANCE TO WIN!! WORRY NOT NON- RACISTS!!!!!","post_message":"\"You're going to have to watch and study the mosques, because a lot of talk is going on at the mosques,\" Donald J. Trump said. \"I would hate to [shut down the mosques], but it's something that you're going to have to strongly consider because some of the ideas and some of the hatred, the absolute hatred, is coming from these areas.\""},{"comment_id":"1241639679186713","commenter_b":"What A Dumb Bastard !","commenter_a":"Without Freedom of and from Religion America is not a Free Country! Separation of Church and State! #VOTE The Republican #PARTYOFHATE out of local state and Federal Government #ENOUGH #VOTE #GUNSENSE #VOTE #Hillary2016","post_message":""},{"comment_id":"10152856815999753","commenter_b":"Lol. A lot of people. A perk of being a sociopath is the ability to manipulate people like butter. She's mentally unstable. The worst they do is put her in a padded room until they believe her meds and treatment are good enough to let her back out in society.","commenter_a":"Smfh.. Good! Let's see who she can manipulate like that behind bars!!! R.I.P.","post_message":"Michelle Carter said all the right things when her friend Conrad committed suicide. She even organized a fundraiser in the teen's name. Then police discovered the texts she had sent him."}]
