[{"comment_id":"1112148695548048","commenter_b":"Imagine if Hillary did all the finger wagging that Bernie does in debates?","commenter_a":"Men can get away with anything this election season that women (Hillary) could not. Waving their arms, swearing, making fun of people...anything goes.","post_message":"Social scientists have found the exact same affect by a woman simply doesn’t play the same way."},{"comment_id":"10153238433806782","commenter_b":"So you have no problem sharing a restroom with men? That's not how I perceive most women feel","commenter_a":"Oh for Pete's sake, does government really belong in the restroom???? Work on something that really matters! Schools, roads, infrastructure, the things government does belong. Are you going to post guards in every bathroom and have to check your \"plumbing\" to see what you are equipped with to make sure you are going to right one???","post_message":"A similar bill was filed in Oklahoma: @webpagelink"},{"comment_id":"10153047880386130","commenter_b":"Oh Florence, you dirty gal!","commenter_a":"Failed attempt at humor...","post_message":"You’ve seen the headlines.   Now it’s time to finally hear from the Brady at the center of the controversy…"},{"comment_id":"10153166657159456","commenter_b":"White devils are a nightmare!!","commenter_a":"Welcome President and Mrs. Obama. It is an honor!","post_message":"UPDATE: President Obama has arrived in Selma. Scheduled to speak at 1:35 p.m.  The President is on his way to Selma after landing in Montgomery. Should be there soon! @webpagelink"},{"comment_id":"10157077224085354","commenter_b":"Ignorant slut","commenter_a":"Crazy socialist bitch","post_message":"The only thing \"ludicrous\" about it is what Debbie Wasserman-Schultz said this morning.  WATCH:"},{"comment_id":"10155111456982178","commenter_b":"True, she just lies about everything to get votes. If she wins the WH we are all in trouble. ObamaCare will continue! Taxes will rise! Food prices will rise! More people will be out of work! Education will decline!","commenter_a":"Trump: Make America Hate Again!","post_message":"NEW POLL: Donald Trump is wildly unpopular among young adults, in particular young people of color, and nearly two-thirds of Americans between the ages of 18 and 30 believe the presumptive Republican nominee is racist. wral.com/@username"},{"comment_id":"638889179634994","commenter_b":"Fat hoes crack me up","commenter_a":"Yep. Fat people shouldn't fly","post_message":"This airline is not going to allow people who weigh too much to fly on their plane.  They have absolutely no right to subject us to this.  Do you think this is out of line?"}]
