[{"comment_id":"985399901519758","commenter_b":"Stupid cow what did she expect","commenter_a":"Really?","post_message":"'I thought he was The One'"},{"comment_id":"10153562677106680","commenter_b":"She wouldn't work for him with a gun to her head.","commenter_a":"Please please trump get CONDOLEEZA RICE as ur running mate. I understand that u do not want to pander, but like it or not, this elections , the woman card has been dealt unfairly by crooked Hilary. But i think looking at it positively , trump has an opportunity with CONDOLEEZA RICE. She was a magnificent SOS. Hardworking as hell , logged more air miles then any other SOS. By choosing CONDOLEEZA , trump will also show to the American voters a good example of a SOS. Besides she has great Christian values, very very qualified and better then most of her male counter part","post_message":"Paul Manafort said he'd also be 'surprised' if the front-runner put out his tax returns."},{"comment_id":"10153641975856234","commenter_b":"I don't know if it is objective or not. Some day we may find a genetic marker for transgendered people. In the mean time, you can travel to a state where you can find a chick with a dick to stand next to you as you pee.","commenter_a":"Interesting that the states with the lowest tax rates are places where I would NEVER want to live. I guess you really do get what you pay for.","post_message":"State and local taxes in the Garden State were 12.2 percent of income. See how that compares to other states."},{"comment_id":"10153860707103812","commenter_b":"@username So she should just be allowed to sit there and disobey?","commenter_a":"Guess you should do what your told instead of thinking your above the law because your a minor. This should happen more often. It is no wonder law enforcement is backing down because everytime they do thier job they get ridiculed.","post_message":"WATCH: Video shows uniformed deputy grab a female high school student and wrestle her out of the seat and to the ground. @webpagelink"},{"comment_id":"10153583881674087","commenter_b":"What Hillary Clinton is going to do about the unpaid maternity leave that women have to take there is no coverage for that in the United States","commenter_a":"Nancy was backing trump","post_message":"Hillary Clinton will leave the campaign trail on Friday to attend the funeral of Nancy Reagan and pay her respects to her fellow former First Lady who passed away this week at the age of 94."},{"comment_id":"10152804674496094","commenter_b":"Can't wait to put the clothesline back up...hard to hang dry all the time when you're in a deep freeze for several months of the year.","commenter_a":"Lets force them!","post_message":"Human beings are highly adaptable, but even in the face of climate change, many remain unwilling to do more than tweak their current lifestyles."},{"comment_id":"10152943913476051","commenter_b":"Laura Mae Floering go break a hip old saggy tits","commenter_a":"We can't have white history month United white college fund White entertainment television White colleges That would be racist right?","post_message":"When a deli owner posted this sign on the front of his business, he didn’t think it would be that big of a deal. Well, it was. Now he's dealing with the consequences."}]
