[{"comment_id":"10154245788639060","commenter_b":"\"Women: Kill yourselves.\"","commenter_a":"Rename this rag to The Feminist. I'm sure that there was something else happening in the world today more important than finding another excuse the use the word misogyny in an article. Generally more men die in every society than women by an order of magnitude. Women have a lot of catching up to do to meet those equality of outcome goals.","post_message":"The murder of a young woman in South Korea has prompted hand-wringing over festering misogyny in a country that ranks near the bottom of the pile for gender equality"},{"comment_id":"1532142173492916","commenter_b":"Oh we will because we need to stay united and fight. I mean go out there and protest, boycott Trump businesses, follow advice of people like Michael Moore, Bernie Sanders, Keith Olberman. I am saving my money and will travel to places where protests will be visible and impactful. Also, we have to find a way to help each other. Si se puede.","commenter_a":"2018 is just around the corner. We will clean house and send republicans packing!","post_message":"Conservatives will do anything to win what they perceive as the \"culture war.\""},{"comment_id":"731507293614546","commenter_b":"DUMBASSES...HAVE TO KILL THINGS...HUMANS ARE FUCKED UP.","commenter_a":"He should have drug it up on the shore and smashed it's head in with a boat oar. The only thing a fish like that is good for, is seriously limiting the population of other fish in it's habitat. You can't even eat a fish like that, you could try but I wouldn't advise it. #Conservation #BottomFeeders","post_message":"Surprised?"},{"comment_id":"1765146687072705","commenter_b":"Do it dools ya pussy","commenter_a":"Dooley Whitton","post_message":"What you need to know about Flakkathe alleged drug used by an FSU student who fatally stabbed a couple."},{"comment_id":"10152852200292014","commenter_b":"Dylan Crane its not domestic terrorism its a hate crime. He killed them because they were black. He didn't kill them for political or even religious reasons. So uh oh your ignorance is showing. ...","commenter_a":"Let's see he's not muslim, black, mexican, or asian so that means this will get written off as a guy with a troubled childhood and mental issues like always and quickly swept under the rug and no \"terrorist\" or \"thug\" label given.","post_message":"Dylann Roof, the suspected of fatally shooting nine people at Emanuel AME Church last night has been arrested."},{"comment_id":"10153850035618445","commenter_b":"Your post smells like it was done by a pussy with a badge.baaaacooonn!!","commenter_a":"Text/call us at @username We got good Quality medical marijuana strains for you with optimal potency and of absolute highest quality, I believe that marijuana is a good medicine and should be freely available to everyone regardless of unjust laws. We provide prescriptions for your health issues including: Many more just hit us @username","post_message":"Opponents of Florida's Medical Marijuana Initiative Slam Legalization.   @webpagelink"},{"comment_id":"1452387791451811","commenter_b":"until they bring in these terriosts refugees here watch diseases spread","commenter_a":"Not vaccinated your all welcome","post_message":"Antivaxxers, don't fuck this up for us."}]
