[{"comment_id":"1711366762447074","commenter_b":"@username don't worry when trump gets in office you'll be deported! Hurry up trump get this Mexican out of here!!!! Let's make America great again!","commenter_a":"So unprofessional. What happened to the president being formal. Not making himself a meme. It's pathetic. The Obama administration is an embarrassment to this country.","post_message":"WATCH: In celebration of Star Wars Day, The White House posts video of President Barack Obama and First Lady Michelle Obama dancing with R2D2 and stormtroopers. @webpagelink #MayThe4thBeWithYou"},{"comment_id":"1698523013768491","commenter_b":"Women making decisions over a man's body","commenter_a":"It's not for fucking cosmetic reasons. It's for hygiene and it prevent a large amount of penile infections.","post_message":"Y'all should probably still stop cutting baby's dicks for cosmetic reasons though."},{"comment_id":"10153227651945329","commenter_b":"Ikr how dare she maintain a healthy lifestyle, the bitch.","commenter_a":"She can fuck off","post_message":"More like baby washboard, amiright?"},{"comment_id":"10154729609496729","commenter_b":"Unfit evil lying grandma killery","commenter_a":"She only said it because she wanted to diffuse Trumps statement. Too late to get on that band wagon. Meanwhile American lives are lost due to stupidity.","post_message":"Whoa. About damn time."},{"comment_id":"10153995983694203","commenter_b":"should be a white woman","commenter_a":"Michael Jackson had a deep-seated race problem. Or an Elizabeth Taylor fetish...","post_message":"What the f*ck?"},{"comment_id":"10153512476881337","commenter_b":"Dat nigga is fuccin NASTY!!!!","commenter_a":"AE Guy Hung Nhi Vo","post_message":"GET EXCITED: The Predator is about to enter the Mortal Kombat X world..."},{"comment_id":"850216208416603","commenter_b":"More BS coming out of this corrupted Liar.","commenter_a":"\"Crooked' Hillary will say anything and do nothing, she is an establishment politician, just like Obama, and will continue down the same path as Obama has taken America for eight years now. Don't be fooled by this fool, America has been fooled enough with these lying politicians. Vote Donald Trump For President, for real change in America.","post_message":"Hillary Clinton responds to the #Istanbul attack."}]
