[{"comment_id":"10155429913146509","commenter_b":"But his enabler wife is","commenter_a":"Supporting a blatant sexual predator. Nice. And btw bill is not running for office","post_message":"House Speaker Paul Ryan said he will no longer defend Donald J. Trump, but he did not say whether he'd reverse his endorsement of the GOP candidate."},{"comment_id":"10154326338646336","commenter_b":"I don't have a family or children. I am not offended in the least. It might be a downer for those couples that are trying to start a family but geez........just quit being so sensitive. The world is not fair nor is it perfect. Keep moving forward.","commenter_a":"START A FAMILY, START A FAMILY, START A FAMILY. get over it you big babies.","post_message":"Is the phrase \"start a family\" offensive? Apparently some people think so."},{"comment_id":"127969217779704","commenter_b":"@username go away criminal","commenter_a":"Great job police and K9. POS got what he deserved. Just hope the dog doesn't get any disease from the scumbag!!","post_message":"A police dog takes a big bite out of crime, subduing a carjacking suspect involved in a high-speed chase and spectacular injury crash.  Eyewitnesses capture the drama on camera as the suspect tries to flee. Eyewitness News live with the condition of the innocent driver injured in the La Puente crash. Tonight at 11 from ABC7. abc7.com/@username/"},{"comment_id":"10153925563166037","commenter_b":"SarahMasanana. Animals kill their young, adultery, kill for food and have no remorse, you just described the human race! Wow.","commenter_a":"If this were an atheist country and atheist world we would be a lot better off. Much fewer wars and conflict and nobody pushing their BS onto anyone else.","post_message":"\"I think one of the reasons God has been good to us is that we have done him honor. Unlike the other countries of the world that do not even invoke his name we do him honor.\""},{"comment_id":"10153127374764753","commenter_b":"Pig drug whore doesnt deserve kids","commenter_a":"And I feel like a bad parent because of my mountain of dirty laundry... some people don't deserve children!","post_message":"Kodi Faircloth, though she may look quit a bit older, is only 38 and already the mom of 12 kids with another on the way. But it’s a safe bet that this Tulsa, Oklahoma, woman won’t be winning any Mom Of The Year awards anytime soon — not after what police report that they found in her home last Thursday."},{"comment_id":"10156457619055354","commenter_b":"She's only fit to lead her prison cell block at this point.","commenter_a":"Well, Hillary, if you hadn't enabled the enemy by letting the Benghazi attack go on, sending arms to our enemies, selling, for your own profit, 1/3 of our uranium to Russia and in many other ways letting terrorists know that it's open season on Americans, we wouldn't be having to listen to you whine that you want us all unarmed so we can't fight back.","post_message":"Unserious and out of touch."},{"comment_id":"10154065307955329","commenter_b":"I leave my sweat for the next guy/gal so they can draw strength from my juices. Welcome.","commenter_a":"And how long are you supposed to wait before you wipe it down after you use it? Dear people that leave sweat stains on the machines and don't wipe it down after they're done, screw you.","post_message":"Pump some iron or nap? Nap."}]
