[{"comment_id":"835165216569680","commenter_b":"Don't accept it. Doesn't matter to me. I still have the right to marry...whether you like it or not.","commenter_a":"We Christians do not recognize this, not accept this, just ignore this. Just because MAN says it does NOT mean it is true. God is our Commander, Lord and Leader. Whatever He has stated is so; with His statutes we will stand, and believe Him forever. Look up everyone, for our redemption draweth nigh. . .","post_message":"So much for state rights. Where do we go from here? #SCOTUSmarriage"},{"comment_id":"1270150533061172","commenter_b":"Lock her up","commenter_a":"we all know it was a fake story but the truth is \"SHE IS A TERRORIST \"spreading hate is no different than using a knife or a gun.","post_message":"Fake News: Drunk Trump Supporters Assault Muslim Woman in NYC Subway, Call her a 'F***ing Terrorist'"},{"comment_id":"1732269190330470","commenter_b":"Lol sure","commenter_a":"This just in, scientists baffled that the universe is not that old, may have been created by a a Supernatural being....\" I can't wait.","post_message":"The breakthrough could offer greater understanding of the Big Bang among other things. @webpagelink"},{"comment_id":"897207236993778","commenter_b":"I would vote for Donald Duck over Hillary. She is a lying B****!!","commenter_a":"Most certainly!","post_message":"Heck Yes! Spread the word!"},{"comment_id":"10153114585296130","commenter_b":"but feminism isn't about equality or justice.. it is about hatred for males and the destruction of the family..","commenter_a":"a male feminist.. wouldn't that be a bitch boy?","post_message":"Mark Ruffalo takes the (feminist) cake."},{"comment_id":"10153066527856336","commenter_b":"Please woman go troll somewhere else","commenter_a":"Poor guy","post_message":"Bristol Palin is engaged to Medal of Honor recipient Dakota Meyer – the Kentucky native is credited with saving the lives of 36 Marines, Army soldiers and Afghan soldiers."},{"comment_id":"10153147008285950","commenter_b":"I love a drink but when I got pregnant I stopped and even though I am dying for a cold one in the warm spring sun it has to wait until bub is out and I am not breast feeding. I am due in oct. woman need to realise it isn't about them anymore.","commenter_a":"I remember my Dr saying a drink would be fine","post_message":"Slightly more than 3 percent of pregnant women admitted that they binge drink, consuming four or more alcoholic drinks at a time, according to the report from the U.S. Centers for Disease Control and Prevention."}]
