[{"comment_id":"981060928642821","commenter_b":"are these women important? I never heard of any of them.","commenter_a":"Disappointed","post_message":"Television producer and writer Shonda Rhimes joined forces with the leading actresses from her various ABC shows in a campaign ad for Hillary Clinton..."},{"comment_id":"10153001992671770","commenter_b":"discusting","commenter_a":"Who cares ?? I DO NOT CARE !!","post_message":"Lather, rinse, repeat. Kim Kardashian's posting cleavage shots again."},{"comment_id":"1361756670528336","commenter_b":"Vengeance is mine saith the Lord.","commenter_a":"Disgusting and low class","post_message":"More tolerance from our friends on the left."},{"comment_id":"10153002585681770","commenter_b":"All conservative women are stupid!!!","commenter_a":"All liberal women are stupid!","post_message":"During a keynote address at the New York State Fair Wednesday, Democrat New York Senator Kirsten Gillibrand erroneously referenced the Constitution’s Fourteenth Amendment as the law that gives women the right to vote."},{"comment_id":"10153779454116336","commenter_b":"She's a snake!","commenter_a":"Shes all done for now, goodbye Hillary","post_message":"WATCH: Rep. Jim Jordan questioned Hillary Clinton on emails she sent regarding the motive for the #Benghazi attack.   “You tell the American people one thing. You tell your family an entirely different story,” he said."},{"comment_id":"10154345069201491","commenter_b":"The wall will be so \"huge and bigly\" the missiles won't even be able to fly over it!","commenter_a":"Trump doesn't like war!! He likes building a huge wall.. Don't worry guys, he is going to isolate North Korea with his wall, perhaps the nuke can't go through it..","post_message":"North Korea's weapons-grade stockpile has soared dramatically, says South Korea."},{"comment_id":"10153724968418598","commenter_b":"She must have been taught by Satan himself.","commenter_a":"Who taught her about Jesus? Wow.","post_message":"Abortion Clinic Owner: “The Jesus I Was Taught Would Hold Women’s Hands” as They Abort Their Baby"}]
