[{"comment_id":"10152769636891636","commenter_b":"One day women will be in charge of everything ! Roll on","commenter_a":"Girl power!","post_message":"Last night, women took back politics from the boys' club..."},{"comment_id":"1755849284702183","commenter_b":"Fuck Muslims","commenter_a":"That's not how it read last year fool think we forget","post_message":"They Told Him It Was A 'Threat To Muslims'... and his response went viral.  Do you support his right to fly our flag?"},{"comment_id":"708398475965965","commenter_b":"@username You a liberal Troll go away.","commenter_a":"Bullshit. Hillary Clinton is losing and losing badly. Hey liberal media....we're not listening to a damn word you say.","post_message":"Hillary Clinton regained her lead in the polls over Republican challenger Donald Trump after she accepted her presidential nomination Thursday evening."},{"comment_id":"898264413641666","commenter_b":"He shortchanged everybody Diddy! Everyone who isn't a 1%-er.","commenter_a":"Sometimes silence is golden. Our President has done an Excellent Job! Take the Plank out of your own EYE!!","post_message":"Sean 'Diddy' Combs Says President Obama 'Shortchanged' Black People"},{"comment_id":"10154726386446729","commenter_b":"Evil witch!","commenter_a":"Sonny Blaze, happy Sunday","post_message":"But yeah, she's supposed to be a role model."},{"comment_id":"10153472198206336","commenter_b":"She is sick!!","commenter_a":"I don't even know who she is; and if I was that bakery, I would sue her butt of, instead of letting her get away with that and having my rating dropped because of it!","post_message":"The California bakery was downgraded to a B rating after a video revealed that Ariana Grande had licked doughnuts in the store."},{"comment_id":"604189559765558","commenter_b":"Hang the fat pig","commenter_a":"Does anybody really think the Demarcate run US justice system is going to Prosecute, NO","post_message":"One can only hope that this ultra left wing hate monger will meet up with some justice soon."}]
