[{"comment_id":"10154830070756337","commenter_b":"I feel good Hillary is going to win","commenter_a":"I'm with her!","post_message":"We're counting down to Tuesday's election. Tell us how you feel..."},{"comment_id":"1104019902949566","commenter_b":"If she would screw a muslime she would bang anyone , they are animals","commenter_a":"Why does his 15 minutes of fame feel like 15 years?","post_message":"Apparently angry that his girlfriend cheated with a “dirty Muslim,” Zimmerman posted nude pics and contact info for his now ex-girlfriend."},{"comment_id":"861219497357519","commenter_b":"Natalie, that is wrong. His opinion absolutely matters. Knock it off. Francisco, if you want to discuss this rationally, you'll have to like my comments so I know you've replied, no notification on a public post for me. Don't worry about the trolls. If you wish to have an objective conversation, I'm game.","commenter_a":"Chanting that you are going to make America great again is pathetic it's not the leader that makes America great it's the people that's why the revolution war was fought this country will always be a country of immigrants from all over the and we are who make America great not a \"leader\" in search for power claiming that he will make America great","post_message":"MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1222107054548141","commenter_b":"Fucking weird bitch","commenter_a":"@username @username wdf","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"},{"comment_id":"1040060042672919","commenter_b":"This is BS, she just knocks the baby down with her & don't care. Stupid lil witch!!!!!!!","commenter_a":"OMG!!! ANIMALS!","post_message":"Life in Obama's America  Disturbing video of a white woman (holding her baby) being attacked by blacks, as blacks film and laugh at the attack."},{"comment_id":"10154428914569411","commenter_b":"What refugee crisis? These invaders are not refugees.","commenter_a":"I have never seen such inhumanity as I have seen in the west where personal freedoms are more important than justice and what is right. The REFUGEE crisis is just the latest example of this.","post_message":"'Our chancellor has given up the sovereignty of the country, she has given up our borders, she has given up our rules and regulations'"},{"comment_id":"10153847161829203","commenter_b":"He probably didn't know the virgins are 20 year-old males who still play Pokemon.","commenter_a":"Enjoy the virgins, shithead.","post_message":"CONFIRMED: Paris Mastermind Dead"}]
