[{"comment_id":"10152972323790950","commenter_b":"Sick bastards!!!!","commenter_a":"For now...I am going to let this investigation work itself out for evidentiary findings. Meanwhile, I choose to hive him the benefit of the doubt. Such is the way we were taught in college.","post_message":"BREAKING: Subway spokesman Jared Fogle is a suspect in a child porn probe, a law enforcement source says."},{"comment_id":"10153074507087908","commenter_b":"Only Decent Republican President lol !!! @webpagelink","commenter_a":"Today, Ike would be a center-right Democrat.","post_message":""},{"comment_id":"884237991635950","commenter_b":"It just makes me disgusted with some of the women of today,maybe like u.","commenter_a":"Woman will perish in disgust trying to do everything man does.....","post_message":"Should every woman SHAVE her face?"},{"comment_id":"1149779331709743","commenter_b":"Bastards of the ocean!","commenter_a":"The arseholes of the sea. Cha Henry @username","post_message":"Wow, what an asshole."},{"comment_id":"1106451702729020","commenter_b":"Go girls. Rape is never justified!","commenter_a":"It's sick that they were still trying to give excuses even though there is never an excuse for rape. Once that girl brought up raping 6 year olds they shut right up! They know it's not right but they're still trying to make up ways to say it's the women/girls' fault. This is so unacceptable and disheartening. 😔","post_message":"These teenage girls are confronting rape culture in India. This is what bravery looks like. (via AJ+)"},{"comment_id":"10153039868668984","commenter_b":"Bitch....","commenter_a":"Filthy rich don't need any more money but their filthy greed demand more and more.","post_message":"I can't believe she did this. There are plenty of people out there who would kill for even a small fraction off that money...."},{"comment_id":"10154130394501545","commenter_b":"@username I think CNN is giving you false hopes. You might want to turn off the biased media.","commenter_a":"I love how \"news\" organizations report this as news. Headline should read \"Professor got lucky with one correct prediction, and hopes another will come true.\"","post_message":"A professor who has correctly predicted the outcome of every presidential election since 1984 has a new prediction..."}]
