[{"comment_id":"10153328841247377","commenter_b":"she should be in jail what she done to Stevens was murder .","commenter_a":"We The People That For Trump Will Vote For Trump The Hard Core Dem Will Vote Dem If I Told Them My Dog Was Running They Wood Vote For Her Most Of Dem And Rep Wont To See Our Country Great A Gain Will Vote Trump","post_message":"New email released Monday shows slain Ambassador Chris Stevens wanted to leave Benghazi for months before his death, ex-U.N. Ambassador John Bolton said Tuesday."},{"comment_id":"1199159113429677","commenter_b":"Pay for your own abortions, which you can find probably within a couple of miles of your campus. Grow up, get a job and don't bother adults.","commenter_a":"Keep your legs together and study.","post_message":" who are condemning my bill because it is   having the right to live a healthy life is NOT immoral and every student should have access to safe and accessible abortions especially because being a student at Cal is already so demanding. [] This is a womxn [sic] issue, a students issue, and a humxn [sic] issue. If you do not support abortions, don get one."},{"comment_id":"912105055515910","commenter_b":"The reality is that the absence of a father or a mother is felt by children who have grown up in single-parent household. Perhaps we should then outlaw divorce/sex outside marriage to contravene this?","commenter_a":"Hoe the HELL she this she is? Talk about being 2 FACED! No RESPECT! YOOT! Of 2 day . Viva the Women who had and still have LOVE 4 you! !!! X","post_message":"'Another mom could never have replaced the father I lost'"},{"comment_id":"10154315699286509","commenter_b":"No laws were broken She just happened to cross paths with a power hungry pig","commenter_a":"She also wouldn't have been in police custody if she were a law abiding citizen","post_message":"Bernie Sanders said that Sandra Bland wouldn't have died in police custody \"if she were a white woman.\""},{"comment_id":"10157076549400354","commenter_b":"Does the rules say you can steal another candidates votes like he did with Ben Carson?","commenter_a":"Cruz is playing by the rules...PERIOD. Elections have been done this way your entire life. There is nothing different from other elections, with the exception of a whiny, sniveling, jealous loudmouth. Too bad Trump hasn't been paying attention to the rules.","post_message":"\"Ted Cruz has no chance of winning this without bribing the delegates. That’s his game at this point. He’s mathematically eliminated....\"  WATCH:"},{"comment_id":"703909133102373","commenter_b":"Keep it going and that shithole country might be cleaned up someday👍","commenter_a":"the result is the same be it honor killing (Indian way) or random shooting of school kids (US way)","post_message":"India reports a spike in “honor killings” — but the numbers are probably even higher."},{"comment_id":"10153664920821636","commenter_b":"The appointment of this known Moldovan pimp and thug proves beyond any doubt that the so called \"Jewish state\" is actually a fascist state built on violence ,murder and colonialism.","commenter_a":"Hitler would be so proud of these two!!","post_message":"In 2016"}]
