[{"comment_id":"10154196354922541","commenter_b":"She looks ridiculous","commenter_a":"love it!","post_message":"In case you missed it, Beyoncé’s pregnant."},{"comment_id":"1226004427434976","commenter_b":"Get rid of her please","commenter_a":"Anyone else would have been fired.","post_message":"Do you think The View should be CANCELLED from TV?"},{"comment_id":"10153122066896037","commenter_b":"Porter up there is absolutely right","commenter_a":"no, we have no backbone in the US so we will let Russia take what it wants.","post_message":"The leaders of #Ukraine, #Germany, #France and #Russia pledged renewed support for a tattered ceasefire in eastern Ukraine despite violations -- including the storming of a key town by pro-Russian rebels.  Do you think peace will happen?"},{"comment_id":"10150859556744999","commenter_b":"Did she calll Monica Lewinsky ? It is only a mediocre actress and above is false as it was her husband","commenter_a":"Only in America is it possible that the president of the state --otac son candidate second son, husband and wife ..","post_message":"President Barack Obama: “We’re going to carry Hillary to victory this fall, because that’s what the moment demands.”  More photos: @webpagelink  Photo: Doug Mills/The New York Times"},{"comment_id":"10153721390631800","commenter_b":"@username Girls, that's who.","commenter_a":"I can't see the humor in girls trying to look sexy and then being offended by aroused boys and then also being offended when boys don't care about them. I think the problem here is with the girls identity crisis rather than with boys boners.","post_message":"Kristen Schaal finds a way to prevent teenage boys from being too \"distracted\" by girls in leggings. @webpagelink"},{"comment_id":"1394356603915019","commenter_b":"Odds Hillary Won Without Widespread Fraud: 1 in 77 Billion Says Berkeley, Stanford Studies After applying various statistical models to subsets of 2016 primary voting data several academic researchers conclude Hillary Clinton win was only possible through widespread vote fraud.","commenter_a":"#HillaryDNCRiggingCrooks","post_message":"It turns out that Bernie Sanders may not fight all the way to Philadelphia after all."},{"comment_id":"1283090895060069","commenter_b":"You don't know what you talking about a****** Hillary love douchebag","commenter_a":"Eric Reynolds","post_message":"Every Trump supporter should see this.   Video by Gavin Newsom. Shared by Occupy Democrats, LIKE our page for more!"}]
