[{"comment_id":"10155244013599384","commenter_b":"We the American people deserve to have accountability for all elected officials from all branches of Government!","commenter_a":"Thank you, @username, for doing your part in bringing this situation to light. I want nothing less than a full, thorough investigation of all possible inappropriate ties between Trump administration officials and foreign powers. Pursue this to completion, wherever that leads. Thank you again.","post_message":"Mike Flynn’s resignation was a step in the right direction – but there are many more questions that need to be answered before we can fully understand the relationship between the Trump Administration and Russia. Tune in now to watch my press conference on the topic live:"},{"comment_id":"10152823238956130","commenter_b":"Women graduate at a far higher rate than men. From high school and college.","commenter_a":"And no the factors you listed clearly are important, not to discussing what wages should be, but to the discussion of why wages are not equal. Data clearly shows the problem is economic insufficiency, regardless of there being widespread discrimination. So we could make more progress closing the gap by everyone getting a better education (even at the library or online if you know how to source good) building your own successful business, or something innovative.","post_message":"This is what the wage gender page gap looks like."},{"comment_id":"781142075321254","commenter_b":"She should be in prison for what she's done","commenter_a":"She just needs to ask","post_message":"Would you be upset if a nurse did this to you? @webpagelink"},{"comment_id":"942676889125393","commenter_b":"Is she ROYALTY ?","commenter_a":"How much did the vet charge?","post_message":"60-stone woman lifted out of her home by a crane in a SEVEN-HOUR emergency operation"},{"comment_id":"10153732980425530","commenter_b":"wow this is news someone reports to Jury duty and they also have a book what a novel idea, I haven't done that at least on 3 separate occasions.....oh wait I did......what people consider news now a days is idiotic.","commenter_a":"Kate Crispignani","post_message":"Kid Rock showed up to jury duty this morning along with a paperback book to help pass the time."},{"comment_id":"10153978622861438","commenter_b":"Of course she is. I could see through that bubbly bs","commenter_a":"Shocker....not.","post_message":"Kelly Ripa’s morning talk-show drama might force us to acknowledge all the work that goes into her cheery persona."},{"comment_id":"10157476731040725","commenter_b":"Now get you're head out of his illegal Orange trumpster butt2.. It's over flowing with his B.S for a LIFETiME!!!!!","commenter_a":"This is what I don't understand, Every Trump rally, there are 1000's of people in attendance. Not as many people show up at Clinton rallies. Yet she is ahead in the polls!! Is the media and the poll takers rigging the outcome of the polls?","post_message":"A beautiful evening in Ft. Lauderdale, Florida last night. We need to WIN Florida- so make sure you get out and VOTE this November! I am here all day - attending events -- looking forward to a great day! -DJT"}]
