[{"comment_id":"10154423071206336","commenter_b":"Was she deserves to do is pull her name off the ballot and put yourself in Sing Sing for 25 years","commenter_a":"I wouldn't want it anyway. It would not be sincere.","post_message":"Question Of The Day: Does Hillary Clinton owe the American people an apology for lying about her server scandal? #Hannity"},{"comment_id":"1769645119990268","commenter_b":"@username Says a blind woman","commenter_a":"Trump supporters say Trump should not be judged on his past actions, yet when it comes to Hillary Clinton, all they can talk about is the past. Hypocrisy? Also FYI, Hillary Clinton is running for Oval Office not Bill Clinton looks like that needs to be clarified for some people * You want to talk about Bill Clinton, why don't we talk about Melania Trump","post_message":"Donald J. Trump got a heck of an October Surprise."},{"comment_id":"10153765573361336","commenter_b":"ISRAEL WAKE UP FOR EVER Israel must wake up, get up, 90% Arab are Terrorists !! ISRAEL Must Destroy your enemies, terrorists and traitors in your country and out, do not sleep, do not sleep !! Palestinians & Obama are the Biggest Lie in History ! Jerusalem Never mentioned in the Muslim Koran !! Jerusalem is written thousands of times in the Torah, Jewish Bible !!! No loyalty = no citizenship !!!! Israel You are Lucky !I the Arab leadership Started today to murder Jews.!! in 2020, then the Jews would have found sleeper, wake up ! Never were Palestinians ! tribals killers today call themselves Palestinians ! Different tribes of killers arrived in Israel since 85 years and they want a country !? Please Supreme Power Main, Creator of All the worlds & Souls, please GOD Bless the IDF and ISRAEL for Good. Destroy all the enemies of Israel ...","commenter_a":"It's absolutely BS that I had to go to Afghanistan twice in order to afford college. Making public higher education institutions tuition free isn't a bad idea at all. If we can pay for a war in Iraq then we can definitely pay for college. It's an investment in America. That's the first step on how you make America great again. #feelthebern #bernie2016","post_message":"President Barack Obama's message to U.S. troops in Afghanistan: \"I do not send you into harm’s way lightly… but as your commander in chief, I believe this mission is vital to our national security interests.\" @webpagelink"},{"comment_id":"10153889126257144","commenter_b":"@username stfu ass!","commenter_a":"Obama is going there to give a speech about how the truck manufacturers have flooded the market, so it is easier to buy a truck than it is to buy a book.","post_message":"This is awful."},{"comment_id":"10153877840551337","commenter_b":"I always hated rousey I'm glad her ass got knock the fuck out","commenter_a":"Truth is holly Holm is a real fighter n Dana white thought he picked another easy girl for Ronda to destroy well plan back fired ,Holm is a real fighter and real champion now let's see her n cyborg fight two top fighters Rousey is finished","post_message":"DAMN: Holly Holm didn't hold back with these comments about Ronda Rousey."},{"comment_id":"841387199293221","commenter_b":"Lol bitch ass no life","commenter_a":"Who cares about a road named after we want justice for her and her killer or killers in jail for murder so sad hoping we get justice sad it takes this to game a road names after you praying for your family and friends rip Sandra justice 4 Sandra","post_message":"It is the same stretch of road on which she was arrested."},{"comment_id":"10153105977467098","commenter_b":"YUP!! We always Been Here!! Who the Real Illegals!!","commenter_a":"Every race that is not latino or native american is an illegal inmigrant or descendant OF an illegal immigrant latinos ARE from this continent OF AMERICA... North central and south AMERICA ANYONE else their ancestors came on a boat across The Ocean and The atlantic ALL WE Did WAS cross an imaginary Line Lmao.... americans huh..... WATCH WHO u call a wet back we didnt have to cross The atlantic TO GET here wet backs","post_message":"Donald Trump would not say how he would locate, round up and deport the 11 million undocumented immigrants he says must go."}]
