[{"comment_id":"1388872451170702","commenter_b":"And, non-public schools do not have to allow a student to attend their school so not everyone will the right to 'opt out' .","commenter_a":"Deeply qualified, unlike the Secretary of Education you are choosing to support despite the strong opposition from your constituents.","post_message":"Yesterday, I spoke on the Senate floor to support Judge Neil Gorsuch’s nomination to serve as an Associate Justice on the U.S. Supreme Court. Judge Gorsuch is deeply qualified and consistently demonstrates his commitment to upholding the rule of law and interpreting the Constitution as its authors intended."},{"comment_id":"1069463933089027","commenter_b":"All abortions are murders !","commenter_a":"he knows what we all know, the muslim is a fool a joke a laughing stock a disease forced on AMERICA","post_message":"*****BREAKING NEWS*****"},{"comment_id":"1287037484665003","commenter_b":"DRAIN THE SWAMP !!!!!!!!","commenter_a":"I agree they can ,than they can be fired also!","post_message":"Democrats want EPA staffers to RESIST Trump"},{"comment_id":"1505305382822543","commenter_b":"Well i guess that's better than a illegal immigrant..","commenter_a":"Don't judge maybe that's his girl","post_message":"At least both the driver and the \"passenger\" were wearing seat belts."},{"comment_id":"10153952866914726","commenter_b":"IN TODAY'S WORLD YOU CAN DO ALL KINDS OF THING LIKE MAKE UP POLL NUMBERS AND VOTES HELL I,M SURPRISED THEY DON,T HAVE BUSH IN FIRST PLACE THESE DUMB FUCKS KEEP TRYING TO PUSH BUSH IN A RACE HE DOES NOT BELONG THE ONLY WAY HE IS GOING TO WIN IS IF YOU JUST GIVE THE FUCKING THING TO HIM","commenter_a":"Don't look now people, but there may be a Clinton & a Bush in the 2020 or 2024 races. George Prescott Bush(Jeb's son) & Chelsea Clinton.","post_message":"The Bushes are back and looking for a big win — whatever it takes..."},{"comment_id":"794164403965442","commenter_b":"F%%+ white people !!!","commenter_a":"This is why I hate white people!!!","post_message":"In an update to our previous coverage; ASU Police Officer Stewart Ferrin's administrative leave has been extended. His case was passed over to the new ASU Police Chief who will decide on the officer's fate."},{"comment_id":"10154004285427061","commenter_b":"She is so ugly put a sack over her face","commenter_a":"I tried a similar comment above in my own post. Ppl are to busy thinking they are better or truly know or believe in the government to see the truth right in front of them. A little less attacking the comments of others on Fbk, an you could be smart enough to see the truth. Sure everyone deserves to dress lovely; however people continue to starve. Until you have walked a mile as I have struggling to feed your family/children; enjoy your fancy clothes. I will enjoy feeding my family!","post_message":"WATCH: Fashion forward First Lady Michelle Obama stuns at last night's White House State Dinner: abcn.ws/2ejwQwD"}]
