[{"comment_id":"10153670096417869","commenter_b":"Can we share this with credit of course?","commenter_a":"It been a busy week. In the past ten days, the Trump Campaign joined the KKK, sucker-punched a Bernie supporter, attacked peaceful protestors, abandoned NATO, exported nuclear weapons to Japan and South Korea, spilled-the-beans on Heidi Cruz, outted Ted Cruz in a sex scandal, beat-up a female reporter, dropped nukes on Europe and the Middle East, and punished women for having abortions. These acts would be incomprehensible were it not for the fact that Donald Trump hates Mexicans, hates our trading partners, hates our stupid leaders, hates Muslims, hates women, hates blacks, hates reporters and Bernie supporters, and hates women having abortions. How can he claim to want to Make America Great Again, when he so clearly - hates Americans? There is no answer. Unless we look to the words of the candidate himself. According to The Donald: 1) He disavowed KKK David Duke endorsement; 2) He didn mind a ...","post_message":"There are a couple of twists in the story of Trump campaign manager Corey Lewandowski, accused of misdemeanor battery for allegedly grabbing the wrist of former Breitbart reporter Michelle Fields.  He was not arrested as some outlets initially reported, but voluntarily signed a “notice to appear,” a misdemeanor summons.  And an anonymous Secret Service agent on Trump’s detail claims that what Fields did could have easily resulted in a much harsher response.  This story has the latest:"},{"comment_id":"1779215949028239","commenter_b":"#Fuckhillary #Neverhillary #Nevertrump","commenter_a":"#neverhillary","post_message":"Matt Lauer asks Hillary Clinton about the qualities that make her qualified to become Commander-in-Chief.  More coverage on @webpagelink"},{"comment_id":"637619693095276","commenter_b":"Lock her up","commenter_a":"ITS FUCKTARDS LIKE YOU THATS FUCKED THIS COUNTRY UP ,, AND THE LIVES OF YOUR KIDS !! G E T T O T R A S H. !!","post_message":"This woman is bragging about stealing your tax dollars.  Disgraceful. She should be kicked off welfare and be forced to pay us back immediately.  Do you agree we should kick her out of the country?"},{"comment_id":"1179483682071660","commenter_b":"And what is going to stop the criminals from getting guns????? All a gun ban would do is disarm us everyday, good citizens who want to protect ourselves from THE CRIMINALS with guns!!!!!!!","commenter_a":"Stop protecting guns over people. The NRA is laughing at you people every time you defend a gun over a life.","post_message":"A gunman opened fire on a reporter and cameraman during a live television broadcast in rural Virginia."},{"comment_id":"1629939420634866","commenter_b":"I agree with Trump. YOU WANT TO SELL IT HERE,THEN BUILD IT HERE!","commenter_a":"Protectionist policy won't work. America is not making any friends with actions like this. Don't buy American will soon be the global response.","post_message":"Checkmate!"},{"comment_id":"10153695940741955","commenter_b":"Does she get virgins too?","commenter_a":"ew....that is all...","post_message":"UNDER THE BURQA"},{"comment_id":"533139670207659","commenter_b":"She can take her sorry ass over there and live bet they wouldn't let her stay long","commenter_a":"she is a complete WASTE AND NEEDS TO BE PUT IN JAIL ALONG WITH HER COHORTS..","post_message":"She is DELUSIONAL..."}]
