[{"comment_id":"10157196875835603","commenter_b":"She's still a liar!","commenter_a":"She belongs in jail!","post_message":"#BREAKING: Hillary Clinton has chosen Virginia Sen. Tim Kaine as her vice presidential running mate."},{"comment_id":"501775896685267","commenter_b":"She is a POS!!!!!!!!LIAR too!!!!","commenter_a":"NO","post_message":"Hillary Clinton has been defying stereotypes about what women can accomplish her whole life. Would you like to see her do it again this November?"},{"comment_id":"10153713644828984","commenter_b":"Yes build it. And people American people will have a job and steel prices go up. And we win!!!!!","commenter_a":"Build the wall. Put censors all along the border and give the border patrols the order to shoot any one who gets over or under the wall. Illegals will stop coming.","post_message":"Boom! Critics of Trump's border wall just got silenced in an EPIC way by The Donald himself. There's no way they can argue this one!  Do you agree with what Donald Trump just said about a border wall?"},{"comment_id":"10156131502720500","commenter_b":"Joyce think how scary it will be to criminals","commenter_a":"It will be scarey to see people walking around with guns","post_message":"Floridians with concealed carry permits could soon be able to walk around with their guns on display. Would you support open carry? @webpagelink"},{"comment_id":"10153051145414094","commenter_b":"And if gun laws don't work, why have any safety laws? Should hardware stores sell nuclear material because the bad guys will get anyways? Should we not have traffic laws because the bad drivers will run a stop light anyways and crash into a school bus?","commenter_a":"While Republicans were defending the lack of sensible gun laws and calling this an \"accident\", the families and communities of this Church showed such dignity and Christian values by first saying that they forgive the shooter. They are such an amazing example and inspiration to this country. God bless them.","post_message":"Relatives of people killed in a shooting at a black church in Charleston, S.C., addressed the suspect in court Friday In an extraordinary display of grief and forgiveness."},{"comment_id":"1013523678688104","commenter_b":"Stupid bitch !!","commenter_a":"Shameful","post_message":"Comedian Ricky Gervais was so appalled by the image of Rebecca Francis grinning next to the freshly-killed giraffe that he tweeted it to his 7.52 million twitter followers, and almost broke the internet."},{"comment_id":"1027338487301572","commenter_b":"I agree with you , Carol. But, Illinois law forbids us from asking for ID at this point in time.","commenter_a":"Going back many years to JFK's election to the presidency. He won by a very slim margin. Cook county Illinois (Chicago's county) had many votes cast by people who were dead. It is still happening but in many more states. Everybody should have to show a legal picture ID before voting.","post_message":"Voter Fraud is REAL!"}]
