[{"comment_id":"949813105041545","commenter_b":"Yes cuz girls are such disappointments. SMH.","commenter_a":"3Girls.....maybe a son in the future","post_message":"“I Am Up Every Three Hours With The Baby.\" Ludacris On Diaper Duty With Newborn, Cadence"},{"comment_id":"1109422589147098","commenter_b":"Dumb whores for Trump","commenter_a":"He has no respect for anyone. Scum","post_message":"In a battle between Trump and Intelligence, Intelligence wins."},{"comment_id":"10155458466225354","commenter_b":"Just a bunch of average women.","commenter_a":"I still cannot wrap my head around the positive reinforcement people give instead of being honest and constructive. Don't take her to dinner, take her to the gym.","post_message":"\"They’re no angels—and they own it\""},{"comment_id":"1160655937308596","commenter_b":"Many Muslim women are sick of being told what they are and what they can be from western women who have no clue about their culture, that's why Muslim Feminism had to develop on its own instead being part of the bigger movement, _that's_ sad if you ask me. Feminism should be about equality not about following one group of women's notion about what you should look, feel or talk like.","commenter_a":"I'm seeing a lot of diversity in the Muslim community about the concept of World Hijab Day (non-Muslim women wearing the hijab for a day in solidarity). Would love to get your thoughts on whether it's cultural appropriation, or upholding the more conservative aspects of your faith. I did participate last year, but not sure if I will again.","post_message":"Her \"Ask a Muslim\" booth was a huge success! - Parker Molloy"},{"comment_id":"511284652397563","commenter_b":"@username Riddle me this Kat Can you please enlighten any or all of us exactly what it is that Trump can and will do for us? BESIDES build that wall and MAKE AMERICA GREAT AGAIN????","commenter_a":"Serious question: Hasn't there been enough debates? Cruz has had plenty of opportunities and has yet to take advantage.","post_message":"\"Let’s make it a two-hour debate. CNN has already scheduled it. You’ve got a venue. You’ve got a location. You’ve got TV cameras. The only thing missing is Donald Trump because he’s too scared to debate.” —Ted Cruz"},{"comment_id":"1778254899059301","commenter_b":"Someone take care of Bernie so Lizzi shuts her piehole, please.","commenter_a":"Lester Holt seems to be giving Hillary longer time to speak than Donald!!","post_message":"TheDC presents the first debate between Hillary Clinton and Donald Trump. Starting at 9:00PM ET."},{"comment_id":"596204130539541","commenter_b":"@username I think most people are okay with accepting refugees. PROVIDED, that they become members of the country they decide to make home. Non of this lets make Sharia law zones like back home bollocks. How do you separate the good from bad? Only allow families in? That hardly sounds fair. Just be aware that when you accept them in you accept responsibility for them. Anyone raped. Any bars burned down. Any cartoonists shot. You are responsible for those by knowingly understanding some of the bad is coming with those who need your countries protection.","commenter_a":"The assumption that these guys are all refugees is really telling. *Open your eyes a bit, these fuckers are homegrown. Isis is betting on you hating and attacking refugees to add fuel to their fire. You're all being played.","post_message":"Some experts say it's only a matter of time before the heart of the European Union sees tragedy."}]
