[{"comment_id":"821592037937050","commenter_b":"And unfortunately it is another woman saying it. SMH","commenter_a":"Doesn't someone always say: \"Forget these women\"?","post_message":"“Forget these women. What you’re seeing is the destruction of a legacy.\"  - Phylicia Rashad"},{"comment_id":"10153506757381509","commenter_b":"Maybe the people voting on abortion laws should reconsider......","commenter_a":"She needs to be charged with murder.","post_message":"Dynel Lane, 34, has been charged with criminal attempt to commit murder in the first degree, unlawful termination of pregnancy, and seven other counts for allegedly cutting a fetus from a pregnant woman's womb. @webpagelink"},{"comment_id":"1743707409231060","commenter_b":"Trump is gonna stomp that old bitch!! Watch and see!!","commenter_a":"They know she is much more qualified, not even close! And even Repubs don't want to be responsible for putting a nut case in the White House.","post_message":"More bad news for the Trump campaign..."},{"comment_id":"1116798981710579","commenter_b":"She's feeding her baby. Shut the fuck up and move on","commenter_a":"Well it isn't racey,it's natural. This is ridiculous people need to approve of the way babies were intended to eat and get over it. When they do mom's will stop plastering feeding photos all over the internet.","post_message":"An interesting discourse here about nursing in public. What are your thoughts?"},{"comment_id":"1231733206844027","commenter_b":"I see nothing beautiful about her, she's hateful, that's ugly!","commenter_a":"Michelle Bachmann is a beautiful woman. Too bad....","post_message":""},{"comment_id":"1227346897337998","commenter_b":"Idiot sick woman","commenter_a":"Good thing we have wikileaks and Project Veritas for the truth. Trump/Pence 2016 #draintheswamp #hillaryforprison #spiritcooking","post_message":"JAY Z said he doesn't have any \"ill will\" toward Donald J. Trump, but he \"cannot be our president.\" Before introducing Hillary Clinton onstage with Beyoncé at the Cleveland, Ohio, rally, Jay Z repeated this twice: \"Once you divide us, you weaken us. We're stronger together\" @webpagelink"},{"comment_id":"544743005709397","commenter_b":"@username go play in you sand box.","commenter_a":"You Trumpeters are rotten to the core to attack a decent man like @username like this. For shame. I supposed flies are attracted to stinking matter, so what else would we expect.","post_message":"Republicans, this is your party. You have to decide who you are. Are you a collection of principles, or are you about a man?"}]
