[{"comment_id":"10153753361057464","commenter_b":"That's right! Those are AR-15s. These gun control people just don't have a clue.","commenter_a":"Ted you need to do something about this gun control crap. Like stop it","post_message":""},{"comment_id":"1738896129708338","commenter_b":"Abortion queen, and has no shame.","commenter_a":"this drunk, druggie idiot has comments that no one cares about. She is a has been,, and has been Had !!! Loser, Drunk","post_message":"Renowned moral philosopher Chelsea Handler condemns Trump.   The paragon of virtue also adds: \"Please buy my book, 'My Horizontal Life: A Collection of One Night Stands'\"..."},{"comment_id":"10156268992405093","commenter_b":"What is it..?...A Witch would go down nice.","commenter_a":"She is just ordinary folk like us. See, she can laugh at herself (not really) and wants everybody to see how much she is like us and SO down to earth. Oh my how have we misjudged her all this time?! What a fraud!!!!!","post_message":"It's just.... It's just too easy."},{"comment_id":"968715303188218","commenter_b":"There's a problem with this ???? Just a couplah boyz havin' some fun !!!","commenter_a":"Now thats how you settle a score without using violence. !","post_message":"This is NOT what fireworks are for"},{"comment_id":"10152546378774071","commenter_b":"Same thing as Pie-o-logy?","commenter_a":"This has been around for years...finally blowing up I guess. Thank you Cosmo Kramer lol","post_message":"Pizza Studio hopes to expand to 100 locations by the end of 2015."},{"comment_id":"10153705245475667","commenter_b":"Build that wall tall!!","commenter_a":"Libertarian is just another word for Republicanism!","post_message":"Libertarian presidential candidate Gary Johnson talks with Paul Singer."},{"comment_id":"10153809413306101","commenter_b":"Oh give me a break. This silly leftist woman is acting like a jerk.","commenter_a":"I cannot believe what you have said. I myself really don't care what she has to say and I would disagree 100% with her!!!!","post_message":"Donald J. Trump may want to listen to Eva Schloss about what racism looks like."}]
