[{"comment_id":"10153523399935329","commenter_b":"And a lets get a pug","commenter_a":"@username I want a bear","post_message":"THIS GUY!"},{"comment_id":"1620932058215182","commenter_b":"Cse'Doobie Major bruh.. she can blink and ash that bih","commenter_a":"Brittlynn Jacob Ygnacio","post_message":""},{"comment_id":"10152920340851051","commenter_b":"What we can't stand u either ghetto bitch","commenter_a":"Sad part is my son is mixed with white......I wish I could do magic and make that part of him disappear.........cant stand white racist mtfhs","post_message":"This woman decided to break up a fight by taking out her gun and shooting into the crowd. The problem is, her son was in the crowd."},{"comment_id":"10153302910759087","commenter_b":"But the sheep love the Queen of BS and her Lies, Hillary the evil millionaire theft by deception. and lair","commenter_a":"Carly doesn't back down from a fight. I would NEVER go on that show after that BS. She's a better woman than I!","post_message":"“My message to the ladies of ‘The View’ is, ‘man-up,’” Carly Fiorina said. “The Obama administration, for example, has been bad for women. Planned Parenthood is harvesting body parts. If you don’t like those facts and those messages, than man up and debate me on them. Don’t sink to talking about my face.”"},{"comment_id":"1811292265824545","commenter_b":"Lack off question mark ? Get a life lefty. It's Facebook , not a GCSE","commenter_a":"When I was the age they look,,,,,I'd got my apprenticeship done, bought my first house and was engaged!! How very strange,,,,,,,","post_message":"\"Things are moving quickly now.\""},{"comment_id":"10154548445633854","commenter_b":"OMG when will the lame lies end???? I'm highly offended that she thinks that we're ALL that stupid!!!!","commenter_a":"If she didn't remember taking required security training, how in the heck would she be able to know what (c) stood for? and how can she be qualified to be POTUS?","post_message":"She thought it had to do with alphabetizing emails. And she thinks she is fit to lead?! 😂"},{"comment_id":"10153174163477452","commenter_b":"he better not get fired. @username","commenter_a":"GET SOME!!!!","post_message":"Big Mac attack!   A McDonald's worker wasn't \"Lovin' it\" when an irate and apparently drunken customer launched into a vicious attack at the drive-thru window. But the worker wasn't going down without a fight. abc7.la/1KYEgIq  It's just the latest case of a service worker attacked on the job."}]
