[{"comment_id":"803156879823481","commenter_b":"And people shouldn't look, it's wrong, people have self control, they should use it rather than having breasts being sexualised","commenter_a":"Hey ladies, breast feed away....just remember...there are creepy, shady guys out there who get off on that...why draw attention to yourself...she could have easily done that somewhere else...she wanted the attention...just fkn stupid","post_message":"This stranger started harassing a woman because she was breastfeeding at Target  but customers and staff defended in the most beautiful way."},{"comment_id":"10156303577690354","commenter_b":"She should be in jail for her do nothing in Benghazi.She is a liar and I hope she gets what she deserves.She thinks She is above the laws the rest of us must follow.Oh and why is Sharpton not in jail for not paying his taxes.We've got to get rid of all of these politicians.","commenter_a":"Yes she did","post_message":"\"Clinton may have committed perjury, then, when she signed a sworn statement promising that she turned over all of her work-related emails pursuant to a Judicial Watch lawsuit for Clinton’s email records.\""},{"comment_id":"10154751454678010","commenter_b":"@username --You are a woman, but lady? Highly questionable.","commenter_a":"Aren't \"Indians\" a part of American History, whether or not their story is positive or negative? Why does every damn thing have to be racist? I think your article/argument would have been more effective if you had taken statements by full blooded Indians who are actually offended by this rather than just mention that the mascot and \"red face\" really \"do harm to actual people.\"","post_message":"Cleveland knows its mascot is racist. They removed \"Chief Wahoo\" from their caps at the beginning of the season.   And yet now he's reappeared on baseball's biggest stage.   via Los Angeles Times Opinion"},{"comment_id":"10153031859929024","commenter_b":"Maybe you should jump in front of one of the bullets too lmao","commenter_a":"let them kill each other off","post_message":"Lionel Pickens, 31, was shot multiple times in the chest around 4 a.m. Sunday at Queens Boulevard and 84th Drive in Briarwood, police said."},{"comment_id":"1027522093954929","commenter_b":"And she REALLY makes Alaska look like it's full of idiots. How else did she get elected Governor in the first place?","commenter_a":"And to think that was John McCain's pick for VP. Embarrassing.","post_message":"This one is a CLASSIC."},{"comment_id":"10152875043501973","commenter_b":"My husband said he wished there was since we can't just hop in our car and get down there. :)","commenter_a":"Is there an online store too???","post_message":"The sale starts today at 9 a.m. for season ticketholders, 11 a.m. for the general public, and offers up a ton of Ducks' athletic gear."},{"comment_id":"10153163075739091","commenter_b":"Resorting to name calling shows the classless women you are! Good job!","commenter_a":"What? Do you want him to ride public transport?! He's the NEXT PRESIDENT OF THE UNITED STATES!!!! #TRUMPTASTIC Man!!! @webpagelink","post_message":"How Donald Trump does jury duty... here's his arrival at a NYC courthouse. STORY HERE: @webpagelink"}]
