[{"comment_id":"10154350131948145","commenter_b":"Yeah they'll definitely be jailed, they can track everything now","commenter_a":"@username, yep another one. Unbelievable!","post_message":"Hopefully they got to it before identity thieves did."},{"comment_id":"630659240427363","commenter_b":"See. Look at this fucking cunt here. ^","commenter_a":"As much as I don't understand the obsession with Pokemon Go, it's done more good than any public health initiative that that any state or federal government has spent millions.","post_message":"The health consequences of sedentary lifestyles are costing the US $27.8 billion a year."},{"comment_id":"1124493864242596","commenter_b":"I'm not sure why he was with her to begin with if that's the way she feels. She apparently doesn't have the same Christian values, which could only result in disaster for any potential marriage. Tim, you can do much, much better!","commenter_a":"Tebow is a good man......I couldn't care less about his football abilities...","post_message":"Tim Tebow loses girlfriend over Christian values."},{"comment_id":"10152692455750950","commenter_b":"Bullshit...gay people are a disease and should be eradicated....I say we boil them alive in acid","commenter_a":"these people are a minority forcing their perversion on everyone else. So when are the pedophiles and rapist going to start marching too","post_message":"LGBT groups march in Boston St. Patrick's Day parade @webpagelink"},{"comment_id":"1538102683151787","commenter_b":"What a bitch","commenter_a":"That was totally uncalled for she was just trying to start trouble!","post_message":"RACIST: Welfare Queen Attacks Man For Being White, Watch What Happens Next [VIDEO]  Racebaiters will never say anything about this.  What would you do in this situation?"},{"comment_id":"10154973031601509","commenter_b":"yah ! you r big brother of DONAL TRUMP .","commenter_a":"Farage is a racist. And Trump is a racist. Racists love each other.","post_message":"Brexit leader Nigel Farage: Donald J. Trump \"dares to talk about things that other people want to brush under the carpet... For the United Kingdom, I think Trump would better for us than Barack Obama's been.\" @webpagelink"},{"comment_id":"983233615058995","commenter_b":"Well, she is guilty and they are doing their jobs.","commenter_a":"Get obama to let the fbi to arest her","post_message":"“I think the bigger problem is not just the media, it’s the FBI.”"}]
