[{"comment_id":"1763482420575354","commenter_b":"@username your savor is going back on his own immigration stance. He was so bold at first, but now he's retreating lol. #typicalChump","commenter_a":"\"Today in his Mexico press conference, Donald Trump lied about discussing how to pay for his wall with the Mexican president. Trump has boasted for months that he is going to get Mexico to pay for his ridiculous wall but when he came face to face with the Mexican president he got out maneuvered and then tried to cover it up on worldwide TV. Simply put, Donald got rolled. It turns out Trump didn just choke, he got beat in the room and lied about it.\"","post_message":"Hillary Clinton didn't go to Louisiana, and now she didn't go to Mexico. She doesn't have the drive or stamina to MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10155074124493258","commenter_b":"Hold fast against the Turd !","commenter_a":"\"A man reaps what he sows.\" Galatians 6:7. If you sow hate during the primary and the general election campaign, you reap hate, if you sow discord, you reap discord. #Galatians6","post_message":"‘‘We march today for the moral core of this nation, against which our new president is waging a war,’’ America Ferrera told the crowd at Women's March on Washington."},{"comment_id":"1589904131315822","commenter_b":"That's the stupidest reason I heard from a grown ass stupid woman/mother","commenter_a":"My choice was Bernie Sanders, but now I have to vote for Hillary Clinton because I 'm a navy mom and I don't want my son to be under the regulation of Donald trump, he said that he likes war.","post_message":"Oprah BEGS America: You don't have to LIKE Hillary, but you MUST vote for her!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1016384461715898","commenter_b":"So stop your judgemental whining bitch","commenter_a":"Sorry mice, but as someone with crohns I fully support this research.","post_message":"Researchers have engineered small intestinal tissue from human cells, and when placed in mice, the transplants were able to digest and absorb like the real thing."},{"comment_id":"933394380031531","commenter_b":"Good girl tell it like it is","commenter_a":"No one should lose their job for honesty","post_message":"Judge Jeanie Could Lose Her Job After Job After Publicly DESTROYING Obama On Live TV [VIDEO]  She just put everything on the line. Let's show her our support.  Can we get 30,000 'LIKES' for Judge Jeanie?"},{"comment_id":"964590076909747","commenter_b":"I wouldn't vote for that FAT SOB for dog catcher!!!!!!!!!!!!!!!!!","commenter_a":"Lol he can't control his staff with the George Washington bridge debacle and he wins the cnn award ? Lol notice they dident ask him about that...it was like always a trump bashing...I'm voting trump the media makes it easy for me to come to this conclusion","post_message":"It's official!"},{"comment_id":"10153624584662235","commenter_b":"Ewwwwwww, Leonard...I don;t know any self respecting lesbian that would be in the room with her much less touch it.","commenter_a":"Usually, those that \"doth protest too much\" likely have closeted feelings and are gay themselves.","post_message":"NAILED IT."}]
