[{"comment_id":"1824785004425894","commenter_b":"Women who support Trump have severe Stockholm syndrome and suffer insecurity","commenter_a":"Three times divorced, womanizer dares to talk about morality.","post_message":"Let's talk about the debate...what just happened?"},{"comment_id":"10153941813117042","commenter_b":"Cuz is not her child . evil face.","commenter_a":"My child is 8 n very timid n shy. The minute i find out some one hurt her in any way. God help them cause ima go after them.","post_message":"A day care director was caught on video hitting a child with toys. But then it gets even more disturbing from there.   Warning: Police described the video as difficult to watch."},{"comment_id":"969391529750304","commenter_b":"Even a whore has the right to decide when she has sex!","commenter_a":"Following a celebrity back to their hotel room doesn't make you ambitious. It makes you a whore.","post_message":"This is the side of the Bill Cosby rape scandal that hardly anyone is talking about  but everyone should."},{"comment_id":"596850543832294","commenter_b":"They can. And you have, traitor. I've gone from 80k a yr. income to less than 30k because of your bullshit. F you Brock insane obozo","commenter_a":"They're doing it you idiot. Must live under a rock.","post_message":"On the recent attacks, President Obama says no terrorists \"can ultimately undermine our way of life.\" Do you agree?"},{"comment_id":"596204130539541","commenter_b":"@username I think most people are okay with accepting refugees. PROVIDED, that they become members of the country they decide to make home. Non of this lets make Sharia law zones like back home bollocks. How do you separate the good from bad? Only allow families in? That hardly sounds fair. Just be aware that when you accept them in you accept responsibility for them. Anyone raped. Any bars burned down. Any cartoonists shot. You are responsible for those by knowingly understanding some of the bad is coming with those who need your countries protection.","commenter_a":"The assumption that these guys are all refugees is really telling. *Open your eyes a bit, these fuckers are homegrown. Isis is betting on you hating and attacking refugees to add fuel to their fire. You're all being played.","post_message":"Some experts say it's only a matter of time before the heart of the European Union sees tragedy."},{"comment_id":"10155534707951509","commenter_b":"Hillary is going to prison, The wicked witch is dead.","commenter_a":"Black people don't vote for Hillary Clinton. In 1994, she signed the mass incarceration bill with her husband, which put many black people in prison for small related crimes. Trump wants to fix the black communities, get a better educational system, and invest more in the schools. Vote for Hillary and black people will be suffering for another 4-8 years, just like the last 8 years when we had all these promises that never came.","post_message":"Michael Dale Vance Jr., the Oklahoma fugitive who authorities said shot two officers and killed two of his relatives last week, was killed in a shootout Sunday night, according to the FBI's Terry Weber."},{"comment_id":"10156761765540354","commenter_b":"Beyonce should eat a bullet.","commenter_a":"just go away already","post_message":""}]
