[{"comment_id":"1080661608696757","commenter_b":"Stfu!","commenter_a":"Way to go Lebron!! Millionaire rappers should do rap outs in support of someone who pointed an EXACT replica of a Colt 1911 at police. Yes it was a pellet gun, but if the child was educated at home on gun safety and how to never point anything that resembles a gun at police officers he would be ALIVE today.","post_message":"\"This issue is bigger than me; it’s about everyone. And gun violence and tragedies and kids losing lives at a young age, some way, somehow we need to understand that that matters more than just an individual.\"  - LeBron James"},{"comment_id":"1021161244667320","commenter_b":"Thank you Sir for your service. You inspire - Me - to be a better person.","commenter_a":"How very inspiring to Americans!","post_message":"'God Kept Me Alive for a Reason'  Can we get 5,000 'LIKES' and 'SHARES' for this HERO?'  @webpagelink"},{"comment_id":"10153151656451336","commenter_b":"Prayers for our Country. This woman is a tyrant!","commenter_a":"The last person on earth we need as president.","post_message":"BREAKING NEWS: Hillary Clinton announces 2016 presidential campaign. @webpagelink"},{"comment_id":"1003105503069410","commenter_b":"Taryn ignore her, she will forever think she is right about everything even though she's not","commenter_a":"Or we could just let every woman decide for herself.. If you don't agree with abortion, just don't get one. But that doesn't mean other people should be forced into the way you think..","post_message":"Not a bad thought - Let us know if you agree!"},{"comment_id":"1000833690051404","commenter_b":"@username ugly bitch but you so obsessed with nigger videos","commenter_a":"I scrolled through the comments hardly any white folks made comments why? Let this had been a story about someone doing all this to dogs, cats or a damn hamster and there would be uproar they would have condemned this women to the hottest pits of hell.","post_message":"8 Gruesome Facts About Notorious Female Slavemaster Madame LaLaurie"},{"comment_id":"1181787745189978","commenter_b":"Lock her up","commenter_a":"BULLSHIT!!!!!","post_message":"******BREAKING NEWS******  Finally!!"},{"comment_id":"10155783604970293","commenter_b":"If she was defending herself I hope she walks. Woman beaters should all end up like him.","commenter_a":"Likely another abused women who will be in prison for defending herself. I'm so tired of this happening!","post_message":"A Huntsville woman is being charged with manslaughter after her boyfriend died from his stab wounds."}]
