[{"comment_id":"468867053307454","commenter_b":"Transgender are idiots knockem in the head throw em in a ditch.","commenter_a":"This world is filled with way too many idiots. Please EDUCATE yourself. All of a sudden this is a problem? Where do you think trans people have been going to the bathroom? But ACTUAL pedophiles who like boys is okay? Stop being hypocrites and spreading hate","post_message":"A pledge calling to boycott Target has now reached over 1 million signatures. @webpagelink"},{"comment_id":"10153394886826336","commenter_b":"Mexicans run America now and there is nothing u can do about trump ur screwed...don't run for president no more there is no way ur going to win piece of","commenter_a":"Sue them to Mexico and back!","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"10154341988949203","commenter_b":"Hillary can gfh, I'm writing Bernie in!","commenter_a":"If you are for Clinton then you are for more jobs moving abroad. NAFTA, TPP, etc. It might be your job or your town next that is affected.","post_message":"Hillary Clinton has long pushed to regulate access to guns."},{"comment_id":"1320166798020657","commenter_b":"You are Sooo Pretty, Young Lady!","commenter_a":"Why is right. Totally agree, Brandon!!","post_message":"TheBlaze news update with Sara Gonzales and Brandon Morse."},{"comment_id":"10155835827900615","commenter_b":"About damn time they got these creeps off the air!","commenter_a":"Unfortunately another network will probably pick them up.","post_message":"BIG BREAKING NEWS –"},{"comment_id":"479299448927302","commenter_b":"Americans mandate Islamic Terrorists be assasinated","commenter_a":"Fuck them shot them in that red dot in there head...","post_message":"New Texas curriculum tells students to refer to Islamic terrorists as 'freedom fighters'.  Spread the truth, let's put an end to this.  'LIKE' if referring to terrorists as 'freedom fighters' is WRONG!"},{"comment_id":"10153510348059411","commenter_b":"serious lips on that lady, shes got Grace Jones beat even.","commenter_a":"She has no ideas worth repeating-FIRE her.","post_message":""}]
