[{"comment_id":"10155151407594575","commenter_b":"Illegals have to hide behind walls to avoid deportation. They build their own walls. Saw absolutely no effects from a day without immigrants, Guess they don't really matter.","commenter_a":"Awesome.","post_message":"Business owners are standing behind their decision to fire workers who participated in \"A Day Without Immigrants\" protests.  They say it's not a political stance but rather a business decision.  \"If you're going to stand up for what you believe in you have to be willing to pay the price.\""},{"comment_id":"999642010128853","commenter_b":"Close the border! People that come to this country should not try to change it to suit their needs / religion. When they come here they should accept our customs and laws. If they don't like them.STAY THE HELL OUT! simple!","commenter_a":"Bullshit","post_message":"EVERYONE needs to keep this in mind tonight."},{"comment_id":"10154362431207293","commenter_b":"@username She may surprise you.","commenter_a":"Pennsylvania must be filled with idiots. The KKK and White Supremacists have always held high number of members in that state","post_message":"“Put in Trump and we’ll win again,\" one voter said."},{"comment_id":"367411220096110","commenter_b":"Dalia Montosa","commenter_a":"Katherine Cardenas","post_message":"No bridesmaids assistance necessary!"},{"comment_id":"10153198327501051","commenter_b":"Love the whole idea!!","commenter_a":"They have French one's in Canada","post_message":"Are you okay with requiring all businesses to conduct their dealings in English only?"},{"comment_id":"1696261590644336","commenter_b":"Why don't you take down your wall and move the migrants in... Such hypocracy!!!!!","commenter_a":"Despicable imposter of the Catholic faith.","post_message":"POPE PUSHING OPEN BORDERS, AGAIN  details @webpagelink"},{"comment_id":"10153687678068487","commenter_b":"A drama queen is bad enough! But a stupid, manipulating drama queen can mess up your day! She's the wolf in sheep's clothing! Voters...do your own fact checking!","commenter_a":"Fiorina wasn't \"confused\". She was lying.","post_message":"No one can find the scene that Fiorina described at the debate in the Planned Parenthood videos."}]
