[{"comment_id":"615536761924441","commenter_b":"It open season on black people out here...I swear..the day when the rabbit has the gun is almost near.","commenter_a":"Well world, what do you think of the greatest country in the world now???","post_message":"Remember little Aiyana Stanley-Jones? She was only 7-years-old and ASLEEP when a Detroit cop fatally shot her in the head. Now it's official: EVERY LAST CHARGE against the cop who killed her has been DROPPED! He will face NO punishment AT ALL!  Are you surprised?"},{"comment_id":"10153427592702377","commenter_b":"WE NEED TO TAKE THE WHITE HOUSE BACK!!!","commenter_a":"Carefull what you wish for... then stack the $15 minimum wage movement on top of that! :-(","post_message":"April 15 just got a lot worse."},{"comment_id":"10153751099450575","commenter_b":"get this ass out of office and then let them rape her!!!!!!!!!!!!!","commenter_a":"Yup!!!!! a little common sense, people....she's the leader of Germany...Oh , sorry, look at the leader of the U.S. He's not smart enough to pick up on this.....well I think he is smart enough , but he's on a fast track to destroy america, so, it can do that!!!","post_message":"Now she admits it after she already destroyed Germany. . . ."},{"comment_id":"10153258826178812","commenter_b":"women are such babies","commenter_a":"Is it necessary to show this photo? This was someone's child, a little more respect would be great. Rest in Heaven, thank you for your service","post_message":"Navy officials: Navy SEAL killed in parachute accident in California: @webpagelink"},{"comment_id":"10153055647952235","commenter_b":"oh shut up Sarah !","commenter_a":"I'm more left leaning and I know she's a joke.","post_message":"Pass the popcorn!"},{"comment_id":"10154046625596051","commenter_b":"Furthermore what rights will trump take? The right for illegals to get more welfare then born americans? The right for illegals to start a business 7 years tax free and hand it of to their cousin for another 7 years?? I'm hoping for hard labor and prison time for desiccating the American flag on American soil.","commenter_a":"Since when did women become thinkers with their vagina's? Surely not many women are this dumb.","post_message":"With women voters, Clinton is leading by double digits. Why do you think that is?"},{"comment_id":"1140315249363924","commenter_b":"Blow these animals off the face of the earth","commenter_a":"If these imagrants can live or vote . Send them all over in middle east to fight for our country , including mexicans. Then see what happens . All of them will leave . Build that wall Donald","post_message":"Muslim Migrants Already Lazy Bums, Veg Out And Drink Liquor All Day on Taxpayers Dime!!!   This is what Obama and Hillary want for America!"}]
