[{"comment_id":"948311541870934","commenter_b":"If they want to live in our country then they need to live by our laws. Things should not be changed to accommodate them! If they don't want to live by our laws they should live elsewhere! We have to abide by the laws...so should they!","commenter_a":"I don't think so .. Not in Fla","post_message":"This state is allowing burkas in driver license photos!  THIS SHOULDN'T BE ALLOWED IN AMERICA..."},{"comment_id":"10154429082261378","commenter_b":"Yes...fix her a$$...so she can't bring any more babies in the world...","commenter_a":"Yes","post_message":"A judge ordered a drug-addicted mother of 4 who has worked as a prostitute not to get pregnant again. Is this order fair?"},{"comment_id":"621932114627042","commenter_b":"NO MORE POLITICIANS. OR WORSE, A POLITICIAN/LAWYER #TRUMP2016","commenter_a":"UPDATE (4 PM): In addition to the town hall, Donald Trump will also hold a rally at the David L. Lawrence Convention Center Wednesday evening. DETAILS: @webpagelink","post_message":"UPDATE (4 PM): In addition to the town hall, Donald Trump will also hold a rally at the David L. Lawrence Convention Center Wednesday evening. ---------------------------------------------- The Donald is coming to Pittsburgh."},{"comment_id":"10153521877313822","commenter_b":"That skank!","commenter_a":"She has an incredible voice.","post_message":"JUST IN: The NFL announces that Lady Gaga will perform the National Anthem at Super Bowl 50.    SUPER BOWL COVERAGE: @webpagelink  What do you think of the choice?   (Gareth Cattermole/ Getty Images)"},{"comment_id":"895114997196955","commenter_b":"Your mother is a rat","commenter_a":"for press tv and iran the houthi rebels who tried to overthrow the govt are not terrorists. Instead the forces fighting houthi rats are terrorists. and iran claims to be a democracy. wtf","post_message":"Saudi warplanes airdrop weapons to militants in #Yemen  Read more: @webpagelink"},{"comment_id":"417410465107501","commenter_b":"Should be shut down!! YEA---YOU'RE CHRISTIAN! !! ---- NOT!!!","commenter_a":"This is America and our two party system decides us all. No wonder that there are those who would help this business owner. Now let's see if this upright Republican claims all of it in taxes. My guess is that like most Republicans she will lie about it and cheat the government.","post_message":"Sadly, bigotry pays."},{"comment_id":"877374009072027","commenter_b":"What they should do is put them to work while they are on welfare and lowering government al expenses! A few hours here and there will save a bundle! Stop giving them a free handout and not allowing them to contribute to society! Eventually, get them a regular job and get them off welfare!","commenter_a":"Yes! To all of them!","post_message":"Do you support drug testing for welfare recipients?"}]
