[{"comment_id":"10156563653020652","commenter_b":"Man, my dog is always happy. I learn from my dog, so now I am always happy. “We understand how dangerous a mask can be. We all become what we pretend to be.” ― Patrick Rothfuss,","commenter_a":"@username - gedink jy sal ook hierdie interessant vind :)","post_message":"What can we learn from how animals cope?"},{"comment_id":"1723070871241628","commenter_b":"The Republican party better start listening, the real American People are speaking LOUD AND CLEAR!!!! WE WANT DONALD TRUMP!!!!","commenter_a":"Trump 2016!! The GOP is fighting for his failure, they should unite and back our choice. We need a smart President with common sense can build and secure borders, create jobs and a better future for the USA and puts the American people first. That man is Mr. Trump, lets do this!","post_message":"Thank you AMERICA! So grateful for your support- as we work EVERYDAY to MAKE AMERICA GREAT AGAIN! En route to Wisconsin now!"},{"comment_id":"10156221471665725","commenter_b":"Trump is only enforcing a fedral law, by deporting illegals !!! This is already the law !!!","commenter_a":"I am inviting all of TRUMP FAN to PRAY , from the HEART everyday and all the time, he need it and we need him, please let get together , for our country and for our new president TRUMP, TRUMP 2016, AMEN !!!!","post_message":"I will be hosting Saturday Night Live on November 7th. Looking forward to it!"},{"comment_id":"888341521222544","commenter_b":"She sounds worse than the other guy Holder.","commenter_a":"Another dumbass handpicked","post_message":"Add your name HERE: @webpagelink"},{"comment_id":"1058824504164459","commenter_b":"@username are they in mexico legally? if they aren't, they'd be in a mexican jail. if they are. then go after your gvt for not preventing the assaults. the fact is this.. ILLEGAL entry to any country, including mexico, is against the LAW. Mexico has enforced their law and the US MUST TOO. That means a wall since mexican cartels have made another business out of smuggling people into the us and those who can't pay the cartels, find a different way. Mexico didn't like it when Guatemala did it to them and we don't like it here either.","commenter_a":"Mexico has the largest border wall on earth bordering Guatemala to the south in order to protect it from the violence and to protect its mexican culture. It shows the historically true nature of mexican politics since Maximilian was executed. Nothing in mexico is good for America at this time. We dont need there people drugs or crime.","post_message":"\"Suicide bombings in Israel went from 1,000 a year to zero a year once they put that fence up.\"  Yesterday, Mike Huckabee spoke to Uma Pemmaraju about walls, using Israel as an example of why they work."},{"comment_id":"10154886702384166","commenter_b":"We got a little here in Honea Path :-)☃","commenter_a":"got some in pelzer, they are haveing a blast in it!!!","post_message":"Sort of an encore performance of snow over parts of the Upstate just before 7 AM. Folks in Anderson could very well get a quick dusting out of this. Let us know if you do! We're on for another 2-3 more hours on FOX Carolina. -Ben"},{"comment_id":"10154178824428987","commenter_b":"I had guillian.barre in 1976 do i have a greater risk of contracting the disease?","commenter_a":"Nice smile","post_message":"Talk to us. Zika questions?"}]
