[{"comment_id":"10153665573326077","commenter_b":"Yep bet you never did anything wrong in your life","commenter_a":"Wth is wrong with kids nowadays... Everyday they are up to something crazy !! Yesterday was drinking fuel with soda , today is this , tomorrow?? What??","post_message":"Have you heard of the \"duct tape challenge?\""},{"comment_id":"10154607123003984","commenter_b":"Get a fucking rope around that sorry bitch's fucking neck. Treason is punishable by the death penalty!","commenter_a":"So why aren't we hearing this on all the news channels? This is serious enough that it should be out there! Why are they even allowing her to run for President?","post_message":"Hillary has dodged this way and that on Benghazi, hoping her lies never caught up to her.  But they just did in a huge way.  A high-level, bombshell email was just uncovered by a watchdog group, and it PROVES beyond a doubt that she left those brave men to die in agony, knowing full-well she had a chance to save them. How sick."},{"comment_id":"921271484601636","commenter_b":"she spends our tax dollars on all kinds of expensive garbage. the woman needs a clue. race is not the issue. her habits are.","commenter_a":"And didn't they take her law degree away from her? And he apparently didn't even pass the bar exam.","post_message":"Everyone is racist at me!!  Michelle Obama whiny, self-centered commencement speech  @webpagelink"},{"comment_id":"10153822554726800","commenter_b":"Linda you sound like a true feminist. If feminist hated all women who dressed nice and looked pretty. She is an attractive woman. I won't comment on her alternative income or employment. Selling your vagina to make money is about the most American and feminist thing I can think of. It's like eating an apple pie with a slice of American cheese on it that was baked by a bald eagle complimented by a nice mason jar of Kentucky moonshine.","commenter_a":"If President Obama needed a raw onion in the podium, what was John Boehner's excu.. er, where was his raw onion stashed the millio... um...many times he cried over far less than dead kids?","post_message":"Andrea Tantaros on President Barack Obama's tears during his speech on gun violence: \"I would check that podium for, like, a raw onion or some no more tears. I mean, it's not really believable.” @webpagelink"},{"comment_id":"10154490901549062","commenter_b":"She has that privilege","commenter_a":"Well at least she looks happy.","post_message":"The Drug Enforcement Agency has confirmed that a woman arrested for allegedly selling drugs in College Station is the daughter of a DEA agent."},{"comment_id":"452813904909190","commenter_b":"Why doesn't the women who complained go back to Africa? Why walk over our freedom of expression?","commenter_a":"Yes","post_message":"Do You Support This Woman's Refusal To Remove Her Flag?  Comment 'yes' or 'no'."},{"comment_id":"10153167916826336","commenter_b":"I don't understand it either.","commenter_a":"They should have just as much of a right to stop and salute the flag as anyone else. Baseball is America's pastime and they deserve the right to respect the country.","post_message":"Workers say ordering them to work through the singing of the national anthem is disrespectful."}]
