[{"comment_id":"10154744279541323","commenter_b":"ooh, you bitch you. i wouldn't invite you to your own funeral","commenter_a":"Hillary looked like she could use a shower and some crayons when she slithered out from under her rock last night.","post_message":"\"None are without controversy.\""},{"comment_id":"1792151467673200","commenter_b":"Right a true nasty woman!","commenter_a":"The only \"educational\" facet in Rosie is her nastiness! Period.","post_message":"Rosie O'Donnell says she posted a tweet questioning whether Donald Trump's 10-year-old son is autistic because she found it \"educational.\""},{"comment_id":"1875772702705471","commenter_b":"These hoes aint loyal","commenter_a":"@username 😴","post_message":"So messed up  #WSHH"},{"comment_id":"1508345139225610","commenter_b":"His wife has his balls..","commenter_a":"SEE THIS IS THE SHIT THAT HAPPENS WHEN WE APPEASE TERRORIST SUPPORTING NATIONS JUST LIKE JMMA(THE PEANUT BRAIN) CARTER AND BILL(I DID NOT HAVE SEXUAL RELATIONS WITH THAT WOMEN) CLINTOOOON DID,, NOW OBAMA IS DOIN SAME THING BUT THIS TIME HE HAS LET THEM GO NUKE,,,THEY PLAY WITH US BECUAS ETHEY KNOW OBAMA DOESNT HAVE THE BALLS TO DO ANYTHING SAD","post_message":"JUST IN:"},{"comment_id":"10153307744490329","commenter_b":"Milliner - ladies hat maker. I'm cool with it","commenter_a":"Switchboard operator....pretty fitting, considering I'm a medical secrerary","post_message":"Vaudeville Star? Bootlegger?"},{"comment_id":"10155215673171337","commenter_b":"He better quit smoking crack with lamar odem","commenter_a":"Someone summon Bill Nye to drop knowledge on him.","post_message":"Um... what?"},{"comment_id":"1129560600439389","commenter_b":"Why doesn't everybody wake up and send them back to their own country WTF","commenter_a":"Peaceful What?! No such thing! All vicious rabid ranting carnivorous things from hell! Satan has sent them from the burning sands of the deserts to murder, rape and pillage all others! Be gone you vermin from the bowels of perdition!","post_message":"HIDDEN CAMERA: This Is How Moderate Muslims REALLY Treat Peaceful Christians!  wow!"}]
