[{"comment_id":"1013220235397406","commenter_b":"She is an ugly witch. No wonder Bill looks elsewhere.","commenter_a":"Hillary is a has been Murder Embezzlement List ghost oes on","post_message":"ISIS just needs a hug..."},{"comment_id":"389873387803923","commenter_b":"Really professional. I do (NOT) want her in the White House.","commenter_a":"I think she committed political suicide.","post_message":"Did you find this picture offensive or irresponsible for someone in her position?"},{"comment_id":"956895434364622","commenter_b":"Thats what she talks out of.","commenter_a":"Thats yet to be proved!","post_message":"Apparently race and gender are the only qualifications necessary to become President if you're a Democrat..."},{"comment_id":"10153465361664714","commenter_b":"I'm just sorry u all have to go thur you show up lifting an I'm praying they do not take it of. I've been in your shoes girls,an the ownly way is to move on is to try an find a way to forgive an forget,I. Found it in my bible there isn't one single person out there that donest havesomething bad or a secret hidden in their closet, I'm just sorry something as this is blown so far there,but I can say this ,I love the show an praying it back on u r like my family,an I'll miss u.","commenter_a":"In not excusing at all what he did, but how is he a pedophile or rapist? Kids touching kids around their own age aren't pedophiles. It's molestation, yes. When an adult touches a child in a sexual manner, that's a pedophile. A rapists is some one who rapes another person. He didn't have sex or oral with his sisters. He's not a rapists and he's not a pedophile. He was a molester. I'm not saying what he did was nothing, but can we call it what it is without adding false titles? The diggers called trans people pedophiles and we no that's bogus, but do we need to stoop down to their level? If we do, we're just as bad in our thinking as they are.","post_message":"More on the 19 Kids and Counting scandal."},{"comment_id":"10153050473569255","commenter_b":",,,a bit back he was sucking kochs and the bitch owes!","commenter_a":"And how much does Cruz personally have invested in Keystone?","post_message":"I do enjoy Senator Ted Cruz's consistency in fouling up his own party's messaging."},{"comment_id":"10153563258578812","commenter_b":"they can have as many wives as they want!","commenter_a":"Consenting adult and there should be a limit .... of wife's for sure .. and later polyandry limit the husbands too","post_message":"Polygamous Montana man seeks legal marriage license with 2nd wife following Supreme Court same-sex marriage decision: @webpagelink"},{"comment_id":"692662477538954","commenter_b":"This American Woman supports Trump and I feel more comfortable just thinking about Trump being the POTUS, then I have ever felt the whole time Obama has been POTUS","commenter_a":"As a woman, I wouldn't trust Obama unless I was armed. As a woman, I wouldn't vote for Hillary unless I was voting to send her to the nearest blackhole. Trump is not perfect, by any means. But he's infinitely better than what's currently fouling up the White House.","post_message":"What do you think about President Barack Obama's statements regarding Republican women and Donald J. Trump?"}]
