[{"comment_id":"10153956730069411","commenter_b":"You poor thing! (Jk)","commenter_a":"I know where I came from :) I am 20% from Asia, 20% from North America, 20% Pacific Islander and 40%European Meztizo. That is why I look like this. My eyes are brown and blue (blue edges, brown interior).","post_message":""},{"comment_id":"957772524242927","commenter_b":"Kiss ass!","commenter_a":"Great now Quebec will never get a team","post_message":"Gary Bettman, are you listening?"},{"comment_id":"1110152195742243","commenter_b":"IF Hillary does get in I cannot wait to see people like YOU have to bend over and grab their ankles because of all the Radical Muslims and Syrians she plans to bring into the USA. Within her first 100 days she wants totally open borders and wants to bring in a minimum of 65,000 more Syrians. And within her time as president she plans to bring in a minimum of 1 MILLION Muslims! ....IF Trump does not get in, you can kiss your azz goodby and say hello to ILLEGALS, MUSLIMS, THUGS, and SYRIANS who will rape (you and your family), rob, and want everything you have worked for...........and they will get it! .The USA will go into total bankruptcy, and become a totally socialist nation!............IF this happens, Just Remember: \"I Told You So\"....AND YOU DESERVE IT!","commenter_a":"Republican nominee Donald Trump disdain for the American worker is legendary at this point. He been caught refusing to pay people for doing their jobs, told them that they don deserve a minimum wage, and offers benefit plans that actually won help working families, and scammed thousands of Americans out of their hard-earned money with his fraudulent . He doubled down on insulting the American working class in a truly insulting fashion earlier today when speaking about how too many Americans are working two jobs just to make ends meet, but told the crowd that , I working harder also, so I don feel sorry for any of you. It true. You think this is easy? Mr. Trump has never truly done a day of in his life. After graduating from his high-priced university, he was given a loan of a million dollars from his father, with which he began ...","post_message":"Today - I outlined a plan for American economic revival - it is bold, ambitious, forward-looking plan to massively INCREASE JOBS, WAGES, INCOMES and opportunities for the people of our country!"},{"comment_id":"812160358905862","commenter_b":"Please make sure you are registered REPUBLICAN to vote for TRUMP. He's our only hope. Corrupt Washington DC will continue as usual with the rest who are beholden to big donors/super pacs. This corruption has been going on for 35 plus years. Vote TRUMP to take back our country. If Trump don't win our children and grandchildren will have a miserable life with Muslims and illegals taking over our country and to top it off we have no jobs.","commenter_a":"Question: If #BillClinton is campaigning for #HillaryClinton, does this mean he can charge any fee he sees fit? In other words, no matter the outcome, the #Clintons are making bank! Also, is this true? HIGH Treason Traitor Hillary Rodham Clinton UNITED States of America - As Wanta-Reagan-Mitterrand Protocols implementation remains imminent with an April 1st U.S. Supreme Court ordered deadline, it can now be reported that former U.S. Secretary of State Hillary Rodham Clinton has been placed under house arrest by the U.S. military on charges of financial treason. On week ago Friday, the same day Jack Lew was sworn in as U.S. Treasury Secretary, sociopath Hillary attempted to illegally divert $1.7 TRILLION of U.S. Treasury funds to a secret CIA proprietary account in the People Republic of China. Both Chelsea Clinton (Hillary daughter) and former Citibank CEO and Clinton era Treasury Secretary Robert Rubin have power of attorney over ...","post_message":"Good morning America! Thank you for your support in the latest national Reuters poll. TOGETHER, we will #MakeAmericaGreatAgain!"},{"comment_id":"758642314270568","commenter_b":"@username @username DAMMM SHUT DOWN","commenter_a":"Hilary is no Obama, she is WEAK. She is a sell out in moments notice. She has no platform. The democratic platform was handed to her by Bill.","post_message":"Bernie Sanders to Hillary Clinton: \"Excuse me, I'm talking.\""},{"comment_id":"902740889761333","commenter_b":"Who would want her??","commenter_a":"Oh really that would make for a honest President, not","post_message":"BREAKING!"},{"comment_id":"704906709652228","commenter_b":"What a joke this lady is. I bet she is protected by Guns every single day... But she doesn't want Americans to be able to protect themselves. Just ridiculous","commenter_a":"Yah, just fill out form ID-10T and they'll ship a gun right to your doorstep Mrs. Douchebag. This is exactly why the establishment left cannot have nice things.","post_message":"“You shouldn’t be able to exploit loopholes and evade criminal background checks by buying online or at a gun show…We have to make it harder for people who should not have those weapons of war.”  – Hillary Clinton reacts to the #OrlandoShooting @webpagelink"}]
