[{"comment_id":"951265721580953","commenter_b":"She's is a fat suit. Skinny is the new fat","commenter_a":"The air brusher worked overtime on these pics.","post_message":"Model Ashley Graham has been incredibly vocal about seeing more diverse body types in the media, and she's made huge strides with this Sports Illustrated ad."},{"comment_id":"664826563698227","commenter_b":"She should have been in the nut house a long time ago! Along with most liberals crazies!","commenter_a":"What a brainless numb scull.","post_message":"If there was a prize for \"worst listener ever\", Nancy Pelosi would be the far-and-away winner."},{"comment_id":"556548184511652","commenter_b":"You people seriously think our border with Mexico will keep terrorists out? You think that if we can't tell the difference between refugees and terrorists, that we would actually be able to sort them out at the airport? If we didn't want to take refugees we should not have involved ourselves in the war.","commenter_a":"To the people who support bringing in Syrian refugees: Have you ever thought that some of these \"refugees\" could be disguised and actually be ISIS terrorists taking advantage of this situation with a free pass to get here? I think we need to use common sense and take the obvious security precautions and NOT accept these people!","post_message":"My interview last night with Sean Hannity."},{"comment_id":"919439784782166","commenter_b":"She is a no brainier!","commenter_a":"Sarah Palin has a mental drought that no reservoir will cure.","post_message":"Sarah Palin is here, and she's got some wisdom for y'all."},{"comment_id":"10154347053069411","commenter_b":"45 million people on food stamps. 30 million illegal aliens allowed to run free while a record 2.3 million Americans are locked in jail. The largest national debt in the last 240 years. A record 95 million Americans are not in the labor force. The longest streak of war time in American history with 22 veterans committing suicide a day. A healthcare system than now kills a record 500,000 Americans each and every year while maiming millions more. The muslim Democrat Obama has proven he is an epic failure. Obama is killing Christians globally.","commenter_a":"People need to stop acting like that to cops if you keep resisting that's what happens! These cops are doing the best they can.","post_message":"'We f**ked'"},{"comment_id":"10152512377042377","commenter_b":"RINO !","commenter_a":"He'd be bad for the workingman","post_message":"Romney 2016???"},{"comment_id":"1763064613956147","commenter_b":"Bitch I ain't finna lose my job over your racist ass. But don't let me catch you outside 2 months from now..","commenter_a":"First World Problems","post_message":"This is truly shameful."}]
