[{"comment_id":"10154883119407969","commenter_b":"1. Asylum isn't the same status as refugee. 2. Kyrgyzstan isn't Syria Yikes.","commenter_a":"George. I hate to break it to you but your reporting is a little faulty! You said no Syrian Refugee ever did any harm to us? You clearly aren't familiar with The Boston Bombers. Both Syrian Refugees! BTW George, OBAMA BANNED MUSLIMS FOR 6 MONTHS IN 2011. ANY THOUGHTS?????","post_message":"WATCH: George Stephanopoulos interviews Kellyanne Conway about President Trump's immigration ban, countries not included and comments from Republicans on the order: @webpagelink"},{"comment_id":"846040542099954","commenter_b":"Women may not want to watch porn but they will read it all day long.","commenter_a":"Much truth to what is said in this article, having said that, it's all about the dollar, always the dollar.","post_message":"“Fifty Shades” isn’t harmless. It is actively poisonous. Toxic. A putrid lump of nothingness.\" - Matt Walsh"},{"comment_id":"10153063364393188","commenter_b":"Idiot and hypocrite. So he says he was a solider.","commenter_a":"He's a traitor and needs to be deported immediately","post_message":"Really?"},{"comment_id":"1738525546372400","commenter_b":"Amen","commenter_a":"Amen","post_message":""},{"comment_id":"493465740841719","commenter_b":"Good I will not go there!!","commenter_a":"I wont be there so shove your coffee and other product up your big rich white ass","post_message":"Should we boycott now?"},{"comment_id":"10153047601521336","commenter_b":"how many lawyers have been sent to \"find dirt\" on her, like they did with Sarah? can you imagine Sarah debating this heifer on live t.v.?","commenter_a":"Well of course they didn't find anything. You never had anything interesting to say.","post_message":"\"Will they put the same effort into her emails as they did mine?\"  Former Alaska Gov. Sarah Palin thinks the media should hold Hillary Clinton to the same standard to which they held her over access to emails. What do you think?"},{"comment_id":"631003300406505","commenter_b":"She's a force to be reckoned with","commenter_a":"Bre Camp spirit animal?","post_message":"WATCH: 2-year-old Violet lives with her family in Shreveport, Louisiana, but she soon could be on Broadway as her rendition of the alphabet song is becoming a viral sensation. Jesse Tyler Ferguson, who just finished a Broadway run, shared this video on his Facebook page, writing \"I can't help but think this what Elaine Stritch was like as a child.\" @webpagelink"}]
