[{"comment_id":"1073442816041814","commenter_b":"We all get there no matter who you are 4 days coming it will be so funny she doesn't know what she's talking about but you have to look at it he's an ignorant liberal socialist!!!!!!!! When she gets old just let her die!!!!!!!!! She is stuck on stupid!!!!!!!","commenter_a":"You will be old idiot","post_message":"Totally nuts!"},{"comment_id":"1191348794238924","commenter_b":"She should keep her mouth shut and her daughter her legs shut","commenter_a":"Here is how I see it: The rediculous right always has an angle of deceit. Their only honor is to ones self and personal greed. No matter what they put out in propaganda the real truth about them shines in their actions and public statements. The problem with the left is they won't get up and go vote even by absentee ballot and let the post man do all the waiting in line when the religious right blocks off all the bathrooms.","post_message":"Sarah Palin wants you to fight against haters who want to take Christ out of Christmas by buying her ridiculous book."},{"comment_id":"10152737995296519","commenter_b":"Whore's goal. A quick happy ending, get the john outta there.","commenter_a":"Yep and when you have it down real well, men cum in one minute instead of two.....grrreeeaaaatt.","post_message":"\"Those who master it walk away armed with strong sexual skillsets, and even stronger vaginas\""},{"comment_id":"127969217779704","commenter_b":"@username go away criminal","commenter_a":"Great job police and K9. POS got what he deserved. Just hope the dog doesn't get any disease from the scumbag!!","post_message":"A police dog takes a big bite out of crime, subduing a carjacking suspect involved in a high-speed chase and spectacular injury crash.  Eyewitnesses capture the drama on camera as the suspect tries to flee. Eyewitness News live with the condition of the innocent driver injured in the La Puente crash. Tonight at 11 from ABC7. abc7.com/@username/"},{"comment_id":"1154513944599658","commenter_b":"Open primaries work just fine Terrence.","commenter_a":"Yea- Bernie baby! This was a closed primary and they are near a tie!!!!! Can you imagine if they \"allowed\" everyone to vote?!!!!! #therevolutionishere","post_message":"UPDATE: Sanders wins the Oregon primary, while Clinton appears likely to eke out a narrow win in Kentucky. Sanders' cut into Clinton's 270+ pledged-delegate lead likely will be single-digits."},{"comment_id":"10156149159940354","commenter_b":"There's NO MYTH! ASSHOLE! I RESCUE PIT BULLS TOO, It's Dumb F**KS like you and your brother James that give Pit Bulls a bad Rap! Also DumB F**KS like this woman in the article! Check Cesar Milan, Pit Bulls & Parolees, Etc etc! OH NEVER MIND You're probably a Liberal Obama lover too!","commenter_a":"I OWN PIT BULLS, It would be impossible for me to order mine to attack ANYBODY! I could leave them in a room with an infant crawling on the floor without a worry! THIS woman IS THE REASON Pits have a bad Rap! These dogs were trained to be mean! Lock her ass up for 25 YRS! I Doubt the two dogs can be saved, they'll have to be put down!","post_message":"***WARNING: GRAPHIC VIDEO***"},{"comment_id":"618837121600063","commenter_b":"bitch","commenter_a":"Donald Trump is beginning to understand why they did want him involve, right? @webpagelink","post_message":"Paul Ryan is a ___________."}]
