[{"comment_id":"10155817024445192","commenter_b":"If she has an abortion, there is no child support. If you have the kid, they have to eat whether you like it or not.","commenter_a":"Women say it's thier body until it comes to child support. Then is both. Hmm mm if abortion is legal because of pro choice then child support should be pro choice too.","post_message":"A Florida judge is blocking a new state law that requires women to wait 24 hours before getting an abortion."},{"comment_id":"10152805684357377","commenter_b":"Bout time someone got a pair! Keep your ducks in a row bro. I'd like to see her in a 4x8 with obstructed view!","commenter_a":"They trying to stop Hillary at all cost.","post_message":"Klayman reveals the details on The Steve Malzberg Show. Watch Newsmax TV on DirecTV Ch. 349, DISH Ch. 223 and Verizon FiOS Ch. 115. Get Newsmax TV on your cable system."},{"comment_id":"10152955885854641","commenter_b":"we never tolerate any humiliation to our beloved prophet","commenter_a":"For some idiots act why do you drag the entire religion and keep mocking them... By speaking m I terrorist to you that I'm a Muslim ??? What do you have in mind?","post_message":"Muslims respond to Charlie Hebdo’s new Mohammed cover with mixed emotions: cnn.it/14xIMA6"},{"comment_id":"10152931648796491","commenter_b":"They are business women now and could buy everyone on the show. Maybe they will make a cameo appearance, if the show stays on the air? They should just leave the show alone and move on with their lives.","commenter_a":"I believe they've both stated they are through with acting. Its their choice how they live their lives. They don't owe anyone anything. They're both very well suited for their current endeavors in fashion, out of the limelight.","post_message":"“I understand they’re in a different place and I wish them the best,” John Stamos said."},{"comment_id":"10153814761109705","commenter_b":"So are fat chicks!","commenter_a":"It's always amusing when it's celebrated to mock some, but when it's other's it's called \"shaming\" and it's frowned upon. Looking forward to your next article on fat chicks saying fat is cool and healthy!!","post_message":"Twitter is calling it #YallQaeda."},{"comment_id":"1797253250554324","commenter_b":"Tax the nfl that might cut into some of the players money lot of overpaid jerks. Funny how middle Americans love this country and those zeros will not embrace it. I see problems not the countries fault it's the politicians, take care of it at the polls.","commenter_a":"I'm done with the NFL you guys play a game and earn millions piss on all of you who disrespect our country!!!!","post_message":"BREAKING NEWS...."},{"comment_id":"642967212548589","commenter_b":"YOU ARE ALL IMMIGRANTS UNLESS YOURE NATIVE AMERICAN. DEPORT YOURSELF.","commenter_a":"Trump they going to kill you man you are trouble man","post_message":"WATCH LIVE: A large group of people protesting President-Elect Donald Trump are marching in downtown St. Paul, Minnesota. Similar protests are also taking place in Chicago, New York, Washington, D.C., Philadelphia, Portland and Atlanta.  @webpagelink"}]
