[{"comment_id":"10154732909385586","commenter_b":"I am glad that this horrible woman will be banned from the store. Shame.","commenter_a":"Betcha Grandma cashes her SS check every month","post_message":"An elderly woman is shown yelling at another woman and her friend, using racial slurs, cursing and telling them to “go back to where they belong.” How's that for Christmas spirit?"},{"comment_id":"630794597099043","commenter_b":"Jill is Anti TPP! TPP protects corps who want to outsource american jobs!!!!!!","commenter_a":"Yay","post_message":"We’re here with Green Party candidate Jill Stein and her running mate, Ajamu Baraka to take your questions ahead of tonight’s #GreenTownHall. Please submit your questions in the comments section below. Tonight's Green Party town hall starts at 9 pm ET. @webpagelink"},{"comment_id":"10152746460981636","commenter_b":"Feminists are heavily invested in the rape culture narrative, the fact that they always attack rape prevention shows this","commenter_a":"Did you dare to suggest that the onus should be on the perpetrators of rape instead of the victims? Prepare for a tirade of comments accusing you of 'calling all men rapists'...","post_message":"Perhaps the focus should be on the perpetrators of rape, rather than potential victims?"},{"comment_id":"10153288020701545","commenter_b":"I hope you never lose your corporate job. And I also hope the minimum wage workers you go to every day for house cleaning, coffee, lawn care and a burger don't abandon you.","commenter_a":"If people work 40 hours a week, minimum wage should cover minimum living expenses. This isn't even a question.","post_message":"The National Restaurant Association says a $15 base wage would force employers to replace workers with technology, such as ordering tablets. \"Fifteen dollars is too far, too fast,\" said spokeswoman Christin Fernandez.  What do you think is a fair minimum wage?"},{"comment_id":"10154656538916037","commenter_b":"Did she forget her campaign started birther in 08. non issue move along...Besides Obama is not running...","commenter_a":"Thats the problem here, nobody questions.... Some Americans are like a bunch of sheep","post_message":"“For five years [Donald J. Trump] has led the birther movement to delegitimize our first black president.\""},{"comment_id":"903279336444237","commenter_b":"Sigh","commenter_a":"Joshua William Grant told you 😂","post_message":"Misogyny is misogyny."},{"comment_id":"10153186802728203","commenter_b":"\" \"There is very little in the Bible which reflects the modern idea of one man and one woman united by love, Jimmerson said explaining her support for gay \" \" Let's see Genesis 1 & 2 gives us the pre-fall structure of marriage. This was reiterated by JESUS in Matt 19 and Mark 10. There is no higher attestation then that.","commenter_a":"That's not up for contemplation if they did be sure to expel them right away","post_message":"Southern Baptist affiliate may expel church for performing same-sex ‘wedding’"}]
