[{"comment_id":"1046419898744877","commenter_b":"What a total moron !!! This woman really was an Amb. at one time ,what an asshol. she is !!!","commenter_a":"They already did you cow!!!!!!!","post_message":"Former Secretary of State Madeleine Albright says that \"nobody is going to die as a result of\" Hillary Clinton's emails."},{"comment_id":"939707739399900","commenter_b":"It used to be fairly common to have a cross on the flag pole representing the same thing as Christ above all.","commenter_a":"I am a Christian but, no flags are to be flown over the flag of the United States. I DO feel his frustration but, this is a no-no. God Bless America !","post_message":"Are you OK with this?"},{"comment_id":"367420580112903","commenter_b":"Rot in Hell B#$%H !","commenter_a":"Good for him !!!!","post_message":"INSTANT Justice: Judge: \"I Hope You Die in Prison!\"  Watch the video!"},{"comment_id":"549265795241268","commenter_b":"Those boarders should never been opened... Obama fault all the evil happening in the world, is all due to Obama turning loose the Muslim maggots and Mexicans by mostly the Muslims... Their eating up all the good stuff in the world just like maggots do and ruining everything!!!!","commenter_a":"Yes","post_message":"BREAKING: Mexican Military Invading US, Begin Shooting Texas Residents.  We Trump's wall now. This is getting out of hand.  Do you think we should close our borders?"},{"comment_id":"10153868585859203","commenter_b":"She wouldn't fuck any of you dude bros anyways.","commenter_a":"She looks great. Bold, sexy, unflinching, human.","post_message":", gross, strong, thin, fat, pretty, ugly, sexy, disgusting, flawless, woman."},{"comment_id":"502394676575976","commenter_b":"I wonder if she's inbred?","commenter_a":"Stay classy, Penny. Fucking troll bitch.","post_message":"Today's fan mail."},{"comment_id":"10153634339640695","commenter_b":"Randy isn't even from the south. He's a Yankee. He has no say in whether it would come down or not. Just trying to yank your chains.","commenter_a":"take that dirty monument down!!!","post_message":"Instead of removing the carving, one councilman says they should add to it to better reflect Georgia history. What do you think?"}]
