[{"comment_id":"10154490644508132","commenter_b":"But she was slimer before","commenter_a":"Her body is not well balanced is too much up in the chest ... too much on her Back .... Kourtney and Kendall bodies are better","post_message":"Kim Kardashian West traded her neutrals and furs for a bold vibrant look! (via PeopleStyle)"},{"comment_id":"10154844264313132","commenter_b":"Sorry katie but i think you are confused between who hillary is and who trump is cuz clearly he was the one interupting her on soo many questions and tring to intimidate her just like he does every other woman but thank goodness she is a strong woman and did not let him get to her lol","commenter_a":"Wow this just goes to prove that hillary is the better candidate hands down. She definately killed trump and i think he got angry and became soo defensive lol she was very prepared and he was not","post_message":"Donald J. Trump says he will release his tax returns when Hillary Clinton releases her deleted emails. @webpagelink"},{"comment_id":"10153608717341491","commenter_b":"You can't win when 74% of women hate you","commenter_a":"They're saying \"it's the beginning of the end of Donald Trump\" since the first quarter of 2015. It's the beginning of the end of USA.","post_message":"Elise Jordan writes that Donald Trump's treatment of women will destroy his chances of being elected"},{"comment_id":"10153782060807235","commenter_b":"i am embarrassed that this nasty little whore is from my home town. that is NOT the values we were taught in Newton, Massachusetts","commenter_a":"Imbecile!","post_message":"This makes me want to vomit..."},{"comment_id":"10154233484170496","commenter_b":"She's a smart woman","commenter_a":"At least she kept her yap shut","post_message":"What do you think of Lady Gaga's Super Bowl halftime performance?  PHOTOS: @webpagelink  (Photo by Patrick Smith/Getty Images)"},{"comment_id":"10154719986051130","commenter_b":"I'm a middle income American born and raised in America I paid Social Security and income taxes all my life I'm tired of supporting illegal immigrants and people freeloading from the US government on my nickel pretty soon the freeloading is going to stop","commenter_a":"Now I see a lot of ignorant uneducated and sick people talking about things that don't make any sense against the president when Donald Trump gets going you people that are on welfare illegally you people that get free handouts from the government illegally for you people the freeloading stops you're going to have to get a job and actually work for a living.","post_message":"WATCH LIVE: President Trump to speak in Melbourne. @webpagelink"},{"comment_id":"10153790527131336","commenter_b":"Coming in your town soon.","commenter_a":"Beyond stupid","post_message":"Critics have pointed out that the Obama administration has taken a different position when it comes to defending Christians' religious liberties."}]
