[{"comment_id":"10155498405191729","commenter_b":"That's where he belongs. Back stabbing ungrateful dodo.","commenter_a":"Eeek. What ticket would he be on? Dem?","post_message":"Interesting..."},{"comment_id":"426081280913499","commenter_b":"Kiss my ass!!","commenter_a":"Not Surprised, a fight to fight, no reason just out of control. Using excuses for what is being done. If you were really protesting over the treatment of the men and women injured and or killed, you would be ranting about this, not burning up a city, and hurting people.","post_message":"Such a racist sign..."},{"comment_id":"1007967755882148","commenter_b":"All parents need to step up and take charge like this mom. There would a lot less bs going on with teenagers these days.","commenter_a":"that it's mother style similar to CUBAN MOTHER BRAVO;MOTHER UNITED ja,ja,ja toma pelona qien lleve los pantalones a la hora de mandar.I ALWAY SAID TO MY SON THE DAY THAT YOU TRYING TO GOES OVER ME UNTIL THAT YOU GOES TO KNOW WHO IT'S YOUR MOTHER NEVER TRY","post_message":"Be sure to LIKE WND.com to stay connected!  @webpagelink"},{"comment_id":"10154219562119197","commenter_b":"Germaine Riley Another imbecile spewing really nice politically correct names, hey you .... smarten up !","commenter_a":"So very sad ! Obama should be impeached because he is not keeping us safe !","post_message":"We are continuing to follow updates on the deadly mass shooting at an Orlando nightclub. Here's Kevin P. Hogan WFSB with an update on what we know now."},{"comment_id":"10153615882695329","commenter_b":"Seriously. That woman should have said no or let's go home first. She's just as guilty! Time served smh. Bs","commenter_a":"And why is no one hating on the woman for this? MENISTS","post_message":"A Florida man was sentenced Monday to two and a half years in prison for having sex on a beach in front of other beachgoers, including children."},{"comment_id":"1079981378728005","commenter_b":"Sick Bitch","commenter_a":"She's an immigrant through and through!","post_message":"WOW. Just...Wow."},{"comment_id":"934978476568908","commenter_b":"Hahahahaha","commenter_a":"@username Jeff Smolen @username lmao","post_message":""}]
