[{"comment_id":"10152950800096770","commenter_b":"Why doesn't she talk about the women her husband has been with considering her looks I don't blame him.","commenter_a":"I'm offended by the fact she isn't behind bars yet.","post_message":"At a campaign stop in New Hampshire on Monday Hillary Clinton slammed Donald Trump's recent remarks about Fox News host Megyn Kelly as \"outrageous\" but said that other Republican men running for president have made equally \"offensive\" remarks."},{"comment_id":"10153109103456636","commenter_b":"Shut our doors and keep them out","commenter_a":"Am I the only one disgusted by negative comments here? there is a big difference between migrants and refugees? if that was your child? seriously? and the fact that 99% of migrants pay a hell of a lot into society? that doesn't count? unnaceptable - we need to be helping now.","post_message":"'David Cameron’s muted response to the crisis is disgraceful"},{"comment_id":"10153047000946336","commenter_b":"Send her to Iraq for a month.","commenter_a":"Yeah, that'll piss ya off !","post_message":"A social worker at an Indianapolis VA clinic was disciplined earlier this year after sending emails to colleagues that contained photos of an elf figurine posed to mock the mental health problems of combat veterans."},{"comment_id":"10153256299899726","commenter_b":"The bakers were physically raped by this couple","commenter_a":"We let people wear rags which scares me to be approached but this is silly","post_message":"WATCH: Lesbian Couple Accuses Christian Bakers of  Mental Rape"},{"comment_id":"10156497004350294","commenter_b":"Looks like we need to start banning vehicles. All of these vehicles just hitting and killing people is unacceptable!","commenter_a":"So sad... prayers for the families","post_message":"The woman and a man were crossing the street when a vehicle hit them. Anyone with more information is asked to step forward:"},{"comment_id":"1256741554345872","commenter_b":"Says the guy who looks like Peter griffin....","commenter_a":"So, liberals are proud of the filthy mouthed losers who interrupted good people coming to hear a speaker? Makes sense - birds of a feather flock together and liberals are losers. That is why people who seek to succeed hang around republicans and others who are successful.","post_message":"Watch Donald Trump get interrupted by protesters during his North Carolina rally on Friday. By the end of the night, Trump was heckled 10 different times.  Read full story: @webpagelink"},{"comment_id":"956845991041816","commenter_b":"Leave her alone she's a special breed of stupid.","commenter_a":"It looks like a bloody mosque take your baby piglets with you ,oh are animals allowed","post_message":"Mecca unveils world’s biggest hotel with 10,000 rooms."}]
