[{"comment_id":"967905263263639","commenter_b":"She needs to be in jail!","commenter_a":"No just you","post_message":"EPA Chief Reveals Her 'Trashy' Upbringing And What She's Sure All Families Did Pre-EPA [Video]"},{"comment_id":"701341166639263","commenter_b":"Did porky hamas say something. Shame","commenter_a":"(Eo) amaso ne estas felia pro Amnesty International.","post_message":"Hamas is NOT happy with Amnesty International"},{"comment_id":"10153177942114170","commenter_b":"Once a LIAR, always a LIAR! But what difference does it make at this point! Hillary is Obama in a skirt! Another Democrat that Bows to ISLAM and leaves Americans being attacked by Muslim Terrorists, TOO DIE!","commenter_a":"She should go to jail rather than the White House. Worst Secretary of State ever along with Obama the worst President ever.","post_message":"How stupid does she think we are?"},{"comment_id":"481351072068406","commenter_b":"Ah realy swear. Her tits were that big. gcl","commenter_a":"He and Hillary could murder someone in front of a hundred people and nothing would be done. They are despicable.","post_message":"Bill Clinton Breaks Massachusetts Law -  Now 60K+ People are Calling for His Arrest!"},{"comment_id":"10153391344478352","commenter_b":"Crazy mother sucker","commenter_a":"Oh boy! Here we go! Before it starts, dont blame nothing on Islam.They went blowing up people out of their own desires.Islam had nothing to do with it.","post_message":"Car-jacking victim of Boston bombers tells court how they admitted to terror attack, demanded GPS to get them to New York and played CDs of ‘religious music’"},{"comment_id":"10154028327039411","commenter_b":"Might have a heart... But she has no brains.... Sadly without that.. She is and 326683984410ard like you :)","commenter_a":"Punished for having a heart and a conscience.....","post_message":"'Military jail frightens me less than our society losing its humanity'"},{"comment_id":"1349219015129494","commenter_b":"Stfu","commenter_a":"Trumpers 2 days ago: yay Castro is dead! yuge win for free speech and human rights! CheetoJesus: citizens whom use their rights of free speech and ability to protest should be jailed or deported! Trumpers today: praise our Dear Leader! deport those commies!","post_message":"A fiery debate erupted over President-elect Donald J. Trump's proposed penalty for burning the American flag"}]
