[{"comment_id":"10154698288912178","commenter_b":"If anyone would like to help the family they do have a gofundme account .","commenter_a":"They did do a GREAT job...we were actually driving by when all this was happening.","post_message":"Emergency workers were able to rescue a dog trapped inside an Aberdeen home that caught fire this afternoon. Story>> wral.com/@username/"},{"comment_id":"10153264907976336","commenter_b":"The illegals are bleeding the system dry, plain and simple and then there's the government that doesn't give a crap about the poor because they largely do not see a reason to vote and therefore don't","commenter_a":"Yea and that will never happen. Illegal immigration will never completely stop as long as we have open borders and waterways","post_message":"In a Fox News Sunday exclusive, presidential candidate Marco Rubio says he still believes the U.S. needs immigration reform but it can’t be done “in one big piece of legislation.”  WATCH: @webpagelink"},{"comment_id":"10153040566066051","commenter_b":"WTF.. This bitch don't deserve to be a mom I'm glad they arrested her she needs to fry","commenter_a":"I should hope so!!!!","post_message":"Police took one look at this mom's Facebook photos and arrested her immediately."},{"comment_id":"10154801850791509","commenter_b":"Probably all the women appearing on TV to tout his brilliance.","commenter_a":"If relationships toward women was a deciding factor than Bill Clinton never would have been president. Bill had several women accused Bill Clinton of sexual attacks. How many women have accused Trump?","post_message":"Republican National Committee Chairman Reince Priebus says Donald J. Trump \"is going to have to answer for\" his behavior around women — but also says Trump's presidential campaign isn't being judged based on his personal life."},{"comment_id":"911808665590508","commenter_b":"Go home","commenter_a":"Ok send these people back where they came from.....F them!","post_message":"OUTRAGEOUS: MUSLIM Students At Public School Walk Out When NATIONAL ANTHEM Plays  Lets get 3000 SHARES if we should deport them!"},{"comment_id":"10154146066447623","commenter_b":"@username Im against this executive order because it wasnt thought out very well at all and is just a blanket order to block everyone that is a citizen of certain countries from getting into America, even if theyve been here for years and just happen to be out of the US at the time. Im all for protection, but Trump's actions are based on nothing but his ignorance and fear. That is no way to live and that is no way to run a country.","commenter_a":"If DHS doesn't support this, isn't that a sign that maybe it's not the right thing to be doing? I'm pretty sure they're not a liberal organization, so this isn't a partisan issue. If you're scared of terrorists, I get that. But wouldn't it be better to open your mind a little and try to understand why so many people are against this?","post_message":"The Department of Homeland Security said Saturday it has suspended all actions to implement President Donald Trump’s immigration order."},{"comment_id":"10153355238374411","commenter_b":"People who live in Palestine are Palestinians. People who live in Israel are Israelis. Most Israelis are immigrants.","commenter_a":"Israel may destroy the Gaza Strip but they will never destroy the Palestinian Spirt. Long Live Palestine!","post_message":"A new flotilla with humanitarian aid on board is going to help people in Gaza; the mission is beyond political polarization and in full compliance with international law, Osama Qashoo, member of the first flotilla to Gaza, told RT In The Now."}]
