[{"comment_id":"1734065923549548","commenter_b":"This is exactly why we shouldn't have zoo's . So that dumb mf could have been eaten. Probably would have fed a family of little lion cubs. Too bad it's a shame . Literally shot the lions for doing something completely natural smh","commenter_a":"I would have let him be eaten","post_message":"Poor lions :( Note: people suggesting that the keepers should have let the man be eaten will be banned. Mental illness is not a joke."},{"comment_id":"1202659629774507","commenter_b":"He should be impeached. If this neighborhood was all white they would have had clean water on day one","commenter_a":"Mr. Snyder you have not done your job so you must go. You looked pathetic.","post_message":"Why hasn't he been arrested?"},{"comment_id":"10154383747512908","commenter_b":"Pussy","commenter_a":"It will never stop. Americans absolutely love guns and violence. The NRA owns this country. I got my passport so I'm outta here.","post_message":"Mass shootings are becoming an almost-everyday occurrence in this country. This sickening and senseless gun violence must stop."},{"comment_id":"1581710041881753","commenter_b":"Maybe Madonna should offer the terrorists the same blowjobs that she offered for votes for Hillary!!!","commenter_a":"GO TO SYRIAand see what happens you stupid women","post_message":"Quite a national security position..."},{"comment_id":"10154031990961636","commenter_b":"Yusuf Saleh shut up","commenter_a":"It disturbs me that people have used the laughing response to this. Because domestic violence and child abuse (not to mention sheer ignorance and sexism) is just hilarious(!)","post_message":"He's on the run"},{"comment_id":"1452185328156583","commenter_b":"SLAVE OF AMERICANS","commenter_a":"Plastic materials","post_message":"Iran's Islamic Revolution Guards Corps Ground Force establishes an organization specializing in using drones in military operations."},{"comment_id":"10152949520761519","commenter_b":"FWIW: Jesse, I love your points of view. Over the years your passion and knowledge have helped me evolve my own perspectives on politics and the news. However, I respectfully disagree with your use of pejorative terms to describe women in this fashion. I think it is as much demeaning to you, and women at large, as it is to the targets of your invective. I respect your assertion of your right to use these terms, and you have articulated to me in the past why you choose to use them. I respectfully disagree with it.","commenter_a":"Those Fox News bitches really whore it up with the make up, don't they?","post_message":"\"You can’t separate fiscal issues from social issues...\""}]
