[{"comment_id":"486501341528450","commenter_b":"She's a skank. Thought she was going to leave the us if bush was elected. Leave the us bitch","commenter_a":"The fucking Libtards heads will explode when Trump gets elected. I will fucking LOVE IT!!!!","post_message":"You've GOT to see her characteristically snooty and elitist statement..."},{"comment_id":"403639093305500","commenter_b":"LEGAL IS THE WORD... What's a phony!","commenter_a":"Riding on the coattails of his dead son, he will burn in hell...","post_message":"Watch as the ACLU and Gold Star father Khizr Khan hold a news conference on President Trump's immigration ban.  Read more about Khan: @webpagelink"},{"comment_id":"10153301098933067","commenter_b":"Both ladies were very graceful","commenter_a":"Mr. Trump, you are really out of your ulo..... it was an honest mistake and it was acknowledged so, just move on..... better luck next time Miss Colombia... congratulations to all the contestants and the winners........ jmtc","post_message":"\"I'll tell you what I think I'd do. I think I'd make 'em a co-winner. It'd be very cool\" - Donald J. Trump @webpagelink"},{"comment_id":"472875716234055","commenter_b":"fk you brenda","commenter_a":"Idiots!!!!!!!!! disgraceful cannot wait till they are gone from the white house.","post_message":"I cannot believe they DID THIS on the same day! I am sick and tired of a president that doesn't care for our Marines and Veterans!"},{"comment_id":"1297864100266083","commenter_b":"She is yuck. Big mistake!","commenter_a":"Lmao!!","post_message":"Well.   OK."},{"comment_id":"10153196939420047","commenter_b":"Remove yourself from The United States of America. You Don'T America's Ways. LEAVE!!!","commenter_a":"It probably should be removed. Does a nation that promotes the murder of the unborn and celebrates a counterfeit\"marriage\" trust in the one, true God who has revealed Himself in Scripture? Nope. Meaningless words that don't impress the God of all creation at all. Repent and believe the Gospel.","post_message":"Avowed atheist Michael Newdow is at it again.  He's just filed a federal lawsuit demanding that \"In God We Trust\" be removed from U.S. currency.    We must remain vigilant in defending the Constitution from yet another assault on our religious heritage."},{"comment_id":"948553515267521","commenter_b":"Hillary is a big fat liar and she will never be president.","commenter_a":"Lol","post_message":"This team is the only thing left that can stop Donald Trump.  We’ve got to leave it all on the field here, and we need contributions from Facebook to reach our goal of 100,000 by midnight. Will you chip in? hrc.io/2d4999O"}]
