[{"comment_id":"1175628809124795","commenter_b":"Geena -_- those jerks","commenter_a":"Leave it to the u.s to ruin this cool idea!","post_message":"Why are people such assholes?!"},{"comment_id":"710336325799525","commenter_b":"U R A STUPID BITCH !!","commenter_a":"Yes she is a well educated lady. She puts family first and shows alot of class. She was a model you don't hear people caalling actresses names for their jobs. She also is a women who knows how to work hard , she understands the immigration system. She also understands the average needs of the normal everyday person.","post_message":"Will Melania Trump make a good First Lady?"},{"comment_id":"10154310503686519","commenter_b":"I'm sure the travel site is a very bad site and many people are saying that the site is bad, disgusting and their reviews are a disaster. Trump won't subscribe to the site until they say he is great and then the site will be good. But it's very sad now. His hotel is the greatest hotel and anyone who doesn't think so is a looooser.","commenter_a":"Banktrump International Hotels, get over it!!","post_message":"You have to read their review of Trump's hotel for yourself."},{"comment_id":"10150724585954999","commenter_b":"By all means, Madame, blame \"gentification\" for this vile behavior!","commenter_a":"So glad I was fortunate enough to have been able to move out of that place. Poverty, desperation, lack of global perspective, dread and hopelessness all dim the people's hope. Terrible place to live. For an uplifting story about this neighborhood check out HONY's series on Ms Lopez and her school there. So much work to be done, sadly the people who live there are the most marginalized people in NYC. Short of starting over, not sure what will happen to the poor in that city in the way it's going. These are the extreme sides of the coin of gentrification.","post_message":"The woman, 18, was walking with her father when 5 men approached them."},{"comment_id":"10153374957661051","commenter_b":"Of course, a common sense approach. All sales and transfers should be subject to a background check protocol. Keep up the rhetoric NRA, unless we see some common sense prevail among the gun lobby & gun nuts the eventual backlash is going to greatly affect responsible gun owners.","commenter_a":"To purchase any firearm there are already checks in place.","post_message":"Do you agree or disagree with America's police chiefs on this?"},{"comment_id":"10155686821610354","commenter_b":"Please were in Big Trouble if the ASSHOLE gets in. It's bad enough the ASS already in office is dismantling our Country little by little she'll just finish it off. Her and her asshole of a husband.","commenter_a":"She could have changed to state ID if she is no longer driving and that information should have come via letter","post_message":"Clinton said that she was fighting “for the grandmother who’s turned away from the polls because her driver’s license expired.”  If she didn't want it to expire, she could have driven once or twice since 1996..."},{"comment_id":"10154886702384166","commenter_b":"We got a little here in Honea Path :-)☃","commenter_a":"got some in pelzer, they are haveing a blast in it!!!","post_message":"Sort of an encore performance of snow over parts of the Upstate just before 7 AM. Folks in Anderson could very well get a quick dusting out of this. Let us know if you do! We're on for another 2-3 more hours on FOX Carolina. -Ben"}]
