[{"comment_id":"10153686388831320","commenter_b":"Disgusting these women","commenter_a":"I know it's o.k.-u know it's o.k.-get over it. body paint is o.k.- don't go if it's NOT o.k. w/u!- nuff said??","post_message":"Art or offensive? Women in nothing more than body paint and a thong are taking pictures with tourists in Times Square. How do you feel about what they do? @webpagelink"},{"comment_id":"10153974959029087","commenter_b":"@username I would be suprised if you cared.","commenter_a":"Funny to read some of the Trump supporters defenses that show they didn't read the article. First, the pictures weren't taken outside of the US, they were taken here. So the argument that they \"could have been taken outside of the country\" doesn't hold weight. Second, yes, models come here and do photoshoots \"all the time\", however, as the article states, there is a way to do it legally, and a way to do it illegally/fraudulently. From her own statements, it seems there might be a case where it was done wrong. And lastly, it does matter because Trump's platform is \"do it the right way, she did it the right way\", and if she didn't do it the right way, then it is yet another lie and makes them hypocrites. I realize she isn't running, but he is so he made this an issue. If this were the Michelle ...","post_message":"Melania Trump has said she first came to the United States in 1996 on a short-term visa, which wouldn't have allowed her to work as a model. But a recently published nude photo shoot shows that she was working in the country in 1995."},{"comment_id":"10153610090283598","commenter_b":"But everything is wrong with killing someone to gain at their expense!","commenter_a":"Wow. So you can't be \"successful\" without birth control? Women can't be successful if they become mothers? Women can't be successful unless they're childless? This modern feminist movement is ridiculous. It tells women they can't have a life if they have kids. True feminism teaches that women can do anything they set their minds to because they are strong and capable. And another thing, Miss Lawerence. You have access to condoms and birth control through many other outlets that do not kill innocent children for profit. It is delusional to believe otherwise.","post_message":"Hunger Games Actress Jennifer Lawrence: Thanks to Planned Parenthood I’m a Successful Woman"},{"comment_id":"1555989074419098","commenter_b":"We'd have have a democracy in the first place to lose. Seem that ideal is long gone","commenter_a":"This is a response to the hard tack to the left by progressives. This is the fruit of your insane policies and social engineering. You have created the potential for an authoritarian American government. It won't happen instantly, but in increments. I have to admit, I prefer this future to a nation that celebrates stomping upon our flag, allowing veterans to die waiting for medical treatment in favor of allotting medical benefits to illegal aliens, and referring to children as purple penguins.","post_message":"The frightening rise of authoritarian populism in the West is a very real, clear and present danger, writes Mike Lofgren, a former congressional staff member."},{"comment_id":"899557670234809","commenter_b":"This is the STUPID BITCH that just spent 8 years in the White House, what a piece of shit she is","commenter_a":"She has always been a JOKE","post_message":"He stepped to Michelle in a way she probably never thought anyone would.  Serious respect for this man. Let's get his back.  Let's get 3,000 'LIKES' for this soldier!"},{"comment_id":"10156372477690725","commenter_b":"Just another day of gun violence in America while populace is politically (incorrectly) correct. It is a crippled world, American leading the way as it is not in most other categories! Muslims are top o' the list for violence...they can't convert us, so their gut wish is to kill! Facts speak for themselves!","commenter_a":"Trump 2016","post_message":"CRIPPLED AMERICA is perfect gift for friends & family. Order signed copy & join me tonite live streaming 7:30."},{"comment_id":"1270088773057875","commenter_b":"@username cocain bottles and bitches *","commenter_a":"Let me get a 300$ tip in Christmas I'll spend that shit on cocaine and bitches","post_message":"Faith in humanity restored!  #WSHH"}]
