[{"comment_id":"1134902403269479","commenter_b":"If they think it's so needed, why hasn't it been in place to stop rape before?","commenter_a":".","post_message":"Things just got seriously DANGEROUS for trans students in North Carolina..."},{"comment_id":"830478970320859","commenter_b":"Send them all back to where they came from.","commenter_a":"Well Rush what about the Amish kids that started it in Ohio?","post_message":"Rush is right: Obama’s amnesty is a serious national security issue!"},{"comment_id":"10153521099233010","commenter_b":"save your water for your illegal aliens...smfh","commenter_a":"Typical republican: \"entitled\".","post_message":"More than a dozen times, a white truck filled up at a Thousand Oaks hydrant and hauled the water to Selleck’s 60-acre ranch in Westlake Village -- court documents allege."},{"comment_id":"10153507690103812","commenter_b":"They attack to eat. It's a risk of going into an ocean. Yet millions do multiple times yearly. Safely.","commenter_a":"I wish they could stop telling the lie... \"Sharks don attack humans\".... Yes they do!!","post_message":"UPDATE: Officials: Girl and boy may have lost parts of limbs in separate shark attacks on same stretch of NC beach: @webpagelink"},{"comment_id":"10154090778463822","commenter_b":"@username Ummmm So your a priest and admitting being a child molester? Sound like a real POS...Find someone of legal age","commenter_a":"Penn State fans must be proud to cheer for a POS coach that condoned child molestation and rape. \"We Are....Child Molesters\"","post_message":"As soon as Paterno’s familiar image – shirt and tie, thick glasses and rolled-up pants – appeared,fans erupted and kept cheering...  GAME RECAP: @webpagelink"},{"comment_id":"1238174809572379","commenter_b":"Con-woman!.....criminal.","commenter_a":"And you believe that both Pence and The Wall Street journal are saying the truth!! Pence is campaigning although, as an honest Republican, he'd better stay silence. And WSJ, I have not seen it but it sounds like somebody's opinion.","post_message":"Labor Day is a time to pause and honor the hard-working Americans who have built our nation's infrastructure, and powered our economy for generations."},{"comment_id":"10155376064740389","commenter_b":"She's needs to be prosecuted for breaking the law!","commenter_a":"OF COURSE..... She is a huge narcissist, just like Obama. I am thoroughly disgusted!!!","post_message":"The White House tried to push past the Hillary Clinton email controversy on Wednesday, with Press Secretary Josh Earnest telling reporters he's \"not particularly interested in\" discussing the issue.   Question of the Day: Do you believe the former secretary of state's explanation for using one email account for work and personal use?"}]
