[{"comment_id":"10154607123003984","commenter_b":"Get a fucking rope around that sorry bitch's fucking neck. Treason is punishable by the death penalty!","commenter_a":"So why aren't we hearing this on all the news channels? This is serious enough that it should be out there! Why are they even allowing her to run for President?","post_message":"Hillary has dodged this way and that on Benghazi, hoping her lies never caught up to her.  But they just did in a huge way.  A high-level, bombshell email was just uncovered by a watchdog group, and it PROVES beyond a doubt that she left those brave men to die in agony, knowing full-well she had a chance to save them. How sick."},{"comment_id":"10154144883178984","commenter_b":"I liked Cruz before he started his dirty campaign, now I have no respect for him","commenter_a":"Trump gets more coverage than anyone especially at Fox. People should take a look at Ted Cruzs resume and determine who is the presidential one. It is the most Impressive I hAve ever seen. He is a man of integrity with a brilliant mind. No skeletons in his closet. He is a true conservative who lives by the constitution. That is why he battles in Washington because he lives by what is correct. Look at all the cases he has won. He doesn't fit the mold of Harry Reid and company. He bucks them all the time. America needs him now and if we let him Slip by it will be our loss. There is absolutely no one running that can fill his shoes plus he is a born again Christian and he will restore our religious beliefs back to the country and constitutional rights","post_message":"Bill O'Reilly met with candidates right after last night's debate, and there was one thing Trump said to him that immediately caught people's attention...  Do you think Donald J. Trump has been treated unfairly by the media?"},{"comment_id":"479299448927302","commenter_b":"Americans mandate Islamic Terrorists be assasinated","commenter_a":"Fuck them shot them in that red dot in there head...","post_message":"New Texas curriculum tells students to refer to Islamic terrorists as 'freedom fighters'.  Spread the truth, let's put an end to this.  'LIKE' if referring to terrorists as 'freedom fighters' is WRONG!"},{"comment_id":"10152877015584071","commenter_b":"Yvon Fugère ton iPad et nos iPhones vont pouvoir avoir iOS 9. Ils l'ont fait beaucoup moins gros, il ne va prendre moins de 2g de place.","commenter_a":"Step 1: Get an Android Step 2: Get Cyanogenmod 11 Step 3: ???? Step 4: $$profit$$","post_message":"Is your device upgradeable?"},{"comment_id":"1127692307251779","commenter_b":"Fucking dumb bitch.","commenter_a":"Here we go again with the IFLS lies and propaganda","post_message":"The parents, who had chosen not to vaccinate their child, are “devastated” and have now had their younger daughter immunized as a result."},{"comment_id":"1349219015129494","commenter_b":"Stfu","commenter_a":"Trumpers 2 days ago: yay Castro is dead! yuge win for free speech and human rights! CheetoJesus: citizens whom use their rights of free speech and ability to protest should be jailed or deported! Trumpers today: praise our Dear Leader! deport those commies!","post_message":"A fiery debate erupted over President-elect Donald J. Trump's proposed penalty for burning the American flag"},{"comment_id":"10154332643707686","commenter_b":"According to a new Congressional Research Service report entitled Executive Authority to Exclude Aliens, the last 5 presidents have used executive authority to limit or restrict the entry of immigrants and non-immigrants into the U.S. a total of 43 times. Ironically, it appears that President Barack Obama used this authority more frequently than any of his predecessors, exercising it a total of 19 times during his two terms in office. Here's the breakdown of how many times each of the past five presidents issued such orders: Ronald Reagan - Five times George H. W Bush - One time Bill Clinton - 12 times George W. Bush - Six times Barack Obama - 19 times","commenter_a":"Waters, Polosi, Shummer, Warren and a whole bunch of other libtards need to be slapped up side thier heads.","post_message":"Rep. Maxine Waters:  \"I have not called for the impeachment (of President Donald Trump) yet. ...\""}]
