[{"comment_id":"10154051432298445","commenter_b":"Listen you little bitch ur just mad because","commenter_a":"Come on they just want to get paid like everyone else....shut the fuck up and give them their chop...before you end up paying an arm and a leg for mr.college degree but cant find a job in the field i studied for...to show up and try to charge u 30% of ur crop this is America only place they have buffets js","post_message":"#TBT to 2015. \"trimmigrants.\" had trouble finding work, created tension after arriving in Humboldt expecting trim jobs.   Humboldt friends - has the atmosphere changed?"},{"comment_id":"10155015262498690","commenter_b":"Yes why give the terrorists hope? As soon as Obomber gets out, terrorist support will weaken dramatically.","commenter_a":"If 9/11 deserves a moment of silence, than The #Syrians & #Palestinians deserve that we never speak again...","post_message":"Does Assad have enough manpower and weapons to protect the territory his forces have retaken while at the same time trying to win back more areas?"},{"comment_id":"764404957026018","commenter_b":"I support 100 percent bitch!","commenter_a":"I mean seriously if you support trump you're probably as stupid as a Clinton supporter","post_message":"Geez...what caused this?"},{"comment_id":"908658009268823","commenter_b":"@username still smarter than that orangutan! That orange menace!","commenter_a":"Hillary Clinton is a walking oxymoron... Innocent yet Guilty!","post_message":"Hillary Clinton rips into Donald J. Trump for his critique of retired four-star Gen. John Allen, saying it's unpresidential to \"insult and deride our generals.\" @webpagelink"},{"comment_id":"996887350366269","commenter_b":"Democratic Presidential Debate CLINTON vs SANDERS --- @webpagelink","commenter_a":"I drove 4.5 hours to Flint, Michigan, this week from Toronto, Canada, to volunteer my time on the @username campaign in the days leading up to the Michigan Primary. The people who work in Bernie's Flint office are passionate people with a strong desire to change America and help the people of Flint. I have actually never seen such an example of government neglect in my life. I spent a significant amount of time handing out water, door to door, and I still can't shake the feeling of being helpless - I felt helpless that I couldn't do anything to help them and I felt even more helpless that no one else was doing anything to help them either. I am not an American, but I know that America is better than this. No civilized society should allow hundreds of thousands of their own people to be neglected and abandoned ...","post_message":"The governor of Michigan must resign, but more importantly we must take action to help the people of Flint. Children in America should not be poisoned. The federal government must act. No one should pay a water bill for poisoned water. #DemDebate"},{"comment_id":"10154259788063797","commenter_b":"Omg lol","commenter_a":"@username looollllllll whaaatttt","post_message":"ATTN NEW PARENTS: The perfect solution to a crying infant is every parents dream. One doctor claims he has a technique that can quiet any baby.  WATCH THE FULL VIDEO: @webpagelink"},{"comment_id":"1048025435218467","commenter_b":"Lol I really do it's weird, this morning I saw white gold but then it changed and has been black n blue since haha!!!","commenter_a":"I see black and blue","post_message":"And no, it's not magic."}]
