[{"comment_id":"10155187473209614","commenter_b":"Your armpit makes me gag hahahhaha","commenter_a":"let them do their job.... and yes if you are on list ...GOOD BYE !!!!!!!!!! SUPPORT ICE FOR THE MAKING AMERICA GREAT AGAIN...","post_message":"Los Angeles' top elected officials cosigned a letter  urge in the strongest possible terms that ICE immediately cease this practice in our city.  Since the late 1970s, L.A. police have worked to build trust within the city large immigrant community so those in the country illegally can report crimes and offer information to police without fear of deportation."},{"comment_id":"10156390039050725","commenter_b":"That would be the best way to guarantee Hillary into the White House!","commenter_a":"I will!","post_message":"A new poll indicates that 68% of my supporters would vote for me if I departed the GOP & ran as an independent.   @webpagelink"},{"comment_id":"667325733458005","commenter_b":"Gloria I agree. Get their muslim butt back where they came from","commenter_a":"Muslims if you don't like the way America's are then leave. Clint Eastwood has every right to be artistic and make true movies about who you really are then leave AMERICA. We have freedoms you do not have so leave because we will not stop being Americans. The movie was very well done and true to the ooint.","post_message":"This angry Muslim group wants Clint's head, but he's not backing down.  He is a true American, and a real patriot.  Can we get 125,000 'LIKES' for Clint Eastwood?"},{"comment_id":"10153635830302061","commenter_b":"@username Wow.....you are a wicked mean nasty woman!!!","commenter_a":"It was a great dance to encompass her whole journey on the show, but in no way does it compare to Nyle's or Paige's.","post_message":"WATCH: Ginger Zee & Valentin Chmerkovskiy's take the dance floor by storm in last night's Contemporary Dance to a cover of Coldplay's \"Adventure of a Lifetime.\" Dancing with the Stars Season Finale continues TONIGHT!"},{"comment_id":"1213265855432501","commenter_b":"I quit watching long ago. Now I know why. Bunch of bitches!","commenter_a":"Why don't they just give it up... Everytime they say something bad about Trump their show loses viewers. I never watched them but if I came across it channel surfing I'd stop and see what was on... Now I will keep surfing.... And I'm sure I'm not the only one.","post_message":"Joy Behar of 'The View' just said Donald Trump will bring “mental illness” to the White House."},{"comment_id":"10150671719984999","commenter_b":"Any idea the amount of time it takes to pluck the gorilla hairs off her body and face?","commenter_a":"Exquisite and Gorgeous..","post_message":"Michelle Obama has often made a point of wearing gowns by designers whose backgrounds and cultures reflect the countries being honored at state dinners.  Friday night was no exception. @webpagelink  Photos, clockwise from top: Jim Watson/AFP — Getty Images; Mark Wilson/Getty Images; Luke Sharrett for NYT"},{"comment_id":"10154166607743352","commenter_b":"Jail needed for sex scum","commenter_a":"Troubled ladies-counseling needed.","post_message":"What sort of school IS this?! Geography teacher is now accused of lesbian affair with teenager after two colleagues 'had threesome with boy'"}]
