[{"comment_id":"10153381837831770","commenter_b":"SHES A PROFESSOR ==== HEY KIDS DONT GOT TO THAT SCHOOL SHE WENT TOO SCHOOL WITH OBAMA AN HILLERY,","commenter_a":"Ladies and gentlemen if you want to see the face of Satan then look at this woman see how she can lie like that and never change her facial expressions. This woman I believe is either a muslim or a muslim symphothiser where do these people come up with such outlandish lies like this. This woman should be locked up. Make her produce evidence of her accusations and if she cannot then Lock Her Up For Slander.","post_message":"A queer theory professor in the department of women’s and gender studies on the Rutgers University campus in New Brunswick, N.J. believes that Israel has plundered the internal organs of dead Muslims."},{"comment_id":"10154935119131753","commenter_b":"Ditch her now!!!!! She is the worst choice! All she has done is donate millions to the orange one!","commenter_a":"Senators McCain and Graham are probably already on his enemies list. Please do the right thing here!","post_message":"If a third Republican senator joins the opposition to DeVos, it may not only be unusual; it could be historic."},{"comment_id":"470849343105646","commenter_b":"LOL.","commenter_a":"Fucking faggots. Abomination","post_message":"Something amazing just happened for the bakers who refused a gay couple.  Good, we fully support their decision and stand by them.  Should they have been forced to bake for a gay wedding?"},{"comment_id":"1817582348453684","commenter_b":"Fuck me there is a lot of racist humans on this tread","commenter_a":"He should get custody","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"},{"comment_id":"875157552546363","commenter_b":"This is going to happen in every state these Illegas are in!!! Will there ever be a way to get them out of this country.. We need a great Wall of the United States just like the great wall of China!!","commenter_a":"who could have seen that coming? Not Obummer. He's got blinders on.","post_message":"Texas Man Murdered Execution-Style By An Illegal Immigrant Who Had Already Been Deported  @webpagelink"},{"comment_id":"10153032045224411","commenter_b":"Don't waste your time here Ana! The reason why some of these people have tunnel vision is because their heads are deeeep up the RACIST European and American governments ASSHOLES they can't turn their heads to see what is really happening on side...","commenter_a":"Sadly people are not intelligent enough to draw a line between a religion and extremism. Had these cartoons been about Jesus instead of Mohammed a crazy christian extremist could have done the same thing, but I doubt that would be followed by throwing grenade at a church.","post_message":"'I personally believe that the death penalty should exist in our legal arsenal.'"},{"comment_id":"10153480105418132","commenter_b":"Who gives a crap about her boobs. Let em hang out if she wants, or cover em up. They aren't your tits.","commenter_a":"Too much boobs","post_message":"What do you think of JWOWW's wedding gown?"}]
