[{"comment_id":"10155107547054258","commenter_b":"Crooked Donald! Lock him up!","commenter_a":"CNN stopped covering the rally and MSNBC with Greta from FOX ran the picture only but had a white House speaking on behalf of Trump. So, on TV we missed Warren , Bernie and others, Corporate controlled media. again ! Thank goodness for social media !","post_message":"WATCH LIVE: Democrats in Congress hold a protest at the Supreme Court against President Trump's immigration executive order."},{"comment_id":"10153326828766350","commenter_b":"Why would you call her a whore?","commenter_a":"Nobody cares!!!! Kardashians are talent less media whores!","post_message":"Kourtney Kardashian's response to critics? To just keep posting those pics!"},{"comment_id":"10153197145938721","commenter_b":"My Eulogy: @webpagelink","commenter_a":"Welcome HTML5 banners.","post_message":"With Google putting the brakes on Flash in Chromethe world most popular web browseradvertisers will need to seek other ways to get their messages out."},{"comment_id":"10153867352421756","commenter_b":"No, it actually wasn't. Students were allowed to carry. The fact that students were allowed to carry may explain how the shooter got to the classroom carrying a long gun without being stopped. He wasn't doing anything illegal until the second he opened fire. Surprise, everybody!","commenter_a":"survived the army to be shot in college, go america","post_message":"It's emerged that the 30-year-old father ran at the attacker, trying to block the door to a classroom to protect his classmates — and suffering several bullet wounds and two broken legs in the attempt, according to his family."},{"comment_id":"10154514668258701","commenter_b":"So, she thinks it's ok for POC to be racist. I see what she did there","commenter_a":"I don't understand why anyone would be upset by this, I mean hell, give this article a few hours and there will be plenty of examples of white hate towards POC in the comments, I see some already. I don't blame her for wanting to keep her room a safe place for herself and her roommate.","post_message":"\"I do not hate white people. That's not what I screamed in that post. What I screamed in that post was I am eagerly desperate to create a safe space on this campus in order for me to return and be successful here.\""},{"comment_id":"1027501837293064","commenter_b":"What a lying bitch , she tried to be the center if attention and it didn't work out for her. There is nobody left for her to blow, so she wants to quit. Awe.... poor little helpless girl who swallowed so much she is choking on it. Lol","commenter_a":"She brought it on herself","post_message":"Megyn Kelly has stunned her fans and Fox News with an announcement that changes everything.   She's put Fox in a VERY hard position and disappointed a lot of her fans."},{"comment_id":"1713989815484209","commenter_b":"The Senate's duty is to listen to its constituents. Therefore it should or should not act on this matter based on what they know we want.","commenter_a":"Oh how quickly Obama forgot that he filibustered the nomination of Supreme Court Justice Samuel Alito in 2006. Hypocrite!","post_message":"\"I have fulfilled my constitutional duty. Now it's time for the Senate to do theirs.\"   WATCH: President Barack Obama says if the Senate does not vote on SCOTUS nominee Merrick Garland, \"our democracy will ultimately suffer.\""}]
