[{"comment_id":"967810213254438","commenter_b":"Phony bitch","commenter_a":"Good new Ian you can now give blood from your arm instead of your B-hole. Joe Mark and @username can give you a ride","post_message":"There's still a lot of controversy around this."},{"comment_id":"1396465177113199","commenter_b":"Stfu Hilary won POPULAR vote.","commenter_a":"Cry baby losers. You can't say he's not your president and it be true. If you live in the USA he is your president. Keep throwing tantrums and rioting, destroying property, setting cars on fire. You are just going to make more people vote for him next time.","post_message":"Fear not!  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10155024301581600","commenter_b":"Yeah, what's a whinner?","commenter_a":"Proof we have become a nation of whiners.","post_message":"Tens of thousands packed into downtown."},{"comment_id":"519399201582629","commenter_b":"I hope one of hillary Clinton refugees knocks on your front door. . . You will probably be dead after that tho. . . She will continue to destroy this country and you want her to. . . Good job","commenter_a":"To bad his parents and Trump feed the poor kid lies. She has not been found guilty of anything and in this country you are innocent until proven guilty. You need to get of the Benghazi kick. The ambassador's family has come out and said it was not the State Department or Secretary Clintons fault. Grow up people. You would rather have a racists , hatred spewing, women hating asshole in office?","post_message":"BOOM!"},{"comment_id":"10152744813956094","commenter_b":"What is your alternative, Scott?? Just curious.","commenter_a":"Liz Warren is pissed off. Anyone who •isn't• pissed off, isn't paying attention!","post_message":"Yves Smith shreds the the Obama administration's rebuttal to Elizabeth Warren's critiques of the secret trade panels proposed in the TPP and TTIP treaties."},{"comment_id":"10153059830708984","commenter_b":"F--k her, no I wouldn't","commenter_a":"Are you kidding?","post_message":"I can tell you right off the bat that I WON'T be participating in this. But I am not surprised to see this from Dems. Every chance they get..."},{"comment_id":"10155797026705354","commenter_b":"To someone above, I wash my own car. More Americans are growing their own gardens. I rarely go to hotels. Their whole argument is false though because we have had immigrant worker programs for decades. Obama is intentionally flooding the country with illegals. Read about George Soros and his open border group. The man is evil.","commenter_a":"We are the force that keeps the country afloat.\" is she for reals? we were floating right along wa before illegals came along.","post_message":"\"Mexicans, like all Latinos, contribute positively to this great nation. We are the force that keeps the country afloat.\""}]
