[{"comment_id":"895490467164248","commenter_b":"Married women have abortions too !","commenter_a":"Pro choice is about a woman's right to screw like a whore without any consequences. That's the reason Obama wants it for his kids.","post_message":"Do you agree?"},{"comment_id":"10153108326524197","commenter_b":"So sad just terrible how ppl are raising bullies and don't see anything wrong with it just so saf","commenter_a":"oh dear god what's wrong with these kids disgusting","post_message":"This girl died as a result of bullying, according to her mother. She said the reason her daughter took her own life extended beyond the walls her classroom: @webpagelink"},{"comment_id":"497111050479475","commenter_b":"She's a sellout to her own race, taking everything that white people gave her, and then spews her racist anti white nonsense to make blacks think she actually cares about them.","commenter_a":"She described racism other countries not ours.","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy.  She's the biggest racist we know, and we won't stand for it.  Do you agree Oprah is racist?"},{"comment_id":"10153991285739091","commenter_b":"How is he disrespecting the vets? I'm confused","commenter_a":"Think of all the people fighting for our country show a little respect 🇺🇸","post_message":"San Francisco 49ers quarterback Colin Kaepernick plans to take his peaceful protest against racial injustice and police brutality \"a step further.\" He says he will donate $1 million to help in the effort."},{"comment_id":"10156674955065354","commenter_b":"Win by selling out our principles ? No way .","commenter_a":"Trumps campaign has been a wrecking ball for the conservative movement . Fox News was once our most dependable news outlet , it wasn't perfect . National Review use to be a respected magazine for conservative ideas , now there being attacked . Good conservative candidates such as Rand Paul , Rick Perry , Ted Cruz all now being attacked not by the liberals but by the GOP front runner . Good job trump you did more damage to the conservative movement than the liberals ever could","post_message":"***What happened to Fox News?***  “What would a conservative network be doing giving time to Michael Moore? Why would New York Times and Washington Post reporters be on the air to give opinions on a conservative network?” Limbaugh asked. “This is what peope are saying out there.\""},{"comment_id":"10153694890631323","commenter_b":"What are black women always the ones who show so much ignorance","commenter_a":"If they aren't defined by it than why change your sex medically? Come on","post_message":"They could have made something positive, but the new Channel 4 series Girls to Men is demeaning to trans people on so many levels: \"Greater visibility for trans people should not mean even more close-up shots of genitalia and 'Ooh, don’t they look different – almost like real men' montages. It should be about taking the focus off surgery, suffering and sensation, because a transgender man is not defined by those things any more than the next person\""},{"comment_id":"433011990220428","commenter_b":"good hope the NIGGER DIES","commenter_a":"I likt being mean but he hevhe i loveĉit","post_message":"Will he be able to finish his second term?"}]
