[{"comment_id":"763776567072060","commenter_b":"F**k em both... Let's \"take em out\" ....","commenter_a":"Anyone who couldn't see this before is blind. Those two have always been allies.","post_message":""},{"comment_id":"1857318871171795","commenter_b":"DRAIN THE SWAMP!! TRUMP/ PENCE 2016","commenter_a":"Thank you for making this so much easier to understand and for opening eyes as to what is really at stake!","post_message":"Clinton pay for play speeches. Understanding how it all works, and who gets paid for what -- all the favors --- and why she wants so many refugees.  Please watch and share.  If you are new to DML please give him a LIKE.  You won't regret it."},{"comment_id":"10153918946326162","commenter_b":"Calling a 15 year old young lady a hoe Definitely shows your maturity level.","commenter_a":"Dear 15yr old girl, you put yourself in that position. Those are the risks of taking nude pics. SUCK IT UP, HOE.","post_message":"EXCLUSIVE: A Bolingbrook High School student says nude pics of her were posted online as retaliation for fight. @webpagelink"},{"comment_id":"667207133381416","commenter_b":"She should be fired!!","commenter_a":"Should absolutely be fired!!! This is a prime example of how sad our society is!!!","post_message":"VA Manager Thinks Veteran Suicide Is Funny, Here is Her INFURIATING Email Read more at @webpagelink"},{"comment_id":"10153855338620047","commenter_b":"Nothing will happen to any of this mafia, unless Trump is elected. I hope everyone saw the video on TV, where Obama actually told an illegal to vote tomorrow and to tell her friends it was OK for illegals to vote. It is simply a TAKE OVER OF AMERICA!!!! It is a WAR by ballot!!!! Wake up Americans because if we lose tomorrow, we lose America!","commenter_a":"Prosecution","post_message":"Sign and Share our urgent petition to demand the Attorney General's immediate resignation for breaking the sacred trust of the American people."},{"comment_id":"10154885483751037","commenter_b":"Ugly nacty women","commenter_a":"Rachel Rauth","post_message":"Sen. Elizabeth Warren has a message for Mitt Romney."},{"comment_id":"523635814493665","commenter_b":"Give the lady her job back, NOW!!!!!!","commenter_a":"Too bad- Boo Hoo Hoo","post_message":"A lunch lady was fired for serving pork to a Muslim student.  We are in America, give that poor lady her job back.  Do you agree Muslims have to Assimilate if they want to stay?"}]
