[{"comment_id":"1642358432731311","commenter_b":"She was queen to Obammy's King. Both suck!","commenter_a":"This dumb bitch needs to shut the fuck up!","post_message":"Do you think Oprah is a bigot?"},{"comment_id":"10153394285461336","commenter_b":"We love them white girls","commenter_a":"All you Mexican ' s love Mexico so much why did you leave ???","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"1562278293792195","commenter_b":"Hillary for PRISON !!!","commenter_a":"Deplorable in fl","post_message":"Join Chris Jansing at the polls from the key battleground state of Ohio Live! Full coverage all day: @webpagelink"},{"comment_id":"10154898999434705","commenter_b":"Michael MacLeod are you kidding? Who says they are not. They have the most amount of refugees.","commenter_a":"Snowflakes and Hollywood dummies....read the executive order....no mention of Muslims any where. Still trying to figure out how so many of you could support muslims...they have no respect for women, queers, children, Christians and idiots like you.","post_message":"Helberg and wife Jocelyn Towne sent a clear message to Donald J. Trump."},{"comment_id":"1061799393879808","commenter_b":"Poor woman","commenter_a":"Mandy O'Loughlin","post_message":"They ripped most of one woman's scalp off in a horrific 30-minute 'feeding frenzy'"},{"comment_id":"10154312691707577","commenter_b":"Only cowards suck on another cowards goat dick the system been broken since mr queer got in office the fact that our government already let the enemies in our country soon there will be more of this false flag shootings","commenter_a":"According to Breitart...the Orlando shooter worked as a security guard for a company, G4S who has a contract with Homeland Security to pick up illegal aliens at the border & transport them inland & just release them. No legal repurcussions nothing. Obama's policies are very sinister & treasonous. And why has nobody done anything?!","post_message":"The brother-in-law of nightclub jihadist Omar Mateen hates Donald Trump, works with refugees, and liked a video on YouTube that argued Islam isn’t violent, according to his social media profiles."},{"comment_id":"10154184245291943","commenter_b":"This evil woman needs to fall, through what ever means necessary.","commenter_a":"Oh quit messing with us. Either do it or s t f u!!!","post_message":"With 75 days before voters pick their new president, email revelations are threatening to overtake Hillary Clinton campaign  with WikiLeaks founder Julian Assange hurling another log on an already raging fire with a vow to release  Clinton documents.  In an exclusive interview Wednesday night with Fox News Megyn Kelly, Assange was asked whether new information culled from Clinton emails would be released before the general election: \"Yes, absolutely.  - via Fox News"}]
