[{"comment_id":"1076528565795194","commenter_b":"Let's see ... when he said, \"yes she broke the law, but we don't think it rises to the level of prosecution... \" everyone was happy. Now something changed that ... something explosive enough to convince someone who supported and did everything to protect Hillary ... that \"something\" is enough for me to say I CAN'T TRUST HER! WHERE THERE'S SMOKE... THERE'S A FLIPIN' INFERNO!","commenter_a":"www.mostdamagingwikileaks.com","post_message":""},{"comment_id":"10154330799961756","commenter_b":"Not true she's probably going to make more blackmailing than having sex eventually","commenter_a":"Why do you do this, it will never go away, it is a fact of our lives. Make it legal, tax it and provide health regulations~","post_message":"Clients will be fined about $1,700 for the first offense."},{"comment_id":"10153638805358598","commenter_b":"Abortion is NOT legal!","commenter_a":"just go above the supreme court and ban all abortions.","post_message":"BREAKING NEWS: Supreme Court Won’t Let North Dakota Ban Abortions on Unborn Babies After 6 Weeks"},{"comment_id":"10153239579440329","commenter_b":"Bitches be trippin'","commenter_a":"@username @username Cayla Ray hmmm I don't know anyone like this","post_message":"That One Co-worker who gets weird when people touch their stuff."},{"comment_id":"10154379213963812","commenter_b":"Go back to Europe. Lol","commenter_a":"Go TRUMP build the wal!! Deport illegal all of em Ban muslims Lets make america great again! !!","post_message":"Donald J. Trump announced on Good Morning America that he \"probably will take small contributions.\""},{"comment_id":"10155247657250294","commenter_b":"Flush her down the toilet","commenter_a":"So very sad.","post_message":"When she was told she couldn't board the plane, police say a Florida woman did the unthinkable."},{"comment_id":"10154474961664062","commenter_b":"And please don't be a coward and read my msg and don't reply...I wanna know your comeback and actually be real about it...","commenter_a":"I'm sure it was taken out of context by the biased media","post_message":"\"You've got to see this guy.\" He then ridiculed Kovaleski's appearance by bending his wrists and jerking his arms around."}]
