[{"comment_id":"10153070666326336","commenter_b":"Kill all the non believers Haider? That's killing innocents!!!","commenter_a":"if anyone believes Iran will not pursue nuclear power they are delusional...they are playing the obama admin the same as every politician before.","post_message":"\"It is necessary that the stance of the U.S. administration be defined about this move.” - Iranian Foreign Minister Javad Zarif"},{"comment_id":"1260170427412540","commenter_b":"Rudy Giuliani, just said, before president Obama there was no successful terrorist attack on America. I loved it! these so-called educated white men show their stupidity, every time they open their mouths, he just spit and pissed on the graves of all the 911 victims! , it happened not once, but twice in New York (terrorist attacks), and how could sun-bleached bleached Donald Trump care about the veterans when he said he doesn't like the ones that got captured? And before running for president he has never! donated to any veterans organization, but he's going to take care of the veterans and loved the veterans, he's a real sleaze ball!","commenter_a":"We got nothing","post_message":"Is Donald J. Trump likely to double-down on his proposed immigration ban?"},{"comment_id":"974047066004855","commenter_b":"These tanks could easily create the blast heard around the world. Should that take place, this nation will erupt in a revolution unseen for hundreds of years. The resident of the white house should have his escape plan worked out because We the People will coming to evict him and his whole family .....and his mother in law too......!!!!","commenter_a":"Be afraid, be VERY afraid!!!!!","post_message":"FBI ON ALERT: Theft of dozens of propane tanks, purchase of 150 prepaid cell phones  [READ MORE]"},{"comment_id":"1167878733267392","commenter_b":"Just a worthless pos","commenter_a":"What a loser","post_message":"Unbelievable! Michael Moore is now calling on liberals to disrupt and shut down Trump's inauguration. @webpagelink"},{"comment_id":"932260496814809","commenter_b":"You believe and listen to the \"man hating\" feminists which aren't a legitimate example of the feminist movement.","commenter_a":"Thank you. It's time the \"real\" (for lack of a better term) feminists become the majority over the \"man-hating\" feminists.","post_message":"It's so misunderstood, but they clear it up — by using the word 32 times. - Rebecca Eisenberg"},{"comment_id":"1003724273013669","commenter_b":"This woman is dumber than a box of rocks!","commenter_a":"freaking nut case!","post_message":"Dems know where to get their votes..."},{"comment_id":"1292853950724756","commenter_b":"Or marry him, or bear his children, or even be in the same room with him. Not worth any amount of money could buy a smart woman.","commenter_a":"Always a lady with class, dignity and honesty.","post_message":"She's absolutely right."}]
