[{"comment_id":"10153372677575950","commenter_b":"And Kaye Townsend you are an example of an ignorant Bitch","commenter_a":"Screw going to the hospital to better anymore. Lets post getting shot and see how many likes i get","post_message":"Shortly after being shot in her car, a woman turned to Facebook to send a video message to loved ones: \"Mama I'm bleeding. I know they shot me but it's good. It's good.\""},{"comment_id":"1639044993063408","commenter_b":"Hahahaha english language correctly? Hahahahahahahahaha english language accurately yiu filthy Camel Cunt. India will rape your mother and your sisters till kingdom come. We will shove the Quran up your mom's asshole and tear it open page by page. When yiu stick yiur forehead on the ground and say allahu fuckbur your mom will moan with pleasure coz her vagina will be stuck to your forehead. Go fuck a camel you cunt l.","commenter_a":"Arabs will and have never won against Israel. If I were Arab I'd get on me camel and hoot into the unknown if me desert shit hole.","post_message":"LIVE: Netanyahu responds to Kerry speech on Middle East"},{"comment_id":"10156058811190594","commenter_b":"Well maybe he tried to grab on one of their chicks or tried to take some out of pocket cheap swing prior to the film rolling. What does your sister's job have to do with the surrounding facts?","commenter_a":"I'd like to know the surrounding circumstances before passing judgment. Who knows maybe the Vikings fan said or did something to provoke the attack.","post_message":"Brutal fan brawl horrifies onlookers after 49ers game"},{"comment_id":"1236747943048399","commenter_b":"#NeverEverHillary #CrookedHillary #LockHerUp","commenter_a":"I can't believe the uneven coverage you get. Trump lies daily and people don't care. You don't even have to do anything wrong and the republicans and media blow it out of proportion.","post_message":""},{"comment_id":"10153489644226680","commenter_b":"@username Hillary 2016!","commenter_a":"I support Bernie but, in a democracy you don't always win. Clinton's big victory in NY is not the result of some sort of conspiracy. It is a result of counting the votes. I am not one of the \"Bernie or Bust\" people. Trump/Cruz are too dangerous to advocate some sort of 3d party campaign where Bernie is the candidate. When Ralph Nader took votes away from Al Gore, it resulted in George W. I do not want a rerun of that movie. I am not happy about how the race seems to have ended, but, Hillary got more votes than Bernie and that ends it.","post_message":"Hillary Clinton gets emotional telling the story of Sandy Hook Elementary principal Dawn Hochsprung, whose daughter is at the victory rally."},{"comment_id":"10153380056966770","commenter_b":"Get rid of Obamacare and the illegal aliens!","commenter_a":"I so despise Hillary Clinton. Why don't they indict her already.","post_message":"Hillary Clinton wants to use Obamacare to provide health coverage for illegal immigrants."},{"comment_id":"10154166607743352","commenter_b":"Jail needed for sex scum","commenter_a":"Troubled ladies-counseling needed.","post_message":"What sort of school IS this?! Geography teacher is now accused of lesbian affair with teenager after two colleagues 'had threesome with boy'"}]
