[{"comment_id":"633829223459429","commenter_b":"Stupid stupid girl , the more she talks the dumber she is .","commenter_a":"Do they have no parents","post_message":"From American AF - AAF Nation...This is what's wrong with society TODAY!!"},{"comment_id":"10152923308511130","commenter_b":"Women lie about is ALL of the time, right?","commenter_a":"Imagine if women didn't falsely accuse men of rape because a man \"upset her\". (It happens ALL of the time.......) Maybe more men would reach out. Instead, modern feminists slam men daily then expect to be worshipped?","post_message":"Powerful."},{"comment_id":"943824045713848","commenter_b":"It´s not a coincidence why Jeb Bush started his campaign in Miami...All his Cuban friends were drug dealers as Leonardo Martínez; money launderers as Armando Codina; Medicare swindlers as Jose Miguel Recarey; dangerous terrorists as Luis Posada Carriles and Orlando Bosch....... and every Cuban corrupt politician of Miami. When Jeb Bush signed the law forbidding to give the Driver License to illegal people in 2005 (he was the first governor to do it), he wanted to push the deportation of millions of illegal NON Cubans from Florida, who could not continue driving and give their jobs to millions of Cubans rafters newcomers. Bush never thought in unemployed veterans or other US citizens. He only has Cubans in his agenda.","commenter_a":"He will lead this country to a war in the sand...and your children will be buried there.....","post_message":"How a group of hecklers forced Jeb Bush to go off script and talk about immigration."},{"comment_id":"10152956831331130","commenter_b":"Wow... talk about a student taking the teachers to school.","commenter_a":"Her parents really wrote a good speech.","post_message":"Somebody give this little girl a medal!"},{"comment_id":"10154310515973822","commenter_b":"she clearly states on her wbsite that money not used will go o her pay for future campaign #JillSteinScam","commenter_a":"What's Jill gonna do with all that cash? No refunds, no exchanges, all donations final.","post_message":"JUST IN: The Green Party is dropping its court case seeking a recount of Pennsylvania's Nov. 8 presidential election."},{"comment_id":"928454370547645","commenter_b":"Because only girls can get raped","commenter_a":"I am so glad that I don't have a daughter. I'd be terrified for her in this world we live in. Heartbreaking.","post_message":"'The most disgusting, sickening' gang rape at Spring Break beach party"},{"comment_id":"10153256299899726","commenter_b":"The bakers were physically raped by this couple","commenter_a":"We let people wear rags which scares me to be approached but this is silly","post_message":"WATCH: Lesbian Couple Accuses Christian Bakers of  Mental Rape"}]
