[{"comment_id":"10153540589586323","commenter_b":"Oh my god did you even read the article!! The number ending up at Calais is miniscule, the article also states most don't even know about our benefit system so maybe we left behind a massive impression after colonising half the world they figure we are the country they admire or can relate to, to be honest i don't care, if its they live or die then they should live here","commenter_a":"Those people in calais are not true refugees or asylum seekers, if they where, they would claim fir asylum in france. EU law says that they should claim asylum in the first safe country they arrive in. Last time I checked, france is a safe country, so is spain, italy, germany, and many other eu countries. What I don't understand is why there are over 5,000 of these so called asylum seekers camping in calais trying to get into the uk. If you are a genuine asylum seeker, you don't get to pick and choose where you want to live.","post_message":"When you’re facing the world’s biggest refugee crisis since the second world war, it helps to have a sober debate about how to respond. But to do that, you need facts and data – two things that the British migration debate has lacked this summer.  These, in the clearest terms, are the 10 key facts."},{"comment_id":"1812875395612222","commenter_b":"@username......................your a @&$)(:; fool","commenter_a":"Such a BS! Obama made a deal to stop nuclear proliferation. Iran's compliance with our demands lifted the sanctions. So they got THEIR money. Eric Trump is total idiot thinking he knows anything about this matter.","post_message":"\"[President Obama] lied about it. He said that it wasn't ransom money... No different than when he lied about ObamaCare.\"  Yesterday on \"Sunday Morning Futures,\" Eric Trump accused President Obama and Hillary Clinton of lying to the American people."},{"comment_id":"10152943603067217","commenter_b":"Mosks should be destroyed first","commenter_a":"The earthquakes should destroy only churches.","post_message":"New Zealand's Christchurch was struck by a devastating earthquake in 2011"},{"comment_id":"948831575172245","commenter_b":"Women see active duty don't they?","commenter_a":"Isn't he a FELON? Can he even vote?","post_message":"T.I. reveals a woman will not earn his vote in the 2016 presidential election because \"women make rash decisions.\" And he thinks \"you might be able to the Lochness Monster elected before you could [get a woman].”  Apparently, the rash decisions of male leaders did not result in broken levees in New Orleans, a trillion-dollar deficit due to decades-old wars, and a huge gun control problem that results in mass shootings almost weekly.  Amid major backlash, T.I., issued an apology for his sexist comments. MORE ----> @webpagelink"},{"comment_id":"926192544193565","commenter_b":"TO BAD THEY HAVE TO CHANT THAT!!! IF LEGAL SYSTEM HAD DONE THEIR JOB,SHE WOULD ALREADY BE IN ORANGE!!!!!!!!!!","commenter_a":"Apparently Kate Bolduan is the only one left that dosen't know what is PAINFULLY OBVIOUS...\"Slick Willie\" either bought out Lorett Lynch or threatened her with death in that plane meeting and Obama threatened Comey with his job and political future...Her problem is that she thinks we're all as dumb as her...smh","post_message":"CNN anchor Kate Bolduan whined about the \"lock her up\" chants directed at Hillary Clinton during the Republican National Convention on Wednesday while expressing doubt that it was the right \"message.\""},{"comment_id":"10153209729066051","commenter_b":"I am a woman but if you not respect the man, specially on from of so many people, how do you spec, he is going to do. My friend you said what you WANT sorry you heard what you DESERVE.","commenter_a":"He has the right to his opinion and here we go again with Kelly, supposedly a conservative, telling someone that they don't have a right to say what they think. War on women, isn't that a liberal jab or stab...you bet it is. Keep talking Mr. Trump and you may win my vote, too!","post_message":"Donald Trump just got banned from a GOP Presidential debate because of this comment about Megyn Kelly."},{"comment_id":"1264285906955844","commenter_b":"Agree public should not enable bad behavior from 15 year old kid.","commenter_a":"She ain't no child, she wanted act grown, so she got treated likes she grown. Please don't sympathize with her, you are only enforcing the behavior that she is a \"child\" and she can get away with anything.","post_message":"\"The juvenile had to be detained.\""}]
