[{"comment_id":"1113200062092053","commenter_b":"Hillary is the bigger liar and has laundered millions for her own use through the Clinton Foundation. At least Donald actually worked for his money. She is a murderous also. Her stint as Secretary of State and her private e-mail server has put us in great danger from our enemies. If you plan to vote for Hillary raise your right hand and slap yourself in the face!","commenter_a":"I really like you Dr Carson but if this is true why do you support TRUMP, who lies, has no common sense and won't release his tax returns. He's hiding a lot and we all know it.","post_message":"People all over the nation are starved for honesty and common sense."},{"comment_id":"10153646092561167","commenter_b":"Liberals hate women!!!","commenter_a":"If Megyn Kelly didn't have her looks and her little fued with the Donald to capitalize on she'd be a non issue.","post_message":"Can everyone finally stop pretending Megyn Kelly is any kind of “hard-hitting journalist”?"},{"comment_id":"743858605712748","commenter_b":"I know another PENNY ,and she is worth much more that as a friend !","commenter_a":"Good grief!! And people say pennies are worthless.","post_message":"Are they nuts?"},{"comment_id":"10154375635804342","commenter_b":"@username oye pendeja....white girl....give it a rest!","commenter_a":"As long as Trump doesn't show up, I don't see the problem. He can't help who supports him, just like Hillary can't help that all her supporters are cry babies.","post_message":"One of the largest Ku Klux Klan groups in America plans to celebrate Donald Trump's election with a parade."},{"comment_id":"10154385949804087","commenter_b":"@username I think he ran away like a little bitch","commenter_a":"If all you ding-bat liberals would have acted like mature adults, all the EXTRA security wouldn't be needed and costs would have been much less. But no, you all ad to act like psychotic juveniles so this is what you get.","post_message":"The New York Police Department is blasting Republicans in Congress for refusing to cover costs to protect Trump."},{"comment_id":"939447022776130","commenter_b":"1 Muslim + 4 wives = 32 children!!","commenter_a":"Our country has so many homeless families and so of these people would be so grateful to be able to benefit from a number of these programs, and not not offered to them. If we have the housing and benefits for foreign refugees than we have the resources to help our own citizens first. And the positive side to this, we won't have to worry about any of these people killing other Americans","post_message":"Michigan Gov Snyder, Senator Peters And CAIR Pushing For Huge Influx Of Muslim Migrants...Don't The People Have A Choice?"},{"comment_id":"10153348953162217","commenter_b":"I saw a mother the other day getting into her car with her pjs, slippers and a cup of tea/coffee. I would be so embarrassed to take my kids to school like that.","commenter_a":"It's really difficult to put a top and jeans on. Come on it's 2016 😉","post_message":"\"There has been an increasing tendency for parents to escort children while still wearing their pyjamas and, on occasion, even slippers.\""}]
