[{"comment_id":"470911213097172","commenter_b":"Muslims offend me, so I want Muslims banned from America.","commenter_a":"Your face being covered offends me.","post_message":""},{"comment_id":"10156336306105354","commenter_b":"She has pretty skin like a white woman, she talks like a low- information angry blue-gum.","commenter_a":"Melissa Harris Perry should be worried about her ideology. She's in the minority.","post_message":"Melissa Harris-Perry: You know what Americans worry about? They worry about their kids and families being terrorized, raped, robbed, and murdered by criminal illegal aliens--people who should have never been in our country in the first place. THAT is what Americans worry about."},{"comment_id":"542951289163244","commenter_b":"That cunt, is one letter away from ruining my name!","commenter_a":"This whole thing just happens at the EXACT SAME TIME OBAMA ANNOUNCES ILLEGAL EXECUTIVE GUN CONTROL ORDERS! This was a set up to drum up support from the sheep for this gun control garbage that will circumvent or HIPPA privacy. I for one feel that the government shouldn't have access to anyones medical records to see if they are crazy by THEIR STANDARDS, which are pretty fucked in the first place... I do not trust the most narcissistic, psychotic, murderous people in our country to choose who gets to protect themselves and the rest of us. This whole thing is under the guise of mentally ill not being armed. People that have guns will now redusr to get treatment they may need for fewer of the government coming and taking their guns by force. anyone that has EVER had treatment will loose their guns by a man with a gun ...","post_message":"So much for taking on the tyrannical federal government, ehh?"},{"comment_id":"10153372404416509","commenter_b":"We gays.","commenter_a":"Its so surprising how everyone calls on God for a miracle yet america is a homosexual country that dont obey God....","post_message":"Almost three weeks after she was found unresponsive in a bathtub, Bobbi Kristina Brown is still fighting for her life. @webpagelink"},{"comment_id":"983326201715214","commenter_b":"his momma owes him a butt whooping is all... since he probably got no daddy","commenter_a":"Send him back to Africa and let him live the life he would have had if his ancestors would have stayed there","post_message":"Check out the CRAP this clown is spewing. His 2nd statement really has peeps FUMING."},{"comment_id":"913998228643418","commenter_b":"As if inflation isn't a tax increase unto itself. Total money grubbers...","commenter_a":"The present gas tax money, originally intended to maintain or build our roads is not being used exclusively for that purpose. If it was we'd know exactly how much money we need to do this job","post_message":"The nation’s gas tax will be raised to 30 cents per gallon and increase at pace with inflation if a bipartisan group of House lawmakers get their way in seeking funding for a new transportation bill. @webpagelink"},{"comment_id":"10153694851768352","commenter_b":"A black woman wouldn't marry him because she doesn't want ugly kids! With his Ugly self....","commenter_a":"Trust me we won't! LOL ha ha ha #ugly","post_message":"‘I’m not a racist – but I wouldn’t marry a black woman, I want my children to look like me,’ says ‘white supremacist’ accused of inspiring Dylann Roof’s murder spree"}]
