[{"comment_id":"10152829725821051","commenter_b":"if she shop lifts why isn't' the bitch in jail","commenter_a":"You mean she isn't stealing now?","post_message":"This shoplifter has never had a job. She current lives in rent-free housing and receives monthly benefits. She says if her benefits aren't raised, she'll go back to stealing."},{"comment_id":"1763482420575354","commenter_b":"@username your savor is going back on his own immigration stance. He was so bold at first, but now he's retreating lol. #typicalChump","commenter_a":"\"Today in his Mexico press conference, Donald Trump lied about discussing how to pay for his wall with the Mexican president. Trump has boasted for months that he is going to get Mexico to pay for his ridiculous wall but when he came face to face with the Mexican president he got out maneuvered and then tried to cover it up on worldwide TV. Simply put, Donald got rolled. It turns out Trump didn just choke, he got beat in the room and lied about it.\"","post_message":"Hillary Clinton didn't go to Louisiana, and now she didn't go to Mexico. She doesn't have the drive or stamina to MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153252381712016","commenter_b":"Don't speak for young women. You aren't one.","commenter_a":"Young women see through Hillary..she put up with a cheat for a husband as a ticket to the WH...thats not what young women want for a future...its from the 50s...she lied to protect him through numerous scandals and no longer does it convincingly...she mumbles stock phrases about equality with no real commitment to anyone but her ambition!","post_message":"\"Through a record-breaking voter turnout, we won because we harnessed the energy and the excitement that the Democratic Party will need to succeed in November.\" --Bernie Sanders"},{"comment_id":"602588076598438","commenter_b":"She's just a confused little child in a bad place with no morales","commenter_a":"She is a pervert and don't have enough sense to know it , she thinks Christianity is a fairy tale but she wont when she gets to hell","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'.  This is unacceptable, we stand against Miley 100%.  Do you agree Miley should be kicked out of the country?"},{"comment_id":"10154186390606336","commenter_b":"Just stop. Women are not physically equal to men.","commenter_a":"They should open up the navy seals to women","post_message":"✓ 36-mile race ✓ 8-kilometer swim ✓ 25 obstacles   Her reason for completing the race? She was bullied in school. (CC: U.S. Navy)"},{"comment_id":"10153279094626051","commenter_b":"Get her out of there before she does any more damage.","commenter_a":"Kim Davis is where she belongs for disobeying the LAW.","post_message":"Hillary Clinton says Kim Davis belongs in jail. Do you agree or disagree with her?"},{"comment_id":"967666993287466","commenter_b":"Lying sack of s@&$. Only pigs do that.","commenter_a":"These Muslims make up the most unbelievable lie's .","post_message":"46 Yr Old Millionaire Muslim In Court For Raping Teen: “I fell on her and penetrated her by accident’"}]
