[{"comment_id":"967371493322599","commenter_b":"Yes yes definitely. I'm thinking a hot tire around the neck for the rhino poaches would be justice served.","commenter_a":"Maybe we need to do that to the Rhino poaches here in South Africa...","post_message":"Chinese villagers beat dog thieves for NINE hours and tie the dead animals' bodies around their necks"},{"comment_id":"10150650975759999","commenter_b":"Idiots will vote for Trump.","commenter_a":"How do you spell landslide? Trump Trump Trump...","post_message":"When it comes to Donald J. Trump and the 2016 race, \"we're still in the swimsuit competition. It gets harder in the talent rounds.\"  Read on in The New York Times Opinion."},{"comment_id":"10153615145678598","commenter_b":"this woman is sick and will be judged by God. I wouldn't want to be in her shoes when she stands before God!","commenter_a":"And you get an abortion! And you get an abortion! And you! And you!","post_message":"Hillary Clinton: “I Think We Should Do Everything We Can” to Promote Free Abortions"},{"comment_id":"1422508754431832","commenter_b":"Yes","commenter_a":"Yes, totally!!","post_message":"Should Washington require drug testing for unemployment benefits?   A. Yes.  B. No, it's spending a lot of money on little gain  C. This is a bit unfair for states that legalized pot  D. Only for those who lost jobs to drug use E. Enter your own anwser"},{"comment_id":"653037578220154","commenter_b":"We always saluted the flag every day at school. And sais the Pledge of alligence. Also prayed.","commenter_a":"YOU CANT BE SERIOUS !!!! RULED AGAINST' THE AMERICAN FLAG ???? NO WAY IN HELL SHOULD THIS HAPPEN !!! NO WAY !!!! .","post_message":"The court has just ruled against the American flag.  This is un-American. We stand for the flag forever and always.  Can we get 30,000 'LIKES' for the American flag?"},{"comment_id":"1374679629226158","commenter_b":"No they are NOT normal. Maybe they are from his neck of the world but the Western world not so much. England needs to wise up and get rid of him and the rest of the muslims that are taking the country over before its too late.","commenter_a":"Can't stand this guy what is he doing in US???","post_message":"The new normal."},{"comment_id":"1044972152190462","commenter_b":"My penis book says the penis breaks off and swims after her! !Get away from me you dick!!","commenter_a":"lol","post_message":"Via Sciencegasm."}]
