[{"comment_id":"847297252033195","commenter_b":"Girls run the world!","commenter_a":"No on F'in cares except the racist thugs like OFAILURE & OSHARPTON & BSNBC !","post_message":"Who run the world?"},{"comment_id":"10154033715125329","commenter_b":"Chop chop woman haha","commenter_a":"@username Brittany Suzanne Pink","post_message":"Gilmore Girls could be getting new episodes on Netflix!"},{"comment_id":"10154046383106509","commenter_b":"invasion of economical immigrants/social benefits leechers under camouflage of refugees","commenter_a":"Theres awfully a lot of Military age male in these \"refugees\".","post_message":"Germany to impose border controls with focus on its border with Austria. @webpagelink"},{"comment_id":"10154069186973967","commenter_b":"Yeah how dare she have an opinion, why didn't your whore mother have that coat hanger abortion she wanted?","commenter_a":"Check your shit together before basing bias yo..she was more concerned about her own BS and not about Nintendo. Also you have to be THIS goddamn retarded to lose an awesome job at Nintendo","post_message":"Nintendo watched her become the center of a witch hunt and did nothing publicly to defend her."},{"comment_id":"1111727715607435","commenter_b":"sick woman in many ways and not to be respected!!","commenter_a":"Clinton stood tall and showed she was someone to be respected, unlike the baby bully who consistently showed his ignorance and called name likes like a third grader.","post_message":"The final presidential debate is in the books. Which candidate made the best case for themselves: Trump or Clinton?"},{"comment_id":"10153145019224205","commenter_b":"Honestly, she's a fucken hypocrite.","commenter_a":"Juliette Aguilar @username Melissa Amezola Hilda Llamas Navarro","post_message":"Caitlyn Jenner’s Opinion Of Gay Marriage"},{"comment_id":"10154159520288037","commenter_b":"They weren't misbehaving.im sure this girl was engaging in the drama as well","commenter_a":"Should've gone home and put on a Trump for prison shirt. I bet you the administration wouldn't have a problem with a short bashing a conservative","post_message":"She says she was told to change her shirt or go to in school suspension for the rest of the day because her shirt caused a classroom disruption."}]
