[{"comment_id":"1121252964608432","commenter_b":"Shouldn't he be taking on Hillary??? Just another dumb ass between the choice of two dumb asses","commenter_a":"Acting just like hillary","post_message":"Politics."},{"comment_id":"10153186802728203","commenter_b":"\" \"There is very little in the Bible which reflects the modern idea of one man and one woman united by love, Jimmerson said explaining her support for gay \" \" Let's see Genesis 1 & 2 gives us the pre-fall structure of marriage. This was reiterated by JESUS in Matt 19 and Mark 10. There is no higher attestation then that.","commenter_a":"That's not up for contemplation if they did be sure to expel them right away","post_message":"Southern Baptist affiliate may expel church for performing same-sex ‘wedding’"},{"comment_id":"10152977557517217","commenter_b":"Lady*","commenter_a":"Beautiful England Rose, Princess Diana.....","post_message":"Princess Diana, lion cubs & space safety fears - This Week in History: @webpagelink #bbcrewind"},{"comment_id":"10153684606323487","commenter_b":"There is no part of any of the Planned Parenthood video footage of a fully-formed aborted fetus on the table, with its heart beating, its legs kicking, IT IS A LIE!!!!!! The damned bitch lied!!!!!","commenter_a":"In the sense that she lied louder and slower than the others, Carly owned the night.","post_message":"Carly Fiorina owned the night."},{"comment_id":"1576593039311229","commenter_b":"Can't stand this stupid bitch!!!","commenter_a":"The stupidity abounds in liberal media and mind.","post_message":"\"Liberal logic\" -- an oxymoron with the emphasis on moron"},{"comment_id":"1605375073100237","commenter_b":"Fuck him and his family. Good job lady and sorry you had to as nobody wants to kill someone. But they will kill, torture, and rape you. Good you were armed. God bless you.","commenter_a":"Why do we allow people like this to contribute to the GENE POOL? His whole family should be spaded and or neutered. Why because of IDIOTIC lines like \"he needed money for clothes\" what happen to all the government hand outs this family was getting, cause sure as shit they all were on welfare and not one ever held a job. As to whether or not it was the home owners fault is by far the most asinine thing ever spoken.","post_message":"This teen punk broke into a woman's home and tried to rob her. But she defended herself, and left him dead.  Now the punk's family is asking an absolutely sickening question, that left the woman and her friends shocked.  Only in Obama's America..."},{"comment_id":"523485051181568","commenter_b":"Such a lying witch.","commenter_a":"She has dealt ace of spades. Let her bare the consequences!","post_message":"\"Donald Trump says I’m playing the woman card. Well you know what I say if fighting for child care, paid leave, and equal pay is playing the woman card – then deal me in!”  Moments ago, Hillary Clinton gave a speech responding to Donald J. Trump's criticism."}]
