[{"comment_id":"555875991245538","commenter_b":"Finally a person with some brains","commenter_a":"We should not have even been considering it in the first place. When other muslim nations refuse to take refugees because of the fears of terrorism, why should we take the risk? There's lots of room at the White House- let them stay there.","post_message":"Official Statement from Dr.Ben Carson:  Today, I am asking Congress to stop the Obama Administration’s plans to bring in up to 45,000 Syrian refugees. There is currently no ability to vet these people.  By letting refugees into our country without vetting we are putting America at risk. If our President cannot see the risk, then we must rise to the challenge and protect our country. This morning President Obama announced at his press conference that it was our responsibility to accept these refugees. He is wrong. He took an oath to protect and defend this country. There is simply not a way to vet these refugees.   We should do everything in our power to help these men, women, and children who have been forced to flee their country, but until we can sort out the bad guys, we must not be foolish. I call for increased aid to the refugees. We can and should do more to feed the hungry and shelter the homeless. We must also protect them from being attacked by implementing immediately no fly zone over these camps.  President Obama said this morning that it would be a mistake to send more ground troops. I think plenty of mistakes have already been made. As President, I would give the mission to the Pentagon, and ask them what they need to accomplish the mission. The right number of boots on the ground is whatever number the Pentagon says they need to accomplish that mission and not a single person less. The error of armchair quarterbacking our military will end in my administration. They will get the support they need and nothing less. Both the FBI and former Intelligence Committee Chairman, Mike Rogers, have indicated that it is not possible to fully vet these refugees as there is no Syrian list to vet against. Allowing these refugees to enter our country without knowing who they are is foolish. I am talking to many experts as I can, and I have yet to find one who thinks that the Obama Syrian/ISIL strategy is anything but a failure. The only thing that President Obama seems to have contained is this foolish policy inside his government.   We need to offer more than empty tough talk. We need to say what we mean, and most importantly mean what we say. When we draw a line in the sand or boundary in the air, the world needs to understand that we mean it. Too many people across the world today think that we don’t."},{"comment_id":"1609193876054360","commenter_b":"Karma has a lot of work ahead of her!","commenter_a":"Shame on all that participated! My thoughts and prayers are with you and your family. Thank you for your sacrifice and for your sons. He is a true HERO! I'm heart goes out to all of you. God bless!","post_message":"“When he made that announcement, there was some hissing and some booing behind us,” Stewart Perry, father of Sgt. John Perry, told the Army Times."},{"comment_id":"904920249698551","commenter_b":"Fuck this bitch in do care who sings at this bitch shit he's not my president fuckem","commenter_a":"No","post_message":"What they just confirmed about the Trump's inauguration... This is just what we've been waiting for. Are you excited for Trump's inauguration?"},{"comment_id":"10153978466591002","commenter_b":"These are Outlaw Motorcycle Gangs..not Motorcycle Clubs..Outlaw Gangs are nothing but Thugs","commenter_a":"I am in the minority here, but I feel safer with motorcycle clubs than I would anyone else. I would not turn away of I walked into a place of business and seen club memebrs in the same place. They don't just go out and rob and kill people because they want to. You can't compare existing clubs to SAMCRo from Sons of Anarchy. This is a TV show. Hell, we should have the clubs patrol the streets. Think about that one!","post_message":"After the Waco shootout this weekend, outlaw motorcycle gangs are again in the spotlight. Roger Weber takes a look at local biker gangs: @webpagelink"},{"comment_id":"10153128289641636","commenter_b":"You got daughters?","commenter_a":"Absolute madness.....by all means reprimand him through school procedures but don't criminalise him....it's somewhat excessive.","post_message":"She was 14"},{"comment_id":"475250429347483","commenter_b":"Everybody in this country already is lying each other up every day!! Just BIG LIARS!!! So what's the big issue with her hidden lies!! OOOOPS!!! I forgot... it's because she is from another country and had way more passion and enthusiasm to drive her to be smart and do well and two other things she a female and of a different skin tone in RACIST, SEXIST AND BIGOTED ALONG WITH ALL SYMPATHIZERS; AMERICA and hell across the world!! AND HELL YEAH I SAID WHAT TOO MANY DON'T HAVE THE HEART ARE SPINE TO SAY ESPECIALLY ALOT OF THE ONES THAT GOT WEALTH, PROFESSIONS, RICHES, POSITIONS, MATERIALISM, FAMILY AND ESPECIALLY MOST THAT ARE MIXED RACED RELATIONSHIPS; AND YOU KNOW WHAT I'M SAYING... BUT IF YOU DON'T THEN: JELLY SPINE OR SPINELESS, WEAK, TAIL TUCKED BETWEEN THE LEGS, GUTLESS YES MEN/WOMEN SUGAR COATED AND WATERED DOWN COWARDS THAT FEEL THEY GOT TOO ...","commenter_a":"How is her schooling funded?","post_message":"This 4.95 GPA student revealed her status as undocumented immigrant during her graduation speech.  #MicBrights"},{"comment_id":"1422840444402648","commenter_b":"0 for 3 definitely a malicious prosecution not based on facts evidence or law. they need to sue her and the city of Baltimore.","commenter_a":"I think that this prosecutor did this solely on political reasoning and her office needs investigated","post_message":"Caesar Goodson, one of the Baltimore police officers tried in the death of Freddie Gray, has been found not guilty on all charges."}]
