[{"comment_id":"903935252988832","commenter_b":"That strategy has never once worked. In fact, we created ISIS by doing exactly that to Iraq.","commenter_a":"Just another reason to bomb them into little pieces. If done correctly, these vermin could be wiped out in a matter of weeks.","post_message":"\"Since ISIL declared a caliphate in Iraq and Syria in July 2014, the group has become one of the world’s most well-financed terrorist organizations.\""},{"comment_id":"10154592640014411","commenter_b":"actually, feminists hate people forcing women to wear/do anything, which is kinda what a ban amounts to.","commenter_a":"Burkini is everyrhing that a feminist hates,so how can feminists agree for that?","post_message":"'...attempt to raise profits and exploit a gap in the over-saturated clothing market is selling and promoting allegiance to ISIS?'"},{"comment_id":"10154489632511051","commenter_b":"True, LOCK HER UP !","commenter_a":"agree'","post_message":"Newt Gingrich says Hillary Clinton is without a doubt one of the most corrupt politicians in American history. Do you agree or disagree?"},{"comment_id":"10153695789091336","commenter_b":"No women in combat puts the men at risk to protect them they are targets of the enemy..don't care how strong or tough you think you are you get in the enemy's hands you will see the truth","commenter_a":"There is no way a woman is as physically strong as a man. That is just the way it is. It is just common sense. A woman could be jeopardize the safety of other marines when in battle","post_message":"The U.S. Marine Corps would request a waiver to keep women excluded from infantry and artillery positions, but not armor positions like serving in tank units, according to an official."},{"comment_id":"1322268537812600","commenter_b":"Hillary is NOT going to like her karma.","commenter_a":"Plane will be landing in Ecuador with pallets off fresh untraceable cash very soon....","post_message":"Smells like OBAMA....!  Details:  @webpagelink"},{"comment_id":"1137397219630950","commenter_b":"Hey Josh this chick is tripping. Lol","commenter_a":"#newyorkvalues","post_message":"“I don’t want money, I’m going to rape you.”"},{"comment_id":"10154486543656037","commenter_b":"Hillary has deceived all of u!!' Rosanna, this is what she wants. You're just as disgusting as her😎😎😎","commenter_a":"Trump has been saying the system aka Democraps is Rigged. I guess they gonna start saying build a wall next lol copy cat libtards!","post_message":"Elizabeth Warren: \"The system is rigged, and Donald J. Trump would make it worse.\" @webpagelink"}]
