[{"comment_id":"1851225291776966","commenter_b":"well said ,","commenter_a":"Trump's Victory, in another term (American people's Victory) has proven that the good citizens of the USA are great at determining their future, and changing the game and the whole regime for a better living and even world because America has a big influence on the whole world. Despite the massive media war that had been trying and pushing hard to find a way to put Mr. Trump aside or down to fail him by any dirty politics, means and ways... BUT they couldn't do you know why? Because he is capable and honest and most of all I believe that the church of humble believers everywhere have had an input in this victory asking the Good Father for this amazing nation to shine His face upon America again as He did in the past...!","post_message":"Former President George W. Bush had this message for President-elect Donald J. Trump."},{"comment_id":"10157491368855389","commenter_b":"Now she needs to seperate from our government. A few years in the slammer or off to Syria where she'll be treated like every other woman.","commenter_a":"Don't care for your relationship with the Hil, but good for you on your separation from the Weiner. Anyone deserves better than that scumbag.","post_message":""},{"comment_id":"902293323230618","commenter_b":"Please put the lying pig in prison where she belongs","commenter_a":"Isn't it ironic the Bill Clinton appointed Loretta Lynch in New York City to her appointment as federal judge there! Obama appoints Loretta Lynch to be attorney general after ever called or left! Barack Obama supports Hillary Clinton for president of the United States saying he doesn't think she did anything wrong! Loretta Lynch Meats with Bill Clinton by coincidence in Arizona Airport where they both went with private planes and just happens to be on this farm at together! After Loretta Lynch meet with Bill Clinton by chance and the Arizona taubat she requests the judge postponed releasing Hillary Clinton's emails for 200 and some days after the November election! How are you folks believe Barack Hussein Obama's administration is not totally corrupt I guess you're waiting for the Easter Bunny, Santa Claus and any other mythical person to come by your side along with the Unicorn! I guess ...","post_message":"An iconic photograph of Hillary Clinton using her BlackBerry while wearing sunglasses on a military plane prompted an official in her office to inquire about whether Clinton had been assigned a government email address...  The information came out in sworn testimony in a Judicial Watch deposition of Karin Lang, a former State Department official. Please SHARE!"},{"comment_id":"10152702377667869","commenter_b":"Praying that God leads you to serve in the best way possible.","commenter_a":"We will miss your show","post_message":"This evening I wanted to share with you some news that is very personal to me.  Because you have been such a good friend and a strong supporter of all my efforts, I wanted you to know first that tonight I will do more than just say goodnight on my Fox show.  I will say goodbye.  This is the last edition of Huckabee on the Fox News Channel. It has been the ride of a lifetime, and I have never had so much fun in my life. But I also realize that God hasn¹t put me on earth just to have a good time or to make a good living, but rather has put me on earth to try to make a good life.  There has been a great deal of speculation as to whether I would run for President.  I won't make a decision about running until late in the spring of 2015, but the continued chatter has put Fox News into a position that is not fair to them. The honorable thing to do at this point is to end my tenure here at Fox so I can openly talk with potential donors and supporters and gauge support.  As much as I have loved doing the show, I love my country more, and feel that it may be time for me to leave a zone of comfort to engage in the conflicts that have almost destroyed the bedrock foundations of America.  I feel compelled to ascertain if the support exists strongly enough for another Presidential run. So as we say in television, stay tuned!"},{"comment_id":"10153600166447217","commenter_b":"^That is a true life goal","commenter_a":"@username And we're sat here watching tv and being casual XD","post_message":"Life goals."},{"comment_id":"10157017965955206","commenter_b":"The women will rally and vote for a woman... that will be Killary. Just like Obama got his job because of his race.","commenter_a":"Check the men's response compared to the women's response here. You all k ow so.much about what we think. Well, Much of what she says has merit. Whether you like her voice or her face! She speaks for many women. As long as you make this about her voice or her face, YOU are the PROBLEM! WE are HERE! WE have a VOICE whether you think we're pretty or sexy or pleasing or NOT!","post_message":"My whole life, people have told me to settle and accept the way things are. Now, politicians are asking the American people to do the same thing: to settle for a nation that doesn’t reach our potential."},{"comment_id":"10153792774496162","commenter_b":"Anna Silva","commenter_a":"Lisa DeRosa Raphael","post_message":"Lucky Charms has finally created a marshmallow-only version of its cereal: @webpagelink"}]
