[{"comment_id":"1056213647735452","commenter_b":"I didn't watch it, but I don't think it was appropriate to turn a sports event into a platform for a political statement. Perhaps the NFL should start requiring artists to submit song choices & performance videos ahead of time for approval or better yet just have a military or top-ranked college marching band perform.","commenter_a":"She's disgusting and an embarrassment to the entire country. The Superbowl was not the place for a political statement and someone at the NFL should be held responsible for her selection. She degraded the event and insulted the vast majority of Americans who chose to watch. I for one did not.","post_message":"Buckle up, 'cuz Rudy's got something to say...."},{"comment_id":"1181219778640173","commenter_b":"She's crazy!","commenter_a":"she needs to fall on the other side of her face","post_message":"Typical Hollywood liberal elite, who compares everything she doesn't like with the Nazi regime."},{"comment_id":"10155329030581002","commenter_b":"What's wrong with these racist black women?","commenter_a":"What is wrong with these nasty white bitches?","post_message":"A former Santa Fe Independent School District teacher is accused of having sex with two students over the last year and a half."},{"comment_id":"10154073349643132","commenter_b":"Piss off you twit and merry Christmas","commenter_a":"Why would you congratulate someone who goes out of their way to shame woman for pre-marital sex yet does it herself?","post_message":"Congratulations are in order for new mama Bristol Palin!"},{"comment_id":"882724591787290","commenter_b":"Battered but still a warrior, great courage.","commenter_a":"This kid needed a gun and a CCL. So as to defend himself!....oh wait he lives in Newtongrange, Midlothian. Is that in....the UK? They not allowed to defend themselves with lethal force, from Thugs! Thanks to people that think like Piers Morgan.","post_message":"Left for dead with a battered face and multiple fractures by man he stopped to help"},{"comment_id":"1176004315773372","commenter_b":"And make Texas pay for the wall","commenter_a":"I think we should just let all the gun nuts go to Texas and secede from the Union. They already have their own power grid, so we could build a bullet proof wall around the state and let them shoot all they want.","post_message":"Nugent's response to the San Bernardino shooting is to call for a new American civil war."},{"comment_id":"10153951102966234","commenter_b":"She should had gotten revoke of gun license and probation","commenter_a":"@username u was jus talkin bout dis , she got 3 years","post_message":"Itiyanah Spruill pleaded guilty to child endangerment charges in connection with the death of her 4-year-old son."}]
