[{"comment_id":"10153336997560927","commenter_b":"What about the perverts that are wide open now to expose themselves? Are bathrooms their safe place now to sexually harass the opposite sex? What are libtards going to do when they become victims of their own lunacy?","commenter_a":"We truly need to abolish the ACLU they are bad news for America","post_message":"ACLU: \"By requiring people to use restrooms that do not correspond to their GENDER IDENTITY, this policy not only endangers and discriminates against transgender people  it also violates federal law ...\""},{"comment_id":"10152853251337217","commenter_b":"No one is trying to say being plus size is a standard but there are plus size women who love their body and would not like to be ostracized for loving themselves the way they are. But these underweight model can start a trend of anorexia because girls WILL starve themselves to be like that","commenter_a":"They don't do that with the obese women... ¬¬","post_message":"Ad featuring \"unhealthily underweight\" model is deemed \"irresponsible\""},{"comment_id":"10156126266600615","commenter_b":"Make her pay for all the time she has wasted with her stupidity.","commenter_a":"Yes and he should block her from further action, and find her and her attorney's for wasting the court's time and money.","post_message":"What do you think? Will Judge Bunning dismiss Kim Davis' lawsuit against the governor?"},{"comment_id":"10153118547732377","commenter_b":"Wake up folks, don't be divided , be united....Carson for president, at least he's a God fearing man...A child of the most high God","commenter_a":"And Your Point Is???","post_message":"Ben Carson's faith as a Seventh Day Adventist came under fire at a Donald Trump rally on Saturday."},{"comment_id":"1072562746193671","commenter_b":"You don't like China?","commenter_a":"Yes yes Mexico is paying for the Wall, I just did nit get the chance to tell them yet. I met the Mexican president, he is a great man, I have a lot of respect for him and I love him and the Mexican hombres a lot. I offered the Mexican president free premium trump wine from china","post_message":"\"[It] fully-funds the construction of a wall on our southern border... with the full understanding that the country of Mexico will be reimbursing the United States for the full cost of such a wall.\"  Earlier today at his \"first 100 days\" speech in Gettysburg, Donald J. Trump outlined his proposed \"End Illegal Immigration Act.\" @webpagelink"},{"comment_id":"636990926431695","commenter_b":"Let her go to a country that enforces Sharia law and see how she really likes being beat.","commenter_a":"She is insane!","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"},{"comment_id":"10153811400261002","commenter_b":"Just goes to show we know how to do more than you men lol","commenter_a":"I think it's hilarious.Sadly a majority of uptight women will find it offensive,like they do if the wind blows the wrong way. Relax it's not a d**k don't take it so hard.","post_message":"A new jersey for a sports team has washing instructions that has caused an uproar. It reads  this jersey to your woman, it her job."}]
