[{"comment_id":"10152921328085950","commenter_b":"Wow, Janet Fix, your comment just proves how uninformed you are. Or are you just trying to be obnoxious?","commenter_a":"lol If its Michelle Obama I'm asking for two fives.","post_message":"Move over, Alexander Hamilton... A woman is about to replace you on the $10 bill."},{"comment_id":"1122007374532683","commenter_b":"She's in a bikini with something over it, not a big deal. Trumps wife on the other hand is butt ass naked and might be the next First Lady.","commenter_a":"Erik Björnfot","post_message":"#President #Obama's Daughter #MaliaObama twerks & shows her booty cheeks at #Lollapalooza! #WSHH"},{"comment_id":"10152762458196973","commenter_b":"Exactly how would we \"ban transgenders?\" Deport them? Round them up into camps? Or are you for killing them? Smart people don't advocate for bigotry and racism.","commenter_a":"Or we could just ban transgenders altogether.","post_message":"Should Oregon ban \"conversion therapy\" for LGBT youth?"},{"comment_id":"10152800082481051","commenter_b":"Should have killed the scumbag the first time !!!","commenter_a":"It was a domestic violence crime, that should have kept him behind bars. You figure out why.","post_message":"This guy was released after admitting to stabbing a woman to death in front of her children. Guess what he did one month later."},{"comment_id":"992220407519685","commenter_b":"Meghan Sullivan","commenter_a":"Hold up! Imma let you finish, but I just wanted to say Bernie Sanders had one of the best shut downs of all time!! #feelthebern","post_message":"Bernie Sanders to Hillary Clinton: \"Excuse me, I'm talking.\""},{"comment_id":"10155745966725354","commenter_b":"She is a twatwaffle","commenter_a":"WIGGER WOMAN","post_message":"Instead of just admitting \"I'm really white,\" we get a bunch of jargon like \"the dialogue has unexpectedly shifted internationally to my personal identity in the context of defining race and ethnicity.\"  Check out the full woe-is-me open letter:"},{"comment_id":"967043476669844","commenter_b":"I heard it was originated by harem members trying to catch the attention of sheiks so fat the women had to do all the work!?.","commenter_a":"There are spiritual aspects to female sexuality, this is where belly dancing comes from...before it was a way for women to show their sexual fertility to their husbands it was a practice done by female worshipers of the snake goddess. Not sure but to me this seems like a modern take on that...in most cases such dancing is done for the benefit of men. But when it is done to express one's sexuality in a personal way, it does have an empowering effect. It suggests that a woman's sexuality belongs to her and doesn't need a male audience to be valid.","post_message":"I never thought a pole-dancing video could be such a tearjerker. Man, was I ever wrong! - Andrea Garcia-Vargas"}]
