[{"comment_id":"10154024287346680","commenter_b":"Thank God we elected a Nazi instead, right?","commenter_a":"Can Obama just pardon her if she promises to stay out of the public for the next 3 decades? It's time to move on.","post_message":"State officials said earlier this year they searched for visitor logs for Hillary Clinton's office and could not find any."},{"comment_id":"10156300562155093","commenter_b":"He called illegal Mexican immigrants \"rapists and criminals.\"","commenter_a":"Hispanics for Trump!","post_message":"What a Donald J. Trump presidency would actually look like, courtesy of Saturday Night Live."},{"comment_id":"10154052672876051","commenter_b":"You deserve crooked Hillary!","commenter_a":"LMFAO, Clinton has SECURED enough electoral votes that she doesn't even NEED TO campaign anymore. Nice try there. It's pretty goddam pathetic that the absolute BEST the \"party of values\" could scrape up is a con artist who cheated on wife #1 with wife #2, has FIVE children from three different wives, wife #3 lied about having a degree and may possibly be an illegal immigrant; Trump appeared on the cover of Playboy and owned strip clubs AND gambling casinos; admits he wants to bang his own daughter; mocked the handicapped; supports torture; numerous business failures; bribed Florida AG Pam Bondi; is facing ethics lawsuit regarding Trump University, and that's just off the top of my head - yeah, right. Some \"Presidential\" material. So shove your fake-ass BULLSHIT stories about emails and Benghazi, you cheap phony \"patriots\" supporting Trump.","post_message":"Election swing: Donald Trump is now leading Hillary Clinton by two points in a major nationwide poll. Would you like to see Trump shock the world and win this November?"},{"comment_id":"853572084739045","commenter_b":"Lol! Wow!","commenter_a":"I agrees with the Judge! Come here by the proper channels! WTH","post_message":"Here's a breakdown of what the immigration ruling means."},{"comment_id":"10153264907976336","commenter_b":"The illegals are bleeding the system dry, plain and simple and then there's the government that doesn't give a crap about the poor because they largely do not see a reason to vote and therefore don't","commenter_a":"Yea and that will never happen. Illegal immigration will never completely stop as long as we have open borders and waterways","post_message":"In a Fox News Sunday exclusive, presidential candidate Marco Rubio says he still believes the U.S. needs immigration reform but it can’t be done “in one big piece of legislation.”  WATCH: @webpagelink"},{"comment_id":"1807363586202385","commenter_b":"Yes WE NEED TO LOCK HILLARY AND HER FRIENDS UP!","commenter_a":"Hell yes !!!!!!!","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"},{"comment_id":"899130260122396","commenter_b":"Eat what we or go back to your own country.","commenter_a":"Just go away.","post_message":"OUTRAGE"}]
