[{"comment_id":"10154190789236336","commenter_b":"This is so exaggerated. I bet this was seen as an opportunity and she had someone else bruise her. She did not almost go down and showed no pain or upset on the video. She also shouldn't have approached Trump like that in the crowd. His life has been threatened so someone would have pushed her back. Maybe she should stay home. Also it sounds like this is her M.O","commenter_a":"Too bad...she wasn't in ANY way hurt...she's shooting for her 15 minutes of fame...","post_message":"\"We saw libel, defamation, slander, smearing of her reputation, simply for trying to do her job,\" Katie Pavlich said. \"This isn't just about simply one reporter. It's a bigger issue of the role of the press in America.\""},{"comment_id":"10153074507087908","commenter_b":"Only Decent Republican President lol !!! @webpagelink","commenter_a":"Today, Ike would be a center-right Democrat.","post_message":""},{"comment_id":"727863887335286","commenter_b":", WRONG, No way, get real, he had every right as well as a duty to make the case of Israel to America's ears. I learned more from his talk then from our ever non-transparent utopian president who believes the world will all sing kumbaya together because of his ever lovin idealistic, progressive, warped world view.","commenter_a":"Tha.no Mr john Boehner for inviting The PM. Thank you","post_message":"Do you agree? Jerusalem Post \\\\ Opinion & Blogs"},{"comment_id":"922573247835730","commenter_b":"Two women had enough of him, despite his wealth, and headed for the hills.","commenter_a":"I dont understand how a man with everything can be filled with so much hatred","post_message":"Yep, that just about sums up Donald Trump's campaign.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"590770071125294","commenter_b":"Now if these douche bags will leave they know where their bread is buttered.","commenter_a":"They have money! They can easily move wherever they want, away from old bigot Trump and his supporters.","post_message":"Remember the celebrities who said they would leave the country if Donald J. Trump was elected president... @webpagelink"},{"comment_id":"10153176907066130","commenter_b":"And not be forcibly altered. Don't circumcise babies!","commenter_a":"Before picture or nahhh","post_message":"\"We need to remove the stigma. We should be able to alter whatever we please, free of the judgment of others.\""},{"comment_id":"10154111775125779","commenter_b":"Haha She landed Russell Wilson, she isn't going anywhere.","commenter_a":"We all know how this is going to end - she's going to go back to the Future.","post_message":"Ciara dropped her $15 million defamation suit against her ex-fiancé Future Friday, a year after the singer first accused the rapper of slander."}]
