[{"comment_id":"969075749885792","commenter_b":"That was you , a hoe and a drug user","commenter_a":"Your corruption comes to an end today Hillary! You have stiffed this nation, you have deceived the American people. NO MORE CLINTONS, America will not let you disgrace this nation any more!","post_message":"Todo por lo que hemos trabajado se decide hoy. Comparte esto si apoyas a Hillary: hillaryclinton.com/buscador"},{"comment_id":"718460845008873","commenter_b":"never happen... if they couldn't massage their egos with those little golden idols... their would dry up and blow away.... or perhaps blow each other (y)","commenter_a":"Oscar - a trophy given by actors to actors for being actors. Like it makes the world a better place - NOT.","post_message":"Hollywood SCUMBAGS Might CANCEL the Oscars to Protest Trump"},{"comment_id":"10153344624090326","commenter_b":"Sit down and shut up!","commenter_a":"He has hearing problems nothing is free","post_message":""},{"comment_id":"671681693020122","commenter_b":"Donna should be in jail!","commenter_a":"She is a cheater","post_message":"Does she DESERVE TO BE ARRESTED?"},{"comment_id":"538334903023756","commenter_b":"Yes....throw her ass in jail.","commenter_a":"That's what happens when you engage you mouth before your brain","post_message":"The Baltimore prosecutor is about to go down in flames after this.  She is a criminal, just like the rest of them.  Do you agree she should serve time?"},{"comment_id":"10154637857483188","commenter_b":"He's been doing that since way before anybody else","commenter_a":"When are you going to report on Hillarys emails? Speeches? Ties with foreign governments?","post_message":"Tough situation."},{"comment_id":"516357545155952","commenter_b":"I'd be pissed,then sue everybody.Which I'm sure she'll do.","commenter_a":"How did they get the right to determine her mental state?","post_message":"Via Filming Cops -- How would you feel if within 24 hours you go from being a successful corporate executive to being forced to become a patient at a mental ward, stripped naked, where no one believes you? It feels straight out of a psycho thriller, but this is what cops did to her."}]
