[{"comment_id":"1724969627717594","commenter_b":"@username they don't do anything considering the billions of dollars we give them in aid that we couldn't attain ourselves. I'm not saying give Palestine money either just why give Isreal money to kill Palestinian children and so Israelis can have abortions?!","commenter_a":"If you realized what Isreal has done to the Palestinians you might donate to Hamas as well.","post_message":"WATCH: Filmmaker Ami Horowitz discovers that some American college students are willing to donate money to the militant group Hamas, after being told it will help “destroy Israel.” @webpagelink"},{"comment_id":"10154735713113132","commenter_b":"She lives for the fame..controversy and all.","commenter_a":"Why discuss this with tabloids? What does her children gain from it? That's private. Quit putting your kids out there to be vulnerable like this.","post_message":"Kate Gosselin is opening up about her son Collin."},{"comment_id":"10153245276305950","commenter_b":"Right clown ass hoe bitch go die","commenter_a":"And we call these animals humans??! Disgusting how they are getting away with treating the people who put their lives on the line to defend them. We should allow them to continue to kill each other ... that would mean less barbaric, meaningless, animals taking up valuable oxygen","post_message":"WATCH: Some \"angry\" protesters clash with police in Chicago video of #LaquanMcDonald's shooting released @webpagelink"},{"comment_id":"10153074507087908","commenter_b":"Only Decent Republican President lol !!! @webpagelink","commenter_a":"Today, Ike would be a center-right Democrat.","post_message":""},{"comment_id":"1360351430654310","commenter_b":"Thank you for your vote of confidence but as of right now my focus is on college classes and getting my degree ASAP .","commenter_a":"Oh god I hate her . She is such a hypocrite. She calls us snowflakes for complaining but her job is literally to sit behind a desk and complain about things she doesn't like . She is the biggest snowflake of them all ( next to lord twitterfingers of course ) . For someone who's a millennial and who \" doesn't like labels \" she sure does like to label everyone else . She's not even a real journalist, she is a glorified YouTube personality .","post_message":"She came after Meryl Streep  and that was the last straw."},{"comment_id":"10153314769416491","commenter_b":"We Aussies don't want this xenophobic, racist bigot back","commenter_a":"I think we should deport Rupert for being UN-AMERICAN.","post_message":"Rupert Murdoch: \"Maybe make special exception for proven Christians.\""},{"comment_id":"10154345069201491","commenter_b":"The wall will be so \"huge and bigly\" the missiles won't even be able to fly over it!","commenter_a":"Trump doesn't like war!! He likes building a huge wall.. Don't worry guys, he is going to isolate North Korea with his wall, perhaps the nuke can't go through it..","post_message":"North Korea's weapons-grade stockpile has soared dramatically, says South Korea."}]
