[{"comment_id":"10152995356441130","commenter_b":"some women think they'll be liked more (by men) if they act this way!!!! cause...ain't no way a woman believes this...EVER!!!","commenter_a":"CEO of the Dumbass Corp","post_message":"What the..."},{"comment_id":"10153752215990575","commenter_b":"Better yet, deport them each and every one ASAP !!!","commenter_a":"Shoot everyone of them no more rape","post_message":"Good question!"},{"comment_id":"10153374957661051","commenter_b":"Of course, a common sense approach. All sales and transfers should be subject to a background check protocol. Keep up the rhetoric NRA, unless we see some common sense prevail among the gun lobby & gun nuts the eventual backlash is going to greatly affect responsible gun owners.","commenter_a":"To purchase any firearm there are already checks in place.","post_message":"Do you agree or disagree with America's police chiefs on this?"},{"comment_id":"10153222967261378","commenter_b":"Time for her to be shot in the face.","commenter_a":"Time for her to be released from her position.","post_message":"READY FOR MORE JAIL: Back at work and continuing to refuse same-sex marriage licenses, Kentucky clerk Kim Davis said she'll go back to jail again if that's what it comes to. Watch her tearful interview..."},{"comment_id":"10153442535983132","commenter_b":"there is tons of transgender models lol","commenter_a":"Beautiful!","post_message":"If 2015 wasn her year already, it sure is now."},{"comment_id":"759569737474968","commenter_b":"We also.have to put up.with people like you. I'd welcome anyone from anywhere else before I'd welcome you .","commenter_a":"If we gotta put up with Muslims...why the hell not at least he doesn't want to behead us","post_message":"If you thought he was in jail, you thought wrong."},{"comment_id":"10154332643707686","commenter_b":"According to a new Congressional Research Service report entitled Executive Authority to Exclude Aliens, the last 5 presidents have used executive authority to limit or restrict the entry of immigrants and non-immigrants into the U.S. a total of 43 times. Ironically, it appears that President Barack Obama used this authority more frequently than any of his predecessors, exercising it a total of 19 times during his two terms in office. Here's the breakdown of how many times each of the past five presidents issued such orders: Ronald Reagan - Five times George H. W Bush - One time Bill Clinton - 12 times George W. Bush - Six times Barack Obama - 19 times","commenter_a":"Waters, Polosi, Shummer, Warren and a whole bunch of other libtards need to be slapped up side thier heads.","post_message":"Rep. Maxine Waters:  \"I have not called for the impeachment (of President Donald Trump) yet. ...\""}]
