[{"comment_id":"631003300406505","commenter_b":"She's a force to be reckoned with","commenter_a":"Bre Camp spirit animal?","post_message":"WATCH: 2-year-old Violet lives with her family in Shreveport, Louisiana, but she soon could be on Broadway as her rendition of the alphabet song is becoming a viral sensation. Jesse Tyler Ferguson, who just finished a Broadway run, shared this video on his Facebook page, writing \"I can't help but think this what Elaine Stritch was like as a child.\" @webpagelink"},{"comment_id":"550730825100820","commenter_b":"Smash these racist fucks with the same pipe, then hit them in the throat with it.","commenter_a":"Public beating","post_message":"Black Thugs Smash White Girl's Face With Metal Pipe For This Unbelievable Reason  This is horrifying. Imagine if this was your daughter.  What punishment would you want for them?"},{"comment_id":"10158588409000354","commenter_b":"Doesn't help that he no longer has any \"insider info\" from the State Department, does it ????????? Schmuck","commenter_a":"Geez, whudda thunk it.","post_message":"You can't make this stuff up.   #ClintonCash"},{"comment_id":"1554600804845563","commenter_b":"Only way undocumented immigrants get benefits is if they have a usa born baby...they get benefits from the kid since the baby is a us citizen.","commenter_a":"They are so scared and desperate of losing their welfare and EBT cards and being deported , they know Trump Is For Real they know he means business..... so the last resort they have is they think they can scare America's law abiding citizens from attending perfectly legal, legitimate rally for the candidate of their choice which is 100% in their right to do. These people are not protesters, they are rioters, violent disrespectful, criminal thugs. The main stream , elite owned media is not reporting on this, you will not hear Hillary Clinton tell the Democrats or anyone outside of trump rallies to stop the violence, they support this, they support black lives matter. As long as they feel it is helpful to their side especially Hillary, (getting in the White house will keep her from going to jail), they will let it continue. If it was the other ...","post_message":"WATCH: Trump rally riots - supporters attacked by a mob of protesters at a rally in California."},{"comment_id":"1727638077485478","commenter_b":"Theyre cool. But they claw into you. Very clingy animals","commenter_a":"@username this is why i wana go Australia - want one asa pet lets get one","post_message":"Koala joey plays in baby basket. Via Symbio Wildlife Park"},{"comment_id":"10154720750937235","commenter_b":"Michael M you r an ass hole !!! No one cares what you think !! You r ugly and evil with no soul just like Hillary !!! You and Meghan r made for each other !!! You r a disturbed individual !! Making fun of hard working people struggling because of Obamas policies !!!. We all should boycott. All your crap . I will . Those hard working people paid to see your movies ! Thats how u got rich !! Thanks to the deplorable's. You 😤😤ASSHOLE !!","commenter_a":"Michael Moore will do anything for media attention and money.","post_message":"You've no doubt seen folks in your Facebook feed who believe Michael Moore is making the case for Trump.   That is a LIE."},{"comment_id":"969780003138778","commenter_b":"Bye, bye illegal aliens and their bastard American children.","commenter_a":"Love it, ... and Muslims too !","post_message":"Ay, caramba! #BuildTheWall @webpagelink"}]
