[{"comment_id":"10154205031258701","commenter_b":"You are clueless chickie....","commenter_a":"Seriously people, faulting the girl for not reporting! It's a small town good-old-boy system. You really think the police chief would arrest his good friend? They were probably laughing about it. Since she went public she is being harassed. Small town politics...","post_message":"A probable cause affidavit states he exposed himself to a female employee at Flowers 'N Fluff at least twice a week for at least two years."},{"comment_id":"10153531348054740","commenter_b":"I agree you shouldnt have to justify.","commenter_a":"It is sad that so many don't know the difference between real life and tv.....","post_message":"Here's why cops don't 'shoot to injure':"},{"comment_id":"10153947614518855","commenter_b":"They have tiny dicks lol","commenter_a":"@username @username she was a grindho","post_message":"Surprised?"},{"comment_id":"10156726524125725","commenter_b":"Hide yo kids, hide yo wives.","commenter_a":"Will he be blocking polling places and stopping people from voting like he did in MA? After all, if you can't win an election honestly CHEAT, just like you did TO your wife!","post_message":"Illinois is shaping up to be an important state in the Democratic presidential race, so much so that former President Bill Clinton will be stumping in the Chicago area this week ----> @webpagelink"},{"comment_id":"10153551321648984","commenter_b":"A coal burning slut","commenter_a":"Kardashian is nothing more than a SLUT! Don't watch anything to do with her, PERIOD!","post_message":"Look out, Kim Kardashian. I don't think you realize who you're messing with...  Do you side with Megyn Kelly on this one?"},{"comment_id":"10154280732936336","commenter_b":"Agree100%","commenter_a":"How is this discriminatory? Use the bathroom according to your plumbing not your frame of mind. What about the civil rights of those who don't want to share the restroom with those of another gender? If a transgender earns money they pay taxes according to their earning not what they think they should pay. I'm really tired of a few people re-writing the moral and cultural standards for the nation.","post_message":"\"I’ll make a decision in 24 hours.\""},{"comment_id":"598881613578354","commenter_b":"Just shoot her!","commenter_a":"Piece of shit!!!!! Hit up some of the dicks that got you there","post_message":"Cry.............me...........a.............RIVER!"}]
