[{"comment_id":"10155189580834411","commenter_b":"@username ... Crawl back down your sh!thole!","commenter_a":"Everyone should boycott Israel. They are an apartheid state with no regard for international law. The bulldozed over 100 homes in the first week of 2017.","post_message":""},{"comment_id":"10153220581496336","commenter_b":"And the rap sheet of those deceased are mind blowing. Sad to be in A profession where u care so much but the ones u protect care so little.","commenter_a":"A bad situation when police are persecuted for doing their jobs. The whole force should resign. I would.","post_message":"The booking photos of the six Baltimore police officers charged in the Freddie Gray case have been released."},{"comment_id":"1029734007098210","commenter_b":"Poor old bitch. Still eat up with dumbass","commenter_a":"Cannot wait! This should be fun. Trump has his problems but hillary is such a liar that I hope she turns pknk.","post_message":"Democratic presidential candidate Hillary Clinton took aim at Republican rivals saying she is looking forward to debating with them about the economy if she becomes the Democratic nominee."},{"comment_id":"10154448995838812","commenter_b":"@username what makes her uneducated?","commenter_a":"And people seriously want to elect him president?!? Get a clue!!!","post_message":"New York's attorney general says he won't be deterred in pursuing the state’s case against Donald J. Trump and Trump University, just because the defendant is campaigning to be President of the United States."},{"comment_id":"10154559910664087","commenter_b":"@username: Are Christian refugees beheading non-Christians?","commenter_a":"They can rewrite it. However, they still have the footage of Trump calling for a Muslim ban on the campaign trail.","post_message":"BREAKING: White House attorneys are working on rewriting the language of President Trump's immigration ban following yesterday's dramatic defeat in the appeals court."},{"comment_id":"10157388184590603","commenter_b":"That wall doesn't work. Many people coming in illegally from Mexico are actually from Cental America.","commenter_a":"I think it will help open discussion about illegal entry into the US. Mexico has a huge wall on its border with Guatemala for the same reason.","post_message":"Do you think think this trip will help or hurt Donald J. Trump?"},{"comment_id":"1105899882819941","commenter_b":"@username typo, bitch!","commenter_a":"Donald Trump 2016! Because as an American hispanic, I'm tired of how all of these coward racist liberals that hate America like Obama, Clinton, Sanders, and their supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, I'm supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of my skin... disgusting. That's why I and others support Donald Trump. Please support the movement by getting the \"Trump Strong\" t-shirt at:www.teespring.com/trumpstrong . And let's Make America Strong Again! Thank you.","post_message":"They do NOT want people to see this one!"}]
