[{"comment_id":"997480703647380","commenter_b":"Give me a break already,sick & tired of catering to immigrants thy don't need holidays,they need to be deported Muslims & Illegal Mexicans.","commenter_a":"It will be great when Obama change s his address to any o","post_message":"WHITE HOUSE CALL PARTICIPANTS: Want To Change This Holiday to  Immigrants Day (VIDEO)  @webpagelink"},{"comment_id":"10153894836055579","commenter_b":"Deport Muslims and illegals, provide help for the mentally ill. Uphold current laws. Problem solved.","commenter_a":"Can somebody explain to me the connection between the NRA and this 20 year mentally disturbed individual in Oregon? How come we don't hear Obama or Hillary talking about the thousands killed every year via violent criminals in major cities all over the US? Where's their plan to stop that violence? How many law abiding gun carrying citizens have been involved in a mass shooting in the US?","post_message":"Hillary Clinton on guns:  is wrong with us that we can stand up to the NRA? Watch full video here: @webpagelink"},{"comment_id":"10154448446471636","commenter_b":"If liberalism is bad, what, IYO, is good?","commenter_a":"The coup is being instigated by the political establishment and the media against the people who dared to vote in what they dictated was the wrong way. They are mobilising the generations brain washed by leftist infiltration of the education systems to do their will. This is going to get bloody","post_message":"'If you're still trying to convince yourself that a 21st century coup is not underway, please, please snap out of it'"},{"comment_id":"785245424951309","commenter_b":"Girl go sit down somewhere","commenter_a":"those that vote for the \"first female\" president will get the same crap that the \"first black\" man president gave us.","post_message":"President Obama is speaking at a \"Get Out The Vote\" rally in Ann Arbor.  Read more about his visit: bit.ly/ObamainAnnArbor"},{"comment_id":"10154886644703487","commenter_b":"Yeahhh...I'm not buying it, Atlantic.","commenter_a":"So, arrest him and tell America that Trump isn't going to be President. I dare you. LMAO......","post_message":"\"Putin has embraced an opportunistic but sophisticated campaign to sabotage democracy.\""},{"comment_id":"1760842010899023","commenter_b":"Bitches be trippin'","commenter_a":"No not for all the money in the world!","post_message":"Would you?? #WSHH"},{"comment_id":"10154534955796336","commenter_b":"Hillary will NEVER do time for all the crimes she has committed. She and Bill have been getting away with their CRAP for YEARS. Just because it's a different year, doesn't mean anything will change.","commenter_a":"Hillary Clinton will win the election in November. Then, sometime between November and January, Hillary will be indicted. The IRS is now investigating the Clinton Foundation and the whole e-mail thing isn’t over yet. Once under indictment she won’t be able to assume the Office of the President in January. Tim Kaine, who will not actually be the Vice President because neither he nor Hillary have been inaugurated, cannot assume the Presidency. The Speaker of the House can’t move up to it because there is already a sitting President and Vice President. So President Obama, in an Executive Order citing “emergency situation,” gives himself another four years in office is the only way possible. Obama has been planning this for a while now, knowing he has enough on Hillary to indict her. Had the Attorney General indicted her based on evidence from the FBI this plan wouldn’t have worked because ...","post_message":"\"The terrorists overseas utilize our strengths – which are compassion and empathy – against us.\"   Kris \"Tanto\" Paranto, who survived the attack in Benghazi, expressed his support for a more rigorous vetting process for refugees."}]
