[{"comment_id":"880895332040553","commenter_b":"@username Didn't you get the memo? Pussy Liberals are NOT allowed to live in Texas... GET OUT","commenter_a":"Thank you @username for picking Mike Pence as you're running mate. Thank you thank you thank you God bless you both","post_message":"Mike Pence won big. We should all be proud of Mike!"},{"comment_id":"619503418188720","commenter_b":"This monkey is a joke.","commenter_a":"Spoken like a true tyrant.","post_message":"Barack Obama: Soft on ISIS, Brutal on States"},{"comment_id":"10153885803644411","commenter_b":"Those UkraNazi cockroaches belong in the trash bin.","commenter_a":"Ha! The \"Trash Truck.\" lmao... Never was there a more worthy chariot for such an unworthy set of a-holes.","post_message":"It is also not certain how much protection the new tank will be able to give those operating it, as its armor is a mere 40mm thick."},{"comment_id":"10155045713159073","commenter_b":"Risking war lol? You do realize that we would utterly destroy Mexico in less than a few weeks. Mexico would never declare war on us.","commenter_a":"We're is your proff..........for this post","post_message":"A wall would do little, if anything, to stop the flow of illegal drugs - the majority of which are actually smuggled though checkpoints."},{"comment_id":"10153291728974726","commenter_b":"Is it just me or is it beginning to look like it is just one group of \"slick\" parasites that is destroying America.","commenter_a":"Some people get it. Too bad the entitlement crowd isn't listening! They would rather consider themselves as victims of Whitey.","post_message":"VIDEO: Tavis Smiley: Government Programs Have Led to the Dissolution of the Black Family"},{"comment_id":"10156455116700354","commenter_b":"Plenty of real women out there that they could have photographed","commenter_a":"A fucking lie from the liberal media why pretend.","post_message":"All 8 PHOTOS here..."},{"comment_id":"10154282807343984","commenter_b":"You need to think about the children you putting in danger ,it would be taking advantage of !!!!!!! NC don't back off","commenter_a":"@username my head hurts over all the rucus about this law. My suggestion was to make it ALL about bathrooms and leave the employment issues out of it. I was happy to see he is still standing by his decision to keep bathrooms limited to the actual sex you are physically. I have been amazed by the number of employers threatening to leave and all the other boycotts. At least I still don't have to worry about a man walking into the friggin ladies room. Urghhhhhh","post_message":"North Carolina has come under INTENSE criticism lately for its stance on the LGBT community. After weeks of outrage, the state's governor has just come out with a stunning announcement that ANGER many Americans.  Do you support North Carolina's governor?"}]
