[{"comment_id":"1031074676904002","commenter_b":"girls get u a 357 they will stop","commenter_a":"just waiting for the ruling that guns are people too","post_message":"This is gross -->"},{"comment_id":"993982434028144","commenter_b":"That's my girl.","commenter_a":"Aarøn Andersøn","post_message":"\"The Seniors and Veterans Emergency Benefits Act would give about 70 million seniors, veterans, people with disabilities, and others an emergency payment equal to 3.9 percent of the average annual Social Security benefit, about $581 – the same percentage raise as the top CEOs got last year.\"  Read more here: @webpagelink  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153082765311955","commenter_b":"Are you bitches inbred or just drank the kool-aid? ?","commenter_a":"Fucking baphomet bullshit EVERYWHERE 😡","post_message":"MADONNA FALLS HARD"},{"comment_id":"10158731027245206","commenter_b":"No pair of shoes, living or dead, is worth 700 buckers. Stop it. This makes me miss the old days, when you'd never hear about some spoiled girl and her \"serious,\" attention-getting problems.","commenter_a":"Material stuff irrelevant .. dog love for ever by the way very ugly shoes","post_message":"This mischievous pup sunk her teeth into some high fashion — literally — when she chowed down on her owner’s new $700 Christian Louboutin heels."},{"comment_id":"832641430106532","commenter_b":"My first thoughts also.. Selfish woman!","commenter_a":"Selfish woman","post_message":"\"...why my wife hid that letter is beyond me.\""},{"comment_id":"10153389617181509","commenter_b":"Tell the pigs this same info.....they dont seem to remember the law and if they need it,give them your info and have them subpoena it...like theyre legally required to do","commenter_a":"No Law or Rule against. As some police assume?","post_message":"A growing number of people are turning their cameras on cops. You can learn more via CNN's latest edition on #Snapchat. @webpagelink #CNNSnapchat"},{"comment_id":"10153265527170950","commenter_b":"Oh stfu","commenter_a":"The blood is on their hands. This is a typical reaction from a Liberal Democrat.. Like a small child they point the blame on some one or something else.. The Democrats have made California a safe haven for Illegals, Criminals and Terrorist with their Sanctuary and open border polices.. The Blood is on your hands Moon-beam.. You and your Lawless Democrats. @webpagelink","post_message":"\"Increased surveillance, creating relationships with mosques in the Muslim American community across the country. We did that after 9/11 and prevented attacks in New Jersey and all across the country.\""}]
