[{"comment_id":"760301420735133","commenter_b":"She should be Punished!","commenter_a":"Smh so much attention on my comment i got exactly what i was looking for... #Exposed","post_message":"Terrible."},{"comment_id":"537545743072047","commenter_b":"Fuck you you damn racist nut!","commenter_a":"Sounds like she just smoked a fat rock. Good job Vice... Keep throwing the crackheads on the top of my news feed. Not sure what I want more this or cat videos...","post_message":"On the Sea Islands along the coasts of South Carolina and Georgia, a painful chapter of American history is playing out again.  Watch our investigation into why Gullah culture is being replaced by waterfront mansions: @webpagelink"},{"comment_id":"1796926360545603","commenter_b":"I well tell you some thing... The isis was made by usa","commenter_a":"Vote Trump. .... what's the matter killary fans u guys worried. ... U should be","post_message":"We are going to get rid of ISIS! America needs real leadership. #MakeAmericaSafeAgain"},{"comment_id":"10152942237502452","commenter_b":"My question is.... Wtf was she doing in lake elsinore....","commenter_a":"Why was she in Lake Elsinore?","post_message":"The owner of Wolfee Donuts in Lake Elsinore wants an apology from Ariana Grande after surveillance video allegedly caught the pop star licking doughnuts at his shop. abc7.la/1CqmnVO   Grande also says \"What the **** is that? I hate Americans. I hate America\" when a tray of doughnuts appears in front of her."},{"comment_id":"10154796667456037","commenter_b":"#NeverTrump #MakeAmericaGreatAgain","commenter_a":"LMFAO Surprise Surprise !!!!!!!","post_message":"“Why should he get part of my rent, and why should his name be on there?”"},{"comment_id":"10154603264491756","commenter_b":"That's a huge stretch of the truth but I'm guessing you prefer a plagiarizing lying college drop out \"model\" as First Lady. And who of all people did she plagiarize? Michelle Obama.","commenter_a":"So phony! Had to be distracted since she probably couldn't give much details of the White House since she spends more time at her house in Hawaii!","post_message":"First lady Michelle Obama says she's only been able to \"rock out\" from the passenger's seat of a car one time in 7 1/2 years — when her daughter Malia learned how to drive."},{"comment_id":"10153358491932217","commenter_b":"where were these anti-facists when Women were attacked in Cologne","commenter_a":"Natalie","post_message":"Bricks were thrown as far-right & anti-racism protesters clashed in Dover."}]
