[{"comment_id":"10154097655775736","commenter_b":"Threatening our non violent non threatening neighbors with war just because why not! Grounds for immediate impeachment!","commenter_a":"And there's no bad hombres up here?","post_message":"\"You have a bunch of bad hombres down there,\" Trump told Mexican President Enrique Pena Nieto, according to the excerpt seen by the Associated Press. \"You aren't doing enough to stop them. I think your military is scared. Our military isn't, so I just might send them down to take care of it.\""},{"comment_id":"963078257120853","commenter_b":"She's an ass","commenter_a":"Idiotic.","post_message":"Hillary Clinton says allowing 10,000 Syrian refugees is a \"good start\", but she wants to bring in 6 TIMES that number."},{"comment_id":"10154452763505575","commenter_b":"That is bullshit...Rasmussen has Trump ahead of that bitch!","commenter_a":"FOX News just reported that Hillary Clinton leads Trump 48 to 41. Basically, they say Trump has lost 3 more points since the debate. Sorry FOX, but I don't believe your bullshit poll and you can take it and shove it up your #NeverTrump asses.","post_message":"It's Happening! Black Vote SURGES for Trump in last two weeks!"},{"comment_id":"10155034427609197","commenter_b":"@username you need to kno this too, @username n Dayna Bianca Haskins too. Pass the word..","commenter_a":"@username fyii","post_message":"Could finding something on your car hood mean your safety is at risk? See why one woman's Facebook post is going viral!"},{"comment_id":"10154189668593352","commenter_b":"Husbands fault!!","commenter_a":"She's young and does not realize the damage that she's doing and the fact that she cannot deny it!","post_message":"Sidechick Embarrasses Wife on Social Media – Posts Videos of Her And The Husband Doing 'You-Know-What'! (PHOTOS)"},{"comment_id":"10153091519691680","commenter_b":"Yeah, but Vance. Don't forget the illegals & their anchor babies ? Factor them in, & you have a wipe out. Yes, foreign, along with illegals, WILL DECIDE THE NEXT PRESIDENT & GOVT","commenter_a":"Democrats only need 38% of the white vote-- we get that with no problem. Romney only got 24% of Hispanic vote and 5% of African American voter. Because of Trump, Hillary will EASILY get 85% of Hispanic vote. Hillary will also score 80% of Asian vote for a landslide win in electoral college","post_message":"Noncitizens are factored into the electoral college. @webpagelink POLITICO Magazine"},{"comment_id":"10154623463961336","commenter_b":"and she wants us deploables to pay for their free ride 😡🙄","commenter_a":"Hillary wants more illegals and she cannot even speak Spanish!","post_message":"Chris Christie slammed Tim Kaine for comments he made accusing Donald J. Trump of inciting violence at his campaign rallies, on \"Fox News Sunday.\" @webpagelink"}]
