[{"comment_id":"10154273015234205","commenter_b":"@username you are so right ! And I'm glad I'm not the only one seeing this woman's racist side. @username you aren't from here your European American ! This isn't your merica it belongs to all the people ! No matter what your ancestors were once undocumented immigrants so don't speak as if you are a true American because a true American would realize that America isn't just for legals. If so you should of been long ago with the Damn mayflower.","commenter_a":"On October 22, 2016 Trump said that we would pay for it and Mexico would reimburse us. Check your facts people. We will get reimbursed through tariffs on anything that has to do with Mexico. Brilliant!!! That's why we hired you president Trump.","post_message":"Will Congress pay for Trump's border wall?"},{"comment_id":"10152824862457212","commenter_b":"Yes of course. The middle aged woman who comes from a upper middle class family. Is going to tell people how to make it. Please go on.....................","commenter_a":"Cue the Conservatives of this state to tell how they worked so hard for their money, and it is everyone elses fault the don't have the means they do. In 1...2...3...","post_message":"Seeking to assess if the Horatio Alger, \"rags to riches\" narrative...remains viable, researchers measured the odds of a child born to parents in the bottom 20% of income earners reaching the top 20%. They then contrasted the chances of climbing the ladder in the U.S. to that in other developed countries. #News9 #CBSNews"},{"comment_id":"10152793243512144","commenter_b":"They all want to save these illegals l, as long as someone esle does it. I say for every liberal who wants a say in this, place one illegal in thier home. That's immigration reform!","commenter_a":"'Overflowing sewage'.......yes liberals are","post_message":"\"Overflowing sewage\" will do that."},{"comment_id":"1011674828909358","commenter_b":"The thought of that ticket is NAUSEATING but a SURE WIN for you DT! The Witch and Crow will cause Havoc where ever they go!","commenter_a":"I am a Trumper and together we will defeat Hillary and her running mate.","post_message":"I hope corrupt Hillary Clinton chooses goofy Elizabeth Warren as her running mate. I will defeat them both."},{"comment_id":"417366948387900","commenter_b":"Hey rhino you want amnesty, and the DOJ candidate Obama and Holder want , your one of five republicans and who would negotiate with a terrorist country ? In sorry you won the election here in SC , your a R HINO ,","commenter_a":"Good point ...........we should be negotiating with Iran!","post_message":"Lindsey Graham has some harsh words for Rand Paul."},{"comment_id":"10152936707532377","commenter_b":"She is a moron","commenter_a":"Nothing","post_message":"What's the Difference Between Democrat, Socialist?"},{"comment_id":"10153154705006051","commenter_b":"Can't stand your ass either","commenter_a":"Can't stand Al Sharpton!! He is an evil racist!","post_message":"Al Sharpton was asked if the $5.9 million settlement for Eric Garner's death was enough. His response: No. He also has another demand. Do you agree or disagree with Sharpton?"}]
