[{"comment_id":"10154474483213812","commenter_b":"Arrested for saving lives........?????? Your mother should have swallowed you.","commenter_a":"Why don't you take care of them too. He should be arrested for illegal immigration. Try and bring Mexicans through the US border and see what happens.","post_message":"Privately owned search-and-rescue company owned by American millionaire has saved 500 refugees and migrants at risk of drowning after only 2 days of searching."},{"comment_id":"1683593111700811","commenter_b":"That's why they have a little pill now called Plan B...take that the day after you're raped if you can't stand to carry the baby and put it up for adoption to a family who doesn't care how the child was conceived! Abortions, especially late term abortions are cruel and inhumane!","commenter_a":"It's planned parent hood they do a lot more then abortions. And @username women chose well some prolly forced so @username women got knocked up because they didn't practice safe sex. I thought women wanted the right to chose what they do with there bodies planned parent hood also helps with women's health who can't afford insurance or hospitals the government cut there funding right? So how can they help these people and if they closed right now you don't think @username people won't find someone else to do abortions. I promise if there not smart enough to use protection and pph closed you would see a lot of dumb young women ending up in ER with a coat hanger hanging out of them. Americans are such pussies anymore of it is not your baby or body and you don't know the person making there chose mind your fucking business","post_message":"Ugh why?!"},{"comment_id":"10153281305806770","commenter_b":"Ladies need to have a knife, walk in pairs and stab to death the attacker. Do not attempt to wound.","commenter_a":"MODERN GERMANS NOT ACCUSTOMED TO ANIMALS","post_message":"The Cologne Carnival kicked off Thursday with 22 reported cases of sexual assaults, including two rapes, despite increased security."},{"comment_id":"10153757259492293","commenter_b":"It's really about saving cash if you don't need boxes remotes and other material it cheaper on your end but much cheaper for them","commenter_a":"Awesome! Tired of the wires and boxes! Yay!","post_message":"This could be a win-win."},{"comment_id":"10152785745546130","commenter_b":"Also this will happen @webpagelink","commenter_a":"This will end the first girl who gets into a HS foot ball team and the guys decide they're not going to pull their hits for her and hit her like a man twice her size. Look women can be tough. BUT the toughest women are weaker than the toughest men. it's called gender dimorphism. Most mammals have it. That isn't to say that somewhere a woman isn't going to show up that can play running back, but with thinner, softer bones she's also more likely to get killed or seriously hurt.","post_message":"She's not going out without a fight."},{"comment_id":"10152577798681316","commenter_b":"A percentage will watch Hannity and cry. The rest are busy being free.","commenter_a":"LOL they said this in 1777","post_message":"Freedom hardly exists in America today, where a family man who helped people purify their water naturally now faces 37 years in prison. Read Daniel Smith's story and support his fight against the corrupt US justice system. @webpagelink"},{"comment_id":"10155160536813132","commenter_b":"I can't stand her...","commenter_a":"I don't know about her being an A-lister...","post_message":"Donald J. Trump spoke out about the decision on Twitter."}]
