[{"comment_id":"10154431251561491","commenter_b":"Well women really do do more domestic work.","commenter_a":"\"This is especially true for women, who researchers suggest should limit their work hours to 34 hours a week; men should limit hours to 47 hours a week. That because, according to Dinh, men spend less time doing domestic work.\" I understand not overworking ourselves...but y'all could have worked a little overtime to make this article a little more fleshed out and a little less sexist.","post_message":"Listen up, workaholics."},{"comment_id":"595624923955506","commenter_b":"yesssss bitch","commenter_a":"@username thought of you bb","post_message":"♫ I'm dreaming of a cheesy Christmas.... ♫"},{"comment_id":"10153234607601491","commenter_b":"Imagine... First lady of America has a sex video. No please!!! Cant call kim a lady!","commenter_a":"Lol","post_message":"Kanye and Kim Kardashian West are looking forward to redecorating the White House."},{"comment_id":"10154162450013812","commenter_b":"This alone would make me patronize your establishment on a regular basis.","commenter_a":"I salute you! way to be a decent human.","post_message":"Pizzeria owner makes it a point to hire workers with disabilities: \"We did it because it needed to be done. There are no jobs out there for these kids, so they are being prepared for nothing.\""},{"comment_id":"10152762111222061","commenter_b":"Real FAT women","commenter_a":"It's time that real women get recognized!","post_message":" I happen to be a size 22, but I am sexy...\" -- Lane Bryant takes aim at Victoria's Secret with #ImNoAngel campaign: @webpagelink"},{"comment_id":"839844146064134","commenter_b":"Women want it all, money,, looks, and a man who does everything right?, that has made me want all the same from a woman, sO far no luck, it's not a hero juzca person who shows love everyday, in everyway and a REAL woman not a Queen to appreciate it!","commenter_a":"If only we were all blessed with that. He's a hero plus a husband who gets it!!","post_message":"SO SWEET! The way to a man's heart may be his stomach, but one devoted husband has proven that women's love can come from a man who can"},{"comment_id":"10154074344751336","commenter_b":"You're an idiot.","commenter_a":"It looks like the liberal PC police culture have hit the Miami police department. Their feelings are hurt so they will be boycotting Beyonce by not doing their job. We need to make sure to send enough panties for them to wear so they can cry comfortably at the boycott. Our officers used to have thicker skin than this. This is a sad day in America when our police officers are crying and boycotting for hurt feelings.","post_message":"Usher, Demi Lovato, Yolanda Adams and The Band Perry are among the contemporary artists heading to The White House to celebrate the late Ray Charles."}]
