[{"comment_id":"824468191027094","commenter_b":"she's so ignorant. Bet she doesn't even know where her clit is","commenter_a":"I Am probably going to make a lot of women mad over this. And yes. I happily voted Trump! My personal beliefs is that our home, church, and country should be the concerns of a MAN. Yes. There are not as many MEN around as there used to be. But my beliefs are that a woman is to further see that the teachings of the man, the guidance of the man, the protections of the man are done. And done correctly. I was very impressed with her work! She done exactly as she should! A very strong willed educated intelligent woman! He obviously has a lot of faith in her! Smart doing so also! Yet as we are saying, those on the left won't say a bit of praise to her. Smh","post_message":""},{"comment_id":"10153752964580575","commenter_b":"I'm ashamed of you Mary, rape is rape. Lord help you if you ever get in that situation.","commenter_a":"I don't doubt Bill Clinton and Bill Cosby were with these women. My doubt comes from what is rape. When a woman wants something from a man and is willing to give sex for it , is that rape ?","post_message":"Bill's past is coming back to haunt Hillary. . . ."},{"comment_id":"10153618033509575","commenter_b":"Seriously? Have some compassion lady","commenter_a":"Dude! Buy an eye patch! Nobody wants to look at an empty socket.","post_message":"An Indianapolis veteran diagnosed with ocular melanoma has filed a tort claim against the VA.  By not ordering an MRI, he says they failed to diagnose a cancerous tumor that not only cost him his eyesight but will take his life."},{"comment_id":"10153546751448352","commenter_b":"Annissa stfu bitch...whites use welfare in illegal ways too...fuckin idiot","commenter_a":"why are people saying \"good job?\" Yes what officers are doing out here is wrong but this guy has nothing to so with that. Innocent cop murdered for someone else's wrong doings. Not right!!!! He had his whole life ahead of him. Truly sad.....we need justice for all who die for nothing. This crap needs to STOP now.","post_message":"NYPD officer, 25, who was 'shot in the face by a career criminal' has died from his injuries after two days in hospital"},{"comment_id":"10153348953162217","commenter_b":"I saw a mother the other day getting into her car with her pjs, slippers and a cup of tea/coffee. I would be so embarrassed to take my kids to school like that.","commenter_a":"It's really difficult to put a top and jeans on. Come on it's 2016 😉","post_message":"\"There has been an increasing tendency for parents to escort children while still wearing their pyjamas and, on occasion, even slippers.\""},{"comment_id":"10153889343021770","commenter_b":"i bet she tried to touch trump with her boobs..","commenter_a":"Lmao liberals","post_message":"BREAKING: Karena Virginia, a yoga instructor and life coach, appeared at a press conference Thursday morning accusing Donald Trump of touching the inside of her right breast in 1998."},{"comment_id":"10154040256123132","commenter_b":"Take her AWAY","commenter_a":"She probably asked for an extension so she could take off far away....","post_message":"The Dance Moms star faces up to 5 years in prison if convicted."}]
