[{"comment_id":"924923120897717","commenter_b":"That is what the Supreme Court is for! To keep the Executive branch from VIOLATING THE HOLY MONKEY SNOT out of the Constitution. This administration is shameless and arrogant to the EXTREME!","commenter_a":"Yes","post_message":"A Federal Court upheld a block on Obama's executive amnesty. Do you support their ruling? -- COMMENT with YES or NO"},{"comment_id":"10155285284005389","commenter_b":"This woman is deluded! I think our entire State Department is.","commenter_a":"What a dumb liberal idiot.","post_message":"“We cannot win this war by killing them [ISIS], we cannot kill our way out of this war.”  That is according to our very own State Department.  State Department Deputy Spokesperson Marie Harf told Chris Matthews that we cannot win this war against ISIS by killing them.   So what is her solution to stopping radical Islamic terrorists from murdering and taking over territory?   Job opportunities.  Seriously!?"},{"comment_id":"1018537924833053","commenter_b":"Teenage girls are creating life inside them all the time. Seems pretty easy to me. The quote is about the creation, not the maintenence of said life, so I'll leave it at that.","commenter_a":"Creating a life is actually one of the easiest, most instinctual acts all mammals share... It's not difficult at all. Properly caring for one is something else entirely.","post_message":"Wise words from Robyn Lawley: \"You created a life inside of you, that's no easy feat.\"  (via HuffPost Canada Parents)"},{"comment_id":"10153975105390950","commenter_b":"Lock her up for life","commenter_a":"Sounds like she should have found a new career. A long time ago","post_message":"In one incident, the woman hung up on a caller reporting a robbery at a convenience store. The man called back and spoke to a different operator, but by the time police arrived, the store manager was dead."},{"comment_id":"10152955044437293","commenter_b":"The evangelical pastors insist that only God can change the climate and that is an affront to God to claim that Man can do so. The ideologues constantly scream that the scientists, left-wing and Al Gore are in a conspiracy to 'steal our liberty.' using climate change to bring about global government. --- BTW. I am GOP and have been for decades. I also listen to Rush Limbaugh and Mark Levin, but unlike --- what is the word? sheeple? --- I don't check my brain at the door and believe everything I am told, like someon who listens to that \"lamestream media.\" --- As for today's GOP, it is nothing like the one that Reagan led. He would not have tried to squash any talk about climate change, prevent any reference to it in schools, or cut funding for research into what is happening in our climate. But that is ...","commenter_a":"The deniers have wax in their ears and a blindfold over their eyes--because they prefer to think that their ideology or religion is under attack by all of this (and are encouraged by the oil and coal companies to believe just that).","post_message":"And scientists are concerned."},{"comment_id":"10153171684108352","commenter_b":"Gun or no gun this girl would have stabbed him. And believe me, I would have too.","commenter_a":"And why do kids have access to guns?????","post_message":"Florida sisters, aged 15 and 11, are charged with murder of 16-year-old brother who they shot dead"},{"comment_id":"10153304270661051","commenter_b":"(Sigh) Non sequiturs everywhere.","commenter_a":"So. Arrested him for killing a lion and thugs that kill cops are going free what's wrong with picture so animals are more important than people's lives","post_message":"Cecil the Lion's hunter has been arrested."}]
