[{"comment_id":"10154113353450329","commenter_b":"@username the souls one makes me think of you lol","commenter_a":"Elyse Landolfi","post_message":"keep it simple"},{"comment_id":"10153649297241756","commenter_b":"William, the real shame is that this woman has likely already procreated or will procreate and pass on her low level of intelligence and ignorant, backwards redneck beliefs onto her offspring.","commenter_a":"As a historical relic, it belongs in a museum. The Confederates lost the war. The only flags that should be flying at the South Carolina Capitol are the United States & South Carolina flags.","post_message":"The crowd chanted \"USA! USA!\" as the flag was lowered."},{"comment_id":"10156419798640354","commenter_b":"John Lansing Hillary is a right winger?? She is the queen of liars!1","commenter_a":"What a tool Brokaw is.. people actually saw it too.. WE KNOW who is spreading lies and it's not Donald J. Trump","post_message":"You saw what Tom Brokaw said on-air this morning, right?   If not, we've got the VIDEO for you here..."},{"comment_id":"10153579142479170","commenter_b":"she's never right !","commenter_a":"Sorry the American voters frustrated you. You can just stay home and learn to deal.","post_message":"According to Hillary, we're all just too stupid to understand how brilliant she is. She gets frustrated by that, and admits that her frustration is her \"greatest weakness.\""},{"comment_id":"1115619658459044","commenter_b":"Yep. We're all whiney bitches to the gov and they'll find any means of manipulation and control. Welcome to the machine as we're all it's little bitch.","commenter_a":"You all are just a bunch of whining bitches!!","post_message":"Go California!"},{"comment_id":"10153959517171337","commenter_b":"\"Drink the kool-aid.. Sheep.. Libtard... Scandals...\" Meanwhile, there's Trump. All of those things wrapped into on ball of hair. HA HA HA!!","commenter_a":"Haha that bitch will do anything for votes. She's trying to win the young/urban vote lol tomorrow she'll be in overalls with a straw in here teeth talking to some farmers. Line up kids, get your blow job from Hillary !!!","post_message":"R.I.P Dabbing  @webpagelink   (2015-2016)"},{"comment_id":"1732269190330470","commenter_b":"Lol sure","commenter_a":"This just in, scientists baffled that the universe is not that old, may have been created by a a Supernatural being....\" I can't wait.","post_message":"The breakthrough could offer greater understanding of the Big Bang among other things. @webpagelink"}]
