[{"comment_id":"10153545958041509","commenter_b":"Did @username edit something out of the audio the first time the guy got out of the car?","commenter_a":"He was definitely not a threat running away.. He should have sat in the car.. But the officer's job was to arrest him.. But instead he chose to execute him and then tried to frame him.. Both made wrong choices but the officer took a life!","post_message":""},{"comment_id":"10153400883926813","commenter_b":"@username SHE is a girl.","commenter_a":"I love this brave kid.","post_message":"Great victory today! Court rules in favor of our client, transgender student Gavin Grimm, in his challenge to Gloucester High School’s discriminatory restroom policies!  Watch Gavin's video where he stands up for students everywhere."},{"comment_id":"10153230993584342","commenter_b":"No. Lol. I would have done that too.","commenter_a":"The restaurant manager obviously handled the situation poorly. She waited too long to intervene and then did it in anger. That is unprofessional. BUT.... The parent who allows their child to disturb all the people around them trying to enjoy a meal is inconsiderate and selfish! The excuse that the child is waiting too long for food is poor at best. You as a parent and should come prepared to entertain your child... That includes providing them snacks and toys. The parents should have removed that child from the table within 5 minutes of the unresolved tantrum. Yes... I am a parent and never allowed that to happen. Remember that you are not the only person in that establishment spending hard earned money to enjoy a simple meal!","post_message":"DINER OWNER YELLS AT CRYING CHILD: \"I turned around, slammed both hands on the counter and then pointed at the child and said, 'This has got to stop!'\" said Darla Neugebauer, after she says a toddler cried for more than 40 minutes. The child's mother is furious. Did the diner owner go too far?"},{"comment_id":"10153352212341162","commenter_b":"So, Michael \"TheArtist\" Louis, what you're saying is- the young man in the meme isn't \"black\" enough for you? That only people who subscribe to the stereotypical depiction of how black people dress and behave are \"real\" black people? If that's not racist against African Americans, I don't know what is... Smh. And isn't the point of ending racism getting AWAY from stereotyping based on the color of a person's skin? The funny thing is, the meme maker -who is presumably black based on what the meme says- is *trying to* say that white people are racist, when in reality - they have such deeply rooted issues of their own that they didn't even realize their meme was racist against themselves. Start with yourself...","commenter_a":"Looks like she for sent home for having a black date nothing's wrong with her dress","post_message":"TOO REVEALING? A girl was sent home from prom because school officials thought her dress showed too much skin. What do you think?   PHOTOS: @webpagelink"},{"comment_id":"470911213097172","commenter_b":"Muslims offend me, so I want Muslims banned from America.","commenter_a":"Your face being covered offends me.","post_message":""},{"comment_id":"1314229205273274","commenter_b":"Stupid, greedy women who don't respect themselves LOVE Trump. I mean, look at his wife.","commenter_a":"So they're trying to use looks to get people to vote for a man who half his party do not even like.","post_message":"People started freaking out when the hashtag #TrumpGirlsBreakTheInternet started trending Sunday night."},{"comment_id":"10154242038366323","commenter_b":"If someone voluntarily choses this classless \"job\", they deserve anything and everything that might come their way. I have no sympathy with whores and sluts, be they male or female. Why should I?","commenter_a":"Are you kidding me? Political correctness has come to THIS? The authors ersatz rationalization is nothing more than a peurile legitimization of prostitution. Call it whatever you like and for whatever reason, prostitution is prostitution, period. The whole point of the world's oldest profession is to exchange sexual favors for money. That prostitutes, no matter the reason, willingly engage in the services they offer is no reason to create bogus excuses for the consequences. If the sex worker - and make no mistake, that's what they are, regardless of their sex - comes away psychologically damaged, well, that rather goes with the territory of the profession. That is their problem, not anyone elses. In case they hadn't heard, prostitution is illegal. Why should taxpayers be burdened with caring for their psychological ills? As it is, sex workers already reap the benefits of medical attention at emergency rooms or through state ...","post_message":"\"If, while having sex with someone, you feel repulsed by them touching you, afraid of what they might do, degraded and humiliated by the sexual acts – the fact that you’ll get a bit of cash at the end does not change anything. There is no invisible hand in the prostitution market that magically disappears the lived experience of sexual abuse.\""}]
