[{"comment_id":"10152858304201336","commenter_b":"Enough is enough time to start locking these mothers up. They think they can just take over everything","commenter_a":"Man why doesn't this stuff happen in areas I'm in? I would never try to shout these people down. I'm going to physically knock them down. I simply cannot stand, nor will tolerate, this level of open disrespect. You have a right to protest, my right to protest in return is my choice, by the means I choose necessary.","post_message":"The protesters did not stop shouting until 100-year-old U.S. Navy vet Dario Raschio spoke up and said, \"Give me a chance. At least let us show a little respect for this occasion.\""},{"comment_id":"991442284225448","commenter_b":"Matthew Acheron","commenter_a":"Daniel Kulick","post_message":"Nintendo introduces Linkle, a female version of The Legend of Zelda's Link."},{"comment_id":"10153220467940950","commenter_b":"Lets hope for something known as KARMA, mf'r.","commenter_a":"That's so wrong","post_message":"A video showing a McDonald's drive-through worker offering a reportedly homeless man a burger and then throwing water in the man's face is quickly moving through social media waves."},{"comment_id":"10153468728217507","commenter_b":"By RIGHTS she should be arrested, Constititutionally tried on TV and executed for TREASON. The first woman","commenter_a":"Hillary is a disgrace","post_message":"47 more states to go!"},{"comment_id":"1744837412449340","commenter_b":"that depends upon whether they can pass a rigorous background check.","commenter_a":"\"Absolutely!\"😎👍🏽","post_message":"Do you think lawful, gun-owning citizens make America a safer place?"},{"comment_id":"10153171186966051","commenter_b":"stand your ground. no to muslims","commenter_a":"I would say no no no","post_message":"The people in this town are prepared to do whatever it takes to keep a Muslim cemetery out. In fact, they have one very specific idea in mind."},{"comment_id":"1777693052452722","commenter_b":"NOTHING BUT A BUNCH OF FILTHY FUCKING NIGGERS KILL THEM NOW!!!","commenter_a":"Come and get it you cowards. I'm just about fed up with idiots like you. Have you ever looked at who's out number.","post_message":"RACISM: Black Panther Promises To Kill All White Babies.  No media outrage, no riots, nothing.  Do you think they should all be arrested?"}]
