[{"comment_id":"10153126683228854","commenter_b":"Criminals almost never kill themself.","commenter_a":"So what do you plan on doing about this old info ?","post_message":""},{"comment_id":"10153333676096680","commenter_b":"Yep, karma is a bit*h !!","commenter_a":"This is the best election ever! The irony of Republicans being upset about the Pope questioning the religion of a politician is absolutely overwhelming...considering the constant questioning and outright ignorance about the faith of President Obama. And do not get me started on them running a Canadian after 8 years of racist birthers.","post_message":"He's mad."},{"comment_id":"661747857265261","commenter_b":"@username in LA-LA Land - Run back to the boarder and GET THE FUXK OUT OF MY COUNTRY!","commenter_a":"Then he obviously didn't listen to the end. Bibi gave 3 more stipulations that were very clear to add to the table","post_message":"US President Barack Obama says that Prime Minister Benjamin Netanyahu “didn’t offer any viable alternatives” to the current P5+1 negotiations in his speech to Congress.   #NetanyahuSpeech"},{"comment_id":"10153544457476509","commenter_b":"Thanks","commenter_a":"Why are animals doing what animals do all of a sudden national news?","post_message":"What a catch! Hear photographer John Bailey describe stumbling onto the powerful sight of a bobcat pulling a shark from the ocean: @webpagelink"},{"comment_id":"10154876019385329","commenter_b":"Better fat than a dumb Mexican. Have fun once trump is elected. Fool. Lol","commenter_a":"\"Fat\" the word you are looking for is \"Fat\"","post_message":"Simone Mariposa told BuzzFeed News she created #WeWearWhatWeWant to \"highlight plus-size girls making unconventional fashion choices, and looking amazing\"."},{"comment_id":"10153506761069091","commenter_b":"Imagine if nothing was found like the weapons of mass destruction....mmmmm and you are right @username","commenter_a":"Yes","post_message":"Should Apple be required to help police unlock the San Bernardino gunman's phone? @webpagelink"},{"comment_id":"1108523962492406","commenter_b":"Illegal aliens 62%!","commenter_a":"Most people on welfare are in a red state and are white. @webpagelink @webpagelink Undocumented immigrants pay taxes all the time. \"The 11.4 million undocumented immigrants currently living in the United States collectively paid $11.84 billion in state and local taxes in 2012. ITEP’s analysis finds their combined nationwide state and local tax contributions would increase by $845 million under full implementation of the administration’s 2012 and 2014 executive actions and by $2.2 billion under comprehensive immigration reform.\" @webpagelink","post_message":"Fighting off anti-immigrant myths with FACTS."}]
