[{"comment_id":"184666305270788","commenter_b":"This stupid woman is probably senile!","commenter_a":"Another lying liberal...we should be surprised?","post_message":"Wow! She didn't think we would find this letter!!"},{"comment_id":"1260466927330937","commenter_b":"@username agreed! She's a fecking CRIMINAL... PERIOD!","commenter_a":"Watergate would be jaywalking compared to the Clinton scandals","post_message":"Rudy Giuliani claims the Clinton Foundation scandal will be \"bigger than Watergate.\" Do you think there is truth to what he is saying?"},{"comment_id":"10154089965446336","commenter_b":"Yeah, lice likes very clean hair. If you put products in their hair it's likely they won't get it. Oily hair care products are","commenter_a":"It's not super lice it's called...ignorance. Schools inform by sending a note that lice has been found in the classroom. The person is not identified at all..not even to the parent. Infested child goes untreated. Why? The same reason some are abused and some are not, the same reason some parents care about their children and others don't. Children are going untreated and/or not treated properly. This has been going on for years.","post_message":"What can you do if your child is affected?"},{"comment_id":"1747275395512005","commenter_b":"@username if it isn't Mr. Trump YOU will be voting in Hillary","commenter_a":"The only thing that needs to change is HIM OUT OF THE WHITE HOUSE.","post_message":"Obama says \"we\" need to pray for the \"strength to change.\" It's yet another of his disgusting refusals to acknowledge the realities we face."},{"comment_id":"10152777121252217","commenter_b":"Lots of girls called Charlotte if u want to call her it then do nobody will care","commenter_a":"Well we are due a girl in 6 weeks and charlotte was on our list of names 🙈 Well thats not going to happen now because there will be thousands choosing it because of the princess lol","post_message":"#RoyalBaby: Introducing Charlotte Elizabeth Diana - she'll also be known as HRH Princess Charlotte of Cambridge"},{"comment_id":"468706906587237","commenter_b":"She is a Dumb Idiot!","commenter_a":"We dont need awoman Preident .that is for immigration ....","post_message":"Carly Fiorina just had these harsh words for Donald Trump. Do you agree or disagree?"},{"comment_id":"10153018811005927","commenter_b":"@webpagelink #dontbesilent this woman can NOT be the President of our country","commenter_a":"Wrong wrong wrong, what has happened to the USA and right and wrong?","post_message":"How did the media miss this?"}]
