[{"comment_id":"1002708926488828","commenter_b":"Syrian refugees will be coming in legally. They will be documented and traced. If they wanted to sneak terrorists in the country they could do it through our southern border without much problem. AND they probably have. I would prefer that we only accept families and no single men.","commenter_a":"This breaks my heart","post_message":"If we don't know our history, we're doomed to repeat it.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153141059471336","commenter_b":"BRAVO, Joe Prothera and AMEN!","commenter_a":"There is a way for a change u nid jesus the holy spiritto save u brother::::: beleaved in him","post_message":"BREAKING UPDATE: Jury finds Boston Marathon bomber Dzhokhar Tsarnaev guilty on all 30 counts.  He is eligible for the death penalty. @webpagelink"},{"comment_id":"708523179338260","commenter_b":"Bust his ass .","commenter_a":"kick its ass out of the school","post_message":"Cross dressing boy entered girl's locker room and did this.  This is wrong. The boundaries need to be drawn.  Would you want this boy in your little girl's locker room?"},{"comment_id":"920378308055224","commenter_b":"Chris, stupid bitch, For Real, and there's the hate card you stupid impotent motherfucker.","commenter_a":"Hey it could have been done sooner. White priveledged males prevented it.","post_message":"EXCELLENT news!"},{"comment_id":"452057048331142","commenter_b":"I'm in love I think! She hit the nail on the head.","commenter_a":"You tell'em Grans....","post_message":"Race-Baiting CNN Host Is Shocked At Grandma Answers To His Questions:  is no such thing as  privilege' [VIDEO]"},{"comment_id":"895664467159698","commenter_b":"Elinor, cite your source. As recently as 2010, the Democrats made a former member of the KKK President pro Tempore of the Senate. Shawn, who these people may have voted for is irrelevant. A lot of Obama supporters are criminals. Does that mean they all are? Do you judge an entire group by the behavior of a few?","commenter_a":"I can explain it easily. THEY'RE NOT CONSERVATIVES!!! Liberals and conservatives aren't the only labels that exist to identify people. If you're claiming that they represent conservatives, you are at best, a cherry picker. But liar is the more appropriate label.","post_message":"Conservatives welcomed President Obama to Twitter in the only way they know how: By calling him a \"n*gger.\""},{"comment_id":"10153278392893352","commenter_b":"Bitch,just ruined my happy day.","commenter_a":"She neither loved her children or deserve to be called their mother. Her hatred for her husband superseded the lives of her children.","post_message":"Mother ‘burned her three children to death and rang their father so she could tell him “Listen to their screams – they won’t survive” after he demanded custody in Belgium’"}]
