[{"comment_id":"10154592640014411","commenter_b":"actually, feminists hate people forcing women to wear/do anything, which is kinda what a ban amounts to.","commenter_a":"Burkini is everyrhing that a feminist hates,so how can feminists agree for that?","post_message":"'...attempt to raise profits and exploit a gap in the over-saturated clothing market is selling and promoting allegiance to ISIS?'"},{"comment_id":"945163755529692","commenter_b":"The teacher needs the bag a brown bad cause she butt. Ugly","commenter_a":"What the hell","post_message":"An after-school elementary teacher is accused of putting a plastic grocery bag over a child’s head until he could no longer breathe: @webpagelink"},{"comment_id":"10152842809974877","commenter_b":" how do these hoes even get in ???!?? I wana know HOW ?! Lol","commenter_a":"How does this even happen wTF? @username","post_message":"Gang Leader Who Impregnated Four Prison Guards Gets Reduced Sentence. Read and watch more on this prison corruption case and his deal.   Grio fam, sound off with your thoughts on this case."},{"comment_id":"10154177685016943","commenter_b":"Quit talking about it and do something! Put her in jail!","commenter_a":"Enough already with the disclosures. I'd be happy with just one little indictment.","post_message":"Hillary Clinton has taken a beating this month over the discovery that donors to her family charitable foundation received special treatment from the State Department when Clinton was secretary of state. And she unlikely to get a reprieve before Election Day, as the organization behind those email disclosures expects several more headline-grabbing document dumps in the next 11 weeks. - via Newsweek"},{"comment_id":"10152758880516636","commenter_b":"Would it mean I get to touch a woman?","commenter_a":"No i would get stage freight","post_message":"Who actually volunteers to have sex in a laboratory?"},{"comment_id":"1790539951180053","commenter_b":"Yes I'm so glad we have had 164 shootings still at war . and trillions more in dept millions more in wellfare a totally screwed up healthcare system. Iran nuclear deal giving Iran billions . can't read it if you don't sign it . let's lie to the Americans because they are to dumb to see it . it was a video we are sorry ,sorry you destroyed our embassy killed raped and mutilated our people. Here is a couple of billion dollars and forget what you already owe us . oh and can we raise the dept drilling again or we won't pay SSI to the people who ducking paid into it . but let's keep those welfare checks going got to keep my peeps happy . get Chicago how are those tough gun laws going , highest rate of gun crime in the country . yup more gun ...","commenter_a":"Thank you GOD for giving us President Obama for two terms!!!!!!","post_message":"Hear that Donald J. Trump? President Obama DGAF about how you describe a terrorist attack."},{"comment_id":"979014955531025","commenter_b":"Yes yes Milana the porn star.","commenter_a":"Did anyone besides me have flash backs to Jackie Kennedy when Melania walked out Classy dressed to the nines This lady loves America This lady will be a great first lady","post_message":"Donald J. Trump made a dramatic entrance at the GOP convention and introduced his wife Melania Trump. #RNCinCLE @webpagelink"}]
