[{"comment_id":"10153380129759087","commenter_b":"The countries that ban him should take the refugees. If they want to stand up for them so bad, take them. Oh ya, Dubai won't take any refugees. They are just hypocrites.","commenter_a":"Another great endorsement to vote for Donald Trump. Way to go Dobye.","post_message":"Donald Trump's name has been removed from a multi-billion-dollar luxury golf course project in Dubai in the wake of public outcry over the GOP presidential candidate's proposal to ban Muslims from entering the US."},{"comment_id":"10154402963106729","commenter_b":"and..... Beyonce needs to get the hell out of the United States of America!...","commenter_a":"Our police are just doing their job and taking out the trash.","post_message":"Everyone needs to see what he sent Obama...POWERFUL."},{"comment_id":"10153675187678352","commenter_b":"Trust no Bitch","commenter_a":"On the next episode of Orange is the New Black....","post_message":"‘You might as well go ahead and execute me, because I’m not going to make it to 73′: Woman, 51, who beat her friend to death with a slow cooker in a row over politics is jailed for 23 years"},{"comment_id":"1142380192485341","commenter_b":"Wow are you serious they are trying to take out the Americans 1 job at a time and all the free handouts our government will give them. While our own government let's the Americans suffer by allowing them to free load off our system. Really they get social security for what . Americans get denied SSI while the immigrants step right up and no problem. really ?? Go Trump","commenter_a":"Welcome to the future!!!","post_message":"Nearly 40% of less-educated, working-age Millennials ages 18-29 don’t have a job.  That’s more than 15 million young-adult high school grads and high school dropouts who aren’t working."},{"comment_id":"10153541203558690","commenter_b":"She's a recovering alcoholic...... That says it all right there","commenter_a":"Living within your means should not mean living in a cardboard box or struggling to pay for minimum needs! What a selfish ignorant thing to suggest! Low wages determine the quality or lack of it in your life, it also means absolute lack of choice!! It absolutely sickens me to read the suggestion that if you are working and struggling it is automatically your own fault! Life happens and not always by our conscious choice! There are many many external influences that can alter your existence negatively! The American dream is a distant illusion for millions of people! In many instances through the greedy manipulation of conglomerates and the loaded banking system! Please don't give me the tired \" think and grow rich \" schemes! I am an old chook, I've known uber wealthy and the other end of poverty throughout my life! Wealth is mostly \" built upon the ...","post_message":"While the debate over minimum wage continues in the US, Emilia Stancati , a 50-year-old who has worked as a waitress for most of her life,  falls further into credit card debt as her  job fails to cover her bills.    Watch the latest episode of Hard Earned:   @webpagelink"},{"comment_id":"10153147185484342","commenter_b":"Bruce Jenner is a woman, this lady is black, and I'm a billionaire.","commenter_a":"Since she was 5? Then this just didn't happen since she entered into adulthood. She had a identity problem since she was a kid and I blame her parents on that because they should've noticed it way back then. To all you parents out there who have little kids, pay more attention to your kids.","post_message":"\"I was drawing self-portraits with the brown crayon instead of the peach crayon.\"  #RachelDolezal has broken her silence, saying she started identifying herself as black around the age of 5."},{"comment_id":"1263136400442382","commenter_b":"You mean Country before party right","commenter_a":"Bunch of bullshit. They need to do there job. Party before country.","post_message":"WOW."}]
