[{"comment_id":"374997102688584","commenter_b":"she broke the law driving illegal you an i would be locked up so give her 30 days an feed her the same as they feed everybody else might make her see the light or get the hell out","commenter_a":"Tuff shit!! Take it off!","post_message":"Should head scarfs be banned in America?"},{"comment_id":"10153312840067098","commenter_b":"My point is, YOU don't know what people do.","commenter_a":"How about we worry about our homeless vets and not other countries people.","post_message":"The results come amid a heated debate in the wake of the attacks in Paris..."},{"comment_id":"1040915009338084","commenter_b":"@username your argument fails in a few ways. 1. A child is not a child until it is born. 2. Her body, her right. 3. What if she was suffering complications from said pregnancy? What if she was raped? What if it was incest? Would you still argue that she hasn't the right? Because if so, you're giving a living woman less bodily autonomy than a corpse.","commenter_a":"good","post_message":"There has been no time since Roe v. Wade when abortion hasn’t been under attack... But this moment is different."},{"comment_id":"10153416828258525","commenter_b":"Sure hope he's single so girlfriend or wife don't wipe him out and leave him with nothing JS","commenter_a":"Paige Zirkle Calhoun","post_message":"$2 MILLION FLORIDA WINNER: Not only did the Sanford teenager match all five numbers, it was his first time playing and he used a play slip that he found that was already filled out!  STORY: @webpagelink"},{"comment_id":"10153595833422439","commenter_b":"@username - stop them in their tracks? When? So far we've done nothing and the media's not reporting on stuff as ordered by our gay muslim prez! Meanwhile he's flying hundreds of thousands more in and setting up cells all over our Country. Trey Gowdy tried to stop it in SC and the planes and buses keep coming and dumping them.","commenter_a":"I don't think the muslims fully understand that the American people will unite and stop them in there track. God Bless America","post_message":"Coming to America. It’s just a matter of time. The only difference between Islam in Europe and Islam in America is we started importing whole Muslim communities a lot later than Europe. But we are on the same path to ruin."},{"comment_id":"10154784936184614","commenter_b":"We keep building houses, taking away the land near the hills. where else are these animals supposed to go? if you want to live out there, keep your little ones inside. the animals were there first.","commenter_a":"Lol i guess those dogs was watching to much YouTube where people had their dogs chasing away mountain lions and big cats thinking they was really scared of a dog lol guess again.","post_message":"\"This video is heart wrenching,\" says a Rancho Cucamonga animal-lover whose security cameras captured his dog being dragged to its death by a coyote.   Oliver, a 9-year-old dachshund, was chasing the intruder coyote away from his sister dog when the wild animal grabbed him.  \"Even a 7- foot wall won't keep your pets safe,\" the homeowner warns.  Read KTLA's story here: @webpagelink"},{"comment_id":"10153202617203690","commenter_b":"Stupid girls!!","commenter_a":"We must ask ourselves why and find the antidote. The only way.","post_message":"Security forces estimate some 600 British Muslims have travelled to Syria to join the conflict there, some of them with the Islamic State of Iraq and Levant group."}]
