[{"comment_id":"836801636436616","commenter_b":"Any one doing this should be around up put in jail and when it is time to get out they should be deported","commenter_a":"And those BASTARDS in DC want to bring in over @username in the next two years. HELL NO","post_message":"Broad daylight in Germany. Watch Muslim 'refugees' beat the crap out of this mom and daughter. Can you say, 'extended magazines?' @webpagelink"},{"comment_id":"10153560917566615","commenter_b":"Get off of here Martha","commenter_a":"Who cares he got away with rape.","post_message":"WELCOME TO STEELERS NATION, BABY BODIE!  The newest addition to the family of The Pittsburgh Steelers QB Ben Roethlisberger is right along side the rest of the City of Champions tonight, cheering on the Pittsburgh Penguins to a Game 7 win! LET'S GO PENS!  (Photos courtesy of Ben Roethlisberger - BigBen7.com)"},{"comment_id":"10154428619792144","commenter_b":"Kimberly, other than Melania Trump, you wouldn't know an illegal immigrant from a U.S citizen if your life depended on it. Get ahold of yourself woman!","commenter_a":"Seriously????? Let it go.....He's done, THANK GOD!!!!!! The end of an ERROR....","post_message":"Thank God."},{"comment_id":"1011637472207253","commenter_b":"Fuck drake ol biting ass nigga","commenter_a":"Fuck drake. He ripped off some shit from the nineties. Don't get crazy all you drake heads he is just trash anyways. pop not hip hop so don't disrespect hip hop by putting his name in the same sentence","post_message":""},{"comment_id":"1107746175912227","commenter_b":"@username -- The women lied under oath and colluded. I'd call that misandry, not misogyny.","commenter_a":"And the feminist backlash begins in 3...2...1","post_message":"Former CBC host Jian Ghomeshi has been found not guilty of sexual assault and choking.   Full story: @webpagelink  (Photo: Chris Young/Canadian Press)"},{"comment_id":"10153465361664714","commenter_b":"I'm just sorry u all have to go thur you show up lifting an I'm praying they do not take it of. I've been in your shoes girls,an the ownly way is to move on is to try an find a way to forgive an forget,I. Found it in my bible there isn't one single person out there that donest havesomething bad or a secret hidden in their closet, I'm just sorry something as this is blown so far there,but I can say this ,I love the show an praying it back on u r like my family,an I'll miss u.","commenter_a":"In not excusing at all what he did, but how is he a pedophile or rapist? Kids touching kids around their own age aren't pedophiles. It's molestation, yes. When an adult touches a child in a sexual manner, that's a pedophile. A rapists is some one who rapes another person. He didn't have sex or oral with his sisters. He's not a rapists and he's not a pedophile. He was a molester. I'm not saying what he did was nothing, but can we call it what it is without adding false titles? The diggers called trans people pedophiles and we no that's bogus, but do we need to stoop down to their level? If we do, we're just as bad in our thinking as they are.","post_message":"More on the 19 Kids and Counting scandal."},{"comment_id":"10153222476276323","commenter_b":"Breasts are breasts. get over it.","commenter_a":"The fact that womens nipples are considered porn and men's not, given the fact that ours are literally NEEDED as a vital source of nutrients for children is a notion that needs to be challenged. How can something that provides the best source of nutrients for a baby be considered too obscene to be observed in public where as men's which are just another body part be considered fine?! Free the nipple doesn't require a woman to bear all. I won't be, I've had no reason either functionally or otherwise to display mine in public (it's a bit cold in this part of the world) but my body is not obscene. I totally support the women doing this. If nipples are so provocative it's the sexualisation that society places on women not the female nipple owners that are the problem.","post_message":"\"It has to be said that, to the casual observer, the #FreeTheNipple campaign is a very confusing thing. Let’s just get this straight, one might say, it’s a feminist movement that encourages toplessness, and which has led to an Icelandic MP, respected as a serious parliamentarian, getting her boobs out for everyone to see. And you’re telling me this is one in the eye for the patriarchy?\""}]
