[{"comment_id":"1188981914457930","commenter_b":"A better statement than any feminist has ever made...","commenter_a":"Curtis Oakley","post_message":"They are doing it for a powerful reason."},{"comment_id":"782996508468592","commenter_b":"@username You know nothing fool.","commenter_a":"U.S. Attorney General Loretta Lynch is an idiot. Her and the Obama Gang are clearly violating the US Constitution and disregarding the rights and safety concerns of women and children. She should be hauled into congress for questioning.","post_message":"Just in: U.S. Attorney General Loretta Lynch announces that the Justice Department is suing North Carolina over bathroom law. \"This action is about a great deal more than bathrooms.\" @webpagelink"},{"comment_id":"10153326828766350","commenter_b":"Why would you call her a whore?","commenter_a":"Nobody cares!!!! Kardashians are talent less media whores!","post_message":"Kourtney Kardashian's response to critics? To just keep posting those pics!"},{"comment_id":"1070107396359933","commenter_b":"She would have to drug me like Bill Cosby does his women","commenter_a":"This gal needs to get laid.","post_message":"“Her conduct and behavior are appalling, and I am not only disappointed, I am angry, that a member of our faculty acted this way.\""},{"comment_id":"885087015015208","commenter_b":"She needs to move on and except defeat u fucking scumbag criminal","commenter_a":"Yes","post_message":"What a sore loser. She needs to come grips with reality. Are you glad Hillary is not going to be our president?"},{"comment_id":"10153786734045329","commenter_b":"Hahahahahahaha!!!! Omg!!!! It's like we're on the Truman Show!!!","commenter_a":"@username!!!! Holy moly!!! Lmao","post_message":"\"If we're still single when we're both 39, can we have babies together?\""},{"comment_id":"1415709005136234","commenter_b":"And that makes you a sissifed bitch punk your mom is more of a man","commenter_a":"Here is your first lady wanna be conservatives. #REPUBLICANFORSALE #NeverTrump.","post_message":"They REALLY think they have her here. But here’s the thing…"}]
