[{"comment_id":"10153312472421323","commenter_b":"Over kill..............","commenter_a":"It's a wonder the shells didn't bounce off the medals.","post_message":"Hyon Yong Chol, who heads the isolated country’s military, was purged and then executed by firing squad with an antiaircraft gun, watched by hundreds of people, South Korean media reported on Wednesday."},{"comment_id":"10153058052287452","commenter_b":"Scum bags","commenter_a":"Trump be like \" bet they were Mexicans \"","post_message":"Gone in 90 seconds!   A burglary crew crashes an SUV right into a clothing store and dashes off with thousands of dollars in merchandise.  Not even steel security gates could stop this crew. Tonight, the hunt to catch the cunning crooks who knew exactly which designer threads to grab. Tonight at 11 from ABC7 Eyewitness News. abc7.la/1FenO5y"},{"comment_id":"10153183200188812","commenter_b":"They want marijuana sellers to be kept on jail for the lesson to make sure that they won't save lives of people who needs it, so more people can rely on prescription pills... There are cruel rich doctors out there who would pay the cops for good amount of money to keep their business running. Money ruins everything.. 55 years is too much. Child rapist should spend 55 years, not marijuana sellers. People sell drugs to provide for their families. Not everyone do it to get rich for themselves. Low income families has it harder when providing family because of health issues.. Some marijuana sellers could be good people too, it is just unfair to put them in jail for 55 years. How ironic that McDonald and other fast food chain restaurants sells junk food that can harm a lot of people while marijuana harms less people... But they can ...","commenter_a":"Those that advocate for and enforce these cruelties are the real criminals.","post_message":"“We have escalated punishments to the point that it’s crazy…\" -- The cost of a 55-year sentence for marijuana: @webpagelink - Tonight on Nightline"},{"comment_id":"10154789649578256","commenter_b":"@username. Does a strong woman and her opinions scare you?","commenter_a":"This just makes me laugh at how low the democrat communists have slunk.","post_message":"Donald Trump knots his ties so that they hang well below his belt buckle — often several inches, a fashion-don't so egregious that GQ recently used it as the subject of a photo spread titled, \"The one style lesson you can actually learn from Donald Trump,\" columnist Eric Zorn writes."},{"comment_id":"10154338661984087","commenter_b":"Keep sucking off your Arab whore","commenter_a":"Raper of Ex Wives and groper in chief","post_message":"“Look to his past to see what he will do for women in this country,” Omarosa said about Trump."},{"comment_id":"1227346897337998","commenter_b":"Idiot sick woman","commenter_a":"Good thing we have wikileaks and Project Veritas for the truth. Trump/Pence 2016 #draintheswamp #hillaryforprison #spiritcooking","post_message":"JAY Z said he doesn't have any \"ill will\" toward Donald J. Trump, but he \"cannot be our president.\" Before introducing Hillary Clinton onstage with Beyoncé at the Cleveland, Ohio, rally, Jay Z repeated this twice: \"Once you divide us, you weaken us. We're stronger together\" @webpagelink"},{"comment_id":"580176688837290","commenter_b":"Invite a Muslim man into your home and let him do what he would do in his home country. Do you have any idea what he would do to your mother? How about sister, assuming you have one? Go on, have fun. And don't you dare do any harm or call the cops because he would be following the Quran.","commenter_a":"Those who think this is funny, should be ashamed of yourselves. How would you feel if that happened to you. In America we treat each other equally (treating others the way we want to be treated. Think about that) no matter what religion we have.","post_message":"INSTANT JUSTICE..."}]
