[{"comment_id":"216170728787107","commenter_b":"She is a dried up piece of human flesh!","commenter_a":"This is a crazy idiot sue her but her out of business","post_message":"The heck!"},{"comment_id":"10152850363352217","commenter_b":"Women should be allowed to wear what they want to. It should be a free world for men and WOMEN","commenter_a":"This is the silliest thing ever!","post_message":"Why two opposing campaigns about what women wear are spreading across the Arab world bbc.in/1LU4ka8"},{"comment_id":"10155182978984369","commenter_b":"We are animals no different then lions killing each other in self self-defense. i believe killing for money power drugs and such is a sin. Killing for self-defense would be justified","commenter_a":"A few people on here are saying that a gambling debt or drug debt isnt a good enough reason to kill someone. Maybe not for you but obviously a good enough reason for someone who kills...","post_message":"NEW INFO: The victim girlfriend told investigators she drove her boyfriend to the location of the shooting to collect on a Super Bowl bet and when he exited the vehicle, he was shot"},{"comment_id":"1547989355230019","commenter_b":"@username I hate Hillary but when you say she killed four people you sound crazy.","commenter_a":"Wow all these libtards hating on Hannity. What about all your bais media reporters? ??? They bend over and let Hilary use her strap on to them Cnnn already said Hilary won the next debate . When she didn't win the last . Is he going a little overboard yes. But let's face facts , if he was saying the same things about Hilary. He would be a genius in your eyes.","post_message":"What a week."},{"comment_id":"10154731295753145","commenter_b":"A lot of merchandise with the \"Trump\" name on it is lagging in sales. When the sales of anything is down, stores WILL drop them.","commenter_a":"Geez ppl grow the F up and quit crying, he is our president and what the USA needs the most is for all Americans to come together.....united as one!!! This country needs help our own people are starving let's feed them first.","post_message":"Just last week Nordstrom stopped selling Ivanka Trump fashion brand."},{"comment_id":"1202081159878082","commenter_b":"Good one! Except I hope SHE would HAVE BEEN ABORTED LONG BEFORE NOW!","commenter_a":"So, I am reading that Hillary is really upset that the FBI is \"dumping\" on her right before the election.... I want to say to Mrs. Clinton, \"So Hillary, how does it feel to be aborted 8 days before delivery?\" Stole that comment, but it is awesome!","post_message":"The website announces it has moved to \"Phase 3\" of its \"election coverage.\" Here are the latest headlines. #WikiLeaks #Clinton"},{"comment_id":"10153085951882507","commenter_b":"no problem at all, as long as the part of the ----> well regulated militia <------ is the main factor, and not as is current, --> any inbred psychopath can buy any number of military grade weapons and high capacity magazine and then proceed to walk into restaurants with them.","commenter_a":"So this of course applies to second amendment rights also, correct?","post_message":""}]
