[{"comment_id":"1817386261807116","commenter_b":"I agree! She is pure evil!!","commenter_a":"Totally agree with Newt Gingrich! She has no scruples! She belongs in prison! Cannot stand this heartless woman! She just won't disappear!","post_message":"Newt Gingrich says Hillary Clinton is without a doubt one of the most corrupt politicians in American history. Do you agree or disagree?"},{"comment_id":"10153703239058984","commenter_b":"She would be the worst women president ever !!!!","commenter_a":"Same crap. Boring!","post_message":"She wasted NO time with this one...  Do you think Hillary would be the worst pick for president?"},{"comment_id":"992066754146411","commenter_b":"No, we don't want their kind here.","commenter_a":"How great it this to see! The same people who have always looked down upon us Tacoma people are now wanting to live here. Sweet justice is here. :)","post_message":"#Seattle workers are moving from the city to #Tacoma -- in the search for more affordable living! [kiro.tv/SEAtoTAC] Do you think:   A. Seattlites shouldn't have to move, rent control please! B. This is making Seattle traffic worse.  C. Moving to Tacoma or a suburb is a good solution.  D. (Your own answer)"},{"comment_id":"427202340738140","commenter_b":"Pharmaceutical companies cannot profit so much that's why they do not do what they are supposed to do is protect the public","commenter_a":"Lauren Martin","post_message":"This video is from a new documentary The Culture High which looks at both sides of the marijuana prohibition argument."},{"comment_id":"10153169137025950","commenter_b":"Ella Patrice Nierva","commenter_a":"Ricardo Alvarez","post_message":"WATCH: Little girl can't wait another second to hug her soldier dad, runs to him in the middle of a ceremony @webpagelink"},{"comment_id":"1388872451170702","commenter_b":"And, non-public schools do not have to allow a student to attend their school so not everyone will the right to 'opt out' .","commenter_a":"Deeply qualified, unlike the Secretary of Education you are choosing to support despite the strong opposition from your constituents.","post_message":"Yesterday, I spoke on the Senate floor to support Judge Neil Gorsuch’s nomination to serve as an Associate Justice on the U.S. Supreme Court. Judge Gorsuch is deeply qualified and consistently demonstrates his commitment to upholding the rule of law and interpreting the Constitution as its authors intended."},{"comment_id":"1592257357455136","commenter_b":"Ew. That girl is a cow","commenter_a":"Soar losers. Get over it.","post_message":"Anti-Trump protesters are outside Trump Hotel in D.C. They've been marching for two hours now.  More about road closures or traffic in D.C.: @webpagelink"}]
