[{"comment_id":"10154793363900575","commenter_b":"Fucking right a wall","commenter_a":"You have a wall? Why you so upset ?","post_message":"THE WALL JUST GOT 10 FEET TALLER..."},{"comment_id":"10154371429036491","commenter_b":"@username good luck having sex. I dont mind your sex life... duh","commenter_a":"The best birth control method is abstinence and celibacy.","post_message":"A leading medical group recommended IUDs as the best form of birth control for teenage girls today."},{"comment_id":"10153194834046717","commenter_b":"Fuck you bitch","commenter_a":"Many Jamaicans are F'd up; bleaching, trickery, conning, God awful people!!","post_message":""},{"comment_id":"426764770781451","commenter_b":"let the idiot walk home ! she does not deserve to be around others !","commenter_a":"Her Bus, Her Rules.","post_message":"This bus driver decided to teach a foul-mouthed teen some manners."},{"comment_id":"544054039123949","commenter_b":"Drain the SWAMP","commenter_a":"President TRUMP 🇺🇸","post_message":"REPLAY: Republican presidential nominee Donald Trump at a rally in Tampa, Florida."},{"comment_id":"10153464006023132","commenter_b":"IAN!!!!! Noooooo!!! We had plans to run away! Well, I did anyway! Oh well, Nikki rocks so that's cool!!!","commenter_a":"@username @username I am so sorry to hear of your loss!!! ;-)","post_message":"Nikki Reed and Ian Somerhalder aren't the only ones."},{"comment_id":"10154970022528690","commenter_b":"The world and so call United Nation have no interest in alepo people just because they are muslim, if its christian region this is happening the UN will have take action, but we the muslims are just folding our arm doing nothing, the only thing is to back to Allah, by saying; HASBUNALLAHU WANI'IMAL WAKIL, WANI'IMAL MAULA WANI'IMAL WAKIL,","commenter_a":"there is tubelight, internet, electricity bla bla. it seemed she is speaking from hotel pan pacific Singapore. we didn't heard even a sound of bullet fired. weird.","post_message":"Residents of East Aleppo are giving their final messages to the world."}]
