[{"comment_id":"602032646612178","commenter_b":"It's a very very last resort. We would have to live with it for the rest of our life. I am a responsible gun owner. Guns are meant for hunting and in case of a immediate threat on your or someone else's life only. #Berniesanders","commenter_a":"The guns themselves don't worry me. It's the people who demand having them that worry me. They never have legitimate reasons. It always boils down to paranoia and delusions of grandeur based on violence. Not the kind of humans I want to see armed.","post_message":"Multiple other vehicles were hit by gunfire, too. How many other angry Little Fellers are out there with guns?  -Conover"},{"comment_id":"1554877448153804","commenter_b":"#HellForHer. #FeelTheBern","commenter_a":"I wouldn't vote for Hilary under any circumstances, because she is dishonest and has done nothing to help the cause of human rights in her entire career! In fact, everything she's ever done has been solely for her own promotion and gain! Power is what she's after and we definitely DON'T want someone like her in charge of our country! Bernie is one of us, a man who's worked hard for positive change, who is diplomatic, anti-war and pro-planet, in short, just what we need at this particular moment in time! With Bernie, we would all have a say, whereas, with Hillary, as a people, we would become more suppressed than ever, given her plans for further militarisation, both military and police wise and polluting of our planet in favour of the almighty buck! Bernie puts the needs of THE PEOPLE first, which is why he must be our first ...","post_message":"When we talk about a political revolution, sisters and brothers, we don't just mean the presidency. What this moment  requires is people in the streets fighting for change and legislatures across the country willing to stand with them."},{"comment_id":"1084003008332003","commenter_b":"#VOTETRUMP AND BUILD THAT WALL!!!!","commenter_a":"Melania will have the last laugh. She is smarter and prettier than this idiot, not to mention more accomplished and wealthier.","post_message":"Unreal..."},{"comment_id":"10154342587333258","commenter_b":"David Mayhew The problem with your statement is that your assumption is that just because they have been drinking, they are going to use a gun. Just because a guy drove to a bar with his car does not mean that he's going to do something irresponsible with it. I guess we should start seizing the cars of bar hoppers. Or we could categorize those cars that are most often DWI that injure or kill someone as \"assault cars\" and start seizing those.","commenter_a":"Fewer guns would not have stopped this lunatic. We need more good people to be able to lawfully carry guns into more public places because the criminals will carry them wherever they want.","post_message":"The common thread in too many mass shootings was the availability of powerful semiautomatic weapons that serve no purpose but to kill. | Via Boston Globe Opinion"},{"comment_id":"347098928826955","commenter_b":"Liars never apologize! They wouldn't know how.","commenter_a":"Not only are they lying but they are racist as well! They hate white people!","post_message":"Lies www.eaglerising.com"},{"comment_id":"1620111051603386","commenter_b":"She is the problem. She is not the solution.","commenter_a":"Why would ya go through all that trouble goin through background check to legally obtain firearms when you can buy plenty of illegal stolen or undocumented firearms anywhere at any time any type sky is the limit . People make a living doin this everywhere !GUN CONTROL IS A FAIRYTALE ! A JOKE ! WASTE OF TAXPAYER S $ so don't buy into Obummers. And Hillary BS ! Think for yourself folks those talking heads are also very empty.","post_message":"“You shouldn’t be able to exploit loopholes and evade criminal background checks by buying online or at a gun show…We have to make it harder for people who should not have those weapons of war.”  – Hillary Clinton reacts to the #OrlandoShooting @webpagelink"},{"comment_id":"1058239930927979","commenter_b":"This woman has to be one of, if not the stupidest person in the world.","commenter_a":"This piece of whale shit....no I stand corrected, whale shit has a purpose. This Is the very definition of dumbocrat....take your old tired ass and retire you outdated elite POS. You are so far out of touch with the human race just knowing you made that statement makes me throw up in my throat. Please go off to your pasture, dig yourself a hole so I can put an outhouse above it and shit upon your face.","post_message":"\"They voted against their own economic interests because of guns, because of gays, and because of God, the three G’s, God being the woman’s right to choose,\" said Pelosi."}]
