[{"comment_id":"1004207899725254","commenter_b":"Nasty woman","commenter_a":"Vote the issues!!! Main stream media has succeeded in blinding and brainwashing its people, spinning half truths and omitting important truths. You will NEVER GET REAL NEWS FROM MSM. Go to TRU NEWS, InfoWArs, and many other investigative journalists who are not afraid to tell the truth or worry about losing their jobs. If you are Gay, Why are you voting for Hillary when she wants to bring in thousands of refugees that believe all Gays should be executed? If you are Black, Why are you voting for Hillary when she admires Margaret Sanger and defends Planned Parenthood who want to abort as many black babies as possible? Exterminate the black race because they are like \"weeds\". (Margaret Sanger quote) Most of those clinics are in Black neighborhoods. If you are a Christian, Why are you voting for Hillary Clinton when she wrote her Senior thesis on Saul Alinsky who ...","post_message":"\"I'll do the very best I can if I am fortunate enough to win today,\" said Hillary Clinton after casting her vote today @webpagelink"},{"comment_id":"1254290281276196","commenter_b":"He prefers giving the jobs to refugees and Muslims what a POS","commenter_a":"What is he on Obama didn't do anything to create jobs","post_message":"Yesterday, news swept the nation about the amazing feat President-elect Donald Trump was able to accomplish before even taking office. Trump, along with Vice President-elect Mike Pence, forged a deal with Carrier, keeping 1,000 jobs in the US. However, not everyone is taking the news quite so well, and none other than the current president and his administration had a sickening response.  @webpagelink"},{"comment_id":"10154378040854024","commenter_b":"Wow! That woman is looking dumber every day!","commenter_a":"Flippin greedy, deranged, bitch whore!","post_message":"“Now this is just getting ridiculous. She didn’t actually meet the standards in PA to have a recount, so she’s going to try to evade them by calling them ‘unconstitutional’. She raised enough money specifically to deal with the fees and then pulled out when asked for it. The whole point is to tie up the electors so they can’t vote for Trump.”"},{"comment_id":"10155049967862619","commenter_b":"Is that how they saying thank you to Israel for taking care of there refuges and is nobody can have Golan except Israel because were given to Chosen People God so Syria,Palestinian and all Muslim keep your hands away from Israel territories.Amen.","commenter_a":"BE STRONG GOD ALWAYS WITH YOU''","post_message":"Benjamin Netanyahu - בנימין נתניהו responds to Syria!  -VirtualJerusalem.com"},{"comment_id":"640946546065952","commenter_b":"So support Hillary who takes millions of dollars from countries that practice Sharia law that kill women and kill gays for no reason! Also who's husband is a known sexual abuser and a rapist and she persecuted the sexually abused victims of her husband. Yet Hillary said she supports women's rights, what a joke. Wake up ladies!!! I'm wondering if Hillary hired these people to go there and start riots. Hillary Clinton is a evil corrupt woman who is mentally, physically and morally unfit to be our commander in chief!","commenter_a":"Go Trump.","post_message":"We're LIVE from Trump Tower New York, where the National Organization for Women (NOW) is leading an anti- Donald J. Trump protest."},{"comment_id":"10155622855165354","commenter_b":"Pretty soon we'll be sending them on chartered flights, like the illegal immigrants we're busy with right now.","commenter_a":"uh huh!!","post_message":"Infuriating..."},{"comment_id":"1027338487301572","commenter_b":"I agree with you , Carol. But, Illinois law forbids us from asking for ID at this point in time.","commenter_a":"Going back many years to JFK's election to the presidency. He won by a very slim margin. Cook county Illinois (Chicago's county) had many votes cast by people who were dead. It is still happening but in many more states. Everybody should have to show a legal picture ID before voting.","post_message":"Voter Fraud is REAL!"}]
