[{"comment_id":"10152917419231051","commenter_b":"Seriously the Husbands deserve same treatment. I am not saying the mistress didn't have it coming . Chinese ladies are crazy !!!","commenter_a":"I don't get it! What about her douchebag husband!!? He's the one married but still decided to sleep with her sooo....","post_message":"This wife decided to track down her husband’s mistress and make an example out of her."},{"comment_id":"10154481500504199","commenter_b":"Your mom is overrated. #yesidoknow","commenter_a":"Overrated.","post_message":"Sorry, but we have to ask...  Who's planning on seeing Star Wars: The Force Awakens?! [via.q13fox.com/Iat0q]  Photo manipulation by Mara Leite Photography"},{"comment_id":"1642069832709355","commenter_b":"I'm voting for Trump.Is it just me or is Sara palins voice extremely annoying?Like worse the that Kathy griffins creature.","commenter_a":"I approve this message. I am anxious to know Mr. Trump's running mate. Go, Donald!","post_message":"I am greatly honored to receive Sarah Palin's endorsement. She is a friend, and a high quality person whom I have great respect for. I am proud to have her support. #Trump2016 #MakeAmericaGreatAgain"},{"comment_id":"1802927083306226","commenter_b":"Well you got what you wanted...he called Illegal Aliens, \"Guests\" Now wallow in it.","commenter_a":"Only people glad he's gone are the criminals and illegals","post_message":"LIVE VIDEO: There's a new sheriff in town as Paul Penzone is sworn-in as Maricopa County's 37th sheriff after defeating Joe Arpaio in November's election. Arpaio served as sheriff for the last 24 years."},{"comment_id":"10153722267976509","commenter_b":"The Duggars are not Christians. They are members of a sex cult","commenter_a":"Your son molested four of your children and you tried to keep it secret? Disgusting! I'm going to pray for you when I take my birth control.","post_message":"Four of the five girls #JoshDuggar molested were his sisters, their parents said in an interview with Fox News anchor Megyn Kelly. @webpagelink via CNNMoney"},{"comment_id":"10153853920168145","commenter_b":"Athena Marigold absolutely","commenter_a":"Athena Marigold it's in the paper","post_message":"#BREAKING A shot fired during a domestic dispute hit new father Brian Mortensen as he worked on a nearby fence. On Wednesday, he died."},{"comment_id":"10153415746649024","commenter_b":"She is not eligible to run..","commenter_a":"The sad truth is that DUMB PEOPLE WILL STILL VOTE FOR HER! !!!! IT SHOULD BE ILLEGAL TO RUN FOR OFFICE IF THERE IS SO MUCH CORRUPTION IN YOUR HISTORY !!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"}]
