[{"comment_id":"10153553565406955","commenter_b":"I can't wait until a loonie lib woman gets attacked by a filthy Muslim","commenter_a":"Muslims versus liberals...this is going to be fun.","post_message":"Topless protesters disrupt Muslim conference in Paris..."},{"comment_id":"1332051730168629","commenter_b":"She hasn't killed anyone idiot","commenter_a":"Now if only the Hilary haters would stop throwing around the word \"murderer\" as if it were a complement. The blatantly hateful behavior of so many Americans makes my heart ache and makes me ashamed to be counted among them.","post_message":"They finally collapsed."},{"comment_id":"10153174916561130","commenter_b":"Poor, sad, hatful women. I feel bad for you.","commenter_a":"homsexuals force their wicked ways on everyone. Shame on them. Homosexuals lust not love..","post_message":"Humans aren't the only ones celebrating the SCOTUS decision."},{"comment_id":"465878743536720","commenter_b":"Wake up lady.","commenter_a":"if you think Trump loves America, why does he insult everyone and everything??? And Obama has done more for the middle class than many previous presidents.","post_message":"U.S. Democratic presidential candidate Hillary Clinton says she's \"appalled\" after Donald Trump declined to correct a man who called President Obama a Muslim and non-American during a town hall event. Was she right?"},{"comment_id":"1841512796060882","commenter_b":"@username till the wall is complete lol there isn't going to be anyone picking lettuce you better grow your own","commenter_a":"Well Boston Mayor...... you are not the President so you don't get to decide what he focuses on. He's up holding his priority promises to his supporters first then comes the rest. Not the Democrats vision the Trump vision","post_message":"Boston Mayor Marty Walsh says President Trump should focus more on creating jobs and addressing urban issues such as homelessness.  Watch more: @webpagelink"},{"comment_id":"10156396288885354","commenter_b":"If you want refugees you can have them but please build a containment wall around your state!","commenter_a":"Yes, if it is truly about safety, then they can stay in the Middle East, and we can help provide for them, which would be the right and just thing to do. They are human and most are probably good people fleeing a civil war. No need to be sent to the United States.","post_message":"\"There is no reason America cannot create a safe zone for these refugees in the Middle East. That is the most compassionate thing to do for them. It is the safest thing to do for America. The only reason Obama is risking the safety of Americans to bring them here is to feel sanctimonious and to divide us.\""},{"comment_id":"730431657058963","commenter_b":"Stupid ass talk to text I sent hats off to Mr Gilbert who donated 10.5 million to Toys for Tots you can say what you want about these new country singers but I like mr. Gilbert's music and a bunch of the other ones and if you don't like that you kiss my ass","commenter_a":"You can say what you want but these new country singers other not countries in a sucker most of butter how many people you know to get stoned.5 million for toys for tots hats off to mister yogurt hold a good man and a good singer and if you don't like it like that you kiss my ass","post_message":"“Whether a kid is into Barbie or Star Wars, I hope we’ve given a bit of fun and inspiration.”"}]
