[{"comment_id":"10153380578865950","commenter_b":"Maybe you're jealous, because you're a fat bitch.","commenter_a":"Well, considering Beyonce was involved, it was bull. I refused to watch it because of her and the song she was performing. Screw her and her terrible lyrics and slutty wardrobe/dancing. You're lucky Lady Gaga was there (never thought I'd say that...) to save the performance aspect. #nomorebeyonce #shesaterriblerolemodel #picksomeoneelsenexttime","post_message":"Compared to past Super Bowl halftime shows, this year's was relatively tame: no \"left sharks\" or wardrobe malfunctions here. Who was your favorite performer?"},{"comment_id":"1729831163913652","commenter_b":"According to her, if you don't vote for her, your a Sexist.","commenter_a":"If youre thinking of voting because shes a woman Please dont vote at all This is about the future of the U.S And this *woman* Cares nothing for equality women Nor blacks... Nor anyone but her corporate buddies","post_message":"Hillary Clinton told a colorful story in Reno that ended with the former secretary of state barking like a dog to slam Republicans ... @webpagelink"},{"comment_id":"1099336866769294","commenter_b":"There great on the grill","commenter_a":"they are nasty things.. we have loads of them out here in Texas.. they tear up pasture land and wreak havoc on vegetation and are very dangerous and have been known to maim and kill people who get too close.. I would seriously not encourage residents to take them out unless they are in a rural area and are familiar with how to use caution in hunting them.. get the parks and wildlife involved.. they better know how to deal with them..","post_message":"Update: Wild pigs that have damaged landscaping at Fairmount Park and other Riverside County areas have caused millions of dollars worth of damage, and officials are warning residents to be careful around the animals.  Read KTLA's story here: @webpagelink"},{"comment_id":"606800519482594","commenter_b":"HILLARY you have no CREDIBILITY ! YOU LIE SO MUCH WE CAN'T TRUST YOU EVEN WHEN YOU DO TELL THE TRUTH YOU'VE LIED SO MUCH WE CAN'T TELL! SO GO POINT YOUR FINGER FULL OF BULL SHIT IN SOME ISLAMIC WORLD THAT BOUGHT AND SOLD YOURSELF TO ! DUMB ASS LIEING BITCH!","commenter_a":"This woman is a total disgrace to America and to all human beings!","post_message":"Hillary Clinton just said Donald Trump is too dangerous to be President of the United States. This is why."},{"comment_id":"10153646612799071","commenter_b":"Thank you my sweet. Lucky dog!","commenter_a":"@username here is the video I was talking about 🐶","post_message":"Rumbo Mediterráneo quit his job to kayak the sea with his dog."},{"comment_id":"1043006319050712","commenter_b":"Limit the size of corporations ! Make them pay better wages and of course pay there taxes !","commenter_a":"It is important for one of the worlds' largest companies making huge profits, paying substandard wages, few benifits, manufacturing goods in the worst labor markets, akin to slavery to also hide it's money to avoid paying taxes to the government that provides medical care and food stamps to it's employees. After all what fun would it be to make obscene profits if you actually paid your fair share of taxes.....","post_message":"You won't find a Wal-Mart store in Luxembourg, but it does help the retailer avoid major US taxes."},{"comment_id":"10153905516506178","commenter_b":"I always say Merry Christmas at that is just the way it is.","commenter_a":"Fitting that a NUTCRACKER be in the back ground. :-)","post_message":""}]
