[{"comment_id":"10152693166980047","commenter_b":"Get out of our lives and leave us alone you can not even run your own country leave our children alone also","commenter_a":"No way","post_message":"Schools are forcing our children to \"pretend\" to be Muslim for a day?  We must stop Islamic indoctrination in our schools.   Sign and Share the petition to defend the religious liberty of our students:  @webpagelink"},{"comment_id":"10153943709566509","commenter_b":"Humans ruin everything they touch.","commenter_a":"why kill the bear!!!!!! humans were encroaching on it's territory! makes me ill","post_message":"Fatal human-bear encounters in Yellowstone National Park are rare, a spokeswoman said. @webpagelink"},{"comment_id":"10153233939551130","commenter_b":"Shame on you, damned sexist!","commenter_a":"\"Just to hold it in your hand\"... Yeah, that's not how tampons work >;)","post_message":"The best way to bring a tampon to the bathroom is just to hold it in your hand."},{"comment_id":"1341354572550959","commenter_b":"Right by Tacoma General","commenter_a":"Good. That's the way it's supposed to work. You rob people, you get shot. End of story","post_message":"A man was shot and killed yesterday evening after robbing two people at gunpoint in Tacoma. Natasha Chen reports, 5 p.m.: kiro.tv/LiveNews  What we know now: kiro.tv/TacomaShot"},{"comment_id":"922507297858399","commenter_b":"Ms. Miller, I'm a proud supporter of Mr. Trump. I'm so concerned that with Ms. Clinton's ability to \"Fix\" things she may have the ability to fix the election. I'm a true believer that this also happened in the current Pressident's second election. I am afraid that the Dem party will be in place for many years to come with the young and uninformed youth being targeted supporters through free things offered to them as well as dead people and illegals voting. . I'm hoping I am very wrong though. God help us.","commenter_a":"Wow!! While speaking on fox news live right now Mr trump actually seems presidential. This is the tone and demeanor we, the people have been asking you for. Let hillary bury herself. She will!!!! Be a better man. Be the man America needs. We want to believe that you can lead us but not unless you can start to act and sound like a good president.","post_message":"Radical Islamic terrorism threatens our world. Anyone who cannot name the enemy - cannot fix the problem!"},{"comment_id":"513245565531981","commenter_b":"I rarely say bad things on fabebook , but she 's a real bitch.","commenter_a":"Coulter and FOX's best days are wayyy behind them. Here's hoping this ideology of thiers dies a slow death","post_message":" know what this convention really needed? An angry Muslim with a thick accent,\" she said."},{"comment_id":"235119820270004","commenter_b":"Haaaaaaaa!!!!! Stupid, stupid lady.","commenter_a":"Too bad crybabies, he is your president. And I hated Obama but I am a grown-up and lived with him and his ugly family for 8 years. So grow up and shut up","post_message":"Trump has now set a record for the most hated president."}]
