[{"comment_id":"10154177685016943","commenter_b":"Quit talking about it and do something! Put her in jail!","commenter_a":"Enough already with the disclosures. I'd be happy with just one little indictment.","post_message":"Hillary Clinton has taken a beating this month over the discovery that donors to her family charitable foundation received special treatment from the State Department when Clinton was secretary of state. And she unlikely to get a reprieve before Election Day, as the organization behind those email disclosures expects several more headline-grabbing document dumps in the next 11 weeks. - via Newsweek"},{"comment_id":"10153656983536813","commenter_b":"Straight up asswipes.","commenter_a":"Lazy , sloppy police work, just pin it on anybody to close the case","post_message":"Children should get to talk to a lawyer before they are interrogated by police."},{"comment_id":"550201625175196","commenter_b":"Totally agree","commenter_a":"Lisa you need these!","post_message":"Laboratory beaker wine glasses 😍  From @webpagelink"},{"comment_id":"1735996146651286","commenter_b":"@username You are just a Con Man Two Faced Liar who is spreading false hope promises with zero substance to back up what your saying. You are playing America the same way you played the Americans that went to your scam Trump University","commenter_a":"Clinton is a close friend of the big banks, big pharma, and everything else that corresponds to corporate capitalism, millions of Americans already struggling will sink even further under the waves. Rental and housing prices, already astronomical, will rise to more heights of unaffordability. Drug prices and health care costs, which soared under Obama. Then, police shootings. @webpagelink","post_message":"America led by Hillary will be an AMERICA where things get even WORSE than it is now.  Higher taxes, rampant TERRORISM and MORE CORRUPTION from Washington, DC!  TOGETHER, we WILL Make America Great Again!"},{"comment_id":"920220598016177","commenter_b":"This is bull crap. The people who were slaves and all of their children are dead and gone. The country should have done more back in the 1860's and 1870's. That is when reparations should have been.","commenter_a":"Someone send this pandering jack wagon home please. He has done nothing but side with hate and strife, and stir the pot of social discord continually. Not a leader by any standard. Socialist poster child at best.","post_message":"What do you think of this?"},{"comment_id":"1520211998272919","commenter_b":"Amanda Murphy Maldonado they can take their kids with them. No families have to be busted up. Then when they kid is of age he can come back as a citizen. LAWS are LAWS...what laws are you CHOOSING to break?","commenter_a":"SEND THEM HOME. This isn't just \"politics\" anymore, this is the deliberate destruction of America from within. When they jumped the wall the broke the law!","post_message":"Breaking News: The Supreme Court says it will review President Barack Obama's orders to shield up to 5 million illegal immigrants from deportation. @webpagelink"},{"comment_id":"10153861060719411","commenter_b":"what i see is a dead pussy just blown up.","commenter_a":"terrorist*, not jihadist... jihad is a good thing","post_message":"Video shows Jihadi hit by mortar shell mid-interview"}]
