[{"comment_id":"10153587762999087","commenter_b":"She's above the law.","commenter_a":"Bloody Hell , Hillar-ious Hellary should have been an evil stand up comedian..","post_message":"Hillary Clinton on dropping out of the race if indicted: \"Oh for goodness, that is not going to happen. I'm not even answering that question.\" #DemDebate"},{"comment_id":"637619693095276","commenter_b":"Lock her up","commenter_a":"ITS FUCKTARDS LIKE YOU THATS FUCKED THIS COUNTRY UP ,, AND THE LIVES OF YOUR KIDS !! G E T T O T R A S H. !!","post_message":"This woman is bragging about stealing your tax dollars.  Disgraceful. She should be kicked off welfare and be forced to pay us back immediately.  Do you agree we should kick her out of the country?"},{"comment_id":"10153549006508984","commenter_b":"Never mind i remember now ......she made one bad porn with that BIG A!!","commenter_a":"I side with Meg Kelly. Kim's a dumb fat ass bitch!","post_message":"Look out, Kim Kardashian. I don't think you realize who you're messing with...  Do you side with Megyn Kelly on this one?"},{"comment_id":"10152881196379753","commenter_b":"So would you rather have the Transgender in the men's bathroom? Chances are SHE Is attracted to men. So would you like HER to go in there and check you guys out? Should lesbians have to use the men's bathroom then? Fucking. Ignorant","commenter_a":"Everyone should boycott planet fitness \" Political bullshit run foul again! Hope the woman sues there ass off.","post_message":"This woman thought she saw a man using the ladies locker room at her Planet Fitness. When she complained to the front desk, they responded by cancelling her membership.  Should transgender men who identify as women be allowed to use women's bathrooms/locker rooms?"},{"comment_id":"10153040281701051","commenter_b":"And don't go back for her. Let her walk her crazy ass home.","commenter_a":"Dump her ass at the lake then go take care of your business","post_message":"This husband was so stunned by his wife’s behavior that he took out his phone and started recording the whole thing."},{"comment_id":"391857781002516","commenter_b":"Animals! That's why they're in prison!","commenter_a":"They would live there no matter what the conditions are! They destroyed it now let them lay in it!","post_message":"The corrections officers could only watch as the thousands of inmates broke the heating, cooling, and ventilation systems, and forcefully shook the gates in the prison lawn..."},{"comment_id":"452813904909190","commenter_b":"Why doesn't the women who complained go back to Africa? Why walk over our freedom of expression?","commenter_a":"Yes","post_message":"Do You Support This Woman's Refusal To Remove Her Flag?  Comment 'yes' or 'no'."}]
