[{"comment_id":"10153752964580575","commenter_b":"I'm ashamed of you Mary, rape is rape. Lord help you if you ever get in that situation.","commenter_a":"I don't doubt Bill Clinton and Bill Cosby were with these women. My doubt comes from what is rape. When a woman wants something from a man and is willing to give sex for it , is that rape ?","post_message":"Bill's past is coming back to haunt Hillary. . . ."},{"comment_id":"400393906751871","commenter_b":"Thank you. You pieces of uselessness. You screwed the Americans who voted your asses in but you will come up for re election. We Americans will not vote you back. You just handed America over to the democrats for life now that the illegals will have the paper work to slant the elections. Morons","commenter_a":"McConnell and Boehner are both hipocrits ~ they are not for the people and are not for the GOP Obama has them in his back pocket!","post_message":"Did Mitch McConnell just cave to the Democrats' demands?"},{"comment_id":"10153931656668812","commenter_b":"This is way out of context y'all all sound ignorant specially the one starting this comment","commenter_a":"Waiting to see who blames Obama or immigrants....","post_message":"Long Island town demolishes U.S. Navy veteran's home while he was in Florida recovering from a knee replacement: @webpagelink"},{"comment_id":"472460989569345","commenter_b":"Your vagina has muscles specifically designed for pushing things out. Kegel exercises will strengthen and tone them. Plus, I'm pretty sure that little knob looking thing on the bottom of the cup is for grabbing.","commenter_a":"I'm just not comfortable sticking something up there that I don't have a mechanism to pull it out with","post_message":"While used mostly in developing countries due to lack of access to regular products, these cups could be far superior than those regular products."},{"comment_id":"1106803252686150","commenter_b":"She is a LIAR","commenter_a":"How could Trump have the nerve to accuse Bill Clinton of being abusive to women? Just listen to Megan Kelly: \"You called women slut, pig, dog and disgusting animals. How long will America put up with this low life of a man.","post_message":"“I don't really care about the Monica Lewinsky thing other than I think that Hillary was an enabler,” Donald J. Trump said. \"And a lot of things happened that were obviously very seedy, I mean, he was impeached for Heaven's sake!\""},{"comment_id":"1085742424820999","commenter_b":"Steven Lumb then ask yourself why. She must be doing something right.","commenter_a":"So after my 12 years teaching and three post-grads I am still not allowed to call myself a professor but she can, in her first teaching job, what a joke.","post_message":"2016"},{"comment_id":"10154319378806337","commenter_b":"Mfs are crazy someone please give this puppy mf a show so i can laugh everyday as he humps his wifes leg and smell her butt. Wait i do all those things. This guy is normal","commenter_a":"Oh what the fuck happened to this world..lol","post_message":"UHHHH..."}]
