[{"comment_id":"10154562664816037","commenter_b":"Build Bridges Not Walls","commenter_a":"YES!! as part of an overall plan on illegal immigration . Please Remember that Sen. Hillary Clinton voted twice and lobbied for a border wall!!!!","post_message":"Would Donald J. Trump's proposed wall help?"},{"comment_id":"10154023438494486","commenter_b":"WHERE IS HILLARY? SHE SHOULD BE THERE, SHE WOULD HAVE GIVE HIM A BIG HUG OR A BIG KISS.....LMAO","commenter_a":"I don't think Obama was trying to shake his hand. it was almost like he tried to put his arm around Castro's shoulder and Castro stopped him or something. It was weird.","post_message":"Be careful! That's his THROWING ARM"},{"comment_id":"10153329997574342","commenter_b":"Thanks, Becky.","commenter_a":"Great picture Reed","post_message":"What a fantastic photo sent in by Reed W.  It's a shot of the sun coming up over the HPD Memorial.  Reed posted it to honor HCSO Deputy #DarrenGoforth.  @webpagelink"},{"comment_id":"10154183673293132","commenter_b":"It's usually the accuser that's doing the cheating. Good for her for getting rid of that douche.","commenter_a":"The same thing happened to my best friend when she started to make a healthier lifestyle for herself. Her now ex wouldn't support her at all! She was supposed to come to the gym with me one day and completely bailed out because she was fighting with her a**hole boyfriend. Turns out he told her that she's fat, will always be fat and that there was no point in going to the gym with me when she'll quit anyway. Now I wasn't aware about what he told her until recently because she was so ashamed of what he told her and knew I'd bash the crap out of him. He'd also accuse her of cheating every single time she went out or \"joke\" to her about texting other guys whenever she pulled her phone out. He was the one who ended up cheating (or so we think but I'm sure ...","post_message":"Alexander's husband started calling her \"fat\" after she dropped weight to save her health."},{"comment_id":"1171664359552992","commenter_b":"Idiots...they should be training Americans how to protect themselves from Muslims","commenter_a":"Hahahahahahahah very funny","post_message":"@webpagelink"},{"comment_id":"10153573375216509","commenter_b":"Take away her license and fine/jail her","commenter_a":"Very cruel person","post_message":"A Texas veterinarian posted a proud photo to Facebook of herself smiling as she dangled the limp body of a cat she allegedly shot with an arrow. The vet said it was a feral tomcat. People who saw the post were outraged. Now, animal rights activists are pushing for charges.  @webpagelink"},{"comment_id":"455406524619303","commenter_b":"And guess what... that girl who got pinned to the ground.....yeah she has a pass to the pool.","commenter_a":"I love kicking people out from our community Pool. They are not allowed because of \"race\" but because they don't own a house in our \"Gated\" community and pay HOA fees.","post_message":"\"The officer never asked any questions. He jumped out of the car and immediately started running to the black kids.\""}]
