[{"comment_id":"1426892224004095","commenter_b":"It is an eye opener!! The horror will be if Hillary is actually elecyrd. Then the real horrors will begin.","commenter_a":"Excellent movie! A must see!","post_message":"Hillary's America might just be the scariest movie you see all year...  hillarysamericathemovie.com/#tickets"},{"comment_id":"1228827110542853","commenter_b":"Liberals dont like putin cause they love isis","commenter_a":"So this is liberalism?","post_message":"She says Trump needs to step down before the inauguration, and the audience agrees!  Shared by Occupy Democrats, LIKE our page for more! Video from The View."},{"comment_id":"579876898863510","commenter_b":"that chick with the bad bouttabe me in a second","commenter_a":"How cooked Darnell Fraser-Carroll Darnell Rea","post_message":"Ghosts from The Ring and Grudge opened a Japanese baseball game"},{"comment_id":"10152510366081813","commenter_b":"Sound like another feminists that loves the idea of discrimination. Gee, imagine finding you here.","commenter_a":"And then ACLU discriminates by stating \" This one is dedicated to all the girls out there\".. LOL","post_message":"This one is dedicated to all the girls out there who prefer reading science fiction and history books to love stories.  @webpagelink"},{"comment_id":"10153962435457235","commenter_b":"ive got a few vulgar words for this trump ish.... can not stand her face, her voice, or any damned thing that comes out of her mouth. this woman is a vile creature that needs to crawl back under whatever rock she slithered out from.","commenter_a":"Founding father of porn.","post_message":"It's hard to imagine the GOP getting more juvenile than this -- but let's see what happens tomorrow!"},{"comment_id":"10154357156724062","commenter_b":"Short girls struggle too the regular is always too long😔","commenter_a":"Does she wear jeans & where does she purchase them? I'm nowhere near her height but have a helluva time finding them long enough. lol","post_message":"Who is the model with the longest legs in the world? Turns out a Houston girl can now claim that title..."},{"comment_id":"1775999165978650","commenter_b":"No","commenter_a":"\"HELL NO \"","post_message":"Is Hillary Clinton America's best choice for president in 2016?"}]
