[{"comment_id":"10152546378774071","commenter_b":"Same thing as Pie-o-logy?","commenter_a":"This has been around for years...finally blowing up I guess. Thank you Cosmo Kramer lol","post_message":"Pizza Studio hopes to expand to 100 locations by the end of 2015."},{"comment_id":"10158027884060354","commenter_b":"I'm proud I didn't vote for Trump who is a racist, woman groping sleaze and fails to pay a hard working startup business owner caterer because he told her she would get more business when people hear she catered his wedding and had to pay her employees out of her pocket. And believes because he is rich he has the right to treat women as he pleases. You can vote for him not me. My husband thinks he's NUTS!","commenter_a":"He's still under numerous criminal and civil investigations, whether they are by the FBI or not. Numerous court dates, numerous lawsuits, etc, etc.","post_message":""},{"comment_id":"956845991041816","commenter_b":"Leave her alone she's a special breed of stupid.","commenter_a":"It looks like a bloody mosque take your baby piglets with you ,oh are animals allowed","post_message":"Mecca unveils world’s biggest hotel with 10,000 rooms."},{"comment_id":"1298762416842950","commenter_b":"Actually W paints pretty darn decent pictures.","commenter_a":"nobody expected Bush to paint like a 5th grader. Okay, yeah we did.","post_message":"Don't expect him to stay home and take up painting."},{"comment_id":"1701571813463264","commenter_b":"Carly without a doubt!","commenter_a":"No question Carly","post_message":"Poll: Who Would Be A Better President, Carly Fiorina or Hillary Clinton  (A) Carly Fiorina (B) Hillary Clinton"},{"comment_id":"10153321569596615","commenter_b":"The mask is part of hiding from an insecure woman so she can never find me again.","commenter_a":"Insecure women ruin more lives than drugs.","post_message":"\"Some people are commenting that she must be insecure or something, but it’s quite the opposite. People tell us we have the best marriage they’ve ever seen.\""},{"comment_id":"1214601541965192","commenter_b":"Y don't y'all go look up great migration n u do kno all white ppl ain't rh+ either meaning not descended from monkeys smh ignorance at its finest pick n choose shit to push ur retarded ass agenda","commenter_a":"Awesome. Teach them early. I'd rather my kid learn to hunt and survive than play on a phone or tablet all day.","post_message":"How do you feel about this?"}]
