[{"comment_id":"556378537889545","commenter_b":"Freaking self-professed child molester. Figures she would be a surrogate for killary","commenter_a":"ok, Im wondering etf is lean dumbham ??","post_message":"Just when you thought she couldn't sink any lower..."},{"comment_id":"1705293566392359","commenter_b":"Not only is she racist she has a chip on her shoulder against whites. She has done very well in this nation and it took whites to get her where she is at! Ungrateful bitch.","commenter_a":"Liberals always resort to name calling. They can't come up with a rational argument. Help Oprah go away don't buy anything of hers and don't watch her. She will then be loving whites. She's a sad woman.","post_message":"Oprah: ‘Anyone Who Doesn’t Like Obama Is Racist’. Unbelievable. What a bigot. Do you think Oprah is the racist?"},{"comment_id":"882209121877695","commenter_b":"When they said the meek would inherit the Earth, I don't think they meant the stupid. Unless they did and if that's the case someone is so fired for reading that wrong. But I am sure that isn't the case. Though that means god is going to be ever so pissed. At least everyone of these blind hate filled asshats will be happy to know Hell is warm year round forever.","commenter_a":"Kudos to them \"good 'ole white boys\" for doing there part against ISIS by attacking an innocent old man. They should go fight in Syria if they have the courage.","post_message":"U.S. Sikhs are frequently conflated with Muslims and often wind up absorbing the backlash against Islam."},{"comment_id":"1865190080165091","commenter_b":"What about the serial killers child molesters child rapists murderers here in the United States we should get rid of all of them as well have them sent somewhere so they can stop all this craziness here and yes there are many Savages right here in the United States","commenter_a":"These people are f--king sick get them out of our Country.","post_message":"Muslim Nurse Mutilates Little Girl’s Genitals, What She Told Her Is Even SICKER"},{"comment_id":"1155392447817135","commenter_b":"Since she can't take the heat she gets out of the debate. (Kitchen).","commenter_a":"She knows she has already taken both sides of every topic. There's simply nothing left to lie about.","post_message":"Would Clinton benefit from another debate with Sanders?   She doesn't think so."},{"comment_id":"10152633154612452","commenter_b":"You do know I meant loving","commenter_a":"@username living all the comments. Brian Williams lol","post_message":"DRAMATIC PHOTOS: Two police officers were able to save a woman trapped in a sinking BMW after smashing the vehicle's rear windshield. @webpagelink"},{"comment_id":"1817386261807116","commenter_b":"I agree! She is pure evil!!","commenter_a":"Totally agree with Newt Gingrich! She has no scruples! She belongs in prison! Cannot stand this heartless woman! She just won't disappear!","post_message":"Newt Gingrich says Hillary Clinton is without a doubt one of the most corrupt politicians in American history. Do you agree or disagree?"}]
