[{"comment_id":"10158094006710354","commenter_b":"Great job! This is why some illegals should be deported","commenter_a":"So sad.","post_message":"HORROR:"},{"comment_id":"10154576312191037","commenter_b":"@username so if they agree with Her hatefulness that will make them good people? You must have drank her kool-aid","commenter_a":"Most disgusting, despicable woman in America. She and Drumpf are the perfect, hateful, ugly pair that embody everything wrong with the US.","post_message":"She previously called him an \"angry Muslim with a thick accent.”"},{"comment_id":"1673051799421609","commenter_b":"WOW SHE'S AS DELUSIONAL AS HER WACO HUSBAND!","commenter_a":"she is nasty","post_message":"While speaking to a crowd recently, Michelle Obama suggested men viewed her as a sex symbol. She didn't anticipate the response. The video speaks for itself."},{"comment_id":"10153429350692623","commenter_b":"She would have gotten her old azz beat. Period!","commenter_a":"My question is what did these people do to provoke the volunteer? Why did they not comply with her request to leave and then they could have gone to someone else for help. I have seen people treat the volunteers like dirt- maybe this woman couldn't take it any longer. Don't judge unless you were there and saw the entire event unfold.","post_message":"Wake Forest Baptist Medical Center is responding to a disturbing incident caught on camera involving one of their volunteers."},{"comment_id":"608933979286362","commenter_b":"Gennifer Flowers: Bill Clinton Told Me 'Hillary Had Eaten More Pu**y Than He Had'","commenter_a":"i like hillary clinton","post_message":"If we unite together, we will rise together."},{"comment_id":"10152728441711051","commenter_b":"Ship her to Iraq... just sayin!","commenter_a":"Shoot the witch..","post_message":"This woman killed her baby last year. Three weeks ago, she gave birth to another one. You can probably guess why she's in jail now."},{"comment_id":"1717613511850715","commenter_b":"Shoot everyone of those goat humpin bitches! Problem solved!","commenter_a":"It's time to take a stand America !!!","post_message":"Muslim Man Kills Pregnant Woman For Coming To Close To His Mosque. He ended two lives for nothing. Justice needs to be served. What do you think his punishment should be?"}]
