[{"comment_id":"1388976751118684","commenter_b":"STOP KILLING BLACK PEOPLE","commenter_a":"معقول يصير بامريكا","post_message":"Courtesy: Ruptly"},{"comment_id":"630794597099043","commenter_b":"Jill is Anti TPP! TPP protects corps who want to outsource american jobs!!!!!!","commenter_a":"Yay","post_message":"We’re here with Green Party candidate Jill Stein and her running mate, Ajamu Baraka to take your questions ahead of tonight’s #GreenTownHall. Please submit your questions in the comments section below. Tonight's Green Party town hall starts at 9 pm ET. @webpagelink"},{"comment_id":"10156216618090389","commenter_b":"She'll get away with everything , just wait and see.","commenter_a":"I bet she gets away with it that's the way the Clinton's roll","post_message":"Those emails might not be about yoga or Chelsea's wedding. Do you think Hillary is finally feeling the heat?"},{"comment_id":"1082747785100183","commenter_b":"Stfu pussy.","commenter_a":"Oh look! Americans shooting animals for fun! why are people shocked by this? Also these are HUNTERS not POACHERS, poachers take things from the body for monetary gain, hunters just kill either to cull or for pleasure. All hunting should be banned! We have no right to kill for pleasure, kill to survive as that's the order of things but never for pleasure.","post_message":"Another iconic animal lost to hunters."},{"comment_id":"1569633279990452","commenter_b":"U a fat bitch.u hater.k.k.k.","commenter_a":"Oprah is a racist bitch","post_message":"Way to go Carrie Underwood!"},{"comment_id":"710250332447494","commenter_b":"She's an idiot and should get out of our country","commenter_a":"what drug is she on ?","post_message":"Woman Goes On National TV And Blames Americans For Banning Sharia Law And Executing Kids In...  This must be some kind of sick joke.  Do you think she has completely lost her mind?"},{"comment_id":"1460895663923103","commenter_b":"😂😂😂😂😂😂😂😂😂 anit about that choking life not catching a M charge for no girl 😂 lool","commenter_a":"@username 😂😂😂","post_message":"It really be like that  #WSHH"}]
