[{"comment_id":"10153398198117377","commenter_b":"Trump will never win. A vote for trump is a vote for Hillary..","commenter_a":"why wasn't Priebus fired after Obama won re-election? It was unreal that Obama wins re-election and the RNC looks the other way. Priebus will be gone after Trump becomes President.","post_message":"Reince Priebus is an amateur and lightweight who has been a \"disaster\" as chairman of the Republican National Committee, says Christopher Ruddy, CEO of Newsmax. “We never would've been in the situation we're in today,” if the RNC had a strong leader Ruddy told Newsmax TV. Read the full story: @webpagelink"},{"comment_id":"957899690952352","commenter_b":"If they're refugees where have they got the money to buy fireworks - surely they need it for food, clothes & shelter","commenter_a":"Scare them all back where they came from..... And walk a few swine around with you.","post_message":"German officials have asked residents to refrain from using fireworks to avoid traumatizing refugees."},{"comment_id":"1075861685791148","commenter_b":"#Bernieorbust #NeverHillary #HandcuffHillary","commenter_a":"Remember any Bernie supporter who does not support the Democratic nominee is doing a disservice to their candidate.........Maybe they tune out the part of every rally of Bernie's that \"slams\" Donald Trump..........","post_message":""},{"comment_id":"10153163075739091","commenter_b":"Resorting to name calling shows the classless women you are! Good job!","commenter_a":"What? Do you want him to ride public transport?! He's the NEXT PRESIDENT OF THE UNITED STATES!!!! #TRUMPTASTIC Man!!! @webpagelink","post_message":"How Donald Trump does jury duty... here's his arrival at a NYC courthouse. STORY HERE: @webpagelink"},{"comment_id":"1249007868459199","commenter_b":"Also, where are the women?","commenter_a":"Where are all the 3 year orphans Obummer talked about?","post_message":"Obama couldn't vet the guys I went to school with in Mumbai; how does Mr. Know-It-All plan to vet tens of thousands of #SyrianRefugees?"},{"comment_id":"626503050873607","commenter_b":"Man she's one ugly silver back","commenter_a":"I am sick of all the threats and lies on FB have you no shame? This President only has a year to go what do you gain with the BS about him and his family. Crawl back in your hole!","post_message":"Michelle Obama was just hit with a multi-million dollar law suit for this reason.  Totally justified. She deserves prison.  Do you agree Michelle Obama is a criminal?"},{"comment_id":"10153139193807377","commenter_b":"It's very hard to forget that he was voted in not only by the majority but by illegal aliens and dead people. Yes that's true, and just because he was voted in doesn't mean that there are more people who want him out of office. He is not a leader, he doesn't know foreign policies . Isis is his fault! He removed all our military from Afghanistan and the other countries. Had we stayed they would not be where they are today! Hellery Will follow obuma in his running this country, and if You think he is Bad you Haven't seen anything yet. Her lies and deceit hopefully will Take her out for Good. Do you know that more than likely he will Go down in history as one of the worse presidents in our country so you might rethink that statement.","commenter_a":"Why can't you impeach him? If the majority agrees that he needs to be impeached, so what are you waiting for?","post_message":"The top Republican lawmaker joined half of US state governors in urging President Barack Obama to suspend the scheme. Do you support Speaker Ryan's efforts on this? Vote Here: @webpagelink"}]
