[{"comment_id":"10154406801145329","commenter_b":"She is disgusting ...an insult to women all over the world!","commenter_a":"I can get my head around the fact that Quantum field theory applies the ridiculous laws of quantum physics not just to solid particles but also to the fields describing the fundamental forces of nature. I just can't seem to understand why anyone cares so much about her or her family.","post_message":"People may THINK Kim Kardashian West's showing off her ~post-baby body~ but the photo may actually be from a year ago."},{"comment_id":"10153500455846336","commenter_b":"Mr Rubio: While it might be nice to possess 'class\", we don't need \"class\" as much as we need a \"leader\" who has the nerve to say what's on everyone's mind and then do something. It remains to be seen if he can get past the nefarious \"electoral college\" that elects the president no matter what the \"popular\" \"people's\" vote is.","commenter_a":"how about instead of commenting on another persons comments you actually tell us how you are going to fix all the crap wrong with our government, waste and abuse of tax payer dollars, so how are you any better??? so tried of you all","post_message":"Sen. Marco Rubio addressed immigration and Donald J. Trump's controversial comments. @webpagelink (via Fox & Friends)"},{"comment_id":"10152961247876680","commenter_b":"That's you and your crowd... Dead and cut up babies sold for the meat market !","commenter_a":"I proudly stand with Planned Parenthood.","post_message":"The move dramatically increases the chances of a government shutdown fight in the fall."},{"comment_id":"10152984633716770","commenter_b":"ENJOY ALL YOUR WELFARE BENEFITS BECAUSE THEY WON'T BE THERE FOREVER! WAKE-UP AMERICA! WE BETTER GET OUR VOTES RIGHT THIS TIME OR WE COULD SEE ISIS TERRORISTS UNLOADING IN OUR DRIVEWAYS! LET'S ALL HELP TRUMP MAKE AMERICA GREAT AGAIN! TRUMP ALL THE WAY!","commenter_a":"Can Trump ever stop with all the \"self praise\" while belittling and insulting everyone else......well except for those Democrats who are running? Since he was a liberal long before his sudden transformation to the GOP, I gotta wonder what side he's really on. Don't trust him one bit.","post_message":"Donald J. Trump believes the moment an Iraqi reporter thew a shoe at George W. Bush and Bush didn't blink \"may have been his best moment if you want to know the truth, that is very sad to say.\""},{"comment_id":"10153100399077377","commenter_b":"We The People, continuously have said, \"Impeach Obummer Now!\" He has by far surpassed any former president with impeachable offenses, but not one congressman has started the process! Do we sit here yelling in vain? What are we waiting for? We all know he is not looking out for our best interest. And yet our congress wonders why Donald Trump is FIRST in All POLLS! Let's MAKE AMERICA GREAT AGAIN! VOTE FOR DONALD TRUMP","commenter_a":"They are always talking about working and being hard working. When someone tries, the republicans shut them down. Make up your freaking minds , republicans. Or is it you people to work at what you say, for the pay you say, when you say, without any remarks or compensation . That's called slavery. Republicans ended that years ago.","post_message":"Former House Majority Leader Tom DeLay told Newsmax TV  that if President Barack Obama implemented a plan to require background checks on some gun sales by executive order and without congressional approval, the House should consider impeachment proceedings. Like, Share and Vote in Newsmax’s online poll: Do you support Obama’s gun control? Respond here: @webpagelink"},{"comment_id":"10157022006200725","commenter_b":"Crooked she is in everything!","commenter_a":"anything related to Hillary would Just get worse if she is in office","post_message":"Crooked Hillary just can't close the deal with Bernie. It will be the same way with ISIS, and China on trade, and Mexico at the border. Bad!"},{"comment_id":"10154239882011509","commenter_b":"So is everyone just supposed to sit back and watch how ISIS does whatever the hell they want? I think not. War is a terrible thing, innocent peolle die just like they did in France and just like they did in other wars. It can't be justified, but if nothing is done about the situation we will all be required to memorize the Qu'ran soon, not to mention have our way of living destroyed by these pigs.","commenter_a":"French warplanes take off from an aircraft carrier,killing #InnocentChildren in #Syria and #Iraq","post_message":"French warplanes take off from an aircraft carrier, attacking #ISIS in #Syria and #Iraq.   The latest: @webpagelink"}]
