[{"comment_id":"1110149189061308","commenter_b":"criminals do know each other and apparently marry their offspring to each other's families!","commenter_a":"Father a criminal politician, Ex., asked for Clinton's support in Mizzou 2 years ago, not to be, and there is some concern that Hillary supported with information received as Secratery of State, investments made by Mezvinskey the younger, including a deep water construction opportunity...............!","post_message":"Allen West Republic"},{"comment_id":"499065056962019","commenter_b":"I can't stand her. Send her back to India where her parents are from.","commenter_a":"We can't let the GOP pick and choose who they want in office. It is up to the voters! GOP take notice, heed our warning, because if this does happen, and Donald becomes and independent; there will be. Democrat elected!","post_message":"Now that she criticized him, will Donald Trump snuff out Gov. Haley's rising star?"},{"comment_id":"1749284951998475","commenter_b":"I love this","commenter_a":"@username @username me in second year","post_message":"An AirAsia plane accidentally flew more than 400 miles in the wrong direction"},{"comment_id":"10153545151956336","commenter_b":"Megyn deserved the beating from Trump. She's an uppity bleach blonde.","commenter_a":"Tonight Fox sucks","post_message":"“I think the big problem this country has is being politically correct. I don’t, frankly, have time for total political correctness.”    Donald J. Trump responds to Megyn Kelly after she asked him, “How will you answer the charge from Hillary Clinton…that you are part of the war on women?”"},{"comment_id":"10154780411199228","commenter_b":"She's Caucasian that's why...duhhh","commenter_a":"She is pretty enough she probably could have had any man she wanted. What on earth would posess her to choose a boy? Pretty sickening!","post_message":"The parents were allegedly \"accepting of their relationship,\" even inviting her to family gatherings."},{"comment_id":"10154635406324726","commenter_b":"@username Cowardly weasel!","commenter_a":"I keep reading all these allegations of her but nothing happens. Apparently a revolution against the government is inevitable?","post_message":"Emails suggest Clinton removed diplomatic security officers so private-charity aides could hitch a ride."},{"comment_id":"10153076463414753","commenter_b":"If a woman in a bikini top was eating, would you also become this aggressive and immature ?doubt that very much. Grow the hell up.","commenter_a":"and why should we have to move our seat, or \"look away\"? we pay our money for a peaceful meal, not a side show!!!","post_message":"A woman in a cafe was nursing her child when she was approached by a man who asked her to cover up. That's when the cafe owner stepped in and had a few choice words to say."}]
