[{"comment_id":"10154501984339087","commenter_b":"@username So they get deported five or six times then come back and kill innocent people. Did you know that most of them send money back across the border to help their families come here.","commenter_a":"Trump cost himself the popular vote. He already said he is keeping Obama's amnesty in place. So if he's blaming the illegals why would he keep them here? He is such a lying fool and his supporters suck it up.","post_message":"\"He said 3-5 million 'illegals' voted so that's why he lost popular vote,\" one Democratic aide said about President Trump's comments at the meeting."},{"comment_id":"10152968850756519","commenter_b":"Affirmative action laws are in place. Maybe she could work to eliminate them all so that we all get a equal opportunity in education, employment and business instead of posing as a woman of color and cutting in front of EVERYONE ELSE in line..lol, Caitlin Jenner can cut in right behind her.","commenter_a":"1 Rachel Dolezal = appropriation/ race traitor and an abomination. 1 million \"Rachel Dolezals\" = 1 million \"less racist\" white people, who are fighting for the advancement of colored people. Weird to think about.","post_message":"Rachel Dolezal finally speaks: \"As you probably know by now, there are questions and assumptions swirling in national and global news...\""},{"comment_id":"550730825100820","commenter_b":"Smash these racist fucks with the same pipe, then hit them in the throat with it.","commenter_a":"Public beating","post_message":"Black Thugs Smash White Girl's Face With Metal Pipe For This Unbelievable Reason  This is horrifying. Imagine if this was your daughter.  What punishment would you want for them?"},{"comment_id":"1225473394192695","commenter_b":"@username you suck big donkey dicks","commenter_a":"A man of class, dignity, character, honesty...everything goid and positive. God bless our nominees, and the Unired States of America!","post_message":"Republican vice presidential candidate Mike Pence holds a town hall."},{"comment_id":"10154808382292235","commenter_b":"What about Ted (Shit my pants draft dodger) Nugent? He can play his one and only hit about pussy grabbing.","commenter_a":"Ted will need to wear a diaper","post_message":"Looks like it's just Ted Nugent and Kanye."},{"comment_id":"10153623259427623","commenter_b":"@username coming here isn't a right. And yes, it is the same thing. Building a wall to keep people who don't belong here out is no different than you locking your door. You lock your door to keep people out.","commenter_a":"If you lock your doors at night then you agree with Donald J. Trump. I expect my government to be at least as security conscious about my country as I am about my family. This is not racism or rudeness, but common sense safety measures in a time such as this.","post_message":"All of Donald Trump's talk of constructing a wall between the U.S. and Mexico has inspired an artist to build a little border wall around Trump's star on the Hollywood Walk of Fame."},{"comment_id":"1111151122296756","commenter_b":"This makes Chicago sound a lot like Baltimore for the \"quality\" (corrupt, criminal) of incumbent leadership (I grew up in the south side of Chicago all the way back to the 60's - and am not much impressed with what the present day enthusiasts think of my opinion. I also lived for a while in Viet Nam, and there we were allowed to call the other guys \"enemy\", and to shoot back at targets of opportunity, ... just sayin\") @webpagelink","commenter_a":"I knew there was a dirty Democrat involved in that ruckus!","post_message":"Inside scoop, here . . ."}]
