[{"comment_id":"10153129775024877","commenter_b":"yeah big black women are ugly","commenter_a":"why they didn't get a plus size white girl in there too ??","post_message":"Target is using 'real' models in its new summer swimwear collection.  Grio fam - do you think it's time more major retailers used body positive advertising? Or is this just a passing fad of acceptance? Sound off below!"},{"comment_id":"1836299966658207","commenter_b":"Damn @username is just as bad as those UNAmericam bitches","commenter_a":"Hey whoopie knuckle dragging Goldberg, I thought you were leaving if Trump got elected, get the fk OUT of OUR COUNTRY and take your brainless bimbos with you!","post_message":"Things got CRAZY on the set of 'The View'  when one host went completely over the edge, and then demanded that Donald Trump do the unthinkable. Viewers could hardly believe it..."},{"comment_id":"10154383385775975","commenter_b":"Thank you, OUR President Donald J. Trump❤️🇺🇸 #MAGA","commenter_a":"Loving it loving it","post_message":"\"I didn't come along and divide this country. This country was seriously divided before I got here.\"  President Donald J. Trump addressed the deep division Americans face.  Read more about today's press conference: @webpagelink"},{"comment_id":"10155048729377235","commenter_b":"I cannot and will not even listen to this lying disgusting woman! I cannot watch her on TV for even three seconds, she makes me wanna puke!","commenter_a":"Oh shut up!","post_message":"The Trump administration just doubled-down on their attack on one of America's biggest allies."},{"comment_id":"10152816135991130","commenter_b":"This isn't funny... Only simple minded people would find it funny. I am not a fan but think this was not necessary.","commenter_a":"Leave the kid alone, can he live? I'm not even a fan I just hate hateful people like the media and evil bloggers ugh","post_message":"WOW. Just wow."},{"comment_id":"10154428914569411","commenter_b":"What refugee crisis? These invaders are not refugees.","commenter_a":"I have never seen such inhumanity as I have seen in the west where personal freedoms are more important than justice and what is right. The REFUGEE crisis is just the latest example of this.","post_message":"'Our chancellor has given up the sovereignty of the country, she has given up our borders, she has given up our rules and regulations'"},{"comment_id":"10154731295753145","commenter_b":"A lot of merchandise with the \"Trump\" name on it is lagging in sales. When the sales of anything is down, stores WILL drop them.","commenter_a":"Geez ppl grow the F up and quit crying, he is our president and what the USA needs the most is for all Americans to come together.....united as one!!! This country needs help our own people are starving let's feed them first.","post_message":"Just last week Nordstrom stopped selling Ivanka Trump fashion brand."}]
