[{"comment_id":"10153503601036770","commenter_b":"BLM? not at all! worthless savage racists. if they think that their worthless lives matter then go into the dangerous crime ridden ghettos created by blacks and convince them to stop killing each other. I would rather give black thugs target practice so that they don't hit innocent bystanders when trying to shoot each other.","commenter_a":"SCREW BLM...","post_message":"A controversy has erupted at Dartmouth College after a pro-police display was torn down by Black Lives Matter activists, who denounced it for memorializing the \"perpetrators\" of \"state violence.\""},{"comment_id":"10153748697767629","commenter_b":"If white women didn't flunk every black and Latino out we might have the blacks in college and in education that we need.","commenter_a":"When are we going to start making teachers uncomfortable and scared? its a white, more privileged profession with more time off. Especially at the college level. Shouldn't they fear being shot in the head too? Thankfully we are getting guns on college campuses so that all authority can be radically challenged with an in your face confrontation. The Russian left has always known the power of confronting authority so I'm glad America is catching up. War and Revolution baby! Just like the founding fathers intended.","post_message":"This is beautiful."},{"comment_id":"1629939420634866","commenter_b":"I agree with Trump. YOU WANT TO SELL IT HERE,THEN BUILD IT HERE!","commenter_a":"Protectionist policy won't work. America is not making any friends with actions like this. Don't buy American will soon be the global response.","post_message":"Checkmate!"},{"comment_id":"10154242349186336","commenter_b":"Darwin is going to get this woman one day soon.","commenter_a":"stupidity !!!!!!!!!!","post_message":"\"This woman is extremely lucky. We can’t explain why he didn’t get up.\""},{"comment_id":"10154061542714411","commenter_b":"\"Hey, Jews are getting their own country, let's all go be our typical fuckhead selves and try to butcher them all.... we'll need a name, someone go digging around and come up with something while I strap a bomb to my kid\" (The founding of Palestine).","commenter_a":"O God!!! hahahahahaha...Ignorant Mr.MP...","post_message":"Letters matter"},{"comment_id":"1157156847640695","commenter_b":"All we need is more illegal Queers !!!!!","commenter_a":"Bullshit people!","post_message":"American taxpayers must now pay for separate facilities for folks who come across the border and don know what gender they are."},{"comment_id":"10154414773758279","commenter_b":"@username what makes you think that? Drones ARE killing civilians. Listen to the video again.","commenter_a":"A few more of this resignations and Obama would be forced to admit that he is on the immoral side of history. This could be an effective form of civil disobedience.","post_message":"Watch: U.S. Army Reserve Chaplain Capt. Chris Antal reads his resignation letter to President Obama."}]
