[{"comment_id":"10154937686570329","commenter_b":"They must belong to one sexy mother fucker","commenter_a":"Those are some sexy thighs","post_message":"END OF STORY."},{"comment_id":"10153183802333188","commenter_b":"\"The walking dead\" are serving as most of our representatives in Washington, take a good look next time someone speaks to the Congress.","commenter_a":"Why do you think it's so good? It prepares us for what we might expect in a SHTF scenario.","post_message":"I don't watch The Walking Dead like most people..."},{"comment_id":"1571937346447279","commenter_b":"Get a new woman then!","commenter_a":"In the singing voice of Brad Paisley: Im gonna miss her.... I love my husband AND my guns!","post_message":"\"Sex strike\"  WATCH:"},{"comment_id":"1023827831012269","commenter_b":"Darlene Daniel not fair to Americans. Take way American jobs with low wage illegal invaders","commenter_a":"We \"ALL\" know that Donald Trump is \"NOT\" afraid of Megyn Kelly. Actually it is just the opposite. Fox News is AFRAID OF DONALD TRUMP.","post_message":"Michael Moore chided Donald J. Trump for being afraid of Megyn Kelly and backing out of the upcoming Republican debate Tuesday night on \"The Kelly File.\""},{"comment_id":"10153712175233352","commenter_b":"So it would be ok to throw down in front of a toddler is that what you are saying? She should have put her down for what huh, for what? Get some sense in your head !! The only guilty party is the lil bitch who hit the girl holding a child she is a straight up coward and thats probably the only reason she hit her cause her hands were full!","commenter_a":"I think all parties are guilty the ones egging it on the mother of the child and her friend. Her friend seen what was going on so she should have taken the baby and the mother... Should have put the baby down as she see the girl kept saying put the baby down and appeared not to give a dam. Believe me all parties played their part in the hatred or what ever that got them to this point. In reality the mother used her child as a pawn thinking it would have saved her from a ass whooping putting her child in danger. Thank God the female was caught and the baby is ok. They all need to get it together... Because believe they all full of shit and played a roll in this fight...","post_message":"Texas girl, 13, who was caught on camera as she launched brutal assault on rival teen holding a toddler is now in police custody"},{"comment_id":"853953454653203","commenter_b":"Wow::hey woman-let go of her hair and fight,","commenter_a":"Can we please get the blurred trip screen out so we can actually see something?","post_message":"WILD AND VIOLENT BRAWL: An all-female fight goes down outside a gas station and the spectacle was captured on video. Kicking, punching, hair pulling. We can't make this stuff up."},{"comment_id":"10152602108687061","commenter_b":"And a fat hoe","commenter_a":"Michelle looks more like a hoe everyday","post_message":"Pres. Obama: \"I have no more campaigns to run.\"  (audible clapping in chamber; pause)  Pres. Obama: \"I know, 'cause I won both of 'em.\" #SOTU2015 -- (click for audio) abcn.ws/1JbdOLY"}]
