[{"comment_id":"10152837238297483","commenter_b":"If you don't like it stay away, you certainly won't be missed .","commenter_a":"That's the problem in Alabama this history of Republican leadership we need more liberals to vote","post_message":"Columnist John Archibald weighs in on how modern-day Alabama fits into the Bible Belt:  \"Alabama ignores that 'thou shalt not kill' commandment, posting the second highest murder rate in America in 2013, the last full year available. And blessed aren't its poor. According to the National Center for Children in Poverty, half Alabama's children are low income. Yet we still tax groceries.\""},{"comment_id":"10153083814076051","commenter_b":"Americans! Utilitarians. They have no use for you unless they can use you.","commenter_a":"@username said it all.","post_message":"This dog has one little deformity. Still, his owner decided it was just too much to deal with and opted to get rid of him."},{"comment_id":"10154373369462042","commenter_b":"I like Hillary. Good luck Hillary","commenter_a":"Love and support my President and #ImWithHer...","post_message":"President Barack Obama and Hillary Clinton make their first joint campaign appearance in North Carolina."},{"comment_id":"1242469175793552","commenter_b":"Righto. Execute the little bitches! That will teach them a lesson!","commenter_a":"Sorry. If you watch the news you cannot just let things go with kids anymore. This time it was pepper that choked the teacher, who knows what would have happened in a few years if another teacher pissed them off........rat poison?? Good lesson to learn early.......being a little psycho bitch is not going to pay off.","post_message":"Three 12-year-old girls have been charged with first-degree felonies in the latest example of America’s insane rush to criminalize children."},{"comment_id":"10153203365116615","commenter_b":"your right she shouldn't be. she should be just shot!","commenter_a":"Good. She shouldn't be.","post_message":"Her baby was just hours old and still had his umbilical cord when he was found by a church custodian who heard him crying."},{"comment_id":"10153236648136167","commenter_b":"Pretty sure that Mika just","commenter_a":"MSNBC is such an embarrassment to itself.","post_message":"Hours after MSNBC itself reported that this lie was debunked, Joe Scarborough was still pushing it."},{"comment_id":"10154285238753984","commenter_b":"Dumb fucks.","commenter_a":"Yeah your baby sixteen not thirty???? but with a gun???? l bet he said before l'm a man a man he probably never said l'm a baby!!!! He pointed a gun at some cops you don't do that.If you point a weapon at someone it's to use it.And a good baby doesn't run from cops!!!! A gang member thug??? a baby???pleaseeeeee!!!! Over all it's sad when a young teen dies in this awful way. But you!!!! the parents of this teen is to be blame even charge with child cruelty for not teaching your baby respect since the beginning!!!! again it angry's me the ending of this young man!!!!","post_message":"A police officer chased the 16-year-old after he says the teen fled on foot from a car and then pointed a gun at him, which resulted in the shooting. Protests immediate erupt after eyewitnesses make this huge claim about the incident..."}]
