[{"comment_id":"684314941708338","commenter_b":"You pussy","commenter_a":"A vote for Trump is a blatant vote for racism. I'm so embarrassed at the people who support such hatred.","post_message":"Skywriters' message for Donald J. Trump: \"America is great. Trump is disgusting,\""},{"comment_id":"631005147090064","commenter_b":"run him off. his wife also.","commenter_a":"he must be on drugs again.","post_message":"Obama said that America wants him to run for a third term, here's how they responded.  What a joke. This is absolutely ridiculous.  Do you think Obama should run a third term?"},{"comment_id":"1360351430654310","commenter_b":"Thank you for your vote of confidence but as of right now my focus is on college classes and getting my degree ASAP .","commenter_a":"Oh god I hate her . She is such a hypocrite. She calls us snowflakes for complaining but her job is literally to sit behind a desk and complain about things she doesn't like . She is the biggest snowflake of them all ( next to lord twitterfingers of course ) . For someone who's a millennial and who \" doesn't like labels \" she sure does like to label everyone else . She's not even a real journalist, she is a glorified YouTube personality .","post_message":"She came after Meryl Streep  and that was the last straw."},{"comment_id":"943744942348702","commenter_b":"To those of you who think the federal government can raise incomes do yourself a favor and take an economics class. And pay attention.","commenter_a":"Someone please perform a partial birth abortion on this woman.","post_message":"\"The defining economic challenge of our time is clear: We must raise incomes for hard-working Americans so they can afford a middle-class life.\" Read Hillary's ideas for the economy in her own words:"},{"comment_id":"10153733539132169","commenter_b":"\"thank you for your service\"","commenter_a":"Jasmine Taylor","post_message":"Join The National Memorial Day Concert (PBS) this Sunday at 8/7c for an evening of remembrance, featuring General Colin L. Powell, Renée Fleming, The Beach Boys, Katharine McPhee, Trace Adkins, S. Epatha Merkerson, Esai Morales, Alfie Boe, Trent Harmon Music, Maestro Jack Everly and co-hosted for the eleventh year by Joe Mantegna and Gary Sinise. Join the conversation at #MemDayPBS"},{"comment_id":"10155013986101162","commenter_b":"Lmfao!!","commenter_a":"@username just because I saw your shopaholic post lol","post_message":"LATE PACKAGES: Amazon may experience some holiday turbulence in its shipping due to a contract dispute with pilots..: @webpagelink"},{"comment_id":"989968744373799","commenter_b":"I will be keeping the guns thank you.","commenter_a":"We need anti knife and anti-texting while driving legislation.","post_message":"Commentary from Blaze contributor and pastor Jarrid Wilson."}]
