[{"comment_id":"10152934995226680","commenter_b":"Seems you want to engage in gossip. I got better things to do with my time. Scoot along Andrew.","commenter_a":"Bernie's right. The biggest mistake of the Clinton administration was dismantling Glass-Steagall.","post_message":"Bernie Sanders: \"Allowing commercial banks to merge with investment banks and insurance companies in 1999 was a huge mistake.\""},{"comment_id":"10153202984559726","commenter_b":"California can have all the nation's illegal aliens! Start shipping them over right now. California sucks donkey balls.","commenter_a":"Give them all the water they can drink!","post_message":"California proposes $1.2 billion MORE in benefits to illegal immigrants--including healthcare & Office of \"New Americans.\""},{"comment_id":"1766066213681675","commenter_b":"@username trophy wife No. 3 was a soft porn model who also lies like through her teeth. No wonder she squints so much, trying to find her sugar daddy's pee pee!","commenter_a":"\"Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s.\" --Melania Trump","post_message":"\"Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s,\"  Charles Harder, a lawyer representing Trump, said in a statement."},{"comment_id":"10152917753321051","commenter_b":"The bitch cussing in the background should not be near kids!","commenter_a":"Good for you two to look out for that child! She shouldn't be near any children! !!!","post_message":"When a man saw how this woman was treating a 3-year-old, he knew he had to intervene."},{"comment_id":"1200289290023832","commenter_b":"It just needs to be remembered do this with no violence unless it is used on them and if the illegal aliens respond with violence deal with them direct and swiftly. No questions just stomp them and dump them back across the border.","commenter_a":"She just deserve a raspberry. It is the to be said to her. Our immigration system needs work but she is really talking about letting illegal aliens in. The term illegal means we have acknowledged that they have committed a non-legal act, thus becoming a criminal. That means do not pass Go do not collect 200 dollars. They are already being coddled at our expense. If, they are caught they should be taken direct to be fingerprinted and photographed, then directly to a border. If, they are identified as having done it before. We should setup a location far away to ship them to. This non-American needs to mind her own business, instead of trying to shovel her troubles on to us.","post_message":"Oh really?"},{"comment_id":"1017722631617599","commenter_b":"@username, you and your daughters are throwing your votes in the TRASH then.......smh @username 2016","commenter_a":"I hope Bill & herself have plenty of room for the Syrian refugees, since She is so kind to the terrorist islamics. #Stupid to BRING THE ENEMY HOME!!! Utterly wrong. SHE HAS #LOST my Vote... and my two daughters Votes. #MARCORUBIO will be my choice now.","post_message":"We cannot allow terrorists to intimidate us into abandoning our values. Turning away orphans, applying a religious test, discriminating against Muslims, slamming the door on every Syrian refugee—that is just not who we are. We are better than that."},{"comment_id":"10156503411730354","commenter_b":"Obama and Bergdahl both need to be tried for treason, found guilty then shot.","commenter_a":"obama's plan is working.","post_message":"***BERGDAHL AND OBAMA HAVE DISGRACED AMERICA***"}]
