[{"comment_id":"10153269973986167","commenter_b":"Enjoying your tax Magnus rates? And how many refugees and immigrants are you valuing?","commenter_a":"As a Scandinavian, I don't know if I should laugh or cry on your behalf....","post_message":"An actual question from last night's #GOPDebate"},{"comment_id":"888687604591297","commenter_b":"@username freedom of speach bitchhhh","commenter_a":"Yo man if you really care about the U.S.A and everyone in it there is something you should do... \\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b$18,152,809,942,589 is our current debt... Donate all your money except a mil to our debt... A mil is a lot more than most of us will ever see... Your money wouldn`t even really touch our debt but still would help... If you really care help us out... It wasn`t the average Joe`s fault... It was the all politician`s fault\\b\\b\\b\\b\\b\\b\\b\\b... Help us out bro and you`ll earn my vote...","post_message":"I've created tens of thousands of jobs and I'm really good at it. As President, I WILL get America back to work! #MakeAmericaWorkAgain"},{"comment_id":"10153281305806770","commenter_b":"Ladies need to have a knife, walk in pairs and stab to death the attacker. Do not attempt to wound.","commenter_a":"MODERN GERMANS NOT ACCUSTOMED TO ANIMALS","post_message":"The Cologne Carnival kicked off Thursday with 22 reported cases of sexual assaults, including two rapes, despite increased security."},{"comment_id":"1776409695942163","commenter_b":"@username, sorry to say this but you might have missed the point.","commenter_a":"Michelle isn't even remotely in her category .. get real...sorry.?","post_message":"Nothing wrong with nude modeling, but could you imagine how they would scream if Michelle Obama had done this? Hypocrites..."},{"comment_id":"10153191850561051","commenter_b":"Bitch","commenter_a":"Here's a perfect example of \"children aren't born racist, they are taught racism\" That woman should be ashamed of herself.","post_message":"When a mom heard what this lady was saying to her kids, she took out her phone and began recording."},{"comment_id":"10153647642558352","commenter_b":"She's the other woman, this is why women need to stop claiming men until they put a ring on it and claim you","commenter_a":"Sad","post_message":"GIRLFRIEND FINDS OUT ON SOCIAL MEDIA HER SUPERSTAR SOCCER PLAYER BOYFRIEND MARRIED ANOTHER WOMAN RIGHT AFTER SHE DROPPED HIM OFF AT THE AIRPORT (PHOTOS)  This is real bad!"},{"comment_id":"10153204205229087","commenter_b":"Dude....please, I had a lovely friend who died recently because she was too afraid of how much it would cost to go to the doctor. So, with all due respect, I don't think you know what you're talking about.","commenter_a":"No Bernie, we shouldn't. Healthcare is not a right, it is something acquired by honest toil, and it is NOT something everyone needs, shown by the IRS' discovery that people are paying the stupid tax penalty rather than buy something the government is telling them to buy but which they DON'T need. \"People should not be dying in the US because they're sick.\" They're not, Bernie. It's a myth from the ideology of myths you refuse to see have no basis in truth. @webpagelink","post_message":"“We are the only major country on earth that does not guarantee healthcare to all people as a right, and I think we should change that,\" Bernie Sanders said."}]
