[{"comment_id":"555636131271583","commenter_b":"I HOPE THE IDIOTS NAME LIST I HAVE SEEN DO! We Will cleanup AMERICA! BY THESE WEAKKNEED BITCHES LEAVING WE CAN HAVE A REVIVED NATION","commenter_a":"If only it were true. Jobs for everyone!","post_message":"28 percent of American voters said they would likely consider leaving the country if Donald Trump becomes president."},{"comment_id":"10153058619121051","commenter_b":"She should go to prison for years and starved on a day bases! She is disgusting!!","commenter_a":"Poor little baby","post_message":"Even the police were stunned that someone would treat a dog like this for no reason."},{"comment_id":"10153996676511770","commenter_b":"Her hips are way way too big. She just looks out of proportion","commenter_a":"Fat and ugly wannabe!!! Hope she is going into psychiatry!","post_message":"Do her steamy Instagram photos cross the line?"},{"comment_id":"10152795603885950","commenter_b":"if i turned into a woman id still want a woman so id be a lesbian, lets all turn to woman","commenter_a":"thats right, if i want to be a woman, ill be a woman, but i kind of like my dick so ill keep it","post_message":"\"If he says he's a woman, then he's a woman.\""},{"comment_id":"1250005395092512","commenter_b":"Damn, please fire her & throw her in jail.","commenter_a":"Ugh...","post_message":"Just another day in America."},{"comment_id":"10153211085979087","commenter_b":"I am not afraid and I know no one who is. Though I support you Dr. Carson, you are wrong. Close the border to Muslims until we can sort all this out. Israel has it right, they profile and so should we.","commenter_a":"So I on board.","post_message":"\"We are losing this war while America looks and feels afraid at home,\" Dr. Ben Carson writes in an op-ed for The Hill. \"By the jihadists’ measure, they are winning. They have changed our country, created a republic of fear and, as Osama bin Laden predicted, his enemies are destroying themselves.\""},{"comment_id":"1386005081478024","commenter_b":"Thank God! We are the voice of this babies.","commenter_a":"So let me get this straight.. These wingnut lefty/leberial woman who are marching all over today are really attempting to fight over their treasured planned parenthood. They want to keep the free goverment \"healthcare\" for women. Correct me if I'm wrong but, isn't their local welfare office giving out medical cards to cover 100% of their \"healthcare\" needs?? Oh wait, this is primarily an adult sized temper tantrum because they want the right to abort babies. PLAIN AND SIMPLE. Can't wait for Trump to sign the bill for defunding😡🇺🇸","post_message":"Baby-killing organizations that have been using government money to fund their sick, worldwide abortion agenda just got some seriously bad news... here's what Donald J. Trump just did to send them into total panic.  A lot of liberals are going to be furious about this... what do you think?"}]
