[{"comment_id":"10153176907066130","commenter_b":"And not be forcibly altered. Don't circumcise babies!","commenter_a":"Before picture or nahhh","post_message":"\"We need to remove the stigma. We should be able to alter whatever we please, free of the judgment of others.\""},{"comment_id":"10153045402661336","commenter_b":"Shut up idiot!!!!","commenter_a":"Early Bird gets the cage","post_message":"A Georgia sanitation worker has been sentenced to 30 days in jail for picking up trash too early in the morning."},{"comment_id":"1103535999742651","commenter_b":"she is at best...an annoyance...go home and look for russia...","commenter_a":"I spent ten years in the military just got home three years ago been through all sorts of problems and have been diagnosed for ptsd and through everything that's been going wrong since I've been back I still never not once didn't have control of myself even when I caught my ex-girlfriend of six years sleeping with a coworker of hers she started seeing when I was on duty.I just asked her to I'll say made her move out. And every brother from the core I was at salute President Obama and there were over hundred of thousands of us there so don't believe what people are saying here about the military disliking President Obama we salute you sir.","post_message":"“What did I say that’s offensive? I don’t regret any comment I made, because I didn’t lay PTSD at the foot of the president.\"  - Sarah Palin"},{"comment_id":"10153935063641636","commenter_b":"There is more evidence for the existence of spongebob than your nonsense.","commenter_a":"(B.A. Bible/Biology)* NOT MILLIONS OF YEARS OLD! Evolutionary dating methods are not infallible science, are based on certain built-in assumptions, and have been proven to be contradictory and inconsistent. Please read my popular Internet article, ARE FOSSILS REALLY MILLIONS OF YEARS OLD? There a lot of evidence that the fossil layers were not deposited by gradual floods, which would have required millions of years. Rather, the evidence strongly points to a one world-wide flood that fossilized species, just as the Bible teaches. The fossil layers in the real world are not even found in the sequence taught in evolutionary textbooks. There are many places where fossils of complex creatures are found beneath simpler ones, and there are fossils of mixed species existing in the same stratum which classic evolutionary textbooks teach should have been separated by millions of years. There is absolutely no proof of macro-evolution in the fossil record. ...","post_message":"BREAKING"},{"comment_id":"1089895574436829","commenter_b":"Instead of running for president she should be running from prison","commenter_a":"If you're under 50 you really need to read this. If you’re over 50, you lived through it, so share it with those under 50. Amazing to me how much I had forgotten! When Bill Clinton was president, he allowed Hillary to assume authority over a health care reform. Even after threats and intimidation, she couldn’t even get a vote in a democratic controlled congress. This fiasco cost the American taxpayers about $13 million in cost for studies, promotion, and other efforts. Then President Clinton gave Hillary authority over selecting a female attorney general. Her first two selections were Zoe Baird and Kimba Wood – both were forced to withdraw their names from consideration. Next she chose Janet Reno – husband Bill described her selection as “my worst mistake.” Some may not remember that Reno made the decision to gas David Koresh and the Branch Davidian religious sect in Waco, ...","post_message":"The numbers don't lie... but Republicans definitely do.  Thanks to Armed Democrats."},{"comment_id":"1056097081119075","commenter_b":"These lowlife Muslims are doing that in every country they are aloud into ! It's even going on here in America . It's how they take over a country without fireing a shot , they just out reproduce the natives and within a decade or two they will out number and be able to inpliment sharia laws ! We know Muslims have completely taken over one American city and are working on many more ! All these Muslims Obama has been bringing in are sent to certain cities for a reason ! Obama and Hillary are traitors and she will just pick up were Obama left off !","commenter_a":"Surprise, surprise.","post_message":"Muslim Pig Explains How He LIED To European Authorities To Bring In 4 WIVES  They are all about gaming the system and abusing our freedoms.   @webpagelink"},{"comment_id":"10152884468574877","commenter_b":"Happy birthday you beautiful queen","commenter_a":"Happy Birthday!!!!!","post_message":"We are wishing Lupita Nyong'o HAPPY BIRTHDAY today!!  The Academy Award winning actress received her masters degree in acting in 2012 from the Yale School of Drama and in 2014, she was named \"The Most Beautiful Woman\" by People and \"Woman of the Year\" by Glamour.  LIKE and SHARE to celebrate!! >>>@webpagelink"}]
