[{"comment_id":"10153337670592061","commenter_b":"Omg your so ignorant lady!","commenter_a":" I've had enough of this 'let's show black crimes in the news disproportionately bs' what's up with those occupy federal land militia and who's going to right the Steve Avery corruption wrongs. What he has to be an affluenza to qualify for civil rights in America?","post_message":"WATCH: Kidnap victim explains how she escaped after an alleged carjacker jumped into her car and forced her to drive nearly 150 miles: @webpagelink"},{"comment_id":"10154840376458812","commenter_b":"Yes sir he is.... Charmayne E bradley it saddens me so much to see baby's getting killed for nothing...i will continue to pray for them u and I . I often wonder what this world would be if everybody get together and love one another and stop with all the violence n hate","commenter_a":"Lord Jesus Christ our world is in dire need of ur help Jesus Christ plz help us all this world is beginning to all apart we don't know who to trust people are turning on each other and lord we don't know why r where all this hatred is coming from plz lord take care of all of us show us to love n trust n help one another the world is big enough for us all.respect love n in god we trust.....","post_message":"Video shows Syrian girl rescued from rubble after airstrike on east Aleppo neighborhood that killed at least 23 people, including 16 members of the girl’s family, activists say. @webpagelink"},{"comment_id":"518655931675108","commenter_b":"@username no all men do not have affairs!!","commenter_a":"Thank you Marine for speaking the truth Hillary is a liar and murderer and should be put in the electric chair, Bill is as bad as Hillary and I can understand why he was screwing Monica. From what I read Hillary likes screwing with other women","post_message":"Marine Confronts Hillary To Her Face About Benghazi, And Then THIS Happens [VIDEO]  Let's show this man our support!  Can we get 30,000 'LIKES' for this Marine?"},{"comment_id":"1633936340229657","commenter_b":"TWISTY IS REAL","commenter_a":"@username well this sounds like fun","post_message":"Residents in this neighborhood are saying creepy clowns are trying to lure children into the woods.  #MicBrights"},{"comment_id":"10155846311480405","commenter_b":"God tell you to eat there!! Moron!!","commenter_a":"Just had some Chick-fil-A minutes ago at the Atlanta Airport !!! @username and Susana Martinez !","post_message":"Ate at the original Chick-fil-A in Georgia. -SW #Walker16"},{"comment_id":"1829596377287822","commenter_b":"I don't think Zippy Goldberg never looked up anything and that's why she always sounds like an idiot that hates America I just hope that if white people finally start rioting , go to wherever she lives to take her things and burn her cars so she can get a feel for what it's really like.","commenter_a":"Who watches that nightlight anyway?","post_message":"Whoopi Goldberg just scolded millions of Americans on The View. Apparently if you voted for Trump, it's because you \"didn't do your homework\" on Hillary."},{"comment_id":"10153776818934255","commenter_b":"eliminate money...take their power...then its not \"too costly\" to protect the planet...and the creatures that inhabit it...its up to the people","commenter_a":"They were also in with Gov. Jeb Bush pushing education vouchers in Fl. that took money from public education.","post_message":"Unreal.  #DailyKosClassics"}]
