[{"comment_id":"1007967755882148","commenter_b":"All parents need to step up and take charge like this mom. There would a lot less bs going on with teenagers these days.","commenter_a":"that it's mother style similar to CUBAN MOTHER BRAVO;MOTHER UNITED ja,ja,ja toma pelona qien lleve los pantalones a la hora de mandar.I ALWAY SAID TO MY SON THE DAY THAT YOU TRYING TO GOES OVER ME UNTIL THAT YOU GOES TO KNOW WHO IT'S YOUR MOTHER NEVER TRY","post_message":"Be sure to LIKE WND.com to stay connected!  @webpagelink"},{"comment_id":"10153548183098984","commenter_b":"Unless you're Native American, almost all Caucasians have ancestors that were thieves, murderers, and rapists. Shall we remember our horrible history? Shall we remember how Caucasians forced their way through other's land? Shall we remember the genocide that occurred? Shall we remember public lynches? Shall we remember the Trail Of Tears? Shall I go on?..... Who are the TRUE criminals here? Caucasian ancestors FORCED their way through due to greed. Most other immigrants come to America to WORK to provide for their family. So I repeat, UNLESS you're Native American, you come from immigrants as well, possibly even illegal. You're ancestors (Caucasian), if they've been here since the 1700s or 1800s, could have been the murderers, thieves, and rapist roaming around tormenting innocent. An add-in...who will do super low-pay labor? Mexicans are hardworkers, even when we are living in severe poverty, we still try to WORK. Anyone who has common ...","commenter_a":"Donald Trump is to good for any of them....you can't tell a Liberal the truth","post_message":"Donald J. Trump just taught these guys trying to bully him a SERIOUS lesson on why you do NOT try to play hardball with The Donald!   Do you think he has more backbone than Obama?"},{"comment_id":"10153182888819060","commenter_b":"Run, Kamala, run!","commenter_a":"@username - her Agenda is TO REPRESENT US, CALIFORNIA, in Washington, D.C., UNlike the Republicans who spout \"The American People Want\" yet they ( GOP ) go for what the 1%ers want.","post_message":"“An entire generation of Democrats, who have been waiting for this moment for years, took one look at Kamala Harris, and quickly backed off.” For the first time since 1992, California has an open Senate seat and only a Democrat can win. That should have been the cue for an almighty dust-up. Yet, one by one, a billionaire environmentalist, a former mayor of Los Angeles, and the lieutenant-governor, have all stepped aside so there is only one serious candidate. Are they scared? Yes. And they have every reason to be: Ms Harris is an intimidating opponent. The daughter of an Indian cancer researcher and a Jamaican economics professor, she is the first woman, first African-American and first Asian attorney-general of California @webpagelink"},{"comment_id":"10153533558288984","commenter_b":"EXCELLENT!!!!!!!!","commenter_a":"Yes, Christians need to stand together. The Supreme Court opened the door to more then gay's rights.","post_message":"Black pastors just made a drastic announcement about gay marriage... and they're refusing to back down.  This shows just how far they're willing to go to stand for their beliefs... spread this everywhere if you support them."},{"comment_id":"10154444576164586","commenter_b":"I would still eat the ishhhh out of that piggy","commenter_a":"What do they expect it's part of an animal! Keep showing these disturbing photos until it makes a real difference","post_message":"This is so gross, it's no wonder so many bacon-lovers are vowing to ditch it."},{"comment_id":"10154427050921037","commenter_b":"Illegals do jobs that the \"Americans\" won't do!!! Besides I have never seen any white person working in the field picking your precious organic fruit and vegetables","commenter_a":"no not working and supporting their families in the states and the ones back home. here I thought they just come over and sit around doing nothing but taking naps and drinking beer. lmao this is a joke.","post_message":"The ~11 million unauthorized immigrants in America are not “taking” jobs from US citizens, either."},{"comment_id":"10154178677146943","commenter_b":"Abedin is corrupt woman with an agenda..Hillary's agenda. Watch..if anyone goes down for corruption it will be her, and Hillary Clinton will get off by throwing her under the bus! It seems to me that HC always surrounds herself with live shields for her own protection. Everyone of them should be held accountable..starting with Hillary Clinton!! Why is she even a candidate?","commenter_a":"Lock them up...Lock them up...Lock them up!!!","post_message":"A Clinton Foundation donor and St. Louis-based political consultant begged Huma Abedin to get former Secretary of State Hillary Clinton to meet with her client, the U.S. largest coal company, according to emails released by a conservative legal group.  , I need your help now to intervene please, Joyce Aboussie, a Clinton Foundation donor with close ties to the former First Family, emailed Abedin in June 2009 after Clinton had been leading the State Department for about six months. - via The Daily Caller"}]
