[{"comment_id":"555636131271583","commenter_b":"I HOPE THE IDIOTS NAME LIST I HAVE SEEN DO! We Will cleanup AMERICA! BY THESE WEAKKNEED BITCHES LEAVING WE CAN HAVE A REVIVED NATION","commenter_a":"If only it were true. Jobs for everyone!","post_message":"28 percent of American voters said they would likely consider leaving the country if Donald Trump becomes president."},{"comment_id":"1581710041881753","commenter_b":"Maybe Madonna should offer the terrorists the same blowjobs that she offered for votes for Hillary!!!","commenter_a":"GO TO SYRIAand see what happens you stupid women","post_message":"Quite a national security position..."},{"comment_id":"1190682247676976","commenter_b":"Hey Bitch you may go to prison after all !!!","commenter_a":"No accountability on behalf of Killary Clinton for the Email scandal Teflon Bill and her remain unscathed in her unsecured private server and passing of top secret state emails, after only a 30 minute talk with Loretta Lynch Bill got it all worked out last week, oh and the FBI director was an Obama employee, how convenient! I bet if she becomes our president she will be protecting the Nuclear codes the same way and making sure her Iranian Aide Huma Abedin knows just where to keep or use them, no worries. Please don't vote for this KILLARY, because our nation can't afford someone willing to sell us out so easily, email scandal, enriched uranium scandal with Russia, Saudi money foundation scandal, Unsecured borders, she will take all your guns, and not to mention Benghazi. Trump 2016","post_message":"Up until now Hillary Clinton has faced a lot of serious charges, but nothing compared to the one that just got brought up.  If this goes through, Hillary's about to get hit with the most serious charge a leader can be accused of.   There's no way the media will let this get out..."},{"comment_id":"801271216730122","commenter_b":"This piece of garbage needs to go ahead and leave our country and take Kanye with her far far away","commenter_a":"Your the problem,and your friend obummmmer pos.","post_message":"Oprah Claims White People Are The Cause Of Racism In America. She's lost it. What a hypocrite. Do you think Oprah is the racist?"},{"comment_id":"930066070388844","commenter_b":"ANd Every one seems to have forgotten the 11 airliners still unaccounted for close to a year now","commenter_a":"That means trouble","post_message":"UPDATE: Hundreds of TSA badges missing at airports (VIDEO)  @webpagelink"},{"comment_id":"1051057634970056","commenter_b":"Poor woman","commenter_a":"Pro choice equals anti Christ. Stop having sex tie your tubes. No need to kill","post_message":"This is a win for women's reproductive rights."},{"comment_id":"1090152371065873","commenter_b":"NO! All the illegals should be put there until they can be legalized.","commenter_a":"No,never.","post_message":"The White House says it is committed to closing Guantanamo Bay and will overcome the obstacles Congress is causing to prevent this. Should Guantanamo be closed?"}]
