[{"comment_id":"10152968274184099","commenter_b":"Thank God!! These kids don't know what they are doing to their parents and the dangers there are out there. Stay ya tail in the house.","commenter_a":"Glad she is safe","post_message":"A missing teenager who left her Edgemont home more than a week ago wearing only pajamas has been found in Manhattan, police said. @webpagelink"},{"comment_id":"10154002938919749","commenter_b":"Cindy Rhodes go do one stupid cow feminists are scum","commenter_a":"If your still hung up on feminism within the uk and the us then you need to develop your personality. Not your discrimination skills.","post_message":""},{"comment_id":"10154033420732293","commenter_b":"He is just a Gangster! Sick! Abnormal!! Frighten thing!! If they indeed build the wall and this crooked man wins, every American is going to regretted as the will try to jump to the other side (Mexico) trying to be safe from his menace. He wouldn't care about America as long as him and his family gets their hands on the treasure, Money, Power and Threats!!! And American who voted for him, will find a job in Mexico planting food and cleaning, karma!!! Just let him win and you will see and live as Latinos, Africans and Chinese after a war.","commenter_a":"Imagine if you will 'The Donald' as POTUS - and after a speech, address, whatever.....people are scrambling to yet once again 'explain' what he said, to have to diffuse a potentially volatile situation with another country or world leader. I want my President to have clarity of thought, to speak in a measured, thoughtful and highly educated tone. I don't want her or his words to be subject to interpretation. His rhetoric is inflammatory, bigoted, and often without thought. His use of language is at best that of an arrogant, whiny, teen-ager. No way does this man possess the skill-sets needed to be my president.","post_message":"There have been multiple explanations. There haven't yet been any that work."},{"comment_id":"10154512331514087","commenter_b":"I don't blame them! I wouldn't want to work with the Chump either. But is that more inexperienced, mindless sheep the Chump can put in their place?","commenter_a":"LOL, I wasn't fired, I quit","post_message":"BREAKING: All State Department senior management officials have abruptly resigned."},{"comment_id":"1128296473875405","commenter_b":"Hillary is a Crooked lying Killer, Put Her in Jail & Make America Safe Again!!!","commenter_a":"Quanell X, leader of the New Black Panther Party in Houston, Texas, said this week on a local news program that black Americans should examine Donald Trump outreach to the black community and the relationship that black voters have with the Democratic Party. @webpagelink","post_message":"What you need to know about the \"alt-right,\" and Donald J. Trump connections to white supremacy and hate groups: hrc.io/2c3kLXT"},{"comment_id":"10153880758701337","commenter_b":"Lesbians","commenter_a":"Who the fuck cares..","post_message":"Justin Bieber has more than 50 tattoos yet this one fit perfectly in an unexpected spot..."},{"comment_id":"1681195205453281","commenter_b":"Barbara just needs to go away!","commenter_a":"Her opinion doesn't matter!","post_message":"Barbra Streisand blasted “narcissist” Donald Trump in a 1,228-word Huffington Post op-ed."}]
