[{"comment_id":"10152746460981636","commenter_b":"Feminists are heavily invested in the rape culture narrative, the fact that they always attack rape prevention shows this","commenter_a":"Did you dare to suggest that the onus should be on the perpetrators of rape instead of the victims? Prepare for a tirade of comments accusing you of 'calling all men rapists'...","post_message":"Perhaps the focus should be on the perpetrators of rape, rather than potential victims?"},{"comment_id":"1227335790638732","commenter_b":"You are a Pussy, bitch !!!","commenter_a":"Lmaooooo Go Ana....I LOVE IT 😂","post_message":"EPIC! Oh, and the woman in red is a REPUBLICAN! This happened tonight on CNN.  Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"10155343627345389","commenter_b":"She is to old to run for President. She is a liar and a cheaters.The women is another socialist like Obama. She need to go away for good.I'am sick of the Clinton and Bushes.","commenter_a":"She is a felon","post_message":"JUST IN: House panel subpoenas former Secretary of State Hillary Clinton's personal emails in Benghazi probe.  Question of the Day: Will the growing list of scandals hurt Clinton if she runs for president?"},{"comment_id":"10153008527037894","commenter_b":"Women can preach, but I don't feel like doing bible study to prove it.","commenter_a":"I thought the bible said that women weren't allowed to preach...","post_message":"Watch: Distraught ‘Christian’ Lady Loses Her Everlasting Mind Over Marriage Equality [Video]"},{"comment_id":"903785579812018","commenter_b":"OH BUT HE\"S BLACK HE DON\"T KNOW NO BETTER.SHIT HANG HIS ASS","commenter_a":"So sad","post_message":"She was shot down in cold blood and there were never any riots. This was a tragedy, and she will never be forgotten. Can we get 10,000 'LIKES' in her memory?"},{"comment_id":"10153772356976323","commenter_b":"Fuck off cocksucking bitch","commenter_a":"There is no climate crisis. It is a hoax of liberal desperation. There is however CYCLICAL climate changes.","post_message":"The fate of 70 million people rests on what happens to the Mekong river. Featuring extraordinary and beautiful drone footage of south-east Asia’s vast waterway, this important piece meets people struggling to deal with the impacts of climate change."},{"comment_id":"10154253853418967","commenter_b":"The only reason I stay on with these garbage gawker pages is to see the awesome Hogan memes.","commenter_a":"One Hulkamania isn't enough, Gawk ?","post_message":"The absurdity of Charles Harder threats should not distract from the underlying mission of the man who pays him: To intimidate Gawker and its reporters from publishing true things about public figures."}]
