[{"comment_id":"1712583705672199","commenter_b":"What happens when fish over populate and end up eating up their whole ecosystem..","commenter_a":"They're fucking fish were at the top of the food chain","post_message":"If you know anyone who still goes fishing, show them this."},{"comment_id":"10153476921072217","commenter_b":"^^ dumb feminist","commenter_a":"Merge the competitions. Let's throw them all together and give them all a shot at the big bucks!! You'd be lucky to see any women get past the first round. Different competitions = different money! Dry your eyes ladies ðŸ˜¬ðŸ‘ðŸ¼","post_message":"\"Sport is not like most of the industries the rest of us work in.\" ðŸŽ¾"},{"comment_id":"525207624325250","commenter_b":"Call girl wife! And not melania. Haha","commenter_a":"Can't wait! Donald has something huuuugggee. Haha lyin Ted. Spill the beans just before next primary voting!","post_message":"Ohhh boy....  You know about this, right?"},{"comment_id":"10153166657159456","commenter_b":"White devils are a nightmare!!","commenter_a":"Welcome President and Mrs. Obama. It is an honor!","post_message":"UPDATE: President Obama has arrived in Selma. Scheduled to speak at 1:35 p.m.  The President is on his way to Selma after landing in Montgomery. Should be there soon! @webpagelink"},{"comment_id":"10153169789203855","commenter_b":"She's a self-hating traitor.","commenter_a":"I thought Caitlyn was a Republican -- not at all a liberal. I'm sure I read that. Maybe Rush thinks party change is part of gender reassignment.","post_message":"A hateful man."},{"comment_id":"10152885159374342","commenter_b":"That witch would be 6 ft under! !!","commenter_a":"@username lol","post_message":"A 30-year-old woman faces criminal charges after a video surfaced that appears to show her storming onto a school bus and slapping a 5-year-old she believed was bullying her child.  FULL VIDEO/STORY --> @webpagelink"},{"comment_id":"10153561445142093","commenter_b":"Really lady? Liberals and Muslims want to rewrite history? @webpagelink","commenter_a":"There are already people who say the holocaust didn't happen. With today's trend of re-writing history for political correctness, it may disappear in the next 50 years!","post_message":"A WW II vet was reunited with a Holocaust survivor who he helped liberate and the incredible moment was caught on camera...@webpagelink"}]
