[{"comment_id":"10156418546700354","commenter_b":"Obama would leave the citizens help to protect their selves just like what happen to Paris.","commenter_a":"Isn't that what Carson said and he got chastised","post_message":"This is slated to air tonight on \"60 Minutes,\" and it's going to INFURIATE liberals..."},{"comment_id":"10152839812269753","commenter_b":"It's the POLIC WHO ARE PAID TO USE EXTRA FORCE (excessive force). It's not the job of employees, unless it's a security guard. They can RESTRAIN A PERSON UNTIL THE POLICE GET THERE.","commenter_a":"no she deserves it","post_message":"Even though she was able to successfully open the driver’s door of her getaway car, the man did not allow her to get much farther than that. He grabbed the shoplifting woman as she opened the door, turned her on her back and slammed her on the ground seconds later.  You think he used excessive force?"},{"comment_id":"10153114585296130","commenter_b":"but feminism isn't about equality or justice.. it is about hatred for males and the destruction of the family..","commenter_a":"a male feminist.. wouldn't that be a bitch boy?","post_message":"Mark Ruffalo takes the (feminist) cake."},{"comment_id":"10153656346543352","commenter_b":"I could careless about all that bullshit it's a proven fact your ugly ass hell & I damn sure look better than you on my bad day, you look old & wash up do your hair & get some better make up stop acting like your a model , you don't have ninjas checking for you mines face looks. Better than yours hoe","commenter_a":"Remove this dumb bitches ovaries make sure she doesn't get the chance to even enjoy a child if she ever wanted one after you take her shit out throw her away in jail","post_message":"Woman Hit With Murder Charges For Aborting Her Own 5-Month-Old Fetus In Her Car With Illegal Abortion Pill, Causing Baby To Die 30 Minutes After Abortion"},{"comment_id":"10152756329021615","commenter_b":"I hope she was telling him to go home!!!","commenter_a":"For sure","post_message":"This video showing a mother slapping her son during the Baltimore riots is going viral...we're hearing what the police commissioner has to say about it now on Channel 11 Morning News.  SEE FULL VIDEO: @webpagelink LATEST: @webpagelink"},{"comment_id":"10154474483213812","commenter_b":"Arrested for saving lives........?????? Your mother should have swallowed you.","commenter_a":"Why don't you take care of them too. He should be arrested for illegal immigration. Try and bring Mexicans through the US border and see what happens.","post_message":"Privately owned search-and-rescue company owned by American millionaire has saved 500 refugees and migrants at risk of drowning after only 2 days of searching."},{"comment_id":"10153694851768352","commenter_b":"A black woman wouldn't marry him because she doesn't want ugly kids! With his Ugly self....","commenter_a":"Trust me we won't! LOL ha ha ha #ugly","post_message":"‘I’m not a racist – but I wouldn’t marry a black woman, I want my children to look like me,’ says ‘white supremacist’ accused of inspiring Dylann Roof’s murder spree"}]
