[{"comment_id":"10153496846973132","commenter_b":"I highly doubt they kept having them JUST to have a girl.","commenter_a":"How selfish, to keep having kids only hoping for a gender. That 13th boy will someday realize he was only born because his parents hoped he'd be a girl.","post_message":"Maybe the 14th time's the charm?"},{"comment_id":"10155483281175231","commenter_b":"They tried to walk out and no is her business she can't just do whatever she want she pulled a gun on to people what was right about that. Just suppose they had weapons you do know the 2nd amendment applies to all citizens and they feared for their lives and shot the stupid white bicth. How ignorant","commenter_a":"her joint she can say and do what she likes......whatever...I would have just walked out..who cares","post_message":"Things reportedly turned into a scene out of Pulp Fiction."},{"comment_id":"10152892453289342","commenter_b":"Texans have had a better record than the cowgirls since they became a team up until the last 2 yrs.","commenter_a":"Come over to a winning team THE DALLAS COWBOYS!!!","post_message":"The greatest offensive player to ever wear a Texans uniform will play somewhere else next season.  The team has reportedly freed Andre Johnson up to pursue other options"},{"comment_id":"10153824664946336","commenter_b":"Just like Starbucks, learn to cook woman","commenter_a":"So many people falling for this. Of course the government wants everyone against Chipotle, because it's the first popular public chain against GMO's, which makes the government food companies look bad. I'll still be eating at Chipotle; everything they serve is still way better for you than the majority of fast food restaurants.","post_message":"The Chipotle Mexican Grill stores can open after they replace all produce, do a deep cleaning of their stores, pass a local health inspection and start a new protocol for cleaning produce."},{"comment_id":"10153730476318145","commenter_b":"Lol Hilary is a f** murderer and needs to rot in a prison cell.","commenter_a":"I never thought I would say this but I really hope Hilary wins !! Republican Party has become a freaking joke !!","post_message":"#BREAKING: Former presidential candidate Dr. Ben Carson will endorse Donald J. Trump, the real estate mogul said. Watch Channel 9 Eyewitness News at Noon for details and a recap of the GOP debate."},{"comment_id":"10153414168399024","commenter_b":"it's a big city...Houston may have enough fag votes for that bitch, but Texas does not! The voters of Houston will wake up and dump the fag...","commenter_a":"My question is, how did a liberal get elected in....Texas.","post_message":"Of course, Annise Parker doesn't care what the voters think. Typical liberal. @webpagelink #tcot #ccot"},{"comment_id":"853456421380774","commenter_b":"She can only be arrested if she goes to Egypt so best she stays away . But good she speaks out","commenter_a":"Good","post_message":"Clooney’s wife threatened with arrest."}]
