[{"comment_id":"602469266610319","commenter_b":"Your 15 mins of fame is running out!","commenter_a":"She needs help, yes.","post_message":"Sarah Palin was just hit with a massive curve ball, she needs your help.  This is horrible, we love her. Let's show her we have her back.  Can we get 10,000 'LIKES' for Sarah Palin?"},{"comment_id":"873720596067983","commenter_b":"Hey the Fuck out ugly bitch","commenter_a":"Good bye","post_message":"Well I guess she's going to say goodbye.  Will you happy to see her go?"},{"comment_id":"1726142824304062","commenter_b":"These are \"outrageous\"? Come on! Blacks, African-American, People of Color, or whatever is the nonoffensive way they are referred to these days, often get a pass for calling each other the \"N-word\". What the hell is going on here! Odd double standard. Remember \"Colored People\", bad!!!, \"People of Color\", GOOD!!! Wow, what crap!!!","commenter_a":"She thought she had a friend","post_message":"Fox News chief allegedly referred to Stacey Dash as ‘the black girl’, called another anchor an \"angry black woman\"  Grio fam, are you surprised by any of this? Check out the other outrageous things coming out in this new lawsuit!"},{"comment_id":"10155302418745579","commenter_b":"lady, you need medication.","commenter_a":"My Grade for President Trump A-. Will go up to an A++ when those planted by the last administration to attempt a political coup are removed. My grade for Congress D- will go up when BOTH party's stop trying to slow down the executive branch and start working for the people .","post_message":"GOP Only: Your Grade of Pres. Trump & Congress?"},{"comment_id":"1375338609150152","commenter_b":"It's a bit of a give and take, really. Housing bubbles are good for homeowners and sellers, but when they burst, it's good for the people looking to buy homes. Both scenarios benefit real estate speculators in their own way.","commenter_a":"The housing crisis was NOT good for average Americans. It was a terrific thing for the realty speculators.","post_message":"Trump is literally arguing that America needs a president who will act like a selfish billionaire."},{"comment_id":"10153860038833812","commenter_b":"We can't erase history, if we could, blacks wouldn't be here ! We'd have gotten rid of them and shipped them back to Africa.","commenter_a":"Idiots!","post_message":"University of Mississippi quietly removes the state flag with its Confederate battle emblem from its place of honor on campus after students and faculty called it a divisive symbol that undermines efforts to promote diversity, tolerance and respect."},{"comment_id":"10153415193876833","commenter_b":"I no Right, They Don't Want The Public Safe!!!!!! Then the Rioters and Looters would be Looting and Rioting even More and getting away with it as always!!!!","commenter_a":"Does this mean our murder rate will plummet because the gang members won't have guns?","post_message":"The U.S. Seventh Circuit Court of Appeals issued a decision on Monday allowing a Chicago-area gun and magazine ban to stand. Such bans are justifiable, according to the court, merely on the basis that they \"may increase the public's sense of safety.\""}]
