[{"comment_id":"10153678409374641","commenter_b":"I say make email really sick for weeks with water damage so much so that they want to die lol....but can't get off the looploo","commenter_a":"You have to kill there soldier first then go after the leaders.","post_message":"\"I think it's futile to respond to terrorist violence with more violence in a way that creates more terrorists,\" says Sally Kohn."},{"comment_id":"10154151440809087","commenter_b":"Hillary is for women. I don't blame her one bit, those whores knew Bill was married!","commenter_a":"In 1978, Bill Clinton violently raped Juanita Broaddrick in a Little Rock, Arkansas, hotel room, then, as he was leaving, looked at her bloody lip and said: \"Better put some ice on that. Corroborated by five contemporaneous witnesses Knowing full well about Bill Clinton proclivity to sexually assault women, about three weeks after that rape, Hillary Clinton cornered Broaddrick at a party and said, pointedly, just want you to know how much Bill and I appreciate the things you do for him. Do you understand? Everything you do. In the early 1990s, Bill Clinton invited a young female staffer to his hotel room at the Excelsior Hotel in Little Rock, dropped his pants and said, it. As CEO of an organization, Bill Clinton had a young female intern just months out of her teens, perform oral sex on him while he made business calls. That girl name was Monica Lewinsky. ...","post_message":"#BREAKING: Former Utah governor Jon Huntsman's shocking call for Trump to quit comes one week after saying he planned to vote for him."},{"comment_id":"10153028815641336","commenter_b":"Netanyahu is a coward he's trying he's best coz he's scared of Iran","commenter_a":"I don't know what history books Obama has been reading but it would do him good to listen to this leader of the free world for America as we know it will disappear from us and our future....","post_message":"Today, Israeli Prime Minister Benjamin Netanyahu - בנימין נתניהו will make his case to Congress – and the American people – for why a pending nuclear agreement with Iran would risk his country’s security.  Tune in to Fox News Channel at 11:00a ET for live coverage of Netanyahu’s speech."},{"comment_id":"1126715847370658","commenter_b":"A very excellent metaphor. Kinda bugged that I didn't come up with it myself!","commenter_a":"Ok, lets operate in the realm of hypothetical for a moment. Assume, if you will, the following: 1) There is a civilization capable of inter-solar system travel. 2) They would be bothered enough to interact with a species that cannot manage such travel. 3) We could hope to withstand attack if a species fulfilling [1] and [2] decides that we aren't worth keeping around. It seems to me that such a civilization, if it exists and meets those conditions, would be able to discern the effect of the gravitational field produced by our humble planet. To make it invisible in a visually perceptive sense is naive and utterly useless in the face of such circumstance.","post_message":"Should we be hiding?"},{"comment_id":"784296501703530","commenter_b":"Gross! It smells like Hitler up in this bitch.","commenter_a":"Isn't this another thing he can be impeached for?","post_message":"BREAKING NEWS...."},{"comment_id":"10153728692094117","commenter_b":"Lol pussy","commenter_a":"Reason can go fuck itself. If you are a pro-Trump libertarian, like my page.","post_message":"\"You know−the Constitution−there's nothing like it. But it doesn't necessarily give us the right to commit suicide, as a country, OK?\""},{"comment_id":"1047364981986697","commenter_b":"I'm sure you told her she could take as much time off as she needed. With pay. Heck, you probably promised her time and a half pay while she was on leave. Extra Holiday pay. The Government will start a college fund for the little toddler, paid for by the 1%. Free daycare too while mom runs errands. Don't even bother going back to work until the kid is in college, we'll still pay you. Anything else?","commenter_a":"I agree with Hillary, it IS time for a women President, just NOT her!","post_message":"An expectant mother in Iowa asked: What are your plans for parental and maternity leave?"}]
