[{"comment_id":"10154342648916509","commenter_b":"Shut up","commenter_a":"The decision to continue with fireworks in spite of huge fire at hotel nearby shows the sadist attitude of Arub nation.","post_message":"#NewYearsEve fireworks display continues in #Dubai as nearby hotel is engulfed in flames @webpagelink"},{"comment_id":"10153182951850950","commenter_b":"Oh, just stop with the outrage already. African countries sell these permits for more than the price of the average house in the USA, and only allow hunters to take the old males that have already reproduced. The people in the communities get the meat, sometimes by the ton.","commenter_a":"Sad. Money wins","post_message":"Though Zimbabwe's national parks authority said the shooting of a massive African elephant was legal, some conservationists said it's unethical."},{"comment_id":"966234590136262","commenter_b":"Love this, her & Ann Coulter make me sick. Both need to go away","commenter_a":"She is like Ann coulter. Such people must be sentenced for a lifetime. Her intolerance is making me angry.She must be imprisoned.","post_message":"Pope Francis is furious."},{"comment_id":"1074511882569822","commenter_b":"You cared enough to comment","commenter_a":"Needlessly inflammatory and untrue. Time to unlike.","post_message":"Nearly a century later, Einstein has been proved wrong."},{"comment_id":"10153716806409749","commenter_b":"What's wrong with a black lady ?","commenter_a":"Wasn't the judge a black lady???!!!","post_message":"\"There will probably be a book. It will talk of his love for Reeva. And the awful feelings of loss and guilt, that will stay with him forever.\""},{"comment_id":"10153777739548690","commenter_b":"But the don't need people like you black monkey","commenter_a":"Long live Israel long live the Jews... I just wish i was an Israelite so i can walk into the occupied west bank and tell those occupying Muslim extremist that God gave that land to the Jews... Jews fight for their right...i love the Jews with my life. God bless Isreal.","post_message":"Inside Story: Israeli government leaders have repeatedly said they don't want changes at the Al-Aqsa Mosque in Jerusalem.  Israel is also accused of funding groups advocating major changes to who can pray at the sacred and sensitive site in Jerusalem.  What are the implications of Israel action? And with growing discontent in the occupied Palestinian territories, is it a recipe for more unrest? @webpagelink"},{"comment_id":"10154058218236770","commenter_b":"Procecute this women she just as dishonest as Hillary","commenter_a":"Obama tossed her under the bus. So much for loyalty.","post_message":"Attorney General Loretta Lynch is defending the FBI against allegations that the bureau mishandled investigations of email hacks of Democrats and focused too much attention on Hillary Clinton’s private email server."}]
