[{"comment_id":"1803726116573607","commenter_b":"Graham disbrow are you on a loop?","commenter_a":"looks like more reporters the protestors.....","post_message":"HAPPENING NOW: Protesters plan to block the Mill Avenue bridge in #Tempe as part of a police brutality demonstration.  WARNING: This is a live feed. Viewer discretion is advised."},{"comment_id":"702518316605413","commenter_b":"What is wrong with these kids???!!! They're turning into barbarians! Totally unacceptable!!!!","commenter_a":"Now the parents most likely were at the welfare office getting stamps like all the other unemployed shit they can't flip a burger over that's too hard","post_message":"Three students were arrested yesterday at William Allen High School In Pennsylvania.  Other students stood by and watched as they did this to her. Will you pray that this officer will be ok?"},{"comment_id":"1263042020429217","commenter_b":"She started the whole thing ...she spit on him and was calling him a n***** ...she even lied and said she didn't even hit him or anything and begged for the video to not be shown.she is also suing the restaurant and this is not the first time she assaulted someone and lied about it .she is scum and a money hungry bitch","commenter_a":"Everybody saying she deserved it, just hope your daughters don't instigate something and get her ass beat.","post_message":"Totally uncalled for!  #WSHH #Oklahoma #JoeMixon"},{"comment_id":"10152593835691135","commenter_b":"Something my psycho ex would do","commenter_a":"YUCK","post_message":"Some men will try almost anything when it comes to building their body...  The latest craze: drinking breast milk.  STORY: @webpagelink"},{"comment_id":"775477502501275","commenter_b":"I agree with Mark Colwell.one muslim won't go against the other.they are all for crap..","commenter_a":"Gee, really, and what would they do if he made them angry? Another Dem moron speaks in defense of her Beloved Leader and what she says is as stupid as they both are. How do these people get through even elementary school being this dumb?","post_message":"And this is what Democrats think about terrorists... #facepalm"},{"comment_id":"10153436699476337","commenter_b":"Yea and he's got a fake pussy.","commenter_a":"No one here read the article did they? She's not being called out for being a white NAACP supporter or for \"not being black enough\", she's being called out for lying about being black. She's totally not black at all. She's a white woman pretending to be black saying that she grew up poor, black, and racially profiled. When she wasn't. At all. -_-,","post_message":"HOW DOES THIS HAPPEN? Is this NAACP leader pretending to be black? Many on the Internet certainly think so..."},{"comment_id":"10156216618090389","commenter_b":"She'll get away with everything , just wait and see.","commenter_a":"I bet she gets away with it that's the way the Clinton's roll","post_message":"Those emails might not be about yoga or Chelsea's wedding. Do you think Hillary is finally feeling the heat?"}]
