[{"comment_id":"10154793818836337","commenter_b":"Holy shit you're dumb","commenter_a":"Fake deal. She has run her course and they don't want her anymore. She has been all downhill since she cut her hair. She belongs back playing support for O'Reilly on his show. Demanding a raise? No. On the verge of being fired, but trying to save face.","post_message":"Should she stay or should she go??"},{"comment_id":"10153374746118812","commenter_b":"Reality check she removed all courage and self respect leadership. What is he but a man in training....... Whites love when we humiliate each other to protect the massa. She need to know she planted a seed that will resp bitter fruit","commenter_a":"Asllan Kacanolli Flamur Kacanolli","post_message":"He's the boy seen around the world being forcefully pushed from the Baltimore riots by his mother. And this is what he has to say about it..."},{"comment_id":"1027451010661056","commenter_b":"You old bitch","commenter_a":"Free stuff...what they don't understand is they will be paying for it out of their taxes for the rest of their lives....","post_message":"This would be comical if it weren't so dang scary."},{"comment_id":"10153804494893132","commenter_b":"Stfu!","commenter_a":"Michael Jackson: Year one clean of touching little boys.","post_message":"Eat like a King (of Pop) on Michael Jackson's birthday."},{"comment_id":"597841083739804","commenter_b":"OBAMA IS THE SAME ALL ARE THE SAME CORRUPTS AND CRIMINALS WHAT HAPPEN IS PEOPLE WANT'S TO BE CORRUPTS AND HAVE POWER AND ABUSE OF POWER THAT IS WHY THEY LIKE THEM CONGRATULATION LOOK AT THE WORLD HOW IT LOOKS AND THINK A LITLE NOT TO MUCH AND SEE WHAT IS GOING ON","commenter_a":"Damn right!","post_message":"George W. Bush was right, there were weapons of mass destruction.  We always had his back. He is a great man, and a true patriot.  Do you support George W. Bush?"},{"comment_id":"10153634923619885","commenter_b":"Nah she's a girl, but keep on denying. Y'all have a lovely day.","commenter_a":"That brat holding up that sign probably wouldn't want this person using their locker room either. So it's go with the ladies where you are not welcome, or go with the boys who will treat you like garbage. This is stupid. Leave this young person alone and let her get an education.","post_message":"Students at Hillsboro High School briefly walked out in protest Monday morning as part of a dispute over whether a transgender student should be able to use gender-specific locker rooms."},{"comment_id":"1236561799702931","commenter_b":"No Samantha J Clifford The WAR has already been won. Satan and his followers those that follow unknowingly and those that follow blatantly have lost and satan God and us Christians KNOW this. There is NO HOPE without Christ.","commenter_a":"GOD is making gay marriage licenses invalid.","post_message":""}]
