[{"comment_id":"10153755960426101","commenter_b":"Your mother gives rimjobs","commenter_a":"9/11 was an inside job","post_message":"EXCLUSIVE VIDEO: A massive residential Dubai skyscraper was engulfed in flames as authorities rushed to evacuate hundreds during New Year's Eve celebrations. At least a dozen people are injured, primarily due to a stampede rushing to escape the growing fire. Updates from Newsweek Middle East: @webpagelink"},{"comment_id":"10153644347998188","commenter_b":"Your opinion from your dreams Beck! It is a year before the election it is speculation at this point!","commenter_a":"I have been impressed with Carly for a few months and thought she did really well getting her points across, only wish she would be a little more warm and natural. She needs to be more likable. Rubio was outstanding with his knowledge of world affairs and ability to connect. Very presidential. Dump the Trump!","post_message":"Biggest winner: Carly Fiorina biggest Loser: Trump.  She looked presidential, serious, sharp, well informed, non establishment and tough.  Second place:  tie Rubio and Cruz  Close third: Carson (although because he is so different in volume, pace and style he may surprise me and others)  Biggest loser was so clearly Trump.  He is just not likable.  I just don't believe he is liked by tea party members.   I stood with them and looked into their eyes, is poke with them, marched with them and there is just nothing they have in common except being fed up.   If that is all he has, it is going to crater quickly.   He looked like a bully, sleazy and I just can't imagine good hearted, humble, faithful Americans falling for this arrogant anger much longer.   What average non political woman will connect with them?  Runner up for loser:  Bush.  He was rattled.  It is clear, he hates Donald trump.  While there were a couple of times I felt sorry for Bush. It didn't make me think he would be great if he were rattled by Putin or the mullahs.  This was a mortal wound for bush I think.  Also the big loser:  America.  It was so childish much of it.     #gopdebate #cnndebate"},{"comment_id":"651668038332170","commenter_b":"And the idiots will vote her in.","commenter_a":"Thats true Mr President! A lot of unfair things are happening. Please take control of this country.","post_message":"The system is rigged. General Petraeus got in trouble for far less. Very very unfair! As usual, bad judgment."},{"comment_id":"1088078934585187","commenter_b":"She is a pest!","commenter_a":"Does she not realise that her actions will encourage pest infestation of insects & rodents, germs will have a field day, right next to where she's raising her child?","post_message":"Some people are just scum"},{"comment_id":"238735813255041","commenter_b":"And to think....they probably had children","commenter_a":"When the defendants were acquitted and they were just sitting back in their chairs with cigars in their mouths and everyone was just congratulating them on beating the case they had no remorse for what they did and it's terrible how could you be ok with kidnapping a 14 year old and just dismantle his face and then dump his body in a swamp that was pure evil and hate they had in their souls to just do that to him it's sad.","post_message":"The story behind the photo that exposed racism in America and helped spark the Civil Rights Movement. @webpagelink"},{"comment_id":"1190463677676992","commenter_b":"Immigration laws are not being in forest because it only applies to legals and not illegals. It's time to make stronger laws and strongly in force them. Also illegals shouldn't be given drivers licenses or any form of ID until they become American citizens.","commenter_a":"The way I see it is this, if people come here and they are illegals SEND THEM BACK TO WHERE EVER IT WAS THAT THEY CAME FROM, the next step is build a wall that's high enough with barbwire around it so they can't try anything","post_message":"Do you agree?"},{"comment_id":"1002700983109302","commenter_b":"Someone should ducktape her mouth","commenter_a":"Somehow, that doesn't look \"allegedly\".","post_message":"Woman facing animal cruelty charges after allegedly duct taping her dog’s mouth shut, then posting photos on Facebook: @webpagelink"}]
