[{"comment_id":"10153778726835575","commenter_b":"These fuckers are welcome in GB but not Trump. Insane.","commenter_a":"LET'S HOPE ALL OF THESE PROPAGANDA CRAP WILL DISAPPEAR WHEN TRUMP IS SITTING IN THE OVAL OFFICE....OUR ONLY CHANCE..","post_message":"London Islamists think ISIS snuff videos are a riot!"},{"comment_id":"642467755916056","commenter_b":"@username # F*ck Hillary","commenter_a":"Clinton the queen of Benghazi and hidden e-mails. Just look at the media. They are piling on Trump while giving Hillary a pass. The debates are still too come. There is a long way to go. Hillary is a sociopathic liar and should never be president. @username and the polls mean nothing right now.","post_message":"Hillary Clinton opened up a 15-point margin over Donald J. Trump in one of the polls."},{"comment_id":"1072715589511885","commenter_b":"I would call him much worse than a monkey.","commenter_a":"That's insulting to monkeys the world over!!! Ann PLEASE think before bad mouthing the monkeys...","post_message":"VIDEO: Ann Coulter Just Created A HUGE Firestorm, Outrage after Calling Obama A  On National TV Ann Coulter is under attack over this.  Can we get 5,000 'LIKES' for Ann Coulter?  @webpagelink"},{"comment_id":"600616960147229","commenter_b":"@username It was $200,000; and I cannot stand that vile woman.","commenter_a":"This man is broke. He is a fraud.he knows if he loses he will go bankrupt. He cant even carry a sentence. His wife is an ex escort, and hes on his third marriage.","post_message":"WATCH #LIVE: Donald Trump speaks at Polish-American Alliance in #Chicago."},{"comment_id":"10154748214069486","commenter_b":"Fools all of them grrrrd","commenter_a":"WRONG!!!!...ARREST THE CLINTONS NOW!!!!...THEY WILL NEVER STOP ALL THEIR CORRUPTION UNTIL THEY ARE ALL BEHINDS BARS!!!!!!!","post_message":"Is this throwing in the towel?"},{"comment_id":"1222948041117063","commenter_b":"Grow some balls bitch!","commenter_a":"You look redickuselse's.........","post_message":""},{"comment_id":"532937326855044","commenter_b":"She takes no responsibility. She whores and takes no responsibility because it is his fault. Logic?","commenter_a":"A Hole..step up to the plate and accept your responsibility!!","post_message":"What a piece of sh*t   | Liz"}]
