[{"comment_id":"684986371683559","commenter_b":"Emotiotionless phony lying bitch","commenter_a":"Rich & stupid","post_message":"The Young Turks LIVE! Hosted by Cenk Uygur and Ana Kasparian"},{"comment_id":"980529482041405","commenter_b":"She crazy bruh","commenter_a":"She is so confused 😂😳","post_message":"Watch: She has to be seen to be believed. Somebody take away her car keys!"},{"comment_id":"847297252033195","commenter_b":"Girls run the world!","commenter_a":"No on F'in cares except the racist thugs like OFAILURE & OSHARPTON & BSNBC !","post_message":"Who run the world?"},{"comment_id":"10153952670046509","commenter_b":"Seriously.. Why are people mentioning Asians at all?! Great for them, and when they are highlighted, I praise them too.... However, The point of the article was to bring light to a young man doing exceptionally well. He has a great start to life and a great career. All praises due and deserved. Anything else doesn't even matter.","commenter_a":"Because his SAT scores are off the charts!","post_message":"He was accepted by all 8 Ivy League schools. How’d he do it? @webpagelink"},{"comment_id":"10153679733478967","commenter_b":"People really do get butt hurt in SF","commenter_a":"Carlos Salazar","post_message":"Well this didn't go very well."},{"comment_id":"10153874531382464","commenter_b":"IF YOU ARE REALLY WORRIED ABOUT AMERICA CHRISSY ....... DUMP THE TRUMP!!","commenter_a":"Cruz lied about what he did with Carson! CNN fact checked and it was just like everyon knew it was. Cruz is a Liar and a terrible man! He threw Carson under the bus! Rubio puts out the same speech he and his family migrated here and had no money and how he supposedly walked dogs for spare change whileforgetting to mention that the dogs he walked were gaurd dogs for his mother and fathers drug dealings. Both which spent time in prison and were with a Cartel. I am not saying that as a child Rubio was guilty of the drug dealings.What I am saying is that he is giving peoplea false storyof some made up life. Anyone can fact check eitherof these two lying cheating thieves. I wouldn't let either of them wpe my dogs paws! Both are liars and career politicians. As for Bush, His familyuses eminant ...","post_message":"A super sale for #SB50. Get your #TeamCruz jersey for just $50: @webpagelink"},{"comment_id":"556755621195285","commenter_b":"@username y'all race invented HIV and experimented on other races but that heroin epedimic spreading HIV all thru the white folks Hood. Keep sharing needles junky..","commenter_a":"Same white dudes screaming how they would beat her ass are the same ones who scream don't hit a woman when it's a white woman !!! Good news is that it is fact that by 2030 the white race will be a minority ! 😉. So that always makes me smile when I see the racist still holding on to a failed system ! But that's ok the rest of the world has moved on! Just look at the population ... your country is now little Mexico right under you nose while you tried so hard to oppress the blacks you let in millions of mexicans , Muslims , Somalis! Now you mad !","post_message":"She took his crowbar away and went crazy! "}]
