[{"comment_id":"936584933056721","commenter_b":"Well bye bye you illegal immigrant because your ancestors aren't from here .","commenter_a":"Black life's matter movement is a threat to law enforcement! The Obama administration is a threat to law enforcement! Islam is a threat to law enforcement! Illegal immigration is a threat to law enforcement!...... This man is not!","post_message":"In a video he apparently posted last week on Facebook, Jon Ritzheimer calls out New York-based The Islamic Post for calling him the \"American Taliban.\" Now the FBI has issued an alert, citing he is a  threat to law enforcement."},{"comment_id":"10153662758062894","commenter_b":"Naw mama had let that warning out that she addresses her child my bad young lady again she gon catch that fade","commenter_a":"But skai read her so no need for mama to even say anything","post_message":"Not My Child! Skai Jackson’s Mother Has Words for Azealia Banks: ‘I Don’t Play Those Games’ [Photo]"},{"comment_id":"10152949520761519","commenter_b":"FWIW: Jesse, I love your points of view. Over the years your passion and knowledge have helped me evolve my own perspectives on politics and the news. However, I respectfully disagree with your use of pejorative terms to describe women in this fashion. I think it is as much demeaning to you, and women at large, as it is to the targets of your invective. I respect your assertion of your right to use these terms, and you have articulated to me in the past why you choose to use them. I respectfully disagree with it.","commenter_a":"Those Fox News bitches really whore it up with the make up, don't they?","post_message":"\"You can’t separate fiscal issues from social issues...\""},{"comment_id":"1937711623123134","commenter_b":"If Clinton is chosen over Trump, there will be a howl in the land like never heard before.....the fix would be in for the political elite and the upper 1%","commenter_a":"OMG. It's over. Get on with life.","post_message":"In Opinion, Harvard professor Lawrence Lessig says there is precedent for such a move."},{"comment_id":"10154002938919749","commenter_b":"Cindy Rhodes go do one stupid cow feminists are scum","commenter_a":"If your still hung up on feminism within the uk and the us then you need to develop your personality. Not your discrimination skills.","post_message":""},{"comment_id":"10157410522280294","commenter_b":"Love these type of storms..","commenter_a":"Thanks for the pictures. Please stay safe. If you have reports of any damage please let us know","post_message":"Dark storm clouds roll into the Cleveland area"},{"comment_id":"10153376436094087","commenter_b":"Ok some of you all don't get it. I like Trumps idea on closing our borders for a time being and this is why and a simple example. Please come to my house I have a bowl of 10,000 M&M's and in that bowl I may have 100 but at least 2 M&M's that are poisoned and will kill you the moment you put them in your mouth and slowly corrupting the bowl. So I want you to stick your hand in the bowl and eat a handful! Oh you won't? Why not oh cause the odds are your gonna die? Oh I see but it's ok to let 10,000 immigrants in knowing some are most likely deadly. But won't eat 20 M&M's because at least 2 out the 10 grand will kill you what's the difference??","commenter_a":"The immigration and Nationality Act passed June 27, 1952, revised the laws relating to immigration, naturalization, and nationality for the United States. That act, which became Public Law 414, established both the law and the intent of Congress regarding the immigration of Aliens to the US and remains in effect today. Among the many issues it covers, one in particular, found in chapter 2 Section 212, is the prohibition of entry to the US if the Alien belongs to an organization seeking to overthrow the government of the United States by , violence or other unconstitutional means. This, by its very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House. Islamic immigration to the US would be prohibited under this law because the Koran, Sharia Law and the Hadith all require complete submission to Islam, which is antithetical to the ...","post_message":"“Anytime somebody is making inflammatory statements about Muslims or whatever, they can take that and use it to their advantage for recruiting purposes,” House Homeland Security Committee chairman Rep. Michael McCaul. “They take things like this and they spin it, to inflame the Muslim world, to get more recruits to join the cause to fight in Syria.”"}]
