[{"comment_id":"1762322484002162","commenter_b":"Criminal CUNT","commenter_a":"Absolutely NOT !!","post_message":"Is Hillary Clinton America's best choice for president?"},{"comment_id":"10153035820806770","commenter_b":"she can't even lead her servants...","commenter_a":"now she wants to bring in people to vote for her......","post_message":"Democratic presidential candidate Hillary Clinton told “Face the Nation” host John Dickerson Sunday that she hopes the United States will “lead the world” and take in 65,000 Syrian refugees over the next year."},{"comment_id":"666476586876253","commenter_b":"She needs to worry about herself ugly!!!!","commenter_a":"No me jodas... ...","post_message":"Controversial video just leaked that shows what Michelle thinks about white people.  This is extremely offensive. We need to spread this, and show the country she's a racist.  Do you agree Michelle Obama is the worst first lady ever?"},{"comment_id":"10154292908136545","commenter_b":"That claim was bogus. She was an angry girl out to get him. There was supposedly proof of that.","commenter_a":"Seriously??!!! Pray he's ok. He needs to be in protective custody until game time","post_message":"JUST IN: Frisco police confirm Ezekiel Elliott was involved in a minor car crash near #Cowboys practice facility. No injuries were reported.   MORE: @webpagelink"},{"comment_id":"901951363197946","commenter_b":"Does this Kate Hopkins woman realize how ugly she is?","commenter_a":"i think thie so called woman shoudl keep her many nasty comments too her self ,she must have a very unfilled life ,becuase she comments and has ago at everybody ,stut up Katy Hopkins .","post_message":"Kelly Clarkson admits she didn't even know who Katie Hopkins was  (Daily Mail Celebrity)"},{"comment_id":"10157286687695093","commenter_b":"The same FBI that said Hillary Clinton was to dumb to be prosecuted? Gmafb dude. I tell you what why don't all of the uneducated whites thank think their better than blacks go, than not only will the crime rate be lower but the racial tension will be too.","commenter_a":"I guess they're gonna condemn violence against police when white folks stand and condemn police violence against blacks. Until then we'll continue to lie to one another.","post_message":"Must-see!"},{"comment_id":"863959926995293","commenter_b":"Denise Lange-Baker ugly ugly ugly. @username stupid stupid stupid. Denise & Tim inbreeding at it's best","commenter_a":"Sen Blunt does it hurt to be so stupid. I imagine it must hurt","post_message":"I’m proud to co-sponsor Senator Johnson’s bill to stop President Obama’s lawless #immigration power grab. I’ll continue to working with my colleagues in the House and Senate to fight against the president’s executive amnesty and his blatant disregard for the law and the Constitution. #StopObamasAmnesty"}]
