[{"comment_id":"10153231600851491","commenter_b":"Well the last 3 harry Potter movies should had been directed by a woman then","commenter_a":"thats not how sexism works. Sexism is if there are qualified female directors available to direct, and they choose to hire a less qualified male director. If there are no qualified female directors available thats not sexism","post_message":"Emma Watson: \"I have been directed by male directors 17 times and only twice by women.”"},{"comment_id":"10153635543308132","commenter_b":"Yes...I'd bury my chin in her and set up camp!!!","commenter_a":"I love skinny (healthy) women. It's kind of silly to be that jealous of them. @username have all of their 40's n 50's to get 'thicker'.","post_message":"The endlessly quotable Amy Schumer!"},{"comment_id":"10153335950782293","commenter_b":"When you have a citizenry that has NO respect for authority, this is what you get. Should the police just let them run wild? Why not create some \"no go zones\" and let the animals have at it.","commenter_a":"If the only way police can \"control\" crime is through the kind of brutality we see in videos, they better relearn their policing skills.","post_message":"He suggested violent crime is surging in the U.S. because police officers fear getting caught on the next video of alleged police brutality."},{"comment_id":"10154274349426051","commenter_b":"CAN I HELP AL , GET THE HELL OUT OF THE U, S, A, DUMB ASS","commenter_a":"He is ALL mouth--did anyone really think any of these ppl. were going to leave? WHO would want them?","post_message":"The Rev. Al Sharpton has finally decided if he'll leave the country now that Donald Trump is President."},{"comment_id":"1013476458674427","commenter_b":"It was a lady Marine, she could have kicked his tear","commenter_a":"There are not enough words to describe what a worthless piece of crap this man is & idiots voted for him twice.","post_message":"I'm sure he's really proud of himself."},{"comment_id":"439739816151059","commenter_b":"Last election, I voted democrat, for the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the ...","commenter_a":"Why the fuck is UW Cali giving her money? Naughty naughty.","post_message":"Three of her top political donors are Goldman Sachs, Citigroup and JP Morgan. Is there anyone left that still believes the shit politicians say?"},{"comment_id":"1655285394531583","commenter_b":"Salty tears are most delicious. Is it January yet??","commenter_a":"A BIG thank you to the 53% of American registered voters who chose NOT to vote; because of YOU and only YOU, Donald J. Trump will be our next POTUS.","post_message":"This is the real reason Barack Obama is going against Vladimir Putin, two weeks before he leaves. This is what the mainstream media won't tell you. Make sure every American knows the truth."}]
