[{"comment_id":"10153331851941509","commenter_b":"There's a law in Alabama that says a man has to walk fifty feet in front of an automobile waving a red flag, if a woman is driving. In Ca. You can't shoot jackrabbits from a moving streetcar.","commenter_a":"Honorable lawmakers. Do not longer exist. This is just a small example of how good taste, decency, decorum and such, form no longer part of our society.","post_message":"Congressman Alcee L. Hastings, citing a dildo law, among other things, has some harsh words for Texas lawmakers. Now Texas lawmakers are demanding an apology. @webpagelink"},{"comment_id":"993534210682000","commenter_b":"These illiterate students should be in class learning something !!!","commenter_a":"I agree with every post here! They should have forfeited the game and then raised the tuition to cover what loss incurred that reduces tuition. End of story. But know we have encouraged the sports programs to make policy and remove employees at their will. Just crazy.","post_message":"Literally no understanding of 1st amendment rights whatsoever!  Behold your \"tolerant\", liberal colleges..."},{"comment_id":"10153865845208984","commenter_b":"TRUMP IS A LIAR! TRUMP IS A RACIST! TRUMP IS A BULLY!","commenter_a":"If you watched the last debate Carson was nervous stuttered his responses I just don't think he's hard enough","post_message":"'The Donald' just ripped into his Republican rivals today and revealed the one big reason why he doesn't think Dr. Ben Carson could do the job. Some might agree that he makes a valid point...  Do you think Trump could be right about Carson?"},{"comment_id":"10152820559047144","commenter_b":"To hell in a hand basket. The women will have to bale them out.","commenter_a":"Most of those pharma pain killers are just synthetic heroin.","post_message":"A recent study found heroin abuse was 19 times higher among people who had previously abused pain relievers."},{"comment_id":"10153132008994497","commenter_b":"Conceded bitch... this shit practically writes itself. Lol","commenter_a":"This sick beat. Oh no!! Now what? Gimme a break. Never heard something so idiotic. A phrase? Boooooo!! :)","post_message":"From our sister publication:  The A.V. Club: \"From this day forward, any and all sick beats belong to Taylor Swift, under penalty of law.\""},{"comment_id":"10154284439844749","commenter_b":"Women should lift each other up? Good luck lifting her up!","commenter_a":"Beauty comes in all shapes and sizes. Women should lift each other up, not let little girls tear each other down.","post_message":"\"When I tell people I'm a model, they look at me like I've said I've murdered someone.\""},{"comment_id":"1090200961078541","commenter_b":"No sympathy.. The German people should have turned on their Government years ago for not putting the German people first.. The German people have sat back and just watched as their Government have let these migrant, immigrant and refugee vermin infect their country like a cancer.. And now innocent people have died.. How many more are going to die before someone does something and boots these parasites not just out of Germany, but out of Europe.. Can you imagine it.. a Muslim free Europe..","commenter_a":"Islam to be wiped off planet all together","post_message":"LIVE: 9 dead, multiple injured as truck plows into Christmas market in Berlin in likely terrorist attack Watch Ruptly LIVE here @webpagelink"}]
