[{"comment_id":"1245414865499369","commenter_b":"Bad argument ladies...gentleman... Whatever you started out as","commenter_a":"If it's not a mental illness then they don't need therapy, you can't have it both ways... But oh wait, that's what you people do anyway lmmfao","post_message":"The bill goes directly against most counseling associations' codes of ethics. (via The Huffington Post)"},{"comment_id":"10154074344751336","commenter_b":"You're an idiot.","commenter_a":"It looks like the liberal PC police culture have hit the Miami police department. Their feelings are hurt so they will be boycotting Beyonce by not doing their job. We need to make sure to send enough panties for them to wear so they can cry comfortably at the boycott. Our officers used to have thicker skin than this. This is a sad day in America when our police officers are crying and boycotting for hurt feelings.","post_message":"Usher, Demi Lovato, Yolanda Adams and The Band Perry are among the contemporary artists heading to The White House to celebrate the late Ray Charles."},{"comment_id":"10152991778321336","commenter_b":"Illegal aliens beau","commenter_a":"scary stuff","post_message":"More than 100 patients may have been exposed to a potentially deadly \"superbug\" at the Ronald Reagan UCLA Medical Center."},{"comment_id":"1422508754431832","commenter_b":"Yes","commenter_a":"Yes, totally!!","post_message":"Should Washington require drug testing for unemployment benefits?   A. Yes.  B. No, it's spending a lot of money on little gain  C. This is a bit unfair for states that legalized pot  D. Only for those who lost jobs to drug use E. Enter your own anwser"},{"comment_id":"869042603191993","commenter_b":"Good! Then STFU you two!","commenter_a":"So they jab him when they invite what's his face to address the congress, now they jab him with this letter to Iran. I mean are you kidding me?","post_message":"\"The letter sent on March 9th by forty-seven Republican Senators to the Islamic Republic of Iran ... is beneath the dignity of an institution I revere.\"  - Vice President Joe Biden"},{"comment_id":"10155889196645354","commenter_b":"Trump that bitch!","commenter_a":"She has more wrinkles than my nuts. Americans are dumb enough to vote this tramp in.","post_message":"Short memory!"},{"comment_id":"1240366709375196","commenter_b":"Oh how I pray that would happen because that is where she belongs. Get out and vote TRUMP!","commenter_a":"She must NOT be elected, then impeached or her VP would take office. Then she would just be the puppet master. Telling him what to do. Come on America, do what is right!!","post_message":"We all hope that Donald J. Trump takes down Hillary, but a backup plan has just been launched in case he doesn't.  This is a massive development in the campaign, and you know it's got Hillary's people worried."}]
