[{"comment_id":"10158146961425354","commenter_b":"Patton Oswald? Never heard of her. When will the Secret Service pay a visit to this loon?","commenter_a":"King of Queens actor. Weirdo.","post_message":"PROGRESSIVES' HATE TURNS EVEN DARKER   “Holy F*ck. Come ‘n’ get it, terrorists.\""},{"comment_id":"968324823259627","commenter_b":"Bitch please","commenter_a":"This is ridiculous! Trump can beat Hillary or Bernie with one arm tied behind his back. America has made their choice. No more corrupt, lying, manipulative, smooth talking politicians. We want our country back! We have a real shot with Trump, and we're not going to be tricked any more.","post_message":"“Let me be clear on one thing tonight. This campaign is just beginning,” Bernie Sanders said. “When we come together, and don't let people like Donald Trump try to divide us, we can create an economy that works for all of us and not just the top 1 percent.\""},{"comment_id":"868659363156855","commenter_b":"You have never been raped!","commenter_a":"The allegations are a joke.","post_message":"Too much?  #GoldenGlobes"},{"comment_id":"706978382784196","commenter_b":"MAKE AMERICA AMERICA AGAIN!!!!!!","commenter_a":"Come on Bill, let us hear the speakers, please.....","post_message":"Duck Dynasty on A&E's Willie Robertson, former Texas Governor Rick Perry, retired U.S. Navy SEAL Marcus Luttrell, actor Scott Baio and Patricia Smith, mother of Benghazi victim Sean Smith, speak at the Republican National Convention."},{"comment_id":"10153439688411130","commenter_b":"You just got owned by said library bitch lol","commenter_a":"It's going to be called little Debbie","post_message":"YAY!"},{"comment_id":"1683425098577634","commenter_b":"It will never happen to that cockroach!","commenter_a":"Yes, it should have happened a long time ago.","post_message":"BREAKING: GOP Threatens Obama With Active Impeachment.  Stop threatening, and just do it already.  Would you be happy if they actually followed through with this?"},{"comment_id":"884398511671457","commenter_b":"This woman is an absolute idiot","commenter_a":"Love to see you going to jail have a nice day by by.","post_message":"The message of Hillary Clinton's victory speech last night could not have been more different than Donald Trump's. Whose message is better for the country?"}]
