[{"comment_id":"1181219778640173","commenter_b":"She's crazy!","commenter_a":"she needs to fall on the other side of her face","post_message":"Typical Hollywood liberal elite, who compares everything she doesn't like with the Nazi regime."},{"comment_id":"920923791276376","commenter_b":"She is a scandal ridden low life scum.","commenter_a":"What does this say about Hillary Clinton?","post_message":"BREAKING - Hillary Clinton's Sex Scandal"},{"comment_id":"10155570976260603","commenter_b":"A woman of her word. Bet that room is clean.","commenter_a":"Crazy old bat.","post_message":"She told her grandchildren that if they didn't clean their rooms, they would lose their pets. The family cat was later found in the freezer.   Robin Smith KMOV is in Madison County finding out more on this animal cruelty case and the possible punishment she could be facing on News 4 at 5:00."},{"comment_id":"10154316871838203","commenter_b":"@username Jesus only chose men to be Apostles - but He had many female followers. The reason that women cannot be priests is that the priest acts in the person of Christ in the Mass. If it's a woman offering the Mass the sacrifice becomes one of bride to bride - and the significance is lost. Humans are sensual creatures. God knew that; that's why He created sensual experiments (the Sacraments) as visible signs of His grace. You cannot baptize someone with motor oil because it's not a sign of cleansing. Similarly, you cannot ordain a woman. It is not possible.","commenter_a":"st paul says there is no difference between men and women now that we are in Christ Jesus. there is nothing to suggest that women cannot be ordained priests or deacons from the mouth of Jesus himself. the fact that only men were chosen by him could be due to the fact that the social fabric of his day could not tolerate or make it possible otherwise. the holy spirit will continue to guide the church according to christ's own promise. let's not bar the way forward when we see he is driving along that path. we need to go to the spirit of our faith and not be kept back by men made rules and practices. WE HAVE TO LET THE LORD SPEAK.....AND LET US BE SILENT.","post_message":"The Catholic Church can never ordain women priests, so why all the confusing signals?"},{"comment_id":"10153518586283812","commenter_b":"I say if men can do it, so can women. Get over it. If she doesn't want to shave then she doesn't have to. But if you want to then do it.","commenter_a":"No thanks. I think I'll skip this fad too","post_message":"On social media and red carpets, from New York to China, women's hairy underarms are having a mainstream moment: @webpagelink"},{"comment_id":"1202081159878082","commenter_b":"Good one! Except I hope SHE would HAVE BEEN ABORTED LONG BEFORE NOW!","commenter_a":"So, I am reading that Hillary is really upset that the FBI is \"dumping\" on her right before the election.... I want to say to Mrs. Clinton, \"So Hillary, how does it feel to be aborted 8 days before delivery?\" Stole that comment, but it is awesome!","post_message":"The website announces it has moved to \"Phase 3\" of its \"election coverage.\" Here are the latest headlines. #WikiLeaks #Clinton"},{"comment_id":"10152546378774071","commenter_b":"Same thing as Pie-o-logy?","commenter_a":"This has been around for years...finally blowing up I guess. Thank you Cosmo Kramer lol","post_message":"Pizza Studio hopes to expand to 100 locations by the end of 2015."}]
