[{"comment_id":"10156283880180354","commenter_b":"You illegals violated are rights to deport you if you are here illegally","commenter_a":"Good for Texas.","post_message":"“Today’s ruling is an important first step in insuring the integrity of birth certificates and personal identity information.\""},{"comment_id":"1192273137481692","commenter_b":"Isn't this a dam foolish question to be asking of the citizens of US...why would we want Shariah law to begin with...they are taking over and our govt is allowing it...they have to conform to our CONSTITUTION here in America...can't do it, go back to your hole that practices Shariah wicked law..","commenter_a":"Yes! there is NO place in our country for Sharia law so take your laws home, Obay the constitution your in America.","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"10154363998161756","commenter_b":"You're right @username, it's easier to lie to the people and then change nothing. #sheisworthless","commenter_a":"The mainstream media - and @username is that - has done the work of the status quo establishment and convinced the American people that nothing can be done anymore because it's too hard and too complicated. Anything is possible, but it will take the will of the people to continue the political revolution. Change is coming, but it will be a long struggle. A hard fight against the establishment. Bernie or bust. Don't ever give up.","post_message":"The effort ultimately would rely on Sanders getting stalwart backers of his plan into key positions, followed by a difficult, drawn-out fight with the powerful industry."},{"comment_id":"10153127913913812","commenter_b":"Shut up Canadian","commenter_a":"Classless","post_message":"Leaving her head uncovered in Saudi Arabia, a country where women have few rights, the First Lady leads by example: @webpagelink"},{"comment_id":"10154241809909411","commenter_b":"@username yes they can. They feel more comfortable in turkey then Europe. Lots of racist people giving them dirty looks in Europe.","commenter_a":"Europe should consider making a deal with Greece rather then Turkey who is playing its proxy war over Refugee crisis.. European Parliament Greece is honesty and has no evil or greed sort of motive behind this cause. They can handle refugees better then turkey. Who by the way is taking advantage of the European Parliament by making a deal and asking a free hand to strike and bomb Kurds who are basically fighting ISIS which turkey is making it hard for kurds by attacking them and making it easy for ISIS to freely invade other save areas of Iraq and Syria..","post_message":"'People detained on Lesbos and Chios have virtually no access to legal aid, limited access to services and support, and hardly any information about their current status or possible fate'"},{"comment_id":"1371941172817349","commenter_b":"TRUMP AMERICAS WELFARE QUEEN!","commenter_a":"Bahaha, looks like your corrupt Hildabeast hasn't paid em either. Oh and why don't you ask the Haitians how much of that Clinton Foundation windfall made it to the Haitians. You liberals are absolute blind sheep. Don't you think if Trump broke any tax laws that Obozo's IRS henchman Koskinen would have taken him down already? Can't you leftist idiots run a campaign on pressing issues of the day rather than ad hominem attack and character assassination? Oh, I forgot you can't cause you fools have nothing other than soap opera drama. Hey, did ya hear Kardashian got jacked in France today? Bwahaha, such useless idiots, the lot of you!","post_message":"Contrary to Trump's claims, undocumented immigrants contribute roughly $11.64 billion in taxes every year."},{"comment_id":"10155091022728734","commenter_b":"Look at these white American men!! Hahahah! Look at these savages","commenter_a":"Disgusting","post_message":"A 37-year-old man has been arrested after allegedly trying to pay a mother to have sex with her seven-year-old daughter."}]
