[{"comment_id":"10154100013603598","commenter_b":"I have no more words to write about this witch","commenter_a":"Add murdering human life to the list of HER immorality!","post_message":"Hillary Clinton: An Unborn Child Just Hours Before Delivery Has No Constitutional Rights"},{"comment_id":"10154121579688132","commenter_b":"Kendra Hill Graham..she was crazy like a fox and a filthy pig to boot!","commenter_a":"Wow! Mental illness is real. She is disgusting! May God bless the children involved.","post_message":"Police officials are calling it \"one of the worst neglect cases\" they seen in Concord, California."},{"comment_id":"466533816861832","commenter_b":"I don't know why this is article has been shared today, because it will just upset people on a Holiday and just continues to widen the divide between the people. Because we are celebrating our country, our history, and the couragous people who protect our freedom, it seems a little rude and inconsiderate to share this message. And furthermore, I do not believe the data report anymore than I can throw a cow. I believe most of us are equal in how patriotic we are or not.","commenter_a":"Conservatives only THINK they are more patriotic. Why? God, guns and gays......","post_message":"Is this poll right?"},{"comment_id":"10153436372151337","commenter_b":"But Mariah has the booty","commenter_a":"The only reason this game sells is because of kate upton's nice tits. Big mistake","post_message":"A NEW \"FACE\": Those Game of War - Fire Age commercials will no longer feature Kate Upton..."},{"comment_id":"10152691528182293","commenter_b":"Shocking","commenter_a":"The poor isn't merely poor in finance & chance; more problematically, they are poor in thinking & vision making them poor all in their life.","post_message":"There is little empathy at the top."},{"comment_id":"1016384461715898","commenter_b":"So stop your judgemental whining bitch","commenter_a":"Sorry mice, but as someone with crohns I fully support this research.","post_message":"Researchers have engineered small intestinal tissue from human cells, and when placed in mice, the transplants were able to digest and absorb like the real thing."},{"comment_id":"1859284991009604","commenter_b":"Niggaz and whites","commenter_a":"I tell you man niggas now a days are dumb ass fuck they don't think","post_message":"Mannequin Challenge got them busted! #WSHH #Alabama #MannequinChallenge"}]
