[{"comment_id":"10153244569769087","commenter_b":"Youare a fucking ignorant whore.","commenter_a":"Benjamin Netanyahu - is protecting the Free World while Hussein Obama wants the Deadly Suicide Pact with Iran. Wait until Iran hits America with their ICBM's, Iran can already Hit Israel.","post_message":"Israeli Prime Minister Benjamin Netanyahu - בנימין נתניהו delivered an intense silent protest of the Iran nuclear deal by staring down members of the United Nations General Assembly for nearly a minute without saying a word. WATCH:"},{"comment_id":"10156889052280206","commenter_b":"if we really want to protect our country all we have to do is put up pictures of carly at the borders. that would scare anything.","commenter_a":"First is to end all illegal wars in the Middle East and stop supporting rebel groups with weapons which eventually end up in the hands of people who wish to harm the USA. We no longer need to rely on Middle East oil so there is no need for the US to be there.","post_message":"Q: What do we need to do to protect our homeland?   Get more answers at @webpagelink"},{"comment_id":"1834629973441103","commenter_b":"Such an embarrassment to REAL Women!!!","commenter_a":"Such bullshit","post_message":"More white women voted for Donald Trump than Hillary Clinton..."},{"comment_id":"10154640595946337","commenter_b":"It's all bullshit anyways..","commenter_a":"Must be nice to be rich and privileged! If I were to protest while on the job I would .get fired. Not all white people are rich and privileged.","post_message":"The Kansas City Chiefs stood with their arms intertwined as the anthem played."},{"comment_id":"600606456772491","commenter_b":"Takeaways from the Texas GOP Debate *Donald Trump looked like an absolute buffoon in a nice suit. It was also clear that he has talked out of both sides of his mouth so much, that he cannot even remember what he has said in the past. We heard all the same old talking points and we heard more insults and name calling designed to shame his opponents; and Trump even classless attacked the moderators for asking reasonable questions. The Trump diehards will rush to the Internet to vote for him as the winner. People who were actually listening to him, will change their vote if they thought about supporting him, or be happy with their decision to vote for someone else. * Ted Cruz was once again the most substantive and clear debater. He was unfairly treated by Wolf Blitzer by Blitzer inability to control Trumps interruptions. Ted Cruz was ...","commenter_a":"Good job tonight I wish we could of heard more","post_message":"Real compassion is providing people a ladder of opportunity to climb up from a state of dependency. #GOPDebate   Visit bencarson.com/issues to learn more."},{"comment_id":"10153548365891350","commenter_b":"You girls are so funny I love how jealous women can be towards each other. GET OVER IT! there are lots of work out clothes like this. Just cause YOUR ASs can't fit in it doesn't mean everyone else that looks good in this type of workout clothes has to stop wearing them! Jealouse? Shut up bitch go run in the treadmill then!!!!","commenter_a":"What's the issue...? Some moms look like this, some are chunky. I had a very nice body after my first son, trying to get back to that now after having my second. There's nothing offensive about this at all, some women are just bitter and resentful.","post_message":"This was probably not the reaction Bugaboo was expecting..."},{"comment_id":"1296273287105505","commenter_b":"You can go to hell liar","commenter_a":"Thank you president Obama. You will always be my president . The orange one will never be able to walk in your shoes he is a lier and con man and most of all a racist sob. Never put president before his name.","post_message":"\"That's what separates us from tyrants and terrorists.\" Nearing the end of his presidency, President Obama shared his hopeful vision of America's future."}]
