[{"comment_id":"10155127516070294","commenter_b":"A**hole","commenter_a":"Blacks,, that's all they know.","post_message":"You may have seen the video circulating online...  Now, because of social media, police say two people have been arrested in the large brawl at Beachwood Place Mall the day after Christmas. More here: @webpagelink"},{"comment_id":"1769361876675571","commenter_b":"Chinguen su puta madre ,al igual sigana trump nos seguiremos pasando i cruzando la frontera ,pongan ipongan sercas siempre los burlaremos 100% mexicanos gustele aquien leguste somos los #1 .","commenter_a":"Nice honest, rich family.","post_message":"In an impassioned speech, Eric Trump called on Americans to \"vote for the candidate who can’t be bought, sold, purchased, bribed, coerced, intimidated or steered from the path that is right and just and true!\" @webpagelink"},{"comment_id":"10153363483281770","commenter_b":"Vincent N Laiza. He wants to stop illegals crossing the border for 1. Tax payers are taking care of them. We can't afford them 2. Many people coming across the border are criminals. 3. Many people carrying disease and have never had vacinations 4. Terrorists are sneaking into our country. All the above items do not just include just mexicans they are going through mexico to get in","commenter_a":"Florida, Ohio, Illinois, Missouri & North Carolina lets keep winning, vote Trump 2016. Full speed ahead Mr. Trump. We will do this, vote Trump 2016!","post_message":"BREAKING: Donald J. Trump wins the Florida Republican primary.  Read more: @webpagelink"},{"comment_id":"771664696265472","commenter_b":"A 19 year old college student who apparently doesn't know history... It was actually Bill Clinton who trained and armed AlQuaeda","commenter_a":"Shouldn't have been there in the first damn place sleazy ass presidents....point the blame go head, this shit didn't just start....they just got more power...thanks America for taking my tax dollars and funding these weirdos","post_message":"A 19-year-old college student confronted Bush saying,“Your brother created ISIS.”"},{"comment_id":"1789863337898793","commenter_b":"NO !","commenter_a":"Like a dog misses fleas!","post_message":"Will you miss having President Obama in office when his term ends?"},{"comment_id":"1048428675208939","commenter_b":"@username What are you reading? How did the US government start this war? The Syrians and everyone else out in North Africa and the Middle East have access to the internet and make their own decisions. When people have access to information freely they act accordingly. People have free will to think and make decisions. No one forced the Syrians to fight or oust Assad. He cracked down on protests violently and this is the result.","commenter_a":"How can Assad sleep at night knowing he is responsible for the deaths of 300,000+ of his own people. It's disgusting","post_message":"What chance is there for peace in Syria? Join our Q&A"},{"comment_id":"1405534516411777","commenter_b":"Yet, @username, the GOP has declared their Cleveland Convention a Gun-Free Zone!","commenter_a":"Senator Murphy, when will you learn about guns and understand the meaning of the 2nd Amendment? When will you stop infringing on legal gun owners and take the guns away from criminals? When will you outlaw gun free zones, which are obviously attracting all these liberal lunatics wh commit these horrendous acts against innocent people? When will you and other democrats come up with common sense ideas that punish criminals and not legal law abiding citizens? I'll wait for your response!!","post_message":"Taking your questions live with Senator Cory Booker"}]
