[{"comment_id":"10153086379157217","commenter_b":"Paul is absolutely correct. Those are not just mare refugees those are economic migrants that seek to invade Europe and it's borders in order to establish themselves on our continent! They are not here because they need help, they are not here because they are running from War, those are people that abandoned their country , their women and children in order to Exploit Our achievements. To Abuse our LAWS in order to gain access to benefits we have worked for decades! They do not seek help nor assistance nor do they want to return to their country after the War ends. They want to Infiltrate our culture , our lands and when they gain critical mass we will not be able not only to stop them but to even contain them and make them obey the Laws in the countries they live in. This is a deliberate immigration of ...","commenter_a":"Good work to the Hungarians! The only people that protect their country and actually keep refugees in refugee camps as they should ! Good work Hungarian brothers keep strong !","post_message":"Footage has emerged of migrants being thrown bags of food at a Hungarian camp near the border with Serbia"},{"comment_id":"10154017627642217","commenter_b":"that would be too easy haha","commenter_a":"@username @username We all know his motives","post_message":"The Saudi teen who could face years in jail for striking up a friendship with an American girl over the internet. (via BBC Trending)"},{"comment_id":"10153722857026336","commenter_b":"How sad! God be with his family at this time.","commenter_a":"Who won the game ?","post_message":"17-year-old Evan Murray was a victim of internal bleeding caused by a ruptured spleen, an autopsy revealed Monday."},{"comment_id":"10153529159371770","commenter_b":"That's another reason he is known as lying Ted!","commenter_a":"what do you have to say now cruz? ha ha","post_message":"'Donald J. Trump is not getting to 1,237. No one is getting to 1,237.' #ThrowbackThursday"},{"comment_id":"10154159520288037","commenter_b":"They weren't misbehaving.im sure this girl was engaging in the drama as well","commenter_a":"Should've gone home and put on a Trump for prison shirt. I bet you the administration wouldn't have a problem with a short bashing a conservative","post_message":"She says she was told to change her shirt or go to in school suspension for the rest of the day because her shirt caused a classroom disruption."},{"comment_id":"1005311662842639","commenter_b":"I would have kicked her in her taco real good!","commenter_a":"Damn what a sicko.","post_message":"This nun decided that students needed a hardcore lesson in Jesus' suffering -- so she stabbed a kid in the forearm."},{"comment_id":"1760785597541885","commenter_b":"Yes I believe","commenter_a":"Yes","post_message":"VIA : God Is Love"}]
