[{"comment_id":"1081156815254321","commenter_b":"DEPORT ALL MUSLIMS FROM AMERICA IMMEDIATELY : DESTROY EVERY MOSQUE ASAP !","commenter_a":"Back to disliking France again","post_message":"Establishing 'good relations' before Trump takes office..."},{"comment_id":"10153923340133635","commenter_b":"Vicki C: So true re immigrants across the border. They caused more than half our hospitals and emergency rooms to close in Los Angeles years ago!!! Now, it's difficult for REAL Americans to get care when they require it. Just disgusting! Add to that, the planeloads of moozies Ovomit has been bringing in for years and I'm surprised any healthcare is available at all! Even our Vets can't get care and they should be first!","commenter_a":"Border Patrol Agent Defies “Gag Order” to Expose Obama The massive exodus of illegals crossing over into Texas and other border states is becoming more than local communities can handle. This influx of illegal immigration is causing emergency shelters, areas typically designated for use during catastrophes, to overflow, leaving local government scratching their heads as to what to do with immigrants who have no place to go and can’t be deported back to their home country.... Border Patrol agent Hector Garcia accused the Obama administration of “aiding, abetting and facilitating the smuggling of illegal aliens across the border.” In an interview with CNN, Garza said the current influx of illegal immigrants is “organized” and “orchestrated” by the drug cartels. Additionally, he said the federal government is giving illegal immigrants a “free pass.” He said the feds are using the equivalent of the honor system in asking illegal immigrants to later ...","post_message":"#1 Republican President Teddy Roosevelt was also a proponent of eugenics theories by Planned Parenthood founder Margaret Sanger"},{"comment_id":"10153483892683690","commenter_b":"Hello all indians! U stop nestle then stop modi too for supporting israel. Huh!","commenter_a":"Pay the bribe...","post_message":"The company insists \"Maggi noodles are completely safe and have been trusted in India for over 30 years\"  @webpagelink"},{"comment_id":"10153191726563132","commenter_b":"Oh ladies...smh","commenter_a":"Angie --we need to get Kathy on this situation.","post_message":"Won't you lend a paw?"},{"comment_id":"10154036425721336","commenter_b":"Mary yes they will be out, and then be invited right back in as legals. We call that boomerang amnesty.","commenter_a":"Trump belongs in prison along with Hillary and Obama.","post_message":"TONIGHT: GOP presidential candidate Donald J. Trump like you’ve never seen him before – Don't miss 'Watters' World' at 5p and 8p ET."},{"comment_id":"944282629025715","commenter_b":"Yes","commenter_a":"Yes absolutely","post_message":"Yes!"},{"comment_id":"954404074652647","commenter_b":"Hey boys go check the Negro-in-Chiefs record. Highest deficit of all time Biggest deficit than last 5 presidents combined. Highest sustained unemployment in history.","commenter_a":"how true how true","post_message":"A reality check for our Republican friends...  Thanks to Roy Mark Ramdas."}]
