[{"comment_id":"1573029682757155","commenter_b":"What's to be done. Vote for Hillary to screw over the vets, give away more jobs and flood us with refugees and illegal Hispanics?Seriously.","commenter_a":"@username shell say anything to get a vote this is how she really is a dirty white devil","post_message":"She used the racial slur over and over and over..."},{"comment_id":"695691723946745","commenter_b":"She has no clue !","commenter_a":"Talia Crichton","post_message":"The look on her face when Al Franken calls Betsy DeVos out for being so damn IGNORANT about education policy is simply priceless!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10155154391786729","commenter_b":"She claims not to know how they got there. That means they are there... end of story, now prosecute.... having them on an unsecured piece of equipment is a crime. Period.","commenter_a":"DON'T TRUST HER.","post_message":"Un-frigging-believable"},{"comment_id":"10153765437796336","commenter_b":"Then stop bringing in hundreds of thousands of illegals, then bring the jobs back to America.","commenter_a":"I agree, put people back to work and stop giving them freebees from the Government. Make them responsible for their own lives.","post_message":"Billionaire Charles Koch joined \"The Kelly File\" tonight for a rare interview, and said progress will depend on the American people understanding what is fair and what makes their lives better."},{"comment_id":"1237520902934076","commenter_b":"She's a criminal, with really bad hair.","commenter_a":"She did what she was hired to do.","post_message":"The American people deserve better. The DNC and Hillary Rotten Clinton rigged the system and completely ignored what the people wanted! They are so, SO corrupt!"},{"comment_id":"10154656959438132","commenter_b":"She should never get out!","commenter_a":"I wish this country had \"an eye for an eye\" law. She should be put into 600 degrees of heat. That poor poor child. This sickens me.","post_message":"The daughter, now 15, has undergone 28 surgeries since the incident. (via People True Crime)"},{"comment_id":"10152987685511051","commenter_b":"She is a whore. Why give her a pretty name. The whore was not forced to spread her legs to two guys in the same month? That makes her a big whore.","commenter_a":"The fathers of these twins are no better! I like how everyone always seems to too put blame on the women for her having sex with multiple men but it's take 2 to tango! Men are just as dirty.. It a 2 way street!","post_message":"The judge just made it official: these twin girls have one mom and two different dads."}]
