[{"comment_id":"1066627293358281","commenter_b":"You killed a clumsy one. No more clumsy spiders","commenter_a":"How is that possible? The spider isn't going to breed after it gets killed. Shouldn't TRYING to kill spiders have that effect?","post_message":"Just sayin."},{"comment_id":"10153558061286037","commenter_b":"Doesn't matter. BUT FOR her illegal arrest, she would not have been in jail.","commenter_a":"aaaand boom goes the dynamite.","post_message":"Waller County prosecutor Warren Diepraam says the injuries that were found during the autopsy of Sandra Bland would be consistent with a suicide."},{"comment_id":"467807840076463","commenter_b":"IDIOT ! LEAVE !!","commenter_a":"Yes, DEFINITELY","post_message":"Should Muslims Who Don't Like Christian Holidays Leave America?  Comment 'yes' or 'no'."},{"comment_id":"10153257299639071","commenter_b":"@username another Hilidiot who will blindly vote for a woman for no other reason than wanting a female president.","commenter_a":"Let's be honest about this. The only reason they gave back access is because a court battle over this would have revealed to the public that every democratic campaign had access to those records, and when the Sanders campaign reported it, nothing was done. Which would have highlighted not only the DNC favoritism of Clinton, but of the fact that they have been working to shut down Bernie at every turn. Which would have meant public acknowledgement of Bernie actually having a chance to win.","post_message":"Bernie Sanders sued, and the Democratic National Committee backed off, but it's not over yet."},{"comment_id":"10154072971081756","commenter_b":"what is the average age of someone on Medicaid? If it's what I think, I think the horse the barn long ago with these folks quitting smoking.","commenter_a":"Wellbutrin, as pictured, is often used to help people quit smoking and is used as an anti depressant BUT (there's always a but.....) it can cause mental health issues itself such as hallucinations, manic symptoms, etc.","post_message":"Despite one-third of Medicaid participants being smokers, many states aren't doing enough to help people in their Medicaid programs quit."},{"comment_id":"10153379974755329","commenter_b":"You have a baby in your belly. No more goofing off!","commenter_a":"Michael Aragona @username @username how do you like that?","post_message":"Thank you, restaurant gods."},{"comment_id":"10154126859997293","commenter_b":"They why are these alligators thriving in florida. They love the heat","commenter_a":"Why is this news? It's 90 degrees outside in a dense crowd and someone is hot. Big deal. Trump is a cold-blooded snake so I'm sure he could stand out there forever.","post_message":"Hillary Clinton was diagnosed with pneumonia before falling ill at the 9/11 memorial service."}]
