[{"comment_id":"10153367144158352","commenter_b":"Wow she's a fool!!","commenter_a":"WTF IS WRONG WITH ALL THESE CRAZY ASS PEOPLE IN FLORIDA!!! All these stories lately have been about people in FL just like the mom who made her child jump out 2nd story, there's been a shit load of crazies hitting the headlines recently","post_message":"Woman ordered to stay away from her baby after throwing child from car tells judge ‘I need a break anyway’"},{"comment_id":"10156946907525389","commenter_b":"@username you are just a hater. Stop disrespecting people specially Muslims.","commenter_a":"Love this man!","post_message":"\"Why didn't she say, 'Hey, make better lifestyle choices?' If you want to join something, why don't you join a church, why don't you join the Boy Scouts or the Girl Scouts?\"  Milwaukee County Sheriff David A. Clarke Jr criticized Hillary Clinton's comment on joining \"positive gangs.\" @webpagelink"},{"comment_id":"10156046538185389","commenter_b":"Sorry , but I don't think women belong in combat ! I am old fashion , I still believe in Chivalry ! :D","commenter_a":"Time to retire this so called..\" Top Admiral \"..too many PC types in the military now, arm chair leaders..!! Desk jockies..!!","post_message":"The U.S. Navy's top admiral said he believes female sailors should be welcome to join the service's elite SEAL teams, provided they can pass the training regimen."},{"comment_id":"10153816577949160","commenter_b":"You believed that nonsense? Sue glad Donald never cheated at anything.","commenter_a":"When can we not have to listen to lying cheating Teds shrill voice cry over everything. Ted cheated on his wife then lied about it.","post_message":"Donald J. Trump just won Indiana. Here's what that means.  READ MORE: @webpagelink"},{"comment_id":"386189561505639","commenter_b":"Keep it open and all prisoners.","commenter_a":"Open","post_message":"Do you think Guantanamo Bay prison should be closed as promised or kept open?"},{"comment_id":"10152932838822169","commenter_b":"I like the way you assume everyone is consuming too much. When sitting on our butts all day has more to do with it.","commenter_a":"Makes sense. The explosion of obesity has occurred after the advent and proliferation of fast food restaurants.","post_message":"Fast food kills gut bacteria that can keep you slim, study finds (From PBS NewsHour)"},{"comment_id":"10153694817752293","commenter_b":"All they have to do is ask and I'd let a nurse snap all the dick pics she wanted.","commenter_a":"And her name is Johnson ....","post_message":"Police discovered a photo and video on the nurse’s laptop."}]
