[{"comment_id":"1444053418948017","commenter_b":"That's why those guys never meet a MULAN their whole life. They could not handle a strong woman anyway.","commenter_a":"He's blaming Mulan for progressiveness and equal woman's rights. Someone thinks we belong in the kitchen barefoot and pregnant.","post_message":"Donald J. Trump running mate Mike Pence slammed the kid's film as the brainchild of a \"mischievous liberal at Disney\" bent on causing \"a quiet change in the next generation's attitude about women in combat.\""},{"comment_id":"10152814296572377","commenter_b":"Creepy lady","commenter_a":"and Obama has invited them...","post_message":"Geller stands tall saying \"Give Me Liberty or Give Me Death,\" even though she is being targeted by ISIS. But they aren't just coming for her she says..."},{"comment_id":"10158310227560389","commenter_b":"I think they are GRRRRRRRREAT!!!!! For the first time in my adult life, in a long, long time, I feel very proud to be an American!!! President Trump has done more in his first few days, than Obama did in 8 years!!!! Thank God we are rid of Obama and his family!!!","commenter_a":"He is doing great as we expected doing what he said he would do !!","post_message":"Question of the Day: What do you think of the moves President Donald J. Trump has made so far?"},{"comment_id":"1400798166615856","commenter_b":"Bye bye bitch","commenter_a":"KICK ROCKS, THAT'S RIGHT RUN RABBIT RUN","post_message":"BYE! You won't be missed."},{"comment_id":"496087783849595","commenter_b":"Walking into someone's property uninvited and killing a dog who was protecting the house from such intruders. Fuck that guy.","commenter_a":"Look at these comments.","post_message":"This cop fear for his life after trespassing in a homeowner's back yard and being confronted by a 25 pound dog. What he said to the homeowner afterwards will make you sick.  Via - The Free Thought Project.com"},{"comment_id":"666476586876253","commenter_b":"She needs to worry about herself ugly!!!!","commenter_a":"No me jodas... ...","post_message":"Controversial video just leaked that shows what Michelle thinks about white people.  This is extremely offensive. We need to spread this, and show the country she's a racist.  Do you agree Michelle Obama is the worst first lady ever?"},{"comment_id":"853953454653203","commenter_b":"Wow::hey woman-let go of her hair and fight,","commenter_a":"Can we please get the blurred trip screen out so we can actually see something?","post_message":"WILD AND VIOLENT BRAWL: An all-female fight goes down outside a gas station and the spectacle was captured on video. Kicking, punching, hair pulling. We can't make this stuff up."}]
