[{"comment_id":"1102356133153121","commenter_b":"dumb bitch","commenter_a":"Yooooooo I Knew She Was A Tranny!!","post_message":"‘I Stand Corrected:’ Wendy Williams admitted fault and apologized for her remarks about HBCUs.  Williams spoke with Roland Martin on Thursday's edition of The Wendy Wiliams Show where the NewsOne Now host eloquently summed up America's troubled past of slavery, segregation, and the oppression of African-Americans. WATCH the discussion and the NewsOne Now recap -> @webpagelink"},{"comment_id":"529761760538579","commenter_b":"You ruined it","commenter_a":"@username @username Sam Finch We get the joke :)","post_message":""},{"comment_id":"10153141650912093","commenter_b":"Look it up chick","commenter_a":"3200 people died in car accidents today in the US, everyday","post_message":"A man is in a coma after an electronic cigarette exploded in his face... @webpagelink"},{"comment_id":"10153662067420950","commenter_b":"Teresa you need a big fat,one stuck in your mouth so you can't talk but choke","commenter_a":"Trump's mouth is actually helping to elect Democrats in November. I wonder how many Republican leaders were meeting this morning and asking one another \"How in the hell can we shut this guy up?\"","post_message":"\"I'll say one thing about the Democratic Party,\" Trump observed. \"At least they stick together.\""},{"comment_id":"10153516025754705","commenter_b":"No wonder you don't have any friends woman","commenter_a":"I hope this creature is captured and eaten by the Japanese","post_message":"What a spectacular creature."},{"comment_id":"10153010443401336","commenter_b":"I bet you don't even know what a p value is lmao.... Please don't reproduce...:)","commenter_a":"should be legal everywhere","post_message":"Possession of marijuana is no longer a crime in Alaska, but smoking it in public can lead to a $100 fine.  Should more states follow suit?"},{"comment_id":"10154151244455579","commenter_b":"A fool and her money are soon parted.","commenter_a":"Just now donated $20 for Hillary Clinton and committed to caucus in my state hope you do the same right now:) I am voting for Hillary because I fell she is the best qualified person. Three Supreme Court Justices will mostly likely be appointed and I want a democrat to be the one to select the appointees. She can do it better than Bernie plus backwards and in High Heels. We have made such progress under President Obama I would like to see how much more we can continue to do and I trust her and honestly know she will be the best Person and successor to Barack Obama additionally she has devoted her \"entire life\" to bettering the lives of the American People.","post_message":"Hillary Clinton: \"We are going to fight for every vote in every state.\" Full video here: @webpagelink #CSPANfan"}]
