[{"comment_id":"10152744364061051","commenter_b":"And she can spend all the money she wants...mother nature will eat you from the inside our eventually","commenter_a":"Wonder how many hungry people that money could feed? But why try to end world hunger when you can go to the gym.","post_message":"This couple spends $80,000 per year on their looks, and they say that's why they're the best looking people in America."},{"comment_id":"10153229649411770","commenter_b":"Spank her, then send her to jail where she belongs!!","commenter_a":"If we are going to keep Hillary out of office we need Trump and Cruz to team up. That's a ticket that would put the republican's in office and would reverse all of this crap. But it's going to be left up to us to flush this Muslim crap down the toilet and out of our country. It does not belong here, it will never get along with western culture.","post_message":"Ted Cruz warns Hillary Clinton that \"in America the voters have a way of administering a spanking.\""},{"comment_id":"10153800106900530","commenter_b":"No respect for life anymore. Started with free abortions pushed by Democrats. The liberal attitude that a baby in the womb is not life has created this pervasive attitude that life means nothing no matter what the age.","commenter_a":"put his ass in jail he dont respect life","post_message":"Police say the driver tweeted a photo of the 16-year-old victim's body and wrote \"I jus killed a man.\""},{"comment_id":"472460989569345","commenter_b":"Your vagina has muscles specifically designed for pushing things out. Kegel exercises will strengthen and tone them. Plus, I'm pretty sure that little knob looking thing on the bottom of the cup is for grabbing.","commenter_a":"I'm just not comfortable sticking something up there that I don't have a mechanism to pull it out with","post_message":"While used mostly in developing countries due to lack of access to regular products, these cups could be far superior than those regular products."},{"comment_id":"10153910090484160","commenter_b":"We need to ban this evil witch!!!","commenter_a":"Ban cars. Cars kill people. Drivers carry insurance. It is a business that determines risk and the policy cost reflects that. Require gun owners to have insurance rather than taking them away, unless, of course, you really are trying to disarm the American people.","post_message":"\"Terrorists and dangerous individuals are using guns to kill Americans. We should make it a lot harder for them to do that.\"  Hillary Clinton"},{"comment_id":"1082109501809405","commenter_b":"Illegal refugee returns?","commenter_a":"what about the human rights of the children and women raped and molested by islamic immigrants ??","post_message":"Amnesty Secretary General Salil Shetty said that short-term national self-interest and draconian security crackdowns had led to an \"unprecedented assault on human rights\" in 2015. Read more: @webpagelink"},{"comment_id":"895006600536681","commenter_b":"You gotta wonder where all these 'virgins' are supposed to come from... What a bunch of head-banging fools.","commenter_a":"They might be running out of virgins soon... The LEO that sent them packing, Thank you","post_message":"Officer who was shot by two gunmen outside free speech event in Texas has reportedly been released from the hospital.   The two gunmen are dead."}]
