[{"comment_id":"1357316664288360","commenter_b":"You have got to be kidding. These people are making bad decisions how long are we going to baby adults too stupid not to do drugs? Why can't our country figure out what ILLEGAL means? How about illegal immigrants and illegal heroin.","commenter_a":"its better then clinton","post_message":"Ithaca's mayor wants to open safe injection rooms for heroin users."},{"comment_id":"533413536846939","commenter_b":"They all need to go back to thier countries and fight thier own battles against extremist.","commenter_a":"U GO TRUMP","post_message":"Looks like Trump said what many across the world were already thinking..."},{"comment_id":"10152939381996770","commenter_b":"That's her right to do so. Now can we just move along here!","commenter_a":"@username's mother is just as big a piece of crap as he was.","post_message":"As the one-year anniversary of the death of Michael Brown nears, his mother says that she will never forgive Darren Wilson, the Ferguson, Mo. cop who killed him."},{"comment_id":"608860039265106","commenter_b":"@username Beautiful? NO!! She's SICK!!","commenter_a":"So real girls will have their dreams of becoming prom queen crushed because this school will more than likely give the award to a man in a dress just so the school can appear to be progressive.","post_message":"\"I'm not going to let anyone discourage me from being who I am.\" 18-year-old Dakota is one of four finalists running for prom queen her Portage, Indiana high school. The transgender teen is becoming an unlikely hero for some."},{"comment_id":"10152765458922452","commenter_b":"What a beautiful woman!","commenter_a":"NoooooooooooH! Whhhhhhyyyyyyyyyyy!! 😢😣😧😩","post_message":"This is the last year that the original version of Kraft Mac & Cheese sold in the U.S. will contain artificial preservatives or synthetic colors. @webpagelink  In January, Kraft says its macaroni and cheese will be colored using paprika, annatto and turmeric."},{"comment_id":"10154014383211636","commenter_b":"hmmmmmmmmmmmmmmmmmmm, she needs to be hanged.","commenter_a":"good! even the uk police can be corrupted.","post_message":"She was shot in the stomach, but not by the man she claimed"},{"comment_id":"1172654749497442","commenter_b":"I don't get the talk of someone \"forced\" on us . She has millions more votes , sorry but except in the final Presidential election (ala 2000) the person with the most votes wins .","commenter_a":"Screw @username","post_message":"The numbers are revealing a slow but steady climb for Hillary Clinton"}]
