[{"comment_id":"10154204294889778","commenter_b":"Then let her pay for it","commenter_a":"They need to get over it! Rename something of their own! Confederates were a part of history too! If this is the case, let's change every building's name that offends every confederate soldier's family too!!! I Have Had Enough of this - so crazy & ridiculous!!!","post_message":"Actress Julianne Moore and Hollywood producer Bruce Cohen want a new name for their old high school in Virginia, named for a Confederate general."},{"comment_id":"1004458709688902","commenter_b":"Yo entiendo","commenter_a":"@username should fucking be ashamed of themselves. I see that you are just like most Corporate News Organizations which takes a real issue then contort it for your clicks and likes. I am a Black American. I have been living in the Dominican Republic for 3 years. I hold 3 degrees to include a JD and an LLM. I am going to tell the truth and I hope to never see such nonsense like this published again. As I said I been here for 3 years. I came here not knowing a word of Spanish because I as a Black Man wanted to get away from America. I spent 11 years in the Marines also and I have traveled the World and NO WHERE have I been or felt more free than living in the Dominican Republic and that is a very real yet sad statement, a testimony if you ...","post_message":"This Video Sheds Light on the Deep Racism That Black People Face in the Dominican Republic #ABSArchives"},{"comment_id":"10156920810200354","commenter_b":"Hey Cat, I have a dog that likes cats. She break their necks and use them as a dumnbwitted limp cat as skinny playboy. Maybe I could introduce y'all. Then you and Hillary will have a lot in common except for her long awaited prison cell....Gordon, most elections was closed primaries, which means Donald couldn't continue to empty the democratic party list of intelligent members which was leaving them with the African-Americans voters and dumb and moronic white voter in that party. Anyone who could vote for Hillary must not be capable of reading or hearing...or just hate America","commenter_a":"I'm very proud of my state of Arizona. On to the White House!","post_message":"#Election2016"},{"comment_id":"10153398381514364","commenter_b":"Social security is the world's biggest pyramid scheme. It will eventually crumble, and I have no doubt it will do so in my lifetime.","commenter_a":"I'd love to have my social security tax, 6.2% of my income, go into my 401k or Roth. I don't need the government to help me save for retirement.","post_message":"They aren’t being straight with the American people, and they know that."},{"comment_id":"10152691502210927","commenter_b":"I agree they are just like his kids - Brats who think they deserve everything on a silver platter.....Put them back on the top of train cars headed for Central America","commenter_a":"Y r yall so against latinos/ mexicans last i checked they were here n mingled with natives b4 many of urs ancestors, when did they push, steal, lie, march families out of their lands","post_message":"Illegal aliens are just like our kids according to Obama."},{"comment_id":"1859752354244114","commenter_b":"She is very stupid...and very mixed up..crazed..","commenter_a":"FUCK-YOU,YOU LYING ESTABLISHMENT PIECE-OF-SHIT...THIS BOOTLICKING PUBLICATION ISNT EVEN WORTH WHIPING YOUR ASS WITH...NO RIGHT-MINDED UNDIVIDUAL/FREETHINKING PERSON CARES ABOUT THE PARTISAN-CORRUPT GARBAGE THAT YOU CREATE OUT OF FABRICATED LIES...SO,GO SHOVE YOUR HEAD RIGHT BACK UP #MADAMEINMATE666'S FATASS AND QUIT PRETENDING TO BE A JOURNALIST PUBLISHING NEWS...FUK-OFF.","post_message":"It’s official now: Jill Stein—and the Green party if it agrees with her—is/are a waste of space.  By Daily Kos user BoGardiner"},{"comment_id":"1046837848719437","commenter_b":"@username You must be trying to sound smart but if you are a Trumpeter... Oh well need I say it? Trump lies every single time he opens his ignorant mouth! I will take my chances with @username! At least she has a coherent campaign beside I am uh going to uuhh build a Wall YEAH a Great big wall DUH!","commenter_a":"When voters were asked to say the first word that came to mind when they thought of @username, the most popular responses were , , and .","post_message":"The fate of immigration reform—and millions of undocumented families—is in the hands of the next president."}]
