[{"comment_id":"1424826404224494","commenter_b":"Evil creeps just like their daddy.","commenter_a":"Assholes someone needs to hunt them down !!","post_message":"Madonna just called out Donald Trump’s privileged sons and it’s EPIC."},{"comment_id":"924673837566701","commenter_b":"I meant divided we fall","commenter_a":"At least learn how to spell 'Missile' Then you can be an educated bigot!","post_message":"I have joined with a bipartisan group of 16 senators to introduce legislation that would impose economic pressure on Iran if international negotiations do not yield a final nuclear deal by June 30, 2015. This is the most important foreign policy issue facing our country. A nuclear Iran will threaten the security and safety of the United States and send a message of weakness to our allies and partners in the Middle East. This legislation is an important signal to Iran and the entire international community that the current negotiations are not endless and the Iranians cannot continue their dangerous nuclear activities."},{"comment_id":"670195519853865","commenter_b":"LEARN TO SPELL NIGGA DAMM Y\"ALL BITCHES OVER TRYING TO TELL US SHIT GO BACK TO SCHOOL.","commenter_a":"Not in a million years, she is a traitor, liar, con artist, she left 4 Americans to die with out any help but then what difference does it make anyway- Bitch, hope you go to prision!","post_message":"Hear, hear!  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153301251374087","commenter_b":"Jesse anderson, another perfect example of a bootlicking crypto fascist","commenter_a":"If police are doing nothing wrong they should have no problem being videotaped.","post_message":"The question of whether police are reluctant to enforce the law because they are afraid of being videotaped has become the subject of fierce debate, as experts struggle to explain an uptick in violent crime in some U.S. cities."},{"comment_id":"10152935961526717","commenter_b":"Marriage laws are in the USA,not in Africa,this is and excuse to a naked street party","commenter_a":"I'd like to protest Kenya's murdering of gay people for simply being #uncivilizedculture","post_message":""},{"comment_id":"10154289426723797","commenter_b":"@username I am an alcohol manufacturer.","commenter_a":"They should never have been in prison to begin with.","post_message":"OBAMA COMMUTES DRUG SENTENCES: Nine people from Illinois are among the 95 whose prison sentences have been commuted by President Barack Obama."},{"comment_id":"1795750557330111","commenter_b":"Couldn't agree more!! Set up! All the drama, theatrics all made for Reality TV!! Kardashian styling! #Whinylittlebitch","commenter_a":"I believe THAT was completely stage set up!!!!! How can possibly someone can get through with a gun if someone did try to do something.... Complete set up","post_message":"The Secret Service rushed Donald J. Trump off the stage at a rally on Nov. 5 in Reno, Nev.: @webpagelink"}]
