[{"comment_id":"10152771526960950","commenter_b":"She didn't tell people to do this so she isn't responsible for what happens. She is only on the show since her older sisters were in the lime light to begin with and then as she got older she got in the light! It's not her fault these girls are dumb af!!! She paid money to get filler in her lips she didn't suck her lips into a bottle!","commenter_a":"I know kids who have done is following that crazy K lead. She should be held responsible if anyone becomes disfigured. Time for a public statement, Kylie.","post_message":"WARNING: Teens who participate in the #KylieJennerLipChallenge by suctioning their lips with a bottle or jar could be left permanently disfigured or deformed, doctors say."},{"comment_id":"10154366000234166","commenter_b":"Idiots. Careless. I will be glad to raise the baby.","commenter_a":"Betsy Carver ..unreal","post_message":"Police said neighbors found the toddler outside in 96-degree weather with no water. He was screaming, crying, and trying to get inside."},{"comment_id":"838447029619520","commenter_b":"Why is that ugly cat so moist.","commenter_a":"Brittany Gallo","post_message":"WATCH: Obi the baby pygmy hippo has splashed into the water with his mother for the first time in front of viewers at the Melbourne Zoo in Australia."},{"comment_id":"10153832005601162","commenter_b":"Not a girl if you have boy parts, sorry.","commenter_a":"What about the rights of every girl at this school. This is insanity.","post_message":"30-DAY DEADLINE: The U.S. Department of Education says Palatine Township School District 211 is violating the rights of a transgender student by refusing to allow her the unrestricted use of a girls' locker room: @webpagelink"},{"comment_id":"10154169270413908","commenter_b":"Tony 'Osman' Andrews","commenter_a":"Ups, that was ,me...:)","post_message":"For those of you who are unaware of this observatory, it's captured some fascinating shots of unexplained aerial phenomena."},{"comment_id":"1696261590644336","commenter_b":"Why don't you take down your wall and move the migrants in... Such hypocracy!!!!!","commenter_a":"Despicable imposter of the Catholic faith.","post_message":"POPE PUSHING OPEN BORDERS, AGAIN  details @webpagelink"},{"comment_id":"10154897891195530","commenter_b":"@username you kiss your mama with that nasty mouth?","commenter_a":"Trump is frightening for everyone. Period.","post_message":"There are up to 127,000 undocumented immigrants in Michigan, many of them anxious about Donald J. Trump."}]
