[{"comment_id":"1662251920662029","commenter_b":"White thugs!!","commenter_a":"Love the broncos, but just for this I would have they're title taken from them and given to the panthers","post_message":"This is disappointing. While many people celebrated the Broncos' Super Bowl victory peacefully, some were destructive. Denver Police made 12 arrests and thankfully, no one was seriously hurt. @webpagelink"},{"comment_id":"10153335950782293","commenter_b":"When you have a citizenry that has NO respect for authority, this is what you get. Should the police just let them run wild? Why not create some \"no go zones\" and let the animals have at it.","commenter_a":"If the only way police can \"control\" crime is through the kind of brutality we see in videos, they better relearn their policing skills.","post_message":"He suggested violent crime is surging in the U.S. because police officers fear getting caught on the next video of alleged police brutality."},{"comment_id":"1760125540941984","commenter_b":"They're far better than Hillary and her crooked minions! If she gets elected, we'll be under Sharia Law so fast your head will spin!","commenter_a":"Too funny - it just continues to be the funniest convention of all time - Hey, Christie a few months ago when you were running yourself - you decardedTrump unqualified to be President - too funny. All of these clowns: Christie; Gingrich; Pence and TRUMP are all an embarassment to the GOP party.","post_message":"Delegates at the Republican National Convention chant \"lock her up\" as Governor Chris Christie says \"I welcome the opportunity to hold Hillary Clinton accountable for her performance and her character.\" More: @webpagelink"},{"comment_id":"10157033906465725","commenter_b":"STOP Crooked Hillary from winning the general election! Together we can turn this country back around in the right direction by getting out and voting! TRUMP 2016!","commenter_a":"NO way!!!","post_message":"It is so important to get out and VOTE in 2016. Crooked Hillary Clinton cannot be our next POTUS! Senator Jeff Sessions just warned, \"This will be the end of law in America.\" Get out & VOTE TRUMP! We will MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1001780713207758","commenter_b":"Like we weren't already?","commenter_a":"So how many of his baby-mamas and illegitimate kids do we now have to support? Any more than usual?","post_message":"Protesters Said this Cop Shot an Unarmed Teen for No Reason. Here's the Video."},{"comment_id":"10154818490392235","commenter_b":"Last I checked deplorables 1 idiots 0","commenter_a":"I wonder why raw story didn't post anything about the black kids jumping the white guy because they thought he supported trump. Liberal logic the worlds cancer","post_message":"This video just is the latest in a series of white people justifying their obnoxious behavior and demanding special treatment because they voted for Trump."},{"comment_id":"10153486419716680","commenter_b":"Yeah, see you at the polls.","commenter_a":"Only because he has not been Vetted by the Media he's a very flawed man mean and nasty. He's not well like in the Senate he was not an effective Senator! once he is fully Vetted those numbers will go down! for those who are members of his Cult why don't you do more research on him? You all have that Jim Jones Mentality and are drinking his Kool Aid! You may not know who Jim Jones is? because again you know nothing about Politics or Math or Civics! You seem not to have Jobs and Mommy And Daddy never said No to you! The old goat s a lying Fraud and you believe his BS! Those are also his Initials!","post_message":"Bernie Sanders now has 48 percent support nationwide, putting him in a virtual tie with Hillary Clinton, who is at 50 percent."}]
