[{"comment_id":"10158695661875206","commenter_b":"Check this out i mean Inc.org","commenter_a":"Humans have souls and can live etrnally and that is according to what is written in the holly scripture \"the bible.\" God forwarned us that earth will be burned during the secon d coming of jesus ... judgement day.. The bad ones will be burned and gids chosen people will be saved and have second life eternally","post_message":"If there really are multiple, interacting universes, then it would be possible for time travellers to visit Earth, and every imaginable scenario would be played out in a parallel universe at some point."},{"comment_id":"10154412876021491","commenter_b":"Does this tour detour to the location of the White House MLK Bust? I hope they know where it is. Don't depend on Time, though.","commenter_a":"Shruti Maheshwari","post_message":"Here's how to score a major deal on a scenic getaway."},{"comment_id":"10153865845208984","commenter_b":"TRUMP IS A LIAR! TRUMP IS A RACIST! TRUMP IS A BULLY!","commenter_a":"If you watched the last debate Carson was nervous stuttered his responses I just don't think he's hard enough","post_message":"'The Donald' just ripped into his Republican rivals today and revealed the one big reason why he doesn't think Dr. Ben Carson could do the job. Some might agree that he makes a valid point...  Do you think Trump could be right about Carson?"},{"comment_id":"1353674218062160","commenter_b":"Dawn you're clearly a sexist. Lol.","commenter_a":"Yeah and the Republicans made such a big deal about Hillary's reset with Russia. The Donald just might sell out to Russia. Just how many millions did the Donald get from Putin?","post_message":"Donald J. Trump can scrap U.S. sanctions on Russia and other national security policies with just a signature."},{"comment_id":"1291576474195436","commenter_b":"Gonna be great for tranny sex!","commenter_a":"Private stall restrooms make it no longer an issue for either side of the issue","post_message":"Target will invest in private stalls in response to protests from customers over its policy allowing transgender customers and employees to use the restroom that aligns with their gender identity.  Do you like Target's move toward inclusivity? Or were you opposed to its policy?"},{"comment_id":"963953273645145","commenter_b":"Lets not forget our own NATIVE AMERICANS!!!","commenter_a":"Obama was being kind, to only mention the crusades! the destruction, genocides, and murders throughout history tell, a much more terrifying truth!","post_message":"If a person in good faith was truly hurt by these comments, their faith is pretty damn weak. Suck it up, know your history, and grow from it. You don't like someone calling you out for the atrocities you didn't commit? Welcome to the life of every Muslim American."},{"comment_id":"10153992023378145","commenter_b":"@username I agree completely!!","commenter_a":"Well, what do people expect when you're in their habitat take awake their habitats?","post_message":"Amazing Rescue: The mom started wrestling with the animal when she saw that her son's entire head was in the mountain lion's mouth."}]
