[{"comment_id":"10155035981661159","commenter_b":"So I take it she does not plan to work in the near future, for she may not fit any parts with cropped hair.","commenter_a":"Who is she???","post_message":"This didn't work out very well..."},{"comment_id":"356605304542984","commenter_b":"Round them up. Shoot them. Send body bags back.","commenter_a":"with the help of our government they will win. little bush wants to take the walls down and do away with the border guards , it will save trillions of dollars each year. after all most of them are here now","post_message":"Are the Marxists gaining in their Desire to Destroy America?"},{"comment_id":"10153731246222217","commenter_b":"VOTE FOR TRUMP!! Screw this hoe","commenter_a":"Isn't that what Trump is actively doing? At least Clinton only accidently put others in danger, where as trump is one bad day away from bringing back Lynching, well try to anyway.","post_message":"He added that she would make \"such a lousy president\"."},{"comment_id":"10153642816391130","commenter_b":"Fk this bitch","commenter_a":"What a horrible article.","post_message":"One reason? Bernie Sanders is \"too old.\""},{"comment_id":"10154191212073132","commenter_b":"Some girls eat and eat and not gain a pound, I'm not talking about girls with eating disorders. That's a different topic. Some girls are skin and bones regardless of how hard they try and gain.","commenter_a":"Far better looking then the skin and bones models they normally show. But she isn't \"Plus size\", she's fit and healthly size.","post_message":" thought Sports Illustrated was taking a risk by putting a girl my size in the pages. But putting me on the cover? They aren just breaking barriers; they are the standard now. This is beyond epic."},{"comment_id":"10154793818836337","commenter_b":"Holy shit you're dumb","commenter_a":"Fake deal. She has run her course and they don't want her anymore. She has been all downhill since she cut her hair. She belongs back playing support for O'Reilly on his show. Demanding a raise? No. On the verge of being fired, but trying to save face.","post_message":"Should she stay or should she go??"},{"comment_id":"10153457931491130","commenter_b":"Zane Gutierrez","commenter_a":"The politics of this is, scandalously ,that its a way for the establishment to write people off , they do not want to understand., There is so much hypocricy on this particularly in relation to alcohol : whats wrong with wanting to feel good , which is why anyone tries to get high off anything ?How we try to achieve this might be questionable but anything can be abused, does not make it bad in itself . people would not do self-destructive things if they felt self-worth. As some people here have said in their comments here,learning to love themselves was key to giving up the addiction .(not read the article btw)","post_message":"\"We put people who are not well in a situation that makes them feel worse and hate them for not recovering.\""}]
