[{"comment_id":"10152727652141051","commenter_b":"LOL dumb ass bitches","commenter_a":"Wow how sick.could they wait until they got home","post_message":"These two women were chased out of a movie theater bathroom because the security guard thought they looked too much like men."},{"comment_id":"10153859068156955","commenter_b":"Leave the mug and leave her alone.","commenter_a":"She didn't like the interview either, (\"Not one bit\"). Did they ask Ms Flossie if & when SHE wanted to be interviewed? It was all very awkward. They gave her a station coffee mug (shameful)... Put flowers on her lap that she can't hold... The kicker to me was the opening where the interviewer held up the newspaper RIGHT IN FRONT OF HER FACE!!!! The whole thing was disrespectful.","post_message":"BEST INTERVIEW EVER"},{"comment_id":"10153978119022690","commenter_b":"I'm a hard working taxpaying citizen and I say every day this is the greatest country on the plant. America is Great proud to be an American.","commenter_a":"It's great for immigrants and illegals. Not for the hard working tax payers that pay for everything they get. And they keep raiding SS to pay for them too what's so great about that?? TRUMP MAKE OUR COUNTRY GREAT AGAIN!!","post_message":"First lady Michelle Obama at the DNC: \"Don let anyone ever tell you that this country isn great. That somehow we need to make it great again. Because right now, this is the greatest country on earth.\" @webpagelink"},{"comment_id":"10153386538275326","commenter_b":"How is he going to run his hotels,if he reports all illegals??","commenter_a":"He mean kill them.","post_message":""},{"comment_id":"10153322540253271","commenter_b":"It is probably easier to do that surgery when the 'boy is younger He looks better afterwards","commenter_a":"Stupid! I grew up being bullied and NO ONE did anything to protect me. There are better ways to help him with the problem","post_message":"PARENTS: How young is too young for plastic surgery? A 6-year-old boy got his ears pinned back to stop bullies from calling him 'elf ears.'  What do you think? Is this a good way to handle bullying? We're sharing your opinions on 7NEWS at 11:00. @webpagelink"},{"comment_id":"1245886292171089","commenter_b":"@username me too","commenter_a":"Maybe they were afraid the non-white people were not going to use the proper restroom for the gender on their birth certificate. Hey, do we have to bring our birth certificates along if we visit your fine state so we can pee? Oh, nevermind, I forgot...NO ONE IS GOING THERE, so we don't need to know! As long as you have McCrory as your governor, you best get used to this kind of thing happening. (Note: this bit of sarcasm was aimed at this Nightclub, not the City of Charlotte. Charlotte is the city that passed an ordinance on Anti-Discrimination to protect the LBGTQ community, which lead to the stupid HB2 being passed by the state legislature. Too bad Charlotte suffers along with the rest of the State for trying to be open and fair.)","post_message":"This is an outrage."},{"comment_id":"10154728095336336","commenter_b":"If it was a girl ,she may have gone home with a hook up","commenter_a":"This is awesome! I would eat at Original Joes if they had one in my town! Kudos to the woman who chose to get a ride home instead of driving!","post_message":"After deciding to take an Uber home, she returned to her car the next morning and found quite the surprise."}]
