[{"comment_id":"10157067954080354","commenter_b":"FEMINISTS ARE THE NEW NAZIS.","commenter_a":"Where I work at, women who do the same job, get the same pay! It was even like that at my last job! Corporations cannot discriminate based on sex or they will face lawsuits! Feminists are always pushing the lie that women don't get paid the same! I've seen it first hand that it is just a LIE!","post_message":"\"It would be nice to be able to have a more complex conversation and to be able to look at it more than just a quota or numbers.”"},{"comment_id":"10153540575624411","commenter_b":"with Californias massive extreme drought, its like a match head waiting for a strike anytime any place.","commenter_a":"accidents happen anywhere why blame beautiful California. Nothing like California in this whole WORLD!!!!!!","post_message":"Watch: Huge forest fire sweeps highway in California"},{"comment_id":"837639489700820","commenter_b":"I will destroy humans","commenter_a":"Eloise Nicholls Regan Howard Louise Hemmings Sydnie-Jo Goodison Megan Wilkins @username","post_message":"This robot wants a family...and to destroy humans."},{"comment_id":"888955024560582","commenter_b":"Yeah!!!","commenter_a":"@username @username lunch 2mrw?!","post_message":"When you realize tomorrow is Friday... (click to play)"},{"comment_id":"948719421835197","commenter_b":"naw, the generation of things now being exposed more like it","commenter_a":"The generation of no personal responsibility.","post_message":"If this tactic works, we're a sicker country than I could have ever imagined."},{"comment_id":"10154521011917098","commenter_b":"You a hoe","commenter_a":"Hahahahaha trying to get his dick wet but caught a case of the zzzzzzz","post_message":"#HEARTBREAKING: When police arrived, they found the 17-year-old dead in the foyer."},{"comment_id":"10154002938919749","commenter_b":"Cindy Rhodes go do one stupid cow feminists are scum","commenter_a":"If your still hung up on feminism within the uk and the us then you need to develop your personality. Not your discrimination skills.","post_message":""}]
