[{"comment_id":"1850656938526347","commenter_b":"Good put her away . Let her spend her millions on appeals .","commenter_a":"They should!!!!!","post_message":"My, my, my..."},{"comment_id":"10154081807932212","commenter_b":"Women are not a minority.","commenter_a":"The DNC proves once again that dividing the people is their mantra. These women are being used and they do not even know it. The Democrats are using these women the same way as they use all minorities. It's disgusting..... @webpagelink","post_message":"#WomensMarch OK about to begin at the Capitol. Grant Hermes News 9 says an OCPD officer just estimated up to 6,000 people there right now. #News9"},{"comment_id":"10153139326127293","commenter_b":"just facts he was no hunter just by what was done and his lousey shooting . he had no business hunting.","commenter_a":"he didnt know what he was doing and the guides were obviously dirty.","post_message":"How a dentist who killed Cecil the lion shelled out $50,000 for the trip."},{"comment_id":"1235851089812062","commenter_b":"You're as ghetto as this chick","commenter_a":"I had my daughter at 16. I hid my pregnancy til the day i had her. My family just thought I was getting real heavy. Yes it was scary I was way too young and I knew my life would change. I had to grow up and do things most 16 yr olds don't have to. But i loved my daughter and can't imagine a life without her. I will never understand this! At 16 you know better!!! Give that child to a hospital, family someone!","post_message":"A infant girl died after being thrown from a second-floor window, allegedly by her 16-year-old mother after the teen gave birth. The child's grandmother was administering CPR when paramedics arrived."},{"comment_id":"949480448492859","commenter_b":"I know and all white people are racist, and all blacks are bad and all people named Ana are jerks. Yeah I get it.","commenter_a":"Whatever people think about Trump, he's not as stupid or delirious as the Democrats who put Israel and the USA in jeopardy of a nuclear strike, and gave the biggest supporter of terrorists over $150 billion dollars to wipe us out... Our government is carrying political correctness to the point of suicide, just like all the European nations did by taking in millions of so-called refugees... People think it might be dangerous if Trump has his hands on the nuclear arsenal... how is that any worse than giving nukes to our biggest enemy who daily threaten our extinction and Israel's extinction??? AND CRUZ was behind all these deals. We don't need him in the WHITE HOUSE. Lawyers are liars and he is not different than the rest of the lawyers around this country.","post_message":"Carly Fiorina: It's time to unite behind Ted Cruz: @webpagelink"},{"comment_id":"934978476568908","commenter_b":"Hahahahaha","commenter_a":"@username Jeff Smolen @username lmao","post_message":""},{"comment_id":"10154389291904614","commenter_b":"@username....Aka: RACIST!!","commenter_a":"I don't wanna sound racist but did you know 68% percent of rape is commited by African americans in los angeles spew on me all you want I got the statistic straight from the FBI website","post_message":"LAPD is looking for a man who tried to sexually assault an 80-year-old woman in her Hollywood apartment, leaving her in critical condition and still sedated due to her injuries.   The victim opened the door to the attacker after he knocked, apparently targeting her at random, police said. He pushed into the apartment and beat her, but she was \"feisty\" and able to fight him off, an LAPD captain said.  The man, who was caught on surveillance video, is described as a black man 25 to 30 years old, 6 feet tall, 220 pounds. He wore a black Penn State hoodie at the time of the attack."}]
