[{"comment_id":"480699562111924","commenter_b":"What a phony. She could care less about the working class. But she's got a lot of people fooled. Poor souls.","commenter_a":"Hillary has fought all her life for the common people Bernie just the last ten years, so I want Hilary over Bernie.","post_message":"This is something all voters should see."},{"comment_id":"10154449321726729","commenter_b":"Fuck u bitch.. I'm an Obama supporter and wouldn't say no shit.like.that.. FUCK U!","commenter_a":"You know what's amazing about Trump's supporters? They are so cult-like that if Donald Trump raped a little girl, his supporters would insist that's okay. They would say that she was probably asking for it. No true conservative supports Trump.","post_message":"BREAKING: The decision desk has now called the winner of Kansas..."},{"comment_id":"895076240539004","commenter_b":"Angela and Sheira close your fucking legs, Whores!!!!!!!!","commenter_a":"Unborn Baby's are Human at the time of conception.....Duh.....that's not hard to figure out. When you abort AKA MURDER a Baby at any time after conception it is very simple.....IT'S MURDER.....just watch our Court system when a drunk kills a pregnant woman they will be charged with the MURDER of the child as well. There are just some people that will argue against the facts to try to justify MURDER but make NO MISTAKE it's MURDER. Just because you get pregnant and it's inconvenient and you call it abortion, does not change the fact everyone knows in their heart IT'S MURDER.","post_message":"How cool is this?"},{"comment_id":"450455948478319","commenter_b":"Get off her fat butt and walk. That does not cost. Stop whining and exercise at home. Absolutely disgusting.","commenter_a":"Yet she has enough to do that fugly bozo the clown hair color","post_message":"Should All Welfare Abusers Be Arrested?  Comment 'yes' or 'no'."},{"comment_id":"10154139052147869","commenter_b":"Yes, she should move to Berkeley!","commenter_a":"Backward looking. When was the last time she looked in a mirror ...","post_message":"Another thing noticed in the Wikileaks release of the full transcripts Hillary Clinton’s paid appearances for Goldman Sachs: she described Republicans as “backward-looking” and fundamentally un-American.”  So in addition to being rednecks (according to Bill), people who don’t support her politically are racists, sexists, homophobes, xenophobes and Islamophobes; a “basket of deplorables” who are backward, irredeemable and fundamentally un-American.    So I have to wonder: why does she want to be the leader of all us horrible people?  If she hates everyone who disagrees with her that much, instead of running for President, why doesn’t she just run for mayor of Berkeley?"},{"comment_id":"10156149888525389","commenter_b":"Now they are coming over by sea they are still illegalls","commenter_a":"Oh Great,more people coming in !!","post_message":"A Miami Beach Police spokesperson said it is unknown how long the group were at sea."},{"comment_id":"769355346496407","commenter_b":"I am on Pam side screw the rest of them assholes.","commenter_a":"Bullshit she clearly antagonized this lame ass broad","post_message":"She believes she saved lives by hosting the contest."}]
