[{"comment_id":"10155598100226002","commenter_b":"Something white people started, after having intercourse with monkeys they would die from AIDS. Mosquitos was a bacteria form from their deceased corpes.","commenter_a":"Hmmmn,what's the next thing that will be killing us...SLEEP???????Always fear mongering and hysteria..","post_message":"Known to health experts as the most deadly animal on the planet, the minuscule mosquito, with its dreaded whine, is responsible for millions of deaths from multiple diseases each year."},{"comment_id":"920667494692972","commenter_b":"What a piece of shit","commenter_a":"PIG!!!!!!! If his wife had any sense of self worth and wasn't so bullied she would leave his sorry ass!","post_message":"And the saga continues..."},{"comment_id":"1155384687884221","commenter_b":"That's what you get for working for him.....I wonder if he ever payed the little girls who sang and danced for him for a rally","commenter_a":"Trumps motto : if you're stupid enough to trust me you get what you deserve.","post_message":"If you work for Trump, you're going to get burned."},{"comment_id":"10152588899470779","commenter_b":"Right girl","commenter_a":"Jarelie Anne McClusky can't fucking waiiiit","post_message":"Brett Morgen's documentary is more than just a must-see for Nirvana fans. It's an eight-years-in-the-making collective labor of love that offers a private peek into the artist's mind, from the first creative stirrings to the spiral downward. You don't just feel as if you've gotten to know the man better. You're left completely emotionally spent."},{"comment_id":"1765372970348268","commenter_b":"No she is a lier","commenter_a":"Feel free, one and all, to hit me in the head with something hard and heavy if you ever get wind of me agreeing with Hillary on anything.","post_message":"Hillary Clinton rebukes Senate Republicans for refusing to hold a hearing on U.S. Supreme Court nominee Merrick Garland, calling it \"low-minded politics\". Do you agree or disagree with her?"},{"comment_id":"908896759158872","commenter_b":"Us is what I recorded","commenter_a":"@username let's go to Vegas and stop off here!","post_message":"It one of the strangest motels you will ever visit  the Clown Motel, next to a grave yard in Tonopah, Nevada.  And if you don like clowns, or are afraid of ghosts, you may want to stop somewhere else.  Story: @webpagelink"},{"comment_id":"916716405122968","commenter_b":"@username your name says it all!","commenter_a":"someone needs to mention the senior citizens in this country. We have not had a COLA raise for two years. BS. We might be old, but WE VOTE!","post_message":"Miners have one last shot in this election - the coal industry will be nonexistent if Crooked Hillary Clinton wins the presidency this fall. It is time to MAKE AMERICA GREAT AGAIN!"}]
