[{"comment_id":"2180920135465808","commenter_b":"@username Where did you get that nonsense? She doesn't get a pension.","commenter_a":"Imagine if Michelle did this. They would say she doesn't love her country and she's disrespecting the The White House (as if that were a thing). Repugs are the biggest hypocrites ever","post_message":""},{"comment_id":"938211592934866","commenter_b":"Kick His Ass Anyway, besides it was one of Jesus's Crew","commenter_a":"Jesus says an Eye For an Eye. Someone down there kick his ass Please and Thank You","post_message":"Remember, nothing says \"Soldier for Christ\" like giving a child a black eye!"},{"comment_id":"10154039785538010","commenter_b":"Johnny Vega They saw an opportunity created by Democrats in the first place....who let all the illegals in? Democrats...why? So they could sick their KKK members on the Republicans and stage stabbings in Anaheim one day before David Duke ran his fat mouth. You don't know a setup when you see one?","commenter_a":"Interesting not once in the article do they mention the Political Party of the KKK. Democrat on Democrat violence...oh when will it end?!?","post_message":"In light of today's violent KKK rally in Anaheim."},{"comment_id":"933218310052361","commenter_b":"So how many snipers are needed to guard them from poachers?","commenter_a":"There's a herd in Florida too.","post_message":"Well, would ya look at that! (via TakePart.com)"},{"comment_id":"10156646291425093","commenter_b":"@username there is such a thing as legal immigration !","commenter_a":"You traitor establishment Repubicans are a discrase. Donald Trump for President of the United States","post_message":"Donald J. Trump wasn't against  interests. He was special interests -- and did his best to run people out of their own homes."},{"comment_id":"10154710318354062","commenter_b":"GTFOH... U don't own this planet girl!! GOD knows no borders right Angie? Get off ur high horse! Stop looking down n help another up!!","commenter_a":"what part of ILLEGAL do people NOT get??? GO HOME!","post_message":"Dozens of protesters have gathered on the University of Houston campus in advance of tonight's debate. Live team coverage coming up at 6."},{"comment_id":"10153434419026051","commenter_b":"How does such an ugly and lazy guy find that many women to breed with him.","commenter_a":"Can you say \"vasectomy\"..and a \"JOB\"","post_message":"This guy has 26 kids with 15 women and has been getting $50,000 per year in benefits. Now he’s getting a brand new special gift."}]
