[{"comment_id":"1129299917126536","commenter_b":"Hillary is the real war on women.","commenter_a":"Together we Move Forwards Vote to President @username 2016.","post_message":"In ten years, we can generate enough renewable energy to power every home in America. #EarthDay"},{"comment_id":"10154325852416323","commenter_b":"The woman is a perpetually grinning dimwit. She'll probably become PM.","commenter_a":"Fucking moron","post_message":"\"At least 50% of her public statements sound as if they were said for a dare. 'Let’s banish pessimists.' 'Boris Johnson is a lovely man.' The rest sound like she’s assembling endtimes magnetic fridge poetry.\""},{"comment_id":"10154886702384166","commenter_b":"We got a little here in Honea Path :-)☃","commenter_a":"got some in pelzer, they are haveing a blast in it!!!","post_message":"Sort of an encore performance of snow over parts of the Upstate just before 7 AM. Folks in Anderson could very well get a quick dusting out of this. Let us know if you do! We're on for another 2-3 more hours on FOX Carolina. -Ben"},{"comment_id":"946981455339195","commenter_b":"Lesbians...ya gotta love 'em, or give 'em to ISIS to be burned alive.","commenter_a":"Al Sharkton must go too!","post_message":"Well, that's one way to go out."},{"comment_id":"10153548183098984","commenter_b":"Unless you're Native American, almost all Caucasians have ancestors that were thieves, murderers, and rapists. Shall we remember our horrible history? Shall we remember how Caucasians forced their way through other's land? Shall we remember the genocide that occurred? Shall we remember public lynches? Shall we remember the Trail Of Tears? Shall I go on?..... Who are the TRUE criminals here? Caucasian ancestors FORCED their way through due to greed. Most other immigrants come to America to WORK to provide for their family. So I repeat, UNLESS you're Native American, you come from immigrants as well, possibly even illegal. You're ancestors (Caucasian), if they've been here since the 1700s or 1800s, could have been the murderers, thieves, and rapist roaming around tormenting innocent. An add-in...who will do super low-pay labor? Mexicans are hardworkers, even when we are living in severe poverty, we still try to WORK. Anyone who has common ...","commenter_a":"Donald Trump is to good for any of them....you can't tell a Liberal the truth","post_message":"Donald J. Trump just taught these guys trying to bully him a SERIOUS lesson on why you do NOT try to play hardball with The Donald!   Do you think he has more backbone than Obama?"},{"comment_id":"999642010128853","commenter_b":"Close the border! People that come to this country should not try to change it to suit their needs / religion. When they come here they should accept our customs and laws. If they don't like them.STAY THE HELL OUT! simple!","commenter_a":"Bullshit","post_message":"EVERYONE needs to keep this in mind tonight."},{"comment_id":"10153721123493132","commenter_b":"Just another hoe looking for her five minutes of fame smh","commenter_a":"Remember when it was shameful and embarrassing to be the other woman.","post_message":"She is no longer an employee of the family."}]
