[{"comment_id":"1240022466017781","commenter_b":"@username Yes, but less human.","commenter_a":"The correct term is undocumented immigrants. It is not right to say illegals. We are all part of the human race. As an American born citizen I say that Trump is wrong. Undocumented immigrants are very important to our work force. They work very hard. Some work harder than those born here. If we send all undocumented immigrants back it would put this nation under. Yes we have a immigration problem. But fix it the right way. Undocumented immigrants deserve a chance as we all do to live in a country like ours.","post_message":"Under the Eisenhower program, immigrants inside the U.S. were rounded up and deported to remote places, resulting in deaths and criticism of human rights abuses."},{"comment_id":"417366948387900","commenter_b":"Hey rhino you want amnesty, and the DOJ candidate Obama and Holder want , your one of five republicans and who would negotiate with a terrorist country ? In sorry you won the election here in SC , your a R HINO ,","commenter_a":"Good point ...........we should be negotiating with Iran!","post_message":"Lindsey Graham has some harsh words for Rand Paul."},{"comment_id":"1247431258610235","commenter_b":"Shut Up!","commenter_a":"Black guy shoots a white guy who was trying to help a female. Sad. When do the riots start?","post_message":"SHOOTING CAUGHT ON CAMERA: New Orleans police are searching for the man shown in this video shooting a med student who was trying to stop the suspect from allegedly attacking a woman. The suspect can be seen shooting the student in the stomach after a verbal confrontation, and then attempting to shoot him again when his gun appears to jam. Read full story: @webpagelink"},{"comment_id":"1212512528838103","commenter_b":"STFU already! Hillary lost because she's Hillary. Get over it!!!","commenter_a":"Trump can't make an honest or decent response to anything.","post_message":"Trump’s Latest Twitter Tantrum Desperate Distraction From Tuesday’s Stunning Revelation.  It’s likely not a coincidence that the President-Elect is rehashing won battles after Tuesday’s breaking news that FBI Director James Comey likely acted favorably towards Donald Trump with his October announcement that new evidence emerged in the Clinton email investigation.  Read the whole story at Reverb Press HERE: @webpagelink"},{"comment_id":"10153391185232217","commenter_b":"Lol. First...there are,a lot of people that doesn't know who she is. I personally have seen some of her exploits, but wouldn't recognize her voice. And second most that do follow her \"music\" doesn't care what she does. Nobody gets mad at strippers. Nobody expects her to be smart...just dress in as few clothes as is legal and shake that azz. And lastly...the demographic that was knowledgeable enough to be outraged...went to work.","commenter_a":"Silly racist white people!!!","post_message":"They really weren't happy about Beyoncé's Super Bowl performance, calling it \"racism\"."},{"comment_id":"10153030983541051","commenter_b":"I would sue tjat fucking bitch and that guy","commenter_a":"Soooooo?! Why was that day different from any other?","post_message":"This woman turned to the Border Patrol officers and said: What are you going to do, arrest me? Turns out, they had something else in mind."},{"comment_id":"10153824664946336","commenter_b":"Just like Starbucks, learn to cook woman","commenter_a":"So many people falling for this. Of course the government wants everyone against Chipotle, because it's the first popular public chain against GMO's, which makes the government food companies look bad. I'll still be eating at Chipotle; everything they serve is still way better for you than the majority of fast food restaurants.","post_message":"The Chipotle Mexican Grill stores can open after they replace all produce, do a deep cleaning of their stores, pass a local health inspection and start a new protocol for cleaning produce."}]
