[{"comment_id":"1325297067482547","commenter_b":"Means nothing! That's why it took him so long to release it. It had to be all set up. Duh!","commenter_a":"Unfortunately not true. The BC was a. Latent forgery and Trump said before there were serious questions about it. He should have sidestepped the issue. Hillary always does.","post_message":"Trump senior communications adviser, Jason Miller, had said the issue already was closed, as far as Trump was concerned.   2011, Mr. Trump was finally able to bring this ugly incident to its conclusion by successfully compelling President Obama to release his birth certificate.  Miller statement continued,  successfully obtained President Obama birth certificate when others could not, Mr. Trump believes that President Obama was born in the United States.  He added, . Trump did a great service to the president and the country by bringing closure to the issue that Hillary Clinton and her team first raised."},{"comment_id":"10152950210572169","commenter_b":"Clearly this woman lost her remote control long ago","commenter_a":"I will be glad when he is gone","post_message":"Saying goodnight to stupid pet tricks, top 10 lists and David Letterman (From PBS NewsHour)"},{"comment_id":"516585565198690","commenter_b":"Leave America, why are you here? Go back where you belong, we don't want you.","commenter_a":"Ship them all back to the hell hole they came from. We don't need or want them.","post_message":"This state just voted to ban Islamic laws… Good.  We won't stand for Shariah in America and neither should you.  Do you support banning Islamic laws in all 50 states?"},{"comment_id":"624034747748270","commenter_b":"GO Hillary!","commenter_a":"I'm a republican but I'm pretty sure Hillary just earned my vote on the fact that Ted dropped out. Trump is a no go for sure!","post_message":"Donald J. Trump is the presumptive Republican nominee. Chip in now if you agree we can't let him become president: hrc.io/1SL1LgJ"},{"comment_id":"10154302113081509","commenter_b":"She had them surgically removed. She also doesn't have a brain or even a modicum of decency. And THAT is why she's running for office! Hellary 2016!","commenter_a":"Hillary would you like to have your husband also in prison ? Or else a dildo is enough ?","post_message":"Hillary Clinton had a message for a supporter's father who is backing Donald J. Trump"},{"comment_id":"10156594295450354","commenter_b":"She is a mental pig.","commenter_a":"Because you are a dog","post_message":"Feminism 2016 Style...  “It’s policy. Teddy Kennedy, remember Chappaquiddick?… I mean, a girl drowns and he abandons her, and [s]he drowned, and women still voted for Teddy Kennedy. Why? Because he voted for women’s rights. That’s why. That’s the bottom line of it in my opinion. I mean, I don’t like either one of them, to tell you the truth, Teddy or Bill. They’re both dogs, as far as I’m concerned. But I still will vote for Bill Clinton, because he votes in my favor.”"},{"comment_id":"10154375635804342","commenter_b":"@username oye pendeja....white girl....give it a rest!","commenter_a":"As long as Trump doesn't show up, I don't see the problem. He can't help who supports him, just like Hillary can't help that all her supporters are cry babies.","post_message":"One of the largest Ku Klux Klan groups in America plans to celebrate Donald Trump's election with a parade."}]
