[{"comment_id":"10153640202729740","commenter_b":"check the last couple of videos I put up here.","commenter_a":"If cops weren't being abusive, murderous filth, then people wouldn't be this worked up...","post_message":"Protesters were captured on camera yelling \"pigs in a blanket, fry 'em like bacon\"."},{"comment_id":"10153937111420695","commenter_b":"Girl you got something to be thankful.","commenter_a":"God bless","post_message":"“Everybody at the church got up and started handing the preacher money, and it was just crazy. So many people got up. They started hugging me. It was just awesome. I couldn’t help but cry. It was just amazing,” the mom said."},{"comment_id":"626166684240577","commenter_b":"She is a idiot ass","commenter_a":"She always does that is why nobody watches the show the POS is on.","post_message":"Whoopi Goldberg made a sad attempt to play the race card, big mistake. What liberal filth. She needs to be taken off TV. Are you tired of liberal trash polluting the media?"},{"comment_id":"1452361001456073","commenter_b":"Fuck Trump he is a real dangerous piece of shit he must be taken down at any and all cost do whatever you can to make sure this ultra right wing low life piece of garbage does not become President. Trump do us all a favor die soon asshole.","commenter_a":"Nice pose for his new Facebook picture!!","post_message":"He got TORCHED on twitter."},{"comment_id":"10153189927841336","commenter_b":"Mike.... yes all ILLEGALS should be deported.... We have immigration laws which are not being followed... We have a system for people who want to become citizens so I do not support those who break the laws of this country and expect to reep the rewards of citizenship off the backs of the American taxpayer...","commenter_a":"ACLU is out of their minds... abortion is murder!!! illegals need to be deported PERIOD...","post_message":"“The Catholic Bishops are taking millions of dollars in federal grants and then imposing their beliefs on this vulnerable population… that raises serious concerns under the separation of church and state provision in our Constitution,” said an ACLU Nationwide attorney."},{"comment_id":"10156113293015725","commenter_b":"all you haters can eat a bag of liberal dicks!","commenter_a":"That's okay - Presidents don't have time to run Celebrity Apprentice! You will be busy saving our country!","post_message":"Congrats to my friend Arnold Schwarzenegger who is doing next season’s Celebrity Apprentice. He'll be great & will raise lots of money for charity. To all my fans, sorry I couldn’t do The Apprentice any longer— but equal time (presidential run) prohibits me from doing so. Love!"},{"comment_id":"10153523399935329","commenter_b":"And a lets get a pug","commenter_a":"@username I want a bear","post_message":"THIS GUY!"}]
