[{"comment_id":"10154475125548812","commenter_b":"STOP GLORIFYING THIS RAPIST POS.","commenter_a":"I don't think it's real remorse probably embarrassment. Which is great. So it means that the power of social media is effecting thing Even the Vice President commented eloquently. So keep it up share this post pictures and sign the petitions","post_message":"Women who provided character witness statements for the Stanford University swimmer convicted of sexually assaulting an unconscious woman on campus are expressing regret for supporting him."},{"comment_id":"760686517397260","commenter_b":"Stephanie Hathcox","commenter_a":"John Rivera","post_message":"In case training your dog to shake hands weren't impressive enough."},{"comment_id":"10154048881589753","commenter_b":"They both need to be charged she was sorry as hell to let him do that your kids come first","commenter_a":"I sure hope they don't place that child back with her. Lock her up until she is too old to bear any more kids. Where are the Fathers nd Grandparents of these abused kids?","post_message":"An Arkansas mother and her boyfriend were taken into custody and charged with first-degree domestic battery after the woman’s four-year-old daughter was found zip-tied to her bed, reports KTLA. Jennifer Diane Denen, 30, and her 47-year-old live-in boyfriend, Clarence Eugene Reed, both residents of Hot Springs, were taken into custody last week after a staff member at the Cooper-Anthony Mercy Child Advocacy Center found Denen’s daughter to be severely malnourished and abused, according to The... @webpagelink"},{"comment_id":"10153822554726800","commenter_b":"Linda you sound like a true feminist. If feminist hated all women who dressed nice and looked pretty. She is an attractive woman. I won't comment on her alternative income or employment. Selling your vagina to make money is about the most American and feminist thing I can think of. It's like eating an apple pie with a slice of American cheese on it that was baked by a bald eagle complimented by a nice mason jar of Kentucky moonshine.","commenter_a":"If President Obama needed a raw onion in the podium, what was John Boehner's excu.. er, where was his raw onion stashed the millio... um...many times he cried over far less than dead kids?","post_message":"Andrea Tantaros on President Barack Obama's tears during his speech on gun violence: \"I would check that podium for, like, a raw onion or some no more tears. I mean, it's not really believable.” @webpagelink"},{"comment_id":"10154559728153812","commenter_b":"@username He has lead our country in more debt than any other presidents He doesn't give social security costs of living raise in 3 years He's letting illegals into our country without being vetted He's trying to take guns away","commenter_a":"You Americans, I can't believe how you can produce great leaders like Obama and then still show up with Trump for the next elections.","post_message":"Donald J. Trump on #Dallas: \"This isn't the American Dream we all want for our children.\" abcn.ws/29mnwVr"},{"comment_id":"903394569805665","commenter_b":"Blow them out of the water.","commenter_a":"Ok ok this time only send them $20 million","post_message":"New Video: Four ships belonging to Iran's Islamic Revolutionary Guard Corps (IRGC) \"harassed\" an American destroyer in the Strait of Hormuz Tuesday, a U.S. Navy official confirmed to Fox News. @webpagelink"},{"comment_id":"615120388649797","commenter_b":"I don't think it should be considered treason, I think it IS treason. How do you Snopes check this? And where is the link to the Washington Post article?","commenter_a":"Guys we have no choice. They are so advanced we have no choice","post_message":"This should be considered treason."}]
