[{"comment_id":"10153999668791756","commenter_b":"Rapists and murderers... Yeah, idgaf about them. Kill them right away and stop wasting tax payer money.","commenter_a":"Not only 27. 27 too many. How many people were proven innocent after decades of being in jail?","post_message":"\"We get it wrong sometimes, and in the death penalty, we just can't get it wrong.\""},{"comment_id":"982881765080578","commenter_b":"I hope so how can that woman even sleep much less lead a country would she do that to all Americans how can anybody vote for her","commenter_a":"I look at this picture and am reminded of the horrible torture this man endured, before his death, and wonder what really happened and who was responsible for not seeing the embassy was secured for their safety. It may not matter to Hillary, but it does to us and the the family members of those who died.","post_message":"Could we finally bring Hillary to justice?"},{"comment_id":"841598805896172","commenter_b":"Ok. And then we Will kill you and take OUR White House back !!!!!!!!","commenter_a":"Nah....he'll invite you in.","post_message":"Who has Obama betrayed the most, us or them? Uh oh...  ~Bandit"},{"comment_id":"10154154214551509","commenter_b":"Hahahahaha","commenter_a":"All I know is, if I ever overdosed in a whorehouse and my wife and my mama found out, skip the cpr. I am better off dead.","post_message":"After ex-NBA star Lamar Odom was found unresponsive in a brothel owned by Dennis Hof, the reality TV star swung into damage control mode.  \"My business is built on privacy and discretion,\" he said. \"But when the ambulance pulls out and five minutes later TMZ calls me, you have to deal with it.\""},{"comment_id":"885087015015208","commenter_b":"She needs to move on and except defeat u fucking scumbag criminal","commenter_a":"Yes","post_message":"What a sore loser. She needs to come grips with reality. Are you glad Hillary is not going to be our president?"},{"comment_id":"1131610686905195","commenter_b":"@username back your claims up with citations and credible sources! @webpagelink","commenter_a":"Bernie says it best, \"You've got some middle class people working longer hours for lower wages -- they pay their taxes, they support their schools, they support their infrastructure, they support the military. But the billionaires? No, they don't have to do that, because they have their friends on Capitol Hill. They pay zero in taxes. So Trump goes around and says, 'Hey, I'm worth billions, I'm a successful businessman. But I don't pay any taxes. But you, you make $15 an hour? You pay the taxes, not me,'\" he said. \"That is why people are angry and want real change in this country.\"","post_message":"Millions of Americans work hard and pay their taxes. So why doesn't Donald Trump pay his?"},{"comment_id":"1102034899855986","commenter_b":"You all want a Muslim hater so kinda breaks out even don't you think?","commenter_a":"Fuck 'em.","post_message":"American Islamophobes are beside themselves because human rights activist Sadiq Khan was elected mayor of London."}]
