[{"comment_id":"10154065307955329","commenter_b":"I leave my sweat for the next guy/gal so they can draw strength from my juices. Welcome.","commenter_a":"And how long are you supposed to wait before you wipe it down after you use it? Dear people that leave sweat stains on the machines and don't wipe it down after they're done, screw you.","post_message":"Pump some iron or nap? Nap."},{"comment_id":"1074511882569822","commenter_b":"You cared enough to comment","commenter_a":"Needlessly inflammatory and untrue. Time to unlike.","post_message":"Nearly a century later, Einstein has been proved wrong."},{"comment_id":"10156367673320725","commenter_b":"@username pull your pants up","commenter_a":"This Latina and my family are voting for Donald Trump all the way to the white house!! Yay for me!","post_message":"I will NOT let America down! Thank you for your continued support of my presidential campaign. Together, we can all #MakeAmericaGreatAgain! #Trump2016"},{"comment_id":"885881534804929","commenter_b":"That what she said.","commenter_a":"Her neck looks like huge lips.","post_message":"She shared explicit messages and pictures with pupil after the schoolgirl came out to her"},{"comment_id":"10157698667015354","commenter_b":"Oh dam black bonnet girls make the rocking world go round!!","commenter_a":"Rumspringa. @webpagelink","post_message":"Here's a headline you don't see every day..."},{"comment_id":"10153711323820695","commenter_b":"Girl, STOP!","commenter_a":"A true example of faith. My prayers go out to him and his family. They'll get what they deserve, evil doers do not prosper.","post_message":"FORGIVENESS: That's what the wife of a man shot during a home invasion is expressing as her husband recovers."},{"comment_id":"661111504079428","commenter_b":"They are eat up with the dumb ass !!!","commenter_a":"Whats amazing is that I know a lot of people that just love obama. What's the matter with peoples these days ???","post_message":"This group of police officers destroyed Obama, this is hilarious.  Great. We completely support these officers.  Do you support their stand against Obama?"}]
