[{"comment_id":"760258614149329","commenter_b":"She need to be grabbed by the pussy","commenter_a":"Agree! Stop whining you liberals!","post_message":"Nicole Kidman: “I would just say he’s now elected, and we as a country need to support whoever the president is, because that’s what the country’s based on.”"},{"comment_id":"724979780984130","commenter_b":"Let's not forget that the woman also has to spread her legs.","commenter_a":"I have been saying this for years. The whole thing starts when a man can't keep it in his pants. He has no business telling women what they should or shouldn't do.","post_message":"Let me share a piece of myself. Yours truly was abandoned as a newborn by a man who now he is 100% against abortion. I guess me being taken to Arkansas and being raised by an abusive stepfather (and the first few years in a shack with an outhouse and a well for water) was OK. I appreciate that I had a chance at life. But you men who think you can make decisions for women? STFU. Now.  ~tiff  via Occupy Democrats"},{"comment_id":"10153076463414753","commenter_b":"If a woman in a bikini top was eating, would you also become this aggressive and immature ?doubt that very much. Grow the hell up.","commenter_a":"and why should we have to move our seat, or \"look away\"? we pay our money for a peaceful meal, not a side show!!!","post_message":"A woman in a cafe was nursing her child when she was approached by a man who asked her to cover up. That's when the cafe owner stepped in and had a few choice words to say."},{"comment_id":"947408295386760","commenter_b":"Jill has sexy legs","commenter_a":"Commies","post_message":"\"For my brothers and sisters that supported Dear Brother Bernie Sanders - this is the next step. This is the Green step. It is the progressive step. It is to stay on the love train. Justice is what love looks like.\" -Dr. Cornel West"},{"comment_id":"713646192159292","commenter_b":"Illegals wait in line like the rest.My dad came from Mexico when he was 5 years old the right way.He fight in WW2 in the Philippines.When we grew up we only spoke English.My dad said we are Americans.Every nationality has to wait in line.We can say this and that about are country but,this is the greatest country to live in.Citizens have to get off welfare get get a job.Stop being lazy,so illegals won't find work he.Government has to do there job.Find company's that higher illegals.God bless America land of the free.","commenter_a":"Seems simple enough- whatever happened to common sense?","post_message":"Share if you agree."},{"comment_id":"665234353646282","commenter_b":"Can't make a silk purse out of a sow's ear.","commenter_a":"#klasssa 👌","post_message":"Do you think the Obamas represented America with class as our nation's First Family?"},{"comment_id":"10153273876007377","commenter_b":"Lady!!1 It's Jail time !!!","commenter_a":"She is a LIAR and TRAITOR.","post_message":"This is a clear violation of federal law that has put these agents in harm's way."}]
