[{"comment_id":"10153669606379060","commenter_b":"@username - my point is that Germany is too influenced by its past, too ready to apologize for its past. In the 90s, the extreme right-wing Republikaner and the DVU gained in support because of this blind open-door policy. What is more, Germany expects other EU countries to do the same, irrespective of the cost. I say that this has to stop.","commenter_a":"The Germans typically let in loads of war refugees. More than they can handle. It's their way of apologising for World Wars 1 and 2. In the 90s, they let in 320,000 war refugees from Yugoslavia. What happened in German towns ? Property rents skyrocketed and the crime rates went right up. What's worse, the Germans expect every other country to do the same. Whacky open-door immigration. The UK needs to leave the EU, get sovereignty over its borders and immigration / refugee legisation back and tackle the problem as a single nation. This time, the Germans are letting in 800,000 war refugees from Syria. Absolutely crazy.","post_message":"Ever since Angela Merkel took the lead on the migrant crisis, critics began speaking as though she created it. This is nonsense"},{"comment_id":"10153787170708338","commenter_b":"@username would you like an A for English ? You got the picture right? That's all that matters, just for you I'll make it politically correct Lose!!!! Here you go","commenter_a":"Round the gangbangers up, they need to see what it looks like to lose an innocent child!!! Round them up and have them put in detainee prisons and ship they butts off to a open area so they can be at war with each other so that Chicago can live in peace!!! No need for burials and insurance just leave them right where they lay!!!! This is truly sad , this baby won't see thanksgiving or look forward to the surprise of his favorite gift on Christmas","post_message":"Visitation for 9-year-old Tyshawn Lee is being held today at Haven of Rest Missionary Baptist Church. CBS2's Mai Martinez will have a live report at 5:00 PM."},{"comment_id":"10154757524712300","commenter_b":"booooooooooooohooooooooooooo","commenter_a":"Got eeeem","post_message":"Anti-Donald J. Trump protesters gather at Bayfront Park (may contain graphic language)"},{"comment_id":"10152888898915496","commenter_b":"But... But... Gay marriage is destroying straight marriage! @webpagelink","commenter_a":"Brenda. I believe that you are right in some of your thoughts. I don't delieve we should judge people. However we are definitely called to judge actions. In the case of same-sex marriage to support same-sex marraige is to supoort something that goes against the Bible's definition of marraige. Same-sex marraige is social, cultural, and traditional. Social, cultural and traditional acceptance will change with time but Biblical truth does not. Therefore I believe that we are to love everyone but support what is right in the eyes of the Lord.","post_message":"Brenda Wood 11Alive looks back at the fast-moving and historic events of last week in Monday's Last Word -- \"Same-sex marriage: Judgement Day.\"  More Last Words: @webpagelink"},{"comment_id":"10153024604841037","commenter_b":"Black people should pay more TAX","commenter_a":"Poor Bill, women coming from everywhere trying to get a payout. I believe you Bill.","post_message":"A model who claims #BillCosby assaulted her at the Playboy Mansion met to pursue criminal charges"},{"comment_id":"349180888539647","commenter_b":"Yeah, women's lib.","commenter_a":"I'd rather have her NOT have a romance - I thought that was the whole point!","post_message":"The hashtag #GiveElsaAGirlfriend began trending as many Twitter users voiced their support for a gay character in the Disney movie. What do you think?"},{"comment_id":"10153283527870950","commenter_b":"This BITCH makes me sick","commenter_a":"She should be treated as she treated this poor child.","post_message":"The 11-year-old girl's cousin told investigators that the young girl had a medical condition that caused her to lose control of her bladder and bowels. A family friend said the woman was upset that her daughter had the condition, and liked to keep the house spotless with bleach."}]
