[{"comment_id":"1024492464317039","commenter_b":"@username, we can send all illegals home and we'll start with you! Mexican Americans/Native Americans are the only people who this land belongs to. So dip","commenter_a":"Where's the mom so she can start putting graduation pictures up and say that her kid never did anything wrong that he was a good kid and never did drugs Ill be waiting","post_message":"NEW VIDEO: #Chicago police have just released dashcam video that shows a female cop being beaten by a man who was high on PCP. (WARNING: Video is very graphic and has inappropriate language) @webpagelink"},{"comment_id":"10153373131878352","commenter_b":"How about us mothers teach our daughters how to take care of themselves and to love their own skin. A little girl will look to her mother for what a woman is and how to act. When you are body obsessed, your daughter will pick up on it. If you're working out, eating decent, and taking care of yourself, she'll pick up on that also.","commenter_a":"The stretch marks are redic. She looks like a Plane Jane. I'll go ahead and keep buying Barbies for my little girl if this is the only other option. Healthy self image starts at home, not the toy store. A for effort, C- for the execution. Please go back to the drawing board.","post_message":"She’s got stretch marks, brown hair and a fuller figure… now Anti-Barbie fashion doll Lammily stars in ad tackling women’s obsession with the perfect bikini body"},{"comment_id":"10154096917590329","commenter_b":"Grade 6 gym class. Ran face first into a cement wall during a game of dodgeball. I had two black eyes, one of which was swollen shut, and a nasty bump on my forehead. Our picture day was the following week. Best school picture ever!","commenter_a":"Jon Maloney you could add a story to this","post_message":"LOL"},{"comment_id":"10155472847782178","commenter_b":"This about sums up his platform. To bad his plans don't include everyone. Especially when it comes to healthcare. Did you know that if Obama care is rebuild and replaced if you have a pre-existing condition then you cannot get medical coverage just like before during the Bush administration","commenter_a":"Truth! Dirty Donnie is playing us like a fiddle! All about him so he can make $$$$! He is not FOR anything but himself! Do you really think he is for you blue collar workers or the struggling middle class? Once he gets what he wants, he'll throw you to the gutter like a piece of trash. He is all about the $$ going into his pocket. His \"plan\" would put the workers back into the industrial age. Company town and company store, no unions, no rights, keep your mouth shut and just maybe you won't get fired, thrown out of your home, and dumped on the street! Tax cuts for the rich and everyone else can pay for it. Build a personal defense for to consolidate his power, throw opponents in jail, purge the government of the opposition,and align himself with his buddy Putin! Run away from NATO allies ...","post_message":"Donald Trump's priority today is clear: His personal brand and business."},{"comment_id":"10154831956721350","commenter_b":"Isn't she supposed to be in Canada?","commenter_a":"why is she here? I thought she was leaving the country?","post_message":"WATCH: We love Amy Schumer's powerful message to body-shamers! @webpagelink"},{"comment_id":"1189675974461986","commenter_b":"@username she will not loose","commenter_a":"The real problem is Bernie Sanders is NOT a democrat! No wonder he and democrats are having a problem. He should have run on his own party-- as the socialist he is.","post_message":"It's not just the Republican Party that seems to be having a problem uniting..."},{"comment_id":"629437257246853","commenter_b":"All I can say she is a stupid bossy bitch. Wtf they need to be kicked out of the whitehouse on their ass and put in prison all the laws they have broken. Don't know why they haven't impeached him yet. It's not racist.","commenter_a":"ugly worthless nigger","post_message":"You'll never guess which word Michelle is trying to ban.  This is ridiculous. Michelle needs to be booted OUT of the White House immediately.  Would you be happy if Michelle was kicked out?"}]
