[{"comment_id":"10152833385031749","commenter_b":" .","commenter_a":"You are right Brent!","post_message":"\"America’s resurgence is real. And now that we’ve got some calmer waters, if we all do our part, if we all pitch in, we can make sure that tide starts lifting all boats again. We can make sure that the middle class is the engine that powers America’s prosperity for decades to come.\" —President Obama  Watch the weekly address: @webpagelink"},{"comment_id":"10153506659437964","commenter_b":"There are those who useabortion as a contraceptive. I know a young lady who had so many that when she got married & wanted a baby, she couldn't have one. Turned into an alcoholic.","commenter_a":"I thought Obamacare was going to take care of the poor...the ones who couldn't afford health insurance...so why do they need planned parenthood?","post_message":"On Monday, we'll be voting to eliminate federal tax dollars going to Planned Parenthood. I can assure you I'll be voting 'yea.' #preauxlife"},{"comment_id":"650058555184723","commenter_b":"If they prove he's here under false terms. He an illegal. Hell yes deport him. Send him 2 where he could B put in jail. What a smear on the face of America.","commenter_a":"Would be great if this were true & a Blessing to the USA.","post_message":"Obama to be removed this country after justice department lawyer does this.  Get rid of him. He doesn't deserve to stay in this country.  Do you agree Obama should be deported?"},{"comment_id":"10153986223919087","commenter_b":"Trump is NOT a BS. Let's make America GREAT and SAFE again. Hillary is a liars just want the votes from the black and illegal immigrants. She just say whatever you all want to hear to get your votes. WAKE UP AMERICA!! US Citizen. Love USA!! Go Trump 2016 !!!","commenter_a":"Let's make America great again!.Hillary is a liars. We are people choice, love this name. His name is Donald Trump 2016.","post_message":"#BREAKING: “I will not be voting for Donald Trump for president,” Republican Sen. Susan Collins announced Monday."},{"comment_id":"10154551617736336","commenter_b":"Voting TRUMP, you dirty COMMIE BSTD... Only people like you get filthy rich off our flesh and blood! New WORLD ORDER NUT JOB","commenter_a":"This coming from a PURE MORON.","post_message":"Speaking in Austria, European Union chief Jean Claude Juncker said, “We have to fight against nationalism, we have the duty not to follow populists but to block the avenue of populists.\""},{"comment_id":"10154448995838812","commenter_b":"@username what makes her uneducated?","commenter_a":"And people seriously want to elect him president?!? Get a clue!!!","post_message":"New York's attorney general says he won't be deterred in pursuing the state’s case against Donald J. Trump and Trump University, just because the defendant is campaigning to be President of the United States."},{"comment_id":"10153689476229411","commenter_b":"^your a dumb bitch lol","commenter_a":"Neo nazi sentiments are riseing in europe includeing islamaphobia and alittle anti semetic retoric. This is a reality. I dont care if u agree or dont its happening. People say get rid of the immigrants that have refugee status and those fleeing war zones and this intolerance will end. No it wont. This is a deep rooted problem of european ethnic supremacy masked. Its disguised well and they sure convince alot of people of there philosophy from people like madam blavatsky. And her race based ideology. Whats fueling race and ultimately religious intolerance is low birth rates from the native peoples of europe so they blame immigrants even tho the state subsidizes births in europe. Neo fascism is gaining ground because of this wacky race based fear and economic troubles. So the nazis are mixing both messages pointing it at immigrants and they do get violent. They dont only want ...","post_message":" is disrespectful is the political reality in Europe that people, suffering so greatly hand, over thousands of euros and must take such unsafe routes while for the rest of us Europeans it is so easy  to travel in the other direction\""}]
