[{"comment_id":"10153321708401955","commenter_b":"She does have Huma.","commenter_a":"Even Hilary needs a man once in a while !","post_message":"Hillary allows men at 'women-only' event amid weak turnout..."},{"comment_id":"10153242802786336","commenter_b":"She needs to step down. Bad form lady!","commenter_a":"recue her self all the way back to college, and stay awake the second time around , , and learn the law. don't judge out of hate to please your president and holder ,and al.","post_message":"Defense attorneys representing six Baltimore police officers charged in the death of Freddie Gray filed a motion to have the case dismissed, or for the city’s top prosecutor to be replaced."},{"comment_id":"10154438861719726","commenter_b":"While I can understand the basis for some of these observations, the main thing I firmly believe is that perhaps just over half the Democrats who actually voted for Obama in the last election will turn out to vote this cycle. I do not see near the support, energy, emotion, or urgency that I saw in the last two Obama campaigns, and lets be honest here folks... Hillary Clinton IS NOT barak obama. She does not have the well-oiled campaign machine Obama had. All she has is a character-assassination campaign, that's it, and it's exactly what I expected from her too. It honestly would not surprise me if Trump carried a lot of the swing states simply because democrat voters know she's a damaged candidate. Add to that that about half of the Democrat voter bloc in play this cycle was Bernie Sanders supporters of which many of them won't ...","commenter_a":"HIllary doesn't want to talk about the issues because she has no plans except what Obama has told her to say.","post_message":"This is the strategy Trump can use to defeat Clinton:"},{"comment_id":"693308824147234","commenter_b":"and being hoes..laaag","commenter_a":"This shit here is crazy. All week we been talking bout Kylie like she beyond famous. Her family is known for fucking and being hoes. Malala opens up a school and nobody don't say nothing the worlds view point on things is fucked up.","post_message":"Quit making stupid people famous."},{"comment_id":"1790704097809032","commenter_b":"Pssst when's the last time the KKK has assassinated a cop in the streets? When's the last time the KKK burned down and looted their own towns? Who do you think BLM are voting for? Btw, do a Google search of who created the KKK. Democrats. Who freed the slaves? Republicans. Who passed a law allowing blacks to vote? Republicans. Who's the only candidate that voted against Civil rights? Hillary when she was a Goldwater.","commenter_a":"Yes. Except it is his supporters who are the real embarrassment. Buying into the lies of this conman. Feeling empowered, the violent white national (KKK) movement is showing itself in daylight. Embarrassment is not a powerful enough word.","post_message":"Yep.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1112148695548048","commenter_b":"Imagine if Hillary did all the finger wagging that Bernie does in debates?","commenter_a":"Men can get away with anything this election season that women (Hillary) could not. Waving their arms, swearing, making fun of people...anything goes.","post_message":"Social scientists have found the exact same affect by a woman simply doesn’t play the same way."},{"comment_id":"10154394102516336","commenter_b":"So true having spent tons of time over there for many years it has changed to be almost unrecognizable sad that my grandkids will never know how wonderful London and England was","commenter_a":"We are next. TRUMP will win.","post_message":"“I think that the British people have had it. They fear terrorism just as the American people fear terrorism.”   Bill O'Reilly breaks down #Brexit, saying it’s not about economics but rather immigration. @webpagelink"}]
