[{"comment_id":"659791487492443","commenter_b":"yes but he is treating America Badly, Screw him,","commenter_a":"Stop talking about obama, you shoul start building for the vets they deserve it, and you can do it Mr, Donny","post_message":"President Obama looks and sounds so ridiculous making his speech in Cuba, especially in the shadows of Brussels. He is being treated badly!"},{"comment_id":"712674415565701","commenter_b":"Fuck off you nasty hoes.","commenter_a":"Her tale is just the beginning...there's getting ready to be an avalanche of women coming forward...","post_message":"\"His hands were all over me. It was an assault.\" Here, Jessica Leeds of New York tells how a three decades ago Trump raised the armrest separating their seats on a plane and reached up her skirt.  Video by Occupy Democrats, LIKE our page for more. Credit: New York Times."},{"comment_id":"10154272601268525","commenter_b":"How stupid are those girls...their on camera now...lol","commenter_a":"Shane Ornelas","post_message":"HULK HOGAN ROBBED: Not even the iconic wrestler's home is safe from holiday package thieves!  STORY: fox10phoenix.com/entertainment/@username-story"},{"comment_id":"10153285964496749","commenter_b":"White Americans are sexy","commenter_a":":P","post_message":"Add your name if you support the Clean Power Plan—the biggest step America has ever taken in the fight against climate change. @webpagelink"},{"comment_id":"10153539515518984","commenter_b":"The Feds own substantial acres of land in several of these states and when they pass these more restrictive rulings guess what? They exempt themselves from said compliance AND if they choose to return some of said land to the state, guess what? The state is forced to bring land into compliance. Tks AZ for joining with the 26 sister states in this fight.","commenter_a":"It gets worse and worse and yet our congress , senate, supreme court , fbi ,cia all seem afraid, They do not represent the people.","post_message":"These 27 states just made an epic move against Obama's federal power grab... they are not going to let Obama take over their states without a fight.  This is exactly the right move... share their strategy everywhere."},{"comment_id":"10153122884761130","commenter_b":"This article suggests I'll never find a smart woman to have kids with. That's disheartening","commenter_a":"Hmmmm.....","post_message":"As if being a woman is just about having kids."},{"comment_id":"10152906505382169","commenter_b":"Fascist pigs always think they'll be spared by the police state for being boot licking authoritarians. Never really works out that way though.","commenter_a":"America is a complete mess right now because of the Flower Power Generation, Obama, and liberal lunatics. Way to go, @username, just fanning the flames even more with this story. I'll be glad when the Flower Powers die off and we can have America normal again.","post_message":"TONIGHT: Return to the most divisive moment in American history since the Civil War, and witness the mayhem that followed the Kent State shootings.   THE DAY THE ‘60S DIED airs at 8/7c on PBS as part of a special programming block commemorating the Vietnam War. #VietnamPBS Learn more: @webpagelink"}]
