[{"comment_id":"10153190295751336","commenter_b":"Nothing better than a HOT conservative woman.","commenter_a":"Looks like the Catatonic Parkway. No cowboys in that area, maybe a few cowgirls, but they ride English.","post_message":"Fifteen buffalo who escaped an upstate New York farm have been shot and killed."},{"comment_id":"10153376364371770","commenter_b":"These leftist thugs should go get jobs!","commenter_a":"Look at them. You can tell they are all scholars, have jobs, homes, and a lovely life. LOL.","post_message":"Protesters disrupted several of Donald J. Trump's events over the weekend."},{"comment_id":"1746704652254245","commenter_b":"Wow really Michelle Pugh, you put yourself in that situation for sleeping with her father\" a married man: but you won't tolerate public shaming Really looks like an excuse to try to squeeze money out of someone which is his daughter SMH say;s a whole lot of type person you are!!!!!!!!! No class!!!!!!!!!!!!!!!!!!!!","commenter_a":"Nasty is all I can say","post_message":"Michelle Pugh's life has changed dramatically in the short few months since her four-year affair with Ozzy Osbourne was revealed."},{"comment_id":"10154248049506337","commenter_b":"Chevy only beats up womens self esteem which is better I guess. Do your research.","commenter_a":"Chevy is awesome leave him alone. Seagal is a little bitch that beats women. He's hardly even a celebrity. Chuck Norris should round house his ass.","post_message":"WHEN THE HOT SEAT GETS TOO HOT... From Chevy Chase to Steven Seagal, these celebs just couldn't handle getting roasted. Check out 'Comedy Knockout' on truTV. @webpagelink #ad"},{"comment_id":"502105753294821","commenter_b":"Leave bitch!!!","commenter_a":"Trump for president!","post_message":"We'll pay for your ticket..."},{"comment_id":"1404176169614167","commenter_b":"We disgusted to look at you and your ugly ass fucking husband !!!!!","commenter_a":"Not sure who you are polling.. please tell me why democrats lost so big this election... because people were disgusted with her and her husband!!","post_message":"Michelle Obama continues to rank as one of America's most admired First Ladies. Do you admire her?"},{"comment_id":"10155518343016729","commenter_b":"This is a repost .....As For Barack Obama, We watched him sit for 20 years in a Church whose preacher condemned America . We watched him travel the globe apologizing for America's greatness .We watched him allow guns to be shipped to Mexican criminals so they could later turn up at crime scenes to mislead American opinion. We watched him use the IRS to punish those with opposing views . We watched him shrink America's military defences ,We watched mistreatment of our veterans , We watched the Ambassador and his protectors be left to die and be covered up by a lie , We watched our nation debt be doubled , We watched the nation's food stamps recipients climb to 25% , We watched a health care system nearly implode to promote some utopian fairy tale. We watched our police be disrespected , race relations fall to an all time ...","commenter_a":"Facebook is so liberally biased. Had this been a post by a Conservative toward Clinton or Obama supporters, the account would have been terminated. Also the person would have been fired from their position immediately. So the school not yet terminating him is garbage.","post_message":"Despicable!"}]
