[{"comment_id":"847757325414844","commenter_b":"fly your flag and tell these invaders to get out","commenter_a":"Let him fly his flag, this is America","post_message":"There is nothing threatening about an American flag.  He wants to show his pride for his country, let the man!  Do you think he should be able to fly his flag?"},{"comment_id":"837639489700820","commenter_b":"I will destroy humans","commenter_a":"Eloise Nicholls Regan Howard Louise Hemmings Sydnie-Jo Goodison Megan Wilkins @username","post_message":"This robot wants a family...and to destroy humans."},{"comment_id":"10154024040699497","commenter_b":"Stop being such a pussy!","commenter_a":"And people are just standing for this? I follow the Onion, and certainly didn't fall in line with Justice Scalia's opinions, but let me tell you this - this is a new standard of low. I could leave a brief comment, but this is so far beyond the usual pallor of any statement even a satirical form of journal should ever make, I find myself disgusted into making a statement. As human beings, we are all equal in death, but as Americans, we are something more. We are held to a certain equity of values that we inherit no matter where we fall on the narrow spectrum of political attitudes held in this country. And I am personally offended by the scrapping masses of groundlings hurling insults about a dead political figure before his family had even had a chance to attend the funeral. Shame on all of you. Good ...","post_message":"BREAKING:"},{"comment_id":"942171079182981","commenter_b":"Pussy","commenter_a":"Looks like a Bitch fight","post_message":"Slam City #Fight In The Park!   One Of The Fights In Last Months Fight Comp!  To submit content for our Upcoming #FightComp download the Worldstar App in the App store goo.gl/CnyR5l and access our brand new camera feature!"},{"comment_id":"916971715038985","commenter_b":"No fucking way little Marco is a snowflake greasball whore and the newspaper is a yellow rag. Trumpslide","commenter_a":"Blah blah blah....said all the politicians","post_message":"\"The only way the nominee can win in November is by unifying the GOP and appealing to Democrats and independents,\" the Miami Herald said in a special editorial. \"The best candidate to fill that role is Sen. Marco Rubio.\""},{"comment_id":"10153072554446037","commenter_b":"Feed her to the hogs","commenter_a":"Bye bye","post_message":"#Jordan will execute Wednesday a woman on death row over a failed bombing after the government vowed to avenge the murder of a pilot by the #IslamicState group, an official said."},{"comment_id":"10154038574341337","commenter_b":"Fuck, fuck, fuck a duck Screw a kangaroo Sixty-nine a porcupine And hope he blows you too....","commenter_a":"South Park did it best. See: Mystery of the Urinal Deuce","post_message":"MURDERED BY OBAMA? These Antonin Scalia conspiracy theories are insane..."}]
