[{"comment_id":"1239847632704451","commenter_b":"Hillary is the Unindicted Felon!","commenter_a":"That is exactly what pisses me off the most, to see the wealthy paying zero taxes! I pay taxes so I make my contribution to our government just like millions of Americans do! It sucks, really sucks! And then to say it is smart not to pay taxes on National TV? That is an insult to the American people! Bragging about it makes me think that those who support this clown have something wrong in their heads, period! Is this the kind of Commander in Chief we want?","post_message":"There it is, folks!"},{"comment_id":"10156595781460192","commenter_b":"Not Christian not even NICE!","commenter_a":"Lets just all work to eliminate race ...that so hard","post_message":"What are your thoughts on this sign?"},{"comment_id":"10154089965446336","commenter_b":"Yeah, lice likes very clean hair. If you put products in their hair it's likely they won't get it. Oily hair care products are","commenter_a":"It's not super lice it's called...ignorance. Schools inform by sending a note that lice has been found in the classroom. The person is not identified at all..not even to the parent. Infested child goes untreated. Why? The same reason some are abused and some are not, the same reason some parents care about their children and others don't. Children are going untreated and/or not treated properly. This has been going on for years.","post_message":"What can you do if your child is affected?"},{"comment_id":"10153288097452629","commenter_b":"Hmmm. But I'm mixed so do I only get 5% off?","commenter_a":"Ariel help the world is blind","post_message":"If you love BBQ (and you're white), June 11th is your lucky day."},{"comment_id":"10154357911453812","commenter_b":"Except that some women don't make milk","commenter_a":"Breastfeeding should be promoted! I don't know how much further folks can ride the PC train. Hope it crashes soon.","post_message":"The U.S. Preventive Services Task Force is keeping its 2016 recommendations in support of breast-feeding nearly identical to those issued in 2008, with the exception of deleting one word: “promote.”"},{"comment_id":"981969021843756","commenter_b":"Republicans want to end abortions so that they will have more population to draw on for their future wars. Think about it: End abortions, brings on many children that the parents can't care for (likely because of finances). The child likely grows up in poverty, being told (by the same people that ended abortions) he/she is a leech on society (parents likely getting assistance), so that child will grow up and most likely do one of two things (a few will take a different path, of course). 1) begin a criminal career 2) join the military to be fodder Republicans want to abort YOUR children when they are adults....THAT is why they want to end the termination of unwanted pregnancies.","commenter_a":"Attack on women!!!!! All you saying baby killers start adopting them then...start helping poor young women survive during pregnancy and after child is born, start fighting for wic, head start, etc...how many severely disabled children have you adopted? Big mouths refuse to help real babies only care for fetus","post_message":"Every child is a gift from God.  That's why the House just passed some of the most pro-life legislation to ever come before Congress – banning abortions after 20 weeks."},{"comment_id":"443733605833672","commenter_b":"Mr. Trump, Your idea of building a wall to slow / prevent illegal immigration is far too narrowly focused. Here is what I think a solution to the problem could be. No matter where the immigrate is coming from. Though not my original idea it is a workable one - All immigrate males between 18 & 50 to be immediately inducted into the military to receive basic training, After completion, sent back to their country of origin, then given their weapons and told to defend and reclaim their own country. After they accomplish that we send them their families because they would have no excuses to come here. If they refuse to do this then they and their families can find another country that will take them because they would never make an AMERICAN anyway. We should not have to send OUR military to their country to fight and die ...","commenter_a":"We don't need 1,400 years of cosanguineous brain damage. We have enough of our own in the Republican Party.","post_message":"Our country is in trouble. We’re going to stop people from coming into our country illegally. #GOPDebate"}]
