[{"comment_id":"10153598049151336","commenter_b":"Kill her","commenter_a":"Molly, America loves you.","post_message":"Former Baltimore Ravens cheerleader Molly Shattuck was sentenced to two years of probation after pleading guilty to raping a 15-year-old boy at a vacation rental home in Delaware."},{"comment_id":"10153440207470950","commenter_b":"The stats show that you're more likely to shoot a family member than anyone else. Guns don't kill people, but people with guns can and do kill more people than those without. Who would have been at fault if the kids shot out the car window and killed someone? The kid, or her for failing to secure a murderous weapon? What if after after being almost killed by her son, she veered into on-coming traffic and kills another driver? Who is at fault then? Not only do I not understand the pro-gun and pro-kill people, I don't believe their justification for wanting to kill.","commenter_a":"Dumb ass","post_message":"The mom, a pro-gun activist who runs the page Jamie Gilt for Gun Sense, told deputies her 4-year-old son shot her in the back with a .45-caliber handgun that was on the floor of her pickup truck."},{"comment_id":"10153055647952235","commenter_b":"oh shut up Sarah !","commenter_a":"I'm more left leaning and I know she's a joke.","post_message":"Pass the popcorn!"},{"comment_id":"10153576413974087","commenter_b":"She is a joke","commenter_a":"Says someone who championed NAFTA and called the TPP the gold standard of trade agreements. #whichhillary","post_message":"“Hillary says you walk out on America, you pay an exit tax. And if you got tax dollars or a tax deal, you’ve got to give the money back. She’s with us,” the Hillary Clinton ad says. WATCH:"},{"comment_id":"957903450911743","commenter_b":"Muslims are still using the jiihad to increase their power and stupid European leaders are letting it happen.","commenter_a":"LanceBell fox loves you","post_message":"Spread this everywhere:"},{"comment_id":"10153141650912093","commenter_b":"Look it up chick","commenter_a":"3200 people died in car accidents today in the US, everyday","post_message":"A man is in a coma after an electronic cigarette exploded in his face... @webpagelink"},{"comment_id":"10154262927371519","commenter_b":"What a faggot","commenter_a":"She was just on Rachel Maddow. I was in tears. This has to stop.","post_message":"He also threatened to rip off her hijab."}]
