[{"comment_id":"666544360165278","commenter_b":"@username, Mexico has a wall on their Southern Border and they swear it has dropped the amout of illegals in their country from Guatemala by 2/3rds. That's 66% less illegals if you can't understand what 2/3rds is. And No, Mexico can't do us more harm, only our Politicians like Clinton, Johnson and Stein can. Don't let them give America away.","commenter_a":"Sadly, we have become a society where protecting borders is not even an issue. It must be done because of the outside terrorists. Then our people could concentrate efforts significantly more on internal ones. I cannot believe I just wrote that. Trust in God.","post_message":"Truth."},{"comment_id":"10156048486720389","commenter_b":"Anyone is smarter than she is!","commenter_a":"YES!!! She knowingly wiped her server clean or had someone way smarter than her...do it for her!!!!","post_message":"Question of the Day: Do you think Hillary Clinton knowingly wiped her server clean?"},{"comment_id":"10155007911979228","commenter_b":"Couldn't agree more. This is a global women's health issue and we put so many women at risk by this gag. Women will be dying from this order.","commenter_a":"Thankyou for showing positive leadership against these attacks on women's rights! This is the kind of action we need in DC right now!","post_message":"Two days after millions of women marched to oppose the new president's backward policies, he reinstated the Global Gag Rule, a federal ban that will directly affect a woman's access adequate healthcare in the U.S. and abroad. It's up to Congress to permanently repeal this dangerous rule and I've cosponsored the Global HER Act to end this outdated policy once and for all.  @webpagelink"},{"comment_id":"1187550147931680","commenter_b":"It is her job totally, but let's be fair, her job duties changed abruptly in June after SCOTUS ruled. That said, she should resign if she can't/won't carry out her duties and leave her religion out of the office. She can be as devout as she wants, but not on the taxpayer's dime. Those couples are paying her salary and deserve better","commenter_a":"If she don't want to issue gay marriage licenses she shouldn't have to...","post_message":"JUST IN: Kentucky clerk who refused marriage licenses for gay couples taken into custody @webpagelink"},{"comment_id":"10154174167571509","commenter_b":"@username no the little girl thought she was the boss.. the cop showed her she is not","commenter_a":"this is very extreme who taught the school police officer to do this. she did not look like a threat he just had to talk her into complying","post_message":"\"You're either going to come with me, or I'm going to make you.\"  A school district in South Carolina is investigating the actions of a school resource officer after video showed him violently removing a student from her desk."},{"comment_id":"10153825781392522","commenter_b":"There goes the fake Native American vote!","commenter_a":"Another documented lying Democrat fanning the flames. STFU Pocahontas","post_message":"\"We will fight harder, we will fight longer and we will fight more passionately than ever.\""},{"comment_id":"876414139081949","commenter_b":"You guys should follow the example of other country's. In Panama there is a big movement right now. No more inmigrants! Everybody is taking the social media and demanding that all the undocumented get out of the country! So let your voice be heard!","commenter_a":"Grinning fool. Poster picture for Term Limits.","post_message":"Click to see the back-room deals Republican leaders are making to fund Obama's executive amnesty..."}]
