[{"comment_id":"10157544266265206","commenter_b":"Pervert","commenter_a":"Manzoor Hassan @username ye kon ha ?","post_message":"“My heart dropped into my stomach, and I was immediately hysterical,\" the woman said."},{"comment_id":"10153584221598352","commenter_b":"Throw her dumb ass in jail.... She'll get a lot of attention","commenter_a":"Aye u had sum true to heart good ass friends. U messed up big time","post_message":"Fraudster who made her friends shave their heads in her honor after claiming she was dying of cancer admits she made it up for attention"},{"comment_id":"10153523667426336","commenter_b":"Please don't reproduce, the stupid must stop with you!","commenter_a":"TRUMP ALL THE WAY!","post_message":"The 2016 election kicks off on Fox News Channel August 6th!  Fox News and Facebook are teaming up to bring you the first Republican presidential debate! LIVE coverage begins at 5p ET. Don’t miss it."},{"comment_id":"10153677619074641","commenter_b":"Radicalism is one of the biggest problem for all countries and all societies. If you say radicalism or terrorism is related to a religion, it is completely wrong . You can see a lot of samples from history. The important point here is why radicalism has raised within last ten-twenty years. One of the answer of this question is imperializm. USA has raised terrorizm and radicalism on the world , africa, middeeast. ( Iraq, Libya invasion , bombing , killing more than 1 million people ) . USA has really created huge chaos in middleeast and destoyed Iraq. So ISIS has came up there . Terrorizm in middleeast is not religion issue . If USA and other countries had did same thing ( bombing , invasion, killing , creating chaos continuosly) at another part of the world during years, you would see similar terrorist groups there. So in order to ...","commenter_a":"Why ISIS hates France so much ? @webpagelink","post_message":"French President Hollande: \"We are at war -- a war against terrorism.\"   More: @webpagelink"},{"comment_id":"787208168094254","commenter_b":"That woman's a little unhinged!","commenter_a":"You are a has been. Good luck in finding work. You might need President Trumps help in finding a job.","post_message":"Classy!"},{"comment_id":"1073692496071264","commenter_b":"She's a POS !!!!!","commenter_a":"hahaha love this dude","post_message":"\"[Hillary Clinton] keeps saying that we need to move slowly on this. Someone give her a Red Bull, because the wolf is at the door – the wolf is chewing through the door.\" – Sheriff David Clarke on fighting Islamic terror threat"},{"comment_id":"10158027884060354","commenter_b":"I'm proud I didn't vote for Trump who is a racist, woman groping sleaze and fails to pay a hard working startup business owner caterer because he told her she would get more business when people hear she catered his wedding and had to pay her employees out of her pocket. And believes because he is rich he has the right to treat women as he pleases. You can vote for him not me. My husband thinks he's NUTS!","commenter_a":"He's still under numerous criminal and civil investigations, whether they are by the FBI or not. Numerous court dates, numerous lawsuits, etc, etc.","post_message":""}]
