[{"comment_id":"1448117561874659","commenter_b":"They generally don't prohibit it but they train the employees to give the robbers the money because the owners have insurance for that.","commenter_a":"Looks like 30 people who should have been able to defend themselves and their businesses.","post_message":"A trio of armed teenagers is now accused of more than 30 robberies across King and Pierce counties."},{"comment_id":"1090190811037255","commenter_b":"Dear Charlotte She gonna frack it up","commenter_a":"So proud of you @username! Can't wait to vote for you in Kentucky on May 17th! Hillary 2016!","post_message":"What kind of president would Leslie Knope be? Amy Poehler: \"Full speed ahead!\""},{"comment_id":"10153618510960329","commenter_b":"How bad do you want to see picture number 4s titties?!","commenter_a":"Dave David Craig so Mark was right all along...","post_message":"Drinking beer in the shower is a thing and you should all be doing it."},{"comment_id":"10154040256123132","commenter_b":"Take her AWAY","commenter_a":"She probably asked for an extension so she could take off far away....","post_message":"The Dance Moms star faces up to 5 years in prison if convicted."},{"comment_id":"10153752215990575","commenter_b":"Better yet, deport them each and every one ASAP !!!","commenter_a":"Shoot everyone of them no more rape","post_message":"Good question!"},{"comment_id":"569916976504180","commenter_b":"@username, different country different faith but people still using the text to justify murdering gays. Was it the predominantly Muslim US States that passed the \"Gay panic defense?\" @webpagelink","commenter_a":"Good on you, Bruce. Christians warned us about Sharia law, and now they've imposed their version of it on us. Irony?","post_message":"\"Some things are more important than a rock show.\""},{"comment_id":"1386022938105786","commenter_b":"Build a wall all around California lol","commenter_a":"Seriously they had to conduct a study?! I think most of us true natives already knew that without conducting the study and it's been like that for years. We have way too many people coming here from other states and something must be done to control the population here; it's really just a joke now.","post_message":"It's official: California is the worst state for drivers. 🚗"}]
