[{"comment_id":"10152630732682061","commenter_b":"@username. Its not like she can't afford it.","commenter_a":"One would think that she'd get those awful teeth fixed.","post_message":"UPDATE: Bobbi Kristina Brown moved from hospital: @webpagelink"},{"comment_id":"786188861571691","commenter_b":"That is stupid why can't the welfare people get a job and beside who going to pay for their car insurance and car payment get real","commenter_a":"This is not true.if so think about the timing of it Killary is losing against Donald Trump and she is going to try and bye your votes but we are all to smart for that","post_message":"Congress Approves Bill Offering Free Cars To Welfare Recipients. Your tax dollars hard at work. Does this disgust you?"},{"comment_id":"10153174046691336","commenter_b":"Then stand up and stop him!","commenter_a":"Annddd. What do you intend to do about it? We're waiting.","post_message":"\"Presidents have the ability to take executive action, but they don’t have the ability to change the law.\"  House Speaker John Boehner said that President Obama clearly overreached with his executive action on immigration and changes to ObamaCare on Sunday Morning Futures with Maria Bartiromo."},{"comment_id":"10153673793456336","commenter_b":"Please don't find your way to StL!","commenter_a":"That is great, she prolly is afraid of going to prison!! She is about as racists as they come, she showed her true colors!!","post_message":"Breaking News: Baltimore Mayor Stephanie Rawlings-Blake announced Friday that she will not seek re-election.  @webpagelink"},{"comment_id":"10153160211535950","commenter_b":"No shame on you for not thinking outside the box, you are a ver naive women","commenter_a":"Why do people think that only adults can die of natural causes?? accusing them of covering something up is truly sick. Shame on you.","post_message":"YouTube star Caleb Logan of the Bratayley family died suddenly at age 13, his mother confirmed: \"This has come as a shock to all of us.\""},{"comment_id":"10153384160134087","commenter_b":"RINO","commenter_a":"And we should listen to Kasich because his numbers are so high? Isn't that why he was on the end?","post_message":"“I don’t have anything against Mr. Trump personally, but we’re not going to scoop up 11-and-a-half million people and ship them out,\" said GOP presidential candidate Gov. John Kasich.  \"He’s disparaged Hispanics and Muslims, and he’s insulted women. These are not the things that unify the country and make us stronger.\""},{"comment_id":"10152746114636545","commenter_b":"That's bootylicious","commenter_a":"Kaci, Ryan, Anthony and Cory - get home ASAP but do so in a safe manner.","post_message":"The roads are getting worse everywhere in North Texas and accidents are starting to pile up. Check the traffic conditions if you need to go anywhere.   TRAFFIC: @webpagelink"}]
