[{"comment_id":"1090355681009413","commenter_b":"IT'S CALLED CORPORATE WELFARE , and it's been going on for way tooooooo long , and it needs to STOP !!!!!!!!!!","commenter_a":"the republican way","post_message":"Congress continues to let billionaires slide and pats the back of the wealthy while every day Americans suffer. Sign your name to help raise the minimum wage →   @webpagelink  (Hat tip to The Other 98%"},{"comment_id":"10156314605160354","commenter_b":"Dems care more about illegals than Americans! Vote all democrats out!","commenter_a":"Here is a list of the DEMS that blocked the vote for Kates Law and to stop Sanctuary Cities.Tweet or Facebook your Congressman or woman.","post_message":"\"With a vote of 54-45, the measure failed to obtain the 60 votes necessary to end debate.\""},{"comment_id":"1316522848388184","commenter_b":"Trust me, women punish themselves way more than is good for them.","commenter_a":"He makes no sense why this man Willi never be president we heard what u said","post_message":"Trump manages to offend women in a completely new way."},{"comment_id":"959009797494471","commenter_b":"Any politician that don't one our soldiers to be armed there traitor to our country","commenter_a":"I can see maybe arming an NCO or someone at a recruiting station as a deterrent against the crazies out there.","post_message":"NO CHANGE IN POLICY: Army chief urges caution on calls to arm more US soldiers in wake of fatal shooting (VIDEO)  @webpagelink"},{"comment_id":"743858605712748","commenter_b":"I know another PENNY ,and she is worth much more that as a friend !","commenter_a":"Good grief!! And people say pennies are worthless.","post_message":"Are they nuts?"},{"comment_id":"1304804312923886","commenter_b":"Your kids would be better off in a Orphanage than with you..","commenter_a":"Lock them up","post_message":"They blazing new trails."},{"comment_id":"753100741547170","commenter_b":"That whore cares so much about the us she built a school in Africa!!!!","commenter_a":"Fuck that","post_message":"Obama Wants To Put Oprah Winfrey’s Face On The New Dollar Bill.  This is ridiculous. Leave the dollar alone.  Do you think they should get the dollar bill as it is?"}]
