[{"comment_id":"10154655361619170","commenter_b":"She looks like calling us Deplorables. She should look in the mirror..","commenter_a":"And she belongs in a mental hospital.","post_message":"Here's what Hillary thinks about you. Now click to join us in a little experiment concerning this."},{"comment_id":"514466908734354","commenter_b":"We have enough homeless, and veterans who need out support. We need to stop being 911 for the rest of the world. Deport the illegals, Some say illegals do the jobs Americans won't do, then American's better start doing them.","commenter_a":"HEY OBAMA FORGOT ABOUT THIS LAW......Islam, by law, is prohibited from US immigration The Immigration and Nationality Act passed June 27, 1952 revised the laws relating to immigration, naturalization, and nationality for the United States. That act, which became Public Law 414, established both the law and the intent of Congress regarding the immigration of Aliens to the US and remains in effect today. Among the many issues it covers, one in particular, found in Chapter 2 Section 212, is the prohibition of entry to the US if the Alien belongs to an organization seeking to overthrow the government of the United States by \"force, violence, or other unconstitutional means.\" This, by its very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House.Islamic immigration to the US would be prohibited under this law because the Koran, Sharia Law and the ...","post_message":"ICYMI: \"A new Fox News poll shows 52 percent of the nation favors deporting the millions of illegals back to their home countries. Republicans and Democrats support Mr. Trump’s plan,\" writes Todd Starnes."},{"comment_id":"1067971246620705","commenter_b":"This is not a college campus, and she already dropped out of college. Go look, shiney object over there ...","commenter_a":"The media should be reporting on the despicable Republican Platform. #shameful","post_message":"The speechwriters who wrote the original speech are among the best, and weren't going to have their good name besmirched by Trump ..."},{"comment_id":"10153772364848132","commenter_b":"Such a strong woman...","commenter_a":"What a wonderful tribute to your husband this morning Kathie Lee... May God be with you and your family at this difficult time...","post_message":"This emotional tribute from Kathie Lee Gifford is so touching."},{"comment_id":"10150576091714999","commenter_b":"Another highly paid rapist.","commenter_a":"@username...good or bad?","post_message":"Sports Alert: Jameis Winston, the star quarterback from Florida State Seminoles Football who played under a swirl of controversy, was chosen first over all in the NFL draft by the Tampa Bay Buccaneers."},{"comment_id":"1357029221003198","commenter_b":"Some more cry babies who need their blankie and bottle and their safety pin get over it!!!! God BLESS AMERICA AND GOD BLESS PRESIDENT TRUMP!!!!","commenter_a":"Like the cops dont have better things to do! Should arrest the little bitch \"barista\"!","post_message":"The anti-Trump movement enters Starbucks.  @webpagelink"},{"comment_id":"10153513260681770","commenter_b":"I have something to say to this wet back. Guess.","commenter_a":"Yeah I don't like him at all !","post_message":"George Lopez has something to say about Donald Trump."}]
