[{"comment_id":"10153877660438812","commenter_b":"Wow, you're just full of fear. They're just people that want to use the bathroom. Get over yourself. No one wants to look at you or your ugly daughter anyway","commenter_a":"This just in! All teenage boys are claiming to be trans to gain access to girls' locker rooms.","post_message":"The DOE says an Illinois school district is violating the rights of a trans student by denying her access to the girls' locker room."},{"comment_id":"1176769975734870","commenter_b":"Hell yes, it's about tyme someone stand up the the World Biggest Bully Obama, You Go Donald Trump.","commenter_a":"Trump is our only way out he is our only Vote we got to stay in touch @ all times","post_message":"Liberals are demanding that Donald J. Trump walk back his rhetoric against President Obama in the wake of the Muslim terror attack in Orlando. Trump isn't going to do that, though... he just doubled down and accused President Obama of TREASON.  This are Trump's most stunning remarks on President Obama yet. Do you agree with what Trump had to say?"},{"comment_id":"10153584406778352","commenter_b":"stupid girls!!!","commenter_a":"They need to be committed for a long long time","post_message":"Two Teenage Girls Kidnapped a 14 Year Old, Made Her Masturbate, and Tortured Her For 17 Hours By Scalping Her Hair and Pouring Salt Down Her Throat"},{"comment_id":"1641151569508654","commenter_b":"@username: no fault but Puerto Ricos...pretty sure they had a chance to vote for independence, and y'all didn't take it. You can have all the cultural pride you want...but it's the Olympics man, it is only for countries to compete in. Why not have Coca Cola and Pepsi join in?","commenter_a":"The underdog defeating the #2 in the world for gold.. Monica eres grande!!! PUERTO RICO!!! and to the bunch of salty Americans go read a book and learn about the damage the USA has done to PR!!","post_message":"After some of her more dramatic points, fans were shouting \"Si se puede\" and waving the flag of Puerto Rico."},{"comment_id":"10153474525188812","commenter_b":"Is she a Mormon? Cause those kinds believe differently.","commenter_a":"This is not ok!! he has said God made him wrong, God is NOT a liar and He makes no mistakes....repent cause looking like you made a true blasphemy against God, please don't comment ignorance, if you have an issue take it to God.....","post_message":"NEW: Meet Caitlyn Jenner -- formerly known as Bruce Jenner: @webpagelink"},{"comment_id":"992882130761178","commenter_b":"#__ #__ #StopYazidiGenocide #StandforYazidiWomen","commenter_a":"@username: .","post_message":"A behind-the-scenes look at a historic night. hrc.io/269ym4J"},{"comment_id":"10153978622861438","commenter_b":"Of course she is. I could see through that bubbly bs","commenter_a":"Shocker....not.","post_message":"Kelly Ripa’s morning talk-show drama might force us to acknowledge all the work that goes into her cheery persona."}]
