[{"comment_id":"10153486926096770","commenter_b":"Conservative Populist? Lmfao","commenter_a":"Trump your next President.","post_message":"After acknowledging he will now raise money for the general election, presumptive Republican presidential nominee Donald J. Trump has named a national finance chairman who has a history with some organizations that could clash with his conservative populist message."},{"comment_id":"1677567089166752","commenter_b":"See ya later Bye! Oh and by the way give all the money back that you made from us Americans who made you rich! That wouldn't happen in any other country they would kick her out. Maybe if all the people who doesn't like america would leave, then we would have a better america! I love my country","commenter_a":"Why are you still here??? Please don't wait any longer, you and your racist, hate mongering friends are NOT welcome here!!!","post_message":"Whoopi Goldberg is planning to move out of the country if Donald J. Trump is elected the next president of the United States. @webpagelink"},{"comment_id":"1022251871143567","commenter_b":"Trump card xxx you trump is good for God's love you trump","commenter_a":"clinton, liar, e-mails, white water, rose wood , scandals.... what's with webb hubell? is he chelsea's dad??..Vince foster?? tell America the truth...corruption with clinton foundation, schlonged by obama, OWES favors, soros, lobbyists, muslims leaders..her illict affairs with, yoko ono, vince foster etc....covering up billie's affairs..stole thousands from W H..when clintons left...benghazi, terrible lies...she let those heroes die...yeah, poooooor victim.. killary will do, or say... any thing to get elected....","post_message":"Trump Issues A Major Threat To Hillary!"},{"comment_id":"1841512796060882","commenter_b":"@username till the wall is complete lol there isn't going to be anyone picking lettuce you better grow your own","commenter_a":"Well Boston Mayor...... you are not the President so you don't get to decide what he focuses on. He's up holding his priority promises to his supporters first then comes the rest. Not the Democrats vision the Trump vision","post_message":"Boston Mayor Marty Walsh says President Trump should focus more on creating jobs and addressing urban issues such as homelessness.  Watch more: @webpagelink"},{"comment_id":"10152919389451491","commenter_b":"I always knew that America needed more violent rape on TV.","commenter_a":"Patrick","post_message":"Game of Thrones is famous for its tragic weddings, but last night the show pushed that into even darker territory."},{"comment_id":"1807238972845517","commenter_b":"NEVER GONA HAPPEN !!!!! BTW do any of these people know history???? Do they know that the first slaves were sold by Their own people???? Yes African people sold their own!!!! Now how the fuck.is that anyone's fault but their own peoples????","commenter_a":"We will not pay. No one in my family or ancestors had anything to do with slavery. Enough is enough move on.","post_message":"You May Have To Pay African Americans For Slave Reparations   Come try and get our money.  Will you pay for slave reparations?"},{"comment_id":"705344102952475","commenter_b":"@username, I'm no fool and I'm with her. Run along, jump back into your basket and go away...","commenter_a":"No matter what your kinds of words against Hillary we will not listen to you.This is solid Blue.","post_message":"\"There were trans people all over the country who were so excited that we could get gender identification papers that reflected who we really are … that is something that Hillary Clinton has done.\" —Laverne Cox"}]
