[{"comment_id":"511047909019803","commenter_b":"Throw that racist bitch out the door!","commenter_a":"BLM, Black Panthers, Farrakhan -- any of those available? Why would you not use them since you hold them in high esteem?","post_message":"Beyonce bashed cops at the Super Bowl but is now asking for their help. They want her to find a way to protect herself."},{"comment_id":"507357776079666","commenter_b":"This bitch","commenter_a":"What a whacko...and who says \"keen\" anymore?!","post_message":"Look at me! Look at meeee! I'm better than Hillary!   -Linda"},{"comment_id":"10153823756905671","commenter_b":"Probably no one in particular , some clubs are natural enemies to each other","commenter_a":"Wonder who he pissed off?","post_message":"A motorcyclist was shot dead on Interstate 80 near Truckee."},{"comment_id":"974409115948951","commenter_b":"Yes I have! She'll make an excellent prison wife. So biblically submissive.","commenter_a":"Have you seen this yet, Guy?","post_message":"Marriage equality is the law of the land. Officials should be held to their duty to uphold the law—end of story."},{"comment_id":"655073504617242","commenter_b":"She will try anything, needs to get a life","commenter_a":"LOONY TUNES HILLARY...........GO HOME BEFORE TREY GETS TO YOU............","post_message":"The Clinton campaign thinks members of the electoral college should receive a national security briefing about Russia's involvement in the election before casting their votes for president.   Is this a good idea, yes or no?"},{"comment_id":"10154731295753145","commenter_b":"A lot of merchandise with the \"Trump\" name on it is lagging in sales. When the sales of anything is down, stores WILL drop them.","commenter_a":"Geez ppl grow the F up and quit crying, he is our president and what the USA needs the most is for all Americans to come together.....united as one!!! This country needs help our own people are starving let's feed them first.","post_message":"Just last week Nordstrom stopped selling Ivanka Trump fashion brand."},{"comment_id":"865416670223607","commenter_b":"Your mother is a dumb fuck you ignorant whore.","commenter_a":"WW3","post_message":"Turkish F16s warned the jet over the airspace violations before shooting it down, the military official said."}]
