[{"comment_id":"561305640738010","commenter_b":"Yeah men can't back out....it's called child support lol","commenter_a":"Men should be made accountable and pay all money through a court.","post_message":"We couldn't agree more!"},{"comment_id":"10153542134849753","commenter_b":"She needs to get away from his crazy abusive ass!","commenter_a":"Lmfao fuck her and he a dick for doing it","post_message":"A man from Harlem, New York has forced his wife to walk down the street naked as a punishment for talking to other men. Jason Melo recorded the incident, hurling insults at her the entire time. The video was uploaded to Youtube, but has since been taken down. However, an edited version that blurs out his Melo’s wife’s naked body has surfaced and shows the humiliating situation unravel. The video has sent outrage across the internet, causing people to wonder how such an embarrassing form of... @webpagelink"},{"comment_id":"1275227535851049","commenter_b":"she can go back to sleeping with cruz! lol","commenter_a":"When he loses, I hope this woman just disappears into obscurity, and gets to feel what it's like to be left behind by Trump. She's an ignorant tool.","post_message":"She had a meltdown after the host repeated Trump’s words verbatim."},{"comment_id":"10152851658596636","commenter_b":"I am Muslim..&I say Good For Them! I hope it's banned allover the world..it has nothing to do with Islam .. It only has to do with Extremism &safe wise.. It's very dangerous...in many cases it's being used by terrorists..men or women escaping the law...etc","commenter_a":"Should be banned everywhere in the civilized world, its loved by fanatics, it belongs in regressing places like the Isis caliphate only.","post_message":"The Government says the move has 'nothing to do with religion'"},{"comment_id":"10152730591461545","commenter_b":"^^Is there some kind of cream for that you think? LOL","commenter_a":"Just because it's on paper doesn't mean it is acceptable to God. Period.","post_message":"Sarah Goodfriend and Suzanne Bryant became Texas' first same-sex couple to receive a marriage license this morning. This is them speaking at a press conference in Austin.  MORE: @webpagelink"},{"comment_id":"10153855309638010","commenter_b":"too late on the troops - we're up to 5000 in country","commenter_a":"Just may be very well a Trump supporter making America GROSS again!","post_message":"The woman, who works for the Department of Corrections, was filmed ridiculing a Muslim man for praying and then hitting him with an umbrella and throwing coffee at him."},{"comment_id":"991109084315479","commenter_b":"And those politicians won't change anything until one of them gets shot","commenter_a":"By law, the police can't do much of anything until the shooter opens fire. If he verbally threatens someone, that can bring the police into it. But by that time, someone may already be dead. Don't blame the police, don't blame the dispatchers, blame US.....because we elect the politicians that pass these laws!","post_message":"Once again, the NRA has blood on its hands."}]
