[{"comment_id":"717976815002166","commenter_b":"Did you read what I said? Or did I lose you after ESPN? By law, you cannot force someone to give up their body, body parts, body tissue to ANYONE, regardless of their life being in danger. So you can't force a woman to give up her body and blood and essence to someone who you've notably identified as a completely other person. And ps, bananas also have their own DNA. Oh shit looks like we can't eat fruit.","commenter_a":"I read Planned Parenthood does 30% of all abortions. Who is doing the rest of them?","post_message":"Appalling on every level. THEY MUST BE STOPPED!"},{"comment_id":"10153722267976509","commenter_b":"The Duggars are not Christians. They are members of a sex cult","commenter_a":"Your son molested four of your children and you tried to keep it secret? Disgusting! I'm going to pray for you when I take my birth control.","post_message":"Four of the five girls #JoshDuggar molested were his sisters, their parents said in an interview with Fox News anchor Megyn Kelly. @webpagelink via CNNMoney"},{"comment_id":"496930887161871","commenter_b":"women, they just don't listen lol","commenter_a":"Hope she went to jail!!","post_message":"\"Thank to Obama and I don't have to OBEY you\", she said to the police officer!"},{"comment_id":"10154895009386337","commenter_b":"A pussy with a ring...yah right!","commenter_a":"Jefferson has always been a pussy!","post_message":"LOL. Joel Embiid cares not for your veteran status, Richard Jefferson..."},{"comment_id":"1606743262959812","commenter_b":"Run cock roaches run!","commenter_a":"If only","post_message":"WATCH LIVE: Protesters are filling the streets in Charlotte after police say an officer shot and killed an armed man. @webpagelink"},{"comment_id":"10154719986051130","commenter_b":"I'm a middle income American born and raised in America I paid Social Security and income taxes all my life I'm tired of supporting illegal immigrants and people freeloading from the US government on my nickel pretty soon the freeloading is going to stop","commenter_a":"Now I see a lot of ignorant uneducated and sick people talking about things that don't make any sense against the president when Donald Trump gets going you people that are on welfare illegally you people that get free handouts from the government illegally for you people the freeloading stops you're going to have to get a job and actually work for a living.","post_message":"WATCH LIVE: President Trump to speak in Melbourne. @webpagelink"},{"comment_id":"10153903712141051","commenter_b":"Your a bitch !!'","commenter_a":"Black lives matter??????? Nop!","post_message":"You read that right: this man raped not only his 82-year-old grandmother but also his uncle. She had just one question for him."}]
