[{"comment_id":"705392762974353","commenter_b":"Lol too bad she does more for this country than you ever will","commenter_a":"She's awful. She's a spoiled brat that needs attention. We need to stop giving her a second of our time and let her slither back to wherever she came from. Maybe she can go live with Heidi and Spencer.","post_message":"Newly-uncovered video proves Tomi Lahren changed her position on climate change to appeal to misinformed conservatives. SHARE to spread her shame!   Video by Occupy Democrats, like our page for more!"},{"comment_id":"10153775043868984","commenter_b":"They are monster","commenter_a":"Go Trump/Cruz","post_message":"Barack Obama may be trying to act like a humanitarian by letting in 10,000 Muslim refugees from Syria. However, what the media isn't reporting on is who Obama is kicking OUT of the country... When America finds out just who he's deporting, they're going to be FURIOUS."},{"comment_id":"10152926251994071","commenter_b":"Their porn is awesome. Fully filled girls, unlike the skinny twigs the US has to offer.","commenter_a":"Small wonder. Have you ever seen their porn? Horrifying.","post_message":"It's a \"time bomb.\""},{"comment_id":"10153677619074641","commenter_b":"Radicalism is one of the biggest problem for all countries and all societies. If you say radicalism or terrorism is related to a religion, it is completely wrong . You can see a lot of samples from history. The important point here is why radicalism has raised within last ten-twenty years. One of the answer of this question is imperializm. USA has raised terrorizm and radicalism on the world , africa, middeeast. ( Iraq, Libya invasion , bombing , killing more than 1 million people ) . USA has really created huge chaos in middleeast and destoyed Iraq. So ISIS has came up there . Terrorizm in middleeast is not religion issue . If USA and other countries had did same thing ( bombing , invasion, killing , creating chaos continuosly) at another part of the world during years, you would see similar terrorist groups there. So in order to ...","commenter_a":"Why ISIS hates France so much ? @webpagelink","post_message":"French President Hollande: \"We are at war -- a war against terrorism.\"   More: @webpagelink"},{"comment_id":"1681195205453281","commenter_b":"Barbara just needs to go away!","commenter_a":"Her opinion doesn't matter!","post_message":"Barbra Streisand blasted “narcissist” Donald Trump in a 1,228-word Huffington Post op-ed."},{"comment_id":"10152740585827426","commenter_b":"You are happy a man is now dead? Does that make you better than him? If you claim that he was a bad man, how do u know the people he wanted dead weren't bad men too? I'm glad you find satisfaction in a human beings death like some sort of animal","commenter_a":"Heck yeah!","post_message":"An internal investigation into Shannon Crane’s death is underway."},{"comment_id":"702885809874123","commenter_b":"Just as ugly as she is!","commenter_a":"Very ugly dress looks likes she's wearing a curtains.","post_message":"It caught everyone's attention because..."}]
