[{"comment_id":"10155405289876729","commenter_b":"@username I can respect that and pretty much agree.","commenter_a":"Anyone that takes the time to read this case will side with Ventura. Kyle bandwagon jumpers will say Chris Kyle was incapable of any wrong like Jesus. He made a mistake and his insurance was there for this very reason. In short, Chris Kyle should of never made up that story in the first place. I am disappointed with you @username.","post_message":"Finally."},{"comment_id":"10153285137206770","commenter_b":"Make them eat PORK.","commenter_a":"YES!!!!!","post_message":"\"In the Middle East, we have people chopping the heads off Christians. Not since medieval times have we seen what’s going on.\""},{"comment_id":"10154245909881130","commenter_b":"Oh, better step back, she threatened him with the janitor!!!!","commenter_a":"Suzane Al Ahmad","post_message":"Boy, bye. 😂"},{"comment_id":"10158501442080389","commenter_b":"Why is she in our country?","commenter_a":"March away and try not to get run over by a car or truck. Most of us have jobs and families to tend to.","post_message":"Despicable."},{"comment_id":"10153557014143984","commenter_b":"To the Ignorant person that said I must be an illegal immigrant you just showed you how ignorant you are. I'm an American. A REALISTIC AMERICAN!!!!! I agree with the person that mentioned the abuse of the welfare system, but those are Americans doing that. Illegal immigrants can't get benefits!!! To the person who said that the companies are putting money in their pockets I agree, but as soon as they have to pay minimum wage and provide benefits and go legit the cost will be passed onto the consumer it always does. To the person that mentioned Hispanic, Mexican etc. I never mentioned any group of people I made a general comment about all immigrants. You just showed how stupid you are that just because I mentioned working in Orange fields you automatically stereotype I was talking about Spanish people. Here's a little info for you not only Spanish ...","commenter_a":"This country was built by immigrants both legal and illegal. Im tired of hearing people complain about illegal immigrants!!! Who the hell do you think are working the lowest paying jobs that without them this country would not function. Will any of you go clean toilets for 6 dollars an hour (that's if they can get that much). NO!!! Would any of you go to the orange fields and go pick oranges for hours in over 98 plus degree weather for pennies a bag. HELL NO!!! But you like when you don't have to pay an arm and a leg for orange juice. If there were to be no illegal immigrants the costs of a lot of things people enjoy would sky rocket because the company would have to pay out more for employees passing the increase on to the consumer!!!!!! Everyone needs to back off immigrants because unless your ...","post_message":"There have been many to come out against Trump after his comments on illegal immigration, but one beloved politician just did exactly the opposite.   Do you support this Republican for taking a stand for Donald Trump?"},{"comment_id":"800175416791290","commenter_b":"shes disgusting!","commenter_a":"I don't know anyone personally that thinks Amy Schumer is funny . Her only following is a bunch of feminist that think her over the top vulgarity makes her equal to men but even most men aren't as perverted as her .she tries to hard and it just isn't funny or entertaining.","post_message":"\"Of course, we're in Florida, you're going to boo.\" - Amy Schumer after being booed for making jokes about Donald J. Trump"},{"comment_id":"10153083416063984","commenter_b":"Stoopidbitch","commenter_a":"Doesn't it just make you proud?","post_message":"Obama will not meet with Israeli Prime Minister Benjamin Netanyahu, but he'll meet with these 3 YouTube sensations? Priorities..."}]
