[{"comment_id":"1685131825099212","commenter_b":"Bitch!","commenter_a":"Bitch","post_message":"Can you describe #Trump with 1 word?  The Free Thought Project.com (y)"},{"comment_id":"10153567404684087","commenter_b":"His wife doesn't look happy in photo","commenter_a":"Is it, \"Gotcha! Now buy my new book. I'm dropping out of the race. It's been fun\"? Because his run is obviously a bad joke that some people are apparently taking seriously.","post_message":"Donald J. Trump is holding a special news conference on #SuperTuesday night to deliver a major announcement. WATCH LIVE:"},{"comment_id":"1140315249363924","commenter_b":"Blow these animals off the face of the earth","commenter_a":"If these imagrants can live or vote . Send them all over in middle east to fight for our country , including mexicans. Then see what happens . All of them will leave . Build that wall Donald","post_message":"Muslim Migrants Already Lazy Bums, Veg Out And Drink Liquor All Day on Taxpayers Dime!!!   This is what Obama and Hillary want for America!"},{"comment_id":"1111328388897763","commenter_b":"Grow a set you whinny little pussy!","commenter_a":"In America we all have the right to support which ever candidate we choose! Why be afraid God is on your side! I choose Trump! We have that right in America! I do think the present government in America is creating all this fear and I will vote Republican. If you don't want to abide by our Constitution and Congress Approved Amendments maybe you don't belong in America. IN GOD WE TRUST. WE WANT OUR AMERICA GREAT AGAIN","post_message":"\"I don’t deserve to feel afraid at my school,” said another student."},{"comment_id":"2125671227658021","commenter_b":"And also a puppet parasite. She made thousands of ill people live in poverty and her life was everything except that. What a lie! ........ the same thing happens with jews, they say they are the people of god! Which one? Money god?","commenter_a":"MOther Theresa ... Love, Hope and Charity... Saint of the people ... Pray for us ... Amen.","post_message":"Mother Teresa is set to be canonized – made a saint in the Roman Catholic Church – on Sunday @webpagelink"},{"comment_id":"10153095975513606","commenter_b":"Unreal. Where I grew up the \"N\" word was used frequently. Every time I was called that I retaliated. Im not a thug or a criminal. The teacher has to respect the students and vice versa. In hindsight the student should have went to the principal and then to his parents. Im in no way condoning what the student did but its a 2 way street. Dont bash the student when we dont know exactly what rhe teacher said. Racial slurs or any other forms of racism has no place in society. My kids or the kids I coach cant even say anything like that. Either way whatever was said isn't the problem. It was the lack of respect from the teacher and STUDENT.","commenter_a":"@username you say teachers need to watch what they say. I don't get it. What about the child. Dosen't he need to be taught. I don't like what you said so I punch you. There are other ways of handling verbal abuse. This is disgraceful.","post_message":"Witnesses say a Prince George's County Schools student punched his teacher over a racially insensitive comment: @webpagelink"},{"comment_id":"1689347211355625","commenter_b":"Well hopefully none of these girls are lesbians because if they want shari law they could end up getting stoned to death. Bunch of fools.","commenter_a":"I'm offended that must stop OHH wait a minute I'm a white America I don't have rights !!!","post_message":"SHARIA WEEK! Islam Week At Schools In America, Administrators Demand Females Wear Hijabs To Show Support!   Lets get 3000 SHARES if you'd like to see Trump outlaw Sharia Week!"}]
