[{"comment_id":"1227002650653096","commenter_b":"The LATIN EMPIRE AWAKENS! They realize that Republicans will get them into American class warfare!","commenter_a":"Latino Republicans? Does such an animal exist?","post_message":"Latino Republicans are mounting a pushback against the more conservative wing of their party."},{"comment_id":"10154813376179312","commenter_b":"North Country isn't that bad. And the only thugs are in the future new Nazi government.","commenter_a":"Prayers for this couple and their family","post_message":"Oklahoma police are looking for this couple last heard from in St. Louis. They were on the way from McAlester, Oklahoma, to Toledo, Ohio, but called their son from the St. Louis area on Thursday."},{"comment_id":"10153130429581162","commenter_b":"If prostitution ever becomes legal, you can sign your kids up freak.","commenter_a":"Making prostitution illegal is as stupid as pot being illegal. Regulate, tax and monitor.","post_message":"NEW: NFL Hall of Fame lineman Warren Sapp arrested for allegedly hiring a prostitute after covering the Super Bowl for the NFL Network: @webpagelink"},{"comment_id":"10152929837961130","commenter_b":"He would be a hero. If he were a girl, she would be a heroine","commenter_a":"\"Hero\" or \"heroine\" or are you undecided?","post_message":"This just made our week."},{"comment_id":"675287475916889","commenter_b":"so we don't need Muslims, Blacks, Hispanics, French or England immigrants here.....Missing anyone?","commenter_a":"We are having the same problem here with blacks, Hispanics, and muslims. They do not want to assemilate into the American society. They want their old country here with American benefits. Wake up America. We don't need a France or England here... or Sharia Law!","post_message":"Thankful hostages in France have been freed the terrorists have been brought to justice. A valiant and heroic performance by the French police.  UPDATE: Sadly, early reports hostages had been freed were premature. Our prayers are with victims and their families and our thanks with the police."},{"comment_id":"1007038892685973","commenter_b":"Liar liar","commenter_a":"@username for President of the United Sates of America, 2016-2024!!","post_message":"Read the texts Hillary sent some friends last night during the GOP debate."},{"comment_id":"274535909638816","commenter_b":"You are a sick women!","commenter_a":"What's even scarier is Californians that elect her again and again. I was having a discussion with a gent on fb he stated he moved out of the northeast because we were stupid. He stated he moved to the 2nd most intelligent county in the country.I took a wild guess and asked if the state would be California? Bingo! See how these people think. Scary","post_message":"HOLY SMOKES! NANCY PELOSI: Orders People to Clap, Repeats Words Then Calls John Kasich The Gov. of Illinois [Video]  This is embarrassing! She scolds the audience!"}]
