[{"comment_id":"10154394102516336","commenter_b":"So true having spent tons of time over there for many years it has changed to be almost unrecognizable sad that my grandkids will never know how wonderful London and England was","commenter_a":"We are next. TRUMP will win.","post_message":"“I think that the British people have had it. They fear terrorism just as the American people fear terrorism.”   Bill O'Reilly breaks down #Brexit, saying it’s not about economics but rather immigration. @webpagelink"},{"comment_id":"10153962435457235","commenter_b":"ive got a few vulgar words for this trump ish.... can not stand her face, her voice, or any damned thing that comes out of her mouth. this woman is a vile creature that needs to crawl back under whatever rock she slithered out from.","commenter_a":"Founding father of porn.","post_message":"It's hard to imagine the GOP getting more juvenile than this -- but let's see what happens tomorrow!"},{"comment_id":"955924071085730","commenter_b":"Jan St John...ROFLMAO!!!! James Taylor is a lawyer with no training in climatology ...he's a sr. Fellow at the heartland institute which draws major funding from the likes of the coke bros,exxon and a number of other oil&gas companies....this is the best you can come with","commenter_a":"It was 40 above in Alaska last week.","post_message":"TELL ALL YOUR FRIENDS"},{"comment_id":"536499096509675","commenter_b":"he is absolutely right, this would not be permanent just temporary until we can get a system in place to do more accurate check on these people coming into our country. fdr did it. and for a good reason .....to protect the American people from harm... that was his job.","commenter_a":"Hell Yes!","post_message":"Do you agree with Trump?"},{"comment_id":"10154341383138067","commenter_b":"yeah,I think it is a great idea because Arnold make America ruined again and Donald make Apprentice again","commenter_a":"Publicity stunt. Stay tuned America","post_message":""},{"comment_id":"1768830776662660","commenter_b":"Lock Her UP!","commenter_a":"Obama is starting civil unrest with the black lives matter movement in Milwaukee, Wisconsin. The black social movement killed one white man and more than hundreds were injured at the crazy riot yesterday.","post_message":"Live now: Governor Mike Pence holds a town hall in Albuquerque, New Mexico."},{"comment_id":"759569737474968","commenter_b":"We also.have to put up.with people like you. I'd welcome anyone from anywhere else before I'd welcome you .","commenter_a":"If we gotta put up with Muslims...why the hell not at least he doesn't want to behead us","post_message":"If you thought he was in jail, you thought wrong."}]
