[{"comment_id":"10153618306573352","commenter_b":"Please baby I have money I'm rich bitch!","commenter_a":"Well By his looks he is already seriously injured lol","post_message":"Tracy Morgan settles with Wal-Mart after store's truck hit his tour bus, killing his friend and leaving him seriously injured"},{"comment_id":"1243855252377391","commenter_b":"Jennifer, Donald trump doesn't care who you sleep with. Yes, it's better to vote GOP than to vote to import non assimilating Muslims who will cost a fortune and harm our citizens.","commenter_a":"I'm a Bernie supporter who's voting for Hillary whom I think is going to lose to Trump","post_message":"These names would be a huge draw in any feature film, but on Tuesday they lent their star power to another production -- the Democratic National Convention."},{"comment_id":"659791487492443","commenter_b":"yes but he is treating America Badly, Screw him,","commenter_a":"Stop talking about obama, you shoul start building for the vets they deserve it, and you can do it Mr, Donny","post_message":"President Obama looks and sounds so ridiculous making his speech in Cuba, especially in the shadows of Brussels. He is being treated badly!"},{"comment_id":"10155567292775294","commenter_b":"She was making over $20 an hour..... This has nothing to do with wages","commenter_a":"If Walmart would pay decent wages this would not have happened","post_message":"The woman is accused of stealing from the Decatur, Texas store for more than a year, sometimes stealing thousands of dollars a day:"},{"comment_id":"10153028104776037","commenter_b":"She should be in prison!","commenter_a":"What Democrat party lackey will Obama cart out to replace her?","post_message":"#MarilynTavenner, the Obama administration official who oversaw the botched rollout of the #Obamacare website, #Healthcare.gov, announced she will resign as head of the agency that also manages the Medicare and Medicaid healthcare programs."},{"comment_id":"10158544268330713","commenter_b":"Well she is a devil whore.","commenter_a":"I would have paid her to wear it if it have covered that ugly face...","post_message":"Progressives hate capitalism, except when they don't."},{"comment_id":"10152843996092293","commenter_b":"White mid-western girls fall for it...talk to your daughters about that life...","commenter_a":"are they really women or","post_message":"The caption: \"chillin in the khilafah, lovin life\""}]
