[{"comment_id":"900975760004551","commenter_b":"Or woman!!!!!!","commenter_a":"Not just white men no man should talk like that it is bad what ever color they are.","post_message":"RT LeBron James: “White Men Don’t Have the Right to Talk Like Trump in Locker Rooms or Elsewhere”"},{"comment_id":"10153509190373132","commenter_b":"Let her die with respect!!!","commenter_a":"I'm all for it I had to watch my husband die stage four brain Cancer that spread to all organs and bones to see him in so much pain and high doses of morphine to watch what he went through and reading about Brittany I say go for it the right to die with dignity God bless my heart goes out to you and all of you that are going through hell","post_message":"\"I can't wait. My daughter can't wait. I owe this to myself, and I owe this to my daughter. She's either going to come home and she's going to have to discover my body, or she's going to have to watch me die painfully.\""},{"comment_id":"10153428772146509","commenter_b":"Cause she was worthless and weak that's why!!","commenter_a":"Why would you choose the classroom to do that?","post_message":"There was no indication of foul play, and every indication that she took her own life, officials said. @webpagelink"},{"comment_id":"10152996747985950","commenter_b":"look at the KKK what a bunch of ugly losers... lmao...","commenter_a":"Good","post_message":"More rallies have been planned..."},{"comment_id":"10153818527657623","commenter_b":"Nope, because how would we get our food? Most illegals work in Agriculture, and farmers said they don't want them removed. I don't think illegals are our problem. They pay billions each year in taxes. For example, food, sales, telecommunications, cable, transtportation, gas, etc. If we got rid of them, we would lose in the end no matter how many jobs we would get in industries that don't require I-9s.","commenter_a":"It's sad, heartbreaking, and demoralizing to people on that side of town that have tried to do anything to help curb the problems. The answer is not to make the situation worse by closing the store. The store is the lone grocery story on that side of town @username. That is not going to help. The solution is to deal with the poverty on that side of town. People steal and rob and sell drugs for economic reasons. They are broke basically. That's why on the Westside the BP got robbed by the White lady. She was broke, and she committed an armed robbery because she got desperate and didn't know what else to do. It's the same thing that has been happening on the Eastside, it's just spreading across the city. We have to build up both sides. There are things the city could do to help, such as, ...","post_message":"\"Everybody was like 'yes' when we saw him come in. Because we knew it was going to be a good night. Because he would make us laugh.\""},{"comment_id":"1570583689633777","commenter_b":"There is no sense in even trying to reason with these people. They are a whole level of crazy I don't want to be around. Scary! I didn't see riots like this when Obama was elected-because we have class and integrity. Trump will lead this country like no other! I can't wait for the future of America!🇺🇸🚂❤️","commenter_a":"Our country is full of spoiled people who are so used to having things their way, they act like a class of 5 y/o kids who didn't get the green marker! Come on, this country has the same electoral system that has worked without problem for hundreds if years. No one rioted when any other person has been elected, altjpugh i am sure many people felt disappointment. And the democrats and supporters whole campaign slogan was \"stronger together, peace, love, equality\"......... Which all I'm seeing is a true fit being thrown by people who didn't get their way. Funny how true colors come shining out when the world they are used to getting their way in doesn't quite work out. Peace, love, equality, anti hate??? I think not supporters. Your example is clear.","post_message":"Protesters burned American flags and chanted \"not my president\" despite Democrats' calls for a peaceful transition of power."},{"comment_id":"10153045514858908","commenter_b":"Wrong. Anti-vaxxers allow a disease to evolve and make said vaccinations useless. If we ALL got vaccinated, the disease is wiped out and it can't evolve or spread. Science.","commenter_a":"So I go to read the article, and directly above it is a fear mongering advertisement with a link...don't catch shingles. Get your vacination now. SMH If you don't want vacinations dont get them. If you want vacinations get them. If you believe vacinations work then you are in no danger of catching the diseases from the people you are bitching at and preaching to. Mind your own business like people did in the old days before Facebook.","post_message":"Many important points made here are not to be ignored...."}]
