[{"comment_id":"10150650975759999","commenter_b":"Idiots will vote for Trump.","commenter_a":"How do you spell landslide? Trump Trump Trump...","post_message":"When it comes to Donald J. Trump and the 2016 race, \"we're still in the swimsuit competition. It gets harder in the talent rounds.\"  Read on in The New York Times Opinion."},{"comment_id":"1325820547439790","commenter_b":"I would've knocked this old bitch out, no joke @username","commenter_a":"\"If you don't know the language learn it \"she says.........ok .....maybe this old woman should re-learn her own language but properly because......you're a nobodies......isn't quite right and \"just because you come from another country it don't make you nobody\"....what does that even mean? Double negatives in sentences and conjugation the verb \"does\" wrong,,,,,smart woman yup","post_message":"This woman's racist rant just got her banned by the mall for life."},{"comment_id":"10156214701425725","commenter_b":"Look at the mad illegal alien","commenter_a":"Look at all the brainwashed Donald Trump fans... Lol","post_message":"Who is winning the debate so far (just last name)? #DemDebate"},{"comment_id":"10153541248725950","commenter_b":"Rape and borders. @webpagelink","commenter_a":"If it had been for Berniestan or Queen Hillary, then nobody would have noticed it and @username would not have written any articles on it.","post_message":"The Ohio University wall has been an outlet for free speech for more than 40 years. But some students say the latest Donald J. Trump-related message went too far, and they decided to do something about it:"},{"comment_id":"10154658880931178","commenter_b":"just some dumb f****** n*****","commenter_a":"I still have no idea who this guy is.","post_message":"Under fire music star Chris Brown ranted against the cops and praised #BlackLivesMatter."},{"comment_id":"1260170427412540","commenter_b":"Rudy Giuliani, just said, before president Obama there was no successful terrorist attack on America. I loved it! these so-called educated white men show their stupidity, every time they open their mouths, he just spit and pissed on the graves of all the 911 victims! , it happened not once, but twice in New York (terrorist attacks), and how could sun-bleached bleached Donald Trump care about the veterans when he said he doesn't like the ones that got captured? And before running for president he has never! donated to any veterans organization, but he's going to take care of the veterans and loved the veterans, he's a real sleaze ball!","commenter_a":"We got nothing","post_message":"Is Donald J. Trump likely to double-down on his proposed immigration ban?"},{"comment_id":"1040367212665366","commenter_b":"Suck a dick Diane.","commenter_a":"TRUMP will close our borders to illegal people. TRUMP will rid us of common core curriculum! TRUMP will temporarily ban Muslims from entering our country.. TRUMP will build up our military to its once held position! TRUMP will dump obamacare! TRUMP will allow the 2nd amendment to stand! TRUMP will negotiate with foreign countries like a hellstorm! And will NOT back down! TRUMP will in for America! DONALD TRUMP loves America! TRUMP will get jobs... DONALD TRUMP is The ONLY CHANCE we have to stay a FREE NATION!!! That's ALL why we NEED DONALD TRUMP for PRESIDENT of these UNITED STATES of AMERICA!!!!!!!!","post_message":"Breaking...  This changes EVERYTHING!!"}]
