[{"comment_id":"10154183744199091","commenter_b":"She is a baby killer","commenter_a":"Trump belives in God and life & Americans clinton she is evil she is for aborting a baby in late term open borders allowing evil in our country no I voted Trump.","post_message":"Who do you think will be the next president of the United States? Send us a blue thumbs up for Hillary Clinton or a red heart for Donald J. Trump."},{"comment_id":"10156450025520551","commenter_b":"She is as dangerous as Hillary","commenter_a":"both---jail time","post_message":"Issa: FBI director would like to indict Clinton and Abedin [VIDEO]"},{"comment_id":"10153141451562894","commenter_b":"She a dub","commenter_a":"@username 😕","post_message":"Kylie Jenner literally just went from 100 to 0"},{"comment_id":"10154963330566509","commenter_b":"Not if we can help it....She is criminal","commenter_a":"Glad to see all the Democrat converts. Hillary will crush Trump in the general.","post_message":"The conservative columnist George Will is advocating that others do the same."},{"comment_id":"1662896673932550","commenter_b":"Her mom's argument is invalid, he's black, cops would have shot him anyway and by the time they got their clerk would be dead too, good job armed guy! (Y)","commenter_a":"Boo hoo my thug piece of shit waste of air got shot. She wanted him in jail so she didn't have to feed his useless ass.","post_message":"Normally, I would be on the side of the shooter in most cases, but this...?...  @webpagelink"},{"comment_id":"10154148707777994","commenter_b":"I'm more scared of a white maniac than some isis rag head sitting in a cave.","commenter_a":"They did it in response to capturing the guy behind the Paris attacks. You have to hunt them down and destroy them ruthlessly and make them fear you otherwise they will continue","post_message":"Here are some photos from the scene in #Brussels. The latest -- at least 26 people have been reported dead in the blasts. Dozens of others have been injured. Continue reading about what happened here: @webpagelink"},{"comment_id":"10152938461282293","commenter_b":"GOOD. We need less politics. Clinton's and Bush's destroy this country. Carson is an actual person, not a career politician. Wise people WANT someone who is not a politician, unless you would prefer to stick with the status quo.","commenter_a":"Gifted hands, doesn't mean meant for politics...","post_message":"In Opinion, Dana Milbank writes: \"Carson has little in common with the political class but for one thing: his absolute confidence in his own greatness.\""}]
