[{"comment_id":"10154125168701770","commenter_b":"Oh I see how he filled the room he was in Chicago hahaha the city of thugs","commenter_a":"Can't wait for him to be gone!!!!!!!!","post_message":"Democrats really don't want Obama to leave the White House..."},{"comment_id":"10153021059601051","commenter_b":"What a cruel woman","commenter_a":"All I can say, is he is better off without her for a mother.","post_message":"This baby's mom decided she didn't want him anymore and had him deported."},{"comment_id":"10152900574094071","commenter_b":"I wonder if after building the wall, he will revoke all immigration permits to Scots and Germans and send his relatives back to Europe ... all expenses paid of course! ;)","commenter_a":"I believe that Jeb Bush will become the next president of the United States.","post_message":"Here are all the best moments from Donald J. Trump's presidential announcement."},{"comment_id":"1256931770993517","commenter_b":"Shut-up... and please die!....","commenter_a":"No laws we have on the books would have prevented what happened.","post_message":"\"People on the No-Fly list can walk into a store and buy a gun. That is insane,\" the president said."},{"comment_id":"500239873497639","commenter_b":"Quit calling them mulims call them moslems, it is derogetory","commenter_a":"Amen.shut our borders down..asap","post_message":""},{"comment_id":"10154035210569024","commenter_b":"Tap her phone - stop her from murdering people","commenter_a":"Well police next time you see this lard ass limo cross the line pull it over and ticket HER. She is an EX Senators EX dept of state she has NO PROTECTION rights from being stopped and charged.","post_message":"“AFTER SPENDING A ENTIRE YEAR COURTING BLACK LIVES MATTER…”"},{"comment_id":"10154134497810575","commenter_b":"I'm so sorry for your lost child. It sad and terrible we are being made to put up with these illegal criminal invaders.","commenter_a":"Hang him and the next ten people who allowed him to be here.","post_message":"NEW YORK GIRL DIES AFTER BEING HIT BY TWICE DEPORTED ILLEGAL ALIEN...."}]
