[{"comment_id":"10156572722830354","commenter_b":"You are so stupid it hurts.","commenter_a":"SPOILERS: The fact the chick was able to learn the force on her own, without even really knowing anything about it? And then to be able to defeat ren without any sort of training? That alone ruined the movie","post_message":"\"...may be the worst thing ever to have happened in the history of cinema.\""},{"comment_id":"936551829771205","commenter_b":"The United States is a weapon of mass destruction. NO MORE WAR.","commenter_a":"So you can wittness more families lose their love ones and get richer doung so. How many of your children will you send.","post_message":"The war criminal has emerged from the shadows once again."},{"comment_id":"10154489632511051","commenter_b":"True, LOCK HER UP !","commenter_a":"agree'","post_message":"Newt Gingrich says Hillary Clinton is without a doubt one of the most corrupt politicians in American history. Do you agree or disagree?"},{"comment_id":"1090268744329629","commenter_b":"at least all those illegals your allowing in here are getting to work.","commenter_a":"14.4 million part time jobs.","post_message":"Another positive jobs report out this morning. 215,000 private-sector jobs were added in March.  That's 73 straight months of private-sector job growth."},{"comment_id":"1006224616090150","commenter_b":"Game ko anything basta sugtan lng ko hahahhahahahahaah","commenter_a":"Make ta tonight?!? @username @username dalhun ugma?!","post_message":"Learn how to make chocolate chip cookie dough ice cream sandwiches."},{"comment_id":"1838786586350264","commenter_b":"This is a nothing story, women have been allowed to go topless in Canada since 1995. Grow up and get over the human body.","commenter_a":"Now this is a cause that I can put my hands up and support......Just kidding. I agree that if it's good for one gender, then it should be good for both genders.","post_message":"\"As long as men are allowed to be topless in public, women should have the same constitutional right.\""},{"comment_id":"10154992075558256","commenter_b":"I agree","commenter_a":"Nobody equates \"America First\" with WWII references anymore - most of that generation is no longer alive. If you walk up to the majority of Americans on the street they will not be able to identify that historical reference. You are stretching for a story here.","post_message":"The phrase galvanized a mass populist movement against U.S. entry into WWII. While it attracted a wide array of support, its highest profile spokesman, Charles Lindbergh, blamed American Jews for pushing the country into war.  Trump started using the slogan in the later months of his campaign, and despite requests from the Anti-Defamation League that he drop it, he stuck with it."}]
