[{"comment_id":"10153302418660329","commenter_b":"lol","commenter_a":"I swear the only good thing from this post are all the pictures i'm stealing from the comments for future use.","post_message":"So you ~maybe~ shouldn’t do this while your wife is pregnant."},{"comment_id":"1008727995814878","commenter_b":"Wolves are twice the size of a coyote.","commenter_a":"I bet the majority of you couldn't spot the difference between between a coyote and a wolf either.","post_message":":("},{"comment_id":"10153204502459087","commenter_b":"Mar G Her go back to mexico. this country is for LEGAL immigrants who want to be Americans.","commenter_a":"Trump is for all Americans, whether you're democrat or republican. Go Trump 2016!","post_message":"GOP front-runner Donald J. Trump continues to pull away from the rest of the Republican pack, drawing 33 percent support in the latest Washington Post/ABC News poll."},{"comment_id":"10153409124091955","commenter_b":"End and rescind birthright citizenship, build the wall, kill el shorty, deport the stragglers.","commenter_a":"kinda gives credence to Mr. Trump's assertions on illegals huh","post_message":"EL CHAPO WARNS TRUMP TO SHUT MOUTH"},{"comment_id":"486861261504454","commenter_b":"She wouldn't make a pimple on the queens ass","commenter_a":"YES","post_message":"The Jordanian Queen just put Michelle Obama to shame.  Good. Our first lady is classless. In no way does she represent our country.  Would the Jordanian Queen make a better First Lady?"},{"comment_id":"10154743377731037","commenter_b":"Keep 'em coming. Nothing's going to change my mind or anyone else's. The one thing that all of you had in common before today is that Hillary already had you fooled. It's not working on the rest of us, so sit back and enjoy the next four years that not only I know is coming, but SHE CLEARLY KNOWS IS COMING, hence the grasping at straws that we are witnessing this morning.","commenter_a":"It's hard to distinguish between the most rotten pile of trash this morning! You have: -the \"accusers\", who have remained silent throughout the whole campaign until Andy Cooper asked a question that, in his coke-addled and cock-obsessed mind, he thought would surely win him a Pulitzer. -the Clintons. ('Nuff said) -the MSM thinking that we'd all just magically buy this crap. Don't be fooled, America. You see the direction that they are bending over backwards to point you in. Vote Trump and let them know that you're not going to stand for it any longer!","post_message":"A woman alleges she was raped by Donald J. Trump when she was 13 years old in the mid-1990 — and now Law & Order: Special Victims Unit' is taking on the case."},{"comment_id":"1051057634970056","commenter_b":"Poor woman","commenter_a":"Pro choice equals anti Christ. Stop having sex tie your tubes. No need to kill","post_message":"This is a win for women's reproductive rights."}]
