[{"comment_id":"10153715209333984","commenter_b":"Build a wall and send them home.","commenter_a":"You know illegal Mexicans come in this country illegally the women wait till about a month before delivering their child snake in this country have their child hoping to get birth rights I think if you come in this country out of another country if you have a child here your child is from your country not mine god bless the United States and we're going to try to keep it that way","post_message":"These Texas counties are doing something that has earned them a warning from Mexico, but it doesn't look like they're letting that stop them!  Do you support what these counties are doing?"},{"comment_id":"1172394232854914","commenter_b":"Hell yes !.... Hillary !","commenter_a":"I think Trumps ego is what will make him a great president. He couldn't stand to fail. There's nothing anyone could say to make me vote for Clinton. Don't trust her-don't like her.","post_message":"Make sure you're registered to vote HERE=> vote.gov  COMMENT Below who you thought won on the issue of immigration tonight-  \"Trump\" or \"Hillary\""},{"comment_id":"1252197194828825","commenter_b":"One of the 2 things I don't like","commenter_a":"Smokers are disgusting","post_message":"WARNING TO PET OWNERS: It's not just second-hand smoke that's harmful for your four-legged friends. Pets are also at risk for being exposed to residue that lingers on skin, clothes, carpets, and other household items."},{"comment_id":"1196791103694693","commenter_b":"David, better vote for anyone on the GOP side than voting for the criminal Hillary \"Cankles\" Clinton. The woman should be in prison.","commenter_a":"DO NOT be complacent. Progressives need to come out in the MILLIONS and vote. Otherwise, the Republicans/teaparty, who sold out to crazies who actually want to take a dump on the Constitution and make America a \"Christian\" Theocracy, will win.","post_message":"Republicans are losing ground in key demographics."},{"comment_id":"1187297661307572","commenter_b":"@username well, fair enough. Lol.","commenter_a":"The comments here have be idiotic, as I expected. Most likely, this was an attack due to their religious identification. I love how when the victim is not Muslim, these (commenters here) jump to radical Islam. However, when a Muslim is the victim, they want to wait for the facts and not jump the gun. Can't have it both ways.","post_message":"Shot in the back."},{"comment_id":"1099239800197691","commenter_b":"Brave Women! I hope they don't beat you with a shoe!","commenter_a":"Yet, elsewhere they are romanticizing misogyny.","post_message":"Women in Iran risk prosecution if caught contravening the ban, which was issued by Supreme leader Ayatollah Ali Khamenei."},{"comment_id":"577625642398915","commenter_b":"I was going to say not everything you see/read on the internet is true- A very nice friend once told me that- so...where's the link to the factual article or video or actual statement? You can't believe it just because somebody posted it & made a meme out of it!!!😐","commenter_a":"At least at this election I will not be voting for a party that would take such a pledge and perhaps n ever will again.","post_message":"Republicans have been plotting to obstruct Pres. Obama since the day he took office, and now they have the audacity to ask for your vote this November.   Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"}]
