[{"comment_id":"10153430098934342","commenter_b":"Lame","commenter_a":"Keep control of your dog. If your uncontrolled dog bites someone it is a felony.","post_message":"The dog darted between her owner's legs and out the door. Seconds later, the beloved pet was lying in a pool of blood."},{"comment_id":"10155394034488352","commenter_b":"I used to work as cashier and I witnessed a couple of white people trying to pay for others people groceries so they will get the cash . They will go around asking Hispanics mostly Mexicans to pay for their groceries so the Mexicans could give the cash to them??? Yup cheating the damn system , of course we wouldn't do it for them . This bitch came to me one time and Infront of me she offered to pay this Mexican ladys stuff and I said to the Mexican lady don't do it , she's asking to do something illegal . The bitch was like why you telling her that ,I was like look I can take your name right now , you are on camera and I have this lady as witnessed. I can contact social services right now and tell them what you doing .... You will ...","commenter_a":"If you gave them citizenship most would turn it down. These people don't want that. Then they would have to pay taxes. I work with mexicans and and other immigrants. The legal ones I work with didn't like the illegals on Fridays cause they brought home more. If yaw people want all these immigrants here so bad take them into your homes. Our country can't handle anymore forms of welfare.","post_message":"It's open season on illegal immigrants: Trump declares that ANYONE in the US illegally can be deported, regardless of whether they've committed a crime"},{"comment_id":"10153294760143984","commenter_b":"Who gives a flying flip of these two self serving godless people? They are both the horse's ass and should be ignored! !!!","commenter_a":"I wonder how it got that way ???????","post_message":"It seems as though Wild Bill's love life wasn't the only thing that was out of control in the White House during the Clinton's tenure..."},{"comment_id":"698823633563273","commenter_b":"Well then stop her. Isn't that your job?","commenter_a":"Yes a female Eric Holder,","post_message":"GOP leadership should stop the Loretta Lynch nomination by not reporting it to the floor for a vote. We must reject lawlessness, outright."},{"comment_id":"10153444924104312","commenter_b":"Because it would cost pharmacutical companies lots of money if they didn't have cancer and other illnesses. Basically, all it is is reducing the amount of acid you put into your body from drinking soda, etc. They even make stuff you add to your water to alkalize it. Things like soda, obviously, and even milk although it is alkali in the container, once ingested it turns acidic and wreacks havoc on your body. Lemons, albeit acidic on the outside actually turn alkaline once ingested. You can actually look up guides to acidic and alkaline type foods. If you go to a Walgreens, health store, or wherever and pick up a roll of test strips in the health aisle, you go home, pee in a cup/container, dip the test strip in and look on the chart to see how much acid is in your body, then you take the steps necessary ...","commenter_a":"Want the cure? Eat right and use alkaline test strips until you test as alkaline as possible. Cancer feeds off the acid in the body, the more acidic you are, the better chance of the cancer spreading. If you are alkalized, cancer has nothing to feed on.","post_message":"A young woman has become the first person in the world to give birth to a healthy baby using ovarian tissue that was removed and frozen when she was still a child."},{"comment_id":"10154045995555329","commenter_b":"@username No Danie, they're too scared to do anything because FEMINISTS THREATEN TO KILL THEM.","commenter_a":"As a man who would literally NEVER talk to a woman like this, I'm ashamed and embarrassed that men actually do. Makes me sick. I was always taught to treat women with respect. Guess that doesn't apply to my fellow man...","post_message":"ICYMI"},{"comment_id":"10153540355058984","commenter_b":"It's not just abortion Drs. all Drs. Make obscene salary's. Abortion should only be for rape victims, incest victims !","commenter_a":"it wont do them any good in HELL!!!","post_message":"Here's something shocking that Obama and His Planned Parenthood cronies will not like.   Do you consider these outrageous abortion salaries \"blood money?\""}]
