[{"comment_id":"1220607601313429","commenter_b":"Lena Al","commenter_a":"Sinéad check this out","post_message":"Sounds about right."},{"comment_id":"682877985236113","commenter_b":"Carrie is a rich beeeatch!","commenter_a":"Liberals need to keep their views to themselves....Carrie, is a sweet mother and wife, and can teach her son what she wants to teach him, regardless what others might say: Because, He is HER child not the Liberal idiots, out there...!!!!!!","post_message":"Liberals are going after Carrie Underwood for her faith, she needs your support.  She is a true Christian. Let's get her back.  Can we get 85,000 'LIKES' for Carrie Underwood's faith?"},{"comment_id":"1065496103473179","commenter_b":"J.K. needs to mind her business.","commenter_a":"WOW! She shut it down! OMG! Trump is backing down because a writer...no wait! This article isn't about the writer...it's not about Trump. It's about Pierson. No wait, it's about a writer comparing to one of her make believe characters. Jesus, if your going to attack; pick an opening paragraph and stay on topic. If you can't do that...atleast get the headline to reflect the topic...","post_message":"Just 5 words  and they say it all."},{"comment_id":"10153245501553984","commenter_b":"This is a state matter not federal.If these Muslims can't live by the laws that are already here and set then I suggest they leave.Preferably the latter.","commenter_a":"go girl ... rippem up !","post_message":"Political correctness is NOT in this mayor's vocabulary.   Do you support her stand against Sharia Law?"},{"comment_id":"496037443910043","commenter_b":"MR TRUMP WHEN YOU BECOME PREZ> HANG A FEW DRUG DEALERS ON COURT SQUARE THEN THEY WOULD THINK TWICE ABOUT SELLING DRUGS TO YOUNG CHILDREN AND DESTROYING ENTIRE FAMILIES!!!!!!!!","commenter_a":"Get them out!!!!!!!!!!!!!!","post_message":"Drug dealers are pouring in from the southern border. We will build a wall on time and on budget. #GOPDebate"},{"comment_id":"420321631489464","commenter_b":"how about someone do a drive by on these losers, it would do the world a great deed.","commenter_a":"Non existent","post_message":"Can you Imagine the Media Coverage if These Guys Were White?"},{"comment_id":"10153970648079091","commenter_b":"Just string her up!","commenter_a":"Sick people!","post_message":"UPDATE: New Mexico mom out of hospital, taken to jail after the brutal murder of her 10-year-old daughter in which police say she was injected with meth, raped, killed and dismembered."}]
