[{"comment_id":"982915058434909","commenter_b":"wake up ladies they use you","commenter_a":"Oh please. Look at him and look at her. Enough said.","post_message":"'I thought he was The One'"},{"comment_id":"10150645509299999","commenter_b":"Apple should have made an iPhone 4C. Then all the women can just buy it. Problem solved.","commenter_a":"I visited China a couple of years ago and my guide, a 30 year old woman had written herself off already for ever finding love. She told me women in China look for the 4Cs: car, condo, credit, cash in a man. I laughed. But she wasn't joking...","post_message":"“Even though she’s a successful woman, she would come back home and be nothing in her mother’s eyes because she is a single woman.”"},{"comment_id":"1063012123817862","commenter_b":"It is under God not no damn allah you ignorant muslim cocksuckers. If you dont like our country,our anthem, our flag,and our laws then by all means get the fuck out and take the clintons and obamas with you","commenter_a":"WTF","post_message":"THIS IS THE UNITED STATES OF AMERICA! Our country was founded on Christian principles. 'LIKE' if you think this is wrong!"},{"comment_id":"1039445359429269","commenter_b":"Ewe, she looks drugged. GHB, JEB.","commenter_a":"I hate that... its like telling you , your my pet.I be your master.","post_message":"At least the younger Bush is a little more smooth with his moves."},{"comment_id":"10154278216444138","commenter_b":"Ridiculous. Killing all of these gators will not accomplish anything","commenter_a":"Let this had been a black family in a gorilla cage. The media would have been outraged about these alligators lives being snuffed out because of these negligent parents! If is says restricted or no swimming, then they should have checked with the lifeguard before putting their child in harms way!!! Not fair to those alligators and MOST DEFINITELY a tragedy for that child. There are terrible parenting skills on both sides. Black and white. Animal rights should have been on this just like Harambe. But then again, it was never about the animal. These parents should have been charged with the endangerment of their baby. Period.","post_message":"A total of six alligators were removed."},{"comment_id":"445168402354286","commenter_b":"Folks are worried about our second ammendment. How about change and uphold immigration laws. For starters vette K1 Visas correctly. Frankly, the current laws aren't upheld now by the lawless folks in our country and government.","commenter_a":"I believe K-1 is a Fiance Visa, wherein the couple must marry within 3 months.","post_message":"***BREAKING***  Muslim Killer Tashfeen Malik was in America on a K-1 (fiancée) visa and held a Pakistani passport.  DEVELOPING..."},{"comment_id":"10153103195541491","commenter_b":"Clearly a publicity stunt again, the shark is obviously a mate of his","commenter_a":"fake shark..","post_message":"Mick Fanning had another close encounter with a shark."}]
