[{"comment_id":"1026655844022093","commenter_b":"so, we didn't have Zero cases of measles in the US in 2000 then?","commenter_a":"Wake up. Measles has NEVER been ERADICATED!","post_message":"Let's take a moment to remember that measles was ERADICATED from the USA in 2000. Nice job, anti-vaxxers."},{"comment_id":"1890349187852006","commenter_b":"One does not have to TRY to cast america in a bad light..... The racists & Nazis here do a good enough job by themselves. America is NOT great, & will never be great again until the cancer which arrived here In 1492 is removed. Swim back to Europe racist beast","commenter_a":"Stupid, stupid, stupid. I only still like this site cuz i wanna read what propoganda u spew next. Has anybody else thought that this site is communist run, or pro russian. They always try to find ways to cast the US in a very bad light","post_message":"OMG, did you hear?   $$ Dump: @webpagelink DAPL Raid: @webpagelink Drone Bomb: @webpagelink Join Us: The Free Thought Project"},{"comment_id":"10152612105311636","commenter_b":"Stupid women","commenter_a":"Because it causes serious mental health pronlems","post_message":"Remind us why this isn't legal in the UK again?  via Independent US"},{"comment_id":"10153717565963812","commenter_b":"Your stupid azz obviously don't have kids... More in like you don't need them you ignorant jerk","commenter_a":"Still a criminal","post_message":"Man accused of robbing a credit union told police he needed the money to help pay for his 1-year-old daughter's chemotherapy treatments. \"I guess it was desperation.\""},{"comment_id":"1836845559870004","commenter_b":"She doesn't deserve to be nominated.. What a laugh..","commenter_a":"Her expressions are the worst.... From her constant head nodding to her wide eyed expressions. And what's worse is when she opens that mouth of hers to spew out a constant stream of lies...","post_message":"Balloons are released to celebrate the official nomination of Hillary Clinton & Tim Kaine."},{"comment_id":"1009683892433898","commenter_b":"ILLEGAL ALIENS should be deported not given drivers licenses and free housing and medical care.","commenter_a":"Why don't you add the rest of the story. Not only did 50% of all California driver's licenses go to illegal aliens, but they have motor voter laws so those illegals are now eligible to vote even though they are not citizens. Non-citizen should NEVER be allowed to vote and neither should welfare recipients who have been on welfare for more than two years. They should not be allowed to vote on how the money from tax payers is spent when they are not paying taxes themselves.","post_message":"Did you know HALF of all California driver’s licenses issued in 2015 went to illegal aliens?"},{"comment_id":"10155155433964778","commenter_b":"She wasn't a black swimmer to me until the media and people who keep stressing the fact of the first \"African American\" ... First off the has been in the past but what I see of anyone in the Olympics is an athlete who trained very hard and worked through their own adversities to reach their goals. To me African Americans want the dividing line to diminish, I know I treat people as people so I think the media should stop putting a dividing line there. I don't care who you are if you want to do a sport and make it to the Olympics with hard work and perseverance you can make it, it's not your color that helps you make it.","commenter_a":"She was just another amazing swimmer to me. I didn't think about her race...SHE made that the issue. It's hard to be colorblind when it keeps getting made an issue BY THE ONES COMPLAINING!! WTF!","post_message":"\"I want to be an inspiration, but I would like there to be a day when it is not ‘Simone the black swimmer.’"}]
