[{"comment_id":"1616996585254121","commenter_b":"Now keep the fuckers from being immigrants in this country","commenter_a":"\"The Brig it is.\"","post_message":"These pirates never saw it coming..."},{"comment_id":"10154473534223812","commenter_b":"@username a female misogynist is what you are","commenter_a":"there are many good women in politics - not Hillary or Elizabeth Warren however.","post_message":"JUST IN: Elizabeth Warren endorses Hillary Clinton for president. Clinton is not ruling out the prospect of having her on her ticket as vice president."},{"comment_id":"1704157759871336","commenter_b":"Hate the show.Bitchy women!!","commenter_a":"Let's hope so","post_message":"The View makes me SICK.   Take Joy Behar off the air NOW!"},{"comment_id":"992775434136459","commenter_b":"That is all these losers have.","commenter_a":"Screw that ignorant pido, GO TRUMP GO","post_message":"Here are the 6 TWEETS..."},{"comment_id":"10153562677106680","commenter_b":"She wouldn't work for him with a gun to her head.","commenter_a":"Please please trump get CONDOLEEZA RICE as ur running mate. I understand that u do not want to pander, but like it or not, this elections , the woman card has been dealt unfairly by crooked Hilary. But i think looking at it positively , trump has an opportunity with CONDOLEEZA RICE. She was a magnificent SOS. Hardworking as hell , logged more air miles then any other SOS. By choosing CONDOLEEZA , trump will also show to the American voters a good example of a SOS. Besides she has great Christian values, very very qualified and better then most of her male counter part","post_message":"Paul Manafort said he'd also be 'surprised' if the front-runner put out his tax returns."},{"comment_id":"1814189528815874","commenter_b":"Hillary is use to debates Trumps not and can't even deal with a woman with a baby during his speech","commenter_a":"Wait until the debates, when Hildebeast turns into a shrieking harpy on stage when confronted about her many, many schemes, scams & failures. Take a poll then.","post_message":"A new Fox News poll shows Democratic nominee Hillary Clinton leading Republican nominee Donald J. Trump 49 percent to 39 percent among likely voters, while 61 percent of respondents say they consider Clinton to be dishonest."},{"comment_id":"10153735094753701","commenter_b":"As long as he doesn't use it as a photo op","commenter_a":"Molly in case you wondered, he flew in on a plane THEN a helicopter. Lol","post_message":"President Obama is expected to land in Eugene a little before noon and then take a helicopter to Roseburg to meet privately with families of the #UCCShooting victims. He is not planning any public events."}]
