[{"comment_id":"1192807494093054","commenter_b":"@username Refugees are not illegal. Go troll someplace elst.","commenter_a":"Children are innocent, they can't be held guilty for anything their parents say or do. And my question is how can you hate war refugees, and many of them children, and still claim you're Christian. The tenet of the religion is to care for the stranger, the wretched, and the sick. Not sure what part of that is hard to understand. Jesus was a refugee, and so were his parents, we seem to forget that. Bravo to the troops, they're doing the right thing.","post_message":"Kudos to these vets for speaking out against Trump."},{"comment_id":"1743445975938698","commenter_b":"Devil at work.","commenter_a":"we should not remove any thing if they don't want to come to come our churches let them go back to there country where they can do as they please..","post_message":"Bishop To Remove Crosses From Churches To Make Muslims More ‘Comfortable’.  America was founded on Christianity!  Do you think this is ridiculous?"},{"comment_id":"10153299722707434","commenter_b":"I thought women hated dick pics. ;-)","commenter_a":"Huh. Where are the usual people who attack women for not being cautious enough? If you don't want to have problems, just don't take naked pictures. How dare this guy not take proper precautions around a woman? How dare he get unconscious? Girls will be girls, you know.","post_message":"Compounding an already criminally terrible idea, she sent the photo and video to her coworkers."},{"comment_id":"10153845645645871","commenter_b":"I would say that since both ladies are jewish and liberal, they don't really care about the women who are raped, stoned, disfigured and killed because they are Muslim. I believe ini just telling it like it is.","commenter_a":"Have any of you followed Naomi Wolf's facebook page? I have for the past couple of years. She's an anti-Israel bigot, and she ignores women's issues whenever they involved Islam. I called her out on it many times. Here's an example.","post_message":""},{"comment_id":"10153311050083037","commenter_b":"Just remember these are people fleeing terrorism NOT terrorist! Living breathing people who are desprete. THEY HAVE NO LESS RIGHT TO DO THAT THEN YOU DO... just because an accident of birth MADE YOU AN AMERICAN","commenter_a":"That is assault, and the spitter better be charged.","post_message":"\"It sickens me to know that no matter how hard I try, there still exists a blur between myself and the decency a human life entails,\" said the student."},{"comment_id":"10152540826575047","commenter_b":"Sign me up, no they should NOT be allowed back in the US, they're a security risk!","commenter_a":"Go fight with the enemy, you be become the enemy. No tollerance for deserters of the American Constitution. You are for America, or you are against America. No gray area here. Don't let these deserters back in. They leave, they stay gone forever!!!","post_message":"American citizens must not be allowed to fight alongside jihadists, only to then return to the U.S. to spread jihad here.   Sign & Share our petition to protect our homeland:  @webpagelink"},{"comment_id":"10157252246585354","commenter_b":"Lorena Bobbitt needs to take care of this demonic trash creature!","commenter_a":"Deplorable.","post_message":"**UPDATE**  That's it?!"}]
