[{"comment_id":"10156471247000354","commenter_b":"Yes...IT IS A WAR AGAINST ISLAM SO...your point is?@webpagelink","commenter_a":"Sticking up for your golden Gose?","post_message":"Can't make this stuff up.   It happened this morning. VIDEO on the flipside..."},{"comment_id":"10154138321738837","commenter_b":"I read she was with the lady already in line she just had more items for her. She did'nt skip the line. That racist pos was out of line enough said! Pendeja!!!!!","commenter_a":"Realistically speaking if you're with someone and they're at the counter cashing out who's going to go to the back of the line if they were \"Together\" and you're only adding an item or two?? saying she should have went to the back of the line is both irrational and impractical... part of the problem is making excuses for the inexcusable...","post_message":"#RACIST RANT RECORDED: A woman's Tuesday night racist rant while Christmas shopping goes viral on social media."},{"comment_id":"1032100616836565","commenter_b":"This Woman is pure Evil.","commenter_a":"hillary maggie mae clinton..........cause the morning sun, when its in her age really shows her age","post_message":"Pro-abortion politicians have ramped up their war on the unborn for 2016. It's up to us to do everything we can to protect them by continuing to build support behind the Life at Conception Act!  Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb171"},{"comment_id":"10153782060807235","commenter_b":"i am embarrassed that this nasty little whore is from my home town. that is NOT the values we were taught in Newton, Massachusetts","commenter_a":"Imbecile!","post_message":"This makes me want to vomit..."},{"comment_id":"1048024048598660","commenter_b":"Disgusting.","commenter_a":"The blessings of new life. I think it's wonderful","post_message":"\"It looks like an alien\""},{"comment_id":"694571907348646","commenter_b":"Lmao!!! @username","commenter_a":"Josh Wilson Connor Bobthebuilder Bithell","post_message":"Chocolate lovers can't seem to get enough of this nose candy. #MicBrights"},{"comment_id":"911829685530326","commenter_b":"She is a pig!!","commenter_a":"Sickening!","post_message":"Pro-abortion Congresswoman and DNC Chairwoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb baby that's not born yet. Her response? No restrictions. Period.  Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"}]
