[{"comment_id":"997480703647380","commenter_b":"Give me a break already,sick & tired of catering to immigrants thy don't need holidays,they need to be deported Muslims & Illegal Mexicans.","commenter_a":"It will be great when Obama change s his address to any o","post_message":"WHITE HOUSE CALL PARTICIPANTS: Want To Change This Holiday to  Immigrants Day (VIDEO)  @webpagelink"},{"comment_id":"969371743179604","commenter_b":"Too bad Donald Trump is here to stay he's going to be the president and beware lady he's going to build a wall and you're probably one of the ones that he's going to be sending back to Mexico because you're probably illegal","commenter_a":"Bought and paid for I might add!!!","post_message":"Protestors in Mexico, I mean California, are saying Trump doesn belong in the United States. What do you think? @webpagelink"},{"comment_id":"1104058139606442","commenter_b":"Not a politician but an accomplished business man, with a reputation for getting things done right! he's got my vote and the illegals can build the F-N wall for trespassing and then get their a** on the other side. And all those anchor babys adios amigos","commenter_a":"Why did you cut him off? He was still talking. That's very disrespectful. You do that again and I will unfollow this page.","post_message":"GOP DEBATE  Watch Donald Trump affirm his commitment to not only building a wall on the US/Mexican border, but making MEXICO pay for it."},{"comment_id":"1698524737097189","commenter_b":"Thanks gents for proving not only is the patriarchy alive and well, but it's also angry and ugly. Your mothers must be so proud.","commenter_a":"Just goes to show you no matter how powerful and important a woman is, men still feel that she is there for their entertainment and enjoyment, and they are entitled to direct her in her appearance and behavior. I'm pretty sure not one of them has said to Donald Trump or Bernie Sanders or John Kasich or Ted Cruz they should smile more, or made comments on the tones of their voices. They respect male candidates and don't see those things as important to a good male leader. But a woman leader? She has to be twice as qualified as the men to be considered competent, and has to be constantly critiqued on elements only seen as important to women: posture, poise, attitude and looks. I'm glad these neanderthals are being called out on their sexist tweets. But this is only the beginning. The ultimate glass ceiling is about to ...","post_message":"Were other (male) candidates called out the same way?"},{"comment_id":"789545591173673","commenter_b":"Some states are allowing people to vote through the DMV instead of going to the polls....most of these states are where the illegal immigrants are.....that is where it is not fair, because illegals can have a drivers license now in some of these states and will vote democrat illegally . That is why it is more important than ever to get out and vote if you want a republican to win.","commenter_a":"I hope the election isn't rigged. The government we have now doesn't want Trump to win. He,will find out too much truth and tell us like it is. No more secrets no more lies. Trump 2016!!!!","post_message":"Time Magazine has me on the cover this week. David Von Drehle has written one of the best stories I have ever had. He brilliantly tells it like it is -- the real deal! Read it!  @webpagelink"},{"comment_id":"10151085765109999","commenter_b":"@username, There is an \"illegal alien\" in the penthouse of Trump Tower. She came to this country without a visa but persisted in working illegally until she found a sugar daddy who would marry her out of convenience. ICE needs to go there and interrogate her to determine if her marriage is a sham marriage for legal status or not.","commenter_a":"Let's face it, Trump does not care about Jews or Israel. It is up to Israel to save itself and work on two states solution. It is the only option to maintain a viable democratic Jewish state.","post_message":"\"President Donald J. Trump may be the last man standing between Israel and a complete, self-inflicted disaster,\" Thomas Friedman writes in The New York Times Opinion Section."},{"comment_id":"1077135272363972","commenter_b":"Stop the madness! Go home!!","commenter_a":"Ignorant people taking up the time of our officers who put their lives on the line everyday. Hope none of them have to call 911 one day.","post_message":"Hundreds of protesters marched through Buckhead, blocking part of Peachtree Road. Several people were arrested. @webpagelink"}]
