[{"comment_id":"10155308331690354","commenter_b":"If these 400 men are really that stupid...do we really want them populating the world anyway?!","commenter_a":"I wasn't aware obama was a follower","post_message":"Other than charisma, how does one convince 400 men this is a good idea?"},{"comment_id":"10152947957269342","commenter_b":"Kill her","commenter_a":"Deviks advocate. There are guidelines for murder. She didn't intend for the baby to die and took it to the hospital So the only real charge would be manslaughter, or murder 2/3 if the baby took unassisted breath which at that gestation isn't likely","post_message":"JUST IN -- Prosecutors say the woman accused of luring an expectant mother to a basement and cutting the baby from her belly will NOT be charged with murder.  FULL STORY ---> @webpagelink"},{"comment_id":"10153178385132061","commenter_b":"Cheesy come back. You dumb blond.","commenter_a":"She's beautiful. I hope she still likes boys. Maybe she's transgender. Not that I care lol","post_message":"\"She's not a girl playing football; she's a football player that's a girl. She plays the game hard, she plays the game tough.\" Meet the teen who was only girl, and a co-captain, on her football team: @webpagelink"},{"comment_id":"10154509463236162","commenter_b":"Same Jen same","commenter_a":"@username... worried for @username","post_message":"HOT DOG RECALL: Put down the hot dogs!   372,000 pounds of hot dogs and corn dogs are being recalled over concerns of listeria contamination.  Bar-S Foods is recalling five chicken and pork products.   The recalled items include Bar-S bun-length and classic franks made with chicken and pork, Bar-S classic corn dogs and Signature Pick 5 corn dogs."},{"comment_id":"973903779296042","commenter_b":"One of the stories the parents were arrested because they did it:( it wasn't an accident.","commenter_a":"I really enjoy reading all the comments by individuals who apparently parent in the most perfect way. (*said sarcastically*) It is so easy to judge someone else, heaven forbid some terrible accident happens on your watch and you have complete strangers calling for your head. In any case, my heart breaks for this family and the loss of their child.","post_message":"#BREAKING A 2-year-old has died after falling into an unsecured septic well near Burlington. >> kiro.tv/SepticWell  Henry Rosoff is heading to the area to learn more on this heartbreaking story."},{"comment_id":"10152960081691051","commenter_b":"My ex wife is a chupacabra!","commenter_a":"Yeah right !!","post_message":"This woman is confident that she found a Chupacabra - and she has proof."},{"comment_id":"10153663985481509","commenter_b":"Americans don't know half the stuff the government does.","commenter_a":"Loose lips don't sink ships anymore or what?","post_message":"The U.S Air Force's 'secretive space plane'... what exactly is it? CNN Rachel Crane reports: @webpagelink"}]
