[{"comment_id":"511888302293280","commenter_b":"this man deserves the right to express himself he fought for our freedom and i thank him and all vets it was not a bullshit war no war is bullshit lives are lost and families are destroyed we need to get back on track in this country starting with respect for each other","commenter_a":"Just because you fought in one bullshit war doesn't mean you automatically get a platform to spout your opinion about crooked cops claiming BULLSHIT on disenfranchised citizens are starting another war! Those killed by cops are ALSO AMERICANS...just FYI.","post_message":"When  asked if he was concerned about his safety, he said, “I’ve seen more than all this. I’ve been through the riots already.”  -Linda"},{"comment_id":"470542439803003","commenter_b":"He","commenter_a":"If she was a man...say so.","post_message":"Michelle thought she could have her way, boy was she wrong.  She forgot that there are still real Americans ready to expose her, we support them 100%.  Do you support their stand against Michelle?"},{"comment_id":"10153324881199312","commenter_b":"1 in 100,000 people infected with measles died before the measles vaccine, meaning even if EVERYONE caught measles in the USA today only 3,000 would die, BUT thats if EVERYONE in America caught it, not millions, and because we take care of ourselves and wash our hands and eat slightly healthier that would not be the amount today anyhow, measles does not mean instant death, and if one more person tries to spread \"herd immunity\" crap I'm gonna lose it, it's not real! We do NOT have herd immunity!","commenter_a":"What concern. Everybody got measles when I was a kid.","post_message":"More than 1,000 students are exempted from measles vaccine in St. Louis area schools. Tonight at 10, 5 On Your Side investigates the concern, the controversy and how quickly an outbreak could occur."},{"comment_id":"10153183802333188","commenter_b":"\"The walking dead\" are serving as most of our representatives in Washington, take a good look next time someone speaks to the Congress.","commenter_a":"Why do you think it's so good? It prepares us for what we might expect in a SHTF scenario.","post_message":"I don't watch The Walking Dead like most people..."},{"comment_id":"1754978767895197","commenter_b":"Trump going to build that wall around your house.","commenter_a":"good lord, no tact at all. Biggest moochers on the planet, biggest joke presidency. Not enough he more than doubled the national debt, now in his mere final weeks, they go ahead and keep living high on the hog. Trump was not my pick among GOP candidates, but doing this stuff for 8 years while telling successful hardworking citizens ,\"you didn't earn that\" or \"some folks are going to have to give up their piece of the pie\" really screamed to everyone on how we don't want this again.","post_message":"Aloha Obamas!"},{"comment_id":"10154086770281756","commenter_b":"I guess science works when ranchers feed their cows corn instead of grass and then have to shoot up the same cows with tons of antibiotics because they are eating GMO corn instead of organic grass. Guess what? Those antibiotics are transferred to humans who eat meat and cause cancers in humans. Be safe, don't eat meat or during dairy milk.","commenter_a":"Why? Wouldn't this be a conflict of interest? It behooves hospitals to feed their patients meat with as many antibiotics as possible so people would visit again in the future and hopefully for a much longer stay.","post_message":"Hospitals are on the front lines of the battle against antibiotic resistance."},{"comment_id":"10154732909385586","commenter_b":"I am glad that this horrible woman will be banned from the store. Shame.","commenter_a":"Betcha Grandma cashes her SS check every month","post_message":"An elderly woman is shown yelling at another woman and her friend, using racial slurs, cursing and telling them to “go back to where they belong.” How's that for Christmas spirit?"}]
