[{"comment_id":"10152774777037293","commenter_b":"Really????!!!haha...yeah thats funny.Is that why he cherishes illegal aliens more than Americans?","commenter_a":"I believe Giuliani is incorrect....I think Obama would like to see a better America....as many Americans would as well!","post_message":"\"I know this is a horrible thing to say,\" he commented."},{"comment_id":"10153443850876680","commenter_b":"For her Clinton Foundation....Just say NO to HILL the SHILL!!","commenter_a":"Hillary Clinton will make a great President ! :-)","post_message":"Hillary Clinton name-checked some of her local allies and shared a series of personal stories, such as the recovery following the 9/11 attack and working with Congress to get first responders health care."},{"comment_id":"1728567140790384","commenter_b":"Probably gonna be built by the illegals","commenter_a":"Let's do it!! Give jobs to citizens.","post_message":"BORDER WALL: President Donald J. Trump is expected to sign an executive action today to jump start construction of the border wall that he promised would be built during his campaign.  MORE: @webpagelink"},{"comment_id":"10155240461128984","commenter_b":"Wow Jim what a brilliant comeback. You most assuredly are a Democrat.","commenter_a":"Another average comment from your average Democrat. Together they all three have a collective I.Q. Of less than 70","post_message":"This is so sad. Our thoughts and prayers are with the family."},{"comment_id":"1786910708245530","commenter_b":"She is a liar !!","commenter_a":"Imagine a Trump led America With a vision to make us great, Builder, businessman, father, With a leader, fighter trait. Imagine factories buzzing, Oil flowing out of the ground, Coal miners packing their lunches, People talking about jobs they've found. Soldiers, sailors, airmen, marines, Showered with Presidential Pride, Strong and able to keep us safe, Respected and feared worldwide. Imagine a really, really big wall, With a big, beautiful door, Swings one way to put out the bad, The other to let in the good. ISIS not even a JV team, Russian Bear back in its cage, Iran decided to take a new deal, Israel safe from all rage. Imagine a man of integrity, A man the world will respect, A man who will fill the office With all the honor we expect. Imagine a Trump led America With a vision to make us Great, Imagine a Trump led America ...","post_message":"FACT-CHECK:"},{"comment_id":"424685420989386","commenter_b":"Not the smartest gal around","commenter_a":"It's a tough way to learn a had lesson. I pray she did and will soon have another job that she will probably appreciate.","post_message":"Was this lady unfairly dismissed?"},{"comment_id":"10158588409000354","commenter_b":"Doesn't help that he no longer has any \"insider info\" from the State Department, does it ????????? Schmuck","commenter_a":"Geez, whudda thunk it.","post_message":"You can't make this stuff up.   #ClintonCash"}]
