[{"comment_id":"10153345194546833","commenter_b":"Tell this liberal she can keep her money. I","commenter_a":"They just need to come take them","post_message":"The Hill:  Congresswoman Rosa DeLauro is expected to reintroduce the the \"Support Assault Firearm Elimination and Education of our (SAFER) Streets Act\" which would offer gun owners tax breaks for voluntarily turning in \"assault rifles\" to local police departments.    \"Assault weapons are not about hunting, or even self-defense, says Rep. Rosa DeLauro (D-Conn.).  is no reason on earth, other than to kill as many people as possible in as short a time as possible, that anyone needs a gun designed for a battlefield."},{"comment_id":"939907909435597","commenter_b":"Aren't most Americans \"Economic Migrants\"?","commenter_a":"Then we have to accept everyone that comes to America theyre refugees well so are people who are running from drug cartels","post_message":"It's the American thing to do. What better way to show Trump and the rest of his racist rivals that they do not represent us?"},{"comment_id":"865998906849825","commenter_b":"godless atheists,satanists THIS FUCKIN FUSE OF LOWLIFES WILL END SOON","commenter_a":"When we start seeing these statue like this around America , that means the devil have claimed this land, God is coming back soon ppl be warned","post_message":"Florida Agrees to Distribute Satanic Temple Materials To School Children"},{"comment_id":"10153548009250575","commenter_b":"Women need to be cooking and cleaning for a man. Free time and they just get weird.","commenter_a":"That's just fkn nasty!!!!","post_message":"The Gateway Pundit - GROSS. Leftist Artist Uses Her Menstrual Blood to Paint Angry Portrait of Donald Trump"},{"comment_id":"1586246148346927","commenter_b":"It looks like the hind end of A stripe ass baboon !","commenter_a":"Not just no but hell no I will burn any I find","post_message":"Michelle Obama does not deserve to have her face on anything. Will you buy these stamps?"},{"comment_id":"1333566343323648","commenter_b":"this sow could stand to lose a few pounds.","commenter_a":"That pig in the black shirt ought to be able to hang on for quite a while...","post_message":"When it's all over and they have their ethnic studies degrees in hand, these student activists will never be hungry again."},{"comment_id":"10153127568784877","commenter_b":"This whole story interests me lol. This lady clearly has some issues, as u said. Smh","commenter_a":"They couldn't tell she is white? We need to be questioning the people who voted her in more than her!!!","post_message":"Rachel Dolezal gave lectures on ‘nappiness’ and ‘the brown paper bag test’, once told student she didn’t look ‘Hispanic enough.’ People from her past are coming out of the woodwork!   Grio fam, do you think the claims that Dolezal is a hypocrite are valid?"}]
