[{"comment_id":"10154425089776509","commenter_b":"Shut up you feminine POS","commenter_a":"Classic example of a Bernie supporter","post_message":"\"Bernie's like a kush, like the best kind of weed you can get,\" Tommy Chong said of Bernie Sanders."},{"comment_id":"10153818527657623","commenter_b":"Nope, because how would we get our food? Most illegals work in Agriculture, and farmers said they don't want them removed. I don't think illegals are our problem. They pay billions each year in taxes. For example, food, sales, telecommunications, cable, transtportation, gas, etc. If we got rid of them, we would lose in the end no matter how many jobs we would get in industries that don't require I-9s.","commenter_a":"It's sad, heartbreaking, and demoralizing to people on that side of town that have tried to do anything to help curb the problems. The answer is not to make the situation worse by closing the store. The store is the lone grocery story on that side of town @username. That is not going to help. The solution is to deal with the poverty on that side of town. People steal and rob and sell drugs for economic reasons. They are broke basically. That's why on the Westside the BP got robbed by the White lady. She was broke, and she committed an armed robbery because she got desperate and didn't know what else to do. It's the same thing that has been happening on the Eastside, it's just spreading across the city. We have to build up both sides. There are things the city could do to help, such as, ...","post_message":"\"Everybody was like 'yes' when we saw him come in. Because we knew it was going to be a good night. Because he would make us laugh.\""},{"comment_id":"969122396467721","commenter_b":"i wasnt created to have babies..a lot of women arent..","commenter_a":"God created us to have babies, not kill them he doesnt like it","post_message":"And abortion is NOT healthcare!"},{"comment_id":"485248011623976","commenter_b":"Ugly little bitch.","commenter_a":"Bush murdered 4500 American soldiers for a lie in Iraq, got another 50,000 maimed, killed 100,000 innocent Iraquis, allowed 9-11 to happened, bungled the response to Katrina, bankrupted the nation, allowed our enemy bin Laden to literally go free, and had 9 US embassies/consulates attacked with over 90 dead, yet these mother fuckers stiil pretend to be outraged over this bullshit....republicans investigated this 9 mother fucking times, at a cost of millions of dollars, and found nothing. This is perverse. Conservatives are the worst enemy this country has ever faced.","post_message":"The GOP wants nothing less than the total destruction of Hillary. -Clay"},{"comment_id":"10153541764830779","commenter_b":"Lmao ugly her ugly ass","commenter_a":"Of course she feeling lemonade considering how many times Bill cheated lol @username","post_message":"Hillary Clinton visited 'The Ellen DeGeneres Show' for an interview that airs today, with the Democratic candidate discussing a variety of topics from potential vice president picks to her admiration for Beyoncés 'Lemonade.' Watch her play \"Who'd You Rather: VP Edition\" below, and see who she would choose as her running mate."},{"comment_id":"1310250435687007","commenter_b":"@username listen bitch you better do your research the final votes were counted today he won popular vote by 699k","commenter_a":"Wow ! Get over it ! Trump won the electoral and popular vote as of today ! If Hillary hadn't been so crooked lies and selling America out to the highest bidder she might have won, but she was caught in way to many back room deals and bad things she should be in prison for treason ! Shame on SNL. To even praise her when the people have spoken !","post_message":"Wow, SNL dropped the comedy and got real."},{"comment_id":"794348560669685","commenter_b":"I learned all this in Men in Black 1 to be honest, and all we need is a Tri-Barrel Plasma Gun. Roaches are obviously Aliens, so in order to truly rid this planet of them, one simply needs 'the jackhammer'.","commenter_a":"Jacqueline and Chris eww! but so cool!!","post_message":"Cockroaches are the worst, but scientists have figured out how to replicate what makes them indestructible."}]
