[{"comment_id":"485625238294723","commenter_b":"Deport her ass","commenter_a":"This woman is a trouble maker and more behind her... Send her back if she cannot obey our system. This goes for anyone, anyone's religion. By the way does she have automobile insurance>> Is she a Citizen of the USA??????","post_message":"A woman is suing the police department... over a hijab?  This woman broke the law, the police are completely in the right.  Do you support our police?"},{"comment_id":"1163757976970226","commenter_b":"The man was certainly considerate in this instance.","commenter_a":"During his eight-year presidency, [George W.] Bush did take 879 days of vacation, including 77 trips to his Texas ranch.","post_message":"Wow. I never knew this about George W. Bush. When he was in the White House, he would never leave for Christmas vacation until the day after Christmas. His reason for doing so was simply amazing...  This story really illustrates the difference between Bush and Barack Obama..."},{"comment_id":"10155581523315192","commenter_b":"Girl should be held responsible for her actions!!!","commenter_a":"Not news.","post_message":"This came to light when a mom received a nude picture of her daughter in a text message:"},{"comment_id":"10153066092873445","commenter_b":"I bet the strippers were forced to strip and what not","commenter_a":"Okay... Retracting previous statement, these fucks need to be jailed... Illegal immigrants being forced into prostitution... Nope! Pigs","post_message":"More DEA Scandal!  DEA Agents Arrested for Lying About Owning a Strip Club"},{"comment_id":"10155599498156002","commenter_b":"@username illegal aliens can't collect welfare...good God, woman....read....","commenter_a":"If they are illegal they need to go ! Immigrants are welcome legally!! NOT Illegally ! Why is this so hard for people to understand this!","post_message":"BREAKING: Trump administration considers mobilizing as many as 100,000 National Guard troops to round up unauthorized immigrants.  UPDATE: White House and Dept. of Homeland Security deny AP report on draft memo for Nat'l Guard deployment for immigration round-ups."},{"comment_id":"10152872139971130","commenter_b":"Says the bitch who makes more than most men... Lmao","commenter_a":"Says the woman who makes a million dollars a movie for acting while the teacher at her kids school makes 50k or less a year! #equalpay","post_message":"PREACH, Patricia Arquette!"},{"comment_id":"897791007078142","commenter_b":"Shes ugly","commenter_a":"Gosh is she going to lose in PA again?","post_message":"Hillary makes disturbing announcement about development in Pennsylvania. We could be looking at history right now. Will you refuse to let Hillary be your president?"}]
