[{"comment_id":"10153953240508984","commenter_b":"We are AMERICANS! As are all legal CITIZENS! We believe in the LAW, THE CONSTITUTION and what it stands for! I don't have a problem with blacks, Mexicans or Muslims! But they seem to have a problem with us! They shoot or hurt us first and because we fight back we are racists? What the heck s wrong with this! Our Lord Jesus gave us two great laws, to love God above all else and to love our neighbors as ourselves! It doesn't say our neighbors have to be white, black, brow, or purple!","commenter_a":"Americans are done with the media as well as p.c.We are not racists or bigots..or hateful people as we are portrayed.We are patriots who are not going to let this country fall.","post_message":"This 8 word statement from the Republican debate was the most important and influential of the evening. Whether or not the candidate who said it becomes the GOP nominee, its far-reaching impact will be felt for the rest of the campaign.  Do you support this candidate's position?"},{"comment_id":"839844146064134","commenter_b":"Women want it all, money,, looks, and a man who does everything right?, that has made me want all the same from a woman, sO far no luck, it's not a hero juzca person who shows love everyday, in everyway and a REAL woman not a Queen to appreciate it!","commenter_a":"If only we were all blessed with that. He's a hero plus a husband who gets it!!","post_message":"SO SWEET! The way to a man's heart may be his stomach, but one devoted husband has proven that women's love can come from a man who can"},{"comment_id":"10153952706726323","commenter_b":"Show the UK the door Lol! We want out and you to go home.","commenter_a":"7 years in England and I have never met an English person that defined themselves as European, British when they want to show how broad their borders can be. We don't even share the same values, we interpret our history in a completely different way. They made of us a 'Brand', neglecting our own background, dignity, honesty, skills, and so on... unless you speak as they do, or you are a CEO,CFO, any kind of abbreviation really will do...only then you will be treated nearly as an equal. Dear Europe, do not succumb to this hypocrisy and show them the door.","post_message":"'I have negotiated a deal to give the UK special status in the EU. I will be recommending it to cabinet tomorrow'"},{"comment_id":"1037048666341760","commenter_b":"Cherokee Hinrichs quickly and painlessly?? Maybe for the one having the abortion, but the living baby that's being killed feels it!! Your another disqusing excuse for a woman!! Be ready for your judgement day, God will sent you straight to hell along with all the other disgusting women who kill babies!!","commenter_a":"Stop the madness. Repeal Roe v Wade. It is a choice. Choose life.","post_message":"Real doctors protect the Sanctity of Human Life!  Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb179"},{"comment_id":"1034762863247926","commenter_b":"She is a super predator","commenter_a":"@username is a strong leader, she is qualified, she is experienced, she is compassionate, has a lot of accomplishments, has been fighting for the equality and human rights her entire career, UNDERSTANDS foreign policy and the EFFECT and OUTCOME of her message domestically and abroad! #IAmWithHillary","post_message":"This country belongs to all of us, not just those at the top—not just the people who look one way, worship one way, or even think one way."},{"comment_id":"10156505662180354","commenter_b":"Give the stupid bitch the boot for good. Free her up so she can go over the Syria and suck up to those murdering rag heads.","commenter_a":"GOOD! This \"professor\" NEEDED to be fired!","post_message":"Read the Christian college's powerful statement..."},{"comment_id":"10153150995326051","commenter_b":"You see how gay women are not fully gay . They still want dick !!!","commenter_a":"Is it a dildo? I'm not clicking I want to guess","post_message":"The police here had seen a lot of strange things before, but even they had never witnessed something quite like this."}]
