[{"comment_id":"948144815307058","commenter_b":"@username I appreciate that... However even though the question was asked by one person and he answered her directly .. He did that in front of an audience... As a parent I get what he's trying to say... But as a woman it makes me angry .. The boys that are being raised need to be taught that when a girl is too drunk to give consent it can be considered rape - I say can because not every girl that has drunk sex is going to consider it rape - but some may - plus it's incredibly unrealistic to tell a college girl to stay away from a party with alcohol... U may as well send her to a convent ..","commenter_a":"This advice isn't blaming the victim. Advising someone to lock their doors at night is not preemptively blaming the home owner for a robbery. Should we live in a world where girls can go to drunken college parties and not worry about being sexually assaulted or raped? Absolutely. Is that the world we live in? No.","post_message":"John Kasich to student concerned about sexual violence: \"Don’t go to parties where there’s a lot of alcohol.\""},{"comment_id":"923311821095206","commenter_b":"Mexicans never botherd me. Keep'em! Deport Trump!!-","commenter_a":"Not a good idea!!! Go Trump","post_message":"Excellent idea! Share if you support this.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1104019902949566","commenter_b":"If she would screw a muslime she would bang anyone , they are animals","commenter_a":"Why does his 15 minutes of fame feel like 15 years?","post_message":"Apparently angry that his girlfriend cheated with a “dirty Muslim,” Zimmerman posted nude pics and contact info for his now ex-girlfriend."},{"comment_id":"650282881785927","commenter_b":"She is such a fool. And not even a human. She needs to be in jail","commenter_a":"Putin looks at Killary, like you are in way over your head old lady. Don't even try to match wits with me.","post_message":"Busted: Clinton News Network's \"Fact-Check\" Proven 100% False!"},{"comment_id":"1008179699229421","commenter_b":"Amen","commenter_a":"Amen","post_message":""},{"comment_id":"502346796622132","commenter_b":"Of course she had to remove that ugly mask - if you don't like it go home!","commenter_a":"Most states have laws that read, paraphrasing now, that it unlawful to conceal your identity when entering a place of business. Maybe someone out there with more interest in law or has more time than I do can clarify? But yeah, the owner can refuse service to anyone they choose!","post_message":"She wouldn't unmask herself, so the store owner demanded this.  Do you think the store owner did the right thing?"},{"comment_id":"10153397476831336","commenter_b":"What do we do when Hildebeast gets elected? She certainly has no opponent in Jeb.","commenter_a":"What he meant to say was this was another victory over the people of America","post_message":"President Barack Obama called today’s Supreme Court ruling on gay marriage “a victory for America.”"}]
