[{"comment_id":"1810345725921055","commenter_b":"Hmmm...either the cop is sissy soft or a female cause they lady whom he/she hit took that B...hit like a Champ","commenter_a":"Someone needs to get at that coward... another good cop right?","post_message":"This police officer was caught punching a woman in the face  the woman was arrested and charged with assaulting an officer and resisting arrest."},{"comment_id":"1759075771038433","commenter_b":"@username...No evidence??? HOW ABOUT 4 DEAD AMERICANS.... HOW ABOUT ERASING YOUR EMAIL TO HIDE IT, WHEN ASKED...HOW ABOUT MISHANDLING TOP SECRET INTELLIGENCE... THAT'S ALL BEEN PROVEN. .. YOU CAN'T PICK AND CHOOSE....YOU CAN LEAD A HORSE TO WATER, THEN HOLD HIS DAMN HEAD UNDER, UNTIL IT QUITS KICKING...THAT'S WHAT IT TAKES, WITH PEOPLE LIKE YOU, IT SEEMS.","commenter_a":"So would we all. As a matter of fact, orange jump suits would look good on all Socialist-Democrats.","post_message":"“Hillary, I’m waiting for what you promised me. All I heard was you getting on TV, calling me a liar. That’s not true, Hillary. I am not the liar. You are the liar.”"},{"comment_id":"1374717489237646","commenter_b":"Deport all Mexicans","commenter_a":"Alot of snowflakes on here. Trump!!!!!","post_message":"LIVE NOW: Donald Trump speaks at a \"Thank You Tour\" rally in Mobile, Alabama."},{"comment_id":"10153697709133984","commenter_b":"He'd never make it to prison if that was my daughter or granddaughter. But since he will hopefully go to prison, its a shame someone never showed him an illustration on a blackboard about the size of your asshole before prison and the size it is when/if you get out. Maybe he would then have had sense enough not to rape a child. When he goes to prison he's going to find out what real rape is like...good.","commenter_a":"Castration sounds good to me. He wouldn't do it again","post_message":"This sick punk raped a young girl and admitted to it... but the disgusting thing is his absurd excuse.  Our country is in deep trouble and this proves it... this little girl did nothing to deserve this."},{"comment_id":"10153085333861336","commenter_b":"Go back in the basement and smoke another duby.. This is an adult conversation sight.","commenter_a":"If Israel has nukes Iran should be able to as well. However, in a perfect world neither country would have them, as Israel has threatened to use them and Iran is a loose cannon.","post_message":"CIA Director John Brennan discusses ISIS, Iran’s nuclear program and Putin’s global ambitions, this week in a 'Fox News Sunday' EXCLUSIVE!  Check your local listings and tune in to Fox News Channel at 2p and 6p ET."},{"comment_id":"1039384902787653","commenter_b":"Wow! Just listen to some of the crazy sh*t that this woman is saying! Talk about freakin' scary! Someone needs to go get her, put her in a straight jacket and lock her up! She is dangerous to herself and others around her! Saying Obama is the antichrist?? Have no clue where this kind of idiot gets off saying the things she does but if I were the CIA, I would be kicking her door down and taking her to GITMO...where she clearly belongs.","commenter_a":"REALLY?? Look I'm half German and spend a lot of time there. Yes it's difficult times there and a clash of civilizations so to speak.but to package this as a massive multicountry deliberate planned invasion of extremists is ludicrous. What is true is that Western Europe in its liberalism has forgotten it's Christian faith and there is a faith vacuum. Alberi wieder des Infoax viel dies Michael Lenz","post_message":"This woman is BUCKETS full of crazy!"},{"comment_id":"1168807776489304","commenter_b":"Mexico has a closed southern border. I'm sick of all those Mexican bigots! I love their food though.","commenter_a":"They learned it from their Parents. They're in middle school, they learned this hatred and bigotry long before Trump. The floodgates are just opening more now. 😑","post_message":"Middle school students in suburban Detroit chanted \"build the wall\" during lunch on Wednesday, hours after Donald J. Trump became president-elect, according to school officials."}]
