[{"comment_id":"10154547365036756","commenter_b":"@username . Some were royal flushed and forced to eat their perpetrators feces .","commenter_a":"you guys just don't understand the pressure of defending your homeland against New Zealand AND Tasmania.","post_message":"The physical abuse, one victim said, was \"systemic, traditional and commonplace.\""},{"comment_id":"10153904359188717","commenter_b":"@username no. The difference is Michelle has brains and doesn't pose nude like some bimbo.","commenter_a":"He takes the stage and introduces his wife who delivers a plagiarized speech.","post_message":"#ICYMI: Donald Trump's WWE-style entrance to the Republican National Convention last night was epic. Take a look: @webpagelink"},{"comment_id":"802131019879954","commenter_b":"Boom!!!!!........... bitches.......","commenter_a":"Karma's a bitch, Isn't she, John?","post_message":"Nice try, Johnny, but the American people are smarter than that.  Read more: @webpagelink Image by Occupy Democrats."},{"comment_id":"1110364735689669","commenter_b":"I'm confident the courts will rule it unconstitutional. They better!","commenter_a":"I suggest that all intelligent, human Oklahomans leave and then we build a wall around this putrid state and let them fester in their backward, flat earth, anti evolution, bible thumping mess.","post_message":"The Republican War on Women continues as a bill making abortion a felony was passed without discussion or debate."},{"comment_id":"941709942541740","commenter_b":"Stay out of my relationship","commenter_a":"This is clearly propaganda to boost the cause to have people see same sex marriage in the same light; it's a ploy, not that I have anything against racial marriage, I'm 100 hundred percent for it but it's no coincidence this is being addressed in light of what is happening this month. When a black man or white man marries a latina woman or black or white woman or Aborigine woman, that is still a man marrying a woman, the way that God had intended. The sexes are complementary and marriage has been since the beginning of mankind, the core unit to propagate the family and for mankind to spread and to flourish. Two males and two females cannot propagate the family that is why they have to take other unnatural alternative measures to achieve this because that is the only way they can. Please don't think I'm putting down ...","post_message":"On this day in 1967, the Supreme Court legalized interracial marriage in the United States. Happy Loving Day! #LovingDay"},{"comment_id":"1244912678938315","commenter_b":"... Hillary Clinton for 2016 ...","commenter_a":"A terrorist killed your son. A terrorist the FBI removed from the watch list.Sorry for your loss, it must be devastating but Obama and Hillary wants more terrorists to come here.","post_message":"\"Christopher's paternal grandparents met and fell in love in a Japanese internment camp, so it was in in DNA that love always trumps hate.\"  - Christine Leinonen remembers her son Christopher, who was killed in the shooting at Pulse Nightclub in Orlando  Watch as the DNC took on the gun lobby: @webpagelink"},{"comment_id":"10153393698278606","commenter_b":"The statement would they would have been fired if it was a white man is stupid,they should have been either way and the point is it wasn't, if this is the kind of judgement they you I wouldn't trust them to protect and serve","commenter_a":"It looks like two hunters with a deer...what's racist about it?","post_message":"One of the two police officers who was fired after posting this photo wants his job back: @webpagelink"}]
