[{"comment_id":"1735932806679169","commenter_b":"Considering those men put their lives on the line to save ours let them fly the American Flag ,","commenter_a":"This is stupid son of a bitch","post_message":"A Rhode Island city official just called local firefighters “terrorists” and compared them to ISIS for putting THIS on their firetruck.  You just can't make this stuff up..."},{"comment_id":"1085812054871914","commenter_b":"Ignorant pig","commenter_a":"Be careful what you wish for buddy","post_message":"\"I think we should take a drug test prior to the debate.\""},{"comment_id":"1687537648127046","commenter_b":"Allison Henn","commenter_a":"I had to solve this once lol","post_message":""},{"comment_id":"1436141653072527","commenter_b":"Europeans, that's a joke all in its self.","commenter_a":"For all those that think protests didn't block traffic in MLK days. Stop using him as your go to pawn thinking you know something about civil disobedience and fighting for rights.","post_message":"It's the image that is defining a protest movement."},{"comment_id":"10153443850876680","commenter_b":"For her Clinton Foundation....Just say NO to HILL the SHILL!!","commenter_a":"Hillary Clinton will make a great President ! :-)","post_message":"Hillary Clinton name-checked some of her local allies and shared a series of personal stories, such as the recovery following the 9/11 attack and working with Congress to get first responders health care."},{"comment_id":"1082304031883694","commenter_b":"@username \"butt hurt\".... It is a comment about grammar.","commenter_a":"What is a \"one and three chance\"? Does that mean we will get hit with four storms? The spelling and grammar people are nonexistent in the media these days.","post_message":"There is a one in three chance of a “historical windstorm for nearly all of Western Washington that would be long remembered.”  Take today to prepare for possible power outages and have some extra supplies on hand."},{"comment_id":"10153069426151770","commenter_b":"GIVE ME A BREAK. !!!!!!!! WHITE LIVES MATTER. LATINO LIVES MATTER. ASIAN LIVES MATTER. NATIVE AMERICAN LIVES MATTER. BLACKS ARE NOT THE ONLY ONES THAT MATTER","commenter_a":"Blue lives come in all colors, both sexes all nationalities. What a moron.","post_message":"TheGrio, the segregated NBC News website, and MSNBC claim racism and \"controversy\" in caring about the lives of police officers."}]
