[{"comment_id":"10154556187833089","commenter_b":"Be remember all of you the one who said refugees should be banned because one tree make million of million matchbox and matchbox born millions trees","commenter_a":"How sweet of him but he just had musks blown up!!!","post_message":"Trudeau says refugees are welcome in Canada"},{"comment_id":"10154336245354740","commenter_b":"Sheep not waiting for facts to fully come out.","commenter_a":"Notice when blacks are killed by other blacks the liberal media, Democrats, Obama, Sharpton, Jackson, Black LIED movement etc don't think twice nor make a sound","post_message":"Hundreds of people marched through the streets Thursday to protest the recent officer-involved shootings in Minnesota and Louisiana."},{"comment_id":"10153009688681051","commenter_b":"Of course hollis god says if you're not with me your against me.. you send yourself to hell .. Muslims will enjoy and do enjoy rape murder and torturing you then sending you to hell.","commenter_a":"How disgusting and disgraceful. Christians are always like keep Christ in christmas, being back the pledge and the nativity scene and I love rebel flags, but the moment another person who doesn't believe their same beliefs is shamed, they point fingers and laugh. all of these people that think deeply offending someone's religion is a joke don't deserve to bear the name of christian. Have some discipline...","post_message":"The Muslims who thought they were buying halal products at this store just found out they had been eating pork the whole time."},{"comment_id":"1374717489237646","commenter_b":"Deport all Mexicans","commenter_a":"Alot of snowflakes on here. Trump!!!!!","post_message":"LIVE NOW: Donald Trump speaks at a \"Thank You Tour\" rally in Mobile, Alabama."},{"comment_id":"10153733142212708","commenter_b":"Looking at the next Presidential Family.","commenter_a":"Have a blessed Thanksgiving. You have a lovely family and we all have so much to be thankful for on this day. All the best to you on the campaign trail. A special thank you to the brave men and women who are serving in our military worldwide who can't spend the day with their families. They need a Commander-in-Chief who can provide them strength and guidance during troubled times and you, Senator, can do just that. Warm regards.","post_message":"From our family to yours, Happy Thanksgiving"},{"comment_id":"10152797676794753","commenter_b":"Typical female.","commenter_a":"He replies.. \" sorry Hun I forgot u said light toast not dark. My bad not happen again\" lol","post_message":"A solider at Fort Bragg in Fayetteville, North Carolina, tried to bring his wife a surprise breakfast in bed Friday morning, but things went terribly wrong."},{"comment_id":"1045198175503230","commenter_b":"BS, keep our money home to help Americans who need it.","commenter_a":"What the??","post_message":"Obama pledged millions of dollars to fight climate change abroad.  And it comes straight from YOUR pocket!"}]
