[{"comment_id":"10152914795481336","commenter_b":"Women, in particular, need to be observant, especially at night! Plus, they would be well-served to get their CCW and learn how to use their weapon---proficiently...!!!","commenter_a":"One of us would not have left there.","post_message":"Police in Texas are searching for a man seen on surveillance video forcing a woman into the trunk of her car at an ATM."},{"comment_id":"1762539284023573","commenter_b":"Adrian Chapman, Anyone that thinks trump is a racist has their head up their ass. Do you even know what the definition of racism is? Illegal immigrants are not a race. Stopping the flow of terrorism from Muslim dominate countries is a precaution to stop terrorism. Not all Muslims are terrorist but terrorist come from Muslim nations. Common sense not racism.","commenter_a":"How many TRUMP SUPPORTERS do you see on national news blocking highways, trying to stop other candidate's supporters legal right to rally.","post_message":"15-year-old groped and pepper sprayed at Trump rally"},{"comment_id":"1252245691520631","commenter_b":"Simple...don't allow anyone in from radical terrorist countries until their country has a way to prove who the person is. Until then they can all stay there and fight in their own countries. Make their own America or their own hell. Whatever they want. But don't do it here.","commenter_a":"Time to shut the doors to these people. All. Until there is a better system.","post_message":"Don't expect to hear a word about this in the media.   This is the kind of info that is horrible for the left."},{"comment_id":"644007369123175","commenter_b":"She doesn't deserve the publicity!","commenter_a":"If this is true, I'm done with McD's....","post_message":"Michelle's face is being plastered all over this fast food chain.  Disgusting. We'll never eat here again.  'LIKE' if you think this is WRONG!!!"},{"comment_id":"1150998668273937","commenter_b":"There are 5 videos.","commenter_a":"This girl was told to leave the classroom. She refused. An officer was called since a teacher cannot physically remove a student from a classroom. The officer asked her to come with him, she refused and pushed him. She had then assaulted a police officer. Which is an arrest-able offense. She then resists arrest while further assaulting the officer (hitting him). Why does anyone think this is ok? These children have no respect for authority. I see most people defending her. Seriously?","post_message":"This guy can bench press 605 pounds, and he threw that tiny girl across the room. And the one they arrest is the girl who was brave enough to stand up to him."},{"comment_id":"1738737039712860","commenter_b":"Republicans are not racist like the democrats would like you to think we just want a safe and secure country. They blocked him bc he wants to give our country away!!!! Illegals do not belong here!! There should be no sanctuary cities to protect them. Anyone coming here needs to take the steps to be a citizen first!!","commenter_a":"Y all the hate? What have Obama done that is so terrible? To my opinion he is one of the best. They races republicans stop him since day one, cuz they want him to fail. Block him all the way...","post_message":"President Obama's approval rating stands at 55% in a new CNN/ORC poll, the highest of his second term"},{"comment_id":"10153130295584726","commenter_b":"Very ugly stupid moron subhuman unamerican criminal creature","commenter_a":"You know when Hillary was running against Obama they tossed Hillary aside, I wish they woudl do the same think now. Doesn't integrity and honesty mean anything.","post_message":"WATCH: Rachel Maddow Defends Hillary From 'Nonsense' Media Scrutiny!"}]
