[{"comment_id":"10154416532115575","commenter_b":"And what about Hillary's fat rearend!","commenter_a":"Ha wouldn't you like to see her have to do a daily weigh in!","post_message":"Democrat Claire McCaskill calls for daily weigh-ins for Donald Trump over media hoax from 20 years ago."},{"comment_id":"10153392928479170","commenter_b":"Don't you feel safe now that the country is being run by grunge mosh pit princesses like this character?","commenter_a":"She is a leftist loon with zero common sense. A perfect fit for the Obama team.","post_message":"The woman who gave you \"jobs for Jihadis\" is now working on the Iran nuclear deal. Time to \"Duck and Cover.\""},{"comment_id":"1493733267320483","commenter_b":"Please go to Danney Williams-Clinton FB page he posted a video called Banished. We need to help this young man by spreading his message far and wide. He may or may not be Bill's son.","commenter_a":"Donald Trump continually tries to deflect his inappropriate behavior towards women by turning it back onto Bill's indiscretions. One issue that everyone seems to be missing is that Bill is NOT running for President. Donald is.","post_message":"Thank you, Michelle Obama."},{"comment_id":"743053085796330","commenter_b":"Idiots !!","commenter_a":"\"It is self-evident that no number of men, by conspiring, and calling themselves a government, can acquire any rights whatever over other men, or other men's property, which they had not before, as individuals.\" -Lysander Spooner","post_message":""},{"comment_id":"10153727792982217","commenter_b":"Written by a 14 year old, no doubt!","commenter_a":"300 times more massive??? Someone needs sacking and a lesson in English 😂😂","post_message":"After a five-year journey, NASA's Juno Mission to Jupiter is ready to apply the brakes.  #BBCGoFigure"},{"comment_id":"10154259788063797","commenter_b":"Omg lol","commenter_a":"@username looollllllll whaaatttt","post_message":"ATTN NEW PARENTS: The perfect solution to a crying infant is every parents dream. One doctor claims he has a technique that can quiet any baby.  WATCH THE FULL VIDEO: @webpagelink"},{"comment_id":"10155217921896320","commenter_b":"she looks like my dust mop!!","commenter_a":"I love it when their hair gets like that. It's so pretty.","post_message":"Halle Berry showed off her new hairstyle at the Oscars, many on Twitter didn't like it.  What do you think?"}]
