[{"comment_id":"658477470966222","commenter_b":"I'm sorry this woman is no good for this country I'm sure there is the woman that be a Great president for this country but she is not the one she is evil and corruptive I see a whole lot of old women who think I got 1 foot in the grave I should vote for a womanwrong","commenter_a":"It still look's like a trash bag on her.","post_message":"Hillary Perón"},{"comment_id":"1310250435687007","commenter_b":"@username listen bitch you better do your research the final votes were counted today he won popular vote by 699k","commenter_a":"Wow ! Get over it ! Trump won the electoral and popular vote as of today ! If Hillary hadn't been so crooked lies and selling America out to the highest bidder she might have won, but she was caught in way to many back room deals and bad things she should be in prison for treason ! Shame on SNL. To even praise her when the people have spoken !","post_message":"Wow, SNL dropped the comedy and got real."},{"comment_id":"1254836874556782","commenter_b":"@username vote blue no matter who.","commenter_a":"Don't forget he also enjoys killing animals in Africa for fun, like elephants! And proudly posing for a picture with severed trunk. If that's not a dick, I don't know what is.","post_message":"Wow. Just wow."},{"comment_id":"10157307268915354","commenter_b":"Definitely yes. We do not want them here. Security risks.","commenter_a":"Go back to your shithole of a country and wear your burqas there.","post_message":"WOW.  Can you name the other 2 countries?"},{"comment_id":"1001534043242046","commenter_b":"Nice thought but it's an AMERICAN FLAG on a WHITE MAN'S PROPERTY that's also a VETERAN. Need I say more Nick as sad as it is he is still defending his FREEDOM, his CONSTITUTIONAL RIGHTS, the AMERICAN FLAG and this ONE NATION UNDER GOD.","commenter_a":"I just hope he called the cops because it could be a hate crime, and its attempted arson,","post_message":"Marine Vet Who Flown an American Flag in His Front Yard for 15 Years Wakes Up to a Sad Sight:  Can They Do That? (VIDEO)  PROUD AMERICANS ARE UNDER ATTACK!   @webpagelink"},{"comment_id":"1832391937045878","commenter_b":"Don't tell Muslim terrors because all Christian terror everyday kill 1000 children in Syria and no body have tell about that..again I said that don't tell Muslim terror","commenter_a":"I would like to hug this peoples","post_message":"BREAKING NEWS: Berlin terror attack... At least 12 dead as truck ploughs into Christmas market  Full story: @webpagelink"},{"comment_id":"10156261922235354","commenter_b":"Time to go home.","commenter_a":"Don't know Trevor ...M and glad of it.","post_message":"Nevertheless, Trevor Noah still trashed Dr. Ben Carson for being \"callous.\"   No joke."}]
