[{"comment_id":"611841178976490","commenter_b":"Ha.....snake in the grass. Call her out.","commenter_a":"send Hillary to live with the Arabs.","post_message":"FUNDING TERRORISM --- AND THE CLINTONS."},{"comment_id":"10153256342071336","commenter_b":"Thank you.","commenter_a":"Good! He deserves it!","post_message":"Breaking News: Jury sentences convicted Boston Marathon bomber Dzhokhar Tsarnaev to death."},{"comment_id":"1700572513518601","commenter_b":"Wow,that cat was terrified when he seen this woman..","commenter_a":"@username i told you not to go there lol","post_message":"WHOA! That moment a rare Florida panther flies by you on your nature walk...#FloridaLife  STORY: @webpagelink"},{"comment_id":"10153391185232217","commenter_b":"Lol. First...there are,a lot of people that doesn't know who she is. I personally have seen some of her exploits, but wouldn't recognize her voice. And second most that do follow her \"music\" doesn't care what she does. Nobody gets mad at strippers. Nobody expects her to be smart...just dress in as few clothes as is legal and shake that azz. And lastly...the demographic that was knowledgeable enough to be outraged...went to work.","commenter_a":"Silly racist white people!!!","post_message":"They really weren't happy about Beyoncé's Super Bowl performance, calling it \"racism\"."},{"comment_id":"405246192933309","commenter_b":"To many people have nothing to do but bitch","commenter_a":"What is wrong with it, it could mean God bless or whatever God you pray to","post_message":"Should this religious phrase have been banned?"},{"comment_id":"10156326796940725","commenter_b":"Alexander Gregoire Well? Let's help the guy out and get that wall built! #MakeAmericaGreatAgain","commenter_a":"Soon, please.","post_message":"Eight Syrians were just caught on the southern border trying to get into the U.S. ISIS maybe? I told you so. WE NEED A BIG & BEAUTIFUL WALL!"},{"comment_id":"685160418299400","commenter_b":"He going to build a wall!!!!! What an asshole","commenter_a":"Oh, Jennifer....I LOVE your post....thank you....you just made my day....","post_message":"Oh this is precious."}]
