[{"comment_id":"10154299130956077","commenter_b":"Trump women are hot","commenter_a":"Shots everytime trump stutters or says he has property there","post_message":"Hillary Clinton and Donald J. Trump meet in St. Louis for the second presidential debate."},{"comment_id":"458714004327362","commenter_b":"Whinny assed little bitch is what he is","commenter_a":"Lies or on all sides. It is politics and hard to see who really is lying. Media is a manipulator.","post_message":"These are some heavy-duty tweets..."},{"comment_id":"10156217121965725","commenter_b":"@username, ur just a stupid liberal who wont open ur eyes... If u think Veterans get better treatment than these illegals ! You must be screwing one. Idiot","commenter_a":"America needs Trump for President !!!","post_message":"Notice that illegal immigrants will be given ObamaCare and free college tuition but nothing has been mentioned about our VETERANS #DemDebate"},{"comment_id":"10152639430074071","commenter_b":"As a kid I really enjoyed the Daredevil movie. Watching it now... yeah lol. I do like the character though. I hope Netflix does it right :)","commenter_a":"Rodrigo Rubio Camara","post_message":"It's time to welcome him back."},{"comment_id":"10152999247891037","commenter_b":"Women dont fight wars....","commenter_a":"If a woman has a bright future she has an option to abort the baby, men don't. Give Men equal rights!!!","post_message":"A new report out today from the Guttmacher Institute shows that 57% of women now live in a state considered to be hostile or extremely hostile to #abortion rights."},{"comment_id":"1295210740519395","commenter_b":"You bitch need to learn manners and parents to teach you some.","commenter_a":"That bitch needs a straight jacket and a rubber room","post_message":"The video of the assault is appalling."},{"comment_id":"10153090058473984","commenter_b":"Fry her dam ass","commenter_a":"GOOD!!!","post_message":"She probably thought she had gotten away with it. Not so fast, Hillary...  Should she face criminal charges for this?"}]
