[{"comment_id":"10153793064907452","commenter_b":"We have to go bail him out!!! 2,000 pesos!!!","commenter_a":"Sal zorro is at it again 😂😂","post_message":"As officers rushed to the Los Angeles International Airport amid false reports of shots fired, they encountered a man dressed as Zorro outside Terminal 7. @webpagelink"},{"comment_id":"1152602824750026","commenter_b":"You betcha! Right on the money! She's.a proven liar , Fraudster and a money/ power hungry bitch !!","commenter_a":". Blame Democrats for Flint Water Crisis says Michael Moore?....Democrats knew the water was poisoned for 18 months Moores tweet --> @webpagelink","post_message":"Is Sanders worried that Clinton is not honest, trustworthy?"},{"comment_id":"10153147008285950","commenter_b":"I love a drink but when I got pregnant I stopped and even though I am dying for a cold one in the warm spring sun it has to wait until bub is out and I am not breast feeding. I am due in oct. woman need to realise it isn't about them anymore.","commenter_a":"I remember my Dr saying a drink would be fine","post_message":"Slightly more than 3 percent of pregnant women admitted that they binge drink, consuming four or more alcoholic drinks at a time, according to the report from the U.S. Centers for Disease Control and Prevention."},{"comment_id":"703956159761577","commenter_b":"this universe. She is vermin! Excuse me vermin.","commenter_a":"NOTHING is too horrible to say to her. She embodies every disgusting thing wrong in thi","post_message":"Ann Coulter wasn't the star of the roast, but she took a lot of the heat."},{"comment_id":"10154335459871509","commenter_b":"Bret, insults show a lack of intelligence, but continue.","commenter_a":"10 Reasons for Supporting Trump 1. Donald Trump is immune to special interest lobbying because he has accepted no donations or special interest money. No other candidate can make this claim. 2. Trump knows how to negotiate. No one builds an international business empire the size of Trump without being able to win at the negotiating table. 3. Donald Trump is an executive. The President of the United States is the Chief Executive Officer of our nation. We don need a policy expert or a legislator we need someone who knows how to run an organization. Trump is the only candidate who has a proven record as a successful executive on a large scale. 4. Trump is a man who tells the truth. He may not always say it in the most polished way, but our country has had enough suave liars. It is time for some straight forward honesty. ...","post_message":"Emotional scenes at Vancouver airport."},{"comment_id":"1817582348453684","commenter_b":"Fuck me there is a lot of racist humans on this tread","commenter_a":"He should get custody","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"},{"comment_id":"1641151569508654","commenter_b":"@username: no fault but Puerto Ricos...pretty sure they had a chance to vote for independence, and y'all didn't take it. You can have all the cultural pride you want...but it's the Olympics man, it is only for countries to compete in. Why not have Coca Cola and Pepsi join in?","commenter_a":"The underdog defeating the #2 in the world for gold.. Monica eres grande!!! PUERTO RICO!!! and to the bunch of salty Americans go read a book and learn about the damage the USA has done to PR!!","post_message":"After some of her more dramatic points, fans were shouting \"Si se puede\" and waving the flag of Puerto Rico."}]
