[{"comment_id":"1488583267837295","commenter_b":"Are there ANY sane, normal, decent and honest people who want to do this job?","commenter_a":"He's angling for the Sec State slot if Trump gets elected.","post_message":"Most people don't really struggle with this question."},{"comment_id":"10156595781460192","commenter_b":"Not Christian not even NICE!","commenter_a":"Lets just all work to eliminate race ...that so hard","post_message":"What are your thoughts on this sign?"},{"comment_id":"750991365034044","commenter_b":"Ok idiot if you want to require those mothers on welfare to work \"chain gangs\" to \"earn\" their food stamps does this mean you're willing to pay their childcare while they do so? You think most young mothers WANT to live on assistance you're a bigger Tard than you sound! The only way this maybe possibly would fly is if you held the FATHERS accountable too!!!! Duh.....sorry it's obvious you barely made it through ninth grade TROLLER","commenter_a":"I've been saying this for years, they say our roads suck well get the freeloaders on welfare to go fix them, instead of chain gangs picking up trash make them do it. It's no ones fault but your own if you want kids, make sure you can support them! Welfare should be a times thing like a year after that your done. If you think flipping burgers is beneath you guess what if it means you have food, shelter and clothes it beats nothing at all if you have to work two jobs that's on you, maybe you should have made something of yourself! No more giving illegal aliens good stamps or any kind of government handout. You want to be an American go get a job and pay taxes like everyone else!","post_message":"Take note.....it's damn brilliant."},{"comment_id":"10153069431726045","commenter_b":"Don't run pretty girls. You're just gonna trip over that invisible tree branch and fall at his feet.","commenter_a":"90model gold marque mercury. Missing a hub cap. Asking anyone know the CAR...not the man.","post_message":"Huntsville Police hope you can recognize the car this man drove when he robbed the PNC Bank at 1470 Perimeter Parkway Wednesday afternoon."},{"comment_id":"10153155479946051","commenter_b":"I take it, SHE is a woman who likes to dress as a man.","commenter_a":"Disgusting","post_message":"This soldier has been told point blank: You must wear a female uniform if you want to participate."},{"comment_id":"1002700983109302","commenter_b":"Someone should ducktape her mouth","commenter_a":"Somehow, that doesn't look \"allegedly\".","post_message":"Woman facing animal cruelty charges after allegedly duct taping her dog’s mouth shut, then posting photos on Facebook: @webpagelink"},{"comment_id":"868659363156855","commenter_b":"You have never been raped!","commenter_a":"The allegations are a joke.","post_message":"Too much?  #GoldenGlobes"}]
