[{"comment_id":"675938265864099","commenter_b":"@username you wish your wife could be a go go dancer.","commenter_a":"Melania is an absolutely classic beauty. Proud of our new President and First Lady. May this country start healing and become whole again.","post_message":"Donald J. Trump was just sworn in as the 45th President of the United States.   How does this make you feel?"},{"comment_id":"936129599822500","commenter_b":"Why did they come here? Get out, do back from whence you came.","commenter_a":"Get the hell out of our Country!!","post_message":"RT If these people want Sharia Law they should go back to their own country."},{"comment_id":"10152743176086545","commenter_b":"It actually doesn't take that long anymore for capital murder death sentences for them to be executed.","commenter_a":"To bad the state can't appeal for the death penalty versus life in prison","post_message":"\"I wasn't surprised by the verdict, just based on the overall tragedy of what happened. I was very disappointed that the jury reached a conclusion so fast. We were very kind of shocked by that,\" he said."},{"comment_id":"1154038954631400","commenter_b":"@username show this to your boo.","commenter_a":"This made me think of you, Raima. And also laugh really hard.","post_message":"Will Ferrell: comedian, actor, just your average millennial."},{"comment_id":"1817582348453684","commenter_b":"Fuck me there is a lot of racist humans on this tread","commenter_a":"He should get custody","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"},{"comment_id":"870392283014938","commenter_b":"Just deport them","commenter_a":"Let them starve","post_message":"ILLEGAL ALIEN CRIMINALS ON HUNGER STRIKE IN AZ PRISON Give List Of Demands Including Removal Of Threat Of Deportation"},{"comment_id":"10153757809364877","commenter_b":"She wouldn't even have had the chance to do that to me, once I saw the knife in her hand it would be over for her with the quickness! I hope she gets arrested and that boy leaves her high and dry if he hasn't already!","commenter_a":"He should run and never look back","post_message":"Woman holds knife to boyfriend’s throat, forces public apology for flirting on Instagram.   Grio fam, how would you react if your son or daughter was in this relationship? Please be advised that this footage shows graphic imagery."}]
