[{"comment_id":"10156410831030725","commenter_b":"U not Gona win ginger bread","commenter_a":"Letssss go !!!!!","post_message":"The last person Hillary Clinton wants to run against - is Trump! I will be her worst nightmare! #Trump2016"},{"comment_id":"10154282422068128","commenter_b":"\"So Veli, I saw an article about you in the WSJ today...\" Haha, but my only interactions with him were over email, so as far as I know...","commenter_a":"@username veli?","post_message":"“Just when I wanted to nominate Jill Watson as an outstanding TA,\" it turned out she was computer."},{"comment_id":"10154710318354062","commenter_b":"GTFOH... U don't own this planet girl!! GOD knows no borders right Angie? Get off ur high horse! Stop looking down n help another up!!","commenter_a":"what part of ILLEGAL do people NOT get??? GO HOME!","post_message":"Dozens of protesters have gathered on the University of Houston campus in advance of tonight's debate. Live team coverage coming up at 6."},{"comment_id":"801271216730122","commenter_b":"This piece of garbage needs to go ahead and leave our country and take Kanye with her far far away","commenter_a":"Your the problem,and your friend obummmmer pos.","post_message":"Oprah Claims White People Are The Cause Of Racism In America. She's lost it. What a hypocrite. Do you think Oprah is the racist?"},{"comment_id":"10154682154393984","commenter_b":"She's the whore of Babylon","commenter_a":"Let me tell you all her dx.......she needs Jesus Christ!!! Maybe she is possessed by a demon, highly likely......! God has allowed her to come to ruin because she wont turn from her wicked ways.....for those who do not like my comment.....read your bible, you will find out lots a things God allowed to turn people away from sin!!!","post_message":"There's been lots of speculation about what might be ailing Hillary Clinton, if anything. One dental expert took a look inside Hillary's mouth... and almost instantly, he said he knew the condition that's been causing all of her health problems.  Could this expert be right?"},{"comment_id":"10155066492903352","commenter_b":"this dirty ass white trash have nerve to say something rude tlking about in my mother country do Thy use punctuation marks Bitch u just went thru ur pic on Facebook first of all you hve two boys how wuld I feel if some one were to follow the boys in rape them but then again you look like a crak head so u wuld not give two fucks right stop hittin that pip b4 you wanna tlk about other people in there country trailer trash Bitch don't u hve some beans to go warm up in the fire in eat","commenter_a":"Fa real if you can have the nerve to to that to a child who barley can right his name an innocent baby in the Lord's house you shuld get more than yur face ate in my mother country we wuld have tie his ass up in take turns slicing his body parts mKe him then make hungry stray dogs eat his freaking dick in his balls then when thats over set his ass on fire wile the mother stabs him his ass to see","post_message":"A mother let her 4-year-old go to the bathroom alone during Sunday Service…Rolls Wheeler, 39, followed the boy when he got up, and raped him in the restroom. ----> @webpagelink"},{"comment_id":"642467755916056","commenter_b":"@username # F*ck Hillary","commenter_a":"Clinton the queen of Benghazi and hidden e-mails. Just look at the media. They are piling on Trump while giving Hillary a pass. The debates are still too come. There is a long way to go. Hillary is a sociopathic liar and should never be president. @username and the polls mean nothing right now.","post_message":"Hillary Clinton opened up a 15-point margin over Donald J. Trump in one of the polls."}]
