[{"comment_id":"1110020542374518","commenter_b":"She makes me sick to my stomach. What a hypocritical arrogant witch.","commenter_a":"What me worry, the election is in the bag, my lemmings will vote for me regardless of what I do........","post_message":"Hillary Clinton is quickly running out of ways to make herself appealing to voters on the left increasingly turned off by her political corruption and ties to corporate cronyism. Grasping for something to counter her weaknesses, Clinton has decided to patronize black voters with talking points attacking “white privilege.” @webpagelink"},{"comment_id":"533721010147110","commenter_b":"Or maybe we should learn from history instead of repeating the same mistakes over and over. Illegal immigration didn't work out too great for the Native Americans. Has illegal immigration worked out for any culture? We all have a set of keys for our lives, hence I believe we all can agree on a measure of security. I say who comes into my home, you say who is allowed into your home. We can decide on who we let into our community. I wholeheartedly welcome people wishing to be an American. I am against the culture of Islamization and separatists who don't value American principles or agree with our civil rights. There are many different developmental frameworks: Republics, Monarchy, Communism, Islam, etc. Islam is an entire framework of religion, social, economic, legal, political, and military standards which is completely incompatible with American laws, Bill of Rights, and the principles I ...","commenter_a":"I believe this is a good moment to revisit Donald J. Trump policy on going after the families of known terrorists. Seddique Mateen supported the Taliban. His son Omar Mateen should have been deported already. Trump Fan Network get the word out. Donald J. Trump will institute policies to prevent these tragedies. Furthermore, the laws designed to go on the offensive for this threat should be a mix of \"aiding and abetting felons\" with counter-terrorism.","post_message":"The FBI interviewed him twice in 2013 and again in 2014, but determined he was \"not a threat at that time.\""},{"comment_id":"682384888576953","commenter_b":"Dumb woman.","commenter_a":"Well she said she meant it in jest and didn't much care if people are offended. So she did admit she was the person that posted it. Now that the voters know who she is the question is will the party still support her. My guess is yes.","post_message":"And you know it wasn't her fault, right?"},{"comment_id":"10153470437544726","commenter_b":"Send her ass packing!!!!!!","commenter_a":"She's from florida and hates america. Go away!","post_message":"WATCH: Ariana Grande: 'I Hate America, I Hate Americans'"},{"comment_id":"1818799778404105","commenter_b":"It is time for a woman president peeps..........this is not the woman.","commenter_a":"She may have one the debate, but America lost in this Presidential election","post_message":"Join Hillary live in North Carolina for her first rally since winning last night's debate → IWillVote.com"},{"comment_id":"10153232997868352","commenter_b":"Serve her right she should have been in her house doing house work or school what the hell she doing out in a battle field throwing stone, lack of parenting","commenter_a":"that is horrible. This needs to be told all over the news. Sounds like something SA would do instead of Israel.","post_message":"Palestinian girl, 14, locked up in Israeli prison for two months for throwing rocks"},{"comment_id":"10152808147960927","commenter_b":"That is a disgrace and a dishonor to our nation's flag god help us people needs to open their eyes and stop being stupid!!!!!!!!!!!........","commenter_a":"Just filthy sexual habits","post_message":"MLK's niece warns on gay marriage: 'God will have the final word in this matter.'"}]
