[{"comment_id":"866599370042152","commenter_b":"..Immigrants took our jobs? Really? I'll be damned! Well who gave them the jobs in the first place? Employers? They always hired the best I thought. OH! I know, those damned immigrants are the ones that sent our jobs to the Communists too, right? Lol. Watching Professional Bull Riding today. They are all Hispanics..","commenter_a":"If you can't speak our language then go back where you came from and stop taking jobs from Americans","post_message":"Plain and simple.   www.thepoliticalinsider.com"},{"comment_id":"10154532123498271","commenter_b":"Oh, you're so compassionate from your suburban home, Kim. Here's to hoping they move in next door to YOUR family.","commenter_a":"So green card holders and those with dual citizenship are our enemies? And regardless of that, these people, they are us. We or generations ago of us were standing on this land as immigrants. They are us.","post_message":"\"This is not about religion - this is about terror and keeping our country safe,\" says President Donald J. Trump in new statement.   @webpagelink"},{"comment_id":"10152906901509270","commenter_b":"Unreal !!! This makes me sick !!!","commenter_a":"It's just Wrong. Wanna bet the Commander in Chief authorized this crap..","post_message":""},{"comment_id":"849701391772757","commenter_b":"No more Somalis","commenter_a":"Part of barack islama's let everybody from any country come in when they want. No bg checks.","post_message":""},{"comment_id":"1293729747316737","commenter_b":"God she's a rotten pos","commenter_a":"Oh stop the whining! Grow up. The people have spoken so move on!!","post_message":"Chelsea Handler and Sen. Barbara Boxer didn't hesitate to shed tears at the \"sexism\" of Trump's victory."},{"comment_id":"10153909407028598","commenter_b":"Girls, start being more selective of your boyfriends. Think first and maybe you won't regret your actions later.","commenter_a":"I hope someone puts him out of commission!!!","post_message":"Boyfriend and Two Others Assault Pregnant Teen, Punch Her Stomach to Kill Her Unborn Baby"},{"comment_id":"10155379093015354","commenter_b":"This is why we need to deport these criminals. The illegal aliens are all criminals. They broke the law and came into our country uninvited. Deport them.","commenter_a":"obozo lied and innocent people died. Any questions? Criminal aliens are WMDs. How many must die before obozo and his minions are held accountable?","post_message":"This story has it all."}]
