[{"comment_id":"10153512973605671","commenter_b":"It was her idea. Men don't gaf","commenter_a":"Hahaha thought this was funny Brock. Idiots","post_message":"The massive metal pieces were found in an odd place—a backyard wedding"},{"comment_id":"10153227651945329","commenter_b":"Ikr how dare she maintain a healthy lifestyle, the bitch.","commenter_a":"She can fuck off","post_message":"More like baby washboard, amiright?"},{"comment_id":"1432409323458617","commenter_b":"@username and dodging sex with Trump is her game.","commenter_a":"So when the conservatives were freaking out about Michelle Obamas bare arms I don't recall them freaking out about Malaria laying naked on a fur or in bed with another woman. Were is your outrage now hypocrites. This woman doesn't have an ounce of class compared to the classy Michelle Obama.","post_message":"There's secret meaning in Melania Trump's style."},{"comment_id":"893865083995373","commenter_b":"Ha! That ones funny","commenter_a":"It's bullying and an example of bigotry BUT so are a lot of costumes. People get offended a bit too easy these days","post_message":"Halloween costumes are often inspired by pop culture and one store selling the Caitlyn Jenner inspired \"Call me Caitlyn\" costume is taking flack from activists saying it's bullying and an example of bigotry."},{"comment_id":"970311343085644","commenter_b":"Sick perverted inbred barbarians!!","commenter_a":"He'd get a face full of beer then we take it from there.","post_message":"We were drinking at local brewery in Dripping Springs last Sunday. I DARE these little hajjis to try THIS crap @ that establishment. What would YOU do? @webpagelink"},{"comment_id":"572406196218003","commenter_b":"@username bigotry people?!? First learn to compose a literate sentence, then read your comic book.","commenter_a":"Unfortunately, anti-gay bigots never seem to go away since we're still dealing with them 40 years later. When will we, as a people, learn to stop hating people who are different than us?","post_message":"TV's \"All in the Family\" was way ahead of its time.   Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153469277832093","commenter_b":"You know right off the back it wasn't a girl bc the rims aren't scraped from the curb lol","commenter_a":"Jeffrey id say that his parking skills are top notch.","post_message":"File this under the 'smart criminals' tab. @webpagelink"}]
