[{"comment_id":"1212512528838103","commenter_b":"STFU already! Hillary lost because she's Hillary. Get over it!!!","commenter_a":"Trump can't make an honest or decent response to anything.","post_message":"Trump’s Latest Twitter Tantrum Desperate Distraction From Tuesday’s Stunning Revelation.  It’s likely not a coincidence that the President-Elect is rehashing won battles after Tuesday’s breaking news that FBI Director James Comey likely acted favorably towards Donald Trump with his October announcement that new evidence emerged in the Clinton email investigation.  Read the whole story at Reverb Press HERE: @webpagelink"},{"comment_id":"845581582242351","commenter_b":"Dyson is a racist pig ! Don't let the media try to take the spotlight off of Hillery ! She is the CRIMINAL !","commenter_a":"The pits of academia!! But good students will learn despite him.","post_message":"This outburst would be laughable if you ignore the fact that he's a \"respected\" professor who gets to go on TV and say this."},{"comment_id":"519371271599548","commenter_b":"He did not mention deporting a large number of illegals, he did not mention anything about building walls, that's why he failed to stop the influx of illegal immigrants that we have now. Nothing is impossible, if we want to do it. If we can dig tunnels below, we can build walls above.","commenter_a":"It doesn't sound like trump at all. That's most probably what trump should have said. Everything bill Clinton said has been implemented. He doesn't mention deporting 12 million people (impossible to execute), he doesn't mention building a wall (idiotic and impossible to execute)... So no, doesn't sound like trump at all. This sounds like someone that actually has a executable plan, unlike trump. Not to mention calling a whole nation rapists, murders and drug dealers.","post_message":"Do you think this sounds a lot like Donald J. Trump?   MORE: @webpagelink"},{"comment_id":"10155827348030603","commenter_b":"Well if the driver is 18 then maby she should be brought up on man slaughter .","commenter_a":"I know this is a hit and run.. but why was this man in the street?","post_message":"#BREAKING: One of the suspects is also facing involuntary manslaughter and leaving the scene of an accident charges related to the hit-and-run that killed Bapi Gupta."},{"comment_id":"10154522993923854","commenter_b":"She's a crazy idiot!","commenter_a":"TIME TO END THE CLINTONS POLITICAL CAREERS NOW..","post_message":"IT TURNS OUT HILLARY CLINTON IS THE ONLY PRESIDENTIAL CANDIDATE WITH TIES TO THE KKK"},{"comment_id":"1079285898761124","commenter_b":"No woman with an ounce of self respect would vote for a misogynist like Trump.","commenter_a":"Good way to clean out those we don't need in America. Just one more reason for Trump to win","post_message":"A majority of people said they would go to Mexico."},{"comment_id":"1033963386626709","commenter_b":"Please Kathy. Just run the Pap strip over your big mouth. Infected!!!","commenter_a":"Trust me Kathy........Nobody want to see your Ugly......Except maybe KILLARY!!!!","post_message":"Another classy remark from Kathy Griffin."}]
