[{"comment_id":"1577321485900379","commenter_b":"Women yes! Hillary no!!!!","commenter_a":"No victory to any women! She does NOT represent me! she's a liar, fraud.. and doesn't even come close to respectable... What a shame for \"women\"","post_message":"Hillary Clinton: “We’ve reached a milestone: The first time in our nation’s history that a woman will be a major party’s nominee for President of the United States.”"},{"comment_id":"10157525764140293","commenter_b":"These people need to back off, no one understands the loss of a child much less one that is missing and not knowing if the child is alive or dead...this is their way of dealing...let them alone..","commenter_a":"I can't imagine how you go on with the uncertainty of their situation. The banner isn't hurting anything. Empathy is what's needed here.","post_message":"FEEDBACK: The parents of a child that's been missing since 2011 just want her back, but their plea is apparently someone else's eyesore.  What do you think about the way this is being handled?"},{"comment_id":"1382876735088925","commenter_b":"This bitch is evil","commenter_a":"I bet bin laden isn't dead. !","post_message":"THIS IS ABSOLUTELY HORRIFYING!"},{"comment_id":"1015796225098514","commenter_b":"Funny... I keep hearing people say that Climate Change is George W. Bush's fault.","commenter_a":"What's funny is climate change was never a political issue before the republicans made it one after Obama was elected. Even Bush admitted it is real, but the sheeple just keep to their marching orders from fox.","post_message":"Get ready"},{"comment_id":"733570513458390","commenter_b":"He wants to deport the Hispanics? We need to deport him with his team to Russia since they don't have anything to offer the nation. At least the Hispanics do all the dirty work in this nation.","commenter_a":"Politicians and Corporate thugs and bloated military spending.","post_message":"They're called politicians.  The Mind Unleashed"},{"comment_id":"1820354578210881","commenter_b":"She can't be lazy.....she must spend most of her time on her back with her legs open !!","commenter_a":"She needs to close her legs","post_message":"(But she still manages to spend £20 a week on cigarettes)"},{"comment_id":"10156245317395720","commenter_b":"What illegals are we talking about? The ones that invaded on the Mayflower? Or the ones that boldly and brazenly broke into our shores on Ellis Island?","commenter_a":"THE LAW already says certain immigrants can work without fear of deportation. They're called the ones who came here LEGALLY! ILLEGALS, on the other hand, may not work in the United States.","post_message":"184 Members of the House and 34 U.S. Senators filed an amicus brief last night supporting Supreme Court review of President Obama’s executive actions on immigration. We are confident that allowing certain immigrants to come out of the shadows, register with the government, and work without fear of deportation fully comports with immigration law and the U.S. Constitution. Read more here: @webpagelink"}]
