[{"comment_id":"10153232684759030","commenter_b":"\"Run, bitch! RUN FOR YA LIFE! GET SOME HELP!\"","commenter_a":"Kristian Pollard Elisha Lloyd","post_message":"#ThrowbackThursday to Wayne Brady using the ATM on Chappelle's Show. #TBT"},{"comment_id":"10153408271028338","commenter_b":"The mom didn't! The dog was roaming loose around the neighborhood when it attacked the child","commenter_a":"Sue the dog owner...? Why did the mom have the kid there around the dog?","post_message":"The boy's grandfather says he already spoken to a lawyer and plans to sue the dog owner in his grandson death."},{"comment_id":"10154379049296028","commenter_b":"The tourist started it. There are reasons they had to close up. Their computers weren't working and they were forced to close maybe for an hour. Stupid tourist wanted to fight. She assaulted the employee first (yes, throwing water at someone is considered assault) causing the employee to be in defensive mode. Maybe that employee should be suspended for 2 days and hopefully she's not fired.","commenter_a":"What? You are not going to stack the coupons and price match??","post_message":"A woman's desire for a post-Christmas bargain took a violent turn. The confrontation caught on camera shows a store manager and a customer get into a scuffle in front of awaiting shoppers at a Florida mall. @webpagelink"},{"comment_id":"10153171348750736","commenter_b":"Yeah, I want my 30 cents! in a check.. pronto!","commenter_a":"Instead of someone winning, split thee winnings with everyone who bought a ticket!!","post_message":"#BREAKING  No winner in tonight's Powerball Jackpot.  Wednesday's draw will be worth at least $1.3 BILLION.  Is there a billionaire's equivalent to the Dollar store??"},{"comment_id":"10154062164657042","commenter_b":"Let's dip her legs","commenter_a":"Poor baby,, how can she be such a horrible person,, well prison will be her first hell, then when she die, her other REAL HELL IS WAITING FOR HER,, she have no place in heaven .","post_message":"A child has died after his stepmother dipped his legs into scalding hot water."},{"comment_id":"10154099091458984","commenter_b":"He is another politician and a big lier as well he cheated in the other debate with Ben Carson he will say anything to get a vote and he will owe a million favors for all the lobbyist sending him,all this money","commenter_a":"Why are people at war all the time with a Democrat or a republican let's change this to U.S. political leaders and vote for a person not a party. They always have to make people take sides and it needs to be changed.","post_message":"With the South Carolina primary right around the corner, Ted Cruz is doing his best to diminish Donald Trump's lead. Cruz's latest attack is getting a lot of attention, and it may cause some voters to ditch 'The Donald.'  Is Ted Cruz right about Donald Trump?"},{"comment_id":"10153775506759203","commenter_b":"@username Look over this list....Drugs & guns to YOUR front door, so tell me again how gun control works!!!! @webpagelink","commenter_a":"Gun bans have always had the same effect once implemented: none. They do not create a (sustained) period of increased murders, nor do they reduce the rate of homicides.. @webpagelink","post_message":"\"We can toughen background checks and stop the sale of firearms to folks who have a violent history or history of mental illness.\"  Amy Schumer"}]
