[{"comment_id":"10153350460578690","commenter_b":"Haha innocent people. You're funny Ceyda. A Muslim living in Germany saying hitler, who is dead by the way, should finish all the Jews. I hope the west wakes up to the problem of you disgusting vermin and destroys you. You have been sent by the devil through your peodo prophet.","commenter_a":"This stupid Israelis how long would they continue harming innocent people Israel is behaving as if even that land is there's forgetting then were also refugees I wish Hitler could finish all jews","post_message":"Anyone who's received a letter has 30 days to leave Israel. If they refuse to leave they will face a hearing to determine their indefinite imprisonment. @webpagelink"},{"comment_id":"1004919146212988","commenter_b":"I absolutely agree, bit discouraged by the corruption of our politicians which when it comes down to it is our own fault. But Liberty, freedom, and the right to self determination are Gods greatest gifts.","commenter_a":"agree","post_message":"Do you agree with Calvin Coolidge?"},{"comment_id":"10155189081740354","commenter_b":"She ought to steam clean the empty space between her ears.","commenter_a":"There's a fool born every minute!!","post_message":"Who Says The Hollywood Left Is Out of Touch?"},{"comment_id":"10153794102616051","commenter_b":"Agree,she should be in prison","commenter_a":"AGREE","post_message":"Donald Trump says Hillary Clinton's record of scandals make her unqualified to be president. Do you agree or disagree?"},{"comment_id":"10153477114308984","commenter_b":"She's obviously trashy","commenter_a":"Am I the only one that saw that woman get out of that scooter, clearly nothing wrong with her","post_message":"This woman's young son got involved in her brawl with another Walmart shopper, and the video took the internet by storm. Now she's speaking out to defend their actions...  Do you think her son's behavior was unacceptable?"},{"comment_id":"1331566923530327","commenter_b":"Build a wall and make Mexico pay for it","commenter_a":"Just wait until the Beast's Administration takes over. The guy in this story will be considered \"small fry\" when the real unbridled corruption takes off.","post_message":"Top executives of  hedge fund manager Platinum Partners were arrested on Monday and charged with running a $1 billion fraud, potentially one of the largest investment scams since Bernard Madoff. We are #FacebookLive with the Reuters reporter who has been following Platinum's aggressive approach to investing and fund management. Send us your questions."},{"comment_id":"10153799919868352","commenter_b":"She trying to get relevant","commenter_a":"Whaaaaaat","post_message":"‘Whitney will haunt you from the grave': Fight breaks out at Bobbi Kristina’s funeral after Bobby Brown’s screaming aunt has to be ‘escorted out by Tyler Perry’ for attack on Pat Houston mid-service"}]
