[{"comment_id":"10153123681123690","commenter_b":"Every hindu rapist must killed.","commenter_a":"well done israel.. every terrorist should be killed..","post_message":"The mood was sombre as mourners gathered in Beirut southern suburbs to pay their respects to Jihad Mughniyeh, one of the six Hezbollah fighters killed in an alleged Israeli air strike in Syria. @webpagelink"},{"comment_id":"10153884646907183","commenter_b":"Why you picking on us white folk here in Georgia? Keep that bitch far away from us!","commenter_a":"Katrina Pierson should be in Milwaukee or Georgia. The media is paid to review everything Trump said and to soil it. They don't care about the real news, another cop assassinated through race- baiting rhetoric from Obama and HRC. Milwaukee is rioting. The streets of Chicago are still killing fields. Clinton is racketeering money through the foundation in pay for play schemes. Yet Ms Pierson has only one thing to do on this Sunday. Find dirt on what Trump said and exploit it. Is this the kind of values we should accept from these UnAmerican sewer-valued people?","post_message":"Did you ever hear of a \"novelty tradition\" in politics?"},{"comment_id":"1527023290939672","commenter_b":"@username Jesus Christ, woman....","commenter_a":"well, Oprah, I didnt hear you claiming racist when all us white people were watching your shows and buying your magazine, and saying how great we thought you were,now u got a big bundle of money and suddenly we are racist.....well, thanks a lot for the truth of how you really feel, we will be sure not to bother you with watching your shows or buying your magazine or singing your praises anymore....what an idiot","post_message":"Oprah Claims White People Are The Cause Of Racism In America. She's lost it. What a hypocrite. Do you think Oprah is the racist?"},{"comment_id":"10154624272397042","commenter_b":"Yea she has no right to refuse medical attention she is a minor, she could be hurt and this could look bad on us, lets slam her into a wall and toss her around to make sure she goes.","commenter_a":"If I'm not mistaken, she doesn't have the right to refuse medical treatment because she's a minor right? Her parents have to make that decision as well as them signing a Miranda for cops to question her. I hope her family sues and the officers gets properly reprimanded","post_message":"Body-camera videos of police using pepper spray on a 15-year-old girl have caused widespread uproar."},{"comment_id":"604244696428800","commenter_b":"Don KorLeone","commenter_a":"son in front look lik Derrick Rose","post_message":"Police are looking for eight males who robbed speakers from a Crown Heights, Brooklyn Family Dollar and attacked an employee with shopping baskets on the way out.   Full story: @webpagelink"},{"comment_id":"10153069431726045","commenter_b":"Don't run pretty girls. You're just gonna trip over that invisible tree branch and fall at his feet.","commenter_a":"90model gold marque mercury. Missing a hub cap. Asking anyone know the CAR...not the man.","post_message":"Huntsville Police hope you can recognize the car this man drove when he robbed the PNC Bank at 1470 Perimeter Parkway Wednesday afternoon."},{"comment_id":"1064573833613565","commenter_b":"So much hate is was fuels the violence like what happened in Orlando .for all that keep on with with Muslim need to die why hide your face if your so though to say thoughts words only cowers hide behind masks .....","commenter_a":"Gun control does not work and this is proof","post_message":"The FBI, Orlando Police and officials gave an update on the Pulse terror attack. Here's the latest: @webpagelink"}]
