[{"comment_id":"10153409033281833","commenter_b":"How is it racism the mulford act wasn't supported by the nra?","commenter_a":"In the 1960's when the Black Panthers were arming themselves and encouraging inner city blacks to arm themselves as protection from the government the NRA was an active advocate of gun control....and then they found they could make more money arming back woods, uneducated white guys. @webpagelink","post_message":"Amid a surge in violence in Milwaukee, the Republican-controlled Wisconsin Senate voted to repeal a state law that requires a two-day wait for handgun purchases. Just before the April 21, 2015, vote, the author of the bill, state Sen. Van Wanggaard, made this waiting-period claim: \"There no statistical evidence that it reduces violence whatsoever,\" the Racine Republican declared."},{"comment_id":"916949761698106","commenter_b":"Stupid woman","commenter_a":"she cant find anyone who has a visa already ! ? :O","post_message":"Some women never learn"},{"comment_id":"1081326848578752","commenter_b":"Should have been impeached a long time ago. I will believe it when I see it","commenter_a":"No I don't agree on that or anything he ever says. He should have been gone a long time ago.","post_message":"Former House Majority Leader Tom DeLay told Newsmax TV  that if President Barack Obama implemented a plan to require background checks on some gun sales by executive order and without congressional approval, the House should consider impeachment proceedings. Like, Share and Vote in Newsmax’s online poll: Do you support Obama’s gun control? Respond here: @webpagelink"},{"comment_id":"1013753742085664","commenter_b":"@username Babies suck!","commenter_a":"I used to dislike Clinton... I was uninformed and knew little about her other than what the right wanted me to believe. After some research and learning about all of her work on behalf of minorities, working families, women, and children over the course of her life and seeing her deal with adversity and downright deplorable behavior with strength, class, and grace, I am PROUD to give her my vote and my full support. I'll be voting Democrat down the ballot to ensure not only that she is elected, but that she has a Congress she can work with - not one hell-bent on obstruction. There is a reason she polls so much higher with EDUCATED people. #imwithher","post_message":"For 45 seconds, a drenched Hillary Clinton abandoned her script and let down her guard in Florida: @webpagelink"},{"comment_id":"10153269221051051","commenter_b":"When she gets her own country, she can make any law she wants and decide when she'll break it.","commenter_a":"Gays are getting too demanding. If she will not marry those faggats, then they should go some place else.","post_message":"This court clerk refuses to issue same-sex marriage licenses – even when her decision lands her in legal trouble. Do you respect her dedication to her beliefs?"},{"comment_id":"10154182389496337","commenter_b":"I would totally argue your point...but I have a rule about never arguing with beautiful girls!","commenter_a":"How is that a surprise? He's the most amazing character of all time! The little man casts a very big shadow.","post_message":"THE REAL \"MAIN CHARACTER\" ON Game of Thrones might surprise you..."},{"comment_id":"10154655136218984","commenter_b":"Makes you wonder why she's riding in a van! Not very comfortable and certainly not presidential.","commenter_a":"Not a Hillary fan but have you ever tried getting out of one of those van back seats?","post_message":"There's some new footage of Hillary Clinton making the rounds, and it's exactly what her campaign does NOT want America to see. Here's what happened to Hillary when she tried to get out of a van.  This confirms a lot of things that we'd feared about the Democrat nominee..."}]
