[{"comment_id":"981168698591584","commenter_b":"Wow! That's insane.","commenter_a":"They have been","post_message":"Tel Aviv says the Israeli military must have a freer hand to shoot young Palestinian stone-throwers."},{"comment_id":"840275132829730","commenter_b":"It took you people 8 years to realize that,lol He is a Muslim born in Kenya and should have never been aloud to run for President!! PERIOD","commenter_a":"Like it is a suprise Not . Fools at least over half of those that voted . Voted for at the least has sympathy . Sick the same people that killed thousands . Americans voted in one that was raised Muslim . Sad","post_message":"Damning new evidence has arisen regarding Obama. There is no question now that Obama is not who he says he is. Do you agree Obama is a Muslim?"},{"comment_id":"10153540355058984","commenter_b":"It's not just abortion Drs. all Drs. Make obscene salary's. Abortion should only be for rape victims, incest victims !","commenter_a":"it wont do them any good in HELL!!!","post_message":"Here's something shocking that Obama and His Planned Parenthood cronies will not like.   Do you consider these outrageous abortion salaries \"blood money?\""},{"comment_id":"1005620852830996","commenter_b":"Of course the wives are to blame! Sad that she hunts for weak married men because clearly she can't find one of her own! See picture !","commenter_a":"Correction - the person going out of their way to cheat is to blame for not trying to fix any problems their relationship may have, for not giving their partner a chance and lying. Women like her who go with men knowing they're are married give the rest of us a bad name, she should be ashamed of herself, coming out with drivel like that just proves she has no morals and is kind of desperate for any male attention, but she is not completely to blame here either. Fix what's wrong in your relationship and if it's unfixable then leave, DON'T CHEAT.","post_message":"Woman who has had 100 affairs with married men blames their wives"},{"comment_id":"555875991245538","commenter_b":"Finally a person with some brains","commenter_a":"We should not have even been considering it in the first place. When other muslim nations refuse to take refugees because of the fears of terrorism, why should we take the risk? There's lots of room at the White House- let them stay there.","post_message":"Official Statement from Dr.Ben Carson:  Today, I am asking Congress to stop the Obama Administration’s plans to bring in up to 45,000 Syrian refugees. There is currently no ability to vet these people.  By letting refugees into our country without vetting we are putting America at risk. If our President cannot see the risk, then we must rise to the challenge and protect our country. This morning President Obama announced at his press conference that it was our responsibility to accept these refugees. He is wrong. He took an oath to protect and defend this country. There is simply not a way to vet these refugees.   We should do everything in our power to help these men, women, and children who have been forced to flee their country, but until we can sort out the bad guys, we must not be foolish. I call for increased aid to the refugees. We can and should do more to feed the hungry and shelter the homeless. We must also protect them from being attacked by implementing immediately no fly zone over these camps.  President Obama said this morning that it would be a mistake to send more ground troops. I think plenty of mistakes have already been made. As President, I would give the mission to the Pentagon, and ask them what they need to accomplish the mission. The right number of boots on the ground is whatever number the Pentagon says they need to accomplish that mission and not a single person less. The error of armchair quarterbacking our military will end in my administration. They will get the support they need and nothing less. Both the FBI and former Intelligence Committee Chairman, Mike Rogers, have indicated that it is not possible to fully vet these refugees as there is no Syrian list to vet against. Allowing these refugees to enter our country without knowing who they are is foolish. I am talking to many experts as I can, and I have yet to find one who thinks that the Obama Syrian/ISIL strategy is anything but a failure. The only thing that President Obama seems to have contained is this foolish policy inside his government.   We need to offer more than empty tough talk. We need to say what we mean, and most importantly mean what we say. When we draw a line in the sand or boundary in the air, the world needs to understand that we mean it. Too many people across the world today think that we don’t."},{"comment_id":"10153744432513984","commenter_b":"Keep hammer at them. Abortion is murder.","commenter_a":"I like Trey Gowdy...good for him.","post_message":"BOOM! Gowdy just laid the smack down on libs and Planned Parenthood with a series of hard-hitting questions that totally undermined the arguments in favor of abortion.  Do you support Trey Gowdy's fight to defund Planned Parenthood?"},{"comment_id":"10153871783832232","commenter_b":"Stop being such a witch","commenter_a":"Why would a news encourage this stupid behavior there has to be more important news for them to be reporting on","post_message":"We don't recommend this, but the boys swim team from Hatboro Horsham found a new way to practice. Thanks to NBC10 viewer Kimberly McPoyle for sharing! Stay with NBC10 for full coverage of #Blizzard2016. --> @webpagelink"}]
