[{"comment_id":"10153919484005950","commenter_b":"I'm not copying, I'm telling the truth. You also look like a witch. It's catching.","commenter_a":"Angelina ruined him once, now she's trying again. She should have kept her man eater claws out if his first \"real\" marriage. I swear, I think she's a dark witch, casting dark spells.","post_message":"The LAPD released a statement to Entertainment Tonight to clear up reports that they were investigating Brad Pitt for allegedly being physically and verbally abusive with one of his children."},{"comment_id":"10154473898974411","commenter_b":"@username stick to your supermarket shopping you dumb f","commenter_a":"So many ignorant people commenting on this. This is a traditional harvest of one of the only renewable resources the inhabitants of this barren rock can survive from. Educate yourselves.","post_message":"'The ordeal began this morning when locals spotted a pod of between 100-150 pilot whales'"},{"comment_id":"10155495493551509","commenter_b":"I love SNL.Meanwhike Trump should realize his comments about women aint no laughing matter.He's going to lose then divorce Melania then marry a young p*ssy!","commenter_a":"@username SUCKS AND BLOWS..HILLARY PLACED NATIONAL SECURITY OF THIS COUNTRY IN DANGER BECAUSE OF HER EMAILS AND YOU GO AFTER TRUMP BECAUSE OF A TIRED LATE NIGHT COMEDY SHOW..HAVE YOU NO DECENCY SO PETTY SO SMALL @username HAS BECOME","post_message":"\"Donald J. Trump's tweet that Saturday Night Live  needs to be canceled because the show did a 'hit job' on him should concern every American,\" writes Dean Obeidallah for CNN Opinion"},{"comment_id":"1683735615241075","commenter_b":"@username that 'swhy we dont need foreigners like you in our country! keep begging... you still dont think you are mentally ill! lmao an opinion got your balls, smh sick in the head.","commenter_a":"l.o.l why it took a republican... Donald Trump is the truth and he makes sense but his arrogance ways does make him look bad ! but we dont need anyone leaving or coming into America right now since we have no control over our country....","post_message":"They called on Republicans to reject Donald J. Trump immediately."},{"comment_id":"1131958793506245","commenter_b":"What did you expect from a trash bitch","commenter_a":"Sad, Sad, Sad. How dare you bring a child into this earth, if you do not plan to put them before yourselves. I imagine this is an ongoing problem and I truly hope that child is taken from them and placed in a loving home. If only I had the space, time, and money. I would rescue all children in a heart beat. :(","post_message":"Police want you to see these viral images of what heroin is doing to families."},{"comment_id":"1016134698454262","commenter_b":"She'll just speak to someone else. Challenge her!","commenter_a":"I hate Hopkins as much or more than they do. But this behaviour is just babyish. If you want to defeat her, debate her with facts and the moral superiority of your argument. This is just forfeiting the chair to a racist moron.","post_message":"Brunel students just gave us all a masterclass in how to deal with Hopkins"},{"comment_id":"1140950715967044","commenter_b":"Lying two faced cutthroat hag.","commenter_a":"If mouth is open lies are being told.","post_message":"BOOM! Coal Miner Calls Out Hillary to Her FACE! Watch her try to \"umm umm babble babble\" a way out of it VIDEO  The entitled hag gets slapped with karma! WATCH!"}]
