[{"comment_id":"10156147874195725","commenter_b":"YES AND TAKE GLENN BECK WITH HER.......","commenter_a":"Agreed.","post_message":"I think Megyn Kelly should take another eleven day \"unscheduled\" vacation."},{"comment_id":"930363577060209","commenter_b":"She is as STUPID as HILLARY","commenter_a":"Germany's Government \"feel good\" Migrant policy has consequences.","post_message":"CLUELESS..."},{"comment_id":"845581582242351","commenter_b":"Dyson is a racist pig ! Don't let the media try to take the spotlight off of Hillery ! She is the CRIMINAL !","commenter_a":"The pits of academia!! But good students will learn despite him.","post_message":"This outburst would be laughable if you ignore the fact that he's a \"respected\" professor who gets to go on TV and say this."},{"comment_id":"1771730343061531","commenter_b":"@username, no too bad YOUR MOTHER DIDN'T HAVE ONE!","commenter_a":"If anyone is out of touch with mainstream America it's conservatives. What this really should is how liberals are against bigoted, hateful, judgmental, narrow minded christian WHITE CONSERVATIVE IDIOTS.","post_message":"Democrats' threats of violence are intensifying, showing voters  how radical and out of touch Hillary Clinton and Leftist radicals truly are with mainstream America..."},{"comment_id":"10153218585709614","commenter_b":"You're right .... She probably knew he wouldn't leave his wife ... She needs death penalty ....","commenter_a":"Her \"married boyfriend\".... So 1 baby couldn't keep him, she needed 2??","post_message":"This 3-week-old baby, kidnapped and discarded in a trash dumpster, was the innocent pawn in an \"evil\" woman's elaborate plot to convince her married boyfriend that she had given birth to his twins, police said.  Giseleangelique D, 47, of Thousand Oaks allegedly sought out young mothers under the guise of a charitable organization looking for women with 1 to 2-month-old infants to assist.  That's how D found Eliza Delacruz, police say. She allegedly stalked the infant's mother and then had a co-conspirator snatch the child. Three other people were also arrested in the alleged plot, which includes an attack on another mother and child in El Segundo.   What investigators say they can't figure out is why 3-week-old Eliza was killed.  Read KTLA's story here: @webpagelink"},{"comment_id":"10153838476451509","commenter_b":"We \"poor people\" are richer than she'll ever be. Shallow, vapid tart.","commenter_a":"Grande opening, Grande closing. Hopefully her career.","post_message":"Security footage showed singer Grande appearing to \"maliciously lick\" a donut in a shop: @webpagelink"},{"comment_id":"1136168619776218","commenter_b":"Now he knows what she's capable of. Either he dumps her now and risk her wrath, or stays on knowing he'll be culpable for any harm perpetrated against a woman he cheats with.","commenter_a":"Throw them both off, it takes two to tango, at the end of the day though its best you know sooner rather than later if he/she is a no good for nothing cheat, cheating on your partner is the worst kind of betrayal, you're better off without them","post_message":"Don’t mess with my man!"}]
