[{"comment_id":"1697928997118346","commenter_b":"I DON'T WISH TO RUIN MY DAY WITH THIS MISERABLE COWARD MAGGOT--CORWARD RACIST EVIL VOLDEMORT.","commenter_a":"Vote blue across the board. Vote Democratic party in the next election. Go Hillary. DUMP TRUMP THE IDIOT","post_message":"Well, it's official: Donald Trump will be the GOP presidential nominee. Simple question: Are you voting for him?  LIKE Opposing Views for all of the latest 2016 election breaking news and debates."},{"comment_id":"523485051181568","commenter_b":"Such a lying witch.","commenter_a":"She has dealt ace of spades. Let her bare the consequences!","post_message":"\"Donald Trump says I’m playing the woman card. Well you know what I say if fighting for child care, paid leave, and equal pay is playing the woman card – then deal me in!”  Moments ago, Hillary Clinton gave a speech responding to Donald J. Trump's criticism."},{"comment_id":"10153932824095575","commenter_b":"If you have bones in your closet be sure they will come out.","commenter_a":"BS alert!","post_message":"National Enquirer parent company refutes Ted Cruz--- DONALD TRUMP had nothing to do with our story...."},{"comment_id":"10150581639814999","commenter_b":"its called cheating and it is still cheating if the score 47-7 hope you dont have kids...","commenter_a":"Seems like a very very cheap price for a championship","post_message":"A report commissioned by the NFL concluded that it was “more probable than not” that Tom Brady was aware of New England Patriots personnel deflating footballs to gain an advantage against the Indianapolis Colts."},{"comment_id":"913163888732635","commenter_b":"Another NJ Dem on the take.","commenter_a":"n j Need to re think He will stand up to Obama. I wouldn't be surprise that Obama is behind this to start with","post_message":"Pressure is growing..."},{"comment_id":"10153938743204087","commenter_b":"Karma is a Bitch!!! #NEVERHILLARY #STILLSANDERS #JILLNOTSHILL. #DEMEXIT","commenter_a":"And Bernie wants us to support her boss Hillary.","post_message":"DNC chairwoman Debbie Wasserman Schultz referred to Bernie Sanders' campaign manager as \"scummy\" and a \"damn liar\" in a leaked email published on Friday by Wikileaks."},{"comment_id":"1329754913767400","commenter_b":"Both those women have lost their minds.","commenter_a":"The comedy act of Waters and Pelosi are more entertaining than SNL. Keep up the good work, this will assure another republican landslide in 2018","post_message":"TIME TRAVELER NANCY PELOSI Says She Just Can't Work With...President Bush??? [Video]  Haha! Check out Maxine Waters!"}]
