[{"comment_id":"1360485817324205","commenter_b":"She is so stuck on herself. She thinks she's some sex goddess that's all she talks about. Blaaaaa get her gone I say!!!","commenter_a":"Dennis, please read the below with your comments","post_message":"SEAN STRIKES BACK AT MEGYN.  Good.  Now she's at odds with Hannity & O'Reilly.  See what Hannity wrote to her:  @webpagelink"},{"comment_id":"1176259539107466","commenter_b":"Meek them niggas some hating pussy","commenter_a":"Thank god they didnt let omelly freestyle 🙏🙏🙏🙏👀","post_message":"#MeekMill  sends shots at #TheGame #Drake & #BeanieSigel during his freestyle on Funk Flex!"},{"comment_id":"1159279537467495","commenter_b":"The Obama 's are more racist then anyone else Michelle everytime she opens her racist mouth it's all about her give me a break and it's true the other 1st ladies have more class then she will ever have and it has nothing to do with the color of her skin if the whites are so racist he wouldn't have been in office","commenter_a":"I wish she has racism up her back side!!!","post_message":"Michelle Obama Calls Out Military Racism  This Marine Answer Is DEVASTATING!"},{"comment_id":"10153829963431130","commenter_b":"@username The two go hand in hand. you would have to post a naked pic to really prove you point but I doubt that is going to happen. She has blubbery arms and obviously fat hips and thighs.","commenter_a":"She looks amazing. I am a size 6 and I don't look that good naked. She seriously has a bomb AF body","post_message":"“This is for anyone who has ever been called FAT.\""},{"comment_id":"10154266056696051","commenter_b":"She looks dreadful!!!","commenter_a":"the VALUES are no 'right' unless they are YOUR values?? I don't think so...........the American people have spoke. Donald Trump Is Our President","post_message":"Hillary Clinton made her first major appearance since losing the presidential election last Tuesday. Do you agree with what she's saying?"},{"comment_id":"10153244727383352","commenter_b":"such a bitch whore ,","commenter_a":"And In \"Other Breaking News...\" Kim Kardashian is laughing all the way to the bank! !","post_message":"Kim Kardashian gets slammed on Twitter for her new Super Bowl T-Mobile ad where she shows off her body while taking selfies"},{"comment_id":"10154136784591800","commenter_b":"Why not question why WNBA players don't make the same as NBA players? it's cause we all know the answer to that and it's the same as the answer to this. Only difference is incomplete data has been distributed for soccer players making people think their is a pay divide when in reality their is a revenue divide.","commenter_a":"If they played each other, the men's team would win and if you say \"Well that's because they are men.\" I would say \"Exactly, that's why they are paid more.\"","post_message":"Hasan Minhaj got the details on the U.S. Soccer pay gap. #EqualPlayEqualPay cc.com/equalpay"}]
