[{"comment_id":"991109084315479","commenter_b":"And those politicians won't change anything until one of them gets shot","commenter_a":"By law, the police can't do much of anything until the shooter opens fire. If he verbally threatens someone, that can bring the police into it. But by that time, someone may already be dead. Don't blame the police, don't blame the dispatchers, blame US.....because we elect the politicians that pass these laws!","post_message":"Once again, the NRA has blood on its hands."},{"comment_id":"10153822005111519","commenter_b":"It doesn't fit her","commenter_a":"Plus not just only black ppl have this done. White and other colors do 2.","post_message":"Lil’ Kim’s bleached skin and blonde hair are the tragic result of sexism, racism, colorism"},{"comment_id":"10154338817664411","commenter_b":"Arabic jews were never persecuted. This crap comes from your corrupted zionist controlled medias. Actually the white European jews were always persecuted by europea christians and Hitler etc. Can't you see the difference between a white European non-semitic jew with blonde hairs and blue eyes and a semitic middle eastern jew? Obviously you can't. You're a trash.","commenter_a":"There are calls by scientists and engineers, presidents etc etc etc etc etc to re - open the 911 case for new investigation. Suddenly the Saudi propaganda is out just at a time when the world is waking up to the 911 israeli zionist connection. Truth will prevail 😂","post_message":"Man wants to buy a plane & an abandoned building to 'prove it once and for all: Was 9/11 a hoax or was it real?'"},{"comment_id":"944224732371213","commenter_b":"Yeah, she didn't want to have sex with an Orange baboon.","commenter_a":"I guess Trump would know a lot about attitude. He has a very bad attitude and has the emotional age of three!","post_message":"\"She gained a massive amount of weight, and it was a real problem. We had a real problem. Not only that, her attitude,\" Trump said Tuesday morning."},{"comment_id":"1739251936290298","commenter_b":"exactly. Women belong in the kitchen, this is stupid.","commenter_a":"Great. Ahmed, the suicide bomber, will be next. Anything to appease the muslims, right?","post_message":"The six-year-old girl is the first-ever Afghan Muppet, and she is aimed at promoting female empowerment in Afghanistan."},{"comment_id":"1541783172796541","commenter_b":"#__ #__ #StopYazidiGenocide #StandforYazidiWomen","commenter_a":"Hire them!! If they can do the job, HIRE THEM !!","post_message":"If your business or organization is hiring and needs someone to get the job done, hire a veteran."},{"comment_id":"10153455356180779","commenter_b":"@username Yes, she is, without a doubt!","commenter_a":"Dude is garbage. Talented but garbage. LOL trying to spark a feud with Taylor swift, makes a song about gold diggers then marries one...","post_message":"Nearly two months after 'The Life of Pablo' debuted at Madison Square Garden – followed by a Tidal stream-only release, a declaration that the album would never be on Apple Music, then the eventual dispersion of 'The Life of Pablo' to Apple Music and other streaming services – Kanye West's latest LP has finally found its way to the top of the Billboard 200."}]
