[{"comment_id":"969075749885792","commenter_b":"That was you , a hoe and a drug user","commenter_a":"Your corruption comes to an end today Hillary! You have stiffed this nation, you have deceived the American people. NO MORE CLINTONS, America will not let you disgrace this nation any more!","post_message":"Todo por lo que hemos trabajado se decide hoy. Comparte esto si apoyas a Hillary: hillaryclinton.com/buscador"},{"comment_id":"10153571607004411","commenter_b":"Fuck you Kike hook nosed cunt","commenter_a":"Just a usual palestine jewhating fascist lmao, good way of solving the problem Canaan belongs to nobody, especially not to muslims","post_message":"'My hope is that at some time, [Israel] is no longer there, but only Palestine'"},{"comment_id":"10153861210290950","commenter_b":"You kiss your Moms with that nasty mouth?","commenter_a":"Here is my thought. Don't show him on TV!! Focus on the team, the stands, and the rest of the stadium and to hell with him. If everyone stops making him big news, maybe we can all go back to watching football and the rest of the players on the field. Make him prove he even deserves to be out there, and sorry 49er fans, but before all this crap by him became news, I couldn't even tell you who he was. Maybe this is his way of getting some publicity because he ain't no Tom Brady or Peyton Manning!!! Let him sit, he may just earn the right to sit there all season!!!","post_message":"A veteran who supports the San Francisco 49ers quarterback tweeted: \"Don't use my service--or that of any veteran--to justify the silencing of black Americans.\""},{"comment_id":"10153767217919497","commenter_b":"Let's really make a team effort to versnitchinize the fizemignots.","commenter_a":"Area intern tells employer \"I'm more into first person shooters, than platforming\" is fired on the spot","post_message":"The buzzword has yet to be expounded on or put in context by anyone at the company."},{"comment_id":"920934694585179","commenter_b":"94 MILLION LEGAL AMERICANS JOBLESS LEGAL AMERICANS HOMELESS LEGAL AMERICANS HUNGRY LEGAL AMERICANS HURTING AND THIS DEMOCRAT SLAVE MASTER, WHO GETS A LIFE-TIME SALARY FROM LEGAL AMERICANS VOTED AGAINST THIS BILL WHICH WOULD GIVE JOBS TO LEGAL AMERICANS","commenter_a":"Wrong on many levels....","post_message":"Greater energy security and more #jobs are at stake. Approve #KeystoneXL!"},{"comment_id":"651668038332170","commenter_b":"And the idiots will vote her in.","commenter_a":"Thats true Mr President! A lot of unfair things are happening. Please take control of this country.","post_message":"The system is rigged. General Petraeus got in trouble for far less. Very very unfair! As usual, bad judgment."},{"comment_id":"10157848946740389","commenter_b":"The People Must Protect the Republic, since DOJ and FBI are MIA! Trump wins in a landslide; however, the polls are a lie, and her rigging election must prove the lie! It's up to us to stop it, or America becomes just another Brazil. Infowars.com","commenter_a":"By hook or crook, ain't nothing on the books that we can't cook!","post_message":""}]
