[{"comment_id":"1622307121406726","commenter_b":"Jeff the Killer","commenter_a":"Kevin Mccaston this is another reason I won't move to Florida lol","post_message":"\"I now have an alligator in my sewer.\" #FloridaProblems  @webpagelink"},{"comment_id":"10158382623765093","commenter_b":"It would be illegal to play it. It is national Security. and Illegal.","commenter_a":"Flynn talking about sanctions people what more important a Russia helping to stop ISIS around the world and stop aggression or keep Obama sanctions on them and never accomplish anything .Only reason Obama put sanctions on them while leaving was to stop Trump from making deals with the to help stop ISIS","post_message":"\"It seems inconceivable that Flynn did not consider the likelihood, the virtual certainty, that he was calling a wiretapped line.\" -- Andrew C. McCarthy"},{"comment_id":"10154655361619170","commenter_b":"She looks like calling us Deplorables. She should look in the mirror..","commenter_a":"And she belongs in a mental hospital.","post_message":"Here's what Hillary thinks about you. Now click to join us in a little experiment concerning this."},{"comment_id":"537038436486736","commenter_b":"PUKEBAG, Tax-evading, racist POS!","commenter_a":"What A Joke HE IS DEFINATELY TALKING OUT HIS ASS NOW","post_message":"Dr. Alveda slams Al Sharpton for comparing himself to MLK on live TV.  Al Sharpton and MLK should never be used in the same sentence.  Do your agree Al Sharpton is a criminal?"},{"comment_id":"10153785867669228","commenter_b":"Yo mama a obese dummy she should of swolled yo daddy nut.","commenter_a":"Oh like white bithes don't steal stfu","post_message":"Three women pushed shopping carts full of toys from a Toys''R''Us"},{"comment_id":"10153396919359087","commenter_b":"X Liberal Pussies who Pimp for Islam! It's Simply one of the MOST Bizzzzaaarre Psychological Spectacles of our Time! The ODD Relationship (do I say \"Love Affair\") between ISLAM and LIBERALISM is a WEIRD thing to watch. HELLO!! Liberal FEMINIST Women!! Islam is a SEXIST Male Dominated, Woman TRASHING \"Religion\"!! Liberals MOCK, RIDICULE Christianity, then turn around and Protect Islam's 1400 Year \"War on Women\" which Treats women like Chattel, and Stones Women to DEATH for adultery. \"Honor Kills\" women when their men feel their women aren't obedient, Muslim MEN FORCE Women into castration, Slavery, to wear scarves, and Burkas!! Muslim Women aren't allowed to Drive and be Educated yet Liberals want to be \"tolerant\" to Islam, but want Christianity to CHANGE!!?? Oh, and GAYS end up on the wrong side of the Stones/BladesToo!!","commenter_a":"Thank you President Obama. I'm so glad I'm not a pussy like most of the commenters here that live in fear of the great big scary Muslims. It must suck to go to bed at night clinging to their guns and religion wetting their pants afraid that Muslims are coming to kill their family. I'm glad I have a president that rises above that childish fear. I'm blessed that God hasn't made me a coward like so many of my countrymen who would gladly trade their freedoms for the veined vail of security. Cowards all of you. And I already know their response. They will call me a delusional libtard that loves Muslims. Without realizing the irony that these were the same people that called white civil rights activists \"n***ger lovers\". This generation of dolts, will too, be wiped away with time.","post_message":"“It was so moving for Michelle and myself in part because it was so representative of the country. You had people from every background, every faith,” President Barack Obama  said after meeting the families of San Bernardino victims.  “Some described their loved ones who had come to this country as immigrants; others who had lived in the area all their lives — all of them extraordinarily proud of the work they were doing to keep people healthy and safe here in this community.”"},{"comment_id":"741381376052440","commenter_b":"Big ugly cow, let her bitch.","commenter_a":"So go to another store, what's the big deal?","post_message":"Welfare Queen Goes BALLISTIC After Seeing THIS Sign At The Grocery Store  Let her be mad, this is what she deserves.  Are you sick and tired of entitled welfare leeches?"}]
