[{"comment_id":"820665888078295","commenter_b":"Silly woman","commenter_a":"Wtf? Isn't non schooling illegal (and 5... That's stupid... once they are on solids why breastfeed?)","post_message":"Neither of her kids can read as she refuses to let them go to a mainstream school."},{"comment_id":"10153433309476051","commenter_b":"Tie her up in the yard with a plate of chicken wings just out of reach","commenter_a":"No compassion, no conscience ,scruples,morals..nothing but a worthless excuse for a person.I hope she has no children.","post_message":"Officials took one look at what this woman did to her dog and arrested her immediately."},{"comment_id":"1690937014458022","commenter_b":"Stupid Swede!","commenter_a":"Another nut","post_message":"This is INSANE..."},{"comment_id":"926308994070863","commenter_b":"Nope, I kill the bastard and accept id be going to prison my whole life, but at least my child would live.","commenter_a":"It's possibly the worst idea in history to allow the shooting of a cop. Even the absolute worst cop could be clubbing a baby and still, if he were shot and killed in the act he'd die a hero and we'd never hear the end of it. We need to shoot cops, but with our cameras, never ever with a gun.","post_message":"Some states are dealing major setbacks to the Police State."},{"comment_id":"731399806958628","commenter_b":"SUSIE ROTTEN CROTCH...and NASTY ASS LITTLE BILLY...Mommy needs a ass beating by daddy. Because you know it is the nutty woman who thought up the bullshit.","commenter_a":"IF LITTLE SUSIE ROTTEN CROTCH AND NASTY ASS LITTLE BILLY DOES NOT HAVE THEIR SHOTS...DO NOT TREAT THEM OR LET THEM IN PUBLIC SCHOOLS....PERIOD.","post_message":"More docs are refusing to see families that don't vaccinate."},{"comment_id":"1532142173492916","commenter_b":"Oh we will because we need to stay united and fight. I mean go out there and protest, boycott Trump businesses, follow advice of people like Michael Moore, Bernie Sanders, Keith Olberman. I am saving my money and will travel to places where protests will be visible and impactful. Also, we have to find a way to help each other. Si se puede.","commenter_a":"2018 is just around the corner. We will clean house and send republicans packing!","post_message":"Conservatives will do anything to win what they perceive as the \"culture war.\""},{"comment_id":"10153832983220950","commenter_b":"Bitch u just said a bunch of racist shit now","commenter_a":"Yes, he did behave badly but, those two athletes who chose to speak out against the country they were sent to represent, the country that has supported their goals, trained them and gave them the tools they needed to succeed in their sport, should face the same fate as Lochte.","post_message":"Speedo wished Ryan Lochte well, but said it \"cannot condone behavior that is counter to the values this brand has long stood for.\""}]
