[{"comment_id":"10153307289837377","commenter_b":"And this Yankee Trump girl says thank you!","commenter_a":"Never doubted for a minute South Carolina wouldn't vote for Trump. Southern people aren't liars and we want a tough leader.","post_message":"Republican presidential frontrunner Donald Trump has won Saturday's primary in South Carolina, US networks projected."},{"comment_id":"10152797676794753","commenter_b":"Typical female.","commenter_a":"He replies.. \" sorry Hun I forgot u said light toast not dark. My bad not happen again\" lol","post_message":"A solider at Fort Bragg in Fayetteville, North Carolina, tried to bring his wife a surprise breakfast in bed Friday morning, but things went terribly wrong."},{"comment_id":"10153104689788855","commenter_b":"WTF? The Advocate (or at least the staff involved in this article) clearly don't know what \"Twink\" is. These men are just aging well and don't have the outward appearance of what one would typically expect of their numerical age.","commenter_a":"Daryl Stephens is a hot man","post_message":"Sometimes, twink is forever (right, Darryl Stephens?)"},{"comment_id":"10153198531370950","commenter_b":"Yes, she was just hoping some cop would come in and throw her across the room. See how stupid that sounds?","commenter_a":"def smell a get rich quick scheme in the works :( ugh ...........it was all her own damned fault ,,,,,,,,,,,no payment is deserved !!!!","post_message":"\"She now has a cast on her arm, she has neck and back injuries. She has a Band-Aid on her forehead where she suffered rug burn...,\" the student's attorney told ABC's \"Good Morning America.\""},{"comment_id":"652127268253788","commenter_b":"To you Mrs. Michele Obama I say name me just one all white college. I am not racist, I do have several black friends. Being white of course I do have more white friends, then black friends. They seem to under stand my point. But for blacks to say they can't go here or there. I don't see those barriers. I wish we all can stop this racist name calling g and pointing fingers, at each other. I know I can name at least 4 black colleges. I just want to know if anyone can name me just one all white college.","commenter_a":"why is she there? go home & drink some tea","post_message":"A race baiter who is not proud of her country."},{"comment_id":"10153868585859203","commenter_b":"She wouldn't fuck any of you dude bros anyways.","commenter_a":"She looks great. Bold, sexy, unflinching, human.","post_message":", gross, strong, thin, fat, pretty, ugly, sexy, disgusting, flawless, woman."},{"comment_id":"10153548183098984","commenter_b":"Unless you're Native American, almost all Caucasians have ancestors that were thieves, murderers, and rapists. Shall we remember our horrible history? Shall we remember how Caucasians forced their way through other's land? Shall we remember the genocide that occurred? Shall we remember public lynches? Shall we remember the Trail Of Tears? Shall I go on?..... Who are the TRUE criminals here? Caucasian ancestors FORCED their way through due to greed. Most other immigrants come to America to WORK to provide for their family. So I repeat, UNLESS you're Native American, you come from immigrants as well, possibly even illegal. You're ancestors (Caucasian), if they've been here since the 1700s or 1800s, could have been the murderers, thieves, and rapist roaming around tormenting innocent. An add-in...who will do super low-pay labor? Mexicans are hardworkers, even when we are living in severe poverty, we still try to WORK. Anyone who has common ...","commenter_a":"Donald Trump is to good for any of them....you can't tell a Liberal the truth","post_message":"Donald J. Trump just taught these guys trying to bully him a SERIOUS lesson on why you do NOT try to play hardball with The Donald!   Do you think he has more backbone than Obama?"}]
