[{"comment_id":"10153045402661336","commenter_b":"Shut up idiot!!!!","commenter_a":"Early Bird gets the cage","post_message":"A Georgia sanitation worker has been sentenced to 30 days in jail for picking up trash too early in the morning."},{"comment_id":"849061198475049","commenter_b":"She wants no part of it. Very wise classy lady.","commenter_a":"Condoleezza for President, she'd make a wonderful one. Outstanding human, patriotic, religious.......intelligent, classy. She has much more quality than Hillary any day.","post_message":"Just beautiful. I didn't even know Condi was a musician..."},{"comment_id":"698707680267099","commenter_b":"@username ....and dumbasses vote for Hillary","commenter_a":"Liars will always call other people liars to hide the fact they are liars....haha. Seriously, he is a POS and he is nothing but a racist, a liar, a cheat, a thief, and I could go on. He is a danger to America....and if he can't run his casinos, his own campaign, think about what he will do to America. He will run it into the ground. It is pretty scary to think if he gets in the Whitehouse, he will insult other countries, and possibly be the first president to incite a war because of his mouth.","post_message":"\"Hillary Clinton  may be the most corrupt person ever to seek the presidency of the United States,\" Donald J. Trump  said."},{"comment_id":"711540485694496","commenter_b":"The noose tightens.","commenter_a":"Deport him to Russia","post_message":"Dems bringing pressure."},{"comment_id":"10153597569599411","commenter_b":"@Zoran...again, you get a life...we are pretty happy and fine. Not like a poor illegal immigrants as Zoran trying to stay in the west....","commenter_a":"No one should feed barbarian Russian junta fascism invaders.","post_message":""},{"comment_id":"10153430518633445","commenter_b":"She is no friend of common Americans! This bitch is out for herself and her MIC handlers, fucking traitor!","commenter_a":"Hillary Clinton will say anything to get elected but she is no friend of Marijuana.","post_message":"#Trending - Hillary Clinton Suggests Rescheduling Marijuana, But Does Not Currently Support Like-Minded Legislation."},{"comment_id":"10156094482870354","commenter_b":"Throw that fat stank ass pig in the pen!","commenter_a":"She deserves the same","post_message":"***UPDATE***"}]
