[{"comment_id":"10152812337251749","commenter_b":"#iAmProudiAmBlack. #MyGirlFriendisBlack bcoz i only wanted a beautiful lady. Make these hashtags go viral and discourage nutty whites around the world who see blacks as apes. Tell them that: #BlacksRuleTheWorld. #ObamaIsBlack bcoz he is a great.","commenter_a":"Then it needs to be made a right","post_message":"\"We have finally ended the debate in this country of whether or not health insurance is a right or a privilege. We think everyone in America has a right to have adequate health care insurance. And the Affordable Care Act gives them that right.\" —Vice President Biden  Watch the weekly address: @webpagelink"},{"comment_id":"554182668075021","commenter_b":"What lower wages, you mean lower taxes. If you don't want to birth a child, just keep those nasty little knees together","commenter_a":"They are poor, jobless and believe the American dream is dead because they are stupid enough to keep being tricked into voting democrat.","post_message":"Last year was the first time that millennials surpassed baby boomers and Gen-Xers to become the largest voting demographic in the US."},{"comment_id":"1005620852830996","commenter_b":"Of course the wives are to blame! Sad that she hunts for weak married men because clearly she can't find one of her own! See picture !","commenter_a":"Correction - the person going out of their way to cheat is to blame for not trying to fix any problems their relationship may have, for not giving their partner a chance and lying. Women like her who go with men knowing they're are married give the rest of us a bad name, she should be ashamed of herself, coming out with drivel like that just proves she has no morals and is kind of desperate for any male attention, but she is not completely to blame here either. Fix what's wrong in your relationship and if it's unfixable then leave, DON'T CHEAT.","post_message":"Woman who has had 100 affairs with married men blames their wives"},{"comment_id":"10153348953162217","commenter_b":"I saw a mother the other day getting into her car with her pjs, slippers and a cup of tea/coffee. I would be so embarrassed to take my kids to school like that.","commenter_a":"It's really difficult to put a top and jeans on. Come on it's 2016 😉","post_message":"\"There has been an increasing tendency for parents to escort children while still wearing their pyjamas and, on occasion, even slippers.\""},{"comment_id":"10152728441711051","commenter_b":"Ship her to Iraq... just sayin!","commenter_a":"Shoot the witch..","post_message":"This woman killed her baby last year. Three weeks ago, she gave birth to another one. You can probably guess why she's in jail now."},{"comment_id":"10153169080361336","commenter_b":"What's up with that first woman who RAN in the other direction? Nice.","commenter_a":"They only pitch in to help the fallen man and good Samaritan after RUNNING AWAY FIRST!","post_message":"The 28-year-old hero leaped on to the tracks to save the man from getting hit by a train and other commuters helped to pull them both to safety."},{"comment_id":"510537979128082","commenter_b":"Hahahaha when she bends you over will see your complex","commenter_a":"Liar liar pants on fire burn in hell","post_message":"Join us in wishing Hillary Clinton a very Happy Birthday!"}]
