[{"comment_id":"10154546397896162","commenter_b":"Wow. What an inbred type comment. Do us all a favor and move into a cave with a black bear so he can eat your face off.","commenter_a":"dig this monster up and mail him back to the middle east with his family in tow.","post_message":"Visitors gather in Arlington National Cemetery around the grave of Humayun Khan, the U.S. Army Captain whose family has been in public dispute with Donald J. Trump... @webpagelink"},{"comment_id":"10154985023891192","commenter_b":"Because life on Earth is the only life we can observe and study, so it makes sense to look for other life within the scope of life as we know it. How could we even begin to look for other forms of life if we don't have a clue what to look for?","commenter_a":"I really don't understand the definition of \"alien life\" and why scientists think the environment needs to be remotely similar to ours to support \"life\". HUMANS need the right temperature and water.... \"aliens\" may not....??!","post_message":"BREAKING"},{"comment_id":"10153750072683352","commenter_b":"Or she was a trashed up slut waiting to get picked up by anyone..","commenter_a":"She was probably a law abiding citizen he only calls felons and degenerates","post_message":"‘We’ve not heard a word': Relatives of woman shot dead on San Francisco pier criticize Obama for not contacting them as they demand tougher immigration laws"},{"comment_id":"470490783141502","commenter_b":"Jail her useless ass dude. Fucking A","commenter_a":"@username Ha wow.","post_message":"Should All Welfare Abusers Be Arrested?  Comment 'yes' or 'no'."},{"comment_id":"610480015827201","commenter_b":"I'm a New Yorker and I don't like this weather lol","commenter_a":"If you're a New Yorker you should be used to this weather","post_message":"A winter weather advisory is in effect tonight from 6pm to 6am. Meteorologist Jeff Smith talks forecasting and answers your questions."},{"comment_id":"1178312252188803","commenter_b":"The site did not breech their privacy......they all willingly made the choice to put their name and information on there to cheat on their spouse......the site did not do anything negligently....the hackers got in.....they have been able to get into top secret government systems.....how is a website for cheaters supposed to be expected to have better security than the government? The hackers are the ones at fault.....and the idiots who allowed themselves to be exposed by trusting something as insecure as the internet to cheat on their spouse!","commenter_a":"I disapprove of what they did but the site breeched their privacy.... Hope every penny goes to those that were cheated on","post_message":"All allege breach of contract, negligence and violation of various state and privacy laws by Ashley Madison and Avid Life Media LLC"},{"comment_id":"10153457931491130","commenter_b":"Zane Gutierrez","commenter_a":"The politics of this is, scandalously ,that its a way for the establishment to write people off , they do not want to understand., There is so much hypocricy on this particularly in relation to alcohol : whats wrong with wanting to feel good , which is why anyone tries to get high off anything ?How we try to achieve this might be questionable but anything can be abused, does not make it bad in itself . people would not do self-destructive things if they felt self-worth. As some people here have said in their comments here,learning to love themselves was key to giving up the addiction .(not read the article btw)","post_message":"\"We put people who are not well in a situation that makes them feel worse and hate them for not recovering.\""}]
