[{"comment_id":"10152877015584071","commenter_b":"Yvon Fugère ton iPad et nos iPhones vont pouvoir avoir iOS 9. Ils l'ont fait beaucoup moins gros, il ne va prendre moins de 2g de place.","commenter_a":"Step 1: Get an Android Step 2: Get Cyanogenmod 11 Step 3: ???? Step 4: $$profit$$","post_message":"Is your device upgradeable?"},{"comment_id":"506081702885118","commenter_b":"Fuck you too. Bitch ass gringo","commenter_a":"Im mexican and even i say fuck mexico.","post_message":"\"When you're in danger, they're the last people you think to go to.\""},{"comment_id":"969122396467721","commenter_b":"i wasnt created to have babies..a lot of women arent..","commenter_a":"God created us to have babies, not kill them he doesnt like it","post_message":"And abortion is NOT healthcare!"},{"comment_id":"938381199514967","commenter_b":"Take the bitchs baby she don't need it jus like her other ones","commenter_a":"We need to all really start to focus on the hard truth of meth and the sickening epademic that is in almost every big and small town across America . I'm tired of all of the meth head thieves , I can't even imagine how many children across America are going through the same life endangering situations becouse of the parents being hooked on meth .. don't spend the tax payers money on jail , send them to treatment for several months . I'm sure these parents were decent human beings before meth took over . Unfortunately now they have like all meth heads done sinister,and incomprehensible acts . It's good to see these kids have survived when so many others don't .","post_message":"Bond's set at $100,000 for each parent after they allegedly abandoned their three young children in a house that neighbors call a mess and fire hazard.   \"Rats that were running in and out of the garage. I mean, it was horrible.”"},{"comment_id":"865998906849825","commenter_b":"godless atheists,satanists THIS FUCKIN FUSE OF LOWLIFES WILL END SOON","commenter_a":"When we start seeing these statue like this around America , that means the devil have claimed this land, God is coming back soon ppl be warned","post_message":"Florida Agrees to Distribute Satanic Temple Materials To School Children"},{"comment_id":"1031281086912749","commenter_b":"Oh. Duh. Maybe I could! Planning.","commenter_a":"Oh my. Could someone unfurl a banner with this at the next gathering of Congress?!?","post_message":"This is just great advice.  Image via our friends at ATTN:."},{"comment_id":"10156148528265725","commenter_b":"Trump has the mentality of an 8 year old class bully","commenter_a":"Suzanna Mikolajczak Trump is a Beast","post_message":"I think Megyn Kelly should take another eleven day \"unscheduled\" vacation."}]
