[{"comment_id":"604670086348434","commenter_b":"Like that, tbh","commenter_a":"He has the face a typical Republican Tea Party red neck. A Trump voter perhaps who will be voting in jail, if he is allowed. Disgusting asshole punching a physically disabled child.","post_message":"This guy gets my vote for Biggest Jerk of the Holiday season. --Andrew"},{"comment_id":"10154648123623812","commenter_b":"@username if Hillary would've have been held accountable 14 years ago, she'd be in prison.","commenter_a":"ABC news and the Washington Post- Lies. ABC headline is ridiculous. Newt Gingrich still backs Trump. The media is banking on people only reading the headline, and not the story.","post_message":"Newt Gingrich, one of Donald J. Trump's most ardent supporters and once rumored to be his vice-presidential pick, says Trump is \"proving he is more unacceptable\" than Hillary Clinton."},{"comment_id":"1080774725297647","commenter_b":"Given the history of Egyptian-Israeli relations it doesn't seem at all out of place","commenter_a":"We salute Egiptian people. This reminds us of GEORGE W. BUSH lrt him try to fly to Iraq there will be rain of rotten shoes on him","post_message":"An Egyptian lawmaker has been attacked with a shoe in parliament after he invited the Israeli ambassador to Cairo for dinner."},{"comment_id":"1328638283841395","commenter_b":"Generational behavior.","commenter_a":"I've been saying that for over 20 years and people look at me like I've got two heads. Everyone feels entitled including the adults and they pass it on to their children and the problem get exponentially worse. Where and how does one put an end to this......","post_message":""},{"comment_id":"480443122154949","commenter_b":"INDEPENDENT WOMEN FOR TRUMP!!","commenter_a":"Saw the Town Hall meeting with you tonight, very on point. I hope people get their heads on straight and vote for you Mr.Trump. Go Trump Go","post_message":"WOW! What an evening in West Allis, Wisconsin! THANK YOU for the incredible amount of support tonight. Everyone get out and VOTE TRUMP on Tuesday, April 5th! We will MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1024212657594017","commenter_b":"Your Emperor said himself 22 times on record that he doesn't have the power to do this. Game over.","commenter_a":"@username, President Obama has only threatened Veto if the try to screw his Immigration E.O.s, which by the way are Constitutional, your party is still playing their very dangerous game of obstructing everything President Obama does. As for your erroneous statement about the First Family's Christmas vacation, I will enlighten you as to the fact that other than Secret Service detail, they paid their own vacation expenses. The taxpayers always pick up the tab for security and use of Air Force One for ALL Presidents while they were in office. Now you go research!","post_message":"Republicans have only been in control for a week and already they are picking an unnecessary political fight that risks shutting down the Department of Homeland Security and endangering our security. Republicans should stop playing games and pass a clean bill to fund the Department of Homeland Security because the pointless, political bill passed in the House today will not pass the Senate.   House Republicans voted to tear families apart and deport young people who came to this country as babies. Tearing families apart does nothing to secure our borders, fix our broken immigration system or strengthen our economy.   This is not a game and it is time for Republicans to take their responsibility to govern seriously, instead of playing to the most extreme voices in their party."},{"comment_id":"1158864987513588","commenter_b":"\"You're the problem\" lol sound like a bitch","commenter_a":"You guys missed the full story here. See what happened was the person who served the food dropped them exact three fries on the floor, that lady was actually being a good Samaritan and helping the cop and taking the dirty fries away for him so he did not get sick. Long story short don't do anything nice for cops because they are assholes and will do everything they can to abuse their power and fuck over the average civilian. I made all of this up of course but all of us know never even talk to a cop unless you absolutely have to because they are just looking for a opportunity to arrest anyone because they are bored. She should have just waited for her own fries. Stupid decisions get stupid results.","post_message":"A woman was arrested in Northwest D.C. for stealing three French fries from a police officer who was dining at a U Street eatery. #WSHH"}]
