[{"comment_id":"10152785745546130","commenter_b":"Also this will happen @webpagelink","commenter_a":"This will end the first girl who gets into a HS foot ball team and the guys decide they're not going to pull their hits for her and hit her like a man twice her size. Look women can be tough. BUT the toughest women are weaker than the toughest men. it's called gender dimorphism. Most mammals have it. That isn't to say that somewhere a woman isn't going to show up that can play running back, but with thinner, softer bones she's also more likely to get killed or seriously hurt.","post_message":"She's not going out without a fight."},{"comment_id":"545764515614128","commenter_b":"Is she that dense ??","commenter_a":"If she was subjected to shariah law, she sold wished it never happen. Major mistreatment of women","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way.  What a disgrace. She needs to deported to the Middle East.  Do you think Nicole Kidman is a sell out?"},{"comment_id":"10152906901509270","commenter_b":"Unreal !!! This makes me sick !!!","commenter_a":"It's just Wrong. Wanna bet the Commander in Chief authorized this crap..","post_message":""},{"comment_id":"10153350644952212","commenter_b":"Bet it was you","commenter_a":"JhonnySSodas what you finess","post_message":"An Oklahoma City Whataburger was robbed at gunpoint early Monday morning #News9"},{"comment_id":"10153598853368984","commenter_b":"How many bullets are flying in your direction in the United States of America from Muslim extremists? How many IEDs are you avoiding on your way to the grocery store? I know we all know on any given day we could face gunfire from our neighbors from all different Christian faiths. If anything you're much more likely to be attacked in the U.S. by an angry Christian than by any other group of faith. The by the number argument that you're safer over seas from terrorist attacks than at home in the U.S. is based on comparing thousands of attacks on militarized institutions over seas and a small number of attacks directed at low security military institutions & personnel in the U.S. I feel for our solders at home being attacked. Just as I mourn for those children being attack in schools around our country. The people in the malls ...","commenter_a":"\"Radical Muslims are now the rule, not the exception\".... Let's talk about this. The Muslim faith has the largest number of believers in a world full of different faiths. To consider turning against all Muslims quite literally means to turn against over a billion people. She said this was the 21st attack. So roughly 21 people of the millions of Muslims living in the U.S. are radicals. I'm no math wiz but that sounds like an extremely small percentage. Secondly, Christians around the world have killed millions of people in the name of a God that most Americans demand our president to believe in. Who are the real radicals? Continuing, a soldier serving/living in the Middle East is absolutely not more safe there from terrorist attacks than one living in the U.S. That comment should be heard clearly as one of the dumbest things ever said. This Ignorance being spread ...","post_message":"This 22-year-old news anchor's brutal beatdown on Obama's \"half-way, half-baked, tip-toe, be-friendly-to-Jihadis mentality'' has been viewed more than 1.4 million times on YouTube, and overnight --  a viral sensation.  Now, she's just revealed what made her speak out.  Do you support Tomi Lahren and her message to Obama?"},{"comment_id":"10153404609274170","commenter_b":"I use roaches. She is like a roach, nasty.","commenter_a":"Good news here .. 57% *of* 47% only comes to 26.69% overall. This places me among the 73.31 who think she's a lying skunk (and those are her good points).","post_message":"53% of voters say Hillary is not trustworthy. ...But 57% of Dems still support her.  Why?"},{"comment_id":"588768351310241","commenter_b":"Put her in Jail !! I didn't ok that she can walk","commenter_a":"This is all Barry!","post_message":"Judicial Watch President Tom Fitton is LIVE discussing major court developments in our Clinton email case and Obama travel uses.  Tune in for the Weekly Update below."}]
