[{"comment_id":"1559248597428498","commenter_b":"Trump is a friggen rapist!","commenter_a":"Donald Trump and Hillary Clinton walk in to a bar. Donald leans over, and with a smile on his face, says, \"The media is really tearing you apart for that Scandal.\" Hillary: \"You mean my lying about Benghazi?\" Trump: \"No, the other one.\" Hillary: \"You mean the massive voter fraud?\" Trump: \"No, the other one.\" Hillary: \"You mean the military not getting their votes counted?\" Trump: \"No, the other one.\" Hillary: \"Using my secret private server with classified material to Hide my Activities?\" Trump: \"No, the other one.\" Hillary: \"The NSA monitoring our phone calls, emails and everything Else?\" Trump: \"No, the other one.\" Hillary: \"Using the Clinton Foundation as a cover for tax evasion, Hiring Cronies, And taking bribes from foreign countries?\" Trump: \"No, the other one.\" Hillary: \"You mean the drones being operated in our own country without The Benefit of the law?\" Trump: \"No, the other one.\" ...","post_message":"A 36-foot model of Donald J. Trump holding Hillary Clinton's head was burned during annual bonfire celebrations in a British town."},{"comment_id":"383422335172981","commenter_b":"There are laws and then there is right and wrong. When you factor out people from the laws, you create an inequity that needs to be handled as Solomon did --- One case at a time. Many years of productive residency DOES erase the fruit of the poisoned tree --- that she came here against a statuary law. Laws were made to cope with inequity. We have immigration laws because we feared overpopulation by the poorest people in the world who would want to come to the \"land of opportunity.\" But, when someone comes and contributes to our fabric, we need to weigh that against a rule made to prevent, in her case, something that doesn't exist.","commenter_a":"The first step in holding conservative views on immigration is that they can't view anyone who might be affected by bad immigration policy as fully human. That's the problem. They've successfully dehumanized Hispanic people so they simply don't care.","post_message":"Now she has the opportunity to apply to stay here legally."},{"comment_id":"10153063364393188","commenter_b":"Idiot and hypocrite. So he says he was a solider.","commenter_a":"He's a traitor and needs to be deported immediately","post_message":"Really?"},{"comment_id":"1404388792935308","commenter_b":"For those of you that vision oriented. 😝","commenter_a":"Michael is a cutie, btw. 😉","post_message":"You have to admit that this is a pretty great way to highlight the hypocrisy of anti-trans politicians."},{"comment_id":"923764651058995","commenter_b":"I've officially had it, I want Muslims in Muslim countries period not here...","commenter_a":"It was going to happen sooner or later. Might as well start it now.","post_message":"RT Khalilah Sabra: Muslims to Start a Revolution in America"},{"comment_id":"10153395040141336","commenter_b":"Because she and her mother are bible thumping morality pushing hypocrites. That's why.","commenter_a":"Why is it Bristol Palin gets pregnant and the liberals trash her, YET are proud of all the welfare momma's who have a half dozen kids, with several different donor dads, at the taxpayers expense? Bristol supports herself.","post_message":"Bristol Palin, daughter of 2008 GOP VP candidate Sarah Palin, has announced on her blog that she is pregnant with her second child.  “I know this has been, and will be, a huge disappointment to my family, to my close friends, and to many of you,” Palin said. @webpagelink"},{"comment_id":"1264285906955844","commenter_b":"Agree public should not enable bad behavior from 15 year old kid.","commenter_a":"She ain't no child, she wanted act grown, so she got treated likes she grown. Please don't sympathize with her, you are only enforcing the behavior that she is a \"child\" and she can get away with anything.","post_message":"\"The juvenile had to be detained.\""}]
