[{"comment_id":"10153148300259575","commenter_b":"You certainly are. \"Judge and be judged\" Crystal. I PROMISE you God is watching your actions as much as he's watching mine. Typing \" under a homosexuals death does not, in fact, secure your ticket to heaven babes.","commenter_a":"Let's see if she can have god change his mind","post_message":"A terminally ill woman whose desire to have her same-sex marriage recognized by Indiana before she died helped galvanize efforts to overturn the state’s gay marriage ban has lost her battle with cancer.  Niki Quasney died Thursday, gay rights advocacy group Lambda Legal said Sunday. She was 38."},{"comment_id":"1006224616090150","commenter_b":"Game ko anything basta sugtan lng ko hahahhahahahahaah","commenter_a":"Make ta tonight?!? @username @username dalhun ugma?!","post_message":"Learn how to make chocolate chip cookie dough ice cream sandwiches."},{"comment_id":"10153541248725950","commenter_b":"Rape and borders. @webpagelink","commenter_a":"If it had been for Berniestan or Queen Hillary, then nobody would have noticed it and @username would not have written any articles on it.","post_message":"The Ohio University wall has been an outlet for free speech for more than 40 years. But some students say the latest Donald J. Trump-related message went too far, and they decided to do something about it:"},{"comment_id":"10153032834297452","commenter_b":"I was waiting for Hillary Clintons campaign team to do this, desperate move. The army rangers officially lead the way of u know what. Ooooo rah to the hoooo ya","commenter_a":"Well done!!","post_message":"U.S. Army Capt. Kristen Griest (left) and U.S. Army 1st Lt. Shaye Haver (right) will graduate Friday at Fort Benning, Georgia along with 94 men. They will be the first women to graduate from the Army's notoriously grueling Ranger School. @webpagelink  Griest said her successful completion of the two-month program shows that women \"can deal with the same stresses and training that men can.\""},{"comment_id":"10153683983505575","commenter_b":"This country is OWNED AND RAN by Muslims.... Obama will make you accept Terrorist Muslim Refugees... There is nothing you can do about it,,, UNLESS YOU FIGHT his Civil war ( Marshall Law ) he is forcing upon you..","commenter_a":"I think it time .... all the state stand up to penis head... fight for our freedom of speech and rights to bear arms.... protect our U.S....","post_message":"BREAKING. . . ."},{"comment_id":"10154555374851337","commenter_b":"She's a big mouthy bitch lol","commenter_a":"Angie Hoekema","post_message":"WATCH Nancy Grace argue that Brendan Dassey's conviction shouldn't have been overturned..."},{"comment_id":"10153709197621336","commenter_b":"Was he having a stroke?","commenter_a":"Billynyvy Martinez","post_message":"WATCH: One Southwest Airlines employee could barely get through his safety spiel without nodding off and slurring his words."}]
