[{"comment_id":"10153635432868690","commenter_b":"Its not and has never been your land. You have no heritage nor history there except at best been that of tenant felaheens the Ottomans brought to milk the land for them or at worst; as more than half of you people are, illegal immigrants from the surrounding Arab states who flooded the land from the 1920s to 1940s as migrant workers and mujahideen who came to steal the land from the Jews. That your right of return better get its head swivelled to the Arab states. Besides, the Jews you ran out of the Arab states also has the keys to their doors and need their properties you stole and their own right of return.","commenter_a":"You will return and all Muslims will pray in Israhell won't last more than a decade","post_message":"\"For Palestinians to give up the Right of Return- even those who have no intention of ever returning - is to acknowledge that we are lesser beings; that kicking us out of our homes and ripping our hearts out was okay. It is to affirm that we do not deserve our own history and heritage; that it was okay for our proud parents and grandparents to wither in the ashes of their memories inside refugee camps unfit for animals.\"  Palestinian novelist Susan Abulhawa explores the meaning of the Right of Return."},{"comment_id":"10153217644964411","commenter_b":"Lmfao ro. What about the natives in Mexico? Forget about them you spaniard?","commenter_a":"Fuck off back to America - youu are needed there to fight the police!","post_message":"'The whole purpose  is to assure those allies that live closest to the Bear that we are here,' Lt. Gen. Ben Hodges, commanding general of US Army Europe said."},{"comment_id":"10154437809561491","commenter_b":"Sorry, no. She is front and centre in this kangaroo court of #45. She cannot have it both ways.","commenter_a":"Let the woman live her life. Sure, I cannot stand Donald Trump to save my life. But what is going to set us apart him? We do not judge people based off of the behavior of someone else. That's what being a liberal is all about. Acceptance of each and every person on the basis of their individual character.","post_message":"The Internet is not happy with the latest post by Ivanka Trump's brand."},{"comment_id":"10153263448855095","commenter_b":"Arguments about religion, politics are a useless battle people nobody wins and about the refugees coming in i'm highly against it, there is no way we will know the good from the bad and I believe there are good and honest people that have been brought to America but you can bet your ass that there's a radical somewhere in the 10,000. I love my country and I'll be damned if we're gonna stand by and let our government bring in a possible threat and believe me it's very possible with the insane actions our president is taking, this will turn out bad and it will be the American people who will suffer in the end","commenter_a":"\" My parents came to this country 45 years ago searching for freedom and a chance.\" But you dont want to afford that same chance to others? What a hypocrite.","post_message":"I cannot tell you what an honor it has been to run for President of the United States of America. My parents came to this country 45 years ago searching for freedom and a chance.  When I was born, we lived in student housing at LSU, and never in their wildest dreams did they think their son would have the opportunity to serve as Governor of Louisiana or to run for President.  They raised me to believe Americans can do anything, and they were right, we can. But this is not my time, so I am suspending my campaign for President.  Going forward, I believe we have to be the party of growth and we can never stop being the party that believes in opportunity. We cannot settle for The Left’s view of envy and division. We have to be the party that says everyone in this country - no matter the circumstances of their birth or who their parents are – can succeed in America.  One of the things I will do is go back to work at the think tank I started a few years ago - where I will be outlining a blueprint for making this the American century.  We must show the way forward on growing our economy and winning the war against terror, and especially defeating radical Islam.  I realize that our country is off on the wrong track right now. Everyone knows that, but don’t forget, this is still the greatest country in the history of the world – and every single one of us should start every day by thanking God that we are fortunate enough to be US citizens.  Now is the time for all those Americans who still believe in freedom and American exceptionalism to stand up and defend it.  The idea of America – the idea that my parents came here for almost a half a century ago - that idea is slipping away from us.  Freedom is under assault from both outside our borders and from within.  We must act now, we do not have a moment to spare."},{"comment_id":"1901824630047376","commenter_b":"Meant to be","commenter_a":"Catherine her name... :)","post_message":"She’s a Republican college student and she’s proof that marching is about more than politics. #WomensMarch"},{"comment_id":"10153444962923984","commenter_b":"Yes since he is their best muslim buddy","commenter_a":"Duh Yeah","post_message":"Well, this is worrisome. It's bad news for pretty much the entire Middle East, except for ISIS.  Do you think Obama has entirely botched the ISIS situation?"},{"comment_id":"10154454599501162","commenter_b":"That lady is an idiot","commenter_a":"What the f @username Angela Lemonjello Caringella Care Re","post_message":"Harbor seal pup euthanized after being carried off a beach in a plastic shopping bag."}]
