[{"comment_id":"10154684897643872","commenter_b":"Cow Patty is a crooked Hillary corporate baby killing whore and will lose in November!!!!","commenter_a":"Yeah, I'm voting you out for voting for TPP, freedumb act planned unparenthood and supporting crooked Hillary, enjoy unemployment Cow Patty!!!!","post_message":"Voting starts today! Got questions? Visit iwillvote.com for answers."},{"comment_id":"10153801731062144","commenter_b":"@username I know that every pedophile must have a defense attorney, but I don't want anyone that defended one as a president! I'd quit the freakin job, go hungry, and sleep in my car before I defend a pedophile! No real woman would do what she has done!","commenter_a":"How about talking about Hillary's ethics? Imagine your little girl was brutally raped and beaten, and you had to sit in a court room and listen to Hillary attack your child to get a rapist off. Would you vote for Hillary for president? Yes? Then you must be some kind of stupid. Go Bernie!","post_message":"Democrats just released a devastating ad against Donald Trump."},{"comment_id":"1243385125672214","commenter_b":"@username ill kill you","commenter_a":"@username @username Jane Ní Chonchubhair Gala Ní Mhuireagáin boop","post_message":"BOOP"},{"comment_id":"10153162470033908","commenter_b":"get outta here","commenter_a":"1 & 6 Katarina Koncarevic","post_message":"Here are 8 things you can do to potatoes you probably didn't know:"},{"comment_id":"1576025939362143","commenter_b":"This is America not European dont like America go back to European take DONALD TRUMP with you ok gringo","commenter_a":"Why are people dumb enough to think people who do not want illegals in the US hate Mexicans? Or any other foreigner? It is ILLEGALS that they want to regulate, no those entering the country legally. We could do without the wall, just get more Border Patrol and more bullets...and do like other nations, shoot those crossing illegally, maybe that would satisfy the supporters of illegal immigration... Read up on Mexico's illegal immigration law.","post_message":"Former Mexico President Vicente Fox is sorry, not sorry about his big middle finger to Donald J. Trump and his proposed wall along the U.S. southern border."},{"comment_id":"10153176859780667","commenter_b":"Yep..that's what it comes down too. Ungrateful brat & worse money hungry parents !!! Deport them now...but demand payment for his education& for being allowed to live in this great land of opportunities !!! Seriously !!!","commenter_a":"It figures about the money ,but they won't even get 10,000","post_message":"\"The school and city officials involved knew what they needed to do to protect Ahmed's rights. They just decided not to do it.\""},{"comment_id":"10152687938146813","commenter_b":"So what? Some women don't want to have kids at a particular time. Some never want to have kids. Second, most women who have abortions do so because of financial reasons. Third, contraception isn't 100% effective. Some types are only 75% or so effective. The diaphragm in a multi-para woman has a low effectiveness rate. I've been pregnant twice on oral contraception. Each woman has her own story. If she wants to tell it, she will. Otherwise, it's none of your damned business. Oh, and if my body is affected, it is my choice. I have self-autonomy over my body.","commenter_a":"Abortion is not a method to avoid pregnancy; a woman can avoid pregnancy by using birth control provided to her for free and not getting herself pregnant. Abortion is, in reality, simply a way to avoid MOTHERHOOD; it's not 'my body, my choice,' it's 'my LIFESTYLE, my choice.'","post_message":"The question matters: More people support abortion rights when the poll language focuses on women. #LetsTalk @webpagelink"}]
