[{"comment_id":"10154856564546438","commenter_b":"Fake IDs fake visas...so why are we sure illegals never voted?? Illegals pose threat because of how much they owe coyotes that families back in Mexico maybe threatened if they dont run drugs for cartels...Trump is right to close this border.","commenter_a":"Ooooo","post_message":"\"You notice the Republicans are not saying, 'Hey, those aren the facts,' or 'something has changed,' or 'he did all these other things afterward.' No, what they saying is, 'You don get to talk about that.'"},{"comment_id":"1067472230049155","commenter_b":"fuck your wall. period wall wont do shit. 2nd those thousands of lives were addicts, as if you care.","commenter_a":"I am not sure why a man who is responsible for the deaths of thousands through violence and drug overdoses is considered a cult hero by some people. However I think we should consider parole if he will pay for the wall!","post_message":"El Chapo not happy with the prison conditions. #ElChapo #WSHH"},{"comment_id":"455025114688069","commenter_b":"yes","commenter_a":"CNN sucks","post_message":"Should Networks Like CNN Be Shut Down?  Comment 'yes' or 'no'"},{"comment_id":"868758169887103","commenter_b":"crying about the NRA , every lobbying groups receives money from those they represent . Guns sell themselves , new models fly off the shelves and gun stores hardly discount. Women are one of the fastest group of gun owners in the country .Many single mothers and single women carry weapons , it is the best defense . Many women have stopped harassment , rape or assault because they were armed, weapon is often never fired .","commenter_a":"If you read the article, it sounds as if alcohol should be banned from campus. What the article does not say, is you still need to be 21 to legally have a handgun. That and you would still need your concealed carry permit. Concealed carriers are as a group less likely to commit crimes than even the police. Ever time carry options get more loose, liberals cry the streets will run red with blood, but the reality is just the opposite.","post_message":"These bills are moving through state legislatures across the country - here's what you need to know."},{"comment_id":"1765122613748965","commenter_b":"NO YOU SHOULD SHUT THE F UP","commenter_a":"#Podesta should stfu...","post_message":"\"I think the men and women of the FBI are doing a tremendous job out here across the country. But the leakers should shut up,\" Podesta said"},{"comment_id":"10157484651970725","commenter_b":"@username PAM she is already DESTROYING THE COUNTRY !","commenter_a":"Go trump ! So, 96% of Hillary's charitable donations went to the Clinton Foundation! Yeah, 96%, they donated to themselves.","post_message":"Unbelievable! Thank you Erie, Pennsylvania. This is a MOVEMENT! I have no doubt that we are going to WIN -- and MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"},{"comment_id":"10153580814197235","commenter_b":"Lizzie, abortion is totally legal in the case of danger on the mother's life, no matter how old the fetes is","commenter_a":"Mike Huckabee reminds me of fundamentalist Muslims.","post_message":"Horrific."}]
