[{"comment_id":"1069935306362850","commenter_b":"Wooh, I guess different strokes for...that's one ugly woman","commenter_a":"Carly not bad to the eye that's all","post_message":"Carly ROASTED Hillary over her email scandal!  Watch her sound off."},{"comment_id":"10154997880686350","commenter_b":"Congratulations ...but women have babies every day...","commenter_a":"Kristen Howarth Scott","post_message":"Big sister-to-be Blue Ivy is just the cutest!"},{"comment_id":"10152697644391770","commenter_b":"Thank you for giving me a laugh at your attempts to be of value to society","commenter_a":"Honesty is not an option in Obamas picks.","post_message":"Cruz explains what McConnell SHOULD have done."},{"comment_id":"1052361568153705","commenter_b":"A lot of people who follow this page will probably chuckle at this... But those are actually two very evil women you see picture there.","commenter_a":"#Hillary2016","post_message":"Hillary and Cecile Richards sat down with Refinery29 and talked about everything from “mansplaining” to the future of abortion rights."},{"comment_id":"10153371613511336","commenter_b":"Leave it alone. Enough already!!!!!!!","commenter_a":"REALLY? think theres much better ways to spend our tax dollars","post_message":"With your help, #TheNew10 will be decided later this summer."},{"comment_id":"10153506495063855","commenter_b":"Stay outta Kohls then Asshole...","commenter_a":"OMG. Is kohls run by the lesbiens now? My wife told me the womens shoe section is full of work and combat boots nowadays.","post_message":"ICYMI: Kohl's melts our hearts."},{"comment_id":"10155007911979228","commenter_b":"Couldn't agree more. This is a global women's health issue and we put so many women at risk by this gag. Women will be dying from this order.","commenter_a":"Thankyou for showing positive leadership against these attacks on women's rights! This is the kind of action we need in DC right now!","post_message":"Two days after millions of women marched to oppose the new president's backward policies, he reinstated the Global Gag Rule, a federal ban that will directly affect a woman's access adequate healthcare in the U.S. and abroad. It's up to Congress to permanently repeal this dangerous rule and I've cosponsored the Global HER Act to end this outdated policy once and for all.  @webpagelink"}]
