[{"comment_id":"10153748697767629","commenter_b":"If white women didn't flunk every black and Latino out we might have the blacks in college and in education that we need.","commenter_a":"When are we going to start making teachers uncomfortable and scared? its a white, more privileged profession with more time off. Especially at the college level. Shouldn't they fear being shot in the head too? Thankfully we are getting guns on college campuses so that all authority can be radically challenged with an in your face confrontation. The Russian left has always known the power of confronting authority so I'm glad America is catching up. War and Revolution baby! Just like the founding fathers intended.","post_message":"This is beautiful."},{"comment_id":"10153976851960950","commenter_b":"Hillary husband, Bill Clinton, makes Bill Cosby look like a Saint.....","commenter_a":"Bring it baby. I used to feel sorry for Melania, but she is as bad as her bully pervert of a husband. All Trump cares about is his money. All Melania cares about is Trump's money.","post_message":"She is demanding a retraction and apology."},{"comment_id":"949029821890932","commenter_b":"@username Before you vote for Clinton remember this. a vote for her is vote for a another kilo of heroin across an open border polluting Americans and contributing to more crime.","commenter_a":"If you are privileged enough so that a Trump presidency doesn't matter to you, vote against him for the many people he will take advantage of if he wins.","post_message":"Most Americans, regardless of their political views, do not want to see us go backwards, and are not going to be supporting a candidate for president who has made bigotry the cornerstone of his campaign."},{"comment_id":"1077069452383729","commenter_b":"@username she better be overreacting","commenter_a":"Yo this made me think if that shyt gonna hurt @username","post_message":"She's not ready for a tattoo"},{"comment_id":"1342884069080344","commenter_b":"And deport!","commenter_a":"Anyone wearing a mask does not want to get their picture taken when they destroy, throw them in prison and make them pay for damages.","post_message":""},{"comment_id":"10153558061286037","commenter_b":"Doesn't matter. BUT FOR her illegal arrest, she would not have been in jail.","commenter_a":"aaaand boom goes the dynamite.","post_message":"Waller County prosecutor Warren Diepraam says the injuries that were found during the autopsy of Sandra Bland would be consistent with a suicide."},{"comment_id":"1130843966969767","commenter_b":"Good keep them there and deport them","commenter_a":"Like packs of hyneas.","post_message":"UNREAL! SOMALI MUSLIMS RAMPAGE Through Mall Of America In Minnesota...10 Arrested [Video]"}]
