[{"comment_id":"10153381593334411","commenter_b":"If you've been in brothel, you are worse than a prostitute, as prostitutes might were forced to do it, you go there at you own will, which makes you a sleaze-ball","commenter_a":"idk, a Russian backed news organization saying America is a police state? Maybe, but few people are being jailed for being gay here as opposed to your \"glorious\": homeland","post_message":""},{"comment_id":"10154882133170329","commenter_b":"Really people! No arguments please","commenter_a":"The correct term is Native American.","post_message":"\"I realized that half the world made such an effort to get what I am naturally blessed with.”"},{"comment_id":"10153386538275326","commenter_b":"How is he going to run his hotels,if he reports all illegals??","commenter_a":"He mean kill them.","post_message":""},{"comment_id":"10153406625761130","commenter_b":"What sport are the males allowed in the female locker rooms?","commenter_a":"\"Male journalist arrested for trespassing in women's locker room. Charged with trespassing, unlawful entry and sexual harassment\"","post_message":"\"It's still 2015, right?”"},{"comment_id":"10153739704671051","commenter_b":"Dumb ass","commenter_a":"For recreational usage YES, only and dope does dope for no reason other than to escape reality. For MEDICAL use, HELL NO, it should be 100% illegal. BUT, that is not the real issue here..... the REAL issue is, THE LAW Follow it, or pay the price, SIMPLE","post_message":"Do you think marijuana usage should be illegal?"},{"comment_id":"1263844570323065","commenter_b":"yep. Sobbing now.","commenter_a":"Started crying before I even opened the article","post_message":"These Holocaust survivors just regained a lost part of their childhood. - Jon Comulada"},{"comment_id":"10153816653768854","commenter_b":"Did you see the gaggle of stupid white girls in the \"shield?\" I wonder why they hate their daddies so much.","commenter_a":"All that money spent, all the debt incurred, to produce kids like that.","post_message":"Liberalism is a Mental Disorder: Professor of Media Threatens Media with Mob Violence for Trying to Film Protest  [VIDEO]"}]
