[{"comment_id":"10155889983075354","commenter_b":"This was the flag of SOUTHERN DEMOCRATS, no less! It took a Republican (Lincoln) to free the slaves!","commenter_a":"With all of the \"racism this, and political correctness that\" nonsense going on, the attempt to distract the masses is working. Do you know the REAL REASON this flag is under attack?? Simple, it's because it's the rebel flag, the flag of RESISTANCE!!! The one true evil behind all of this, is government. They realize people are waking up to their BS and want the sheep to behave... nope, I will NOT ABIDE!!! Wake up people!!!","post_message":"\"I understand the true nature of the war, and slavery was not the primary issue.\""},{"comment_id":"555875991245538","commenter_b":"Finally a person with some brains","commenter_a":"We should not have even been considering it in the first place. When other muslim nations refuse to take refugees because of the fears of terrorism, why should we take the risk? There's lots of room at the White House- let them stay there.","post_message":"Official Statement from Dr.Ben Carson:  Today, I am asking Congress to stop the Obama Administration’s plans to bring in up to 45,000 Syrian refugees. There is currently no ability to vet these people.  By letting refugees into our country without vetting we are putting America at risk. If our President cannot see the risk, then we must rise to the challenge and protect our country. This morning President Obama announced at his press conference that it was our responsibility to accept these refugees. He is wrong. He took an oath to protect and defend this country. There is simply not a way to vet these refugees.   We should do everything in our power to help these men, women, and children who have been forced to flee their country, but until we can sort out the bad guys, we must not be foolish. I call for increased aid to the refugees. We can and should do more to feed the hungry and shelter the homeless. We must also protect them from being attacked by implementing immediately no fly zone over these camps.  President Obama said this morning that it would be a mistake to send more ground troops. I think plenty of mistakes have already been made. As President, I would give the mission to the Pentagon, and ask them what they need to accomplish the mission. The right number of boots on the ground is whatever number the Pentagon says they need to accomplish that mission and not a single person less. The error of armchair quarterbacking our military will end in my administration. They will get the support they need and nothing less. Both the FBI and former Intelligence Committee Chairman, Mike Rogers, have indicated that it is not possible to fully vet these refugees as there is no Syrian list to vet against. Allowing these refugees to enter our country without knowing who they are is foolish. I am talking to many experts as I can, and I have yet to find one who thinks that the Obama Syrian/ISIL strategy is anything but a failure. The only thing that President Obama seems to have contained is this foolish policy inside his government.   We need to offer more than empty tough talk. We need to say what we mean, and most importantly mean what we say. When we draw a line in the sand or boundary in the air, the world needs to understand that we mean it. Too many people across the world today think that we don’t."},{"comment_id":"10153943108472042","commenter_b":"Break that glass ceiling girls!","commenter_a":"Media prepping questions for war lmao","post_message":"Do you think women should be required to register for the draft?"},{"comment_id":"10156450025520551","commenter_b":"She is as dangerous as Hillary","commenter_a":"both---jail time","post_message":"Issa: FBI director would like to indict Clinton and Abedin [VIDEO]"},{"comment_id":"10155438408395354","commenter_b":"If she had a brain, she would be dangerous","commenter_a":"she can also take credit for being a slut.","post_message":"\"sooooo bad a$$ Senator Cottons voicemail box is fulllllllllll!\"  ....we didn't forget the apostrophe, Miley did."},{"comment_id":"1425446234154201","commenter_b":"That chick Greenville Reece is crazy","commenter_a":"Is an idiotic argument when people say that the world is flat take some Physics classes in college and you will actually do experiments to look at this phenomena. Don't educate yourself off YouTube actually read some Physics books, even physics 201 and 202 in college will answer this a question.","post_message":"Kyrie Irving got defensive when a reporter asked him about his recent comments on the idea of the Earth being flat."},{"comment_id":"673468959486383","commenter_b":"Can't run from jail...better hope Obama pardons her","commenter_a":"I do not think she will run in 2020, nor will the DNC even consider her after the whooping they took, she is too toxic.","post_message":"Trump-Clinton rematch for 2020?"}]
