[{"comment_id":"786225381476070","commenter_b":"Thats what fat racist lady wanted the cops to believe. I believe the teens who say the lady started yelling racist slurs and then slapped an underage girl. Then the racist lady called cops and lied to the police saying everyone was unruly and uninvited.","commenter_a":"It was not a pool party by all accounts....a dj set up beside a private pool and the pool was invaded by the people at the dj gathereing. And after being asked to leave by the security guard and being unruly ....the police were called and told a group of black individuals were causing trouble.....that s why th ey were focused on the black individuals....it was not a race thing. ...it was a group of disrespectful unsupervised kids being trouble....and they get attention from all of you...instead if being ignored by the public and handled by their parents....wow they have something to brag about now.....grow up and stay out of it and let the people involved handle it...","post_message":"He ran when the cop pulled out his gun."},{"comment_id":"10154775729248812","commenter_b":"Not to mention she has dyed her eyebrows to try to look younger. Won't work. She still looks like she needs a nap.","commenter_a":"They both disgust me","post_message":"Hillary Clinton: “Last night I was ‘grossly generalistic,’ and that's never a good idea.\""},{"comment_id":"10153363200377452","commenter_b":"Praying for the family, so heartbreaking.","commenter_a":"So sorry can't imagine the pain their families","post_message":"HEARTBREAKING: Just a few months after his sister died from leukemia, a distraught teen was struck and killed while riding his bike by a hit-and-run driver."},{"comment_id":"1023792714394917","commenter_b":"We already lost it! We've gone backwards for the last 7 years and all that's happened is the Tory Party and it's mates busy enriching themselves from National and Taxpayer assets.","commenter_a":"I worked since I was 14 - paid my share and I say out ! All us pensioners have paid in - but David Cameron wants to open the borders to any one and give them all free hand outs and homes !!! It's not on !!!! We need to stand up for our selfs","post_message":"Britain faces a \"lost decade\" if we vote Leave, says David Cameron. He warned pensioners in particular \"don't risk it\". Is he right? Would leaving the EU really be bad for our pensions? Judge for yourself: @webpagelink"},{"comment_id":"1111151122296756","commenter_b":"This makes Chicago sound a lot like Baltimore for the \"quality\" (corrupt, criminal) of incumbent leadership (I grew up in the south side of Chicago all the way back to the 60's - and am not much impressed with what the present day enthusiasts think of my opinion. I also lived for a while in Viet Nam, and there we were allowed to call the other guys \"enemy\", and to shoot back at targets of opportunity, ... just sayin\") @webpagelink","commenter_a":"I knew there was a dirty Democrat involved in that ruckus!","post_message":"Inside scoop, here . . ."},{"comment_id":"1266839853337023","commenter_b":"Hey Mario, stfu !","commenter_a":"You're an idiot if you think you can light a fire in the airless vacuum of space","post_message":"That classic \"teardrop\" shape only forms because of gravity. So what happens when there's no gravity?"},{"comment_id":"494982004030385","commenter_b":"The towers that Donald Trump built ... Border Patrol endorses you to build that wall too, Mr. Trump ... A BUILDER ... not a destroyer ... of American liberties/freedom FOR POTUS!!! @webpagelink @webpagelink #DONALDTRUMP #POTUS #REPUBLICANPARTY #GOP #2016ELECTION #BORDERWALL #BORDERPATROL #TRUMPTOWERS #PRESIDENTIALPRIMARIES #VOTETRUMP #TRUMPTRAIN #MAKEAMERICAGREATAGAIN","commenter_a":"7% lead is good but you know that you need to win by double digits to shut ted up. IF you have any last minute secret weapons or anything you haven't used now is the time. Win NY huge and then take Cali and then proceed to destroy the liar and the commie.","post_message":"Thank you, California! I will see you soon! Have a great day - and remember - - TOGETHER WE WILL MAKE AMERICA GREAT AGAIN! #TrumpTrain"}]
