[{"comment_id":"10154356048051002","commenter_b":"Women cause cancer to men with there drama lmao. Jk","commenter_a":"What doesn't cause cancer these days???","post_message":"Like your daily hot dog or bacon sandwich? You may want to think again."},{"comment_id":"10155827348030603","commenter_b":"Well if the driver is 18 then maby she should be brought up on man slaughter .","commenter_a":"I know this is a hit and run.. but why was this man in the street?","post_message":"#BREAKING: One of the suspects is also facing involuntary manslaughter and leaving the scene of an accident charges related to the hit-and-run that killed Bapi Gupta."},{"comment_id":"971252449561175","commenter_b":"Hat's off to this chick!!!! Good for her! To bad she didn't kill the s.o.b.!","commenter_a":"Well done! I would want to do the same thing. These perverts cannot be rehabilitated.","post_message":"The woman took matters into her own hands when she caught  her boyfriend trying to sexually assault a 12-year-old -- by running him over with her car. >> kiro.tv/RunOver  She, and her boyfriend, were arrested."},{"comment_id":"1731162717167272","commenter_b":"Rob Reiner is a slut! Liberal twit, rich and ignorant as a bowl of dung!","commenter_a":"The rich and stupid strike again...","post_message":"You mean racist like the race-baiters who back Hillary Clinton?   Kinda like that, Rob?"},{"comment_id":"10153773357374877","commenter_b":"WTF... Where I live... White people be blasting they music so cut the crap!","commenter_a":"Ugh","post_message":"Driving While Black: Cops drag black man from his car and Taser him for playing loud music.   Grio fam, this is wild!"},{"comment_id":"10153253284026756","commenter_b":"i like to read porn not watch it as much","commenter_a":"Meanwhile, people are praising a movie about a creepy, abusive man who likes to manipulate women into believing they want to be treated like emotional and sexual slaves.","post_message":"In which the vice president manages to invade all of our personal spaces, simultaneously."},{"comment_id":"593124330856614","commenter_b":"@username where did she go?","commenter_a":"I hate Donald Trump, but these idiots are playing right into his rhetoric, and not doing anything but acting like thugs.","post_message":"Watch: Protesters set fire to a Donald J. Trump supporter's hat.  Read more about the San Jose assaults here: @webpagelink"}]
