[{"comment_id":"10154362083273325","commenter_b":"Oh Baloney California is the Welfare , Illegal State !","commenter_a":"California is what's known as a donor State, in other words, we pay more in Federal taxes than the services/benefits we receive. This idiot needs to do some research before threaten us with his ridiculous tweets. #Resist #NoBanNoWall #RussianPoodle","post_message":"Describing California as \"out of control,\" President Trump said he would not be opposed to using defunding as a \"weapon\" against states that want to be sanctuaries for undocumented immigrants."},{"comment_id":"575919325907618","commenter_b":"She still does this stuff","commenter_a":"I am with hillary Clinton. All the way.","post_message":"Share if you’re ready to make history."},{"comment_id":"1126887640660229","commenter_b":"If she's black, the barry is white !","commenter_a":"You will always be that lovable little fuzz ball, however you identify yourself!","post_message":"You know, I think I'm going to \"identify\" as skinny.  That way I will not have to ever go on a diet. I'm just gonna identify as skinny.  I just am.  You think I'm not?  Screw you!"},{"comment_id":"1765122613748965","commenter_b":"NO YOU SHOULD SHUT THE F UP","commenter_a":"#Podesta should stfu...","post_message":"\"I think the men and women of the FBI are doing a tremendous job out here across the country. But the leakers should shut up,\" Podesta said"},{"comment_id":"1064458436973745","commenter_b":"FIRE HIS ASS !","commenter_a":"Fox should remove shep ,,,,he was absolutely rude because he only wanted his views to be discussed, Time to go,,,,","post_message":"Many are Calling for Shepard Smith to be FIRED After What he Just did ON AIR... @webpagelink"},{"comment_id":"1077871268936068","commenter_b":"I guess being a lawyer, U.S. Senator and Secretary of State aren't real jobs?","commenter_a":"So fun to meet someone whose actually worked a real job..eh Hillary?","post_message":"The best part of being at Caesar's Palace at midnight? Meeting the amazing staff."},{"comment_id":"10153302293701051","commenter_b":"EVERY country is populated at some point in its history by people who migrated to it ... THAT is how all countries began.... good grief. No one is against LEGAL immigration.","commenter_a":"Nearly 100% Americans ARE immigrants. Through their ancestors. :-))","post_message":"Do you agree with the vast majority of Americans on this?"}]
