[{"comment_id":"10153630304246509","commenter_b":"Guess you've never heard of Irish-American clubs. Guess you've never heard of Italian-American, German-American, Polish-American or perhaps people celebrating their ethnic heritage. So apparently pride in one's ethnic origins is not extended to Black Americans. What is the name Rush? English? I'm betting someone in your family came over on the Mayflower? Proud of that? Why not? Apparently if you were taken against your will in irons on a slave ship you also lose your ability to take pride in your heritage as well?","commenter_a":"There is no such place as \"Africa-America\" therefore there is no such thing as an \"African-American\". They are either Americans or they are Africans. Not all blacks come from Africa and not all Africans are black. Why don't they try and be American's for once in their life's?","post_message":"After recording an ode to Baltimore, #Prince has announced a Mother's Day rally and concert there. Concertgoers are invited to wear something gray: @webpagelink #FreddieGray"},{"comment_id":"1079846958771328","commenter_b":"redneck racist are that way","commenter_a":"wtf happened in just 4 years","post_message":"LULZ."},{"comment_id":"10153427555429087","commenter_b":"How the hell do you not get 1000 signatures? Hahahahahaha","commenter_a":"Fail @username","post_message":"A spokesman for the Ohio secretary of state has confirmed to The Hill that Martin O'Malley failed to get the necessary 1,000 signatures to appear on the March 15 ballot."},{"comment_id":"745794202277824","commenter_b":"She a fat hoe nuttin moe","commenter_a":"Dumb song.","post_message":"Something DISTURBING Was Just Exposed About Beyonce's Halftime Song  This is sickening. She should be banned from performing at any sports events for this.  Do you Beyonce needs to learn some respect?"},{"comment_id":"10154312935051337","commenter_b":"All i can say is wow! I mean since Bran can use his powers to enter into a body does that mean he will eventually enter into the white walkers body an control him by pushing out what was put in now that would be awesome.","commenter_a":"That was by far the saddest moment of this show! Rip hodor/direwolf.","post_message":"OH. MY. GOD. Craziest Game of Thrones yet?"},{"comment_id":"10153251876512464","commenter_b":"Would love to see these two little girls in the White House with dad.","commenter_a":"What a special day for the whole family","post_message":"Yesterday, we spent a wonderful Sunday afternoon teaching Caroline how to ride her big-girl bike—without training wheels!  She did awesome; very proud of her."},{"comment_id":"1306577949392367","commenter_b":"Rapidly arriving at the point where I can't bear to read or watch anything this Neanderthal does. In my opinion, he is a racist, terrorist supporting radical Islamist bent on bringing about America's downfall.......on the orders of his puppetmaster, George Soros.]","commenter_a":"Obama helps promote fake news, since it serves his purpose.","post_message":"\"obsessed”"}]
