[{"comment_id":"665234353646282","commenter_b":"Can't make a silk purse out of a sow's ear.","commenter_a":"#klasssa 👌","post_message":"Do you think the Obamas represented America with class as our nation's First Family?"},{"comment_id":"1178538995510357","commenter_b":"I would have moved too.","commenter_a":"Ungrateful people if they really look at the whole picture officers are out there protecting us,don't judge the rest because of the other bad apples.Now they got to deal with criminals and the society plus news reporters.Too bad the officers can't close their eyes and walk away and say I don't want to help you guys!!!!!! But they swore under oath they will serve and protect you!!!!!!!","post_message":"The officers even covered the couple's tip."},{"comment_id":"1104531886270791","commenter_b":"She's a pussy cat","commenter_a":"@username take your next vaca with Marina","post_message":"Welcome to dog paradise — tons of land to run free and daily visits from human playmates. (via INSIDER)"},{"comment_id":"10153850185846770","commenter_b":"Women talk about men in all women groups too.... no one ever talks about that but women can get raunchy too....","commenter_a":"So guys can't be guys and talk in private? I bet 100% of the people whom have a problem with this are guilty of doing the same thing in some fashion in there own lives but let's make a big deal about ABSOLUTELY NOTHING","post_message":"Her name is..."},{"comment_id":"10153666209640399","commenter_b":"Fire her!","commenter_a":"I've always liked Debbie, and had a lot of respect for her, but if this thing has legs, it could spell big trouble. There is enough dishonesty in Republican Ranks, we don't need any in Progressive Ranks. We all need to watch this carefully.","post_message":"Debbie Wasserman Schultz said the DNC needed to suspend access until they can be sure that the information hasn't been \"manipulated.\""},{"comment_id":"844804189043491","commenter_b":"Bye bye bitch","commenter_a":"never did like the ugly bitch","post_message":"Liberal trash has no place on tv. This is the best news all year. Do you think Whoopi deserves to be kicked off the air?"},{"comment_id":"1047390088634796","commenter_b":"Jane I think you should try instead of History books the actual bill that was introduced in the Congress in 1983, the sponsors of the Bill, the Democratic almost unanimous vote, and the Democratic rationale behind their support. It's there to read if you get your head out of your ass","commenter_a":"Strange how if your a Democrat you tend to forget the horrors created by your party when foolishly you are in command. After President Carter destroyed our country we needed to reform the Social Security System so it would be solvent as is the case today with Obama doubling down on the atrocities created by Carter. When Reagan took office he acknowledged that the system was broken and pledged to fix it. At the time we had a Republican President, a Democratic Congress and a Republican Senate but we also had a different set of principles in our politicians as they were devoid of loons like yourselves and the likes of Cruz. The Democratic house took care of all federal employees, all Federal Judges, all State Workers, all women's rights, raised the AGE of retirees from 65 to 67, took care of themselves, their staff and whoever else they could ...","post_message":"Jeb Bush has a plan to save Social Security: Ensure hardly anyone can qualify for it. Is he trying to lose the election?"}]
