[{"comment_id":"1307596852595922","commenter_b":"Bangkok, Thailand","commenter_a":"Seoul","post_message":"Check out this LIVE rocket launch! Shortly, a Russian rocket will launch from Kazakhstan and travel to the International Space Station, and you can watch it LIVE right here. This is an uncrewed rocket, and it will deliver food, fuel, clothes, and other supplies to the astronauts on board the ISS. Where in the world are you watching from?"},{"comment_id":"867826306655078","commenter_b":"Oooooh ich möchte eine haben!! <3","commenter_a":"Friederike happy Welt-Giraffentag!","post_message":"Happy world giraffe day!"},{"comment_id":"245227072596737","commenter_b":"She's a freaking retard!","commenter_a":"One thing he is not insecure, but you are Nancy","post_message":"\"I feel sorry for you. You're the president of the US and you're so insecure...I pray for your Mr. President. And more importantly, I pray for the United States of America.\"  Do you think Trump is insecure?"},{"comment_id":"10154860670292435","commenter_b":"Take flamethrower out there and really clean the swamp!","commenter_a":"You get a fire truck and water board them with a hydrant.","post_message":"Happening Now: Protesters outside the White House opposing President Donald J. Trump's travel ban."},{"comment_id":"10158241911570405","commenter_b":"That part about Kansas is not true. Our state is so far in the hole and we do not have the \"workers\" with that income. It was a pipe dream. The state just passed the largest tax increase in history because of the lack of income. Our budget fell short ever since this governor installed is plans.","commenter_a":"Once again @username when you source things from right wing rags, you lose credibility. Most won't even read it and those who do already support you. It's concerning that these are the only sources you can reference...","post_message":"Welfare Reform & Wisconsin: Walker Is Leading the Way | National Review @webpagelink"},{"comment_id":"701393549998426","commenter_b":"Get them out of US STOP PC they do not deserve to speak in N TV , no Christian or Jewish leaders were invited to speak to reporters. Muslim Imam just said it in Press conference (is like we did it n so what) is just mass shooting Hello THIS IS TERRORIS AT ITS BEST ISIS STILE, wait our Muslim President blame gun control","commenter_a":"IF he really wants to stop shootings he should go to Iraq or Afghanistan .where shootings hangings, stoning, acid baths, beheadings, gas weapons, all take place on the regular. WE have been saying this is going to be a problem here. we already have too many whack a do 's to deal with, and letting people who have an intense hate for a certain segment of our society in to this country with NO understanding of our population and LAWS other than it picks up the tab, is a recipe for this very thing. But IS NOT a good enough reason to give up my gun rights. I will just cling to my weapon and bible thank you very much. gay people everywhere should understand this now, weather it's a gun or a bomb, you are on their hit list.","post_message":"Speechless."},{"comment_id":"10154468186761051","commenter_b":"She should never be allowed in another classroom!","commenter_a":"GOOD!","post_message":"This teacher was given the boot after video of what she did to Donald Trump went viral."}]
