[{"comment_id":"1030591920403417","commenter_b":"Sorry, obama was a bad idea, and hillary was worse.","commenter_a":"Of course it's not. We knew what he was going to be, but his voters were too stupid to listen. They refused to heed either his own goddamn words, or the words of anyone else saying \"THIS IS A BAD IDEA.\"","post_message":"Trump is assembling the wealthiest cabinet in history — so wealthy that its members have more money than the bottom 1/3 of American households combined. That does not sound like an \"anti-establishment\" administration to me."},{"comment_id":"10153600578582042","commenter_b":"😂😂😂😂","commenter_a":"Then you need a toupee cause your hair Is hideous","post_message":"\"I don't wear a toupee. It's my hair, I swear,\" Donald J. Trump said."},{"comment_id":"945163755529692","commenter_b":"The teacher needs the bag a brown bad cause she butt. Ugly","commenter_a":"What the hell","post_message":"An after-school elementary teacher is accused of putting a plastic grocery bag over a child’s head until he could no longer breathe: @webpagelink"},{"comment_id":"2004741493095269","commenter_b":"Because he does suck dick","commenter_a":"Why does he always look like he is about to suck a small dick?","post_message":"What an idiot."},{"comment_id":"10153404410236130","commenter_b":"@username All things you listed other than pot are legal. Yet why is it that while people...especially GOPers LOVE to scream bloody murder and point their fingers at those threatening to take away their guns and insist they not be persecuted the same way women who have abortions, gay men and women and birth control is seen as the devils idea. Guns kill people, The LGBT community hurts no one...all we want are equal rights and legal marriage, abortion in most cases saves unwanted children from being abused or just dumped in the trash and the GOP Congress has been trying to withhold food, shelter and a chance at a normal life from those born to poor unwed women. Where are those men and women when they see poor unnourished children who most likely are not wanted some being abused some being killed and some just starving to death. Instead ...","commenter_a":"To all those saying we have no gun problem - please review our statistics on mass shootings. We have more than the next few countries combined. And to those saying gun restrictions would not help because criminals would still get guns anyway: if you limit something at its source, if there are less guns being sold, period, statistically all criminals would have a much tougher time getting a gun. People with a history of physical violence and mental illness SHOULD NOT have access to guns, and today most can simply walk into a store and buy one as easily as anyone else - anyone who argues with these facts is part of the problem.","post_message":"What is standing in the way of meaningful gun reform?"},{"comment_id":"492044497655936","commenter_b":"Is she for real? Did someone really vote her stupid ass into office?","commenter_a":"Elizabeth Warren is a Douchebag","post_message":"If Democrats REALLY believed Trump's speech was ineffective, they'd want him to give MORE speeches like that, not fewer."},{"comment_id":"10153216177713984","commenter_b":"I have 3 sons--never once did I pack their lunch---for a reason---I wanted them to experience other foods and if they got hungry they would eat what was in front of them---My guys are not picky eaters and like most everything--mission accomplished.","commenter_a":"So people don't want their kids to eat healthy OK LOL!!","post_message":"This unhappy 2nd grader just served up a giant helping of truth about Michelle's school lunch agenda. I bet she had a tough time swallowing this one.  Do you support this kid for confronting Michelle Obama?"}]
