[{"comment_id":"10154999014692891","commenter_b":"Wow you are stupid @Cynthia Madison. It was a child!! Sorry he wasn't White!","commenter_a":"For walking in his lawn I'm going to have my dog💩law","post_message":"Protesters in Anaheim are blocking streets to demonstrate against an off-duty LAPD officer's confrontation with a teen in which he fired his gun. @webpagelink"},{"comment_id":"512585862199466","commenter_b":"Anyone who does homework works for his or her education.","commenter_a":"The man","post_message":"Thank you to everyone who has donated to my campaign- we have raised $51,000,000.00 in the month of June-- thanks to you! Lets MAKE AMERICA SAFE AND GREAT AGAIN! You can make secure donations here: @webpagelink"},{"comment_id":"1009683892433898","commenter_b":"ILLEGAL ALIENS should be deported not given drivers licenses and free housing and medical care.","commenter_a":"Why don't you add the rest of the story. Not only did 50% of all California driver's licenses go to illegal aliens, but they have motor voter laws so those illegals are now eligible to vote even though they are not citizens. Non-citizen should NEVER be allowed to vote and neither should welfare recipients who have been on welfare for more than two years. They should not be allowed to vote on how the money from tax payers is spent when they are not paying taxes themselves.","post_message":"Did you know HALF of all California driver’s licenses issued in 2015 went to illegal aliens?"},{"comment_id":"1297459886999211","commenter_b":"People, people, people, ain't nothing going to happen to this horrible, discussing bitch 🇨🇱","commenter_a":"Nasty woman.","post_message":"It's called \"Orgy Island,\" and there was already evidence linking Bill Clinton to it. Now, though, the FBI just dropped a bombshell involving Hillary Clinton and the sick island... and what agents are saying could turn the entire election in a VERY ugly way."},{"comment_id":"10153610090283598","commenter_b":"But everything is wrong with killing someone to gain at their expense!","commenter_a":"Wow. So you can't be \"successful\" without birth control? Women can't be successful if they become mothers? Women can't be successful unless they're childless? This modern feminist movement is ridiculous. It tells women they can't have a life if they have kids. True feminism teaches that women can do anything they set their minds to because they are strong and capable. And another thing, Miss Lawerence. You have access to condoms and birth control through many other outlets that do not kill innocent children for profit. It is delusional to believe otherwise.","post_message":"Hunger Games Actress Jennifer Lawrence: Thanks to Planned Parenthood I’m a Successful Woman"},{"comment_id":"10152731683061234","commenter_b":"Hey Mary... Go suck some cock","commenter_a":"yes, we the teachers, fire fighters, and police tried to tell you all! He is a liar and a crook and a bully","post_message":"Gov. Christie is probably hoping his 2016 presidential aspirations don't hinge on New Jersey voters. That's because a new Rutgers-Eagleton poll shows most Garden State voters believe he's a poor fit for the Oval Office."},{"comment_id":"1153775948001804","commenter_b":"She's still a turd.","commenter_a":"Nancy, your a turd!","post_message":"“Lady Justice has on a blindfold because all victims and all defendants are to be treated equally under the law,\" says Nancy Grace."}]
