[{"comment_id":"456493334475707","commenter_b":"Fuck u bitch and that pedophile country PISSRAEL","commenter_a":"PISSRAEL","post_message":"In the following report, we’ve replaced references to Israel with the Islamic State of Iraq and Syria (ISIS) to make a point about how differently they are treated by the media and politicians."},{"comment_id":"903161916494805","commenter_b":"@username because of disparate impact and disparate action. White people can get up out of bed, run a comb/brush through their hair and be out the door in five minutes. Blacks cannot do that so much, unless their hair is cut to their head--shaved. The rules negatively impact Blacks because without those styles, there isn't much left without using relaxers or paying for extensions. When rules or laws are placed for everyone as is here, but negatively impact one racial, religious, gender group, then it's discrimination and needs to be stopped.","commenter_a":"Can I ask an honest question? In that school, is there a ban on long slick hair, mullets or any other \"white hairstyles\". If so then I can actually understand the ban. But if there is no ban on \"white hairstyles\" like long slick hair, but there is a ban on \"black hairstyles,\" then yeah, i agree, it is discriminatory.","post_message":"This school just banned traditionally black hairstyles  and people are outraged.  #MicBrights"},{"comment_id":"10153317149514087","commenter_b":"@username Ok I demand that and also anyone who rents to an illegal be punitively fined. Good enough? Oh yeah and build that wall and shovel the illegal bastards out of the country. Ok Tommy-boy?","commenter_a":"No the majority of Americans do not want to keep the illegal bastards, but they do want immigration reform- it's called a wall! To hell with Sanders vote Trump!","post_message":"“We cannot and must not sweep up millions of men, women and children, many of whom have been here for years, and throw them out of this country,” Bernie Sanders said Monday. “As president, passing a legislative solution to our broken immigration system will be a top priority. But, let me be clear—I will not wait around for Congress to act.”"},{"comment_id":"10153237283580329","commenter_b":"Kurt Russell","commenter_a":"Jared padalecki from supernaturals","post_message":"Keanu Reeves or Arnold Schwarzenegger?"},{"comment_id":"479299448927302","commenter_b":"Americans mandate Islamic Terrorists be assasinated","commenter_a":"Fuck them shot them in that red dot in there head...","post_message":"New Texas curriculum tells students to refer to Islamic terrorists as 'freedom fighters'.  Spread the truth, let's put an end to this.  'LIKE' if referring to terrorists as 'freedom fighters' is WRONG!"},{"comment_id":"968962986483662","commenter_b":"Exactly @username. @username, has already contradicted herself more than once. She is all over the place. That's one weird Troll.","commenter_a":"Barack Obama has done more damage to the USA then all past presidents put together...............He lies continually, he is anti-police, pro-thug, anti-life for gay marriage..... he says he is Christian but his fruits of his works are anti-Christ.....he sides with Islamic terrorists....goes against are biggest ally the Jewish Nation and has done everything he can to bring racial division to this once great nation. Treason is an understatement!!! Why don the Senate evoke the NUCLEAR option so to force our Divider and Chief veto all of the bills coming out of the Senate??? We the people should elect a person who will obey our Constitution and has faith in God, and a person who truly cares for the people and our Veteran!","post_message":"In 5 days, Congress will have to send \"must pass\" legislation to President Obama's desk to fund the government.  Sign your emergency fax petition urging them not to send a single penny of taxpayer dollars for abortion or abortion providers! Click here! @webpagelink"},{"comment_id":"10153424908946094","commenter_b":"I wonder if the folks at Apple are thinking \"PLEASE Mr. Snowden, don't support us!\".","commenter_a":"Citing an 18th century law concerning iPhones?!","post_message":"A major debate over privacy and online encryption has erupted after the computer giant Apple announced it will resist a court order to help the FBI break into an iPhone recovered from one of the San Bernardino shooters."}]
