[{"comment_id":"597841083739804","commenter_b":"OBAMA IS THE SAME ALL ARE THE SAME CORRUPTS AND CRIMINALS WHAT HAPPEN IS PEOPLE WANT'S TO BE CORRUPTS AND HAVE POWER AND ABUSE OF POWER THAT IS WHY THEY LIKE THEM CONGRATULATION LOOK AT THE WORLD HOW IT LOOKS AND THINK A LITLE NOT TO MUCH AND SEE WHAT IS GOING ON","commenter_a":"Damn right!","post_message":"George W. Bush was right, there were weapons of mass destruction.  We always had his back. He is a great man, and a true patriot.  Do you support George W. Bush?"},{"comment_id":"10152666104531028","commenter_b":"Time for a layoff","commenter_a":"New Orleans!","post_message":"No tickets for having an open container of alcohol, no tickets for public urination, no tickets for double parking, no tickets for costumed characters hassling tourists to take their picture.   It's perhaps the most jarring example of a slowdown in low-level enforcement across NYC amid tension between rank-and-file police and the city's mayor.  @webpagelink"},{"comment_id":"10153721547731378","commenter_b":"Says a skinny woman","commenter_a":"Life is short. Eat the cake.","post_message":"Are \"Cheat Days\" helpful or harmful to your diet? Some say giving into cravings can decrease your appetite. What do you think?"},{"comment_id":"481694655288924","commenter_b":"This lady is an idiot.","commenter_a":"Her eyes bulge out because her head is so full of bullshit it's about to explode!","post_message":"Isn't that just rich...The only time rich Hollywood liberals pretend to care about the Bible is when they think they can twist and contort it to make some asinine political point to appeal to those Bible thumpin' dumbo Christians in \"fly over\" country.  #NiceTry #ElitistLiberals"},{"comment_id":"1025040644216607","commenter_b":"@username , I think there is, but would have to look it up. Basically the way it would work though is if impeachment is not possible, a no confidence vote by congress could in effect say we no longer recognize this Presidents authority. Members of congress can be sanctioned, why not the POTUS?","commenter_a":"What we need is Nation wide non-compliance with, or recognition of authority, or any further orders coming out of the White House. Personally I think a no confidence vote is in order. Write your Congress and demand the sanctioning of the President until the end of his term, for gross executive over reach and abuse of power.","post_message":"The president continues to show his disregard for millions of Americans with his 'Bathroom Order,' never bothering to consult with parents. Instead, he decided to issue an order threatening the loss of funding and lawsuits from the government to schools that don't comply."},{"comment_id":"10158074030495206","commenter_b":"Take the appearance fee and go home","commenter_a":"Has she claimed racism yet?","post_message":"JUST IN:"},{"comment_id":"10154075647091770","commenter_b":"You are totally right, Tucker.","commenter_a":"We turned to Hollywood to be entertained...NOT FOR POLITICAL COMMENTARY OR OP-ED! It really is that simple.","post_message":"Tucker Carlson has a message for Hollywood liberals"}]
