[{"comment_id":"10153219716141336","commenter_b":"Geraldo is out there looking for trouble. He does not belong there.","commenter_a":"Sick of All of this!","post_message":"Geraldo Rivera reacts to the current atmosphere in Baltimore as police make arrests: \"The cops are swarming over the demonstrators that have defied the curfew.\"  Tune in to 'Hannity' for continuing LIVE coverage."},{"comment_id":"764904010309446","commenter_b":"RBG.. ALL DAY NOW","commenter_a":"When it's American soil , it'll be be armed patriots push back Muslim insurgents ,,, the main steam news will not say so ,, but we the people will !","post_message":"Coming to America soon compliments of Barack Obama."},{"comment_id":"1778254899059301","commenter_b":"Someone take care of Bernie so Lizzi shuts her piehole, please.","commenter_a":"Lester Holt seems to be giving Hillary longer time to speak than Donald!!","post_message":"TheDC presents the first debate between Hillary Clinton and Donald Trump. Starting at 9:00PM ET."},{"comment_id":"10156338941645615","commenter_b":"Yup let's get busy creating more terrorists.","commenter_a":"Jesus. Blind, and deaf to his own words.","post_message":"Do you hear yourself talking, Rick?"},{"comment_id":"10153743132780950","commenter_b":"Fuck you Bitch!!!","commenter_a":"The entire staff cheats on that team !!! Even Bellicheck...fuck the entire Patriots organization!!!!","post_message":"New England Patriots quarterback announces latest move in wake of court rejecting appeal."},{"comment_id":"1745739655705616","commenter_b":"The university should be pledging NOTHING for illegals! They are criminals. The university should be prosecuted for aiding and abetting crime!","commenter_a":"If anything, this should all be used for American students. They should be the first to receive help not illegals. This is wrong.","post_message":"University of California students criticised a university pledge of $25 million over 3 years to assisting illegal immigrant students as “not enough.”"},{"comment_id":"10156346724510725","commenter_b":"YOU ARE THE ANTI-CHRIST!!! SHAAAAAA lucifer!!!","commenter_a":"Thank you.","post_message":"THANK YOU for your support this evening Myrtle Beach, South Carolina! My family and I had a fabulous time with you this evening. Together we will #MakeAmericaGreatAgain!"}]
