[{"comment_id":"10152591837062061","commenter_b":"I like this","commenter_a":"For real!!","post_message":"Now that's wearable technology! China apprehends man trying to smuggle in 94 iPhones. abcn.ws/1waWmjv"},{"comment_id":"1038359476176309","commenter_b":"Hope they catch her she is a predator","commenter_a":"Where Racist Al Sharpton? If he is against HATE crimes then why wouldn't he and his Racist organization make a big outcry about this hate crime. Oh! I must be dreaming......... For a racist pig like Al and his followers to make a peep to the news media about such a HATE crime, it would have to be a white on black crime with white police men cheering on the beating.","post_message":"Life in Obama's America  Disturbing video of a white woman (holding her baby) being attacked by blacks, as blacks film and laugh at the attack."},{"comment_id":"1174388402587813","commenter_b":"Liars!!!!","commenter_a":"Democrats are for war on women, which is not really a war, except in their feeble minds...","post_message":"When the two Bills—Cosby and Clinton—were accused of sexual abuse, the two wives—Camille and Hillary—led the effort to blame the victims."},{"comment_id":"1189675974461986","commenter_b":"@username she will not loose","commenter_a":"The real problem is Bernie Sanders is NOT a democrat! No wonder he and democrats are having a problem. He should have run on his own party-- as the socialist he is.","post_message":"It's not just the Republican Party that seems to be having a problem uniting..."},{"comment_id":"1136992022978933","commenter_b":"Every Bill which shall have passed the House of Representatives and the Senate, shall, before it become a Law, be presented to the President of the United States; If he approve he shall sign it, but if not he shall return it, with his Objections to that House in which it shall have originated, who shall enter the Objections at large on their Journal, and proceed to reconsider it. If after such Reconsideration two thirds of that House shall agree to pass the Bill, it shall be sent, together with the Objections, to the other House, by which it shall likewise be reconsidered, and if approved by two thirds of that House, it shall become a Law. But in all such Cases the Votes of both Houses shall be determined by yeas and Nays, and the Names of the Persons voting for and against the Bill shall be entered on ...","commenter_a":"It'll fail in the Senate, and if not Obama will veto it","post_message":"Even Democrats voted for a 'pause' on the Syrian refugee program."},{"comment_id":"1717265371820481","commenter_b":"Calling for a border restored and a return to LEGAL immigration IS NOT RACIST. We will not give our country to you - but you may join our country if you ask! VOTE TRUMP!","commenter_a":"Go trump","post_message":"BREAKING: Anti-Trump protesters rally at Columbus Circle and are heading to Trump Tower. Are you there? @webpagelink"},{"comment_id":"10154248174893734","commenter_b":"build the wall with trump under it","commenter_a":"TRUMP 2016..","post_message":"Do you agree or disagree with Donald Trump's speech at the Rolling Thunder motorcycle rally today?"}]
