[{"comment_id":"1065968390113738","commenter_b":"William Tryon WOW...totally makes sense NOW, 10 Celebs Moving that Already Own homes in Other Countries, In Exchange FOR LUNATIC Trump Promising TO Send OUR KIDS to WAR...Excellent Logic!!! NOT!!! Our Country is Not A Business For Trump To Practice HIS Failures ON--IT'S OUR COUNTRY!!! MoonStruck \"SLAP\" Snap Out Of IT!!!! Trump has Infected Our Country With IGNORANCE The Worst EPIDEMIC! Trump Rising! DID the Hiel Hitler Salute On National TV for the World TO SEE..Disgusting!! VOTED For TRUMP & Got KIM JONG UN & Porn Star.... WWIII-- DO WE Want ALL Our Kids To Get Drafted Into A Greed WAR for Trump!! THE Epidemic in Our Country by OUR OWN Citizens Addiction TO Porn, Drugs & Human Trafficking is a Major Problem IT Comes By Boats, Planes, Trains & Automobiles CUT the Consumption Solve The Problem that Huge Problem. MEDIA Has Attached ITSELF TO Trump's BOOB because MASSIVE Orange ...","commenter_a":"Another reason not to vote for Ted Cruz. #Trump2016","post_message":"“The only guy who can beat [Donald J. Trump] is Ted Cruz.”   Breaking News: Carly Fiorina has endorsed Ted Cruz for president."},{"comment_id":"10153666146819099","commenter_b":"Shut up you dumb broad","commenter_a":"Get guns off the street. It's time for stricter gun laws.","post_message":"A 30-year-old wanted criminal with 12 prior incarcerations allegedly shot a 33-year-old NYPD officer in the head in East Harlem, authorities say  ----> @webpagelink"},{"comment_id":"10154364197411336","commenter_b":"Lady you are unbelievable","commenter_a":"Chris Kyle: American Liar","post_message":"A federal appeals court has thrown out a $1.8 million judgment awarded to Jesse Ventura, who says he was defamed in Navy SEAL Chris Kyle's book \"American Sniper.\""},{"comment_id":"1758501704379005","commenter_b":"That cow can't just shut up can't wait till she moves to Canada","commenter_a":"yes she is","post_message":"Whoopi Goldberg Insults TV Host For Being White, See What Happens Next. She is the biggest hypocrite. What a bigot. Do you think Whoopi is a racist?"},{"comment_id":"10153828669523984","commenter_b":"So tell me what religion does rule the world ! Plus most of you are SCARED because you have either been the bully or profited from the bullying of other countries ! Just admit that you don't know how get your power back ! It seems to me that 9/11 made our county a rape victim and you see the rapist in every Muslim ! But we've used the same tactics! Oh , you didn't mind sending missionaries over there to convert them , but we don't want them here, even the ones that became Christians ! We reap what we sowed and you still don't see it or get it ! You can't kill them off . We tried that already ! Change how we deal with them for starters. Or we can squat to their level and try again ! But if you yourself are not going to ...","commenter_a":"I think this is a good example of why not to allow sharia law in the United States. We have our own laws that need to be enforced. When you come here that's the laws you follow. Muslims don't rule the world. Time to set them straight","post_message":"These Muslims were going around burning churches, but they were in for a RUDE awakening when they showed up at this one...  Concerns about Sharia being implemented in the United States have been escalating, do you think we could see this spread to the U.S.?"},{"comment_id":"10152584446122014","commenter_b":"No money for illegals!","commenter_a":"He's not an immigrant. He's a POS rock-throwing illegal alien coyote that's had 14 prior incidents with the border patrol.","post_message":"The judge ruled that the officer was not justified in opening fire on the immigrant who was crossing illegally into Arizona."},{"comment_id":"1769093619989896","commenter_b":"Send them all back across the border, they'll never get away with this crap in Mexico, they'll shot them there","commenter_a":"\"America was never great.\" Then why the fuck are you here?","post_message":"Blood flows in San Jose, California as Mexican flag-waving anti-Trump radicals attack Trump supporters, rip up American flag, chant \"Mexican Power!\"...\"America was NEVER great!\" PHOTOS...VIDEO..."}]
