[{"comment_id":"1116556865104033","commenter_b":"ignorant bitch, we are ALL immigrants!!!! VOTE HER OUT & VOTE STRAIGHT BLUE, FEEL THE BERN!!!!!!!!!!!","commenter_a":"When is the last time the republicans filled a bill about anything that would benefit the American people? These fools are of limited intelligence to be sure. Please people vote Blue every chance you get.","post_message":"Republicans are now setting their sights on our librarians."},{"comment_id":"471937499632872","commenter_b":"Give it up lady. Your lies won't work with me.","commenter_a":"He's what a president should be and it's a shame the next won't try half as hard as he did.","post_message":"\"When they describe their youth and their childhood, these are young people who made mistakes that aren't that different from the mistakes I made.\""},{"comment_id":"657334997759787","commenter_b":"The key is this. Why was he walking away from the officer with his hands up? Then going for the door of his vehicle. Also they dispatched a helicopter to the scene well prior to the shooting. There is way more than the media is showing.","commenter_a":"Cop should get the chair for this shit","post_message":"In a video, an unarmed man is seen walking with his hands up. Moments later, a police officer shoots him."},{"comment_id":"10153544562557411","commenter_b":"Maybe if he didnt talk back, laugh and pull away, they would have let it go!!","commenter_a":"How can u steal FREE milk?? Lol smh....","post_message":"\"This is ridiculous... this is beyond embarrassing... he's at home for 65 cents.\""},{"comment_id":"10154784936184614","commenter_b":"We keep building houses, taking away the land near the hills. where else are these animals supposed to go? if you want to live out there, keep your little ones inside. the animals were there first.","commenter_a":"Lol i guess those dogs was watching to much YouTube where people had their dogs chasing away mountain lions and big cats thinking they was really scared of a dog lol guess again.","post_message":"\"This video is heart wrenching,\" says a Rancho Cucamonga animal-lover whose security cameras captured his dog being dragged to its death by a coyote.   Oliver, a 9-year-old dachshund, was chasing the intruder coyote away from his sister dog when the wild animal grabbed him.  \"Even a 7- foot wall won't keep your pets safe,\" the homeowner warns.  Read KTLA's story here: @webpagelink"},{"comment_id":"10154469641506051","commenter_b":"Absolutely not. She's a damn joke too.","commenter_a":"I will never claim Trump as my president. What a damn joke!","post_message":"If this goes the way some expect it to, Donald Trump could very well be impeached."},{"comment_id":"10153123153839094","commenter_b":"Behind what.....the Jettsons?","commenter_a":"We are only behind because the city deferred maintenance and closed one of the terminals to make flyers more crowded and make the airport look awful.","post_message":"Kansas City should focus on planning for a single new terminal at Kansas City International Airport, airlines and the city’s aviation department said today."}]
