[{"comment_id":"611841178976490","commenter_b":"Ha.....snake in the grass. Call her out.","commenter_a":"send Hillary to live with the Arabs.","post_message":"FUNDING TERRORISM --- AND THE CLINTONS."},{"comment_id":"10154086020097024","commenter_b":"Build that wall","commenter_a":"Prosecute every elected official in every sanctuary city as being complicit in evey crime committed by illegal aliens.","post_message":"Happening Now: Judge Jeanine Pirro delivers remarks at #CPAC2017."},{"comment_id":"1016134701742911","commenter_b":"@username OK as soon as I take mine out of a white woman's mouth","commenter_a":"I not very religious, but I stand with them. Obama will have you believe this country was found on Islam. I'm a proud American that enjoys the mention of God on my money, the pledge and so forth.","post_message":""},{"comment_id":"922540534474731","commenter_b":"DO IT! I am afraid that he will fire them all and replace them with illegals and give them citizenship.","commenter_a":"I'll support police officers","post_message":"Cops Threatening To Turn Their Backs On Obama At Annual Police Memorial Friday  @webpagelink"},{"comment_id":"10154716215431800","commenter_b":"Better? Human Rights just went out the door the moment Trump was elected, something that America has practiced for decades and what the world envied us the most....Hypocrisy much?","commenter_a":"oh yeah, I heard President Duterte say Trump was just like him. Changing the world...but is it for the better?","post_message":"Donald Trump, fresh off Hair Force One, meets President Obama at the White House."},{"comment_id":"10154130033413797","commenter_b":"so she should keep her legs together","commenter_a":"you have a brain tumor and you are suing bc you want your tubes. out.. are you sure you are just not brain dead?","post_message":"A woman suffering from a brain tumor is threatening legal action against a Catholic health system because the hospital is allegedly refusing to tie her fallopian tubes based on religious belief. The procedure could be life saving for the woman..."},{"comment_id":"10154689857838487","commenter_b":"What a complete idiot","commenter_a":"He gave his brain away, didn't he. That's got to be the reason. He was selfless and gave his brain away.","post_message":"Carson accused Kay of making him  bad guy, and asked Joe Scarborough, the show's host, to  her microphone off so I can talk."}]
