[{"comment_id":"10154741316933812","commenter_b":"Hillary will be president","commenter_a":"Remember when Hillary Clinton said the 50,000 emails she kept from the State Department (in violation of the Federal Records Act) were about yoga and her daughter's wedding? How many of the most recent set of 14,900 emails ordered made public by a federal court are about yoga or her daughter's wedding? I'm thinking zero. But hey: pertinent falsehoods under oath aren't criminal when you're aspiring to become the First Woman President (TM).","post_message":"Meet Meatball: The adorable, friendly and rotund pit bull mix that can't help but flash his brightest smile as soon as he sees a camera. \"As soon as the camera turns on he just gets this huge grin on his face.\""},{"comment_id":"10153371305674575","commenter_b":"Strip the Super Bowl, the ring, one year suspension (if not more) and mega fines","commenter_a":"He makes millions of dollars you think four games is really going to teach him a lesson? Dude strip the superbowl from them. Didn't you learn that a slap on the hand solves nothing!","post_message":"#BREAKING: Tom Brady has been suspended for the first four games of the season for his role in #Deflategate. Among other punishments, the Patriots were fined $1 million.  Brady will return from his suspension the week the Indianapolis Colts take on the Patriots at Lucas Oil Stadium."},{"comment_id":"10153442882309087","commenter_b":"@username No Edna is the one with the brains, you however should go get and education and then come back to the table. Nevermind don't bring that stupidity back, you may let the men in your family rule your body but they definitely will not rule mine. Whether you like it or not abortion is legal in this country ..... why would any self respecting woman let any GOP teabagger try and rule their bodies....,.I just don't get it and never will. If you won't vote for the women in your lives I certainly will !!","commenter_a":"Obama is ISIS! That's why he didn't cry before!","post_message":"“I was affected by [President Obama crying during Monday's gun control speech] but I thought we should’ve had the same kind of reaction when James Foley was beheaded, when San Bernardino and Paris occurred,\" Speaker Paul Ryan said. \"That’s the kind of reaction I had when those occurred.”"},{"comment_id":"177307306103129","commenter_b":"Wrong! Never said in his first 30 days","commenter_a":"Didn't he defeat ISIS already? He said he would in his first 30 days.","post_message":"Join us as President Donald J. Trump delivers the Weekly Address."},{"comment_id":"970547099705011","commenter_b":"Senior women for Democrat.","commenter_a":"All I know is that seniors tend to vote for republicans. Go ahead, drug test them. Before you knew it, you don't have their votes anymore.","post_message":"He's the one that should be drug tested."},{"comment_id":"1395591783831296","commenter_b":"If you are depressed, how do you think I am living at 30 minutes away from Russia? This thing sounds real to me because I see what's happening around Russia. If American people don't do nothing to stop the US government, my country and other countries around Russia will be erased before you people even realize that the war is started. Russians have nukes, we have sticks. My country doesn't have an army, half of Russian citizens are soldiers. So while America is still thinking if the news is real or fake, we think why our governments made an alliance with USA and allowed them to build anti-rocket shields and military bases on our territory, making us look like a threat to the Russians when we are not. Here we hate wars and guns. People here don't have guns, we don't go to wars. We don't want this s***. But ...","commenter_a":"always liked the mind unleashed but u get a ton of ppl on here saying u r blowing things out of proportion.. i for one as a parent dont appreciate being scared shitless.. surely u r just feeding the monsters propaganda?.. (the same fear that made ppl think they had to turn to the likes of trump!?..) yep in a ideal world the scum/politicians of the world would do whats best for everyone not just theyr own greedy vile selves but that aint gonna happen with any of the muppets in power right now.. dont u think the world is scarey enough already when someTHING like trump can get into such an important position of power!?? a pathetic joke of a man nobody in a rational mind would ever dream of looking up to! (minus the fear that is).. if this is just sensationalist headlining then give it a rest! ...","post_message":"Time to start paying attention."},{"comment_id":"10154485481559641","commenter_b":"What @username said ,is d same as oral sex...@ @username,gay pple does disgusting things as such too","commenter_a":"ORAL FECES SEX ..The Insanity, of those who participate in the ingesting of feces want acceptance for this \"NASTY\" diseased behaviors. Why because it makes for sickness, spreads a few disease`s to other humans that are deadly and dangerous disease`s. Calling the practice of ingesting feces \"normal and natural\". Tainted Blood, Fecal Infections and Perverted. Science tells us humans not to injest one anothers feces. The spread of disease is everyones business. Equality or Insanity.","post_message":"\"This will be the 22nd marriage equality bill in Australia and we still haven't got (LGBT) marriage ... what are we doing wrong here?\""}]
