[{"comment_id":"10155268022544411","commenter_b":"What a stupid bitch","commenter_a":"China honestly USA and South Korea will do for their security what they will - your threats are useless because guess what your citizens have had exposure to west and they will fight against you to keep their freedoms- your on the downward spiral of communism!!","post_message":"Beijing 'will definitely take necessary measures to safeguard its security interests'"},{"comment_id":"10153668595164099","commenter_b":"This woman again? The Nurse who doesn't care if she infects everyone else? Go away! Your 15 minutes are over.","commenter_a":"Why are there so many greedy people in health care.","post_message":" never had Ebola. I never had symptoms of Ebola. I tested negative for Ebola the first night I stayed in New Jersey governor Chris Christie private prison, Kaci Hickox, 34, said. -----> @webpagelink"},{"comment_id":"1589692694655762","commenter_b":"Nothing racist about, I have the same problem. Some do not understand us and takes forever","commenter_a":"How can you criticize this? Who actually likes calling those?","post_message":"\"So I called up, under the guise I’m checking on my card. I say, 'Where are you from?' They say, 'We are from India.' Oh, great. That's wonderful. Thank you very much,\" Donald J. Trump said, signaling as if hanging up a phone."},{"comment_id":"10154689577603812","commenter_b":"He also has many lawsuits in the 80's and 90's for discrimination against blacks and people of color.","commenter_a":"TRUMP STOOD UP FOR BLACKS AND JEWS: About 20 years ago the rich elites ran Palm Beach and wouldn allow Jews and blacks to use the golf and country club facilities. When he bought Mar-a-lago, MR. TRUMP WENT TO COURT TO END THAT DISCRIMINATION, won in court and forever changed how minorities are treated in Palm Beach. That THE REAL Donald Trump. What has Hillary or ANY politician done? @webpagelink","post_message":"A potentially record-breaking gap between two groups marks one of the most striking elements of preferences in the 2016 presidential race: college-educated white women for Hillary Clinton vs. non-college white men for Donald J. Trump."},{"comment_id":"1004502652963001","commenter_b":"Better hope Hillary don't get to be President. This country will be a goner in 4 yrs. if she does.","commenter_a":"Oh, so Democrats are crossing over to vote for Trump. I see your game plan Dems. After Nov. gets here and if Trump is the nominee you all will turn around and vote Democrat.","post_message":"#FloridaPrimary"},{"comment_id":"959675597399526","commenter_b":"Hillary 2016 Hillary 2020","commenter_a":"Hillary!","post_message":"It sounds like voters have already decided who they are going to vote for in the presidential election. Have you?"},{"comment_id":"1275887962432212","commenter_b":"So people can get to sleep !!","commenter_a":"Seth","post_message":""}]
