[{"comment_id":"245227072596737","commenter_b":"She's a freaking retard!","commenter_a":"One thing he is not insecure, but you are Nancy","post_message":"\"I feel sorry for you. You're the president of the US and you're so insecure...I pray for your Mr. President. And more importantly, I pray for the United States of America.\"  Do you think Trump is insecure?"},{"comment_id":"10153676322456509","commenter_b":"Says the girl with gigantic tits and a gun in one of her photos...","commenter_a":"THUGS","post_message":"Dozens of motorcycle rallies will take place nationwide this weekend amid sky-high tensions after a biker gang shootout left nine people dead in Texas. @webpagelink"},{"comment_id":"549880968533529","commenter_b":"The ones who say they are refugees are young muslim men . I never see women or children in the pictures. This is what obummer wants to bring to America.","commenter_a":"It's funny how you people think all Muslims are bad, but I never heard you talk about all the Muslims in California who raised over 200k dollars for the victims of the San Bernardino shooting. Or what about the Muslims in Africa who protected Christians from getting shot on a bus.","post_message":"This makes me SICK!!!"},{"comment_id":"10157784004785206","commenter_b":"Those poor girls should be removed from her household. Smh.","commenter_a":"SHe WIggity Wack!","post_message":"Nina Peterson has made over $1 million being a companion to older rich men, but she insists she’s not a prostitute."},{"comment_id":"10154203076004087","commenter_b":"Of course Axelrod.... in the mean time we have to keep a corrupted woman out of the WH by massively voting for another candidate... Just get back in the swamp and be happy Axelrod Traitor !","commenter_a":"It has been revealed that part of the Clinton strategy is to incessantly blare from any and all platforms that it's game over, Hillary already won, Trump can't win, etc. Of course the reality is that Hillary can't fill high school gyms with supporters while Trump fills arenas. So, only a few more days till we know if votes still count or if we live in a rigged system controlled by some shadow government and foreign interests.","post_message":"\"I don't know any consultant on either side, any strategist, who privately believes that Donald Trump is going to win this election,\" Obama campaign strategist David Axelrod said."},{"comment_id":"1013523678688104","commenter_b":"Stupid bitch !!","commenter_a":"Shameful","post_message":"Comedian Ricky Gervais was so appalled by the image of Rebecca Francis grinning next to the freshly-killed giraffe that he tweeted it to his 7.52 million twitter followers, and almost broke the internet."},{"comment_id":"10153352835244384","commenter_b":"I love Nancy Pelosi. Her farts smell like broccoli.","commenter_a":"I love Nancy Pelosi, she is a superb role model, and tireless worker for all Americans!","post_message":"Today, under the leadership of Congresswoman Rosa DeLauro, House Democrats are again taking the lead in addressing one of the most pressing economic challenges confronting our country by re-introducing the Paycheck Fairness Act. Securing a fair shot for women in the workplace is critical to ensuring prosperity for our nation. Rather than continue their cycle of obstruction and dysfunction, House Republicans should join with us to close the gender wage gap so we can provide bigger paychecks and better infrastructure for all Americans. @webpagelink"}]
