[{"comment_id":"10153290694163279","commenter_b":"Shut up.","commenter_a":"@webpagelink David W. Blight described the day: This was the first Memorial Day. African Americans invented Memorial Day in Charleston, South Carolina. What you have there is black Americans recently freed from slavery announcing to the world with their flowers, their feet, and their songs what the war had been about. What they basically were creating was the Independence Day of a Second American Revolution.","post_message":"As part of our Memorial Day special, watch this speech by former Rep. Pat Schroeder recorded at the conference, \"Vietnam: The Power of Protest.\""},{"comment_id":"1345056415554103","commenter_b":"Parents fault? No, it was the sick pervert who raped her fault!!","commenter_a":"What the hell is a 13 year old child doing on a beach at 02 in the morning Even if her brother was with her The child should have been at her home in bed How could her brother let her out of site I just hope they will be able to catch the guy And made him pay for what he did to this young girl","post_message":"She lost her brother before she was attacked."},{"comment_id":"10154220387809312","commenter_b":"The girl should have been dealt with a lot sooner than 2 years!!","commenter_a":"They should have all bought headphones and blasted The Bible on tape.","post_message":"When the noise first became an issue about two years ago, Saylor said she would knock on the door and ask her neighbor to quiet down. It didn't help."},{"comment_id":"10155022606302501","commenter_b":"Why. Dont. U. Suck. His. Cock. Bitch.","commenter_a":"Donald Trump is a psycho and a nut has no business running for president","post_message":"John Kasich will be on the outside looking in for the RNC, but what is he really up to?"},{"comment_id":"10153746708116770","commenter_b":"That's the style whores wear today","commenter_a":"She's need to be excuted !","post_message":"Holy sheer."},{"comment_id":"906009439519420","commenter_b":"Sure, give 'em free food, free healthcare, free education, a driver's license, free housing -- am I missing anything. We can take in millions of refugees. Why not? Just because we're broke and have to borrow the money from China means nothing. Just cut the military and give the savings to the refugees. Bring in more and more. So what if some of them are terrorists who will kill and blow us up. Obama says they are like the Mayflower Pilgrims. Afterall, we're transforming America, right?","commenter_a":"fight it as long as possible, they don't deserve food stamps.","post_message":"Here it comes, gang..."},{"comment_id":"10154129008215329","commenter_b":"Sharon lol i couldnt find the woooorrddd","commenter_a":"I'm 15... i mean, i know how to use a CD player, and i know how to listen to a CD. i also know how to use a cassette and all but now a days, most computers don't even have a slot... we also got rid of our CD player ages ago... i haven't bought a movie on DVD in soooo long because everything is digital now","post_message":"So you've purchased Adele's \"compact disc\"..."}]
