[{"comment_id":"10152716358611680","commenter_b":"Red herring fallacy and straw man fallacy.","commenter_a":"This is sexist and Politico and the lib media are trying to hide this story. Nice try. @webpagelink","post_message":"Kelley Paul says \"to have that label put on him, that really upset me.\" @webpagelink"},{"comment_id":"468867053307454","commenter_b":"Transgender are idiots knockem in the head throw em in a ditch.","commenter_a":"This world is filled with way too many idiots. Please EDUCATE yourself. All of a sudden this is a problem? Where do you think trans people have been going to the bathroom? But ACTUAL pedophiles who like boys is okay? Stop being hypocrites and spreading hate","post_message":"A pledge calling to boycott Target has now reached over 1 million signatures. @webpagelink"},{"comment_id":"10154440357348256","commenter_b":"ANY WOMAN BUT HILLARY!","commenter_a":"Looking forward to the Change!","post_message":"All 50 signed a letter warning that, if elected, Donald Trump \"would be the most reckless President in American history.\""},{"comment_id":"826344630889447","commenter_b":"We are sick and ;tierd of feeding these lazy women who just keep laying on their backs , letting free loaders get them Pregnant. We need to sterilize these women. We should pay to get them sterilized.","commenter_a":"Get a JOB, leeches.","post_message":"They are losing it. That's what happens when you mooch for your entire life.  Do you think this was a long time coming?"},{"comment_id":"10153525074207994","commenter_b":"I have one get a wifeyou lesbian","commenter_a":"Gay people should respect non-gay people's Rights and don't be having sexually Haviar out in public keep it in your own home because I don't want to see it","post_message":"Pres. Obama's opening statement on #gaymarriage ruling: \"Our nation was founded on a bedrock principle: That we are all created equal.\" Watch more: @webpagelink"},{"comment_id":"10158544268330713","commenter_b":"Well she is a devil whore.","commenter_a":"I would have paid her to wear it if it have covered that ugly face...","post_message":"Progressives hate capitalism, except when they don't."},{"comment_id":"10156523926480354","commenter_b":"what idiot would vote for the bitch-","commenter_a":"I knew she was cleaning up crap. It continues to spew from her mouth.","post_message":"The QUEEN Shall NOT Use the Restroom With The PEASANTS!!!"}]
