[{"comment_id":"10157098525125354","commenter_b":"OR...build a wall to protect OUR country. Go back to Kenya - YOUR HOMELAND!","commenter_a":"Fuck him!","post_message":""},{"comment_id":"1611331605832486","commenter_b":"Just the fact that Hillary has a list long enough to get e locked up for life, and she's still a president candidate shows how rigged the whole system is...","commenter_a":"Lier.","post_message":"“Of course the elections will not be rigged. What does that even mean?”   President Obama called Donald J. Trump’s claim of a rigged election “ridiculous,” saying \"At the end of the day it's the American people's decision.\" @webpagelink"},{"comment_id":"10152902010080950","commenter_b":"I am sick and tired of these calls. I get them all the time on my business phone and my unlisted home phone. Especially Google. They are one of the worst.","commenter_a":"You let them know not to call you again usually by hitting 3 but it doesn't matter as they'll call you again using another number. Most are spoofed numbers. I had my own phone number come up on Caller ID one time! there is a site that you can check out numbers, www.800notes.com to let others know about the callers but the telemarketers don't care about that site. I see a lot of people on there saying to \"Stop calling me!\" yet don't leave their number. Yes, I'm tired of the \"Lower Your Credit Card Interest\" or letting me know about a topical pain ointment. Be aware of those calling saying that they are the IRS or police telling you to pay up using a pre-paid debit card. Callers also try to tell you that your computer has issues and that they are from \"Windows\", not Microsoft. I mess with ...","post_message":"\"If [phone companies] came out with an ad, 'We're going to block robocalls,' I mean, I don't think they could handle the business they would get,\" Missouri Democratic Sen. Claire McCaskill predicted."},{"comment_id":"10153911212003984","commenter_b":"Go Candance!!! Who is the woman on the right with the white duck on her head???","commenter_a":"I support Candace 100% God bless you","post_message":"I have to give major credit to Candace Cameron Bure. It can't be easy to be surrounded by the liberals of \"The View\" and stick to your guns like this. She sure got them riled up, and I could watch it over and over again!  Do you agree with Candace Cameron Bure?"},{"comment_id":"875788715811158","commenter_b":"@webpagelink, watch this and tell me is this ridiculous?","commenter_a":"Worse than ridiculous","post_message":"Don't you agree this is ridiculous?"},{"comment_id":"10153265757247061","commenter_b":"No, he was too busy lighting our disgraced white house Christmas tree.","commenter_a":"If you have no interest in hearing President Obama, why comment? I'm sure he's not reading your negative comments. He's much too busy and has other more important things to focus on, unlike you, who clearly have too much time on your hands!","post_message":"BREAKING: President Barack Obama to address the nation from the Oval Office on Sunday night at 8pm ET, White House says. @webpagelink"},{"comment_id":"445100202281687","commenter_b":"Hey here is an idea to the asshole who runs this page, stop defending these fucking criminals. Weed is ILLEGAL. Don't fucking run asshole. The fucking cop should have curb stomped him","commenter_a":"this police guy is a liar ,you deserved your termination,your insane....","post_message":"This is just disturbing. What a lame excuse this cop who has been reported multiple times in the past used for his violent behavior. Now he is defending his actions.   Do you think his violence is justified?  *Warning* GRAPHIC Video: @webpagelink"}]
