[{"comment_id":"685645904949943","commenter_b":"Go fuck your sister","commenter_a":"59% don't care to show his taxes!!! But I put money on that same percentage CARED about his birth certificate!!!! People of this country make me sick!","post_message":"The Rachel Maddow Show is right –– this is an \"unimaginable corruption scandal.\"  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10155020049345500","commenter_b":"I can see you are a cold-hearted Republican, but are you a veterinarian? Did you ex-ray and scan the dog for injuries? This dog will suffer for this when it ages. You are an evil woman who abuses animals.","commenter_a":"This is ridiculous. I am the biggest dog lover ever and this is blown way out of proportion! The dog is fine!! Geez","post_message":"\"DEAR PETA! CHILL!\" What else Sarah Palin said in response to criticism after posting a controversial dog photo @webpagelink What's your take?  (Image courtesy Sarah Palin's Facebook page)"},{"comment_id":"10153512476881337","commenter_b":"Dat nigga is fuccin NASTY!!!!","commenter_a":"AE Guy Hung Nhi Vo","post_message":"GET EXCITED: The Predator is about to enter the Mortal Kombat X world..."},{"comment_id":"649524331880703","commenter_b":"She and Bernie are behind these riots. Why do we listen to her? She is a liar!","commenter_a":"You got that all right. Randy Webster","post_message":"Disappointing to hear."},{"comment_id":"10153378758554575","commenter_b":"Would this woman have been willing to pay the stewardess' salary when the stewardess got fired for allowing her to make the phone call? Bet not....","commenter_a":"Why is she leaving if her husband was suicidal","post_message":"A woman says Southwest Airlines refused to let her call her husband after she received a troubling text message shortly before her flight was scheduled to take off.  The woman said the text read, “Karen, please forgive me for what I am about to do, I am going to kill myself…” She said she replied \"no\" and immediately tried to call her husband, before a steward \"slapped the phone down\" and told her to put her phone on airplane mode."},{"comment_id":"1107032922700941","commenter_b":"Kyle Broussard","commenter_a":"That should be an Olympic sport!","post_message":"This guy has some skills.  (Via JukinVideo)"},{"comment_id":"10152911982215671","commenter_b":"Make sure you know the true story. I have never met the families that need their child taken. All my experience is the other side where CPS literally kidnaps the children for the hospital on lies and stories that get twisted and turned, so it sounds like abuse. Looks like we know opposit ends of the fight with CPS. No matter what is going on in these children's lives, I just wish the children were put first. When you take children from their homes, good or bad homes, put them in counseling. Do not drug them all up and do not allow them to be abused by the system.","commenter_a":"How about CPS just stop stealing kids!","post_message":"Sacramento County CPS is holding an event at 6:30 p.m. on Wednesday, but if you can't make it, we've included contact information to find out more about the program."}]
