[{"comment_id":"1274246805922508","commenter_b":"Of course it's happening in England and if Americans don't wake up, you will see it here too. Open the Bible and read it with your family. it will show you who God is and who this muslim god is. Protect your family at all costs.","commenter_a":"If this is allowed to happen in the US, then mistakes have been made, and someone will need to pay!","post_message":"This school has taken things WAY too far. This is ridiculous. Is this school committing a crime?"},{"comment_id":"1231532310220572","commenter_b":"And male or not, you're a cunt","commenter_a":"The dirtbag can pick anyone he wants, Congress has no obligation to endorse the fascist's choice. Speaking of the Constitution. GOP won't be re-elected if they pass any nominee appointed by Ovomit.","post_message":"BOOM!"},{"comment_id":"1000554689985003","commenter_b":"I also work in the water industry and watched this guys demonstration. What a bunch of BS on several accounts. First my information comes from the following website: Water Encyclopedia - Ogallala Aquifer. According to this site the average depth of the Aquifer he is referring to is between 60 to 200 feet. Some sections of this Aquifer is over 1000 feet deep. Anyone that understands anything about water understands ground filtration. This particular Aquifer happens to be receiving it's water from snow and rain run off from the Rocky mountains. Fracking or not is very very unlikely to have any effect on the quality of water in his state. True fracking does use water in it's process - untrue it does not simply dump untreated water back into the Aquifer. This guy's demonstration is about as truthful as someone video taping a moose pissing on a snow bank in ...","commenter_a":"yup......and one \"spill\" accidently of course.......stop this madness!","post_message":"It's simple, really. If this is what you're willing to do to the water, you should be willing to drink it. These committee members weren't."},{"comment_id":"10154266348729203","commenter_b":"Go on sis!","commenter_a":"It seems that people are pushing their agenda however way they can... Big changes are coming soon... @webpagelink","post_message":"'Captain America: Civil War' screenwriters on the importance of Cap in light of Trump: \"It important to have someone remind people that that is not what this country is about, and you being kind of an ugly fool, and reductive.\""},{"comment_id":"10158044749370294","commenter_b":"@username nothing about him says he would do any of that....he got into a car crash lol stop making these puppets look like heros","commenter_a":"Why was he even shot when he had no weapon e could have been taken in to custody without killing him. That officer needs to be investigated and put on leave of absence","post_message":"There's still a lot of question about what happened leading up to the fatal shooting of a college student."},{"comment_id":"985543698152769","commenter_b":"This old lady sounds like she's craving for big nigga dick :)","commenter_a":"See ya bitch... Cracker ass Cracker!","post_message":"Like housemother like house sons."},{"comment_id":"1100432766685506","commenter_b":"F**k Obummer and his illegal aliens...","commenter_a":"Prayers","post_message":"OBAMA'S LEGACY: Veteran Kills Himself After Call To VA Suicide Hotline Goes To Voicemail    Meanwhile Obama Hotline For Illegal Aliens To File Complaints About Border Patrol Remains Fully Staffed"}]
