[{"comment_id":"10153838559734203","commenter_b":"I said it, these muslims terrorists are disgiusing themselves as refugees, it is time for europe to immetiate Autraleria, keep them in prison like camp, then deport them back to where they are coming from","commenter_a":"bull. shit.","post_message":"A Greek official said the Syrian passport holder whose ID was found on the body of one of the Paris attackers landed in Greece last month on a boat from Syria."},{"comment_id":"496533153870598","commenter_b":"We will never submit to Islam! Go fuck another goat!","commenter_a":"How do you really know that @username...you have documentation to explain here to that right wingers are like muslims??? Haven't seen a right winger decapitate anyone yet...or did i miss one?? Are right wingers now involved in terror plots against America and are they sneeking into third world muslim countries and blowing people up?? Man!!! I must have missed all the headlines...sure glad you brought us up to page on this!!!","post_message":"First our schools, then our public areas, what's next?  'SHARE' this post, we have to let the nation know what the MSM won't.  Do you agree Shariah must be stopped?"},{"comment_id":"10154243110114228","commenter_b":"I would of peed on that mf","commenter_a":"@username is it wrong that I laughed 😅😂😅😂","post_message":"Wait  it gets worse."},{"comment_id":"10154014162531636","commenter_b":"Nope! Jeremy Corbyn.","commenter_a":"ISIS?","post_message":"BREAKING"},{"comment_id":"10153736602849749","commenter_b":"@username - Why does Europe have to take these refugees? So many are military aged men. Why aren't they staying in their country and fighting to save it? Militant Islam is dangerous whether you agree to it or not. Letting these people into your country will diminish your country because these people will demand that you accommodate their religion and their way of life instead of them making an adjustment because they are guests. They will demand changes in established laws because they will not conform. These are not bigoted statements. These are facts that are easily verified.","commenter_a":"Why do militant atheists support the arrival of (militant?) Islam into Germany?","post_message":"German police spray left-wing protesters with a water cannon to keep them apart from an anti-Islam demonstration.  See more: @webpagelink"},{"comment_id":"1619461488113974","commenter_b":"Fuck Rosie!!! Stay fuck out of the U.S. no one misses u ... we promise!!!","commenter_a":"She was right about one thing. She truly is one sorry individual.","post_message":"Keep 10 year-old Barron out of politics!"},{"comment_id":"880663015326781","commenter_b":"Alex Peterson hahahaha","commenter_a":"Tyler Simmonds @username Ashley Mckendrick","post_message":"Dolphin seduced me, claims man who had sex with marine mammal."}]
