[{"comment_id":"248420038902239","commenter_b":"Shouldn't she be starring in class B horror films?","commenter_a":"She's a fucking bitch and a liar and top of it😡😡😡😡","post_message":"\"'Alternative facts' are not facts. They're falsehoods.\" Sean Spicer, Conway, and Trump tried to lie about the size of the inauguration crowd, but Chuck Todd didn't let them get away with it.   Shared by Occupy Democrats, LIKE our page for more! Video from Meet the Press."},{"comment_id":"10153105302477144","commenter_b":"Funny. I thought she sounded a lot like Hillary Clinton","commenter_a":"She is my number 2 choice. I am all about Bernie, but hif he doesn't get the nomination, I will give it all to get this woman in office bcause the alternative side is terrifying.","post_message":"\"The defining economic challenge of our time is clear. We must raise incomes for hard-working Americans so they can afford a middle-class life.\" — Hillary Clinton"},{"comment_id":"10154028098571336","commenter_b":"Yeah whatever, clueless lady.","commenter_a":"Oh come on....Carson, a very good man, has hardly run much of a campaign. If your campaign can't get traction, it's not someone else's fault!","post_message":"\"A culture exists within the Cruz camp that would allow people to take advantage of a situation like this in a very dishonest way. Isn't this the same thing we see with the Obama administration?\"  Dr. Ben Carson slammed Ted Cruz's campaign over allegations they told Iowa caucus-goers Carson was planning to leave the race."},{"comment_id":"10154133286695399","commenter_b":"Oh look it's a troll","commenter_a":"The republican party is an organized seditious criminal conspiracy. There is no reasonable basis for Ryan's actions.","post_message":"\"Briefings for the candidates will be provided on an even-handed non-partisan basis,\" James Clapper told Ryan."},{"comment_id":"10153085660518010","commenter_b":"@username - Why are you afraid of strong women?","commenter_a":"If women can complete the same physical testing that men have to then they should be allowed to become full combat ready Army Rangers","post_message":"About 60 women will be allowed to take the next Army Ranger course assessment for the first time ever.  But women are still not allowed to become members of the regiment and will not serve as Rangers in combat."},{"comment_id":"661747857265261","commenter_b":"@username in LA-LA Land - Run back to the boarder and GET THE FUXK OUT OF MY COUNTRY!","commenter_a":"Then he obviously didn't listen to the end. Bibi gave 3 more stipulations that were very clear to add to the table","post_message":"US President Barack Obama says that Prime Minister Benjamin Netanyahu “didn’t offer any viable alternatives” to the current P5+1 negotiations in his speech to Congress.   #NetanyahuSpeech"},{"comment_id":"10154654618245575","commenter_b":"@username are you by chance a Libetard? from cali ?","commenter_a":"The President to be mocks the loser that's really Presidential.","post_message":"TRUMP MOCKS HILLARY ON HER CANCELLED FIREWORKS SHOW! ---VIDEO"}]
