[{"comment_id":"1711501568866157","commenter_b":"Another fool... how many Muslims are you taking home?","commenter_a":"More than half of the damn country is colluding to get rid of his incompetent dumb ass! On the other hand he doesn't even need to be investigated for colluding with Russia!!!","post_message":"Donald Trump's administration is to charge Barack Obama with treason for colluding with the Deep State to overthrow The President."},{"comment_id":"10152947351429091","commenter_b":"They should send these idiots to go fight Isis since there so big and bad let's see how big n bad they are then..","commenter_a":"I hate ghetto children! Yes hate! That is our future? I'm scared.","post_message":"UPDATE: 2 arrests were made in a vicious beating at a McDonald's in Brooklyn. Teens were trading blows when a Good Samaritan jumped in...then he became a target, too. MORE: @webpagelink"},{"comment_id":"10154516919809575","commenter_b":"Actually yes it was.","commenter_a":"Full moon?","post_message":"Police are on scene investigating after they say 2 people were shot on the west side.   Six people have been shot since 8:30 p.m. Thursday."},{"comment_id":"10152567053540927","commenter_b":"Rice did the same thing with her emails. Is she evil too?","commenter_a":"She is one evil person.","post_message":"They're taking her own staff's word for what could possibly have been a major national security risk!?!"},{"comment_id":"1199029986880444","commenter_b":"give out birth control pills....us older people didn't even have those in our days ....PPH sells baby parts so that's one reason they like abortions......","commenter_a":"And baby mortality will go down","post_message":"Cecile Richards: Maternal Mortality Will Increase if Planned Parenthood Defunded [VIDEO]"},{"comment_id":"482642515272130","commenter_b":"Absolutely it is. We're nearing the point of no return for this planet (relative statement. Could be in 100, 300, 500 years) and without a plan to continue our species (even if generations have to spend their lives in a travelling spaceship) we will go extinct. Planning for the future is always a worthwhile investment no matter how far ahead the worst case scenario seems.","commenter_a":"In other news more useless discoveries that are so far away they might as well not exist","post_message":"AMAZING news."},{"comment_id":"1226980343992420","commenter_b":"Ugh man females I hate em in high school and yes we can have a button up and cleavage will show lol","commenter_a":"Jessica Elizabeth😂😂😂","post_message":"Boob deodorant? Oh yes, I've got that."}]
