[{"comment_id":"10152679214316545","commenter_b":"I don't understand why it's called The Miss Universe pageant when our planet is the only one competing?","commenter_a":"I thought it was very rude for the audience to boo, I felt bad for Miss USA.","post_message":"Miss USA was SO close to taking home the crown, but many thought Miss Jamaica was the biggest snub!  Thoughts on Miss Universe?"},{"comment_id":"10153202645506350","commenter_b":"This women should go talk to parents.","commenter_a":"Everyone saying \"she could have dealt with this privately, how embarrassing for the kid\". She never even mentioned his name... She is just addressing him along with all the other boys out there who do this. Something similar happened to me when I was in grade school and instead of having my back, all my friends labeled me as a bitch for not giving this guy a chance. He WAS harassing me but it was seen as \"cute\" because women are taught to appreciate male attention no matter the circumstances. We are taught it is the best thing that could ever happen to us. Just bear in mind that if a teenage daughter willingly comes to her mother for help, during a time when most teens seek distance from their parents, there is clearly a huge problem. This is video that can help a lot of other parents and teens ...","post_message":"This mom has a message for the boy repeatedly being rejected by her 14-year-old daughter: No means no."},{"comment_id":"10153670096417869","commenter_b":"Can we share this with credit of course?","commenter_a":"It been a busy week. In the past ten days, the Trump Campaign joined the KKK, sucker-punched a Bernie supporter, attacked peaceful protestors, abandoned NATO, exported nuclear weapons to Japan and South Korea, spilled-the-beans on Heidi Cruz, outted Ted Cruz in a sex scandal, beat-up a female reporter, dropped nukes on Europe and the Middle East, and punished women for having abortions. These acts would be incomprehensible were it not for the fact that Donald Trump hates Mexicans, hates our trading partners, hates our stupid leaders, hates Muslims, hates women, hates blacks, hates reporters and Bernie supporters, and hates women having abortions. How can he claim to want to Make America Great Again, when he so clearly - hates Americans? There is no answer. Unless we look to the words of the candidate himself. According to The Donald: 1) He disavowed KKK David Duke endorsement; 2) He didn mind a ...","post_message":"There are a couple of twists in the story of Trump campaign manager Corey Lewandowski, accused of misdemeanor battery for allegedly grabbing the wrist of former Breitbart reporter Michelle Fields.  He was not arrested as some outlets initially reported, but voluntarily signed a “notice to appear,” a misdemeanor summons.  And an anonymous Secret Service agent on Trump’s detail claims that what Fields did could have easily resulted in a much harsher response.  This story has the latest:"},{"comment_id":"10153995516108854","commenter_b":"What a dumb whore weasel","commenter_a":"She's an STD waiting to happen.","post_message":"Lena Dunham Compares Rape Allegations Against Bill Cosby To The Holocaust…"},{"comment_id":"10154258845019087","commenter_b":"Crooked Hillary, Star Trek, and a wussy looking dog......that fits you. #dbap","commenter_a":"Too many fail to realize that had the shoe been on the other foot, DT and his supporters would be screaming to high heaven about the system being rigged - so stuff it.","post_message":"A petition calling on the Electoral College voters to cast their ballot for Hillary Clinton instead of Trump has amassed over 600,000 signatures in less than a day."},{"comment_id":"10154524280341955","commenter_b":"She's corrupt to the core.","commenter_a":"More of the trash that needs to go.","post_message":"Loretta Lynch 'Pleads Fifth' on Secret Iran 'Ransom' Payments..."},{"comment_id":"10153380129759087","commenter_b":"The countries that ban him should take the refugees. If they want to stand up for them so bad, take them. Oh ya, Dubai won't take any refugees. They are just hypocrites.","commenter_a":"Another great endorsement to vote for Donald Trump. Way to go Dobye.","post_message":"Donald Trump's name has been removed from a multi-billion-dollar luxury golf course project in Dubai in the wake of public outcry over the GOP presidential candidate's proposal to ban Muslims from entering the US."}]
