[{"comment_id":"10153060758061162","commenter_b":"What?","commenter_a":"i tink he looks cool and should have done the other side too","post_message":"SENTENCED: A man nicknamed \"Eyeball,\" because of a face tattoo that included the whites of his right eye, is sentenced to 22 years in prison for shooting an Alaska police officer.  PHOTOS: @webpagelink"},{"comment_id":"10152701049955496","commenter_b":"I had no idea a woman would take offense to the sex part....","commenter_a":"First of all Sex isn't priority one. Marriage is about being there for your spouse, understanding each other, respect and being willing to come to an agreement when you have a difference in opinions. This young buck is confused.","post_message":"A 29-year-old columnist says marriages today just don't work. Here are his reasons: @webpagelink  Do you agree?"},{"comment_id":"678882268945673","commenter_b":"Rosie has the mental disorder! She is a raving maniac!","commenter_a":"I thought she was moving....","post_message":"WOW! Leftist Bully ROSIE O'DONNELL Pushes Horrible Rumor On Social Media...Suggests Barron Trump Has Mental Disorder [VIDEO]"},{"comment_id":"10155394034488352","commenter_b":"I used to work as cashier and I witnessed a couple of white people trying to pay for others people groceries so they will get the cash . They will go around asking Hispanics mostly Mexicans to pay for their groceries so the Mexicans could give the cash to them??? Yup cheating the damn system , of course we wouldn't do it for them . This bitch came to me one time and Infront of me she offered to pay this Mexican ladys stuff and I said to the Mexican lady don't do it , she's asking to do something illegal . The bitch was like why you telling her that ,I was like look I can take your name right now , you are on camera and I have this lady as witnessed. I can contact social services right now and tell them what you doing .... You will ...","commenter_a":"If you gave them citizenship most would turn it down. These people don't want that. Then they would have to pay taxes. I work with mexicans and and other immigrants. The legal ones I work with didn't like the illegals on Fridays cause they brought home more. If yaw people want all these immigrants here so bad take them into your homes. Our country can't handle anymore forms of welfare.","post_message":"It's open season on illegal immigrants: Trump declares that ANYONE in the US illegally can be deported, regardless of whether they've committed a crime"},{"comment_id":"1179430858762542","commenter_b":"@username what an a**","commenter_a":"Not even the president yet, and already proving himself to be the leader we so desperately need!","post_message":"As soon as Donald J. Trump heard the news that 1.5 million people are being asked to leave their homes, he knew exactly what to do..."},{"comment_id":"1007362382702564","commenter_b":"That's uncle Ernie sitting on the eggs","commenter_a":"@username get off of here!","post_message":"ONE EGG IS HATCHING! Eaglet Watch 2016 continues as Harriet and her mate M15 wait for their two eaglets to hatch. One egg began to crack yesterday! Fingers crossed we get an eaglet today!   Once an eagle egg begins to crack, it can take 12 to 48 hours for the eaglet to fully hatch.   Live video: Southwest Florida Eagle Cam MORE: @webpagelink"},{"comment_id":"1211790348838313","commenter_b":"Punk ass bitch mo fos!","commenter_a":"You people who are shooting these schools and theaters up aren't proving nothing to nobody except your a bunch of punks bitches and cowards.","post_message":""}]
