[{"comment_id":"10153171021535950","commenter_b":"she gave him head while the lieing bitch watched and then joined in!","commenter_a":"From many people that know them personally, he has a few girlfriends. One in Canada. It's a marriage for show only.","post_message":"The United States' ultimate political power couple, Bill and Hillary Clinton, celebrate 40 years of marriage today. Their marriage certainly hasn't been all smooth sailing..."},{"comment_id":"10153840702631955","commenter_b":"No no, that's Bernie. Hillary is just a straight up thieving murderous cunt.","commenter_a":"And to think that there are idiots who say that she's a communist or a Marxist. What morons. After she gets so much $$ like Ted Cruz from Goldman Sachs","post_message":"HRC wore yellow debate jacket when meeting GOLDMAN SACHS CEO..."},{"comment_id":"1819434894958282","commenter_b":"@username pa la princess 😂😂😂😂","commenter_a":"Melissa Kaplan","post_message":"That pose though "},{"comment_id":"10153558061286037","commenter_b":"Doesn't matter. BUT FOR her illegal arrest, she would not have been in jail.","commenter_a":"aaaand boom goes the dynamite.","post_message":"Waller County prosecutor Warren Diepraam says the injuries that were found during the autopsy of Sandra Bland would be consistent with a suicide."},{"comment_id":"1285345191558532","commenter_b":"She is the Bitch.!","commenter_a":"love Hillary...Kill Babies.... $$$$$%","post_message":"The star actress makes an excellent point.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154179753088645","commenter_b":"Girl bye!!!","commenter_a":"She should be offended, he was trying to hook up with another woman while she was pregnant with his kid and during his apology he never said sorry to his wife.","post_message":" does not represent the man that I know, she added."},{"comment_id":"10153622998001323","commenter_b":"Don't give the bastard any ideas !","commenter_a":"This is why there are so few Tory comedians, they're about as funny as a burning orphanage.","post_message":"Barmpot."}]
