[{"comment_id":"976984712394583","commenter_b":"it was a $130,000 bust lol.... oooh what an impact. Responsible gun owners who will do things like \"not break the law\" and register their firearms, aren't going to buy them illegally on the black market. The people who are looking for guns to commit crimes with will continue to buy them on the black market. Changing any laws will not change this fact. In other news, water is wet.","commenter_a":"Holy silenced Uzis.","post_message":"This is why criminals get guns so easily."},{"comment_id":"1713306218956490","commenter_b":"Way to go. Ivanic","commenter_a":"If any women want an equal chance in any profession, then Donald Trump is their man for President. He has given women great opportunities in his businesses. He will create many jobs for all Americans","post_message":"Wow, great response!  Ivanka Trump is pure class."},{"comment_id":"10155875428813009","commenter_b":"She cant even talk, another wacko","commenter_a":"Fake News! Liar!","post_message":"Nancy Pelosi was asked about Trump's Supreme Court nominee. Her answer left CNN's Jake Tapper speechless."},{"comment_id":"10153638768074062","commenter_b":"And take your bimbo wife with you!","commenter_a":"Kanye, please listen to the voices in your head and leave the country!","post_message":"Kanye West opens up about rushing the stage during Beck's acceptance speech at the Grammys.   He says the voices in his head told him to do it.  He's also now calling Beck one of the nicest and most respected people in the industry.  Check out what else Kanye had to say and let us know... Is this really just too little, too late? @webpagelink"},{"comment_id":"1257645944292548","commenter_b":"Why doesn't FR just end this problem by STOPPING all Muslims from entering EU, no pain no trouble--just say NO! Muslims just cant integrate into civilized society.","commenter_a":"Our law is for everyone: no showing of religious appurtenance in schools or public places. That includes Catholics as well. I was not allow to show my catholic cross at school. And I am French. Our country, our laws. France did not became a country of human rights at no cost. If they are not happy there, they can go back in their country. They might remember why they left in the first place. Plus, no one in France is allowed to cover their face expect during winter: it was for security reason, long before Muslims came in France. Women in France fought for their right of Freedom, coming here and wear the veil is an insult to all woman who died for our freedom. The veil or any coverage is not religious, but cultural.","post_message":"It is argued that the ban on head-coverings is unfair because it encroaches the individual freedom to remain covered for religious purposes."},{"comment_id":"10152904733026051","commenter_b":"I would love to get my hands on the bitch who wrote that! I'm very sorry that there are people out there like that.","commenter_a":"Key their car","post_message":"A woman asked her neighbor to please avoid parking in her handicap parking spot. This is the letter she got in response."},{"comment_id":"1759728807637196","commenter_b":"Vicente Fox..You're not welcome in OUR Country!!","commenter_a":"Good then you'll get what you deserve 😉","post_message":"The former president of Mexico, Vicente Fox Quesada, says Donald J. Trump is using his visit to Mexico with President Enrique Peña Nieto to boost his sinking poll numbers. @webpagelink"}]
