[{"comment_id":"10152998065516037","commenter_b":"Of course men are trying to tell a woman what to do with our bodies. Go shove it!!!","commenter_a":"The silent holocaust, women and men who are irresponsible killing a life because of inconveinence. They will pay for it if not in this life the next one.","post_message":"A new report out today from the Guttmacher Institute shows that 57% of women now live in a state considered to be hostile or extremely hostile to #abortion rights."},{"comment_id":"10153526289392183","commenter_b":"She is one nasty creature!","commenter_a":"You have nothing to worry about you entitled shill. Your we does not include me. Go Bernie!","post_message":"She's setting up the arguments for the general election here."},{"comment_id":"10153104689788855","commenter_b":"WTF? The Advocate (or at least the staff involved in this article) clearly don't know what \"Twink\" is. These men are just aging well and don't have the outward appearance of what one would typically expect of their numerical age.","commenter_a":"Daryl Stephens is a hot man","post_message":"Sometimes, twink is forever (right, Darryl Stephens?)"},{"comment_id":"1044302852275608","commenter_b":"Trump wouldn't smoke a joint like billy tho","commenter_a":"@username. @username we will work on your wall mr trump","post_message":"Outstanding! A top priority- so we can MAKE AMERICA SAFE & GREAT AGAIN!"},{"comment_id":"1172778402818410","commenter_b":"the media just didnt air BERNIE enough! didnt get his ideas and platform out there,for all to hear. too busy showing stupid trump./","commenter_a":"Hillary 2016","post_message":"384 pledged delegates are at stake today, nearly twice as many as in New York last Tuesday."},{"comment_id":"10152843284606519","commenter_b":"How about you pay for your own? Why do I and the rest of the taxpayers have to pay for you losers? Stop being a fucking whore or just swallow next. time. Cum guzzling gutter slut sounds about right.","commenter_a":"400 million dollars plus the tax payers have paid to keep Planned Parenthood in operation. I understand it is cheaper to kill the child then pay for it in the form of welfare, Medicaid, HUD and food stamps. 56 million have been dismembered in the womb thus far. My question is where did the idea of the taxpayers paying for people's mistakes come from? Why should I be obligated to pay for other's mistakes? I am not and neither are any taxpayers. You fucked, you knew the results of fucking without birth control....fuck you and your offspring.","post_message":"\"I believe that abortion care is a positive social good. I suspect that a lot of other people secretly believe the same thing. And I think it’s time we said so.\""},{"comment_id":"10154006195498984","commenter_b":"The witches on the view can't understand normal thinking!","commenter_a":"Moron","post_message":"Ouch. It has to be embarrassing for Whoopi to get set straight in front of her own fans like that. She was no match for Rand Paul. After one of Whoopi's famous rants, Rand Paul pointed out exactly what is so ridiculous and silly about her argument.  Do you agree with Rand Paul?"}]
