[{"comment_id":"10153389202536051","commenter_b":"Bitch your fake, n ugly to boot !!!! Fake ass , go be with Obama !!!","commenter_a":"Quick somebody wake her up! She's having a nightmare!","post_message":"This model says that after wearing a corset for 7 years and getting four boob jobs, two nose jobs, butt implants and all her teeth removed, she finally has the \"perfect\" body. Decide for yourselves if that's true."},{"comment_id":"733056316849024","commenter_b":"Bitch has a nasty vagina","commenter_a":"They're wondering how to explain to their daughter that Trump won. How do you explain an adult woman wearing a vaginal out in public? What the heck is wrong with these people?","post_message":"ClashDaily.com"},{"comment_id":"10154455180439203","commenter_b":"LOL!","commenter_a":"Lou is a patriot and great American. He is right while Hillary is a liar, cheater, stealer, fake, fraud, and a phoney.","post_message":"Don't worry, Lou. They don't want to become you, either."},{"comment_id":"10153146203991051","commenter_b":"Caucasian women are most desire able","commenter_a":"I'm not racist but do y'all notice that the teachers who have sex with students be Caucasian? Hum!!!!","post_message":"This teacher was arrested for having sex with her students. While she was out on bail, she got busted doing it again."},{"comment_id":"638502853006960","commenter_b":"I love this picture, can you see michael adams apple. Women do not have one.","commenter_a":"I wonder if she refers to her own mother that way. Btw, the mother who also lives in the White House at our expense.","post_message":"Michelle Obama just insulted mothers everywhere... You'll be furious.  We're sick and tired of hearing about her. Let's make her go away forever.  'LIKE' if we should kick Michelle out of the White House!"},{"comment_id":"10153641200792235","commenter_b":"Fame whores","commenter_a":"Take your pick...lol","post_message":"Petty, childish and HILARIOUS all at the same time!"},{"comment_id":"10153385027713984","commenter_b":"Just GO away!!!!!!","commenter_a":"Freedom of speech","post_message":"Obama is trying to shut Fox News down for good... sadly, this is Obama's America.  He knows he is failing and is desperate to silence his critics... share this with everyone."}]
