[{"comment_id":"1736968439901263","commenter_b":"@username - nobody in this world is a bigger liar than Hillary. Period.","commenter_a":"Why is it when her lips move my first thought is liar liar pants on fire...when will she tell how much she took from foreign governments - oh well, what difference does it make anyway","post_message":"Watch: Hillary Clinton suggests Donald J. Trump hasn't paid his taxes."},{"comment_id":"1902414739981573","commenter_b":"Do these woman have any idea how stupid they are?","commenter_a":"How stupid","post_message":"Whoopi Goldberg: Right to Celebrate Christmas is the Same as a “Woman’s Right” to Abortion"},{"comment_id":"10153731368766756","commenter_b":"Aubrey A Price","commenter_a":"Jay Stephan Steinmetz, oh the La Fee!","post_message":"It was not art, but necessity that first helped popularize absinthe: It was included in the rations of French soldiers who marched off to colonize Algeria in the 1840s, issued \"for the prevention of fevers and treatment of dysentery.\"  It was only later that drinking absinthe came to be viewed as an indulgence for both the eyes and the tongue."},{"comment_id":"2049944575230110","commenter_b":"Should have Shot those idiots","commenter_a":"Awwww poor police. .. terrible. . They r great people who never ever do any wrong. . I wish I could be sad for that mf... but I'm not","post_message":"OFFICER ASSAULT: A crowd watched as 2 people became entangled with an officer. Those 2 face charges after this video surfaced.   STORY: @webpagelink"},{"comment_id":"390976721026923","commenter_b":"She needs a new Do!!! Lol","commenter_a":"Yep holder in a skirt","post_message":"What do you think of the White House nominee for Attorney General?"},{"comment_id":"1210812922267700","commenter_b":"Fools! All of them!","commenter_a":"Liberalism hit squads at their finnest huh Rush.","post_message":""},{"comment_id":"942000482502078","commenter_b":"Celebrities = whores. Whatever pays the bills","commenter_a":"(And yet he keeps playing bond...?)","post_message":"Wow."}]
