[{"comment_id":"1165586973515562","commenter_b":"ABSOLUTLY","commenter_a":"Why not keep an open mind ( and a closed mouth) until the evidence is in?","post_message":"Attorneys for the family of Keith Lamont Scott hold a news conference."},{"comment_id":"10157618931615389","commenter_b":"And Hillary has never lied right? Are you serious right now? Hillary has been exposed for who she is and it's not looking good for her. For she is so squeaky clean, why does she keep hiding from the media? She is always at home resting. She used her position to grant favors to foreign governments and took millions from them when they abuse women. You are worried about Trump being exposed on that debate stage? What a joke!","commenter_a":"The snake oil salesman's chickens come home to roost Monday night. Hillary & moderators will quickly expose the lying fraud artist for the flip-flopping liberal he's always been.","post_message":"\"Because they can't attack him on policy, they try to make it personal. They appeal to the emotions and the sensitivities of not only the black community, but the foreigners and females.\"  Pastor Darrell Scott said the Democrats don't attack Donald J. Trump politically because personal attacks are \"all they have.\""},{"comment_id":"10153623259427623","commenter_b":"@username coming here isn't a right. And yes, it is the same thing. Building a wall to keep people who don't belong here out is no different than you locking your door. You lock your door to keep people out.","commenter_a":"If you lock your doors at night then you agree with Donald J. Trump. I expect my government to be at least as security conscious about my country as I am about my family. This is not racism or rudeness, but common sense safety measures in a time such as this.","post_message":"All of Donald Trump's talk of constructing a wall between the U.S. and Mexico has inspired an artist to build a little border wall around Trump's star on the Hollywood Walk of Fame."},{"comment_id":"10155541308376002","commenter_b":"@username or we could use the same money they giving all folks coming here to do the same thing . Plus we want the wall and not these folks that want to blow us up .","commenter_a":"He has an issue with executive pen on immigration but no issue when Obama was doing it? Also this executive order is for 60-120 days same thing Obama did. Obama before he left slowed down Cubans to come in, President Carter sent Iranian students back during the hostage crisis. Hell my own grandparents in the 1900s came over and we're sent back to Italy. Rather fix the VA first then global problems second. Immigration isn't a right, my taxpayer dollars doesn't want to go to a bunch of illegals","post_message":"Senate Minority Leader Chuck Schumer is holding a press conference to demand the reversal of President Donald Trump's immigration ban.   You can watch the press conference live here:"},{"comment_id":"10154040772674778","commenter_b":"You're an idiot and idiots should not reproduce!","commenter_a":"Same sex marriage is not about love....it's about lust and sex...and it's nasty","post_message":"Here's the final paragraph of the Supreme Court decision legalizing same sex marriage across the nation. @webpagelink"},{"comment_id":"10155111433599614","commenter_b":"@username in Oregon not her she stinks hahah","commenter_a":"Jessica @username Davenport what an idiot lol","post_message":"The woman said she tried to get her pet ball python -- \"Bart\" -- out using cooking oil, but that didn't work.  She went to the hospital, where her ear was numbed and stretched even more, freeing Bart.  \"He acted like nothing even happened and was totally chill,\" she said."},{"comment_id":"554676768026413","commenter_b":"Lu Fo see the top comments and it really shows how the middle class sees the negative effects of raising the minimum wage","commenter_a":"so small businesses will make sure they will not hire that 26th person","post_message":"BREAKING: California became the first state in the nation to commit to a $15 per hour minimum wage after Gov. Jerry Brown signed the new law Monday.   Under the plan, minimum wage was expected to increase to $10.50 per hour on Jan. 1, 2017 for businesses with 26 or more employees.  The minimum wage would then rise each year until it reaches $15 per hour in 2022."}]
