[{"comment_id":"10155875894235354","commenter_b":"No one wants to see people in need suffer. But the time has come to stop illegal immigration and deal appropriately with those already here. ENOUGH! Impeach the whole lot of them for putting politics and \"special\" interests before the legitimate interests of the US citizen. COME TOGETHER PEOPLE!!","commenter_a":"dump her now,out of touch with the people,","post_message":"And We Support the Legal U.S. Citizens.   Bring it On, Nancy."},{"comment_id":"1136767329692020","commenter_b":"Poor Bill has to wake up next to this. OMG no wonder he did Monica.","commenter_a":"Sorry had to leave, Now back To the Butcher of Benghazi Karma Hillary Clinton","post_message":"Hillary, EXPOSED!!"},{"comment_id":"945825838793990","commenter_b":"nothing but a whore from the sixties.","commenter_a":"Ask her to please go back to Vietnam where she loves it so much .","post_message":"Actress Jane Fonda, who 45 years ago as making the lives worse for Americans fighting for their life in the jungles of Vietnam, is now making lives worse for American energy producers. Given the fight Fonda now has against North American oil discovery and transportation, she has once again aided and abetted the enemy: Islamic oil producers. It seems Jihadi Jane neither understands how her actions are viewed by the enemy (major Muslim oil exporters, some of whose core members want to see the destruction of the United States) nor how these anti-jobs protests impact hundreds of thousands of North American families. @webpagelink"},{"comment_id":"10154141762806162","commenter_b":"Wild animals!!!!! trump is the wild animal causing all this bs PIED PIPER !!!","commenter_a":"People need to stop blaming Trump for the actions of low life people. They get out of hand, then don't want to own up to their actions. It's the generation of placing the blame elsewhere. Trump didn't tell them to act like wild animals. That's just how they act.","post_message":"\"We're going to take our country back from 'these people,'\" Trump told supporters after his canceled Chicago rally. \"These are bad, bad people.\""},{"comment_id":"1815699362041993","commenter_b":"Can't stand that wretched woman","commenter_a":"I was gonna click for sound but then I saw a clip of Tomi Lahren pop up and thank god I dodged that bullet #iamsaved #toliveanotherday","post_message":"Republicans think protesters should just get over it and accept the results of the election just like they did when Obama won in 2008 and 2012  Oh wait..."},{"comment_id":"10153580364618797","commenter_b":"Lol @username she's definitely stupid and disgusting. ..","commenter_a":"Nothing racist about my comment! i simply wouldn't have called anyone to help. Now be mad if you like so what because","post_message":"WOW! A police officer collapsed on the job. The teen in handcuffs whom he arrested was sitting right there.   What the teen did next saved the officer’s life. See here:"},{"comment_id":"792840600880967","commenter_b":"I agree, but so does the weak Democratic Party leaders who have also FAILED us.","commenter_a":"I'm a democrat, Maxine Waters please sit down and regroup. The Democratic Party is weak weak weak and has no legs to stand on and you, Nancy Pelosi and Chuck Schumer need to be replaced period.","post_message":"Maxine Waters on Trump advisers: \"This is a bunch of scumbags. That's what they are, who are all organized around making money.\" @webpagelink"}]
