[{"comment_id":"10155392185178352","commenter_b":"@username she still immigrant . She come in visa and hurry married for papers like any other person.","commenter_a":"He better deport his wife too","post_message":"It's open season on illegal immigrants: Trump declares that ANYONE in the US illegally can be deported, regardless of whether they've committed a crime"},{"comment_id":"10153363808198010","commenter_b":"How do we know the restaurant would go out of business anyway? It happens all of the time. I live in Seattle and the rate increase is just slowly beginning to take effect. No conclusions of this sort can be made.","commenter_a":"In Seattle where they just raised minimun wage to $15 a hour some restaurants are now going out of businss as restaurants are having to pass on to their customers a lot higher prices for the food they serve.","post_message":"An L.A. City Council committee has endorsed a hotly contested plan to raise the citywide minimum wage to $15 by 2020, up from the current $9 an hour. The proposal now heads to the full city council."},{"comment_id":"1241741129230844","commenter_b":"Donald Trump made racist white folks take they mask off, if you support Trump you are lowKey crazy and Racist, Trump's rich ass don't give a fck bout the poor, #BlackLivesMatter #Mexicans , he dont give a fck bout people from the bottom, the ones stuck in the hood, he only gives a fck bout the rich white and wealthy, ,...he started a Race war, he just motivated and inspired the KKK even more, kkk supports him to the fullest, he's gonna make this country more heated and more and more hatred between white people and the rest of the Race's , ...fck hillary too, but trust me Donald Trump is not a good option, he wanna make America white again","commenter_a":"Be a good time to start deporting.....thats how you catch illigals hold a Trump rally just bring in the busses and load them up....lmao","post_message":"Protesters remove their clothes at a Trump rally just before they flood the streets and destroy property."},{"comment_id":"804496683016845","commenter_b":"Fuck pigs","commenter_a":"Beyonce fine do your protest but don't be a hypocrite and be escorted to the stadium by law enforcement. Let the Black Panthers escort you. Don't half ass protest, walk the talk all the way and if you can't then STFU","post_message":"This RACIST liberal meme claims complaints about Beyonce's Superbowl are proof of white privilege and an aggression against blacks. But as usual the left gets it totally wrong and proves they know NOTHING about history.  We take this vile meme and destroy it with historical facts!"},{"comment_id":"659659264197547","commenter_b":"We all know why he said this... Statistically speaking illegal immigrants will vote Democrat.. This is another reason why they do not want voter ID... It is not racist to want voter ID... everyone carries an ID.. Again a narrative from the left, In 10-15 years will we will be a one party country... We will also have a single-payer system, so get in line and prepared to wait for your doctor because you are now dealing with the government which is like dealing with the department of motor vehicles.. We will also have 500,000 more Syrian refugees in this country, A pay for play with Soros, she is a puppet for him... All of our tax dollars will have to pay for these refugees and all of the entitlement programs, along with all of the illegal immigrants in the country currently... We are on our way to socialism, open ...","commenter_a":"Well, in the next three days you will see our crooked media , led by CNN and NBC , run all the dirt they can dream up on Trump and absolutely nothing negative on Hillary despite all the information. It's our last chance to get rid of corrupt Washington insiders like the Clintons. VOTE TRUMP !!!","post_message":"***SHOCK*** Days before presidential election, Obama is openly and blatantly thumbing his nose at the rule of law that governs American elections..."},{"comment_id":"641559742659462","commenter_b":"This woman is either a complete idiot or a pure propagandist.","commenter_a":"Oh how people forget that gore won the votes of the people","post_message":"\"Not since the American Revolution has the ruling class tried so hard and so blatantly to take away our vote.\" – Judge Jeanine Pirro @webpagelink"},{"comment_id":"10154233484170496","commenter_b":"She's a smart woman","commenter_a":"At least she kept her yap shut","post_message":"What do you think of Lady Gaga's Super Bowl halftime performance?  PHOTOS: @webpagelink  (Photo by Patrick Smith/Getty Images)"}]
