[{"comment_id":"10154383747512908","commenter_b":"Pussy","commenter_a":"It will never stop. Americans absolutely love guns and violence. The NRA owns this country. I got my passport so I'm outta here.","post_message":"Mass shootings are becoming an almost-everyday occurrence in this country. This sickening and senseless gun violence must stop."},{"comment_id":"10157252246585354","commenter_b":"Lorena Bobbitt needs to take care of this demonic trash creature!","commenter_a":"Deplorable.","post_message":"**UPDATE**  That's it?!"},{"comment_id":"10153262230564255","commenter_b":"Evil like this should be flogged. He's a monster like the rest of the TeaParty Jerks.","commenter_a":"I truly believe this man, Ted Cruz and their followers have very warped brains that will only bring greater harm to the world than Dubya/Cheney created and we are still trying to repair! They whole group needs to be tried and sentenced to jail for 3 years for TREASON!","post_message":"Losing his grip on reality, or lying shamelessly?"},{"comment_id":"10154115958779740","commenter_b":"How is chatting about baseball anything like questioning someone about their personal relationship with religion...?","commenter_a":"If they can't talk about repentance and God then they can't talk about anything else either outside of the law and professionally defined parameters consistent with law enforcement . We can't be picking and choosing what a man can talk about. What? Are we going to ban cops from discussing baseball? What about \"hello Mrs Jones, how's the husband and kids, has Mr Jones been staying sober?\"","post_message":"Should officers be allowed to preach to civilians while on duty?"},{"comment_id":"10153961188184705","commenter_b":"Show us your Boob's lady.","commenter_a":"Hi from rio brasil","post_message":"Get an exclusive tour of the Mashable House at SXSW with Pete Cashmore."},{"comment_id":"10153249048488352","commenter_b":"Pure evil heartless bitch","commenter_a":"The same thing should happen to her no doubt about it","post_message":"Texas woman, 26, found guilty of suffocating fiancé's two-year-old daughter to death using duct tape after he broke up with her"},{"comment_id":"10150622928829999","commenter_b":"She needs to go and work with Al Dunlap. They both do jobs that no one else has the guts to.","commenter_a":"Joe Jack","post_message":"Ellen Pao is resigning from reddit after a week of ceaseless criticism from angry users."}]
