[{"comment_id":"10154017323271350","commenter_b":"sweet potato! :)","commenter_a":"Teri","post_message":"Once you start spiralizing life will never be the same!"},{"comment_id":"10154046898184199","commenter_b":"I think the verbal abuse has to be severe (to the point of verbal battery) before they will enforce it but this is how the state has defined it but I'm not a lawyer and if theres a lawyer reading this could you please explain it better the rcw codes tend to be confusing.","commenter_a":"Ok so for the internet lawyers out there, or real lawyers, riddle me this: If I start cursing out someone on the street, can a cop arrest me? Have I broken the law?","post_message":""},{"comment_id":"801111976648525","commenter_b":"Wow that's all I can muster after reading these comments","commenter_a":"copy that.....","post_message":"This brave, hard-working man has accomplished so much in the face of unprecedented obstructionism and hate. History will treat him kindly.   Thanks to Roy Mark Ramdas."},{"comment_id":"10153904128981336","commenter_b":"@username I'd rather my money go to vets than illegals.","commenter_a":"Oh man, companies supporting a competent and able workforce with bonuses. Conservatives will not like this one bit.","post_message":"Jeffery Hildebrand, the 56-year-old billionaire owner, will pay out more than $100 million in total and reportedly uses these bonuses to motivate his workforce."},{"comment_id":"1495765340483209","commenter_b":"Wow ease up on the drugs girl, you're delusional.","commenter_a":"Hillary, is the only sane choice. Trump is the village idiot. Daily mail must be endorsing trump. Plus, what's wrong with being short?!!","post_message":"She hasn't got her way...and she won't get commercial breaks for coughing fits or fainting spells"},{"comment_id":"1670944519835060","commenter_b":"These women need to learn to lug around bottles with store bought milk that contains half the nutrients in case their baby becomes hungry and fussy and starts bothering everyone around them. They should use their brains!!!!","commenter_a":"Feeding your baby and using your body the way God intended it to be used is absolutely shameful. How on earth could women stand up for such a thing and demand that society accept this!","post_message":"Women are brilliantly standing up to breast-feed shaming.  Read a powerful example right here: @webpagelink  Like ATTN: on Facebook."},{"comment_id":"1362078013830431","commenter_b":"Cruz....Kiss that ass.","commenter_a":"Mr. President, Please do not squander this opportunity to put a conservative in the Supreme Court. This is extremely important, we do not need someone who's going to be a straddle of the fence. We have too much anti-American government, anti-Constitution battering happening inside our nations capital and a crossed our nation, we cannot afford to make evening a half step in the wrong direction. Please Mr. President I implore you to please hear my request, my plea.","post_message":"Ted Cruz NAILS it, everyone needs to see this!"}]
