[{"comment_id":"1559248597428498","commenter_b":"Trump is a friggen rapist!","commenter_a":"Donald Trump and Hillary Clinton walk in to a bar. Donald leans over, and with a smile on his face, says, \"The media is really tearing you apart for that Scandal.\" Hillary: \"You mean my lying about Benghazi?\" Trump: \"No, the other one.\" Hillary: \"You mean the massive voter fraud?\" Trump: \"No, the other one.\" Hillary: \"You mean the military not getting their votes counted?\" Trump: \"No, the other one.\" Hillary: \"Using my secret private server with classified material to Hide my Activities?\" Trump: \"No, the other one.\" Hillary: \"The NSA monitoring our phone calls, emails and everything Else?\" Trump: \"No, the other one.\" Hillary: \"Using the Clinton Foundation as a cover for tax evasion, Hiring Cronies, And taking bribes from foreign countries?\" Trump: \"No, the other one.\" Hillary: \"You mean the drones being operated in our own country without The Benefit of the law?\" Trump: \"No, the other one.\" ...","post_message":"A 36-foot model of Donald J. Trump holding Hillary Clinton's head was burned during annual bonfire celebrations in a British town."},{"comment_id":"10153906940493812","commenter_b":"Are you American? If your pro bringing terrorists into the country and giving them free benefits like Medicaid etc. while American citizens starve, how about we send a few to stay with you? Wait... I get it... 'Nuff said!","commenter_a":"After all, some Americans do have a heart. Way to go Pres. Obama.","post_message":"\"Apparently, they are scared of widows and orphans coming into the United States of America.\""},{"comment_id":"10153484016796519","commenter_b":"Illegal aliens... is not racist. No mention of race... just ILLEGAL.","commenter_a":"Funny but kind of hypocritical on SNL's part since they gave him legitimacy not that long ago even after he had said racist things.","post_message":"SNL hilariously scorched Donald Trump's supporters last night...."},{"comment_id":"891542370901815","commenter_b":"Behead the shitbag goat fuckers","commenter_a":"Hehehe","post_message":""},{"comment_id":"607938739358501","commenter_b":"Then dont go watch guadian of the galaxy 2 ..groot hates you!","commenter_a":"Look! Its raw meat! Its eel on the grill.. so it is food! We human are mammal and also carnivore. So eat things raw is a way of eating. Only when you kill for fun and waste the meats of throw away too much leftover then that would consider a sin for others may not have enough to eat! If you think eating thing raw is immoral or gross then throw away your fruits, veggies because they are still living things and have souls and you may not know it! Damn you people with no understanding and misjudgement","post_message":"What. The. Hell."},{"comment_id":"1738737039712860","commenter_b":"Republicans are not racist like the democrats would like you to think we just want a safe and secure country. They blocked him bc he wants to give our country away!!!! Illegals do not belong here!! There should be no sanctuary cities to protect them. Anyone coming here needs to take the steps to be a citizen first!!","commenter_a":"Y all the hate? What have Obama done that is so terrible? To my opinion he is one of the best. They races republicans stop him since day one, cuz they want him to fail. Block him all the way...","post_message":"President Obama's approval rating stands at 55% in a new CNN/ORC poll, the highest of his second term"},{"comment_id":"1258337087519652","commenter_b":"Found the domestic enemy of our Constitution. As a soldier, I vowed to defend against you.","commenter_a":"Time to disband the Supreme Court. Time to hold all these people who violate our Constitutional rights accountable.","post_message":"The U.S. Supreme Court Monday handed a legal victory to advocates of banning firearms commonly known as assault weapons."}]
