[{"comment_id":"931527210240361","commenter_b":"and why do women wear make-up? Hmmmm . . . .","commenter_a":"What a gent.... NOT!!","post_message":"Look on the face of woman as Lewis Hamilton sprays champagne in her face says it all."},{"comment_id":"1633936340229657","commenter_b":"TWISTY IS REAL","commenter_a":"@username well this sounds like fun","post_message":"Residents in this neighborhood are saying creepy clowns are trying to lure children into the woods.  #MicBrights"},{"comment_id":"10153429543136491","commenter_b":"Not that it matters. A white woman would probably been cast anyway.","commenter_a":"WHY?! Are there no LATIN/HISPANIC actresses that can fill this role?","post_message":"Jennifer Lawrence will soon add another splashy biopic to her resume."},{"comment_id":"849951858441198","commenter_b":"This guy is a freakin joke.","commenter_a":"Thank you, much respect to you for not being one of the okie dokie.","post_message":"This one says it ALL!   Video by Occupy Democrats, LIKE our page for more."},{"comment_id":"10155773912215093","commenter_b":"So republicans in the 1950's can change the national motto of our country and put it on our money but in 2015 we can't have a woman on a bill? Ok then.","commenter_a":"The government takes all our money through taxes and health care se we won't ever see it anyway. Bummer","post_message":"An absolute outrage -- and here's why."},{"comment_id":"10153883413908797","commenter_b":"Wayne if weren't a firefighter then don't offer an opinion you don't know anything about, the twit woman had it coming!","commenter_a":"They didn't have to do it. .could've went over her car and just give her a ticket","post_message":"DRASTIC MOVE: Look close. That’s Yasmine’s car. The windows are smashed and a fire hose has been pulled through it. Firefighters say they had to do it to get to a house engulfed flames. And they point to what Yasmine did just minutes earlier as the reason. Do you think she has any right to complain?"},{"comment_id":"957861980892726","commenter_b":"Allowed, not aloud. Here, not hear. You're, not your. Go back to school, Linda.","commenter_a":"No one should be aloud in this country without being vaccinated period! No matter if you lived hear your whole life or your just coming in. Unless there is a medical reason it's just common sense.The risk of spreading these diseases is too high.","post_message":"The current measles outbreaks sweeping the country are the fault, at least partly, of Barack Obama lax illegal immigration practices, according to former Johns Hopkins neurosurgeon and possible 2016 GOP presidential candidate Dr. Ben Carson.   Read more at @webpagelink"}]
