[{"comment_id":"10153994126946337","commenter_b":"Loved it!! These \"Million Moms\" need to stop clutching their pearls & promptly remove the sticks wedged up their tight asses.","commenter_a":"What do you think about the show Lucifer?","post_message":"NOT HAPPY! One Million Moms is beyond ticked at Lucifer and Olive Garden..."},{"comment_id":"10152658308576680","commenter_b":"I don't know why your playing around with her. You need a special prosecutor ,this way she needs to comply or go to jail.","commenter_a":"WHY!!!??? SO she can try to hide more stuff??","post_message":"The House Committee on Benghazi has given Hillary Clinton an additional two weeks to respond to a subpoena asking for her private emails on Libya and the 2012 terrorist attacks."},{"comment_id":"1770955373137836","commenter_b":"Wow what a party","commenter_a":"Eu Cruz i might just join this","post_message":"\"I’m staying at the Hilton in Palm Springs, which is hosting the famous Dinah pool parties, and the hotel feels like a homosexual harem.\""},{"comment_id":"1213125935366328","commenter_b":"This old hoe has lost her mind.!!","commenter_a":"You can be the first one to be unprotected! Have your security do without their weapons to protect you & Bill!","post_message":"Hillary Clinton, front-runner for the Democratic Party presidential race, heartily endorsed the idea of high taxes for gun sales, along with high fees for gun dealers."},{"comment_id":"10155184641741509","commenter_b":"They wanted that sweet Brazilian booty","commenter_a":"I really think these dudes were out looking for mad hookers and they got robbed because of it LMFAO!!!!","post_message":"JUST IN: US swimmers Jack Conger and Gunnar Bentz were removed from their flight from Rio de Janeiro to the United States by Brazilian authorities, US Olympic Committee spokesman Patrick Sandusky told CNN Sports contributor Christine Brennan. Earlier this week, the two swimmers were with teammates Ryan Lochte and James Feigen, who are wanted for questioning by Brazilian police after questions were raised over their accounts of being robbed."},{"comment_id":"10155107547054258","commenter_b":"Crooked Donald! Lock him up!","commenter_a":"CNN stopped covering the rally and MSNBC with Greta from FOX ran the picture only but had a white House speaking on behalf of Trump. So, on TV we missed Warren , Bernie and others, Corporate controlled media. again ! Thank goodness for social media !","post_message":"WATCH LIVE: Democrats in Congress hold a protest at the Supreme Court against President Trump's immigration executive order."},{"comment_id":"1112791138738235","commenter_b":"1 stupid bitch","commenter_a":"Unfortunately she is right more often than not.","post_message":""}]
