[{"comment_id":"10153241305633984","commenter_b":"Stupid bitch ,,,,,","commenter_a":"Shes fucking retardes","post_message":"Wow. She is NOT doing herself any favors...  Are her critics right to be outraged?"},{"comment_id":"10153396450126336","commenter_b":"So...?? How long will the free world tolerate this... We don't need another barbaric Nazi aggression...","commenter_a":"disgusting","post_message":"A worker at a U.S.-based chemical company in France was beheaded by terrorists bearing ISIS flags early Friday, authorities said."},{"comment_id":"10153824514356336","commenter_b":"Yeah, build a wall. That'll do...uh ABSOLUTELY NOTHING.","commenter_a":"Now build a Wall and Deport the Illegals!","post_message":"BREAKING: In a 2-1 decision, the 5th U.S. Circuit Court of Appeals upheld an injunction blocking President Barack Obama's executive order to protect an estimated 5 million people living in the United States illegally from deportation."},{"comment_id":"10153486672691336","commenter_b":"What do we have in place for allowing Muslims into the United States? I would like ALL OF THEM to be on a watch list. Same with anyone else coming here to settle. Also, what are we going to do with these illegals coming over our borders?? Until you are a United States citizen you should not be receiving benefits!!","commenter_a":"Why aren't race crimes punished on both whites and blacks? I know this question will not make it due to the fear of what will be said but it needs to be asked.","post_message":"What is YOUR one question for the candidates? Fox News and Facebook are teaming up to bring you the first GOP presidential debate. Submit your question in the comments below or click here: @webpagelink to upload a photo or video. It could be featured in the debate August 6th on Fox News Channel!"},{"comment_id":"936091029833983","commenter_b":"Shut up LIBTARDS","commenter_a":"Trump 2016.","post_message":"We have a message for Donald J. Trump: We're going to do everything we can to make sure you never become president. Sign this letter if you agree: hrc.io/2aaJYl5"},{"comment_id":"10153257305683445","commenter_b":"The irony in your statement, it's because of the illegal immigrants that America discovered weed","commenter_a":"So what if be had 'pounds' across state lines..!? Life for sh*t like that when, let's see, all the illegal immigrants get to roam free and even if they do get busted they will never see life behind bars..! Our drug laws for marijuana need to change.","post_message":"HUGE News! Marijuana Lifer Jeff Mizanskey Gets Parole."},{"comment_id":"941236165936132","commenter_b":"Je vais m'y opposer a son mariage ! Ce n'est pas normal qu'il est pas pense a nous...","commenter_a":"@username il nous a meme pas invite","post_message":"Congratulations Nikki Reed and Ian Somerhalder!"}]
