[{"comment_id":"1790704097809032","commenter_b":"Pssst when's the last time the KKK has assassinated a cop in the streets? When's the last time the KKK burned down and looted their own towns? Who do you think BLM are voting for? Btw, do a Google search of who created the KKK. Democrats. Who freed the slaves? Republicans. Who passed a law allowing blacks to vote? Republicans. Who's the only candidate that voted against Civil rights? Hillary when she was a Goldwater.","commenter_a":"Yes. Except it is his supporters who are the real embarrassment. Buying into the lies of this conman. Feeling empowered, the violent white national (KKK) movement is showing itself in daylight. Embarrassment is not a powerful enough word.","post_message":"Yep.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152697342252894","commenter_b":"Having a major craptastical, mitch, attituded 24/7 365 makes him a loser!! He is a jack hole!!","commenter_a":"Father, CEO, 100+ million in album sales from his music production (Jay-Z, Madonna, Mariah Carey, Ciara, Janet Jackson etc.), 30+ million in album sales and 21 Grammys. Being successful makes someone a loser? Ok","post_message":"Petty! If You Visit Loser.com, It Redirects to Kanye West's Wikipedia Page"},{"comment_id":"10153537278823984","commenter_b":"Women in that cult are beaten and stoned and daughters married off at nine. Honor this way of life????","commenter_a":"Emperor PINOCCHIO is trying to make his MUSLIM brothers happy!","post_message":"News of this has been met with sharp criticism by many.   Do you believe the military is enforcing policies hypocritically?"},{"comment_id":"10153978466591002","commenter_b":"These are Outlaw Motorcycle Gangs..not Motorcycle Clubs..Outlaw Gangs are nothing but Thugs","commenter_a":"I am in the minority here, but I feel safer with motorcycle clubs than I would anyone else. I would not turn away of I walked into a place of business and seen club memebrs in the same place. They don't just go out and rob and kill people because they want to. You can't compare existing clubs to SAMCRo from Sons of Anarchy. This is a TV show. Hell, we should have the clubs patrol the streets. Think about that one!","post_message":"After the Waco shootout this weekend, outlaw motorcycle gangs are again in the spotlight. Roger Weber takes a look at local biker gangs: @webpagelink"},{"comment_id":"10153204502459087","commenter_b":"Mar G Her go back to mexico. this country is for LEGAL immigrants who want to be Americans.","commenter_a":"Trump is for all Americans, whether you're democrat or republican. Go Trump 2016!","post_message":"GOP front-runner Donald J. Trump continues to pull away from the rest of the Republican pack, drawing 33 percent support in the latest Washington Post/ABC News poll."},{"comment_id":"10153865845208984","commenter_b":"TRUMP IS A LIAR! TRUMP IS A RACIST! TRUMP IS A BULLY!","commenter_a":"If you watched the last debate Carson was nervous stuttered his responses I just don't think he's hard enough","post_message":"'The Donald' just ripped into his Republican rivals today and revealed the one big reason why he doesn't think Dr. Ben Carson could do the job. Some might agree that he makes a valid point...  Do you think Trump could be right about Carson?"},{"comment_id":"10154171433698701","commenter_b":"Crazy! :-)","commenter_a":"86 in Woodland, WA","post_message":"As of 2 p.m. today, Portland is hotter than Palm Springs, CA; Albuquerque, NM and Atlanta, GA! Stay up-to-the-minute with the FOX 12 Weather App: @webpagelink"}]
