[{"comment_id":"10153076244166336","commenter_b":"I could care less what that old cow at the head of the EPA says. Her job ends in a couple years. Clear out a stall.","commenter_a":"Pretty soon they'll be coin operated. $2.00 per 5 minute shower.","post_message":"The EPA wants hotels to start monitoring how long guests spend in the shower."},{"comment_id":"1121854401168903","commenter_b":"Stfu fat bitch","commenter_a":"Is it because they're assholes?","post_message":"They spend their lives eating rotten meat - so why don't they get sick?"},{"comment_id":"1140355262709675","commenter_b":"@username, I see you as the Liberal that you are, crying for this BS, but you'd be the first one to file a complaint AFTER you've been accosted by a perv in the women's bathroom.","commenter_a":"No, I'm not done shopping at Target. Do all these people really believe they'll be attacked? Get over yourselves.","post_message":"Target just announced that transgenders will be able to use any bathroom they want. I'm pretty sure they were not expecting what happened immediately after their announcement...  Are you done shopping at Target?"},{"comment_id":"10155259941361756","commenter_b":"Yep Aussie too. All true above. Totally embarrassed and ashamed ourselves and our political leaders also often call them illegal immigrants not refugees 😢","commenter_a":"Australia, please know that he does not speak for us. Thank you for your humanitarian efforts.","post_message":"The deal concerns refugees -- not \"illegal immigrants\" -- who have been housed in offshore detention centers on Nauru and other islands."},{"comment_id":"10153634339640695","commenter_b":"Randy isn't even from the south. He's a Yankee. He has no say in whether it would come down or not. Just trying to yank your chains.","commenter_a":"take that dirty monument down!!!","post_message":"Instead of removing the carving, one councilman says they should add to it to better reflect Georgia history. What do you think?"},{"comment_id":"911367582233916","commenter_b":"If she was, she wouldn't have been fired, period.","commenter_a":"I wouldn't give her a job, she will steal me blind.","post_message":"The Lead with Jake Tapper host said it is his favorite \"live TV\" moment of 2015."},{"comment_id":"910295292400057","commenter_b":"God bless that woman. Sure hope some jerk doesn`t get on her for hitting her kid. He deserved it.","commenter_a":"This is a great mother! I would have done the same thing!","post_message":"A Baltimore mother hailed as #momoftheyear after disciplining her son in the middle of yesterday's riots. That moment was caught on camera: @webpagelink"}]
