[{"comment_id":"1083798295013251","commenter_b":"The JUDGE is a woman...","commenter_a":"How stupid!!! Wonder how this guy became a judge!!! Her mother is with her!!! Who is the idiot who is challenging her contract? Hang tough Bindi!!!","post_message":"A court judge is demanding proof that the 'Crocodile Hunter' is dead.  (via Daily Mail Australia)"},{"comment_id":"10153462081617452","commenter_b":"Get a life lady!!","commenter_a":"She should be FIRED ...","post_message":"\"You're saying I can't have a hairstyle because of your culture? Why?\"  San Francisco State University is investigating a confrontation between a black student and a white student over dreadlocks."},{"comment_id":"10153512973605671","commenter_b":"It was her idea. Men don't gaf","commenter_a":"Hahaha thought this was funny Brock. Idiots","post_message":"The massive metal pieces were found in an odd place—a backyard wedding"},{"comment_id":"10153764229426323","commenter_b":"It certainly is for most women. :)","commenter_a":"To be brutally honest, the female body starts to prepare for a possible pregnancy every month growing a miniscule placenta in the womb. If the conception doesn't happen the pre-placenta is rejected as menstruation blood and all.","post_message":"\"It's relief for a lot of us to finally see periods being talked about in a frank, forward-looking way.\""},{"comment_id":"1308394922562170","commenter_b":"Go build the wall then","commenter_a":"Put them in jail and large fine, deport the illegal immigrants now, cut federal funding, build the border wall, close all sanctuary cities/schools, take care of Americans/veterans first, if they legal learn our laws, constitution, and English , this is our country and if they don't like, they leave.","post_message":"A protester burns an American flag during marches through Olympia today. Video from The Olympian.  Latest updates: bit.ly/2j3yanl"},{"comment_id":"1012561098824705","commenter_b":"The fact that this slut could possibly be our First Lady is a very important issue to me,","commenter_a":"Really people, this is what you talk about when there are real issues affecting people in the US. Shame on you. Is this what we have become as a nation?","post_message":"Conservative hypocrisy knows no bounds."},{"comment_id":"10152591855036636","commenter_b":"An attractive white girl dies. Everyone loses their minds.","commenter_a":"Oh dear . Was going to say . Oh my God . Hmmm. There are many people out there that need help . Just look around and you will be amazed . Some think that is the only way out . Look deep before before you criticise .","post_message":"Tragic."}]
