[{"comment_id":"967810213254438","commenter_b":"Phony bitch","commenter_a":"Good new Ian you can now give blood from your arm instead of your B-hole. Joe Mark and @username can give you a ride","post_message":"There's still a lot of controversy around this."},{"comment_id":"10153100917462994","commenter_b":"And crazy women too","commenter_a":"Try a tour of Detroit, New York, and Green Bay. Anyone can do Florida lol.","post_message":"\"I get treated really horribly. Actually the emotional part is much worse than any physical pain I go through.\""},{"comment_id":"10153716841688132","commenter_b":"Sorry but he's not BLACK!!","commenter_a":"Ok President Obamas mother was white.His Grandparents were white.How can white people who say he does not care about white people Really ! You r all pissed because our President is Black?thats the issue with ignorant people who continue to blame our President.Im sure George Bush would not have done anything","post_message":"Barack Obama won't be intervening in Kelly Rutherford's international custody battle."},{"comment_id":"10154163706682908","commenter_b":"The insurance companies own half our congress. That's why. Obama had to settle for the ACA. Couldn'tget them to bring single payer to the floor.","commenter_a":"The reason we spend the most with the worst outcomes is because we save people who wouldn't have ever had a chance elsewhere in the world. Our 911 system is a model for the global community and have a lots of saves who would've died elsewhere. The people that we save and live often go on to live on ventilators and long term care. Ever been to sub-acute hospital? That's where all $ to outcome ratio goes out the window. Are you going to be the one to tell someone you're pulling the plug on their ventilator because they are costing too much?","post_message":""},{"comment_id":"10153503971232464","commenter_b":"That's an awesome plan, and repeal Obamacare! Defund Planned Parenthood & NO to Iran Deal! Cruz/Trump--2016","commenter_a":"@username 2016!","post_message":"If I'm elected President, the very first thing I intend to do is rescind each of President Obama's illegal and unconstitutional executive actions! #CruzCountry"},{"comment_id":"10152735279906135","commenter_b":"If there were more moms like here this would not be happening","commenter_a":"Good for Mama!","post_message":"\"What the [BLEEP] is wrong with you?\" Baltimore mom gets fired up after seeing her son cause trouble on TV."},{"comment_id":"10153816896676337","commenter_b":"\"Bitch! Now turn the other cheek!\"","commenter_a":"Jesus needs to come back and give this Pastor a firm pimp hand.","post_message":"The Pastor leading the Starbucks red-cup charge got disconnected and laughed at on TV..."}]
