[{"comment_id":"10154236917854726","commenter_b":"Hillary must never be allowed into the White House.","commenter_a":"What about these rides on that billionnaires plane!","post_message":"Media pushes war-on-women narrative against GOP while ignoring indiscretions of Bill Clinton."},{"comment_id":"1765015350452806","commenter_b":"This tells the whole story.","commenter_a":"Why can't people understand that the Clinton's are career politicians who amassed millions for themselves while being public servants and working in government? While working \"supposedly\" for we the people, they became millionaires. The same group of 1%s Hillary rallies against she is card carrying a member of.","post_message":"Don't let U.S. Senator Tim Kaine fool you -- the Clinton Foundation is a bastion of corruption."},{"comment_id":"496937747163472","commenter_b":"Put the hag in prison","commenter_a":"I like that picture of Hilliary, \"hands up, bitch, you're under arrest.","post_message":"New documents released shows incriminating evidence that could put Hillary away for good.  She is a terrorist. We need to act now.  Should Hillary Clinton be arrested for treason?"},{"comment_id":"10153481312808352","commenter_b":"There are other things to focus on ladies. Move on now.","commenter_a":"She looks like like a 10 year old boy with boobs. Way to skinny. You need some curves. She just looks hungry.","post_message":"Woman who got super-toned in SIX WEEKS taking body selfies (and found it so motivational, she launched an app so others can do the same)"},{"comment_id":"10153803729806336","commenter_b":"Yes, and McCain and Graham were WRONG! Just like letting all these muslim immigrants into our country...we dont know WHO THEY ARE!!!","commenter_a":"Wait. You cry and cry that he has not done enough in Syria. He then sends some. And you get upset over that??? Fox / GOP supporters make zero sense.","post_message":"On \"Justice,\" Judge Jeanine Pirro slammed President Barack Obama's decision to send U.S. troops into Syria, after repeated pledges of no boots on the ground. @webpagelink"},{"comment_id":"1167345089975985","commenter_b":"The real unemployment rate is 14% and the only people seeing their wages go up are professionals. So the middle class is not seeing any sort of economic relief.","commenter_a":"the new way the jobs report is calculated was a bi-partisan effort to lower the number of unemployed statistically (94 million americans are not participating in the job market) The GDP number is now a much better statistic about the economy. That number is LOW. way to low.","post_message":"Trump says the economy is in a deep hole. The latest jobs data suggests otherwise."},{"comment_id":"10153356889206162","commenter_b":"But according to @username, only BLACKS are doing this foolishness...So I guess the Latin Kings, & the Sinoloa drug cartel, are peace-loving church groups...","commenter_a":"Im sorry but blacks enjoy killing their own over drug money gangs personal problems and ignorance. I do feel as sorry for those innocent people that have lost their lives due to the violence of this crappie city and ignorant people.","post_message":"DEVELOPING: 2 men are dead and a woman is injured after a shooting in North Lawndale: @webpagelink"}]
