[{"comment_id":"1087648897921955","commenter_b":"Strange how our country hasn't been blown to pieces if all these Muslims are strapping bombs to themselves. I see your high school education didn't get you far. Must have been a sympathy pass..","commenter_a":"Send these filthy vermin back to the cesspool they came from","post_message":"The project was \"totally different from anything the government has ever done,\" Immigration Minister John McCallum said Wednesday."},{"comment_id":"10154923446001337","commenter_b":"No I didn't miss the point Sorry somebody got killed but I live in a town that that happens every day every single day. I'm so used to it that I'm tired of hearing about it. The human species will keep killing each other forever and there's nothing nobody can do about it so why I get pissy.","commenter_a":"So fucking what. There are bigger things in this world to worry about.. it's a fucking word. Nothing else","post_message":"YIKES. The Joe McKnight case took another strange turn..."},{"comment_id":"981459371894535","commenter_b":"We need more proof than just being a female. gee","commenter_a":"This proves we need a female president !","post_message":"Justice Sonia Sotomayor cornered the conservative justices on the court by framing the Obamacare case as one of federalism vs states rights."},{"comment_id":"10154100383542452","commenter_b":"Possibly the saddest thing I've ever heard... so sorry for your loss","commenter_a":"That is so heartbreaking @username","post_message":"BREAKING NEWS: A woman who was killed when a tree fell on a wedding party at a Whittier park has been identified as the mother of the bride."},{"comment_id":"1234855006552733","commenter_b":"trump = sexual predator. You really feel ok getting behind this rapey racist creep? Wake up you ignorant fool!","commenter_a":"If you are a woman who is offended by what Donald Trump said a decade ago but you enjoyed 'Fifty Shades of Grey' and other movies and books like this than you are a hypocrite! Do you laugh when comedians talk like this or do you stand up and leave the room!?! I was not offended, I could care less what he said BS's with men in private - give me a break! I care about what he says and does now - I care about what he will do for our country! Look what Hillary did that mainstream media is covering up - her speeched released show she also refers to people as bucket of losers....has two different policies, one for public,one for private...not to mention the entire email scandal with her \"innocent\" friends all getting immunity...why do innocent people needimmunity?","post_message":"After audio was released of Donald J. Trump saying highly controversial things about women, Christian Coalition founder Ralph Reed shocked the media with a huge announcement on the Republican nominee.  Nobody saw this one coming... what do you think about what Reed said?"},{"comment_id":"1361368557222876","commenter_b":"Toni, I never commented previously so I don't know what your delusion of reality is. Trump never banned all Muslims. My buddy Wayne Allen is very capable of comprehending what the fuck Trump said. He isn't an intellectually lacking derelict who has lost his way and found himself sucking Democratic titty. What Trump stated is that he would implement a vetting procedure to insure ISIS doesn't send men in with the hundred thousand other young refugees this piece of shit Democratic government is wanting to allow in. I fight for the people, brotha. Not the government. I protect this land we walk on from those who wish to impose radicalism here. Those people are our government. I am the mother fucker that will bleed on my home soil, for the real interest of our nation, not individual interests. As far as Native Americans suffering from our conquering; yeah, well, that's ...","commenter_a":"You people are the most ignorant people around. Your even more so then the Trump idiots. Leave these people alone. You should be more afraid of your neighbors. More Americans kill Americans then Muslims do. Watch the news.","post_message":"More than 20 people were stung by a swarm of bees outside a mosque in Phoenix, Arizona."},{"comment_id":"1322936927726334","commenter_b":"Shariko ... I did call you Racist .. That has no bearing as to whether or not you attended college","commenter_a":"They are trying so hard to find him connected to that murder while they have him on some B.S. Making themselves look foolish.","post_message":"Multiple law enforcement sources explained to NBC News why a knife found on land where O.J. Simpson once lived does not appear to be connected to the murders."}]
