[{"comment_id":"1067484166661144","commenter_b":"Ignorant woman!","commenter_a":"traitor","post_message":"VIDEO: Congresswoman Stands Up For Sharia Law And Actually Gets This Disgusting Response."},{"comment_id":"10153157126101051","commenter_b":"I doubt she was a gangbanger","commenter_a":"It isn't unusual at all for a \"routine\" traffic stop to result in an arrest There are often some underlying cause to make an arrest. Outstanding warrants for priors. (Maybe that's why she was trying to make a new start in an other state) Drugs in the car, intoxication? Then resisting. There's more here. But it all hardly seems like reason enough to commit suicide. But one never knows all the reason(s) some people take their own lives. Maybe she was facing far more serious charges or problems if returned to her home state? Maybe she was trying to flee gang affiliations. Or gang threats. None of that is even given. Just the same old blame the cops and here we go again B/S story from the press.","post_message":"This woman was arrested during a routine traffic stop. Three days later they found her dead in her jail cell. Officials say it was a suicide - but there's one problem with that theory."},{"comment_id":"1151797721550248","commenter_b":"@username \"All people of Muslim faith need to be monitored ,suspend any and all travel for them born here or not .\" \" All Mexicans not here legally will be deported and any child born here who's parents are illegal will be deported \" Mexico doesn't send their best,just drug dealers and thieves. \" Maybe because I don't lick windex off of the windows of the Trumpian short bus but sounds racist to me.","commenter_a":"Good bye all the never trumps see you after you realize that not voting for trump is just another vote for hillary who no one wants. Sorry that people didn't vote for your candidate probably because they are tired of politicians saying what you want to hear and not doing any of it.","post_message":"Republican National Committee Chairman Reince Priebus says the meeting with Donald J. Trump was great."},{"comment_id":"446969245501847","commenter_b":"We need a first lady with her boobs hanging out ?? Geeeez - that is classy","commenter_a":"Beautiful family! Trump got good taste when it comes to women!","post_message":"Thank you!!"},{"comment_id":"457572411058203","commenter_b":"I hate that vile bitch. Dumbest wokman on the planet.","commenter_a":"Sarah and her offspring are all a blight on humanity and whatnot, but the dog doesn't seem bothered. That said I still wouldn't stand on a dog..","post_message":"Just when you thought Sarah Palin couldn't sink any lower, this happens. If this woman can't teach her own kids to have respect for animals, she has no business even thinking about running for anything in 2016.  ~Darrell"},{"comment_id":"10153991958186509","commenter_b":"Remember We are talking about illegal immigrants ILLEGALS","commenter_a":"Ricky Martin, go back to singing and dancing. Trump was referring to illegals....illegal is a status not a race. BTW, I'm not a Donald Trump supporter, but I can see the difference.","post_message":"Ricky Martin blasts Donald J. Trump for making \"racist, absurd, incoherent, and ignorant\" comments about Latinos. @webpagelink"},{"comment_id":"482111261979454","commenter_b":"She is in another country Germany . We have No rights there to forbid it. But in our country that's a different story all together. If swimming in a public facilities she should abide by laws of that community or township. If theme parks can refuse for you to wear cut offs then the should forbid that attire, and get out. They have more than enough money to put in their own pools. Our own laws presented by our President is destroying our country from within.","commenter_a":"This is going to far!!!","post_message":"A judge just ruled that public pools must allow Muslims to swim in 'Burkinis'.  We're tired of Muslims infiltrating our country. This stops now.  Do you agree that 'Burkinis' are WRONG?"}]
