[{"comment_id":"966056150146121","commenter_b":"Slow learners. Blacks keep voting Democratic even though Dems have done nothing but baby them and keep them down.","commenter_a":"They STILL haven't learned about the democrats !!!!!!!!!!!!!!!!!","post_message":"LANDSLIDE"},{"comment_id":"10152816476327093","commenter_b":"Learn to speak english, illegals","commenter_a":"The only crime committed by police was that they did not deport him previously when he committed prior offenses","post_message":"Even though a grand jury didn’t charge a Grapevine officer for a deadly police shooting, the family of the man killed says the case is not over…  WATCH: @webpagelink  READ: @webpagelink"},{"comment_id":"10154773746046350","commenter_b":"That is so awesome-we need more of this-people helping other people-","commenter_a":"I was in an abusive relationship with an alcoholic constantly trying to keep him out of jail, take care of our 2 young children and working as a bartender. I lost a job due to not having a sitter while their father was in jail. Little did I know, 2 people who used to come into my old employment owned a small family bar and needed help. They contacted me and offered me a job. I had only been there for a short time and my boss lent me money to get my boyfriend out of jail. After a month when I reached the end of this relationship my boss lent me his car and more money to get a place and get on my feet. He never took the money I owed him out of my check. He told me to pay when I could. Every year for 3 ...","post_message":"What's the kindest thing that someone has ever done for you? Tell us in the comments below.    TODAY is kicking off our second annual #ShareKindness campaign with a goal of inspiring 1 million acts of kindness by the new year. @webpagelink    Our sponsor The Y is helping us out by committing to the first 10,000 acts."},{"comment_id":"866091750103560","commenter_b":"What do ya expect Dennis. I go out most days an feel I'm surrounded by backwoods hicks!! It kinda sucks being from a big city","commenter_a":"Its a LED light, idiots!","post_message":"A Tennessee mom claims she saw pentagrams in her kid's school bus brake lights. She says it's a threat to God and parents should be outraged: @webpagelink What do YOU think?"},{"comment_id":"1176917475682056","commenter_b":"Well, we can let them kill Americans starting with you!","commenter_a":"I am for the mass genocide of assholes.","post_message":"A bunch of paranoid gun nuts on a mission to kill Muslims, at the advice of a presidential candidate. Is there no line we won't cross anymore?"},{"comment_id":"1202153396486746","commenter_b":"It takes 2 to tango","commenter_a":"That's not news! Thats standard procedure.","post_message":""},{"comment_id":"1729203870680375","commenter_b":"@username Hillary still lies but that's true of most people who are liars. Dr. Carson must be desperate to dredge up a case this old.","commenter_a":"It's too bad these supporters, like Dr. Carson here, doesn't go after the things that Trump says and does everyday instead of something Hillary did 35 years ago. I'll bet a lot of us could dig into our pasts and find things we could have done or said better but yet we're going to vote for Trump, who is supposed to have maturity and says the most mean spirited things any Presidential nominee has ever said and he says these horrible things practically every day.","post_message":"Another woman from Clinton's past is speaking out."}]
