[{"comment_id":"1136430346423719","commenter_b":"You color blind bitch you was raised by a punk made MF and a hoe","commenter_a":"That was fucking horrible, what the fuck are clowns at #wshh promoting this stooge for? Oh wait, he's in jail for having an illegal gun. Must be a bad as rapper now. Gtfoh","post_message":"Kodak Black was rapping about his real life struggles & facing death at only 14 years old! #WSHH #FreeKodak #KodakBlack"},{"comment_id":"10155325034607439","commenter_b":"Women will be wearing them just to be so called fashionable","commenter_a":"YUK","post_message":"Fascist fashion. It's just plain ugly. Anti-fashion, anti-woman, anti-beauty."},{"comment_id":"1113233595363485","commenter_b":"She articulated well as an advocate of the legal justice system.","commenter_a":"Yes, the role of the defence attorney is to defend and protect the client at all costs. She did. He won. It wasn't right, but she did her job.","post_message":"\"I know my role in the justice system.\""},{"comment_id":"1339079949456485","commenter_b":"She should eat it","commenter_a":"She should eat it","post_message":"Chip Roulette: Who Will Eat The Carolina Reaper Chip, The World's Spiciest Tortilla Chip, First?"},{"comment_id":"980308098739718","commenter_b":"Who in the hell watches Cnn anyways. Tell that bitch to go to there country and try an speak her mind they will cut her head off. Hopefully.","commenter_a":"More Leftist Fuckers !","post_message":"Alisyn Camerota is the CNN hack who cross-examined me after the jihad attack on our Garland free speech event, as if it had been my fault that we were fired upon by Muslims. So it is no surprise that she is calling on Americans to be sharia-compliant."},{"comment_id":"10154686785341323","commenter_b":"Clarkson and Mary Berry should do a show together. Cut from the same cloth - she's just quieter about it.","commenter_a":"Wells said sir David. We all love clarkson.","post_message":"Unnatural history."},{"comment_id":"10153099972135329","commenter_b":"Nah, I don't think I will.","commenter_a":"Someone needs to give him his balls back.","post_message":"BuzzFeed Books editor Isaac Fitzgerlad wore makeup for a week, here is what he learned."}]
