[{"comment_id":"1001040969952432","commenter_b":"Hillary says she landed under sniper fire and had to put her head down and run for cover? Hillary says she and slick Willie were broke when they left the white house? INTELLIGENT PEOPLE DO NOT SUPPORT A proven documented habitual liar for the highest office in the country TRUTH MATTERS","commenter_a":"Hillary 2016! Got my vote!","post_message":"\"I want you to remember: when you vote, when anyone votes, your vote matters as much as anybody else’s. Now, we may be up against super PACs and billionaires, but when the election comes around, Donald Trump and the Koch brothers with all their money, they only get one vote each. One person, one vote. That’s what we believe.  No one should be able to take that vote away. That’s why we cannot turn away and close our eyes from all of the attacks on voting rights that are happening right now. They don’t just threaten the integrity of our elections, although they do. They threaten what it means to be a citizen—indeed, what it means to be an American.\" —Hillary yesterday in Birmingham, Alabama"},{"comment_id":"697700797087165","commenter_b":"No refugees, there only intent to come here is to bring harm to us and destroy our country.","commenter_a":"Yes..... Take care of our own homeless people","post_message":"The refugee program has resulted in the death of two American soldiers. This is sickening. Should the US deny access to all refugees?"},{"comment_id":"10153728692094117","commenter_b":"Lol pussy","commenter_a":"Reason can go fuck itself. If you are a pro-Trump libertarian, like my page.","post_message":"\"You know−the Constitution−there's nothing like it. But it doesn't necessarily give us the right to commit suicide, as a country, OK?\""},{"comment_id":"10152949754631336","commenter_b":"Being the measles were literally wiped out in the US, it had to come from somewhere else. I propose instead of making us get vaccines, we send all the illegals back to their 3rd world countries! Hence, problem solved! Oh, I'll go to jail before I have the government make me have one.","commenter_a":"I'm old school. I remember when country was more important than individuals. I nor my children COULDN'T start school unless I had my shots. What happened? ONLY in America do we have medicine to prevent sickness and ONLY in America does vaccines turn into a political stance. I voted for so and so because of their vaccination policy. WHAT?","post_message":"\"The government believes it owns your body.\"  Judge Andrew Napolitano chimes in on the great vaccine debate. Where do you stand on the controversy?"},{"comment_id":"1225877584098936","commenter_b":"Build a wall!! That'll stop em!! Bahahaha","commenter_a":"El Chapo was there.","post_message":"The \"super tunnel\" – eight football fields in length – was discovered along the U.S-Mexico border south of San Diego.  via NBC 7 San Diego"},{"comment_id":"1045198175503230","commenter_b":"BS, keep our money home to help Americans who need it.","commenter_a":"What the??","post_message":"Obama pledged millions of dollars to fight climate change abroad.  And it comes straight from YOUR pocket!"},{"comment_id":"10153626363751336","commenter_b":"If a man wants to kill,he can kill without a gun..might as well push for knife control while you at it..","commenter_a":"That's cause he's an idiot.","post_message":"\"I've got to do something going forward that makes her life meaningful and will always be with me. And this is the way to do it.\" – Andy Parker"}]
