[{"comment_id":"486861261504454","commenter_b":"She wouldn't make a pimple on the queens ass","commenter_a":"YES","post_message":"The Jordanian Queen just put Michelle Obama to shame.  Good. Our first lady is classless. In no way does she represent our country.  Would the Jordanian Queen make a better First Lady?"},{"comment_id":"997724686914554","commenter_b":"Natenyahu, be a man and accept refugees to Israel!","commenter_a":"Hungry is right!","post_message":"A Syrian father laid to rest his wife and his two little boys in Kobani after they drowned as they tried to flee to Europe. This, as desperation and anger deepens among people escaping conflict and poverty. Read more: @webpagelink"},{"comment_id":"10156684390715354","commenter_b":"Pussy.","commenter_a":"Yikes...say goodbye to England","post_message":"Prime Minister David Cameron announced: “I want London to stand alongside Dubai and Kuala Lumpur as one of the great capitals of Islamic finance anywhere in the world.”"},{"comment_id":"1084559504898393","commenter_b":"It altars your natural hormomes! Explains why there are so many beta bitches running around. Wonder if the artificial hormones affect future children somehow too","commenter_a":"@username 😬","post_message":"Could the pill be altering your brain?"},{"comment_id":"10153356905187439","commenter_b":"Mussies I swear they're really just opressed homosexuals","commenter_a":"Bastards.","post_message":"@webpagelink"},{"comment_id":"10153822005111519","commenter_b":"It doesn't fit her","commenter_a":"Plus not just only black ppl have this done. White and other colors do 2.","post_message":"Lil’ Kim’s bleached skin and blonde hair are the tragic result of sexism, racism, colorism"},{"comment_id":"1714145238857650","commenter_b":"@username pull your head out of your buttocks. 99% of the terrorist are Muslim. Hillary wants to open up the flood gates so they can just stroll on in. Terrorism will be coming to America with them. Wake stupid!","commenter_a":"How about we stop all these moronic memes and make sure everyone is registered to vote, so he doesn't get elected!","post_message":"LOL! It's hard to disagree.  Image by Occupy Democrats, LIKE our page for more."}]
