[{"comment_id":"1757125454570252","commenter_b":"Kasich belongs to the Liberal side, lies like they do. Thank God, all has been peaceful. Stay safe Law Enforcement 🇺🇸","commenter_a":"Loved your speach, Laura. I'm so disappointed in John Kasich, Jeb Bush and other Republican leaders who are helping Hillary to win.","post_message":"The Ohio governor is still refusing to attend the convention in his home state and support GOP unity."},{"comment_id":"10153035783794877","commenter_b":"hes right yall hoes more worried about her hair then her policies..","commenter_a":"Pretty amazing the priorities of the majority of blacks. Grio post an article about a federal investigation on police, and folks talking about how the Mayor hair and lips... Then we wonder why black folks are look down on.","post_message":"The Baltimore Police Department probably isn't happy with what Mayor Stephanie Rawlings-Blake just asked for. Get the scoop below.  Grio fam, was this the right move? Will it pan out? Sound off..."},{"comment_id":"682882035184939","commenter_b":"Until the war against christians ends. All countries should carefully screen all imigrants. Period","commenter_a":"Yes absolutely!","post_message":"Our children's future is at stake! YOU DECIDE!"},{"comment_id":"10156388002150389","commenter_b":"Muslims are the problem!","commenter_a":"He was a Muslim. What else is there to know?","post_message":""},{"comment_id":"1088416937887089","commenter_b":"The bill won't pass....however, illegals vote any way. There are organizations who are illegally registering them. Absentee ballots are also one of their goals.","commenter_a":"The American people doesn't want this law to pass..it is unfair to the American people! !!!! They dont pay taxes and most doesn't even speak English. ..They dont have a right to vote....And they shouldn't get any kind of welfare either....","post_message":"THE PARTY OF CRIMINALS: New Bill To Give Illegals Right To Vote!  Do you agree Illegals have NO rights, especially voting rights!?   @webpagelink"},{"comment_id":"1297424046964731","commenter_b":"Not a Christian. He's a low-life creep!","commenter_a":"That doesn't sound very much like what Jesus would say","post_message":"WOW!"},{"comment_id":"10154419020458812","commenter_b":"@username check your facts. You're showing how ignorant of the law you really are. IF it happens, remember that's all part of what YOU wanted.","commenter_a":"The people allowed leadership into power who passed the bill. Vote them out or put pressure on them. You, the people are responsible. So losing out on economic activity and entertainment is the price. Soon comes loss of education funding. Whats more important?","post_message":"JUST IN: Maroon 5 canceling upcoming shows in North Carolina because of the recent passage of the HB2 legislation. \"Everyone should be treated equally.\" @webpagelink"}]
