[{"comment_id":"10154142695231378","commenter_b":"Jesus for president!!!!","commenter_a":"This loser is not my President !!!","post_message":"#LIVE: President Obama holds first news conference since election."},{"comment_id":"914001441995307","commenter_b":"Awsome woman!","commenter_a":"Barry Sheldon this was what I was talking about earlier","post_message":"BREAKING VIDEO: Mother Beats Her Son When She See Him Rioting in Baltimore  Mother of the Year Award? She goes straight hood on her son.   @webpagelink"},{"comment_id":"10153105977467098","commenter_b":"YUP!! We always Been Here!! Who the Real Illegals!!","commenter_a":"Every race that is not latino or native american is an illegal inmigrant or descendant OF an illegal immigrant latinos ARE from this continent OF AMERICA... North central and south AMERICA ANYONE else their ancestors came on a boat across The Ocean and The atlantic ALL WE Did WAS cross an imaginary Line Lmao.... americans huh..... WATCH WHO u call a wet back we didnt have to cross The atlantic TO GET here wet backs","post_message":"Donald Trump would not say how he would locate, round up and deport the 11 million undocumented immigrants he says must go."},{"comment_id":"922573247835730","commenter_b":"Two women had enough of him, despite his wealth, and headed for the hills.","commenter_a":"I dont understand how a man with everything can be filled with so much hatred","post_message":"Yep, that just about sums up Donald Trump's campaign.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"667207133381416","commenter_b":"She should be fired!!","commenter_a":"Should absolutely be fired!!! This is a prime example of how sad our society is!!!","post_message":"VA Manager Thinks Veteran Suicide Is Funny, Here is Her INFURIATING Email Read more at @webpagelink"},{"comment_id":"10153323990951509","commenter_b":"Certainly makes most if the rest of us look very lazy","commenter_a":"@webpagelink WATCH THE ABOVE YOUTUBE VIDEO LINK.THIS IS THE BREAKING NEWS I WAS TAKEN IN HEAVEN AND SHOWN THE TRUMPET BEING BLOWN AND JESUS COMING VERY VERY VERY VERY FAST AND VERY VERY SOON. THIS IS THE LAST WARNING.JESUS IS COMING FAST AND SOON Ezekiel 3:27 But when I speak to you, I will open your mouth and you shall say to them, 'This is what the Sovereign LORD says.' Whoever will listen let them listen, and whoever will refuse let them refuse; for they are a rebellious people.","post_message":"He trudged the better part of a marathon each workday. Donations poured in for the Detroit man whose daily commute is a 21-mile walk: @webpagelink"},{"comment_id":"10153733713798984","commenter_b":"Amen. And with the way that woman looks, she'll be working the counter at McDonalds.","commenter_a":"If you can't or won't do what your job requires, then find another job.","post_message":"The husband of Kim Davis wants to send a message to the judge who jailed his wife, and he only needs six words to do it. He is not at ALL happy with what is happening to Kim, but it is clear that he and his family are not going to back down from their beliefs.  Do you support Kim Davis and her family?"}]
