[{"comment_id":"1250005395092512","commenter_b":"Damn, please fire her & throw her in jail.","commenter_a":"Ugh...","post_message":"Just another day in America."},{"comment_id":"10153889343021770","commenter_b":"i bet she tried to touch trump with her boobs..","commenter_a":"Lmao liberals","post_message":"BREAKING: Karena Virginia, a yoga instructor and life coach, appeared at a press conference Thursday morning accusing Donald Trump of touching the inside of her right breast in 1998."},{"comment_id":"1304158649677186","commenter_b":"Pretty woman with a dirty mouth, ,, Perfect Clinton supporter","commenter_a":"Trump had this election stolen. He rigged it. He tampered with an election. That is punishable by law. Why isn't he being prosecuted? His evidence is on his computer. Why haven't they confiscated that and checked it out? This is a joke!! This whole voting system is a scam. We the people have no rights in our voting. Trump was right. It is rigged...in his favor!","post_message":"This is a must read for every disappointed Democrat."},{"comment_id":"836575966473062","commenter_b":"Crooked Hillary is the scum of the Earth","commenter_a":"His campaign is a trainwreck.","post_message":"Meet Trump's new campaign chief: a man whose \"news\" organization, Breitbart, is known for its racist, homophobic, conspiracy-peddling stories."},{"comment_id":"10152629894111519","commenter_b":"It is my business when you try to regulate contraception based on a book of myths, try to keep kids from learning factual science based off a book of myths, and try to keep people from marrying there loved ones based on a book of myths. Keep religion but don't ask for tax's breaks, don't try to teach kids pseudo science and don't knock on my door asking me to believe. A free country is where people can get elected even if they don't believe, a free country is where any two consenting adults can marry, and women can choose what they do with their bodies. This is not a perfect union, yet but well keep pushing forward while you try to stop rational thinking.","commenter_a":"Turning people against their own beliefs in an attempt to get them to believe yours. This is what you accuse religions of doing. Hypocrite much?","post_message":"Bill Maher makes a compelling case for secularism..."},{"comment_id":"10154992075558256","commenter_b":"I agree","commenter_a":"Nobody equates \"America First\" with WWII references anymore - most of that generation is no longer alive. If you walk up to the majority of Americans on the street they will not be able to identify that historical reference. You are stretching for a story here.","post_message":"The phrase galvanized a mass populist movement against U.S. entry into WWII. While it attracted a wide array of support, its highest profile spokesman, Charles Lindbergh, blamed American Jews for pushing the country into war.  Trump started using the slogan in the later months of his campaign, and despite requests from the Anti-Defamation League that he drop it, he stuck with it."},{"comment_id":"826467044152094","commenter_b":"Is Hillery totally without fault? Let's look over her speeches. Hillery would say \"WHAT DIFFERENCE DOES IT MAKE!\"","commenter_a":"Give it up Matt . Hey Matt how about Hillary apologize to the American people for all the lies she told and those four dead Americans she left to die in Benghazi 😡","post_message":"NBC's Matt Lauer is still OBSESSED with Melania Trump's speech. #RNCINCLE"}]
