[{"comment_id":"10152884498052293","commenter_b":"not really","commenter_a":"This is the internet they cant ban anything.","post_message":"Sad Keanu? Nope. And sad Putin? Absolutely not."},{"comment_id":"10153373196639877","commenter_b":"Girl bye !","commenter_a":"SIT UR FACT AZZ DOWN ..AINT GONNA HAPPEN .","post_message":"Wendy Williams wants Terrence Howard fired from 'Empire' because of past abuse allegations. Check out the video clip below.  Grio fam, what do you think of Wendy's remarks? Sound off."},{"comment_id":"1187848264597052","commenter_b":"Do you want to be responsible for a bus full of kids? Better to keep them home than risk it","commenter_a":"Why don't people buy chains? I don't get it","post_message":"JUST IN: Per the Flagstaff Unified School District, all FUSD schools will be closed on November 29th due to icy road conditions."},{"comment_id":"746713225519255","commenter_b":"KEEP THE FLAG UP!!!!!! OFFENDED??? GET THE HELL OUT!!!!!!!!","commenter_a":"This is the USA. The American flag will fly at my house every day. If they don't like it they can leave","post_message":"Texas man ordered to take down American flag because it offends Muslims. In our country we fly our flag. This is absurd. Do you think this is ridiculous?"},{"comment_id":"10152969085332623","commenter_b":"Lock up your wives.","commenter_a":"Filling out that trophy case.needs that one for the set!lol","post_message":"Tiger Woods has entered to play in next week's Wyndham Championship in Greensboro:"},{"comment_id":"10153689476229411","commenter_b":"^your a dumb bitch lol","commenter_a":"Neo nazi sentiments are riseing in europe includeing islamaphobia and alittle anti semetic retoric. This is a reality. I dont care if u agree or dont its happening. People say get rid of the immigrants that have refugee status and those fleeing war zones and this intolerance will end. No it wont. This is a deep rooted problem of european ethnic supremacy masked. Its disguised well and they sure convince alot of people of there philosophy from people like madam blavatsky. And her race based ideology. Whats fueling race and ultimately religious intolerance is low birth rates from the native peoples of europe so they blame immigrants even tho the state subsidizes births in europe. Neo fascism is gaining ground because of this wacky race based fear and economic troubles. So the nazis are mixing both messages pointing it at immigrants and they do get violent. They dont only want ...","post_message":" is disrespectful is the political reality in Europe that people, suffering so greatly hand, over thousands of euros and must take such unsafe routes while for the rest of us Europeans it is so easy  to travel in the other direction\""},{"comment_id":"10154081807932212","commenter_b":"Women are not a minority.","commenter_a":"The DNC proves once again that dividing the people is their mantra. These women are being used and they do not even know it. The Democrats are using these women the same way as they use all minorities. It's disgusting..... @webpagelink","post_message":"#WomensMarch OK about to begin at the Capitol. Grant Hermes News 9 says an OCPD officer just estimated up to 6,000 people there right now. #News9"}]
