[{"comment_id":"1289659341093811","commenter_b":"So someone stole a car that means they deserved to get raped? Sickening","commenter_a":"But you stole and you went to prison, perhaps you shouldn't steal so that you can practice your transgender in your house","post_message":"Horrifying.  (via Daily Mail Australia)"},{"comment_id":"10153712266449199","commenter_b":"Nutter psycho...we need her out on the streets ..","commenter_a":"She killed him...we all know it..","post_message":"BREAKING:  Hung jury in Jodi Arias case, judge will now decide her fate"},{"comment_id":"10152911974179071","commenter_b":"I dont think you really listened to his speech. He said they meaning mexicans!! illegals or not he is still refering to the RACE!! Are RAPIST!!! That alone is disgusting to label mexicans that are trying to find a new country.","commenter_a":"He didn't express hatred for Mexicans. He expressed hatred for the illegal immigrant problem Mexico presents the U.S. with. Those are two very, very different subjects.","post_message":"Behold, the Donald J. Trump piñata."},{"comment_id":"10154346437467464","commenter_b":"Because of Ted and politicians like him, we are going to have Hillary for president. There won't be a America left for another president. They will bring in millions more illegal aliens that will vote democrat and the republicans will be an endangered species.","commenter_a":"Too bad Cruz's Pride is giving it away to the democrat socialist party!!!","post_message":"Texas is blessed to be home to so many of our men and women in uniform, and El Paso’s Fort Bliss is a crucial base for those who serve on the front lines to keep our entire nation safe and secure."},{"comment_id":"1291146050978446","commenter_b":"I really like this nasty woman VOTE BLUE>","commenter_a":"I love Senator Warren! She is a ball buster and has no problem getting her point across. We need more like her in the Senate. Go Elizabeth.","post_message":"She's had it with the hypocrisy and double standards..."},{"comment_id":"10152967093391051","commenter_b":"Your a heartless bitch","commenter_a":"Waaahhh","post_message":"Since school officials refuse to do anything about her bullies, this teen is now turning for help elsewhere."},{"comment_id":"10153986318004071","commenter_b":"Still I could look up plenty more lyrics","commenter_a":"But he just did a commercial with little yachty which doesn't make sense 🤔🤔. In lil yachtys biggest song he saids ''tell her I can get that pussy easily''. Wake up sheeple","post_message":"LeBron James is speaking out against Donald J. Trump's 'locker room talk.'"}]
