[{"comment_id":"10157348799105354","commenter_b":"Liberals shouldn't be allowed to breed..","commenter_a":"Yay! We can murder the helpless!","post_message":"Here are their celebratory pro-abortion tweets..."},{"comment_id":"496037443910043","commenter_b":"MR TRUMP WHEN YOU BECOME PREZ> HANG A FEW DRUG DEALERS ON COURT SQUARE THEN THEY WOULD THINK TWICE ABOUT SELLING DRUGS TO YOUNG CHILDREN AND DESTROYING ENTIRE FAMILIES!!!!!!!!","commenter_a":"Get them out!!!!!!!!!!!!!!","post_message":"Drug dealers are pouring in from the southern border. We will build a wall on time and on budget. #GOPDebate"},{"comment_id":"10153072554446037","commenter_b":"Feed her to the hogs","commenter_a":"Bye bye","post_message":"#Jordan will execute Wednesday a woman on death row over a failed bombing after the government vowed to avenge the murder of a pilot by the #IslamicState group, an official said."},{"comment_id":"10152859650389877","commenter_b":"Girl, bye.","commenter_a":"It looks like there's another sign that says \"Down\" so, I'm hoping the other sign, which we can't see, says with... Would spell out \"Down With White Power\". I'm curious to know what the colors of the other team are?","post_message":"High school students flash 'white power' signs at basketball game. Read what happened next below.   Grio fam, what should the punishment be 4 this ignorance? #soundoff"},{"comment_id":"10158081616760603","commenter_b":"@username Lame.","commenter_a":"Well I had sushi last night lol","post_message":"Any fish eaters out there? The most popular fish on your plate could be carrying a tape worm"},{"comment_id":"822379027897898","commenter_b":"How will she do that? She is one of the causes for the problem !!!!","commenter_a":"No they just rather let America be filled and run by people who hate America.","post_message":"“We are not going to be Donald J. Trump’s hate-filled America. Not now, not ever.”  Sen. Elizabeth Warren told a fired up crowd that Hillary Clinton will fight to end discrimination in America."},{"comment_id":"10153683223480575","commenter_b":"Leave my country!","commenter_a":"You got to be kidding.","post_message":"Pig books now banned.... They might offend Muslims."}]
