[{"comment_id":"10153751767926135","commenter_b":"Burn that bitch.","commenter_a":"Obama will appoint her a Czar!","post_message":"She's accused of stealing to pay for expensive cars, a motorhome and even vacations."},{"comment_id":"10154766887574199","commenter_b":"What's his out of state criminal history? 50k for even felony Malicious Mischief is absurd. He's got no in state history.","commenter_a":"they got me y'all i should have never came down","post_message":"Prosecution had asked for court to set $100,000 bail; judge set it at $50,000"},{"comment_id":"10153335788334714","commenter_b":"Still a bitchh","commenter_a":"They named it the failed \"parenting\" tree in honor of welfare checks, EBT cards, and Section 8 vouchers.","post_message":"The trees were chopped off at the trunk"},{"comment_id":"10153876506189726","commenter_b":"Alas, McCain's time as a politician has lasted too long--- in fact, it was too long the day he took office.","commenter_a":"Tell McCain to shut up","post_message":"WATCH: John McCain Has Doubts About Ted Cruz's Citizenship"},{"comment_id":"10154964809584522","commenter_b":"That is very much understood that was real wow","commenter_a":"What a beast! If only the Saints' defense could move like that and cover that much ground!","post_message":"See video of the massive tornado that caused serious damage throughout New Orleans East. Here's another shot of it from another angle in the Michoud area. (Video by Aundra Woodfin)"},{"comment_id":"10153173606151602","commenter_b":"Hartford rules, its a silly name just like every other name in the minor league. The only difference is that its unique and stands out a bit because it's so absurd. I'm still going to have to fun.","commenter_a":"I feel like I am constantly defending Hartford - telling people how far the city has come, and all of the neat things there are to do here. But this? This, I cannot defend. I was super excited for this stadium, and now, for the first time, I am truly embarrassed for and by this city that I have grown to love. Temporary attention that derives from a stupid name doesn't breed long term community commitment. It just gives jaded locals more things to complain about, instead of taking pride in their city. Such a shame.","post_message":"After weeks of waiting, we now know the name of Hartford's baseball team."},{"comment_id":"1797253250554324","commenter_b":"Tax the nfl that might cut into some of the players money lot of overpaid jerks. Funny how middle Americans love this country and those zeros will not embrace it. I see problems not the countries fault it's the politicians, take care of it at the polls.","commenter_a":"I'm done with the NFL you guys play a game and earn millions piss on all of you who disrespect our country!!!!","post_message":"BREAKING NEWS...."}]
