[{"comment_id":"10156924432505354","commenter_b":"No! What people do sometimes astounds me!","commenter_a":"@username did you hear about this?","post_message":"Tree Hugger Causing Seattle Traffic Back Up  “Issue appears to be between the man and the tree,” Seattle police tweeted...  #ManInTree"},{"comment_id":"10156175589090354","commenter_b":"Arrogant hateful ole hens that arent worth the waste of time!!","commenter_a":"Liver Transplant Recipient of 4 1/2 years. The Doctors saved my life in surgery but the Nurses kept me alive and watched over me and I would not be here without them. Bless them all.","post_message":"The #NursesUnite movement is mobilizing against liberal co-hosts of \"The View\" Joy Behar and Michelle Collins.   But now, new arrogant and elitist behind-the-scenes comments are coming to light and sparking further uproar with nurses across America..."},{"comment_id":"10153521877313822","commenter_b":"That skank!","commenter_a":"She has an incredible voice.","post_message":"JUST IN: The NFL announces that Lady Gaga will perform the National Anthem at Super Bowl 50.    SUPER BOWL COVERAGE: @webpagelink  What do you think of the choice?   (Gareth Cattermole/ Getty Images)"},{"comment_id":"10153169789203855","commenter_b":"She's a self-hating traitor.","commenter_a":"I thought Caitlyn was a Republican -- not at all a liberal. I'm sure I read that. Maybe Rush thinks party change is part of gender reassignment.","post_message":"A hateful man."},{"comment_id":"559542634171067","commenter_b":"Attack Attack Attack !! We will give you something to cry about. Sieg Heil !","commenter_a":"Some of us have been warning of this for quite a while. People are not thinking. They are emoting feelings.","post_message":"He would know…"},{"comment_id":"10153265076161602","commenter_b":"They're asking for regulations--there is no compromise from the gun lobby.","commenter_a":"I think we can all agree that there are some people that should not have firearms. However, if you support the second amendment like I do, you need to be part of the solution. Because if we let those that are against the second amendment make the policies, what do you think will happen to 2A? Let's be proactive in this, not reactive.","post_message":"The families made it clear they are not associated with the non-profit Sandy Hook Promise."},{"comment_id":"843353782366711","commenter_b":"Not soon enough I cannot stand she's a pathetic liar a disgrace to our country","commenter_a":"Oh please let it be! Haven't we suffered enough?","post_message":"Hillary EXPOSED!"}]
