[{"comment_id":"10155047636614657","commenter_b":"AND SHE WANTS EVERY WOMAN TO BARK LIKE A DOG !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Should every single woman in America have a federally mandated abortion, too? Is that where we're heading?","post_message":"A specious, simplistic pander."},{"comment_id":"10153706067582490","commenter_b":"tell them to come get they're money!!!!","commenter_a":"please remember they hold 46% of our debt right now, sure dont to piss off the banker","post_message":"SENDING A MESSAGE: The Navy plans to send a warship to directly challenge China's recent aggression."},{"comment_id":"424515887751925","commenter_b":"Kick her out if she won't wear the uniform","commenter_a":"Sorry sweetheart, you cannot honestly believe we who are proud of our Marines are going to consider your sensibilities against our men. Grow up.","post_message":"Liberal Chick has really lost it. Marines in uniform are now offensive? This is cuckoo for cocoa puffs."},{"comment_id":"10152586371551135","commenter_b":"This is unacceptable. We need to stand up and love one another despite differences! Isis has definitely scared a lot of people. It would be nice if the Muslim community would make a statement in response to the killings around the world. Just to declare they are different of the terrorist and that what Isis has done is wrong. Then I think there would be a better understanding of Muslims. But even still there will remain evil people , like this man at Kroger. I'm constantly praying for our world. The world needs love. The world needs God. Blacks against whites. Whites against Arabs. Muslim against christian. Oh God help us all!!!!!","commenter_a":"Kelly Sleiman!!!!!","post_message":"Dearborn Police are investigating the beating of an Arab American man inside a local grocery store.  Police have also contacted state & federal officials to help investigate the attack.  STORY: @webpagelink"},{"comment_id":"949147745161454","commenter_b":"Nancy Pelosi said on the House floor that 30 million people were uninsured in the United States. After Bummercare, we were told that 40 million Americans were still uninsured. One year later, we were told that 55 million Americans were either uninsured for under insured. Islamic religion prohibits insurance because they claim it's gambling and are exempt from getting insurance. With the current influx of refugees and people sneaking into our country and getting free medical, welfare and food stamps, how many millions are now in this country unisured or under insured? Why would anyone bother to get insurance? Hospitals still take patients, doctors still see patients, and medicine is still sold at the pharmacies. If no one has insurance, costs will immediately be adjusted and negotiated at a lower cost. People will stop running to a doctor for every sniffle.","commenter_a":"amazed it lasted as long as it did, now the states are left holding the bag right along with those folks who tried to abide by that totally damaging obummercareless law.","post_message":"Oh Not Again! 400,000 Americans Enrolled In Obamacare Need To Find A New Plan"},{"comment_id":"1138545752861116","commenter_b":"Yes I want her and her friends out of my Country!","commenter_a":"They are lying liberals what you expect","post_message":""},{"comment_id":"10153830910205695","commenter_b":"Unfortunately he's correct. Totes second ship found some things in the ocean that they believe belong to el faro","commenter_a":"It's obviously on the bottom of the ocean.","post_message":"Loved ones aren't giving up hope, despite a life ring being found."}]
