[{"comment_id":"10154856564546438","commenter_b":"Fake IDs fake visas...so why are we sure illegals never voted?? Illegals pose threat because of how much they owe coyotes that families back in Mexico maybe threatened if they dont run drugs for cartels...Trump is right to close this border.","commenter_a":"Ooooo","post_message":"\"You notice the Republicans are not saying, 'Hey, those aren the facts,' or 'something has changed,' or 'he did all these other things afterward.' No, what they saying is, 'You don get to talk about that.'"},{"comment_id":"10154242349186336","commenter_b":"Darwin is going to get this woman one day soon.","commenter_a":"stupidity !!!!!!!!!!","post_message":"\"This woman is extremely lucky. We can’t explain why he didn’t get up.\""},{"comment_id":"10153376704131051","commenter_b":"Someone needs to beat her the same way","commenter_a":"Dear God in heaven. God bless this poor child.","post_message":"Officials couldn't believe that someone would treat a child like this."},{"comment_id":"10154442937338690","commenter_b":"@username sunni Arabs do not deserve a state.","commenter_a":"Since Iraq invasion, the people have only seen bloodshed, division and their oil is stolen. I guess, this is what 'divide and conquer' looks like!","post_message":"More than 200 people were killed in Iraq's capital, Baghdad, in a suicide bombing attack claimed by ISIL"},{"comment_id":"10153902236123812","commenter_b":"The native Americans should have stopped accepting immigrants. They wouldn't have lost millions of life's by those terrorist immigrants!!!","commenter_a":"ISIS doesn't need to be in America. Has everyone forgotten about the mass shootings that happen almost every day now? They can easily recruit here and never step foot on American soil. Blind hatred is still hatred.","post_message":"LATEST: Mississippi joins Ohio, Florida, Illinois, Indiana, Louisiana, Arkansas, Michigan, Alabama and Texas in refusing to accept Syrian refugees in wake of #ParisAttacks."},{"comment_id":"10153128102178145","commenter_b":"NO! She is a murderer!","commenter_a":"only if she tells the truth about what really happened..oh yeah she doesn't know how to tell the truth!!","post_message":"She's been called the \"Most Hated Woman in America\". Now you may soon see Casey Anthony on TV again.  Would you watch her interview? #WFTV  Read more here: @webpagelink"},{"comment_id":"10154017627642217","commenter_b":"that would be too easy haha","commenter_a":"@username @username We all know his motives","post_message":"The Saudi teen who could face years in jail for striking up a friendship with an American girl over the internet. (via BBC Trending)"}]
