[{"comment_id":"1097247357003041","commenter_b":"Bitch please","commenter_a":"These cops did nothing wrong. They asked him why he was filming and they were trying to protect there fellow officer. Everyone needs to stop hating on the police.","post_message":"We just received this, these cops are ABSOLUTE CHILDISH BULLIES! Full details: @webpagelink They got right up in his face like they were looking for a fight, they have ZERO respect for anyone outside of their little gang."},{"comment_id":"1748877948703805","commenter_b":"Always been there for women? She doesn't even pay equal to men in her own foundation and campaign. Bernie's \"socialist destination\" is s fulfillment of FDR's vision. Hillary will fulfill the Koch brothers and Walton family's vision. I don't revere poverty, nor do I support buying an election and using electoral fraud to gain office. No, Bernie won't \"part the Red Sea,\" but the electorate he is inspiring will effect a revolution.","commenter_a":"It seems to me that the Super Bernie people are caught up in useless passion over issues that are neither new or original. I distinctly recall when Mrs. Clinton went to capital hill and pitched for universal healthcare on live television. She was eaten alive, but she stood her ground as she has on the grassroots level many many times. She's always been there for women especially where wages were concerned. And there is so much more. Mr. Sanders is not a bad person but it is a bit disinginuous to ride the democratic train to get to a socialistic destination. It's also unfair to insist that anyone who has made the system work for them is a bad person. Bernie is no more deserving of reverence for the money he doesn't have than Hillary for the money she does have. She worked for hers' and he worked for his. ...","post_message":"Time to unify the party."},{"comment_id":"1132943900117478","commenter_b":"Knock that bitch down when he gets in your face. Trump 16","commenter_a":"What a bunch of disgusting, vile, ignorant, hypocritical, liberal scumbags!! Totally revolting behavior typical of the left with absolutely NONE of the \"tolerance\" they preach for anyone who disagrees with them!! Sickening!!","post_message":"Liberals try to portray themselves as the voice of \"tolerance.\" You'll realize just how \"tolerant\" they really are when you see this video, where they made a SICK move at a meeting that supported Donald J. Trump.  This is the REAL face of the left, folks... America needs to see this."},{"comment_id":"10154362431207293","commenter_b":"@username She may surprise you.","commenter_a":"Pennsylvania must be filled with idiots. The KKK and White Supremacists have always held high number of members in that state","post_message":"“Put in Trump and we’ll win again,\" one voter said."},{"comment_id":"1287351561304298","commenter_b":"Pneumonia?! Doubtful!!! Maybe her conscience raised its despicable, dishonest head and gave her a little peak at her destiny - a one way trip to spend eternity in Hell - now that ought to make her swoon!!! Still...Doubtful!!!","commenter_a":"Just another lie...","post_message":"New News Is Hillary has pneumonia.  FOR THOSE WHO WERE OFF THE GRID TODAY MOST, here is all you need to know about Hillary's \"medical episode\"  (aka fainting) during the 9/11 ceremonies in NYC.  All the videos you need to see:  @webpagelink"},{"comment_id":"10153547475163812","commenter_b":"it is just showing Obama is gay and that monkey guy he calls a wife now can be legal","commenter_a":"so nig","post_message":"White House lit in rainbow colors following US Supreme Court ruling that same-sex couples have right to marry: @webpagelink"},{"comment_id":"10153840727706341","commenter_b":"Not allowed in Israel!","commenter_a":"Hmmmm,its agreed if the Arab (Muslims)will condone their daughters marrying a Jew husband.But how about the Jews too?will they agreed their daughters to marry an Arab?","post_message":"More than half of the French-Muslim adults surveyed would react positively if their daughter married a Jew."}]
