[{"comment_id":"554226841431375","commenter_b":"Hillary is the dispicable one calling Millions of Americans all kinds of names that do not want her for President . So save all your outrage for Hillary , oh that's right . You hypocrites don't have a problem with Hillary doing it and yourselves as well . Shame on you Debbie and all like you .","commenter_a":"The nasty, inconsiderate, unemphatic comments are disgusting & shame, shame on everyone making them. Hillary has run herself ragged & not surprised she's got pneumonia. Coughing a lot lately. She's exhausted. No wonder. Be careful what you say because it'll come back to you tenfold. #KARMA","post_message":"JUST IN: Hillary Clinton was diagnosed with pneumonia on Friday, her doctor says. The doctor revealed the condition hours after Clinton stumbled while leaving a 9/11 event. @webpagelink"},{"comment_id":"1238572816162746","commenter_b":"...aaaaaand to jail this woman will go.","commenter_a":"A real action star. Give him an oscar award!","post_message":"Watch the moment a suspect hit an officer's car with her SUV during a high speed chase. The officer escaped with only minor injuries.  Full story: @webpagelink"},{"comment_id":"10154944041488700","commenter_b":"They are ALL criminals!! It's why they are called ILLEGAL aliens!! All must go!","commenter_a":"If your illegal you will be going ...remove all the illegals criminals and violent sex offenders welcome to the deplorable nation of deportation to keep America safe","post_message":"\"Let me repeat this: Our country, not theirs. It is our country. And we are not going to leave,\" said Jorge Ramos to the Spanish-speaking audience."},{"comment_id":"10153680141531077","commenter_b":"Safe.","commenter_a":"So sad that we need this kinda security for the Super Bowl.","post_message":"How would all this security make YOU feel?"},{"comment_id":"1707816392795801","commenter_b":"Kim Kardashian is a fucking douche, she and her asshat husband need to go the fuck away.","commenter_a":"Pity the no talent wannabe Kim Kardashian. Her only claim to fame is exhibition. So sad.","post_message":"Bette Midler isn't going to like this."},{"comment_id":"10154431713909411","commenter_b":"It would be good only if happen in America, Israel, Saudi Arabia, Turkey, England or some another war spreading and terror supporting country. All what happen in peaceful countries is bad and for regret. Thos who spread death around world, deserve it back in they own country.","commenter_a":"Good.","post_message":"BREAKING: Accident happened in Hualien County on Taiwan's mountainous eastern coast"},{"comment_id":"1696699610390161","commenter_b":"She deserves prison put her there please then we won't have to see that disgusting face of hers","commenter_a":"Total investigation","post_message":"Does she deserve to go to PRISON for breaking the law?"}]
