[{"comment_id":"10153438882926130","commenter_b":"That's rape !!! Lmfao !!!! Jk","commenter_a":"I am a Viking woman. I don't play any games when it comes to sex. I don't try to look sexy when I want it. I go up to my man and take it.","post_message":"Terry Crews completed a \"90-day sex fast\" with his wife and it left him \"more in love\" and \"more turned on\" than ever."},{"comment_id":"1586196515000795","commenter_b":"Then duck tape her ugly ass mouth","commenter_a":"she's just another stupid liberal bitch, who doesn't deserve to live in this country. she shold go live in some isolated place, where her rants and raves can go un-heard.","post_message":"Way to go Tom Selleck. Rosie is just so rude."},{"comment_id":"10154141762806162","commenter_b":"Wild animals!!!!! trump is the wild animal causing all this bs PIED PIPER !!!","commenter_a":"People need to stop blaming Trump for the actions of low life people. They get out of hand, then don't want to own up to their actions. It's the generation of placing the blame elsewhere. Trump didn't tell them to act like wild animals. That's just how they act.","post_message":"\"We're going to take our country back from 'these people,'\" Trump told supporters after his canceled Chicago rally. \"These are bad, bad people.\""},{"comment_id":"10153237393021350","commenter_b":"Great idea but this lady ain't fat...","commenter_a":"You look fantastic!!","post_message":"This mom has become a swimsuit role model."},{"comment_id":"10152788579600736","commenter_b":"Yes, dumb ass lady","commenter_a":"Good!!! @username Kevin Heard","post_message":""},{"comment_id":"688684917923527","commenter_b":"Bye Lil bitch","commenter_a":"Damm bye @username","post_message":""},{"comment_id":"854121244730702","commenter_b":"No need to fear - strong, intelligent, powerful women can purchase their own contraceptives or better yet save something special for marriage and then raise the next generation of Americans.","commenter_a":"Dumbass use your butt.Save a child from being liberal.","post_message":"Lena Dunham is absolutely terrified of Trump and his views on abortion."}]
