[{"comment_id":"10154822738529369","commenter_b":"You know she had to be shitting her pants up there","commenter_a":"Shell be alright it another Trump curve ball","post_message":"A Clinton campaign representative told NBC News that the campaign had \"no idea\" what Comey was referencing in the letter he sent Congress on Friday."},{"comment_id":"1759728807637196","commenter_b":"Vicente Fox..You're not welcome in OUR Country!!","commenter_a":"Good then you'll get what you deserve 😉","post_message":"The former president of Mexico, Vicente Fox Quesada, says Donald J. Trump is using his visit to Mexico with President Enrique Peña Nieto to boost his sinking poll numbers. @webpagelink"},{"comment_id":"1510863505601322","commenter_b":"Probably the shittest article to ever feature on ifl, absolute horse shit","commenter_a":"Read the article! It should say vitamin pills are not necessary, a balanced diet provides all you need","post_message":"Some vitamins can actually be dangerous - but these are the ones worth taking, according to the available evidence."},{"comment_id":"1751204798479851","commenter_b":"thiswoman has onebrain cell and it dont work","commenter_a":"If Nancy had a brain her Face Lift wouldn't Sag So b","post_message":"Nancy Pelosi blasted her Republican colleagues for not taking action on gun control, saying after every shooting there is a moment of silence, which means nothing without action. Pelosi states \"a moment of silence just left there is a moment of denial.\" Do you agree?"},{"comment_id":"879835912051831","commenter_b":"I wish her big mouth would go away ; what a disgusting woman","commenter_a":"A message for Rosie. It is one thing for people to think you ignorant and it is another for you to open your mouth and prove it.","post_message":"Tom Selleck is awesome!"},{"comment_id":"10153530483933872","commenter_b":"We are tired enough of the lies and deceit and are going to vote you out- both of you wicked queens of the damned!","commenter_a":"Oh no, Patty! Why do you have to endorse Hillary? Disappointed that you don't #feelthebern","post_message":"It's great to see Hillary Clinton focus on this critical issue for our families, our economy, and our future."},{"comment_id":"942704895828117","commenter_b":"Wow your a cold heart bitch With a small dick","commenter_a":"A druggie died of an overdose with assistance from his mom and grandmother - unfortunately only he died and not all of them.","post_message":"The teen's mother and her mother face multiple charges."}]
