[{"comment_id":"988837027845081","commenter_b":"It seems to be about control imo. Religion has had so much control in history that by taking a little bit away they think the world is persecuting them. In my opinion they should let gay people do what they want just like they think Muslims should mind their own business about others eatting pork.","commenter_a":"wow - I am honestly confused as to how gay couples marrying really affects your lives? whether it be against your religious beliefs or whatever your reasons are for hating these people, does it truly affect how your life is going? There are so many other things in this world that should be worried about, like how our veterans are being treated and cops being stalked and killed, does two people being in love and wanting to be married change your life? and btw, no, I am not gay. I would just rather see more love in this world than hate and violence.","post_message":"North Carolina and Utah Laws Allow Clerks to Refuse Same-Sex Marriages  More than 30 magistrates in North Carolina have legally refused to perform weddings for gay couples.  @webpagelink"},{"comment_id":"920923791276376","commenter_b":"She is a scandal ridden low life scum.","commenter_a":"What does this say about Hillary Clinton?","post_message":"BREAKING - Hillary Clinton's Sex Scandal"},{"comment_id":"10154378006503352","commenter_b":"What is a thot?","commenter_a":"Why do they have to call her a thot??? Ridiculous article","post_message":"New photos of Amber Rose Doing Naked Sunbathing Indicate She Might Have Been Wearing Booty Pads All Along – Her Behind Disappeared! (PHOTOS)"},{"comment_id":"1409742245732910","commenter_b":"Pitiful woman","commenter_a":"Is she d","post_message":"Perhaps if she listened to Louisiana’s governor instead of right-wing rags, she’d understand better."},{"comment_id":"10156331517060725","commenter_b":"hurry up become our president and get rid of these thugs","commenter_a":"A Muslim is one born to a Muslim father who takes on his or her parents' confessional identity without necessarily subscribing to the beliefs and practices associated with the faith. In non-Muslim societies, such Muslims may subscribe to, and be vested with, secular identities. Reminder: Obama father was a Kenyan born muslim. ----- al-Taqiyya: deception; the islamic word for concealing or disguising one beliefs, convictions, ideas, feelings, opinions, and/or strategies. Islam Permits Lying to Deceive Unbelievers and Bring World Domination! Muslims lie when it is in their interest to do so and will not hold them accountable for lying when it is beneficial to the cause of Islam. They can lie without any guilt or fear of accountability or retribution. A lie in the defense of Islam is approved even applauded in their books.","post_message":"Under our President, ISIS is gaining great strength."},{"comment_id":"583735078458513","commenter_b":"Mike( @username) what makes these kinds of statements so hateful and racist in that it taxing the ancestors of one group for the actions of the ancestors of another group. The probabilities are just as likely that your ancestors dies freeing the slaves or were not even in America in the mid 1800's or that fella demanding the free $ had relatives that sold the Africans to the slavetraders. That's how it was done. Africans selling other Africans to the traders. Throughout history all groups and races enslaved each other. Many believe the pyramids were built by slaves under the direction of African Masters. Let's try it Dr King's way by judging people by their character not color. That chip on ones shoulder can get quite heavy!","commenter_a":"No","post_message":"All White People Owe Us Reparations, 'If You Don't Give It, We Are Coming To Take It' [VIDEO] They are demanding that we give them money for their ancestors slavery. Will you pay African Americans reparations?"},{"comment_id":"992882130761178","commenter_b":"#__ #__ #StopYazidiGenocide #StandforYazidiWomen","commenter_a":"@username: .","post_message":"A behind-the-scenes look at a historic night. hrc.io/269ym4J"}]
