[{"comment_id":"584420751713216","commenter_b":"STOP muslim immigration permanently !","commenter_a":"Yes!!!! And not just muslins!!!!","post_message":"Question of the Day: Should we halt Muslim immigration until the federal government can get it under control?"},{"comment_id":"10153831418716336","commenter_b":"The wall is a good thing and will create thousands of jobs on both sides of the border. It will diminish drug trafficking and illegal entries. Trump has many options with regard to financing this colossal project. Furthermore, there will be no need to round up and deport millions. Simply register and background check everyone that is here illegally. Anyone beyond the dead line to register will be deported when discovered during routine traffic stops for example. The remainder should pay into the system until they complete the legal entry process, whatever that may be.","commenter_a":"Bryan NY Chow","post_message":"\"It's not only deportation. It's building a wall, and I mean a real wall. Mexico will pay for the wall.\"  Tonight on \"Special Report with Bret Baier,\" Donald J. Trump explained his plans for dealing with illegal immigration. @webpagelink"},{"comment_id":"10154742011562908","commenter_b":"Stfu","commenter_a":"Raise taxes on corporations they either go overseas or pass the expense on to the consumer. Bernie can't tax enough to pay for free everything.","post_message":""},{"comment_id":"10153444962923984","commenter_b":"Yes since he is their best muslim buddy","commenter_a":"Duh Yeah","post_message":"Well, this is worrisome. It's bad news for pretty much the entire Middle East, except for ISIS.  Do you think Obama has entirely botched the ISIS situation?"},{"comment_id":"10153402845063352","commenter_b":"Sheila cant make a hoe a housewife lol","commenter_a":"Sheila Ryan Jonathan omg","post_message":"Boyfriend Sets Up GoFundMe Account Begging For $325 to Follow Girlfriend to SpringBreak to Make Sure She Doesn't Cheat!"},{"comment_id":"10154121936472894","commenter_b":"Yes... trip his ass!","commenter_a":"I don't understand why some dudes so quick to wanna shoot at other dudes over money & drugs.. BUT NO ONE HAS SHOT THIS FOOL YET! Some thug nigga, PLEASE COME BE MVP. Make that sacrifice. 😂😂😂😂","post_message":"George Zimmerman Kicked Out of a Bar After Calling the Manager a Ni*ger Lover"},{"comment_id":"10156351998640354","commenter_b":"NO HE IS NEVER GOING TO BE A WOMAN. BORN MALE ALWAYS MALE JUST A TWISTED FRANKENSTEIN MONSTER THAT OUGHT TO BE SHOT. @username","commenter_a":"NO MEN IN DRESSES IN ANY LADIES ROOMS ANYWHERE IN AMERICA. EVEN IF HE HAD HIS GENITALS REMOVED.","post_message":"How upside down is the world when this even had to be voted on in the first place?  That said, LOOK at the percentage of Houston voters who voted for and against this..."}]
