[{"comment_id":"10153937111420695","commenter_b":"Girl you got something to be thankful.","commenter_a":"God bless","post_message":"“Everybody at the church got up and started handing the preacher money, and it was just crazy. So many people got up. They started hugging me. It was just awesome. I couldn’t help but cry. It was just amazing,” the mom said."},{"comment_id":"1120776417932667","commenter_b":"Whoop-te-do! What an earth-shattering piece of news that is! One loser endorses another loser... ho-hum.","commenter_a":"the end of Jeb","post_message":"Lindsey Graham endorses Jeb Bush for president"},{"comment_id":"10154350131948145","commenter_b":"Yeah they'll definitely be jailed, they can track everything now","commenter_a":"@username, yep another one. Unbelievable!","post_message":"Hopefully they got to it before identity thieves did."},{"comment_id":"10154105809967908","commenter_b":"Feel the Bern! Gonna be the first time I vote thanks to this man Bernie2016","commenter_a":"Yes, it is appalling.","post_message":""},{"comment_id":"10153377171751320","commenter_b":"scumbag","commenter_a":"When he is in need, they should all turn their backs on him again,but for good. He stinks as a Mayor . 👎🏻","post_message":"ACTIONS SPEAK LOUDER THAN WORDS... NYPD Officer Brian Moore was shot in the head, killed in the line of duty and Mayor de Blasio was a no show at his death announcement. Click here to read why he said he wasn't there: @webpagelink"},{"comment_id":"855184514566047","commenter_b":"Oh, he wont' do that - she's white.","commenter_a":"I Jeb Bush should set up a public shaming.","post_message":"What are your thoughts about this tweet about Bristol Palin, Sarah's daughter?!"},{"comment_id":"1031660353527286","commenter_b":"I dunno, it seems like America went from a pretty nice country with polite, religious hardworking people to lazy, angry mean spirited race conscious materialists since those days. So I think there is nothing to celebrate in this 40 year decline since then.","commenter_a":"I am surprised the director of this movie which claims it is historical, heard recording of 1964 meeting between LBJ and MLK and knew Johnson cared deeply over black voting issue but she depicted him as indifferent! Why would she do that? I hear LBJ daughters and aides are furious!! We should all be!!!","post_message":"Our so-called #CivilRights president: I am surprised the new Selma Movie omits the Obama connection—oh wait, there isn't one!"}]
