[{"comment_id":"987118551371296","commenter_b":"These women did it LEGALLY.","commenter_a":"There's a difference between illegal immigrants and legal immigrants.","post_message":"Trump's ex-wife agrees with his immigration policies... even though she's an immigrant."},{"comment_id":"10154163706682908","commenter_b":"The insurance companies own half our congress. That's why. Obama had to settle for the ACA. Couldn'tget them to bring single payer to the floor.","commenter_a":"The reason we spend the most with the worst outcomes is because we save people who wouldn't have ever had a chance elsewhere in the world. Our 911 system is a model for the global community and have a lots of saves who would've died elsewhere. The people that we save and live often go on to live on ventilators and long term care. Ever been to sub-acute hospital? That's where all $ to outcome ratio goes out the window. Are you going to be the one to tell someone you're pulling the plug on their ventilator because they are costing too much?","post_message":""},{"comment_id":"10154593663574342","commenter_b":"Okay, she looks stupid with that dress, you ain't royalty Girl... that's something Kate would wear smh...or the Kennedy","commenter_a":"just hate the way he acts , cant even wait for his wife","post_message":"First Lady Melania Trump is wearing a sky blue, mock turtleneck Ralph Lauren dress as she walks into St. John's Church with President-elect Donald J. Trump.  Watch #Inauguration Day live-->@webpagelink"},{"comment_id":"992170134153660","commenter_b":"She is a nasty, vile woman...","commenter_a":"What about the part where it was not illegal to have that information on a private server you could have debunked it as well","post_message":"\"Ahead of the #DemDebate, this is the video Hillary doesn't want you to see.\" - Reince Priebus."},{"comment_id":"10154241809909411","commenter_b":"@username yes they can. They feel more comfortable in turkey then Europe. Lots of racist people giving them dirty looks in Europe.","commenter_a":"Europe should consider making a deal with Greece rather then Turkey who is playing its proxy war over Refugee crisis.. European Parliament Greece is honesty and has no evil or greed sort of motive behind this cause. They can handle refugees better then turkey. Who by the way is taking advantage of the European Parliament by making a deal and asking a free hand to strike and bomb Kurds who are basically fighting ISIS which turkey is making it hard for kurds by attacking them and making it easy for ISIS to freely invade other save areas of Iraq and Syria..","post_message":"'People detained on Lesbos and Chios have virtually no access to legal aid, limited access to services and support, and hardly any information about their current status or possible fate'"},{"comment_id":"10153973009181409","commenter_b":"Considering Hillary shouldn't even be allowed to run she should be the one stepping down","commenter_a":"Then he should step down from running ... it's the right thing to do","post_message":""},{"comment_id":"10153971160946320","commenter_b":"@username - LOL. That's ok. Some people need a little help to find their funny in the morning.","commenter_a":"The moment you realize the Jon Stewart photobomb.","post_message":"Retired firefighter Ray Pfeifer was honored at City Hall for his work in persuading Congress to extend Zadroga Act benefits for thousands of 9/11 first responders suffering from 9/11 related illnesses.  Thank you for caring and fighting for what was right. Read: @webpagelink"}]
