[{"comment_id":"10153444924104312","commenter_b":"Because it would cost pharmacutical companies lots of money if they didn't have cancer and other illnesses. Basically, all it is is reducing the amount of acid you put into your body from drinking soda, etc. They even make stuff you add to your water to alkalize it. Things like soda, obviously, and even milk although it is alkali in the container, once ingested it turns acidic and wreacks havoc on your body. Lemons, albeit acidic on the outside actually turn alkaline once ingested. You can actually look up guides to acidic and alkaline type foods. If you go to a Walgreens, health store, or wherever and pick up a roll of test strips in the health aisle, you go home, pee in a cup/container, dip the test strip in and look on the chart to see how much acid is in your body, then you take the steps necessary ...","commenter_a":"Want the cure? Eat right and use alkaline test strips until you test as alkaline as possible. Cancer feeds off the acid in the body, the more acidic you are, the better chance of the cancer spreading. If you are alkalized, cancer has nothing to feed on.","post_message":"A young woman has become the first person in the world to give birth to a healthy baby using ovarian tissue that was removed and frozen when she was still a child."},{"comment_id":"1770955373137836","commenter_b":"Wow what a party","commenter_a":"Eu Cruz i might just join this","post_message":"\"I’m staying at the Hilton in Palm Springs, which is hosting the famous Dinah pool parties, and the hotel feels like a homosexual harem.\""},{"comment_id":"10154809272254714","commenter_b":"Says a female....smh","commenter_a":"Shows the ignorance of those who can't be bothered to do their research at this time in that country...and instead ,waste their energy having hissy fits on issues that are harmless, while they invite the she devil herself to continue destroying them... Mercy...","post_message":"It will cost between $3,000 and $10,000 to fix the damage.  (via Good Morning America)"},{"comment_id":"10152977557517217","commenter_b":"Lady*","commenter_a":"Beautiful England Rose, Princess Diana.....","post_message":"Princess Diana, lion cubs & space safety fears - This Week in History: @webpagelink #bbcrewind"},{"comment_id":"10153209729066051","commenter_b":"I am a woman but if you not respect the man, specially on from of so many people, how do you spec, he is going to do. My friend you said what you WANT sorry you heard what you DESERVE.","commenter_a":"He has the right to his opinion and here we go again with Kelly, supposedly a conservative, telling someone that they don't have a right to say what they think. War on women, isn't that a liberal jab or stab...you bet it is. Keep talking Mr. Trump and you may win my vote, too!","post_message":"Donald Trump just got banned from a GOP Presidential debate because of this comment about Megyn Kelly."},{"comment_id":"456122197909407","commenter_b":"Evil beast","commenter_a":"And that black power flag of the black panthers.","post_message":"OKAY THEN..."},{"comment_id":"1207705529241702","commenter_b":"@username the majority of Americans correctly believe these people are nothing more than an a animal. They are correct","commenter_a":"Christian values are under attack. The moral fiber of our country.","post_message":"\"The 'struggle for LGBT rights' in America is and has always been nothing more than a pretext for the complete disenfranchisement of Christians.\""}]
