[{"comment_id":"10153592600809607","commenter_b":"@username Many Americans want the wall. Unless they are not here legal ofc....","commenter_a":"#Trump2016 Trumping along and Making America Safe and Great Again #VoteTrump and vote often #Winning #WinningTeam #2A #Gunrights #Love #GOD #Family #TrumpTrain #FreeMarket #Religion #Veterans #Freedoms #BillIOfRights #Constitution #Liberty #FencePaidByMexico #TruthHurts #FreeSpeech and #RealJobs for Americans with a sweep in all 5 states!","post_message":"\"As far as I'm concerned, it's over,\" said GOP front runner Donald Trump. \"I consider myself the presumptive nominee.\""},{"comment_id":"943377485718781","commenter_b":"Never Bernie. This Latina will vote for Hillary.","commenter_a":"@username mil veces mi voto para ti..!!","post_message":"\"Para el Señor Trump, solo tengo una palabra.\""},{"comment_id":"10153814688651337","commenter_b":"Fox might dump it if these rating keep up.","commenter_a":"Nah since fox has money.","post_message":"YIKES!   This big ratings drop should concern all Family Guy fans..."},{"comment_id":"10154623133343812","commenter_b":"maybe you cheat a wife","commenter_a":"Bill stated how wonderful a wife Hillary is...question...why did you have all those affairs then Bill???","post_message":"JUST IN: Tim Kaine officially wins the Democratic vice presidential nomination. @webpagelink"},{"comment_id":"10153903054649753","commenter_b":"good ...she needs you to buy a ticket....unless she has already been forced to cancel all...","commenter_a":"of course she loves him....who ever heard of her before Blake....her new on tour being canceled for lack of sales suprise?????","post_message":"Blake Shelton started his 40th birthday celebrations with a cute note from Gwen Stefani. “Happy birthday to my favorite person I ever met @blakeshelton,” Stefani posted on Twitter. According to People, Stefani and Shelton’s PDA didn’t stop there. Stefani went on to share several messages to Shelton on Twitter and even changed her avatar to a photo of her country boyfriend. On Instagram, Stefani shared a photo of Shelton as a kid with the caption: “Happy birthday to @blakeshelton literally my... @webpagelink"},{"comment_id":"10153284422191323","commenter_b":"White people are often unaware of their privilege as it is invisible a lot of the time. Happened to me when I got pulled over by a cop for cutting in front of them. I got an angry warning. If I were black, there's a better chance I would have gotten a ticket. I'm not 100% white, but eh, close enough in terms of looks to get the benefits of privilege most of the time. Except at hoity toity Connecticut country clubs.","commenter_a":"Do you understand now white folks?? Its not about you as a person but the system that programs these prejudice biases into you without you knowing consciously.... So when we speak out about institutional racism and bias...its not a direct knock against you as ppl but the fabric your ancestors created and is still maintained today.....","post_message":"Racism is a business. Its marketing is so successful that even Akala looks sideways at a young black man holding a lot of cash"},{"comment_id":"10153132641871051","commenter_b":"Wow marla racist much? What else can we minorities thank you whites for?","commenter_a":"REMOVE YOUR HEAD DRESS!!!!!I!!!YOU'RE IN MY COUNTRY NOW HABIBA!!!!!!❤","post_message":"The police told this woman: take off your head scarf or you’ll be sorry. She didn’t take it off."}]
