[{"comment_id":"1204773886285528","commenter_b":"Stridency is an anti-female word. Women are supposed to be quiet; it they are not, they are \"strident\". What you mean is they are being impolite by interrupting. I agree with that. Nicolle Wallace should think twice before she goes up against Rachel; however, that's what she is being paid to do.","commenter_a":"The stridency of the women on the panel, Rachel Maddow and Nicolle Wallace, that they use to interrupt each other and Eugene Robinson (they rarely allow him to finish a sentence) continues to be an annoying distraction to what could be a very useful and informative conversation.","post_message":"Follow our live blog for the latest updates! #Decision2016"},{"comment_id":"504677803025508","commenter_b":"Can't stand Mcain","commenter_a":"John Mccain almost crying because he's losing his beloved mercenaries under Russian airstrikes - @webpagelink","post_message":"What is really going on?"},{"comment_id":"1349219015129494","commenter_b":"Stfu","commenter_a":"Trumpers 2 days ago: yay Castro is dead! yuge win for free speech and human rights! CheetoJesus: citizens whom use their rights of free speech and ability to protest should be jailed or deported! Trumpers today: praise our Dear Leader! deport those commies!","post_message":"A fiery debate erupted over President-elect Donald J. Trump's proposed penalty for burning the American flag"},{"comment_id":"1713989815484209","commenter_b":"The Senate's duty is to listen to its constituents. Therefore it should or should not act on this matter based on what they know we want.","commenter_a":"Oh how quickly Obama forgot that he filibustered the nomination of Supreme Court Justice Samuel Alito in 2006. Hypocrite!","post_message":"\"I have fulfilled my constitutional duty. Now it's time for the Senate to do theirs.\"   WATCH: President Barack Obama says if the Senate does not vote on SCOTUS nominee Merrick Garland, \"our democracy will ultimately suffer.\""},{"comment_id":"515543338636246","commenter_b":"Go home","commenter_a":"Absolutely...","post_message":"These Muslims thought they could do this, big mistake.  Good. This is America, they need to learn their place.  Do you support these Muslims being thrown out of the building?"},{"comment_id":"10153939365405329","commenter_b":"Las lamparas y el cosito para escurrir los cubiertos <3","commenter_a":"Invente o si te gustan los elefantes @username","post_message":"Because elephants are beautiful and lovely and perfect. (via BuzzFeed Animals)"},{"comment_id":"10156340374100354","commenter_b":"You my dear are a moron who is helping to destroy your people.","commenter_a":"Scumbag.","post_message":"\"Safe negro\"?!  Can you IMAGINE the FIRESTORM liberal media would have generated had a conservative said this?!"}]
