[{"comment_id":"1048601445225209","commenter_b":"I know... she has effectively modeled pant suits for old bags of dirt","commenter_a":"So tell me and please be honest what has Hillary done for America like a policy or a law or something that has benefited us you know she's been in politics for over 25 years been the first lady and a senator and Secretary of State what actually has she done for us and don't use her as an example.","post_message":"What our president says matters. We can't let Donald J. Trump's hateful words speak for us."},{"comment_id":"1901824630047376","commenter_b":"Meant to be","commenter_a":"Catherine her name... :)","post_message":"She’s a Republican college student and she’s proof that marching is about more than politics. #WomensMarch"},{"comment_id":"10153231600851491","commenter_b":"Well the last 3 harry Potter movies should had been directed by a woman then","commenter_a":"thats not how sexism works. Sexism is if there are qualified female directors available to direct, and they choose to hire a less qualified male director. If there are no qualified female directors available thats not sexism","post_message":"Emma Watson: \"I have been directed by male directors 17 times and only twice by women.”"},{"comment_id":"10153848371885779","commenter_b":"Not*","commenter_a":"RS, why in the world does a music magazine now consider itself a forum for serious topics and an authority on what people ought to think? You are obviously pushing a liberal agenda when Noone with any sense is turning to you for any of this. Go cover a Backstreet Boys reunion show and leave these matters to serious adults in unbiased forums.","post_message":"At last night's #VPdebate, Mike Pence explained that his faith controls his position on abortion. But Pence's stance is nothing short of cruel toward women."},{"comment_id":"10155199620894411","commenter_b":"Unlike in shithole Islamic countries pedophiles actually go to jail here, instead of marry them. Get dunked on bitch.","commenter_a":"Ah yes, Islam propaganda to tell women to embrace their own slavery & destruction.","post_message":"Protesters claim that the full-face veil is an instrument of women 'self-empowerment'"},{"comment_id":"1081326848578752","commenter_b":"Should have been impeached a long time ago. I will believe it when I see it","commenter_a":"No I don't agree on that or anything he ever says. He should have been gone a long time ago.","post_message":"Former House Majority Leader Tom DeLay told Newsmax TV  that if President Barack Obama implemented a plan to require background checks on some gun sales by executive order and without congressional approval, the House should consider impeachment proceedings. Like, Share and Vote in Newsmax’s online poll: Do you support Obama’s gun control? Respond here: @webpagelink"},{"comment_id":"10154299130956077","commenter_b":"Trump women are hot","commenter_a":"Shots everytime trump stutters or says he has property there","post_message":"Hillary Clinton and Donald J. Trump meet in St. Louis for the second presidential debate."}]
