[{"comment_id":"417366948387900","commenter_b":"Hey rhino you want amnesty, and the DOJ candidate Obama and Holder want , your one of five republicans and who would negotiate with a terrorist country ? In sorry you won the election here in SC , your a R HINO ,","commenter_a":"Good point ...........we should be negotiating with Iran!","post_message":"Lindsey Graham has some harsh words for Rand Paul."},{"comment_id":"10156234250125192","commenter_b":"Nope she belongs to a group.","commenter_a":"I think a gofundme acct should be set up for HER bravery for standing up for our children. (In my case grandchildren). This testing bs in today's teaching in beyond rediculous. The \"common core\" math is crazy. My 12 yr old grandson just got a low grade in math and son in law said he doesn't understand it. There are mire letters than numbers in his math class. He is getting what we had in advanced 12th grade and it is just too difficult for that age to understand and too busy testing for tests to see what he doesn't understand. I pitty Florida kids in public school. Something needs to change before we lose more teachers like this. Please start teaching our kids to love learning and let our kids learn to love learning.","post_message":"A Polk County teacher recently resigned, citing what she calls 'educational malpractice,' resulting from too much standardized testing:"},{"comment_id":"10155027837294411","commenter_b":"I am trying to learn you that you can't blame a whole religion on the wrongdoing of one person.. It's like blaming denmark for a crime a danish man did in Spain... And you are still rude and can't spell.. Please go back to school and learn english and grammar... And maby move to an island with all your other nazi racist friends...","commenter_a":"What??? In most of europe these markets has nothing to do with christianity, but with shopping... Stop trying to divide people based on religion... We all know how you hate muslims now... And maby you should think that the western world, and Russia is bombing and killing the shit out of the middle east... Could be a reason for the hate you know...","post_message":"'A Christmas market which is a Christian symbol is a classic target for Islamic jihadists' (Op-Edge)"},{"comment_id":"10152829771848271","commenter_b":"But she's a good girl out to hurt no one. I call BS!","commenter_a":"For all you saying \"She didn't deserve to die.\" So it would have been better if the police office was killed!? Where are your morals people. But when that thug comes knocking on your door who are you calling?","post_message":"The Denver medical examiner's office said Jessica Hernandez also had marijuana and a small amount of alcohol in her system during the Jan. 26 shooting that sparked protests and calls for an outside investigation. DETAILS:"},{"comment_id":"1776830319009844","commenter_b":"Maybe Cat is looking for a sanctuary city for cheap labor .","commenter_a":"Thanks","post_message":"Hardworking men and women from Peoria have always taken great pride in knowing their community has been home to Caterpillar, and there’s no denying this news is a real blow. Two years ago, I joined with officials from across our region as Caterpillar announced its intention to expand its footprint and keep its headquarters in Peoria – so this news comes as a shock. Our local economy is tied to the success of Caterpillar. My hope is that Caterpillar will keep the promise it made today for Peoria to remain its largest manufacturing site. I stand with all Peorians in expressing my deep disappointment with this decision."},{"comment_id":"10153563067675667","commenter_b":"@username Americans are seeing the true colors of Democrats. Most are trash that don't pay taxes. They live off the taxpayers!! They riot. They block traffic. They destroy property. They commit the majority of crimes.","commenter_a":"Democratic TRASH. The party of thugs, Illegals and criminals. The trash of America. The more you riot. The more we want Trump 2016!!!","post_message":"At least 35 Trump protesters were arrested in San Diego. @webpagelink"},{"comment_id":"635677536633830","commenter_b":"Demons","commenter_a":"@username read the top comment 😂😂😂","post_message":"Name it!  #WSHH"}]
