[{"comment_id":"494539450746362","commenter_b":"one ugly woman","commenter_a":"Cruz started this slanderous crap and it backfired on him. But he is still trying to blame Trump for a rags publication. But he's right about one thing, we don't give a shit so he can shut the hell up about it. Trump has already moved on.","post_message":"Carly Fiorina accused Donald Trump of being a serial philanderer. Do you think there's any truth to it?"},{"comment_id":"10153394437991336","commenter_b":"Illegal aliens aint welcome to merica deport them back!!!","commenter_a":"Univision responds to Mexico or the US? These guys are wrong. AMERICA first! If you dont like it, go back.","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"10153777739548690","commenter_b":"But the don't need people like you black monkey","commenter_a":"Long live Israel long live the Jews... I just wish i was an Israelite so i can walk into the occupied west bank and tell those occupying Muslim extremist that God gave that land to the Jews... Jews fight for their right...i love the Jews with my life. God bless Isreal.","post_message":"Inside Story: Israeli government leaders have repeatedly said they don't want changes at the Al-Aqsa Mosque in Jerusalem.  Israel is also accused of funding groups advocating major changes to who can pray at the sacred and sensitive site in Jerusalem.  What are the implications of Israel action? And with growing discontent in the occupied Palestinian territories, is it a recipe for more unrest? @webpagelink"},{"comment_id":"614623428725949","commenter_b":"Should of shot the bitches in the fu$king faces, enough of this shit with these animals","commenter_a":"They are racist.","post_message":"Burqa-Clad Muslims Sue For “Racist” Treatment… Get a RUDE Wake Up Call"},{"comment_id":"10158052080890594","commenter_b":"@username Stop being dramatic. Trump's own wife is an immigrant. The only issue is with those here illegally. They should be deported under existing law.","commenter_a":"As long as you are here legally, there's nothing to fear.","post_message":""},{"comment_id":"10152845458146336","commenter_b":"you must be of yourr meds you moronic female","commenter_a":"A million and a half babies aborted each year in the United States and we are horrified by this?","post_message":"Zookeepers were horrified to discover 5-week-old cubs had been killed and eaten by their mother."},{"comment_id":"10153554692703984","commenter_b":"There's whores in all races, and drug dealers don't going stereotyping with that bullshit!!!","commenter_a":"A American should have right before any one from another country, should speak English and love the American way it's not just Mexican it's all.trying to bring their laws. Sorry America needs to stand up and fight for what's right.","post_message":"Hispanic employees were furious after this employer implemented this new rule, so they decided to sue.  But the employer won't be stopped. He says he has a good reason for doing this and they need to get over it...  Do you support the employer's decision?"}]
