[{"comment_id":"10156358709930725","commenter_b":"She's deserves to rot in hell.","commenter_a":"Allie Stoltenberg @username","post_message":"Police are investigating a pet owner after a Facebook post of her dog muzzled with duct tape went viral ----> @webpagelink"},{"comment_id":"10152601048042061","commenter_b":"till she open`s her stupid mouth.......again !!!!","commenter_a":"I love this photo. Most models would be posing and trying to be the focal point. I just adore the fact that stunningly gorgeous Giselle has her hat pulled down and is pointing at Tom, and not stealing a bit of his thunder. What a great couple they make!","post_message":"Coming in at number 3 in the  News midday buzz  see how Gisele Bundchen and Tom Brady and their kids celebrated the Patriots AFC Championship win: @webpagelink"},{"comment_id":"1037623106257736","commenter_b":"Many foreigners are required to take English in school unlike Americans.","commenter_a":"if you want to go to murica you have to speak engrish","post_message":"A study found that 77% of immigrants have high school diplomas and over 40% graduated from college."},{"comment_id":"1208640665842055","commenter_b":"#NEVER HELLARY CLINTON !","commenter_a":"Be careful. People who cross the Clintons have a strange way of \"committing suicide\" by a few \"self inflicted gunshot wounds\" to the back of their heads.","post_message":"CROOKED HILLARY really SCARED  @webpagelink"},{"comment_id":"917042908355458","commenter_b":"Shut your moaning you wench","commenter_a":"so all three of them are showing themselves to be dickheads!!! i hope to god they dont get another show. may and hammond are basically saying its acceptable to punch an employee! DISGRACEFUL!!","post_message":"Top Gear's May and Hammond ‘WILL quit with Jeremy Clarkson’"},{"comment_id":"317547525326742","commenter_b":"To pay the illegals","commenter_a":"GREAT NEWS!! You just keep spiking those taxes..why stop there..RAISE TAXES ON EVERYTHING....YOUR GOING TO NEED IT! Besides..dont you left winged morons believe in taxing yourselves into welfare?? Good job!! GO CALIFUCKUP!!","post_message":"Robbing Peter to pay Paul..."},{"comment_id":"10153656983536813","commenter_b":"Straight up asswipes.","commenter_a":"Lazy , sloppy police work, just pin it on anybody to close the case","post_message":"Children should get to talk to a lawyer before they are interrogated by police."}]
