[{"comment_id":"1809017339318525","commenter_b":"happened in bosnia too.","commenter_a":"...not the only nor first time.","post_message":"These cowards sat back and did nothing for 4 HOURS while this was going on!"},{"comment_id":"1664084467202646","commenter_b":"Then I would campaign for congressional term limits Allow the country to decide if abortion is to be legal or not. The same with gay marriages. The supreme court should not be involved in these maters. If the is challenged and reversed. So be it. I would not allow mass illegal immigration. Illegal is wrong by definition. As to radical Muslims. Not welcomed. Peaceful Muslims who migrate legally are welcomed as long as they assimilate . And do not try to impose sharia law. This country has its laws made by its citizens. If you come here. You need to assimulate. I would ask for voter IDs. Driver license are not proof citizenship. Sorry.","commenter_a":"I would dump Obama care and replace it with something that makes sense. Eliminate the following depts. Education, environment and agriculture. TSA homeland security plus the irs. Treasury dept can handle collecting a flat tax. Eliminate the federal minimum wage. No need for the federal govt to be involved in these areas. Then I would walk away from the Iran nuke deal and global warming. Bad policies. Then I would invite the Mexican president to the white house and bitch slap him. Cut the budget across the board by 10% for each of the 1st 4 years Have a flat federal tax of 17.5 on everyone. Period. No deductions. Nothing. Flat. Period. I would then review all of BHS executive orders and reverse or modify what I decide what is needed.","post_message":"If you were president what is the first problem you would address?"},{"comment_id":"891542370901815","commenter_b":"Behead the shitbag goat fuckers","commenter_a":"Hehehe","post_message":""},{"comment_id":"997885863556217","commenter_b":"LOL -like a woman has time for that","commenter_a":"That was a woman who was all masked up","post_message":"The clinic staff say they aren't going anywhere"},{"comment_id":"10154414773758279","commenter_b":"@username what makes you think that? Drones ARE killing civilians. Listen to the video again.","commenter_a":"A few more of this resignations and Obama would be forced to admit that he is on the immoral side of history. This could be an effective form of civil disobedience.","post_message":"Watch: U.S. Army Reserve Chaplain Capt. Chris Antal reads his resignation letter to President Obama."},{"comment_id":"10154655136218984","commenter_b":"Makes you wonder why she's riding in a van! Not very comfortable and certainly not presidential.","commenter_a":"Not a Hillary fan but have you ever tried getting out of one of those van back seats?","post_message":"There's some new footage of Hillary Clinton making the rounds, and it's exactly what her campaign does NOT want America to see. Here's what happened to Hillary when she tried to get out of a van.  This confirms a lot of things that we'd feared about the Democrat nominee..."},{"comment_id":"838486396292823","commenter_b":"I know how is she sleeping with the light on it should be a heat lamp!!!","commenter_a":"drink :D","post_message":"Late night eaglet stream!  Thankfully baby E9, Harriet and M15 will be warmer tomorrow!  Where are you joining us from this evening? @webpagelink  Pix courtesy Southwest Florida Eagle Cam"}]
