[{"comment_id":"1081030328612686","commenter_b":"Go bang your mother with a mace","commenter_a":"All you people saying taxation is theft are such complete morons. Taxation is a membership fee to live in the USA where we have benefits that greatly outweigh the cost. Why don't you renounce your citizenship and gtfo out of the USA and move to Antarctica if you don't want to be taxed. Bunch of unpatriotic pieces of human garbage in here.","post_message":"Wouldn’t it be great if you could refuse to pay your taxes until you decided your tax rate was “fair”?"},{"comment_id":"692662477538954","commenter_b":"This American Woman supports Trump and I feel more comfortable just thinking about Trump being the POTUS, then I have ever felt the whole time Obama has been POTUS","commenter_a":"As a woman, I wouldn't trust Obama unless I was armed. As a woman, I wouldn't vote for Hillary unless I was voting to send her to the nearest blackhole. Trump is not perfect, by any means. But he's infinitely better than what's currently fouling up the White House.","post_message":"What do you think about President Barack Obama's statements regarding Republican women and Donald J. Trump?"},{"comment_id":"773327109450736","commenter_b":"Sounds like she know how to have a good time.","commenter_a":"Billy Mills, Joshua Hill.. Here's an opponent for yall!","post_message":"Fighting a girl is a lose/lose proposition. @webpagelink"},{"comment_id":"798927580297819","commenter_b":"What a mouth","commenter_a":"Run those @ssholes out of the country...!!! Freedom of speech does not include burning our flag...!!!","post_message":"Protestors Start Burning American Flags, Immediately Receive Instant Justice From Patriotic Bikers [VIDEO]   Click the link below to watch the full video    @webpagelink/  SHARE this if you support these patriotic bikers!"},{"comment_id":"10155618787016002","commenter_b":"Only if you are a pussy","commenter_a":"I thought dodge ball was thought to be bullying.....","post_message":"Note to self: Don't play dodgeball with softball pitchers."},{"comment_id":"10153184060913690","commenter_b":"If God wanted women to get around he would have given them legs....","commenter_a":"The intension is not to drive a car but to goo free life against the social and religious norms.","post_message":"Maysaa al-Amoudi Loujain al-Hathloul were freed after spending more then two months behind bars. Hathloul had tried to drive into Saudi Arabia from neighbouring United Arab Emirates in defiance of the Saudi female driving ban. @webpagelink"},{"comment_id":"10154064486021509","commenter_b":"Sure they alienate all woman","commenter_a":"A lot of you folks are so quick to follow the narrative. There has not been a debate in years. Just mud slinging and popularity contests. One thing is true though, the only thing the Clintons should be doing is life in prison. What a dirty dirty dirty duo.","post_message":"Could the GOP's opposition to Planned Parenthood at the #CNNDebate be a general-election vulnerability? Hillary Clinton's top aides seem to think so: @webpagelink"}]
