[{"comment_id":"797617833687933","commenter_b":"Angela is brainwashed to believe that she'll suffer in the afterlife if she doesn't believe in Jesus.","commenter_a":"there is no jesus....little ceaser maybe","post_message":""},{"comment_id":"608860039265106","commenter_b":"@username Beautiful? NO!! She's SICK!!","commenter_a":"So real girls will have their dreams of becoming prom queen crushed because this school will more than likely give the award to a man in a dress just so the school can appear to be progressive.","post_message":"\"I'm not going to let anyone discourage me from being who I am.\" 18-year-old Dakota is one of four finalists running for prom queen her Portage, Indiana high school. The transgender teen is becoming an unlikely hero for some."},{"comment_id":"10154734635153797","commenter_b":"I can't believe this! That's why having your ccw's is so important. I will not leave without my .22, might not kill you, but it could save my life. Idk how the laws are there but here in Ohio, especially in Cleveland where I'm from. You need to be carrying. I would've helped her in a heartbeat. No questions asked. Then criminals would think twice, if we all start defending ourselves.","commenter_a":"I'm so mad right now not only at the whole situation but nobody had the compassion to help her I'm thinking of that was my Mother, sister auntie etc... praying..","post_message":"CTA VICTIM ID'D: The woman who was stabbed repeatedly on a crowded Red Line train Thursday afternoon has been identified as 25-year-old Jessica Hampton."},{"comment_id":"10153101255675779","commenter_b":"Tailgate Savannah only time will tell i like ronda but she is getting a bit arrogant t","commenter_a":"ronda rousey is gonna lose to holly like if you agree","post_message":"Ronda Rousey visited the The Tonight Show Starring Jimmy Fallon last night to promote her upcoming fight with Holly Holm and discussed Floyd Mayweather and challenged Fallon to a Mario Kart match. Watch below."},{"comment_id":"824106447706135","commenter_b":"Just revoke her security clearance. How could she be president without clearance?","commenter_a":"Ohhh I wish!!!","post_message":"Former Attorney General Michael Mukasey has been making the rounds .."},{"comment_id":"909734362398134","commenter_b":"Their already lawless. Nothing but thugs in many of the public schools, who by the way are running the schools. The kids tell the adults what to do!","commenter_a":"Sounds like she wants to give \"minority students and other risk youth, including migrants and LGBT students.\" a free pass whenever they get into trouble. How about teaching them to OBEY the law?","post_message":"Things go from bad to worse..."},{"comment_id":"1202659629774507","commenter_b":"He should be impeached. If this neighborhood was all white they would have had clean water on day one","commenter_a":"Mr. Snyder you have not done your job so you must go. You looked pathetic.","post_message":"Why hasn't he been arrested?"}]
