[{"comment_id":"10153692790361323","commenter_b":"I have a rare photo of Barack Obama actually working as President instead of playing golf. Rarest thing around. Unfortunately, as with everything connected to Obama, it is worth SQUAT.","commenter_a":"lovely","post_message":"Henry McCarty, known in Wild West lore as Billy the Kid, lived a brief and violent life, stealing and killing before his death in a gunfight aged 21. He lived with a gun in his hand – and sometimes, it seems, a croquet mallet.  Read the extraordinary story of how only the second photo ever authenticated as showing Billy the Kid came to light: @webpagelink"},{"comment_id":"10154394638207042","commenter_b":"Christianity in mind? But what Christianity type of Christianity was happening through the genocides..? Lol never been to prison or even arrested but thanks for the weak statements 😁","commenter_a":"Crosses don't belong in public spaces much less public institutions. If you truly believe in your faith, symbols and manmade objects shouldn't matter. Actions and kindness to your neighbors should be more than enough of a display.","post_message":"CROSS COVER-UP: After one family's complaint about a cross displayed on a public school in Staten Island, it was covered up. Now, a community is outraged.   Do you think it should have been covered?"},{"comment_id":"10156702895000354","commenter_b":"Yeah, poor Oprah. She probably is forced to shop at second hand stores.","commenter_a":"Black women have black privilege","post_message":"Guess how many millions of dollars actress 25-year-old Jennifer Lawrence made in 2015...  *Hint: it's more than you will make in a lifetime--by FAR"},{"comment_id":"892479024147549","commenter_b":"The majority of people who act out racism, cry about racism, are the most racist...are black people....you want a safe space where whites won't be around...Liberia...Nigeria...Botswana...many places...but here's the thing...no welfare, no food stamps, no healthcare, no free housing(except in the jungle and you build it), no opportunity for education, ....not one of you would survive in any of these African countries.....because you've been spoon fed for to many generations! I've been to Africa many times, I've spoken to hundreds of Africans.....they will rot and die in poverty because of the black government that runs the countries....take a very close look at who's in charge of America now!!! Except in America the white tax payer affords you the life you don't even deserve.....and now he's giving your life...yes your life to illegals...he's done with you....make the best of it...because that stupid monkey president couldn't care less about you!!!!","commenter_a":"Hell No. There are no more minorities","post_message":"Huffington Post:  Deserve Safe Spaces Without White People  A couple of weeks ago, two students from Ryerson University Journalism program were barred from attending an event organized by the ' BECAUSE THEY WERE WHITE!  @webpagelink"},{"comment_id":"1418440301796751","commenter_b":"Looks like even white deer are emboldened by a Trump presidency. They must be racist!","commenter_a":"They are beautiful. I would love to see one up close.","post_message":"This is a rare sight: Not one but THREE albino deer spotted in a yard in Wisconsin. One out of every 20,000 deer is albino, making them so rare they're illegal to hunt. MORE: @webpagelink"},{"comment_id":"10153784197573132","commenter_b":"Dig these hard chicks","commenter_a":"Way to go ladies! Proud of you. You are true role models.","post_message":"True role models."},{"comment_id":"10153533564596438","commenter_b":"This is why people are turning against feminism. Jeremy makes a legitimate point, and everyone attacks him because they don't like what he has to say, but he is totally right. Women like her don't need to have a victim mentality because she is more successful than the majority of men on this planet. Victim playing just holds people back and places limits on you before you even get started. Why not go out there, be confident, and refuse to let anything keep you from achieving your goals?","commenter_a":"Wealthy ladies are almost never feminists in actuality. They'll say they are because they need to in order to keep up a certain facade. But they've proven that women are able to be (more) successful and that most of the BS spouted by modern feminism is just that. It's not like someone's political views should matter anyway for the most part. Celebrities are human too.","post_message":"Marion Cotillard says she's not a feminist. Should we care?"}]
