[{"comment_id":"10153823007621636","commenter_b":"The US is no longer safe for the blacks, pls find other homes.","commenter_a":"\"He's put on a paid administrative leave\"!!!!!!! What on earth is happening in America???? These are not police officers in fact they're BLACKAMERICANKILLERS.. cos surely where I live police officers protect people from harm and do not to blindly shoot them.","post_message":"In North Miami"},{"comment_id":"1727638077485478","commenter_b":"Theyre cool. But they claw into you. Very clingy animals","commenter_a":"@username this is why i wana go Australia - want one asa pet lets get one","post_message":"Koala joey plays in baby basket. Via Symbio Wildlife Park"},{"comment_id":"1052877944789070","commenter_b":"Hillary Clinton is more smarter and experienced lady rather than her opponents, she worked in government on different positions as well as in different conditions. As soon as she become President, she will require very short time to implement her plans. #Germany has Lady Chancellor, #UK has Lady PM, now it's time for #US to have Lady President. I am not against Donald Trump and also agree with his views regarding migrated people's who cause Terror activities, Hillary too must think on this issue. No one can't risk it's own people's life for other nations innocent people. In Europe, France and Germany already paying for it...","commenter_a":"Yes!!! And then you can try to explain to your child why the first \"Woman President\" is being investigated for her actions. Then you get to try to explain impeachment. And then how to dig out of the hole of \"Well I guess girls can't do the job.\" Little kids don't get politics. That is the job for adults. And if you as an adult vote for a woman who lies, cheats, and puts her privacy above the security of the nation, then you get to pay for it down the road. But you have a choice vote Jill Stein. 2016.","post_message":"\"Mommy, how come they're all boys?\""},{"comment_id":"10153243418332411","commenter_b":"That's one ugly sumbitch!","commenter_a":"will someone puuulease show this guy the Gates of Hell !","post_message":"North Korean dictator Kim Jong Un used his annual New Year's speech to warn that his country is ready for war."},{"comment_id":"10154844264313132","commenter_b":"Sorry katie but i think you are confused between who hillary is and who trump is cuz clearly he was the one interupting her on soo many questions and tring to intimidate her just like he does every other woman but thank goodness she is a strong woman and did not let him get to her lol","commenter_a":"Wow this just goes to prove that hillary is the better candidate hands down. She definately killed trump and i think he got angry and became soo defensive lol she was very prepared and he was not","post_message":"Donald J. Trump says he will release his tax returns when Hillary Clinton releases her deleted emails. @webpagelink"},{"comment_id":"936295619744244","commenter_b":"having a man in charge hitting his daughter then inviting others to watch will prepare her for the abuse she will subject herself to in her broken down future, all men win","commenter_a":"You can't even spank your child's butt without the school, neighbors, and everyone else screaming abuse. This subject is absurd.","post_message":"The debate between discipline and child abuse continues with this odd case."},{"comment_id":"10154774250570575","commenter_b":"He is the ugliest woman I have EVER seen!","commenter_a":"He is a women himself","post_message":"LOL..."}]
