[{"comment_id":"10153220883066491","commenter_b":"Unnecessary! Girls that are having their period don't play with barbies","commenter_a":"LOL - that is just rich.","post_message":"“It’s just what happens in real life.”"},{"comment_id":"10153177942114170","commenter_b":"Once a LIAR, always a LIAR! But what difference does it make at this point! Hillary is Obama in a skirt! Another Democrat that Bows to ISLAM and leaves Americans being attacked by Muslim Terrorists, TOO DIE!","commenter_a":"She should go to jail rather than the White House. Worst Secretary of State ever along with Obama the worst President ever.","post_message":"How stupid does she think we are?"},{"comment_id":"608123169320865","commenter_b":"F**K Oprah .......she's a Racist Bitch.","commenter_a":"Hey. Heads up. Being gay is no more of sin than lying. Stop being so judgmental. Leave that to God. He says to love one another; guess what, a lot of you are clearly struggling with that.","post_message":".............................yikes"},{"comment_id":"10154364862976336","commenter_b":"Shes an accomplice then! Lock her up too!","commenter_a":"Put her in jail or kill him. Sounds like she knew!!!","post_message":"The gunman's wife said that he scouted both Pulse, the nightclub where the mass shooting took place, and Downtown Disney, recently renamed Disney Springs."},{"comment_id":"995007177263648","commenter_b":"@username if you are still pro refugees after this video, I don't know what to do with you.... And this are things that are not only happening in France, but in Austria, Germany, and several other countries","commenter_a":"All you Obama haters suck!! Just another bunch of racists who want to vent there vile shit.. Any excuse.. Like yeah if your Muslim your a terrorist if your black your a mugger or rapist.. Retards!!","post_message":"Obama Doesn't Want You To See This: The Muslim Refugee Crisis in Europe"},{"comment_id":"10153640013936636","commenter_b":"O questo o un procione non voglio altro siamo io e te li vedi li vedi Dio pinolo?!","commenter_a":"Luca sparati in bocca con me","post_message":"Red pandas have an adorable wrestling competition  Via Detroit Zoo"},{"comment_id":"10153336702199342","commenter_b":"Like my GRANDMOTHER WOULD TELL KEEP YOUR DAM MOUTH CLOSE .","commenter_a":"Pearland officers cool cops!","post_message":"What really happened when former Houston Oilers player Lamar Lathom was pulled over by Pearland police?  Lathon says one thing, while police say something else.  Now, we have the dash cam video .  STORY/VIDEO --> @webpagelink"}]
