[{"comment_id":"1102153109844436","commenter_b":"Women need sex","commenter_a":"She should be locked up! She's sick! And just to say a massive thankyou to this brave soldier for looking after us and our country x","post_message":"How can a wife be so heartless?"},{"comment_id":"10156618428550354","commenter_b":"And why wouldn't he? His father and step father were Muslim...Is it beginning to make sense?","commenter_a":"They will have to air the whitehouse when they finally get because of the smell he will leave","post_message":"The worst terrorist attack in America since 9-11 and what does Obama do?"},{"comment_id":"10152774777037293","commenter_b":"Really????!!!haha...yeah thats funny.Is that why he cherishes illegal aliens more than Americans?","commenter_a":"I believe Giuliani is incorrect....I think Obama would like to see a better America....as many Americans would as well!","post_message":"\"I know this is a horrible thing to say,\" he commented."},{"comment_id":"1604088796561359","commenter_b":"someone get through their thick headed skins, that this is America and we do not have to do it. You respect my religion and I will respect yours, but this is not freedom of religion or freedom of anything but trouble. Your here follow our ways like all other immigrants have done.","commenter_a":"First of all why would you apply for the job at the place if you're Christian?","post_message":"THIS Muslim Company in The U.S. Is Forcing Their Christian Employees To Wear Headscarfs!"},{"comment_id":"1129560600439389","commenter_b":"Why doesn't everybody wake up and send them back to their own country WTF","commenter_a":"Peaceful What?! No such thing! All vicious rabid ranting carnivorous things from hell! Satan has sent them from the burning sands of the deserts to murder, rape and pillage all others! Be gone you vermin from the bowels of perdition!","post_message":"HIDDEN CAMERA: This Is How Moderate Muslims REALLY Treat Peaceful Christians!  wow!"},{"comment_id":"10155429913146509","commenter_b":"But his enabler wife is","commenter_a":"Supporting a blatant sexual predator. Nice. And btw bill is not running for office","post_message":"House Speaker Paul Ryan said he will no longer defend Donald J. Trump, but he did not say whether he'd reverse his endorsement of the GOP candidate."},{"comment_id":"10155007053899641","commenter_b":"Wow people","commenter_a":"Good for them. Sad dt did this to them.","post_message":"Mexico is ready to hit the US where it hurts: Corn."}]
