[{"comment_id":"10157371541105231","commenter_b":"But they pay for it smh","commenter_a":"Sorry but if she was white I would still find this inappropriate. For me it has absolutely nothing to do with the color of her skin or the shape of her body as a human resources manager I have had to have many a talk with white, brown, and black women regarding their inappropriate attire. That's what dress codes in the workplace are for. FYI men also come to work in inappropriate attire. They tend to dress sloppy, they don't bath, and when they think they're sexy they tend to show us way more than we want to see. So it works both ways.","post_message":"It isn't the clothes they have an issue with."},{"comment_id":"10152714612441519","commenter_b":"Go back..","commenter_a":"People have a choice where they want to work. Not enough money offered? Go work for someone else.","post_message":"\"$10 an hour? Does Wal-Mart really think this is enough to live on?\""},{"comment_id":"10153444614011955","commenter_b":"It's a two part problem. Illegals and lazy Americans.","commenter_a":"Maybe those Americans should leave.","post_message":"Illegals outnumber unemployed in USA..."},{"comment_id":"1341354572550959","commenter_b":"Right by Tacoma General","commenter_a":"Good. That's the way it's supposed to work. You rob people, you get shot. End of story","post_message":"A man was shot and killed yesterday evening after robbing two people at gunpoint in Tacoma. Natasha Chen reports, 5 p.m.: kiro.tv/LiveNews  What we know now: kiro.tv/TacomaShot"},{"comment_id":"1735699086698296","commenter_b":"HOW - F_N confused is she ---OMG.....totally the opposite.......","commenter_a":"\"Yes We Can\" :)","post_message":"\"'Diversity' has come to mean that you have to be accepting of every different thing but you cannot, in any way, celebrate a traditional viewpoint.\" – Mike Huckabee"},{"comment_id":"1719361974988639","commenter_b":"Fucking vegans","commenter_a":"Bit dramatic? Eggs are extremely good for you, provide income for a lot of people, and battery farming is on the decline","post_message":"We're just going to leave this here."},{"comment_id":"1012624708881318","commenter_b":"@username. She speaks 5 languages!! How many do you speak?","commenter_a":"I honestly can't stop crying right now to know that this monster is playing with families like this when his wife can't even speak English herself","post_message":"Watch protests at U.S. airports in opposition to Trump's executive order restricting travelers from specific countries.  Read more details on the travel restrictions issued by President Trump: @webpagelink"}]
