[{"comment_id":"10154116667236002","commenter_b":"If this is true (drowning and family defense) she and her family need to be removed from the gene pool","commenter_a":"If people witnessed her letting her children drown, why didn't they help them?","post_message":"The family of a Texas woman accused of allowing three of her children to drown in a swimming pool is defending her."},{"comment_id":"10152601738206519","commenter_b":"Let The Punk Cops Take Their Licks Like The Chumps They Are !","commenter_a":"They're expressing their displeasure with the Mayor. Suck it up Billy-boy, ypu wanted the job, now take your lumps","post_message":"\"New York police unions’ mini-rebellion against Mayor Bill de Blasio carries anti-democratic undertones, and even a faint odor of right-wing coup...\""},{"comment_id":"1023389334348744","commenter_b":"freaking australia","commenter_a":"How so they come up with 95 millions years?","post_message":"This bizarre species of shark is thought to date back at least 95 million years."},{"comment_id":"1242112452475449","commenter_b":"REMEMBER!! ..The Leftist Liberal News Agencies, pushed very hard for the E.U. to take in the Islamic Immigrants with Islamic Ideologies.","commenter_a":"Islam is a cancer and needs to be removed","post_message":"President Obama says the killings in Paris are \"an attack on the civilized world.\" For more coverage: @webpagelink"},{"comment_id":"1189361681104302","commenter_b":"@username--you are right, she is a troll","commenter_a":"actually he voted for Ovomit","post_message":"These are the dangerous consequences of Donald Trump's hate speech."},{"comment_id":"10155518343016729","commenter_b":"This is a repost .....As For Barack Obama, We watched him sit for 20 years in a Church whose preacher condemned America . We watched him travel the globe apologizing for America's greatness .We watched him allow guns to be shipped to Mexican criminals so they could later turn up at crime scenes to mislead American opinion. We watched him use the IRS to punish those with opposing views . We watched him shrink America's military defences ,We watched mistreatment of our veterans , We watched the Ambassador and his protectors be left to die and be covered up by a lie , We watched our nation debt be doubled , We watched the nation's food stamps recipients climb to 25% , We watched a health care system nearly implode to promote some utopian fairy tale. We watched our police be disrespected , race relations fall to an all time ...","commenter_a":"Facebook is so liberally biased. Had this been a post by a Conservative toward Clinton or Obama supporters, the account would have been terminated. Also the person would have been fired from their position immediately. So the school not yet terminating him is garbage.","post_message":"Despicable!"},{"comment_id":"1241041889268599","commenter_b":"Kelly is an ass wipe. Acts like a two bit sleazy pig with her bottle cap tits, ya know the ones she like talking about","commenter_a":"Get rid of her","post_message":"Megyn Kelly reacts to Trump's Florida speech.  @webpagelink"}]
