[{"comment_id":"10153372997486051","commenter_b":"It's a shame that she's no longer here and those 3 scum-bags are. Too bad she couldn't have shot all 3!!!!!!!!","commenter_a":"The fearless leaders kids.","post_message":"This 76-year-old woman was confronted by 3 attackers. Rather than giving in to their demands, she reached over, grabbed a gun and decided to take all of them on."},{"comment_id":"10153441041876037","commenter_b":"She was living a lie by her own choosing. Time to clean it up.","commenter_a":"When her tan started to fade did anyone ever think she looked a bit less black?","post_message":"In a resignation post, the civil rights activist vows to fight for “what is right and good in this world.”"},{"comment_id":"1135446926503853","commenter_b":"And own the chef world John peck !! You're gonna kill it !!","commenter_a":"So those aren't His arms ?","post_message":"BEAUTIFUL: Former Marine sergeant John Peck lost his legs and arms when he stepped on a homemade bomb in Afghanistan.  Thanks to a double arm transplant, Peck says the best thing about having arms again is that he can hold his fiancee's hand and become a chef.  PHOTO: Brigham and Women's Hospital MORE: @webpagelink"},{"comment_id":"1027310527363527","commenter_b":"go girl go!","commenter_a":"Now do it with 40 pounds of gear and a drill instructor screaming at you. lol","post_message":"Meet Milla, a 9-year-old girl that just dominated a Navy Seals obstacle course. (via NowThis)"},{"comment_id":"10152969085332623","commenter_b":"Lock up your wives.","commenter_a":"Filling out that trophy case.needs that one for the set!lol","post_message":"Tiger Woods has entered to play in next week's Wyndham Championship in Greensboro:"},{"comment_id":"1709641872647327","commenter_b":"I cannot believe what is happening in this country. From this moment forward, when my wife or daughters-in-law or granddaughters are in the women's room of any public facility, I will guard the door, and woe to the man who tries to enter while they are in there. There will be blood!","commenter_a":"We are full of IDIOTS in America !","post_message":"\"There isn any doubt that this law was designed to be DISCRIMINATORY ...\""},{"comment_id":"10157187236600354","commenter_b":"Feminists need to stage another protest akin to their bra burnings in the 60s. Perhaps a massive Hijab burning in multiple western countries.","commenter_a":"So funny how the media always pushes these anti-Iran stories even though iran is 1000x more secular than our \"allies\" Saudi Arabia... let's hear about how many women Saudi Arabia executed breitbart. Stop the Iran propaganda pieces, you're turning into another Fox News.","post_message":"When will feminists take on the REAL \"War on Women\"?    “...promote immoral and un-Islamic culture and promiscuity...”"}]
