[{"comment_id":"1614697422150704","commenter_b":"We don't need these radicals in United States we have enough radicals of our own homeborn.","commenter_a":"Let her \"NEXT SPIT\" be in Saudi Arabia !!!","post_message":"Deport these radicals NOW!"},{"comment_id":"1421875981165778","commenter_b":"I had heard that too but I'm not sure where to pick up meatloaf in D.C. . I wouldn't put it on the taxpayer to feed me at the White House, I just want to have the face to face.","commenter_a":"Invite me for dinner at the White House, I'll say it to your face. For real, I'll even spring for the Kentucky Fried Chicken.","post_message":"Trump sounds off on what he considers fake news: \"A source says that Donald Trump is a horrible, horrible human being. Let em' say it to my face.\""},{"comment_id":"10153400883926813","commenter_b":"@username SHE is a girl.","commenter_a":"I love this brave kid.","post_message":"Great victory today! Court rules in favor of our client, transgender student Gavin Grimm, in his challenge to Gloucester High School’s discriminatory restroom policies!  Watch Gavin's video where he stands up for students everywhere."},{"comment_id":"10154717381688128","commenter_b":"Liar, liar pants on fire! Immigration takes jobs from Americans and suppresses wages! Illegals have destroyed this country !","commenter_a":"Well Da, this country is made of immigrants","post_message":"A comprehensive study from the National Academies of Sciences, Engineering and Medicine shows that immigrants coming into the U.S. have helped the economy in the long haul and had little lasting impact on the employment levels of native-born Americans. The conclusion runs counter to a popular narrative suggesting that immigrants take the jobs of U.S. citizens."},{"comment_id":"10154280732936336","commenter_b":"Agree100%","commenter_a":"How is this discriminatory? Use the bathroom according to your plumbing not your frame of mind. What about the civil rights of those who don't want to share the restroom with those of another gender? If a transgender earns money they pay taxes according to their earning not what they think they should pay. I'm really tired of a few people re-writing the moral and cultural standards for the nation.","post_message":"\"I’ll make a decision in 24 hours.\""},{"comment_id":"10154412876021491","commenter_b":"Does this tour detour to the location of the White House MLK Bust? I hope they know where it is. Don't depend on Time, though.","commenter_a":"Shruti Maheshwari","post_message":"Here's how to score a major deal on a scenic getaway."},{"comment_id":"10153959431701756","commenter_b":"10,000 troops + ??? = Peace. Duh.","commenter_a":"Sure, send ground troops, take out Isis on a matter of weeks and then... What?","post_message":"Sen. Lindsey Graham says he wants to send in upwards of 10,000 ground forces as part of a coalition to fight ISIS."}]
