[{"comment_id":"796156163908294","commenter_b":"Yeah and make all those fat bitch bags move to another country","commenter_a":"No one watching it anyway put whoopi on a plane","post_message":"'The View' Made THIS One Fatal Mistake, And Will Likely Be Shut Down Because Of It  Good. Get this liberal trash off the air. We've had enough.  Would you be happy to see the View get thrown off the air?"},{"comment_id":"10154144312645861","commenter_b":"I'm sure they don't assume Christians drink wine and eat tiny pieces of bread for attention, nor insult their robes or any other attire calling it dress up. OR stand up and interrupt their prayers/services when they disagree with it! Freedom of religion, and simple respect...ever heard of it? I hope you don't expect anyone to respect your religion!","commenter_a":"He wanted attention, he wanted to upset people. Someone should tell him his dress is too big for him/her....but not to worry Halloween will be here soon enough, and he can go get a new costume to play dress up in.","post_message":"\"I saw community of people come together and take a stand for what was right.\""},{"comment_id":"10156869276120725","commenter_b":"Thank you Wisconsin! #TRUMPTRAIN #makeamericagreatagain","commenter_a":"The era of appeasement is coming to an end! They are only making the majority stronger and more galvanized than ever! All are welcome on the Trump Train - GO TRUMP!!! #Trump2016 #TrumpTrain","post_message":"THANK YOU, AMERICA! I love you!"},{"comment_id":"10153547475163812","commenter_b":"it is just showing Obama is gay and that monkey guy he calls a wife now can be legal","commenter_a":"so nig","post_message":"White House lit in rainbow colors following US Supreme Court ruling that same-sex couples have right to marry: @webpagelink"},{"comment_id":"10152632992600927","commenter_b":"When has she even known what is going on? The woman is AWOL in the brain department.","commenter_a":"Iranians are our enemies you idiota","post_message":"She's backing Obama's Iran response.  What do you think?"},{"comment_id":"1385834498103243","commenter_b":"Lmao!!!! BUSTED!!!","commenter_a":"TRUMP 2016. Only liberals make excuses for crime. You do the crime you do the time cause its that simple. Trumps the man thats gonna bring back real punishments for all these thugs than thinks they can mess with other folks belongings. Trumps the man thats gonna bring back real law n order and get our country built back up.","post_message":"The West, Texas, fertilizer plant blast killed 15 people and injured 160 others."},{"comment_id":"10153051145414094","commenter_b":"And if gun laws don't work, why have any safety laws? Should hardware stores sell nuclear material because the bad guys will get anyways? Should we not have traffic laws because the bad drivers will run a stop light anyways and crash into a school bus?","commenter_a":"While Republicans were defending the lack of sensible gun laws and calling this an \"accident\", the families and communities of this Church showed such dignity and Christian values by first saying that they forgive the shooter. They are such an amazing example and inspiration to this country. God bless them.","post_message":"Relatives of people killed in a shooting at a black church in Charleston, S.C., addressed the suspect in court Friday In an extraordinary display of grief and forgiveness."}]
