[{"comment_id":"10155262901820231","commenter_b":"Fraud!","commenter_a":"He's just a man and not god","post_message":"Social media: 1  Ceflo Dollar fundraising for a private jet: 0"},{"comment_id":"10153867280412377","commenter_b":"When illegals, dead people and multiple pollers etc, wait c and see how it goes, did the blm intimidate or black panthers block door or maybe machines were screwed up again Save your voting receipt just incase","commenter_a":"Donald Trump has 0% chance of winning the election. Gary Johnson 2016","post_message":"Pete Hoekstra to Newsmax TV: Trump reserved the right to reject. Watch coverage on @webpagelink"},{"comment_id":"1702389236690262","commenter_b":"#NRAWhore","commenter_a":"Screaming about process that eliminates the ability to make progress is criminal.","post_message":"The sit-in by House Democrats is nothing more than a publicity stunt. The bill they're talking about was already defeated in the United States Senate. It's time for them to #StopTheStunt."},{"comment_id":"10153177262869205","commenter_b":"Christmas is actually a pagan holiday as is Halloween.","commenter_a":"Saying public schools shouldn't close for holidays includes Christmas people therefore if schools were to remain open on that holiday you'd end up bitching because your kids had to be in class on Christmas! Everyone should have the right to observe religious holidays due their beliefs even if its just a personal day off!","post_message":"Should Schools Close on Muslim Holidays?  h/t AJ+"},{"comment_id":"10157919704880354","commenter_b":"Any woman is capable of cheating","commenter_a":"Deplorable in State Of Jefferson!","post_message":"LIVE: Behind-the-Scenes Look of the New Store with Breitbart's Alex Swoyer,  Sonnie Johnson and Charlie Spiering"},{"comment_id":"10153323990951509","commenter_b":"Certainly makes most if the rest of us look very lazy","commenter_a":"@webpagelink WATCH THE ABOVE YOUTUBE VIDEO LINK.THIS IS THE BREAKING NEWS I WAS TAKEN IN HEAVEN AND SHOWN THE TRUMPET BEING BLOWN AND JESUS COMING VERY VERY VERY VERY FAST AND VERY VERY SOON. THIS IS THE LAST WARNING.JESUS IS COMING FAST AND SOON Ezekiel 3:27 But when I speak to you, I will open your mouth and you shall say to them, 'This is what the Sovereign LORD says.' Whoever will listen let them listen, and whoever will refuse let them refuse; for they are a rebellious people.","post_message":"He trudged the better part of a marathon each workday. Donations poured in for the Detroit man whose daily commute is a 21-mile walk: @webpagelink"},{"comment_id":"383422335172981","commenter_b":"There are laws and then there is right and wrong. When you factor out people from the laws, you create an inequity that needs to be handled as Solomon did --- One case at a time. Many years of productive residency DOES erase the fruit of the poisoned tree --- that she came here against a statuary law. Laws were made to cope with inequity. We have immigration laws because we feared overpopulation by the poorest people in the world who would want to come to the \"land of opportunity.\" But, when someone comes and contributes to our fabric, we need to weigh that against a rule made to prevent, in her case, something that doesn't exist.","commenter_a":"The first step in holding conservative views on immigration is that they can't view anyone who might be affected by bad immigration policy as fully human. That's the problem. They've successfully dehumanized Hispanic people so they simply don't care.","post_message":"Now she has the opportunity to apply to stay here legally."}]
