[{"comment_id":"602527166571478","commenter_b":"Certain ppl should stop reproducing","commenter_a":"@username fuckin retard","post_message":"So Dumb: She Thought She Found A Hack To Charge Her Iphone!"},{"comment_id":"524518094380814","commenter_b":"Planned parenthood another way of saying murderous selfish bitch, or greed doctor. I think both. Revoke the doctors licences, and any woman getting an abortion gets a hysterectomy too. If you're willing to murder your own child once you don't deserve the privilege to have any at all.","commenter_a":"Hillary’s claiming credit for Planned Parenthood’s selling of fetal body parts. She says it’s a real money maker, and the only way she’s able to afford Starbucks....","post_message":"The top Planned Parenthood doctor whose face is all over the Internet because of an undercover video otherwise has left little mark on social media or elsewhere on the Web."},{"comment_id":"10157050589675206","commenter_b":"Ok girl","commenter_a":"Nuts!","post_message":"“We are lucky that we have this son who loves Prophet Muhammad that much.”"},{"comment_id":"10153821104831336","commenter_b":"@username sad indeed. Alana should shut her nasty mouth.","commenter_a":"I wish Obama would show the same respect for our troops. Oh my bad he puts illegal immigrants first before the fine men and women Who served our country.","post_message":"Today, Britain observed the annual Remembrance Day, a Commonwealth of Nations memorial day honoring armed forces who have died in the line of duty."},{"comment_id":"771664696265472","commenter_b":"A 19 year old college student who apparently doesn't know history... It was actually Bill Clinton who trained and armed AlQuaeda","commenter_a":"Shouldn't have been there in the first damn place sleazy ass presidents....point the blame go head, this shit didn't just start....they just got more power...thanks America for taking my tax dollars and funding these weirdos","post_message":"A 19-year-old college student confronted Bush saying,“Your brother created ISIS.”"},{"comment_id":"985399901519758","commenter_b":"Stupid cow what did she expect","commenter_a":"Really?","post_message":"'I thought he was The One'"},{"comment_id":"10153612119195530","commenter_b":"Nobody at the restaurant saw anything?","commenter_a":"How come nobody saw anything?","post_message":"So what really happened that Wednesday afternoon in 1975?"}]
