[{"comment_id":"10154174167571509","commenter_b":"@username no the little girl thought she was the boss.. the cop showed her she is not","commenter_a":"this is very extreme who taught the school police officer to do this. she did not look like a threat he just had to talk her into complying","post_message":"\"You're either going to come with me, or I'm going to make you.\"  A school district in South Carolina is investigating the actions of a school resource officer after video showed him violently removing a student from her desk."},{"comment_id":"606469089512450","commenter_b":"Cus Beyoncé just another weak ass bitch in the guise of some sort of strong independent woman.","commenter_a":"Except she didn't do any of this and stayed with the man that's been cheating on her (and before the beehive goes crazy, I love Beyoncé...but what I said is also very true...) soooo you can't be a strong independent woman who brushes aside the fuck boy...when you're still married to him. Now if she comes out and says that they are still married cause it's business but they sleep in separate rooms and have an open relationship then awesome for them...but it's not empowering women...its perpetuating the stereotype","post_message":"14 Beyoncé \"Lemonade\" Lyrics For When Your Ex Texts You"},{"comment_id":"1684551998460631","commenter_b":"I am not an American, but I and we all are interested in your politics. Because we other part of the world are concern for peace and prosperity. And Why so much hate? Why so many wars? Do you think that is the solution? What is the meaning of diplomacy for you guys? Is it only war? Do you think that in this 21st generation you are again doing politics for religion ? And certain race? Is that how you want to see American politics ? How come you think Obama foreign policy is miss leading you guys? Do you got the proper answer? He talks about climate change, which is happening and strongly scientist also believe that, he try to bring your army back in your country from Iraq and afganishtan, he shown us that diplomacy and foreign policy is not only about to hate and make enemy. He ...","commenter_a":"Trump doesn't back down from our enemies Obama. You are nothing but a coward. Your nuclear and foreign policy has only weakened us, and made it easier for Iran and ISIS to kill us.","post_message":"Speaking at the close of the Nuclear Security Summit, President Obama said Donald J. Trump's nuclear comments show he \"doesn't know much about foreign policy or nuclear policy or the Korean peninsula or the world generally.\" @webpagelink"},{"comment_id":"921197848005881","commenter_b":"Good Luck ! KILLARY sold out America to the highest bidders..several Muslim countries, big businesses, private persons gave millions to the made-up Clinton \"Foundation\". The Clintons PRIVATE SLUSH FUND. Only 10% is donated. KILLARY then sold 20% of America's uranium to Russia. OBUMMER Paid 400 Million to Iran in foreign currency , cash. That's not mentioning all the lies that has been told to the AMERICAN PEOPLE. The Democratic Party is now just socialists, communists. All of you need to see Clinton Cash. Many of top government positions or Muslims. If Hillary is the next POTUS, she'll be sending all of us a prayer rug, burqa's & hijab's for you female family members...now I expect you to call me a racist (against muslims) & bigot as that what you call anyone that disagrees..Pity for us all! 🇺🇸❤️🇺🇸❤️🇺🇸❤️","commenter_a":"With all the facts about this man being super unfit, I don't see how people still stand behind him. I guess they have no concerns for our future and the future of our children. If he gets elected I hope someone assassinate him.","post_message":"LOL! Spot on!  Made by Walt Handelsman, go give him a LIKE! Shared by Occupy Democrats."},{"comment_id":"487739541416626","commenter_b":"She is an Ass","commenter_a":"Ann is not afraid to speak out she is a very brave lady","post_message":"This brave woman just called Obama a primate on national television.  She made a huge stand against our president, let's show her our support.  Do you endorse her public defiance against Obama?"},{"comment_id":"10154553416661162","commenter_b":"Our marriage will never end then!","commenter_a":"@username I guess this was the problem lol","post_message":"CHEERS! A new study says couples who drink together, stay together."},{"comment_id":"10156224607550354","commenter_b":"Thought she was an illegal immigrant.","commenter_a":"Is it any surprise she is black","post_message":"The Obama Administration continues to deny the food stamp fraud crimewave exists.   Instead, it continues to balloon the already exploding program. Check out the numbers..."}]
