[{"comment_id":"10152977695566234","commenter_b":"He does not have a chance in hell. Rand Paul 2016! Sweeny will NOT be our Governor either. LET FREEDOM RING!","commenter_a":"HELL NO!!!!!!! But don't worry, he'll NEVER GET THAT FAR!!!!!!!!!!","post_message":"Would Gov. Chris Christie's trademark brash demeanor be an asset as he dealt with foreign relations if he were elected president?"},{"comment_id":"987322251337818","commenter_b":"They should be incarcerated. It's just that women who have legal abortions aren't murderers. And NO member of congress should make my reproductive choices for me.","commenter_a":"If you believe in murder, I guess it would be ok for you","post_message":"Yes! It's time to #abortthestigma"},{"comment_id":"10152739568860779","commenter_b":"Get off Kobain's dick, retard committed suicide.","commenter_a":"Jody Bombay VanderZouwen buy me this !!","post_message":"Kurt Cobain appears on the cover of our latest issue, on newsstands today. In a 1994 feature, David Fricke looks back at the Nirvana frontman's music and legacy. \"As a man of riffs and letters, Cobain was a sly dog who rarely stooped to the obvious…nothing in Cobain's music was ever quite what it initially seemed; his best-known song was named after a deodorant,\" Fricke wrote."},{"comment_id":"10154104815247061","commenter_b":"Its the degenerates who voted for a child rapist to run our country!","commenter_a":"I'm sorry.. I noticed some people responded to this story with the \"angry\" emoji... Why would anyone be angry at giving back to the community or better yet, to our vets?","post_message":"WATCH: President Obama and First Lady Michelle Obama serve Thanksgiving meal to residents of a retirement home for military veterans in Washington, D.C. @webpagelink"},{"comment_id":"10153342820917098","commenter_b":"I am on her side, women now a days are almost naked just to prove that they are sexy.","commenter_a":"Im on her side. Hoes are in their feelings because she feels beautiful and sexy with clothes ON. She clearly didnt have to be half naked to get her man and that should tell you hoes something. Lol Dont be mad, learn something. Know your worth. Get it together.","post_message":"TWITTER DEBATE: Ayesha Curry, wife of Warriors basketball star Steph Curry, found herself in a social media firestorm after tweeting about today's fashion  Many people criticized her for body shaming while others praised her for her modest views. Which side are YOU on??   FIND OUT what she said: kron4.com/2015/12/07/twitter-explodes-after-ayesha-curry-tweets-about-modesty/"},{"comment_id":"1086229651436699","commenter_b":"I bet the real problem some have is that Black females got into West point, never mind graduate from there.","commenter_a":"When you lower the entrance standards to one of the world's greatest Military Academy, this is what you get...","post_message":"The image has spurred questions about whether the gesture violates military restrictions on political activity."},{"comment_id":"10153000313242383","commenter_b":"you mean Haliburton? .. don't you think they got compensated enough?","commenter_a":"What about the contractors who did everything including making the ultimate sacrifice only to come home and be crapped on","post_message":"Interpreters who helped save Marines lives on the battlefield are fleeing to the U.S. with nothing  so one Marine is pushing to get them veterans benefits. @webpagelink"}]
