[{"comment_id":"1117614688258709","commenter_b":"@username I bet you believe the liar Lucy.","commenter_a":"Apparently the alleged (by police) victim in this case, is saying \"there was no assault\"..... Of course if the Gian Gomeshi/Lucy DeLiar case has taught us nothing if not \"We must believe in the guilt of every man accused, even if he is not guilty... even if the accuser admits to lying about it... and even if the alleged victim says \"he didn't do anything\".... if you have a penis, you are, by default, guilty, even if you're not guilty :( Sad world when having a dick is more of a crime than being a dick :(","post_message":"\"If I find out that somebody is abusive, I cut them out of my life. It's very easy,\" wrote Lucy DeCoutere after the actor who plays Bubbles in the Trailer Park Boys was charged in a domestic dispute."},{"comment_id":"893350990721431","commenter_b":"She's not getting my vote","commenter_a":"Go Hillary!!! :)","post_message":"All across the country, people are working hard and making plans for their futures. Hillary is getting started too. Be a part of her campaign from the very beginning:"},{"comment_id":"10154121579688132","commenter_b":"Kendra Hill Graham..she was crazy like a fox and a filthy pig to boot!","commenter_a":"Wow! Mental illness is real. She is disgusting! May God bless the children involved.","post_message":"Police officials are calling it \"one of the worst neglect cases\" they seen in Concord, California."},{"comment_id":"10153909407028598","commenter_b":"Girls, start being more selective of your boyfriends. Think first and maybe you won't regret your actions later.","commenter_a":"I hope someone puts him out of commission!!!","post_message":"Boyfriend and Two Others Assault Pregnant Teen, Punch Her Stomach to Kill Her Unborn Baby"},{"comment_id":"10154679787223751","commenter_b":"we dont want to lecture anyone on how to govern their own country, but Canadians will lead by example","commenter_a":"That's whet they need to be.","post_message":"Canada's border has seen a surge in people crossing illegally from the U.S., with a 230% increase in people crossing into Quebec in January compared to a year ago. @webpagelink"},{"comment_id":"10153775043868984","commenter_b":"They are monster","commenter_a":"Go Trump/Cruz","post_message":"Barack Obama may be trying to act like a humanitarian by letting in 10,000 Muslim refugees from Syria. However, what the media isn't reporting on is who Obama is kicking OUT of the country... When America finds out just who he's deporting, they're going to be FURIOUS."},{"comment_id":"1018817644877956","commenter_b":"#STOPHATEANDFEARMONGERING #dumpTrump #VOTEDEMOCRATS","commenter_a":"I have a bet going that Trump declares bankruptcy again after he loses the nomination. I hope he loses everything and all his foreign factories close down. DUMP THE TRUMP DUMP THE TRUMP DUMP THE TRUMP","post_message":"You reap what you sow."}]
