[{"comment_id":"10154951315667235","commenter_b":"Oh, well, let's just kill the bitch. Thank goodness there are smarter people in America than people like you. Pick a fight that matters.","commenter_a":"Not going to watch her. She has no credibility or can be trusted. She was part of the Obama hate and lies machine that paid her millions of dollars to create the monster who is going to be our president. I am not going to watch her. Get trusted news from FSTV.","post_message":"That time Megyn Kelly told children that Jesus and Santa were white?  It wasn't the only time..."},{"comment_id":"939606616115567","commenter_b":"Slaves to Islamic vermin. not MEN","commenter_a":"Sharia and Islam are only good for Muslim Males ................Males get all the advantages............... BUT .women, children, gays, Christians , Buddhists, Jews, Hindu and anyother religion not \"their \" brand of Islam will be punished , raped , enslaved , or killed . Women of the world wake up and see this truth . Fight for freedom .Women Fight for your life....Women you can be more than slaves to men ........","post_message":"They're just sweet refugees', they said. 'Who just want a better life', they said. Welcome, and then .... German girls... cover up... so you don't get raped by the 'refugees'?"},{"comment_id":"485625238294723","commenter_b":"Deport her ass","commenter_a":"This woman is a trouble maker and more behind her... Send her back if she cannot obey our system. This goes for anyone, anyone's religion. By the way does she have automobile insurance>> Is she a Citizen of the USA??????","post_message":"A woman is suing the police department... over a hijab?  This woman broke the law, the police are completely in the right.  Do you support our police?"},{"comment_id":"829690333773863","commenter_b":"The black community needs to clean up their act, plain and simple.","commenter_a":"This type of person should not be free.","post_message":""},{"comment_id":"992247137464743","commenter_b":"The women that hate Amber Rose are either ugly or fat or both. A secure woman has NO REASON to hate on another woman.","commenter_a":"I love seeing a post about 2 women making a serious public statement about the hate women recieve and then reading nothing but hate on those 2 women (BY OTHER WOMEN) in the comments.........","post_message":"Jaw-dropping. #VMAs"},{"comment_id":"541947015995878","commenter_b":"Impeach this peace of crap in the WH !","commenter_a":"boo the windbag muslim !","post_message":"Americans are furious after Obama hammers christians on TV.  What disrespect. He's gone too far with this.   Do you think Obama is out of line?"},{"comment_id":"1036789886341367","commenter_b":"There is no way the American people will vote that evil woman into office.","commenter_a":"I think the GOP has had about enough of Trump, lol.","post_message":"U.S. Republican presidential candidate Donald Trump insisted on Sunday he was \"100 percent right\" when he said he saw Muslims in Jersey City, New Jersey, cheering the 9/11 attacks on the World Trade Center even though fact-checkers have debunked his claim."}]
