[{"comment_id":"1000554689985003","commenter_b":"I also work in the water industry and watched this guys demonstration. What a bunch of BS on several accounts. First my information comes from the following website: Water Encyclopedia - Ogallala Aquifer. According to this site the average depth of the Aquifer he is referring to is between 60 to 200 feet. Some sections of this Aquifer is over 1000 feet deep. Anyone that understands anything about water understands ground filtration. This particular Aquifer happens to be receiving it's water from snow and rain run off from the Rocky mountains. Fracking or not is very very unlikely to have any effect on the quality of water in his state. True fracking does use water in it's process - untrue it does not simply dump untreated water back into the Aquifer. This guy's demonstration is about as truthful as someone video taping a moose pissing on a snow bank in ...","commenter_a":"yup......and one \"spill\" accidently of course.......stop this madness!","post_message":"It's simple, really. If this is what you're willing to do to the water, you should be willing to drink it. These committee members weren't."},{"comment_id":"1007311229351882","commenter_b":"@username more people die every year in DWI accidents than in 10yrs of the war..stop whinning it will be on our soil soon.thank obama for that.","commenter_a":"Good because theyve destroyed the republican party and turned it into a warmongering party filled with neocons. Trumpism will come in to replace them and become a patriotic party for the first time in 40 years. We live in exciting times and I am honored to witness it.","post_message":"\"They are as dead as emperor-worship in Japan.\""},{"comment_id":"1605375073100237","commenter_b":"Fuck him and his family. Good job lady and sorry you had to as nobody wants to kill someone. But they will kill, torture, and rape you. Good you were armed. God bless you.","commenter_a":"Why do we allow people like this to contribute to the GENE POOL? His whole family should be spaded and or neutered. Why because of IDIOTIC lines like \"he needed money for clothes\" what happen to all the government hand outs this family was getting, cause sure as shit they all were on welfare and not one ever held a job. As to whether or not it was the home owners fault is by far the most asinine thing ever spoken.","post_message":"This teen punk broke into a woman's home and tried to rob her. But she defended herself, and left him dead.  Now the punk's family is asking an absolutely sickening question, that left the woman and her friends shocked.  Only in Obama's America..."},{"comment_id":"10154939556251320","commenter_b":"WE DON'T NEED, YET, ANOTHER ROSIE O'DONELL barking her bossy pants ignorance our way!!","commenter_a":"All the comments below ring as TRUTH, but tolerance and inclusion goes a LONG LONG way. Whether OR not you agree with ANYONE's lifestyle choices!","post_message":"Susan Olsen, who played Cindy Brady on  Brady Bunch has been fired from her job as a Los Angeles-based radio DJ after she posted a homophobic rant on Facebook."},{"comment_id":"10152956831331130","commenter_b":"Wow... talk about a student taking the teachers to school.","commenter_a":"Her parents really wrote a good speech.","post_message":"Somebody give this little girl a medal!"},{"comment_id":"859334654119032","commenter_b":"Btw, military grade doesn't always mean what you think it means.","commenter_a":"There is no such thing as an assault rifle. It's a made up term to scare ppl.","post_message":"DEVELOPING - Father of Patient Takes Hostages at Houston Hospital with Rifle   Hoping for a peaceful resolution."},{"comment_id":"10153161332178606","commenter_b":"with friends like that who's need enemies! She's just evil.","commenter_a":"Good. She can go to JAIL !","post_message":"Police said a teen had second thoughts about committing suicide, but his friend encouraged him to do so. @webpagelink"}]
