[{"comment_id":"730431657058963","commenter_b":"Stupid ass talk to text I sent hats off to Mr Gilbert who donated 10.5 million to Toys for Tots you can say what you want about these new country singers but I like mr. Gilbert's music and a bunch of the other ones and if you don't like that you kiss my ass","commenter_a":"You can say what you want but these new country singers other not countries in a sucker most of butter how many people you know to get stoned.5 million for toys for tots hats off to mister yogurt hold a good man and a good singer and if you don't like it like that you kiss my ass","post_message":"“Whether a kid is into Barbie or Star Wars, I hope we’ve given a bit of fun and inspiration.”"},{"comment_id":"1244555875564440","commenter_b":"Cruz is an idiot lady.","commenter_a":"Ted Cruz is right and is a good man! Good for you Ted! Tell that loser of of President who wants to allow criminals out of prison, and terrorists over our borders!","post_message":"Sen. Ted Cruz has some sharp words for President Obama, who he says attacked him two days in a row.  Read full story: @webpagelink"},{"comment_id":"10153702399577377","commenter_b":"TRUE----BUT SHE OBVIOUSLY HAS THE WHERE WITHALL TO BUY PEOPLE OFF.","commenter_a":"SHE AND OBAMA NEED TO BE IN PRISON","post_message":"Former New York City Mayor Rudy Giuliani said Monday Hillary Clinton could possibly be the worst secretary of state in history."},{"comment_id":"10152934239186336","commenter_b":"If O had a son!! Hold the phone he would have to be heterosexual!!!","commenter_a":"Home grown terrorist!","post_message":"A former taxi driver from Virginia has been added to FBI's list of most-wanted terrorists."},{"comment_id":"10154362433106509","commenter_b":"What a pussy","commenter_a":"Obama = anti christ he wants to disarm us so he can let his refugees attack and we be left defenceless","post_message":"Barack Obama addresses the notion of a \"conspiracy\" that \"we are creating a plot to take everybody's guns away so that we can impose martial law...\" #GunsInAmerica @webpagelink"},{"comment_id":"1560631690895039","commenter_b":"Good for his ASS. I hope they rape him in prison nite and day. Carma is a BITCH lol","commenter_a":"the sentence is more lenient than what he deserves","post_message":"There is no punishment severe enough for these heinous crimes."},{"comment_id":"823419914360098","commenter_b":"Never,never forget the countless acts of murder she committed by her acts against her brothers and sisters!","commenter_a":"I work hard at forgiving. I just can't forget. God told us in order for us to receive forgiveness, we must forgive. That is a tall order in this circumstance. I am trying. It is up to God to cleanse her of this deed. I had to turn it over to him. I still will not watch any movie or show she is on or in.","post_message":"Jane Fonda has changed her tune. She apologized for her Vietnam photos.   What do you think? Better late than never, or too little too late? Should she be forgiven?"}]
