[{"comment_id":"10153904419513984","commenter_b":"She's an ass","commenter_a":"Yeah the photo says it all...\"wha happened?\". Stick to acting, your moral compass is effed up. Be a kinder human being to your fellow humans, not to tou 1%er peers. Thiugh phony and shallow does fit you well","post_message":"She's the biggest female star in Hollywood right now, and she just made a sickening claim about Christians and the cross of Christ.  This is just disgusting.   She has a new movie out. Let's make sure she doesn't make a dime off of us!"},{"comment_id":"10154316931887654","commenter_b":"it's with the thieves,rapists and murderers! this lady is a witch!","commenter_a":"It's hard to believe that she has enough brain to keep her breathing...........The woman is a grieving mother whose son was murdered by someone who should not have been here. Our borders are sieves because of failed policy and Pelosi says he was a \"law-abiding citizen\"???? Where is her soul? Her compassion? Her empathy?","post_message":"Democrat leader sides with illegal aliens over mom whose son was murdered by one."},{"comment_id":"10155900570730354","commenter_b":"IRAN PUT OUT A MESSAGE TODAY SAYING \"DEATH TO AMERICANS\". THAT WAS TODAY FOLKS TODAY....OBAMA IS THE WORST MAN IN THE HISTORY OF THE WORLD. HE WILL HAVE PAY FOR WHAT HE IS DOING TO THIS COUNTRY. IT WONT BE TOMORROW BUT IT WILL HAPPEN. KARMA IS A BITCH.","commenter_a":"AND IS ANYBODY REALLY SURPRISED OR SHOCKED THAT OBAMA LIED? THAT'S WHAT HE DOES BEST.","post_message":"See the updated language comparison... this just keeps getting more PATHETIC:"},{"comment_id":"10153884962054228","commenter_b":"They need to die","commenter_a":"They should be beat to death","post_message":"The child was locked in a room, bound with duct tape over his eyes, beaten with belts and a hammer.  That is not the worst part."},{"comment_id":"10157410522280294","commenter_b":"Love these type of storms..","commenter_a":"Thanks for the pictures. Please stay safe. If you have reports of any damage please let us know","post_message":"Dark storm clouds roll into the Cleveland area"},{"comment_id":"10154145894181973","commenter_b":"I sure wish FB had an option to simply unlike a post.","commenter_a":"I have never been prouder to be an Oregonian. THANK YOU, protesters! WE ARE BETTER THAN DONALD TRUMP!!","post_message":"At least 200 protesters marched through downtown Portland and blocked lanes of Interstate 5 early Wednesday to voice their displeasure with Donald Trump's election as the 45th president of the United States."},{"comment_id":"1004815269538226","commenter_b":"No im against the pregnant women always tryna make the world owe them for having sex.","commenter_a":"Pregnant women have too much sense of entitlement I have no pity for the broad Much respect to the cops","post_message":"When Charlena Michelle Cooks, 8 months pregnant at the time, would not tell officers her name right away, they pushed her to the ground on her belly and cuffed her. Video: kiro.tv/BodyCam"}]
