[{"comment_id":"10153179691834091","commenter_b":"Hmm...not as bright as WE thought, are you???","commenter_a":"See there, its already fixed. I'm sure it's not the first time this has happened. Everyone have a great night.","post_message":"YIKES!!!"},{"comment_id":"968036809901222","commenter_b":"Take the criminals away first","commenter_a":"FAST & FURIOUS ???","post_message":"This is one of those times where a picture is worth a 1,000 words!"},{"comment_id":"1055104137833836","commenter_b":"Let 'em try! They'll fail miserably!","commenter_a":"Because they welcomed the terrorists with open arms. And because the French people allowed their government to disarm them. They were sitting ducks. Thank God for the Second Amendment. If they could, the gun grabbers would disarm us.","post_message":"Why Paris? Why now?"},{"comment_id":"10154276693141037","commenter_b":"Hillary needs to start leaning a bit further left, and start actually addressing the issues that the voters she's not getting care about. Her \"don't be so pie-in-the-sky\" attitude will cost her the election, and God only knows the price this country will pay with Trump in the Oval. Bernie is hanging tough because Hillary is not!","commenter_a":"I will only cast my vote for Bernie Sanders. Period. I will write him in if need be.","post_message":"Despite Hillary Clinton’s insurmountable delegate gap, Bernie Sanders coasted to victory on Tuesday, yet again."},{"comment_id":"1659698577423598","commenter_b":"she is just cheap fat trash...who cares?","commenter_a":"Get off whatever you are on Mariah!","post_message":"... Oh my god...  I had no idea this happened."},{"comment_id":"10152762563712894","commenter_b":"I can't stand that Bitch.","commenter_a":"For some reason i like the color & hair, I just don't fuck with Kylie like that tbh . Then again I feel as though she low key disrespecting black folks with this shit. She tried it with the lips & butt but this shit right here just made me feel like she's doing the most now","post_message":"Say What Now? Kylie Jenner Says She Wishes She Looked Like THIS All The Time [Photo]"},{"comment_id":"10154012731783352","commenter_b":"You know there has to be issues with her if the white men think you are crazy!","commenter_a":"I hate when you left a man they started to talking shit Dave Justice go sit your ass down some place and stop talking smh","post_message":"Halle Berry’s ex Dave Justice tells why he’s finally speaking out about the A-list actress, who tried to ruin his life and did the same thing to ‘Eric, Gabriel and Olivier’"}]
