[{"comment_id":"1419706908060869","commenter_b":"What rights do women not have again?","commenter_a":"Suck it up... lol he won and he IS your president. I love liberal whining people it makes it all that more enjoyable to get on here and see them crying.","post_message":"\"You're orange, you're gross, you lost the popular vote,\" a crowd at the Women's March in Washington chanted today.  Millions marched in D.C. and around the world for women's rights and against President Donald J. Trump's inauguration: @webpagelink"},{"comment_id":"1100432766685506","commenter_b":"F**k Obummer and his illegal aliens...","commenter_a":"Prayers","post_message":"OBAMA'S LEGACY: Veteran Kills Himself After Call To VA Suicide Hotline Goes To Voicemail    Meanwhile Obama Hotline For Illegal Aliens To File Complaints About Border Patrol Remains Fully Staffed"},{"comment_id":"1142286662534251","commenter_b":"Learn English you illegal immigrant","commenter_a":"Republicans or pathetic. I am for Trump as long as he is not for wars. Does not bother me if he is racist. At least I know where he is coming from. It is the ones who try to hide their racism you have to watch.","post_message":"None of the Republican leadership in Congress were at the meeting with Trump (nor were they invited)."},{"comment_id":"10153713644828984","commenter_b":"Yes build it. And people American people will have a job and steel prices go up. And we win!!!!!","commenter_a":"Build the wall. Put censors all along the border and give the border patrols the order to shoot any one who gets over or under the wall. Illegals will stop coming.","post_message":"Boom! Critics of Trump's border wall just got silenced in an EPIC way by The Donald himself. There's no way they can argue this one!  Do you agree with what Donald Trump just said about a border wall?"},{"comment_id":"1723525614585873","commenter_b":"Brady Wix Baillee Schott","commenter_a":"Elias Deltoro Ryan Michael","post_message":""},{"comment_id":"521171901404436","commenter_b":"No I sure hope they stop these refugees from coming to our state in Arizona!!! Don't want them here!!!","commenter_a":"Come on fla...join texas","post_message":"Is your state in this MAP?"},{"comment_id":"10153182922011943","commenter_b":"Time to round up these extremist traitors and deport to Muslim countries!","commenter_a":"She is the POTUS, Obamass is her puppet clown. George Soros funds the riots, paid Obamass millions and Valarie transmits all the government information to Iran where her father-in-law gives to his Iranian people. They know whats going on in Iran before we do here in the states. She had her office and quarters in the WH before Obamass and Mooschelle moved in.","post_message":"It been well documented that Valerie Jarrett, a Chicago lawyer and longtime Obama confidant, is a liberal extremist who wields tremendous power in the White House.   She has connections to many Communist and extremist groups, as FBI files obtained by Judicial Watch show. (SHARE THIS!)"}]
