[{"comment_id":"10153120617440927","commenter_b":"Yep, she's the best they got. crappy pants and all","commenter_a":"You can't help but admire a woman who stays married to a serial rapist and craps her pants during the last Democrat debate.","post_message":"59 TIMES: Billy Graham has been in Top Ten more than any other person Pope Francis and Donald Trump both got 5% this year Teddy Kennedy tied Blessed Mother Teresa with 18 years on the most-admired list"},{"comment_id":"1657934121091027","commenter_b":"What did they expect???? Idiot Merkel....","commenter_a":"A bunch of neanderthals","post_message":"The reports of assaults have added fuel to Germany's migration debate."},{"comment_id":"10153327078532411","commenter_b":"So this really can happen? My phone is usually under my pillow","commenter_a":"@username can I have electronics in the bed","post_message":"This is why you don't sleep with your cell phone."},{"comment_id":"10155909073040354","commenter_b":"Yea I've been seeing her dumb ass everywhere lately","commenter_a":"Mike Romano this woman is crazy.","post_message":"SHOCK! Nancy Pelosi backs Planned Parenthood."},{"comment_id":"10154969261539575","commenter_b":"That's supposed to be the case","commenter_a":"I was once told that the firechief is boss of a fire what he said goes","post_message":"The Cannelton Fire Department chief was arrested after police say he shoved an officer multiple times at the scene of a fire."},{"comment_id":"1341782245865041","commenter_b":"Wow!!!! Clearly a Muslim traitor...... Like Barry and Michael, maybe they can all room together......Prison 2017 !!!!!!","commenter_a":"\"Farking Nuts\"","post_message":"YES, POLITICIANS HAVE LITERALLY LOST THEIR BRAINS..."},{"comment_id":"1039059936190258","commenter_b":"That's not what Margaret said, and the fact that you think it was is a pretty clear indication of how little you understand about this and comparable situations, Pat.","commenter_a":"Answering for dead soldiers is abusive? If she can't handle this she's absolutely not fit for president.","post_message":"\"Republicans are squandering millions of taxpayer dollars on this abusive effort to derail Secretary Clinton's presidential campaign.\" - Rep. Elijah Cummings"}]
