[{"comment_id":"987118551371296","commenter_b":"These women did it LEGALLY.","commenter_a":"There's a difference between illegal immigrants and legal immigrants.","post_message":"Trump's ex-wife agrees with his immigration policies... even though she's an immigrant."},{"comment_id":"10153561023428984","commenter_b":"Go back home you stupid little bitch!!!","commenter_a":"Twitter Bomb her page till she leaves! REMOVE ALL of the spoiled \"idols\" your kids listen too, that say they Hate the Country that gave them the Opportunities to influence them!","post_message":"Globally known, pop-star diva Ariana Grande just told the world that she hates America... so karma just got its PERFECT revenge.  Her snobbery and selfishness are famous so this is not a huge surprise... she deserves what she gets."},{"comment_id":"10153889126257144","commenter_b":"@username stfu ass!","commenter_a":"Obama is going there to give a speech about how the truck manufacturers have flooded the market, so it is easier to buy a truck than it is to buy a book.","post_message":"This is awful."},{"comment_id":"1757125454570252","commenter_b":"Kasich belongs to the Liberal side, lies like they do. Thank God, all has been peaceful. Stay safe Law Enforcement 🇺🇸","commenter_a":"Loved your speach, Laura. I'm so disappointed in John Kasich, Jeb Bush and other Republican leaders who are helping Hillary to win.","post_message":"The Ohio governor is still refusing to attend the convention in his home state and support GOP unity."},{"comment_id":"1788953421120280","commenter_b":"Progressive liberals are domestic terrorists! We the people must stop this corruption around our great country!","commenter_a":"Keep showing her lies as well as the corruption in Washington. Obama spending our taxes on her campaign, even though we are Not voting for her.","post_message":"Crooked Hillary Clinton lied to the FBI and to the people of our country. She is sooooo guilty. But watch, her time will come!"},{"comment_id":"10158510929345206","commenter_b":"Then how do you explain her looking at the camera from a certain angle while wearing a head scarf? Only one woman can pull off that move.","commenter_a":"thats not even her.","post_message":""},{"comment_id":"10156340374100354","commenter_b":"You my dear are a moron who is helping to destroy your people.","commenter_a":"Scumbag.","post_message":"\"Safe negro\"?!  Can you IMAGINE the FIRESTORM liberal media would have generated had a conservative said this?!"}]
