[{"comment_id":"10155589843380231","commenter_b":"That Saltine needs to o put on her white sheet and HOOD and shut the hell up.","commenter_a":"Which is why she's scared to show her face...stand by your convictions woman!","post_message":"At least one McKinney resident is standing by the police, insisting that the actions taken were appropriate."},{"comment_id":"10155481461845405","commenter_b":"And I mean prosecute the farmers not the illegal immigrants. You can't blame them for coming here and getting a job . My point is Republicans won't deal with the issue in a responsible manner.","commenter_a":"And they vote Republican and employ the largest number of illegal immigrants and get away with it. The one that do should be prosecuted for it .","post_message":"Did you know that 97% of Wisconsin farms are family-owned? Wisconsin agriculture also employs 413,500 employees and that's 12% of the workforce."},{"comment_id":"10153509000593984","commenter_b":"She doesn't deserve that child!","commenter_a":"is she in jail now?","post_message":"You'll be blown away by these shocking images... I can't believe a mother would share these, or even do this to begin with...  Do you think she should be punished for this?"},{"comment_id":"10154341383138067","commenter_b":"yeah,I think it is a great idea because Arnold make America ruined again and Donald make Apprentice again","commenter_a":"Publicity stunt. Stay tuned America","post_message":""},{"comment_id":"10156349547100354","commenter_b":"Conservatives learned the lessons of MLK. I think the left needs to review what he preached. It is not the color of the skin but the content of character.","commenter_a":"These people just say what they think and then if it bites them in the rearend they come back with some ridiculous other story which nobody believes but they seem to think that we will.","post_message":"FIRESTORM: MSNBC Liberal Claims She Wasn’t Calling Dr. Ben Carson Racial Epithet...\"Safe Negro\"...Backpedals Quickly...Dr. Carson Campaign Blasts...MORE..."},{"comment_id":"866555523379870","commenter_b":"She is a disgrace can u imagine Laura Bush or Jackie Kennedy doing this ?","commenter_a":"We sure never seen Jackie Kennedy doing something like this. She had class","post_message":"No. Class.   Spread the word."},{"comment_id":"10153645294706756","commenter_b":"why is it people still think illegals vote? they cannot unless they are registered, the only thing the federal gov't requires for illegals is emergency care at hospitals in case of sudden illness or accident, otherwise illegals do not get food stamps or welfare and why would they try to register to vote risking getting caught? some people need to get a new talking points, this one is old and stale","commenter_a":"The Republicans made a conscious decision to go after the angry white conservative male vote with everything they had. Now they get to live with that decision, riding into the sunset as a shrinking regional party based on anger and resentment. A modern version of the \"Know-Nothings\", if you will.","post_message":"To put it one way: \"Republicans have been arguing since 2012 about — do we need to change the pizza or do we need to change the pizza box?\" says David Frum, a former speechwriter for George W. Bush. \"And I think the correct answer is we need to change the pizza.\"  But change, however they want it delivered, has come in fits and starts for the GOP."}]
