[{"comment_id":"238735813255041","commenter_b":"And to think....they probably had children","commenter_a":"When the defendants were acquitted and they were just sitting back in their chairs with cigars in their mouths and everyone was just congratulating them on beating the case they had no remorse for what they did and it's terrible how could you be ok with kidnapping a 14 year old and just dismantle his face and then dump his body in a swamp that was pure evil and hate they had in their souls to just do that to him it's sad.","post_message":"The story behind the photo that exposed racism in America and helped spark the Civil Rights Movement. @webpagelink"},{"comment_id":"872299812875772","commenter_b":"Hillary is spreading disgust. She's a shameless, pathological liar with no morals at all.","commenter_a":"She is a complete idiot as well as a liar.","post_message":"Hillary Clinton says Donald J. Trump is spreading fear. Thoughts?"},{"comment_id":"10153376789317550","commenter_b":"They are corrupt!!","commenter_a":"The judge also needs to be dismissed. Mosby is clearly biased and has acted with contempt throughout the whole process.","post_message":"The charges against the six police officers linked to Freddie Gray's death will not be dismissed and State's Attorney Marilyn Mosby will not be recused from the case, a judge ruled today.  Details here ---> @webpagelink"},{"comment_id":"604189559765558","commenter_b":"Hang the fat pig","commenter_a":"Does anybody really think the Demarcate run US justice system is going to Prosecute, NO","post_message":"One can only hope that this ultra left wing hate monger will meet up with some justice soon."},{"comment_id":"1620932058215182","commenter_b":"Cse'Doobie Major bruh.. she can blink and ash that bih","commenter_a":"Brittlynn Jacob Ygnacio","post_message":""},{"comment_id":"274535909638816","commenter_b":"You are a sick women!","commenter_a":"What's even scarier is Californians that elect her again and again. I was having a discussion with a gent on fb he stated he moved out of the northeast because we were stupid. He stated he moved to the 2nd most intelligent county in the country.I took a wild guess and asked if the state would be California? Bingo! See how these people think. Scary","post_message":"HOLY SMOKES! NANCY PELOSI: Orders People to Clap, Repeats Words Then Calls John Kasich The Gov. of Illinois [Video]  This is embarrassing! She scolds the audience!"},{"comment_id":"10153575506851782","commenter_b":"It doesn't show a picture of the impala. All the vehicles in the picture are police cruisers.","commenter_a":"The article says it was a white impala, is it just me or does that car look black?","post_message":"HIGH-SPEED CHASE: Purcell police are chasing a vehicle at speeds of more than 100 mph on 180th Street: @webpagelink"}]
