[{"comment_id":"10154141552967426","commenter_b":"Those who are always accusing others of hate don't seem to have enough self awareness,intelligence or what ever to know how obvious it is who they hate.","commenter_a":"Welcome to Hillary's America RVA.....","post_message":"\"Your vote was a hate crime,\" was sprayed painted on statues that honor Civil War icons along Monument Avenue in Richmond.  The graffiti was discovered as hundreds protested the election of  Donald Trump as president.  Updates: @webpagelink"},{"comment_id":"1743922275826047","commenter_b":"150 million + illegal immigrants and 150+ million legal citizens out of work. Do the math its a wash get em out. Deport everyone last one of them and void any overstayed visas. Goodbye and goodluck","commenter_a":"These thugs are pay by George Soro's the Super Pac for Hillary, and the Bernie idiots that have nothing better to do.......the point is you will never see Republicans act like these IDIOTS!! This only pisses more people off to vote for Trump!! Trump for President 2016!!","post_message":"***SHOCK VIDEO***  Anti-Trump protestors in Albuquerque, New Mexico stomp on police cars, light Donald Trump signs on fire, wave Mexican flags...."},{"comment_id":"1015593815224063","commenter_b":"impeach","commenter_a":"WORSE","post_message":"This is BRUTAL. Obama and his Zombies will NOT like this POLL. Which answer did you choose? This deserves 50,000K 'LIKES & SHARES!' @webpagelink"},{"comment_id":"10153846533754641","commenter_b":"A VOTE FOR HILLARY WILL BE THE END OF WHAT WE KNOW OF A FREE AMERICA , NO MORALS, ONLY PROMISES AND MORE LIS ! I WAS SHOCKED AT HOW MANY PPL STILL VOTED FOR HER AFTER KNOWING SHE HAS COMMITED TREASON ALONG WITH OBAMA AND THOSE TOP SECURITY TAPES BEING EXPOSED FOR JUST ANYONE TO SEE , THEY CAUGHTBOTH OBAMA AND HER IN LIES WHEN ASKED ABOUT THOSES TAPES . EVEN IF SHE DID MAKE IT TO BE PRESIDENT SHE BETTER NOT GET SETTLED IN TO QUICK , iI HAVE A FEELING SHE WILL BE INDICTED AND OBAMA WILL BE ALSO !","commenter_a":"Every other one is a liar and owned by big $$. What will they do to help you directly? I don't know any millionaires so I guarantee #Bernie2016 s policies will give you more spendable money. He's not really giving anything away, we already pay for most of it and he's found ways to pay for MORE than the rest, the excess will pay down the deficit. He will create jobs and raise wages, which will lift millions of people out of poverty and they will rely less, or not at all, on welfare. (No, this will not cause massive job loss or inflation. When poor people earn more money, they spend it, giving businesses plenty more money to use to pay the higher wages, usually with little to no increase in price.) He will implement a small tax on wall street transactions and other UNEARNED income, and will invest ...","post_message":"Donald J. Trump after a projected 2nd-place finish at Iowa caucuses: \"We will go on to easily beat [ Hillary Clinton ] or [ Bernie Sanders ], or whoever the hell they throw up there.\"   Live updates from the Iowa caucuses: @webpagelink"},{"comment_id":"1218431098240658","commenter_b":"May be time for this earth to be cleansed ethnically.... all with religions other than HUMANITY should be wiped off...","commenter_a":"When will it all fcking stop!!! I think when religion stops their will be peace once again","post_message":"BREAKING: Russian ambassador shot dead in Turkey by gunman screaming 'We die in Aleppo, you die here'"},{"comment_id":"10153561186861323","commenter_b":"Unfortunately that's just not true. Gangs control the production in the UK just like they do everywhere else. @webpagelink","commenter_a":"80% of cannabis consumed in the UK has been grown here. Your argument on that level is invalid.","post_message":"Jay Rayner: \"We are, it seems, living in the age of the wonky moral compass: of middle-class couples who swear by their weekly organic veg box, and yet relax after dinner with a line of something produced by impoverished, subjugated Bolivian peasants.\""},{"comment_id":"10153882907494024","commenter_b":"The monkey bitch and her brood can't be gone soon enough for my taste.","commenter_a":"She complains about the \"house\" she lives in. Is she chained to the wall-?? Just move, bitch-!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"}]
