[{"comment_id":"1279396932093344","commenter_b":"This is why I hate narcan","commenter_a":"Horrible heroin.","post_message":"\"This child can't speak for himself but we are hopeful his story can convince another user to think twice about injecting this poison while having a child in their custody.\""},{"comment_id":"1728567140790384","commenter_b":"Probably gonna be built by the illegals","commenter_a":"Let's do it!! Give jobs to citizens.","post_message":"BORDER WALL: President Donald J. Trump is expected to sign an executive action today to jump start construction of the border wall that he promised would be built during his campaign.  MORE: @webpagelink"},{"comment_id":"10154186390606336","commenter_b":"Just stop. Women are not physically equal to men.","commenter_a":"They should open up the navy seals to women","post_message":"✓ 36-mile race ✓ 8-kilometer swim ✓ 25 obstacles   Her reason for completing the race? She was bullied in school. (CC: U.S. Navy)"},{"comment_id":"1111833728854862","commenter_b":"These women must be screwed up in the head! Why would you throw everything away for a sixteen year old BOY? They should have gotten their kink a little more reasonably.","commenter_a":"\"Endured\"","post_message":"The parents of a male teen student who endured a 9-hour threesome with a pair of blonde high school English teachers have sued the teachers as well as the deep-pocketed local school board."},{"comment_id":"906024782797611","commenter_b":"Them girls need to be arrested. I hope the police is watching this video and found them girls... My heart and prayers go the girl getting jump. No class at all...","commenter_a":"Jesse Chambers","post_message":"UK Girl Couldn't Take It Anymore & Passes Out On Her Feet!    Click Here To See All The Fights in This Months Comp. @webpagelink"},{"comment_id":"10153224075406336","commenter_b":"I'm upset about it too, but let's take a look at our current President. He's stomped on the US Flag toward other nations apologizing for Americas stance for years on policy. He just keeps stomping and we just keep believing lies and hypocrisy.","commenter_a":"What a disgrace to our country!","post_message":"A new social media \"challenge\" is encouraging people across the country to disrespect and stomp on the American flag."},{"comment_id":"1328638283841395","commenter_b":"Generational behavior.","commenter_a":"I've been saying that for over 20 years and people look at me like I've got two heads. Everyone feels entitled including the adults and they pass it on to their children and the problem get exponentially worse. Where and how does one put an end to this......","post_message":""}]
