[{"comment_id":"10154383747512908","commenter_b":"Pussy","commenter_a":"It will never stop. Americans absolutely love guns and violence. The NRA owns this country. I got my passport so I'm outta here.","post_message":"Mass shootings are becoming an almost-everyday occurrence in this country. This sickening and senseless gun violence must stop."},{"comment_id":"10153488869101636","commenter_b":"I am nothing close to a conspiracy theorist, but doing what I did in the military, I seen how cut throat people could be. Especially if they are scared that information will get out there that will harm them. I'm not saying that anybody did tamper with his breaks, all I am saying is that it is possible. Nobody cut his break line obviously because he would of known, but had some drilled a pin hole in a brake line or reservoir, then sealed it to make sure it didn't leak out while sitting stationary. Then as he leaves the drive way he is still able to brake because there is fluid there to press the caliper in, but it breaks the seal and starts to leak out and he could use the brakes so long that the hydraulic fluid is still able to pressure the system. By the time ...","commenter_a":"I am just throwing it out there but Im pretty sure if his brakes had been tampered with he would have known it after the first stop sign or stop light after he started his car.... They dont pick and choose when to work and when not to work when tampered with","post_message":"Police say the data box from Aubrey McClendon's vehicle registered what was happening just seconds before the crash."},{"comment_id":"1566280200058671","commenter_b":"@username stop arguing with fools...","commenter_a":"It is being stolen. We have a President that won a large majority, that has high approval from Americans, and the GOP says it should be up to the guy that won a minority in an incredibly low turnout election.","post_message":"\"It's being stolen from the Obama administration and the construct of our Constitution. And it's being delivered to an administration that has no right to fill it.\""},{"comment_id":"10153541850619712","commenter_b":"It's Bush's fault, and you're a Racist. Let's audit the EBT accounts of people to ensure that they are not out selling 2 for 1 groceries, to get their Malt Liquor and Newport's. There is no Free Ride, you Generational Welfare Leeches. Some people shouldn't Breed!","commenter_a":"that what they do","post_message":"Despite calls for his ouster after making controversial comments about lead poisoning, Gov. Larry Hogan's housing secretary will keep his job."},{"comment_id":"10153816352544726","commenter_b":"This dumb bitch deserved it!!!","commenter_a":"I'm sure it was a hate crime right?","post_message":"WATCH: Trooper Orders Woman To Leave Florida DMV, But She Refuses...Then Goes Nuts!"},{"comment_id":"824106447706135","commenter_b":"Just revoke her security clearance. How could she be president without clearance?","commenter_a":"Ohhh I wish!!!","post_message":"Former Attorney General Michael Mukasey has been making the rounds .."},{"comment_id":"1836299966658207","commenter_b":"Damn @username is just as bad as those UNAmericam bitches","commenter_a":"Hey whoopie knuckle dragging Goldberg, I thought you were leaving if Trump got elected, get the fk OUT of OUR COUNTRY and take your brainless bimbos with you!","post_message":"Things got CRAZY on the set of 'The View'  when one host went completely over the edge, and then demanded that Donald Trump do the unthinkable. Viewers could hardly believe it..."}]
