[{"comment_id":"638889179634994","commenter_b":"Fat hoes crack me up","commenter_a":"Yep. Fat people shouldn't fly","post_message":"This airline is not going to allow people who weigh too much to fly on their plane.  They have absolutely no right to subject us to this.  Do you think this is out of line?"},{"comment_id":"10153353712173984","commenter_b":"Ugly BASTARD.","commenter_a":"Wow Al really got hammered but Al doesn't care he's laughing all the way to the bank.","post_message":"Wow! One of the top conservatives on the internet just lowered the boom on Sharpton in a big way. Many people were thinking it, but only one had the guts to say it..."},{"comment_id":"10153605499851509","commenter_b":"She's doing a great job just having the officers do nothing other then standing around . These Cops should be arresting them instead shes giving these rats a free for all . Disgusting","commenter_a":"Mayor is an idiot. Saw it coming, said had to give people space to destroy, DID NOT CALL A CURFEW, and tomorrow school is cancelled, wonder what the kids will be doing tomorrow DAAAAAAAA","post_message":"What started as peaceful protests days ago have turned violent, with stores being looted, rocks being thrown at police and buildings and cars set on fire. Here's what we know happened today leading up to the violence: @webpagelink #BaltimoreRiots"},{"comment_id":"900975760004551","commenter_b":"Or woman!!!!!!","commenter_a":"Not just white men no man should talk like that it is bad what ever color they are.","post_message":"RT LeBron James: “White Men Don’t Have the Right to Talk Like Trump in Locker Rooms or Elsewhere”"},{"comment_id":"1417324464960761","commenter_b":"We were all originally from somewhere else. The wretched refuse remember! You know the statute of Liberty!!","commenter_a":"Remember Americans are paying for their free benefits!!!","post_message":"What do you think?"},{"comment_id":"1729830760638535","commenter_b":"Stfu dumb niggabitch.. let's see you come up with some rhymes.","commenter_a":"That was shit, idk what you people are thinking sometimes 😂","post_message":"That lie really hurt tho"},{"comment_id":"10156269605955354","commenter_b":"This is so illegal and so disrespectful of those who have risked all for this country. Illegals are invaders.","commenter_a":"Another reason to leave this GD socialist state!","post_message":"It's starting."}]
