[{"comment_id":"10153982598576509","commenter_b":"Burn","commenter_a":"@username Angel Castro @username Ivan Longoria noooooooohhhhhh!!!","post_message":"Some retailers are offering Caitlyn Jenner costumes for Halloween, but critics say these costumes mock the transgender community. What do you think? @webpagelink"},{"comment_id":"1000833706595553","commenter_b":"Too bad we can't deport people who desecrate our flag, but hey, this is America and they have rights! Too bad they can't send these idiots to live in Iran, North Korea or Russia!! Let them try that there and they'll find themselves in front of a firing squad!","commenter_a":"They would","post_message":"Obama's America  Air Force Veteran arrested at Valdosta State University trying to stop Black Power group from desecrating American Flag."},{"comment_id":"481936961966259","commenter_b":"He was the saviour of Manchester last season You fickle lot Haha","commenter_a":"When i read what those nukes are capable of,and that there are people who'd use them,I honestly despair for the human race...","post_message":"Each warhead has an explosive power about 22 2/3 times larger than the Hiroshima blast."},{"comment_id":"10153072865096717","commenter_b":"She would get beat down","commenter_a":"I'm not surprised. The only person she gets along with is Q-Tip, and his single greatest contribution was a cameo on the Dave Chappelle Show where he told kids to \"do the VD dance.\"","post_message":""},{"comment_id":"10153627073939170","commenter_b":"It's gone too far when instead of protecting himself he thinks of the headlines to come and takes a beating.. Time to put the animals back in they're cages.","commenter_a":"I don't have military training or police training but why couldn't an officer shoot towards the legs and feet to attempt to wound or even scare and attacker. I know you would have to worry about the femoral artery and even ricocheting bullets but I seriously doubt every round fired allways hits the intended target when trying to shoot at center mass.","post_message":"Way to go, media. The crooks know the score now and they're taking full advantage."},{"comment_id":"1769143673366303","commenter_b":"They just scared of a woman running the country.","commenter_a":"And I am so sick and tired of people saying, \"I just don't trust Hillary.\" Seriously???? So you will vote for this morally depraved lunatic?","post_message":"But Trump has done them all and is somehow their HERO!  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152956831331130","commenter_b":"Wow... talk about a student taking the teachers to school.","commenter_a":"Her parents really wrote a good speech.","post_message":"Somebody give this little girl a medal!"}]
