[{"comment_id":"646317502237529","commenter_b":"Better ban these assault tree's!","commenter_a":"I have done these cases before. There is no excuse for this type of thing to be happening if the trees are being properly inspected and cared for. There are certain types of trees that should not be in public parks because they are known to do this. God be with the family.","post_message":"BREAKING NEWS: A woman who was killed when a tree fell on a wedding party at a Whittier park has been identified as the mother of the bride."},{"comment_id":"800418456754419","commenter_b":"She shd be in jail","commenter_a":"Nobody in the GOP can't come to Hillary's standards, there is no comparison.. She is one smart and prepared capable Madam President!","post_message":"The #GOPDebate may have ended, but CNN’s Chris Moody is live, taking your questions from the post-debate spin room in Miami."},{"comment_id":"1128755127223092","commenter_b":"They are stopping them by firing these loose mouth bigots.","commenter_a":"Now employers can terminate employees for not having the same politics and ideological dogma as their bosses. The Radical Left is destroying America. They must be stopped.","post_message":"“She has expressed values that are at odds with ours and she has compromised her ability to meet the teaching and patient care mission of the School of Medicine.”"},{"comment_id":"10154314323247174","commenter_b":"Lets don't and say we did.","commenter_a":"I wonder how their wives think about all this press about women in armor , arty, and infantry?","post_message":"Meet the Marine Corps' first-ever female field artillery officers."},{"comment_id":"738344672965380","commenter_b":"They'll never get in!","commenter_a":"I wouldn't say he told Obama off...more like explaining the way of things in Radical Islam...because that moron needs to have it explained to him...2016...get here quick!!!","post_message":"Ohhhhhhbama."},{"comment_id":"10154670858254726","commenter_b":"You and your buck toothed ol hag can mind your business.","commenter_a":"Do better Laura.","post_message":"The Guinea Pig Speaks on the election!"},{"comment_id":"793038077515812","commenter_b":"Omg yes","commenter_a":"@username we need this","post_message":"This is the perfect party game to play with your stupid friends: @webpagelink"}]
