[{"comment_id":"10154201657127541","commenter_b":"White terrorists","commenter_a":"When we figure out that words isn't going to change minds of white people best believe if they knew there would be retaliation then they will think twice.","post_message":"Because federal terrorism statutes almost exclusively focus on foreign extremists, he won't face terrorism charges, but he could face 10 years in prison."},{"comment_id":"10153223251130329","commenter_b":"What a nasty bitch.","commenter_a":"Wow that Katie chick is a bitch.","post_message":"Awesome."},{"comment_id":"10153091519691680","commenter_b":"Yeah, but Vance. Don't forget the illegals & their anchor babies ? Factor them in, & you have a wipe out. Yes, foreign, along with illegals, WILL DECIDE THE NEXT PRESIDENT & GOVT","commenter_a":"Democrats only need 38% of the white vote-- we get that with no problem. Romney only got 24% of Hispanic vote and 5% of African American voter. Because of Trump, Hillary will EASILY get 85% of Hispanic vote. Hillary will also score 80% of Asian vote for a landslide win in electoral college","post_message":"Noncitizens are factored into the electoral college. @webpagelink POLITICO Magazine"},{"comment_id":"675938265864099","commenter_b":"@username you wish your wife could be a go go dancer.","commenter_a":"Melania is an absolutely classic beauty. Proud of our new President and First Lady. May this country start healing and become whole again.","post_message":"Donald J. Trump was just sworn in as the 45th President of the United States.   How does this make you feel?"},{"comment_id":"1792493044351097","commenter_b":"For the safety of the country, her and everyone linked to her SHOULD BE PERSUED, THEY NEED TO DO IT. Unless all this was just political carpet-bagging, I'd hate to have to believe that, but their out to break this country, and if they aren't taken to task They Will Break This Country!!! Trump, keep your promise, were counting on you...","commenter_a":"He's just another elite ..with promises to get elected and being schooled by the negro ..he never meant to do anything he said ..he panderd to us all..","post_message":"President-elect Donald Trump and his transition team signaled Tuesday that his administration will not pursue further investigations of Hillary Clinton, backing off a vow on the campaign trail to appoint a special counsel to probe his Democratic rival secret email setup as secretary of state and suspected pay-to-play deals involving her family foundation."},{"comment_id":"1016358938401725","commenter_b":"MONEY !!!!! That's all they care about !","commenter_a":"probably worried about all the money they have stashed in offshore funds they may have to pay tax now","post_message":"\"I don't think I've ever wanted magic more.\" J.K. Rowling, James Corden and more British celebrities react to the historical #EURef vote. @webpagelink"},{"comment_id":"10152641066602061","commenter_b":"She not mom she don't deserve kids.","commenter_a":"No true mother would ever give up her child she should not be allowed to have any more children!","post_message":"UPDATE: Mom calls decision to give up newborn with Down syndrome \"hardest moment\" of her life. @webpagelink"}]
