[{"comment_id":"10153213322076051","commenter_b":"First of all, this is a fake.","commenter_a":"looks accurate to me what the problem? does the truth hurts there wittle feelings","post_message":"This is the 'memorial' for Michael Brown that went up on a police Facebook page."},{"comment_id":"524012904454471","commenter_b":"Like fuck she will. We need to get so fucking loud they hear us in China. WE DON'T WANT ANYMORE OF THESE SOULLESS SHITHEADS IN OUR COUNTRY. This all part of the goatloverocrats plan to divide us more. We have got to stop this.","commenter_a":"We should have them settle right next door to her house in upstate NY","post_message":"Voters are outraged by this.  How does this benefit and protect Americans?"},{"comment_id":"10153540749847452","commenter_b":"Yousef Danial","commenter_a":"Mariah Morgan Savannah Marshall wtf hahaha","post_message":"A suspect wanted for attempted murder hits multiple cars while trying to escape the California Highway Patrol during a chase on the 91 Freeway in Orange County. abc7.la/1NlhVx9"},{"comment_id":"613032028845756","commenter_b":"Well I can only say if you had to live with Barack Obama as president for 8 years she might see herself that way.","commenter_a":"Else get bitch out of.thire","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"1242392142481615","commenter_b":"Scumbag.","commenter_a":"Is that hair under her arm. Yuk!","post_message":"TRASHY, AGING Pop-Star Madonna Uses Picture Of Pubic Hair To Recruit Females For Anti-Trump Inauguration March  ***WARNING***Picture contains partial nudity."},{"comment_id":"1611331605832486","commenter_b":"Just the fact that Hillary has a list long enough to get e locked up for life, and she's still a president candidate shows how rigged the whole system is...","commenter_a":"Lier.","post_message":"“Of course the elections will not be rigged. What does that even mean?”   President Obama called Donald J. Trump’s claim of a rigged election “ridiculous,” saying \"At the end of the day it's the American people's decision.\" @webpagelink"},{"comment_id":"1057273917621602","commenter_b":"No lol","commenter_a":"One world order ?","post_message":"You can't possibly understand America's greatness if you look at this country as nothing more than a series of grievances that need to be addressed.  You can't see greatness at the same time you see that."}]
