[{"comment_id":"839844146064134","commenter_b":"Women want it all, money,, looks, and a man who does everything right?, that has made me want all the same from a woman, sO far no luck, it's not a hero juzca person who shows love everyday, in everyway and a REAL woman not a Queen to appreciate it!","commenter_a":"If only we were all blessed with that. He's a hero plus a husband who gets it!!","post_message":"SO SWEET! The way to a man's heart may be his stomach, but one devoted husband has proven that women's love can come from a man who can"},{"comment_id":"10155784573999657","commenter_b":"Does this woman ever smile?","commenter_a":"Has she and all other politicians done this already or are planning to follow what she wants?? If not why should Mr Trump do something no other politician has ever done!! Can't hold him to a standard that no one else is following or has ever followed!!!","post_message":"Ethics and Intellectual Consistency."},{"comment_id":"10152707448786051","commenter_b":"Are you calling ma a stupid whore","commenter_a":"Humans aren't very nice they are constantly making fun of people for every reason possible so don't be shocked","post_message":"When this police officer heard his co-workers mocking special needs children, he lost it."},{"comment_id":"10153544166434024","commenter_b":"NY is the capital of THE WORLD! If you don't want to spend money LIVE SOMEWHERE ELSE! As far as Cruz goes I thought Republicans want smaller government. ??? Good get out of our marriages and get out of our doctors offices. (Women's Drs offices)","commenter_a":"Freedom of speech... He's right about the liberals in NY. Who cares. NY is insanely wrong when it comes to taxes and wages... The truth hurts.","post_message":"WATCH: Ted Cruz slams Gov. Cuomo and Mayor de Blasio when asked about calls for an apology for his remarks on \"New York values.\"  Your reaction to Cruz's latest comments?"},{"comment_id":"498132093702004","commenter_b":"Simone de Beauvoir said women were their own worst enemies.","commenter_a":"Callous treatment of human life?? Funny coming from a woman who tried with all her power to block her own residents from receiving healthcare under ObamaCare!!","post_message":"Not cool Gov. Haley!"},{"comment_id":"10153756549625667","commenter_b":"No Trump No Hillary, any body else, American have the best.#","commenter_a":"like my page awlad nass","post_message":"As the Iowa State Fair got started 20 years ago, two people were shot dead in the exhibitor campgrounds."},{"comment_id":"10154181766797093","commenter_b":"It's non violent offenses .","commenter_a":"What about victims? Can you erase their memory?","post_message":"If you have a criminal record, a group of Dallas county judges will help people with criminal records get their lives back on track. bit.ly/2li0sJ9"}]
