[{"comment_id":"10153698610918132","commenter_b":"She is a jerk","commenter_a":"Yeah, God forbid anyone may ever be inconvenienced. Typical Americans -- it's all about ME ME ME. \"Oh my gawd! My dinner was ruined because a toddler was crying! I want my money back! Boo hoo!!!!\"","post_message":"Nope, not sorry."},{"comment_id":"1542774025748103","commenter_b":"As usual women come ro the rescue","commenter_a":"What kind of crap insinuating Hillary in this???","post_message":"YES!"},{"comment_id":"751318988350209","commenter_b":"Wondering if Melania has to listen to the snorting every night in bed!!!","commenter_a":"Why doesn't he realize that he has this problem with his nose, which only appears at the debates and not at any other occasions.","post_message":"It's just allergies, right? Right?! --Andrew"},{"comment_id":"10153780457712217","commenter_b":"you must be a left-wing refugee welcomer :D","commenter_a":"WRONG! People on the scene say it was a gas leak explosion not some suicide bomber...Mainstream media never let a tragedy go to waste","post_message":"The man detonated a backpack device after being refused entry to a music festival."},{"comment_id":"10153878588886545","commenter_b":"Exactly I thought woman that age... can't have kids, no more.","commenter_a":"Why is a 62 year old getting pregnant and having young kids ? Second the 6 year old is only doing what he sees and what he thinks it's right . Do I think he's a bad seed no . Do I think he needs help after this yes.. This is obviously the only behavior that he knows ... I hope the mom suffers in jail .","post_message":"Kathleen Marie Steele of North Redington Beach, near Tampa, Fla., has been charged with aggravated manslaughter and neglect for the infant's death."},{"comment_id":"10154592575994062","commenter_b":"Hang these neggos today !!!","commenter_a":"They don't even care that they took someone life, so no one should care when they are giving them the chair","post_message":"TODAY: 4 accused of robbing a Houston restaurant and killing a man are scheduled to appear in court."},{"comment_id":"10152869817141130","commenter_b":"Sounds like you're a bitch who can't take a compliment.","commenter_a":"Maybe because when men try to pick me up it goes like this: Them: \"Hi, gorgeous.\" Me: \"F*ck off.\"","post_message":"\"It's not that I'm opposed to meeting someone. I just don't feel it's necessary.\""}]
