[{"comment_id":"972848449477340","commenter_b":"@username YOUR PARENTS MADE A BAD DECISION WHEN THEY CONCEIVED YOU...YOU ASSHOLE!!!!","commenter_a":"Does anyone really think Hillary Clinton is presidential material or qualified to be president of the United States? Think about that for a sec. She's made bad decisions and poor choices all of her life. From whitewater to Benghazi. She's incompetent to say the least and can't be trusted in her decision making abilities. She's been fired for being unethical or ethics violations and just recently had national security issues with her email. Not to mention being a lying ass crook. Presidential? Not hardly!","post_message":"Early polls show Hillary Clinton would handily beat both Trump and Cruz in a general election. Are you hoping to see Clinton become America's next president?"},{"comment_id":"10154174806427293","commenter_b":"Girl...you need some self respect letting yourself get played like that How much are you getting paid.You ARE getting paid right?","commenter_a":"Basically she saying HE'S CLUELESS","post_message":"Donald J. Trump's campaign manager was pushed today on \"Morning Joe\" to explain some of his recent comments."},{"comment_id":"10154342587333258","commenter_b":"David Mayhew The problem with your statement is that your assumption is that just because they have been drinking, they are going to use a gun. Just because a guy drove to a bar with his car does not mean that he's going to do something irresponsible with it. I guess we should start seizing the cars of bar hoppers. Or we could categorize those cars that are most often DWI that injure or kill someone as \"assault cars\" and start seizing those.","commenter_a":"Fewer guns would not have stopped this lunatic. We need more good people to be able to lawfully carry guns into more public places because the criminals will carry them wherever they want.","post_message":"The common thread in too many mass shootings was the availability of powerful semiautomatic weapons that serve no purpose but to kill. | Via Boston Globe Opinion"},{"comment_id":"1322891364416984","commenter_b":"Yes, Hillary should go to jail IMMEDIATELY!!!!!","commenter_a":"I am not voting for Hillary Clinton.","post_message":"CORRUPTION IS INSANE.  Americans getting screwed.    @webpagelink"},{"comment_id":"10153862268256680","commenter_b":"@username I was waiting for Hillary to pass out again and need to get dragged off stage. Maybe next debate!","commenter_a":"He wasn't great we can admit that but he just needs to show he can sit in the chair and he more than did that!","post_message":"Donald J. Trump is used to audiences that are already primed and ready, unlike the debate crowd."},{"comment_id":"969371743179604","commenter_b":"Too bad Donald Trump is here to stay he's going to be the president and beware lady he's going to build a wall and you're probably one of the ones that he's going to be sending back to Mexico because you're probably illegal","commenter_a":"Bought and paid for I might add!!!","post_message":"Protestors in Mexico, I mean California, are saying Trump doesn belong in the United States. What do you think? @webpagelink"},{"comment_id":"644296295760949","commenter_b":"I'll wipe my butt with everyone that comes my way","commenter_a":"Not even on a penny","post_message":"Obama is trying change our countries money.  He has absolutely no right to even consider this change.  Do you think Obama deserves to have his face on a dollar bill?"}]
