[{"comment_id":"10152906216427522","commenter_b":"Freddi Birkhder you are too stupid to pour piss out of a boot even if the instructions are on the heel. The Cheney/bush thugs negotiated the withdrawal from Iraq you mindless twit. GFY","commenter_a":"Not surprised!!! Christians are being blown up!by Isis,and Obama is smiling!evil man.","post_message":"Yes, he too is reading Ta-Nehisi Coates' new book:"},{"comment_id":"1007967755882148","commenter_b":"All parents need to step up and take charge like this mom. There would a lot less bs going on with teenagers these days.","commenter_a":"that it's mother style similar to CUBAN MOTHER BRAVO;MOTHER UNITED ja,ja,ja toma pelona qien lleve los pantalones a la hora de mandar.I ALWAY SAID TO MY SON THE DAY THAT YOU TRYING TO GOES OVER ME UNTIL THAT YOU GOES TO KNOW WHO IT'S YOUR MOTHER NEVER TRY","post_message":"Be sure to LIKE WND.com to stay connected!  @webpagelink"},{"comment_id":"10154375635804342","commenter_b":"@username oye pendeja....white girl....give it a rest!","commenter_a":"As long as Trump doesn't show up, I don't see the problem. He can't help who supports him, just like Hillary can't help that all her supporters are cry babies.","post_message":"One of the largest Ku Klux Klan groups in America plans to celebrate Donald Trump's election with a parade."},{"comment_id":"918430954940350","commenter_b":"Just another pussy!!!","commenter_a":"Hell! Any firearm can be used to hunt.","post_message":"Bernie Sanders Plans to Outlaw all 'Non-Hunting' Firearms!"},{"comment_id":"10153472677806051","commenter_b":"Ugly and a moron. She'll make some desperate man really happy","commenter_a":"😳😱","post_message":"This model decided to remove six ribs to look like Jessica Rabbit. Now she's facing the consequences."},{"comment_id":"963715427023908","commenter_b":"Thugs is a nice word for these fools...","commenter_a":"Disgusting!!","post_message":"SAVAGE THUGS DIG UP CONFEDERATE SOLDIER: Group Fed Up With Waiting Begin Digging Up Confederate General Grave (VIDEO)  NO RESPECT!   @webpagelink"},{"comment_id":"10153216710121051","commenter_b":"Piss poor radical Muslim a$$holes!","commenter_a":"Piss poor life guards...","post_message":"Lifeguards desperately wanted to save this drowning woman - but her father refused to let them do it."}]
