[{"comment_id":"765775893538794","commenter_b":"What about women that do?","commenter_a":"Wonder what this means for me","post_message":"Research Says Men Who Take Selfies Have More Psychopathic Tendencies"},{"comment_id":"10153362119139087","commenter_b":"IF I WERE A JEW ,,,, i would not want this broad on my side shes a idiot !!!!!","commenter_a":"Oh, please nitwit.","post_message":"“Our country turned [900 Jewish refugees fleeing Germany] away, and many who were sent back to mainland Europe were killed in the Holocaust,” said Democratic National Committee Chairwoman Rep. Debbie Wasserman Schultz. “Instead of learning from that mistake, Republican candidates and politicians were eager to repeat it.”"},{"comment_id":"10153200811382377","commenter_b":"I'll agree with you on that , but it still doesn't change my position on accepting unvetted refugees !","commenter_a":"So he just declared the Obama administration a terrorist group then !!","post_message":"British Prime Minister David Cameron: \"The Muslim Brotherhood is not the only movement that promotes values which appear intolerant of equality and freedom of faith and belief.\""},{"comment_id":"10153165727051770","commenter_b":"No to Muslim Migrants..call congress..made four calls today..totally agree..Europe is in chaos..rapes and violence..and the media does not talk about it","commenter_a":"Yes sir, exactly what we need. Thank you for caring for the true Americans.","post_message":"BREAKING: Donald J. Trump calls for a moratorium on allowing Muslims to enter the United States.  \"Until we are able to determine and understand this problem and the dangerous threat it poses, our country cannot be the victims of horrendous attacks by people that believe only in Jihad, and have no sense of reason or respect for human life.\""},{"comment_id":"686618911486884","commenter_b":"Does this arbitrary terrorism not offend a large number of your customers, therby, justifying, really justifying firing such a dumb asshole?","commenter_a":"How much do he makes,","post_message":"This might be the worst CEO in the country and no, it’s not Papa John this time."},{"comment_id":"10150911052459999","commenter_b":"She ain't gonna be there folks - Someone on the DT team has a modicum of intelligence - Trump had an affair with his 2nd wife while still married to the first -inviting Flowers would Gain Hillary a Lot of Sympathy - guess what, it isn't the woman's fault when her husband cheats -Trump is Stupid & his handlers have to keep reining him in - Pitiful","commenter_a":"THE BLACK NARRATIVE IS TO COMMIT \"CIVIL DISOBEDIENCE\" PROVOKE THE POLICE INTO INJURING OR KILLING THEM, THAN SUE TO GET A $$$ SETTLEMENT. MOST ALL BLACKS INVOLVED IN THIS SCHEME HAVE A BLACK LAWYER'S NUMBER ON THEIR SPEED DIAL.","post_message":"Donald J. Trump's team flatly denied that Gennifer Flowers would attend Trump's first debate with Hillary Clinton. Flowers's claims of an affair with Bill Clinton imperiled his 1992 presidential campaign."},{"comment_id":"1602376966724515","commenter_b":"@username I am fully aware of who I have voted for since 1992. Hillary Clinton put herself in this position by NOT doing what's right and serving HER own interests. Public Service is a privilege and shouldn't be abused. I look forward to more ethical women running for President in the future, hopefully in my lifetime.","commenter_a":"She puts herself in a coma just hearing herself!! Her own husband is so unimpressed, HE doesn't know her campaign slogan!!","post_message":"LIVE NOW: Hillary Clinton early vote rally, Cedar Rapids, Iowa"}]
