[{"comment_id":"1677003925887340","commenter_b":"@username, why do many Americans believe that Obama isn't concerned about protecting America? He has given no indication whatsoever that this is the case. As a matter of fact, he does just the opposite. Do you seriously believe that building a wall at the Mexican border and not accepting any refugees will do anything to stop terrorism? The roots of terrorism are not illegal immigrants or refugees. The roots of terrorism are Americas interferences in the middle east. The roots of terrorism are people who say \"bomb them and take their oil\". How would you feel if someone would say this about the USA? Terrorists can be fought with weapons but terrorism can only be fought with education. And this is exactly what Obama does. Educating people...by talking about Islam, by visiting a mosque, by saying he will stand with the Muslim Americans. That doesn't mean he hates Christians or ...","commenter_a":"Congratulations Mr. TRUMP. We look forward to seeing you here in SC. Our country needs a strong leader that's going to make this country great again. We need someone in the white house that actually is a christian, strengthens our military and will secure our borders. Take care of our people first, the great people of the United States.","post_message":"Good morning America! THANK YOU for your vote, New Hampshire! We will MAKE AMERICA GREAT AGAIN! Off to South Carolina today. Everyone have a GREAT DAY, and again- thank you!"},{"comment_id":"10153577696206337","commenter_b":"yeah.. IM gross wonder how many old fat bitches are just jealous that some 16 year old whore was getting his footlong? \"young teen: my azz, she was advertising on craigslist looking for the D 16 is legal in his state moron for good reason. id pound the shit out of some 16-17 (contingent on state) year old pussy fuck yall","commenter_a":"God damn it, Jared. We don't have to worry about Ronald FUCKING McDonald FUCKING AN UNDERAGE GIRL!","post_message":"BREAKING: Former Subway spokesman Jared Fogle allegedly bragged about paying for underage sex in a series of lewd, sexually explicit texts..."},{"comment_id":"10154559910664087","commenter_b":"@username: Are Christian refugees beheading non-Christians?","commenter_a":"They can rewrite it. However, they still have the footage of Trump calling for a Muslim ban on the campaign trail.","post_message":"BREAKING: White House attorneys are working on rewriting the language of President Trump's immigration ban following yesterday's dramatic defeat in the appeals court."},{"comment_id":"1023434111010933","commenter_b":"someone can't read the headline in the article lolol","commenter_a":"Stop blaming anti vaccers, we are the ones smart enough not to inject ourself or others with the disease.","post_message":"Way to go, anti-vaxxers."},{"comment_id":"10153021059601051","commenter_b":"What a cruel woman","commenter_a":"All I can say, is he is better off without her for a mother.","post_message":"This baby's mom decided she didn't want him anymore and had him deported."},{"comment_id":"652127268253788","commenter_b":"To you Mrs. Michele Obama I say name me just one all white college. I am not racist, I do have several black friends. Being white of course I do have more white friends, then black friends. They seem to under stand my point. But for blacks to say they can't go here or there. I don't see those barriers. I wish we all can stop this racist name calling g and pointing fingers, at each other. I know I can name at least 4 black colleges. I just want to know if anyone can name me just one all white college.","commenter_a":"why is she there? go home & drink some tea","post_message":"A race baiter who is not proud of her country."},{"comment_id":"10153387140986323","commenter_b":"How did the chicken cross the road? Roads, where we're going we don't need roads.","commenter_a":"Go Peter Rabbit!! (Y)","post_message":"Is this rabbit really scurrying across an avalanche?"}]
