[{"comment_id":"10153394886826336","commenter_b":"Mexicans run America now and there is nothing u can do about trump ur screwed...don't run for president no more there is no way ur going to win piece of","commenter_a":"Sue them to Mexico and back!","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"1013388188713944","commenter_b":"All the illegals !!!","commenter_a":"All this happen cause of sin of Obama take our flight mh370 and keeping our passanger","post_message":"Will the blue helmets arrive to relocate tens of millions of Americans?"},{"comment_id":"10157833326000093","commenter_b":"The most hated woman in the world !","commenter_a":"Time to put the Clintons and their never-ending, gross and creepy scandals out to pasture.","post_message":"The Clintons and their minions deserve to be driven from public life."},{"comment_id":"10153772701693271","commenter_b":"If you look back, I didn't say \"productive\". I said \"meaningful\" and, I'm hardly \"bent out of shape\". Does this effect me personally? Not really. But, it does effect my community/state/culture...whatever you want to call it. A day to celebrate pot? It's laughable to most. You can think I'm ignorant all you want, I still think it's ridiculous. Again, my opinion. Not sure why you feel the need to argue with me.","commenter_a":"Go to work. Volunteer. Do something meaningful. Beyond ridiculous.","post_message":"Denver's 4/20 rally has been rescheduled."},{"comment_id":"967810213254438","commenter_b":"Phony bitch","commenter_a":"Good new Ian you can now give blood from your arm instead of your B-hole. Joe Mark and @username can give you a ride","post_message":"There's still a lot of controversy around this."},{"comment_id":"10153533564596438","commenter_b":"This is why people are turning against feminism. Jeremy makes a legitimate point, and everyone attacks him because they don't like what he has to say, but he is totally right. Women like her don't need to have a victim mentality because she is more successful than the majority of men on this planet. Victim playing just holds people back and places limits on you before you even get started. Why not go out there, be confident, and refuse to let anything keep you from achieving your goals?","commenter_a":"Wealthy ladies are almost never feminists in actuality. They'll say they are because they need to in order to keep up a certain facade. But they've proven that women are able to be (more) successful and that most of the BS spouted by modern feminism is just that. It's not like someone's political views should matter anyway for the most part. Celebrities are human too.","post_message":"Marion Cotillard says she's not a feminist. Should we care?"},{"comment_id":"829690333773863","commenter_b":"The black community needs to clean up their act, plain and simple.","commenter_a":"This type of person should not be free.","post_message":""}]
