[{"comment_id":"635093840035049","commenter_b":"The only duty this bitch understands is money and do what frump trump Hitler wants !!","commenter_a":"Hopefully she will realize that she is in way over her head and resign.","post_message":"Betsy DeVos has demonstrated she has a rudimentary understanding of the issues facing our students, teachers, and schools, which should have disqualified her from serving as Secretary of Education. She possesses no experience with the public education system as either a student, parent of a student, educator, or professional working on education policy. Now that Ms. DeVos is confirmed, she is charged with the responsibility of advocating for and protecting ALL students regardless of their background. I hope that she will fully embrace this duty."},{"comment_id":"980020968705428","commenter_b":"It's been a long time coming. Let's make this happen so our daughters and granddaughters are free from the harassment that we were told to \"just deal with it\".","commenter_a":"We need something like this! Jasmyne","post_message":"The video is intense, but its message is so needed. - Parker Marie Molloy"},{"comment_id":"636925316432507","commenter_b":"Fuck yeah, good on them we don't need those greedy pigs.","commenter_a":"Hungary - home country of George Soros, He's a Hungarian Jew.","post_message":"The head of Hungary’s central bank has called for the International Monetary Fund to close its office in Budapest."},{"comment_id":"1349219015129494","commenter_b":"Stfu","commenter_a":"Trumpers 2 days ago: yay Castro is dead! yuge win for free speech and human rights! CheetoJesus: citizens whom use their rights of free speech and ability to protest should be jailed or deported! Trumpers today: praise our Dear Leader! deport those commies!","post_message":"A fiery debate erupted over President-elect Donald J. Trump's proposed penalty for burning the American flag"},{"comment_id":"10153341688578984","commenter_b":"I love Judge Pirro, I wish she was running for president, instead we have a lying liberal.","commenter_a":"I wish that Judge Jeanine would run for President! Just think how our country would change!","post_message":"You can see why this lady was one heck of a prosecutor before becoming a judge. If only she could get Hillary into a courtroom.  Do you support the way Judge Jeanine is fearless in her truth-telling?"},{"comment_id":"10153544457476509","commenter_b":"Thanks","commenter_a":"Why are animals doing what animals do all of a sudden national news?","post_message":"What a catch! Hear photographer John Bailey describe stumbling onto the powerful sight of a bobcat pulling a shark from the ocean: @webpagelink"},{"comment_id":"10157390239980354","commenter_b":"Strip their citizenship and deport them. They do not deserve to be American citizens.","commenter_a":"BLM must be destroyed as a movement...just like the mob, or any other organized terrorist group.","post_message":"The BLM radicals shut down a CA freeway and vandalized an Oakland police station..."}]
