[{"comment_id":"10152641066602061","commenter_b":"She not mom she don't deserve kids.","commenter_a":"No true mother would ever give up her child she should not be allowed to have any more children!","post_message":"UPDATE: Mom calls decision to give up newborn with Down syndrome \"hardest moment\" of her life. @webpagelink"},{"comment_id":"1072715589511885","commenter_b":"I would call him much worse than a monkey.","commenter_a":"That's insulting to monkeys the world over!!! Ann PLEASE think before bad mouthing the monkeys...","post_message":"VIDEO: Ann Coulter Just Created A HUGE Firestorm, Outrage after Calling Obama A  On National TV Ann Coulter is under attack over this.  Can we get 5,000 'LIKES' for Ann Coulter?  @webpagelink"},{"comment_id":"1134902403269479","commenter_b":"If they think it's so needed, why hasn't it been in place to stop rape before?","commenter_a":".","post_message":"Things just got seriously DANGEROUS for trans students in North Carolina..."},{"comment_id":"10152857633614753","commenter_b":"why these people even walking the earth...round them up and send them to isis","commenter_a":"Assholes a","post_message":"These people need to be banned from America."},{"comment_id":"1033963386626709","commenter_b":"Please Kathy. Just run the Pap strip over your big mouth. Infected!!!","commenter_a":"Trust me Kathy........Nobody want to see your Ugly......Except maybe KILLARY!!!!","post_message":"Another classy remark from Kathy Griffin."},{"comment_id":"873492039433845","commenter_b":"make all the illegals-legal so thats 10 million persons paying taxes. we could sell the republicans to the dog eating festival. thats say 100 dollars.","commenter_a":"cool give them texas. that would be hilarious!!!!!!","post_message":""},{"comment_id":"923696117653244","commenter_b":"She's not that pretty. Having breast implants make her look more like a man","commenter_a":"I heard she was back. What's Botched about?","post_message":"“One Tit Is In Africa And The Other One Is In Europe.” Tiffany “New York” Pollard To Appear On “Botched”"}]
