[{"comment_id":"1482883781727172","commenter_b":"Once the snowflakes find out the expense of their new revolution will cost them their Pot money....they will reconsider. But hey...the gun community is an inclusive bunch. This should be interesting to watch. They will be easy to spot wearing their skinny jeans with a big bulge printing for me to keep an eye on.","commenter_a":"These people give a new meaning to the word stupid!","post_message":"Unreal."},{"comment_id":"10152924190906336","commenter_b":"Obama, take lessons from them. Hire illegals to build the wall and when it's done, toss them on the other side","commenter_a":"And america welcomes all through mexico.","post_message":"Saudi Arabia is constructing a 600-mile \"great wall\" along its border with Iraq to keep ISIS and other extremists at bay."},{"comment_id":"10153429629189087","commenter_b":"Deport all illegals","commenter_a":"California...the Land of fruits and nuts...and illegals...and terrorists","post_message":"\"America is great. Trump is disgusting. Anybody but Trump,\" read words dotted across the sky above the annual Rose Parade in California on Friday."},{"comment_id":"10154153451894197","commenter_b":"nice, she can afford to leave, no doubt on our dime.","commenter_a":"and who didn't see this coming","post_message":"Former Governor Rell is moving to Florida, and she is not happy about the direction of Connecticut.   Have you considered moving for tax reasons?  Watch Face the State with Dennis House this morning at 11.    Preview here: @webpagelink"},{"comment_id":"911159142284175","commenter_b":"Wtf! Lmao dumb bitch","commenter_a":"@username @username 😂","post_message":"SMH"},{"comment_id":"10153702399577377","commenter_b":"TRUE----BUT SHE OBVIOUSLY HAS THE WHERE WITHALL TO BUY PEOPLE OFF.","commenter_a":"SHE AND OBAMA NEED TO BE IN PRISON","post_message":"Former New York City Mayor Rudy Giuliani said Monday Hillary Clinton could possibly be the worst secretary of state in history."},{"comment_id":"10155021805082501","commenter_b":"He's a Big joke andhorrible mouth. When General's don't approve of him how can YOU?","commenter_a":"Your headline should be Duck Femocracy. The DC elite do not get to elect our President.","post_message":"Ted Diadiun: We are on the precipice of a catastrophic national political decision as we prepare to elect our 45th president."}]
