[{"comment_id":"10154058218236770","commenter_b":"Procecute this women she just as dishonest as Hillary","commenter_a":"Obama tossed her under the bus. So much for loyalty.","post_message":"Attorney General Loretta Lynch is defending the FBI against allegations that the bureau mishandled investigations of email hacks of Democrats and focused too much attention on Hillary Clinton’s private email server."},{"comment_id":"10152972266751051","commenter_b":"No, phuck you, Eric! Get out of my country if you can't respect it. And that stupid bitch is just another moron who probably thinks we have a black president, too. Can't have a white momma and be black........DUH!","commenter_a":"Go to a country who has a flag you like, BITCH.","post_message":"This American flag social media challenge has become increasingly popular over the past week."},{"comment_id":"1694121650829136","commenter_b":"@username the immigrants themselves cannot legally however once they have a child in America we won't kick them out because they have to raise there American born child this is the idea called anchor babies","commenter_a":"What about his son? His wife is from Hungary right and his other kids had a Mother not American. How does that work?Ship them back I guess.","post_message":"\"No, it’s not in the Constitution. If you read and if you look, and if you go to the real scholars, like different people that I can give you, they will tell you.\" – Donald Trump  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10157544266265206","commenter_b":"Pervert","commenter_a":"Manzoor Hassan @username ye kon ha ?","post_message":"“My heart dropped into my stomach, and I was immediately hysterical,\" the woman said."},{"comment_id":"10154072971081756","commenter_b":"what is the average age of someone on Medicaid? If it's what I think, I think the horse the barn long ago with these folks quitting smoking.","commenter_a":"Wellbutrin, as pictured, is often used to help people quit smoking and is used as an anti depressant BUT (there's always a but.....) it can cause mental health issues itself such as hallucinations, manic symptoms, etc.","post_message":"Despite one-third of Medicaid participants being smokers, many states aren't doing enough to help people in their Medicaid programs quit."},{"comment_id":"1873334889566400","commenter_b":"I'm thinking entertainment value. After he leaves office, it will be obvious what a loser he is.","commenter_a":"Idiot","post_message":"President Barack Obama plans to speak out when he believes he needs to during the presidency of Donald Trump."},{"comment_id":"10154170724496409","commenter_b":"@username, according to YOUR new president, we can all drop by your house and grab your pussy...Don't get mad at me, trump said it was alright.","commenter_a":"Obummer sucks. DONALD TRUMP. None of you can change that. Poor pitiful liberals you really do make yourselves look desperate and ridiculous","post_message":""}]
