[{"comment_id":"10154985622284687","commenter_b":"She schould blame her father for this","commenter_a":"Brilliant ! Will do","post_message":" is just  it's a wonderful line. I own some of it. I fully  I'm going to give a free commercial here. Go buy it today, everybody. You can find it online."},{"comment_id":"10153047455238984","commenter_b":"would not let that les hatefull bitch raise a golld fish, fel sorry fr her children","commenter_a":"Rosie O'Donnel's son is still trying to deal with the fact that his mother bought him from a cash strapped viewer of her tv show.","post_message":"Oops. This isn't what the left wanted them to say..."},{"comment_id":"10153398381514364","commenter_b":"Social security is the world's biggest pyramid scheme. It will eventually crumble, and I have no doubt it will do so in my lifetime.","commenter_a":"I'd love to have my social security tax, 6.2% of my income, go into my 401k or Roth. I don't need the government to help me save for retirement.","post_message":"They aren’t being straight with the American people, and they know that."},{"comment_id":"10155032769051757","commenter_b":"Great","commenter_a":"Excellent! I hope to see you do many more of Fox's interviews with President Trump. You deserve it. Thank you for always reporting the truth when others didn't.","post_message":"Question of the Day: What did you think of my interview with President Donald J. Trump?"},{"comment_id":"1384175518259929","commenter_b":"Oh maybe he doesn't want the Hillary supporters burning down our country!!","commenter_a":"Y'all got conned. 😂😂😂. Only idiots would believe him. Go ahead, chant \"Lock her up!\" If there was a reason to, he would - but there isn't.","post_message":"President-elect Donald J. Trump does not plan to pursue charges against Hillary Clinton for her personal email server or allegations of pay-for-play at the Clinton Foundation, senior adviser Kellyanne Conway says. @webpagelink"},{"comment_id":"489008974557030","commenter_b":"Our Government has NO IDEA of how many muslims (refugees, immigrants, migrants, legal or illegal) are Already in OUR country!!!!","commenter_a":"Trump","post_message":"Cheney:  think this whole notion that somehow we can just say no more Muslims, just ban a whole religion, goes against everything we stand for and believe in. Do you agree with Cheney or Trump on this issue?"},{"comment_id":"1652238444998373","commenter_b":"White girl runs around in black face and its fine, yet if I were to do it the liberals would lynch my saltine american hindquarters.","commenter_a":"She went full retard","post_message":"Wait,... what?  @webpagelink"}]
