[{"comment_id":"1012561098824705","commenter_b":"The fact that this slut could possibly be our First Lady is a very important issue to me,","commenter_a":"Really people, this is what you talk about when there are real issues affecting people in the US. Shame on you. Is this what we have become as a nation?","post_message":"Conservative hypocrisy knows no bounds."},{"comment_id":"10154274502374087","commenter_b":"Oh you ALL make me tired. What a bunch of bullshit comments.","commenter_a":"The smartest thing this man has ever said: \"Dr. Carson feels he has no government experience, he's never run a federal agency. The last thing he would want to do was take a position that could cripple the presidency.\"","post_message":"#BREAKING: Dr. Ben Carson has told President-elect Donald Trump that he isn't interested in serving as secretary of Health and Human Services in his administration."},{"comment_id":"10153792015980695","commenter_b":"Why white woman","commenter_a":"I'm just saying. I would stop if I hit a deer or a white woman. I can tell the difference also.","post_message":"“For someone to know you hit my mom and never even tried to stop or brake, I don't understand that.\""},{"comment_id":"1074912275882577","commenter_b":"Look at their faces....they're smiling. ...and we're not allowed to be angry about this. All of you bigots need to shut up! Wear your flag ....fly your flag......shove your flag.....who cares ....but you will not see it flying over that government building ever again!!!! Deal with that!","commenter_a":"Are these the same, \"It's Heritage, not Hate\" clowns?","post_message":"South Carolina voted to remove the Confederate flag, and bigots are in a frenzy: 'F*ck black people'"},{"comment_id":"1614898715485754","commenter_b":"No need to worry, Just Drink a Coffee ☕","commenter_a":"Brad Sherman","post_message":"Two days ago, an enormous asteroid flew past Earth. It was half as close as the moon. And we barely saw it coming."},{"comment_id":"1801831173397468","commenter_b":"Michelle and Hillary are 2 of the most dishonest people ever!! If Hillary wins then you can tell your daughters and grand d aughters as you watch them being raped by the refugee's , how you are soo happy you voted for this evil..woman .. Get ready for it, with a Hillary win, it will be Sharia Law...","commenter_a":"Want more of THIS, America? Vote Hillary and you just might get it!~ >","post_message":"\"This is a country where a girl like me from the South Side of Chicago whose great great grandfather was a slave can go to the finest universities on Earth. A country where a biracial kid from Hawaii, the son of a single mother, can make it to the White House. A country where the daughter of an orphan can break that highest and hardest glass ceiling and become president of the United States. That is who we are, that is what's possible here in America—but only when we come together, only when we work for it and fight for it.\" —First Lady Michelle Obama today in North Carolina IWillVote.com"},{"comment_id":"10153880251122217","commenter_b":"No. They should be pure. Virgin skinned, hairless.","commenter_a":"See John for the invisible tattoos.","post_message":"Send us photos of your tattoos! We'll be talking ink in the workplace with tattoo expert Dr Matt Lodder at 13:30 (BST) on #FacebookLive. We'll be showing some of your tattoos as part of our broadcast, so please email your snaps to yourpics@bbc.co.uk"}]
