[{"comment_id":"10154796667456037","commenter_b":"#NeverTrump #MakeAmericaGreatAgain","commenter_a":"LMFAO Surprise Surprise !!!!!!!","post_message":"“Why should he get part of my rent, and why should his name be on there?”"},{"comment_id":"883241831711239","commenter_b":"@username another liberal who's mother should have swallowed","commenter_a":"I back the police , i hope they do turn their backs on Obama , he is a worthless piece of sh**","post_message":"PLEASE do this, cops!"},{"comment_id":"489237724600141","commenter_b":"Fuck that dumb wench","commenter_a":"How about if you criticize a Catholic, a Jew or any Christian. What hell makes Muslims so special?","post_message":"Hillary Clinton is attempting to make it punishable by law to criticize Islam.  She just crossed the line. We can put a stop to this, let's end this right now.  Can we get 20,000 'LIKES' for freedom of speech?"},{"comment_id":"10154000261646337","commenter_b":"Tiny Fey and Amy Poehler would so destroy you right now with words of girl power and women unitedness. #Womanizer","commenter_a":"#BETsoBlack am I doing this right or nah?","post_message":"'IT'S A REGRESSION': Will Smith stays positive about the #Oscars and Hollywood's bigger problem with diversity..."},{"comment_id":"10153950105412757","commenter_b":"Round them up and jail them. Find the illegals and deport them.","commenter_a":"Exterminate that vermin!","post_message":"Anti Trump showdown"},{"comment_id":"1393712353985142","commenter_b":"Someone send this to Senator Warren...but use small words so she MAY understand it!","commenter_a":"No one cares !!!!!","post_message":"Wow! Coretta Scott King gives a thank you to Sen. Jeff Sessions at the opening of the Rosa Parks library."},{"comment_id":"1052877944789070","commenter_b":"Hillary Clinton is more smarter and experienced lady rather than her opponents, she worked in government on different positions as well as in different conditions. As soon as she become President, she will require very short time to implement her plans. #Germany has Lady Chancellor, #UK has Lady PM, now it's time for #US to have Lady President. I am not against Donald Trump and also agree with his views regarding migrated people's who cause Terror activities, Hillary too must think on this issue. No one can't risk it's own people's life for other nations innocent people. In Europe, France and Germany already paying for it...","commenter_a":"Yes!!! And then you can try to explain to your child why the first \"Woman President\" is being investigated for her actions. Then you get to try to explain impeachment. And then how to dig out of the hole of \"Well I guess girls can't do the job.\" Little kids don't get politics. That is the job for adults. And if you as an adult vote for a woman who lies, cheats, and puts her privacy above the security of the nation, then you get to pay for it down the road. But you have a choice vote Jill Stein. 2016.","post_message":"\"Mommy, how come they're all boys?\""}]
