[{"comment_id":"579405548899257","commenter_b":"@username smart woman","commenter_a":"\"Mr. Trump what would you like for dinner?\" Trump: \"I'm building a wall.\" \"Mr. Trump why don't you like Mexicans?\" Trump: \"I'm building a wall.\" \"Mr. Trump why don't you ever answer questions?\" Trump: \"I'm building a wall.\" \"Mr. Trump tell us something relevant about this presidential race.\" Trump: \"I'm building a wall.\" \"Mr. Trump are you building a wall?\" Trump: \"I'm going to make America great again!\" Well, that pretty much sums up everything this \"man\" has said all along and people will continue following his ignorance. #makeamericahateagain","post_message":"Donald J. Trump insists a judge born in Indiana is Mexican."},{"comment_id":"1302991003096347","commenter_b":"Wait-what? these illegals don't like what's going to happen? well, guess what? this is still America, we have immigration laws and it looks like the authorities are going to have to start following them. Go home and come back legally and you'll be welcomed with open arms!","commenter_a":"Start packing","post_message":"BREAKING: Trump Appoints Head Of Immigration Team Illegals, Liberals HORRIFIED!!!   We're making America GREAT!!"},{"comment_id":"10155035206479369","commenter_b":"Build that wall!!!","commenter_a":"BUILD THE WALL","post_message":"Immigration fees are being hiked for the first time in six years."},{"comment_id":"914002385301524","commenter_b":"Fkn eh one less pig on the streets","commenter_a":"How many cops DON'T get caught doing the same thing?..","post_message":"He tried to frame an innocent man for a burglary that HE committed! When that didn't work out he killed himself.  From (Y) Counter Current News - MBD"},{"comment_id":"1788953421120280","commenter_b":"Progressive liberals are domestic terrorists! We the people must stop this corruption around our great country!","commenter_a":"Keep showing her lies as well as the corruption in Washington. Obama spending our taxes on her campaign, even though we are Not voting for her.","post_message":"Crooked Hillary Clinton lied to the FBI and to the people of our country. She is sooooo guilty. But watch, her time will come!"},{"comment_id":"10157095473970206","commenter_b":"Because she's a lying scumbag","commenter_a":"GOP IGNORES CARLY FIORINA - WHY?","post_message":"The professional political class says whatever they need to do to win and then does whatever they please. We need to return to citizen government. Stand with me. Fight with me. Vote for me."},{"comment_id":"10153301628035496","commenter_b":"Really, Brenda, perhaps you should have looked at the message she was sending. Why should we have to be subjected to her cop bashing, Black Panther, Malcolm X etc. opinions. That's not talent. Perhaps we should go back to marching bands and perhaps you should think about reporting the news or even better retiring.","commenter_a":"Wow these comments are funny to me. Beyonce did not give a hateful message. You all are upset because of what you saw visually and what the media has told you what she is singing about. Have any of you even listened to the song or listened to her response to the media turning her song into hate? And she and her husband have done a lot for the black community. They just don't have the media around to show it because that is not what it's all about.","post_message":"Brenda's Last Word on Beyonce's so-called 'way too political' Super Bowl performance.  PHOTOS from the performance: @webpagelink"}]
