[{"comment_id":"10154310515973822","commenter_b":"she clearly states on her wbsite that money not used will go o her pay for future campaign #JillSteinScam","commenter_a":"What's Jill gonna do with all that cash? No refunds, no exchanges, all donations final.","post_message":"JUST IN: The Green Party is dropping its court case seeking a recount of Pennsylvania's Nov. 8 presidential election."},{"comment_id":"547039675478904","commenter_b":"trump is not going to build a wall or deport. sorry","commenter_a":"Make America great again build that wall","post_message":"\"I want America First - so do voters!\"  Hear from Donald J. Trump tonight on protesters, the Indiana primary and more at 10p ET. #Hannity @webpagelink"},{"comment_id":"10153016776944117","commenter_b":"Cause she was terrible. @webpagelink","commenter_a":"Because they are willing to sell out.","post_message":"From RUSH drummer Neal Peart to Rep. Paul Ryan to Uber CEO Travis Kalanick. Why do famous people deny that they admire Ayn Rand?"},{"comment_id":"990097811101554","commenter_b":"That looks disgusting 😱","commenter_a":"@username BONG","post_message":"Not all heroes wear capes. 🍔+🌭"},{"comment_id":"1155787421127301","commenter_b":"lmao ...#NeverCrookedHillary #JillnotHill","commenter_a":"Hillary for the love of God stop drinking!!! Your pandering is psychotic, you're losing touch with reality and becoming paranoid!!! You look old and tired!!! Put the vodka bottle down and go to bed!!! VOTE TRUMP MAKE AMERICA GREAT AGAIN !!! '","post_message":"A young girl asked Hillary, \"Do you think when you're president, you'll be paid as much as a man?\""},{"comment_id":"10153373281922434","commenter_b":"@username debates anything that's pro-woman.","commenter_a":"Why should I believe a man who says, \"Fighting for us\"? Women are an afterthought in those situation, a \"rising tides lifts all ships\". I have never bought that line in total. If you say a man can fight for women, then a women can fight for men. Men need to deal.","post_message":"\"Consider her slogan, 'Fighting for us.' For many men, this slogan would have to be experienced as emasculating. A woman fighting for them?\""},{"comment_id":"10152892200414753","commenter_b":"Bitch","commenter_a":"how incredibly low and self absorbed are you that you could steal money and attention this way.hope you get all the attention you want now.","post_message":"A Florida woman is facing felony charges after cops determined that she faked having breast cancer in order to swindle thousands of dollars out of friends, family, and her supporters in the community."}]
