[{"comment_id":"640946546065952","commenter_b":"So support Hillary who takes millions of dollars from countries that practice Sharia law that kill women and kill gays for no reason! Also who's husband is a known sexual abuser and a rapist and she persecuted the sexually abused victims of her husband. Yet Hillary said she supports women's rights, what a joke. Wake up ladies!!! I'm wondering if Hillary hired these people to go there and start riots. Hillary Clinton is a evil corrupt woman who is mentally, physically and morally unfit to be our commander in chief!","commenter_a":"Go Trump.","post_message":"We're LIVE from Trump Tower New York, where the National Organization for Women (NOW) is leading an anti- Donald J. Trump protest."},{"comment_id":"10153807094811336","commenter_b":"Maybe this woman wants the truth about Hillary's evils be known .","commenter_a":"Fox news keeps exploiting this poor woman","post_message":"“[Hillary Clinton] lied to my face at a very, very hard time, and she’s been lying since.” – Patricia Smith"},{"comment_id":"10153570672510667","commenter_b":"Are you kidding!? Heartbreak isn't legal punishment - she needs to be jailed!&","commenter_a":"This is horrific! My heart aches for the mother...I know they all should have had their seat belts on, but they were old enough to know this. I don't think the mother should be charged because she will relive this over and over and over and over again...it will haunt her for the rest of her life. God be with her.","post_message":"Three girls were killed and six others injured when an SUV carrying 11 people had a tire malfunction and crashed on I-95 in Titusville, Fla. @webpagelink"},{"comment_id":"10156327050085725","commenter_b":"A HUUUUUGE WALL. the next 11 months are gonna be a nightmare. Get in there and fix it asap donald trump. Please","commenter_a":"Caught and turned themselves in are two different things.","post_message":"Eight Syrians were just caught on the southern border trying to get into the U.S. ISIS maybe? I told you so. WE NEED A BIG & BEAUTIFUL WALL!"},{"comment_id":"1057065101012919","commenter_b":"Those camps are for the Ameriicans. The illegals are going to be slaves & the muslims will be living in your house.","commenter_a":"Not nearly enough room for all the democrats,liberals,communists ,illegals .ect....afterwe start to round them up.","post_message":"The 800 FEMA camps across the U.S. can only hold 16 million..."},{"comment_id":"506998642821762","commenter_b":"I'd say a feminist who pees themselves might be drunk.","commenter_a":"Well, that has to be uncomfortable. Only a mental moron would pee themselves. I'm telling you, libs are retarded.","post_message":"How stupid can some people be..."},{"comment_id":"10153429543136491","commenter_b":"Not that it matters. A white woman would probably been cast anyway.","commenter_a":"WHY?! Are there no LATIN/HISPANIC actresses that can fill this role?","post_message":"Jennifer Lawrence will soon add another splashy biopic to her resume."}]
