[{"comment_id":"10153304434981770","commenter_b":"She is gross...","commenter_a":"You don't impress me AT ALL.","post_message":"Can you believe she does this to herself?"},{"comment_id":"701393549998426","commenter_b":"Get them out of US STOP PC they do not deserve to speak in N TV , no Christian or Jewish leaders were invited to speak to reporters. Muslim Imam just said it in Press conference (is like we did it n so what) is just mass shooting Hello THIS IS TERRORIS AT ITS BEST ISIS STILE, wait our Muslim President blame gun control","commenter_a":"IF he really wants to stop shootings he should go to Iraq or Afghanistan .where shootings hangings, stoning, acid baths, beheadings, gas weapons, all take place on the regular. WE have been saying this is going to be a problem here. we already have too many whack a do 's to deal with, and letting people who have an intense hate for a certain segment of our society in to this country with NO understanding of our population and LAWS other than it picks up the tab, is a recipe for this very thing. But IS NOT a good enough reason to give up my gun rights. I will just cling to my weapon and bible thank you very much. gay people everywhere should understand this now, weather it's a gun or a bomb, you are on their hit list.","post_message":"Speechless."},{"comment_id":"10154885483751037","commenter_b":"Ugly nacty women","commenter_a":"Rachel Rauth","post_message":"Sen. Elizabeth Warren has a message for Mitt Romney."},{"comment_id":"1096402407066897","commenter_b":"Girl, bye. If you indeed weren't trying to get over on our great state, you have nothing to worry about, right?? Hey, you may very well be a crook...","commenter_a":"He said.....she said. Truth is most likely somewhere in the middle. Pffffffft...","post_message":"It does kind of smell like revenge. What do you think?"},{"comment_id":"10154105448940950","commenter_b":"@username So many foaming at the mouth racists until he will need them. He will need them in heaven.","commenter_a":"This \"news\" is like a week old. Why do I care if she wants her son to finish school with his classmates this year? Most parents would do the same.","post_message":"Melania and Barron Trump plan to remain in New York City until at least the end of the school year."},{"comment_id":"10153248489871037","commenter_b":"Rob your a pussy.","commenter_a":"Hillary for Prison 2016","post_message":"A variety of sources in the Clinton orbit say they are anticipating an imminent announcement of #Hillary2016."},{"comment_id":"10154499778649091","commenter_b":"Edwin, you only sound ignorant.","commenter_a":"I proposed a law in which all pit bull owners and their dogs take obedience training. The dogs and owners should take some test to see if dog can handle being around people. Too many times do I read stories about pit bull attacks. I know they all aren't bad, but some tend to snap and kill or severely injured people. Let's all write to trump so he can executive order this law","post_message":"After a young boy was seriously injured after being mauled by one of two pit bulls inside his Brooklyn home, his uncle says the 5-year-old took the brunt of the horrific attack to protect his younger siblings."}]
