[{"comment_id":"1073790629380657","commenter_b":"@username. Just fn Stop it with the Fox \"news\" total BS talking points. Insurance is about LIABILITY, not necessarily self protection..and it's Democratic Socialism at it's core such as our tax code: Put $$$ into the pot to benefit/secure your society's quality of living. The phrase \"free market capitalism\" is nothing but corporate fascist propaganda for dumb asses.","commenter_a":"I like to ask people that hate socialism why they buy insurance? You can almost see them stroke out as they start to think really hard about the question.","post_message":"Brilliantly done."},{"comment_id":"10156346030730725","commenter_b":"@username We know you're illegal, Pack your bags buddy you're getting deported!!","commenter_a":"We love you here in South Carolina Mr Trump! #MAKEAMERICAGREATAGAIN #TRUMP2016","post_message":"THANK YOU for your support this evening Myrtle Beach, South Carolina! My family and I had a fabulous time with you this evening. Together we will #MakeAmericaGreatAgain!"},{"comment_id":"1178538995510357","commenter_b":"I would have moved too.","commenter_a":"Ungrateful people if they really look at the whole picture officers are out there protecting us,don't judge the rest because of the other bad apples.Now they got to deal with criminals and the society plus news reporters.Too bad the officers can't close their eyes and walk away and say I don't want to help you guys!!!!!! But they swore under oath they will serve and protect you!!!!!!!","post_message":"The officers even covered the couple's tip."},{"comment_id":"10158501442080389","commenter_b":"Why is she in our country?","commenter_a":"March away and try not to get run over by a car or truck. Most of us have jobs and families to tend to.","post_message":"Despicable."},{"comment_id":"996990363669718","commenter_b":"@username, if those that come from Mexico are such a hard working people like liberals claim, then they should use all the energy to fix their own place. Mexico required voter ID which in turn gives them capabilities of voting people into office. Fast forward to illegals here from Mexico claiming that is racist to require voter ID, while their own place mandate that they have one. Is all about getting free stuff without any output. For that reason I say screw everyone of them that break the law and move here.","commenter_a":"I live in a Muslim country here is like a hell because of being Muslims. Killing, kidnaping and beheading is an usuall action. If you want to be safe, don't let any Muslim live in America.","post_message":"NOT IN OUR COUNTRY."},{"comment_id":"806494949541082","commenter_b":"The same way , but don't get caught . You will go to jail and stay . They get a pat on the back !","commenter_a":"Bullet to the head","post_message":"Muslim Terrorist Arrested After Threatening FOX In The Worst Way Possible.  Radical Islam is becoming a domestic threat.  How should America respond?"},{"comment_id":"10153028815641336","commenter_b":"Netanyahu is a coward he's trying he's best coz he's scared of Iran","commenter_a":"I don't know what history books Obama has been reading but it would do him good to listen to this leader of the free world for America as we know it will disappear from us and our future....","post_message":"Today, Israeli Prime Minister Benjamin Netanyahu - בנימין נתניהו will make his case to Congress – and the American people – for why a pending nuclear agreement with Iran would risk his country’s security.  Tune in to Fox News Channel at 11:00a ET for live coverage of Netanyahu’s speech."}]
