[{"comment_id":"10154061329228352","commenter_b":"Fucking neither of them. Both pieces of dog shit.","commenter_a":"These two look alike younger you vs newer you ewwwww","post_message":""},{"comment_id":"10152505642191770","commenter_b":"She finally bought herself some new boobs?","commenter_a":"People dont realize that both Kim K and Paris are shrewed business women.","post_message":"Remember Paris Hilton? She's back, and she's letting it all hang out."},{"comment_id":"10153552105389087","commenter_b":"What an undemocratic woman.","commenter_a":"I can't stand her. She had no ideas other than the ones she stole from Sanders.","post_message":"Jeff Johnson, the head of the Washington State Labor Council, was scheduled to speak in at a pro-Bernie Sanders rally, but a pro-Hillary Clinton union affiliated with AFL-CIO threatened to take away funding from Johnson's group if he spoke at the event, forcing him to back out."},{"comment_id":"10154999014692891","commenter_b":"Wow you are stupid @Cynthia Madison. It was a child!! Sorry he wasn't White!","commenter_a":"For walking in his lawn I'm going to have my dog💩law","post_message":"Protesters in Anaheim are blocking streets to demonstrate against an off-duty LAPD officer's confrontation with a teen in which he fired his gun. @webpagelink"},{"comment_id":"10153249874686051","commenter_b":"Girl... You are so sooo wrong! I guess you think Hillary would have answered the question.. Lol","commenter_a":"Trump had NO intention of ever calling on this great reporter - his questions would have been too complicated for Trump to answer. Even later when the reporter comes back in after his \"time out\", Trump badgers him.","post_message":"Here's how Donald Trump responded when a reporter interrupted his press conference."},{"comment_id":"10153203354164071","commenter_b":"I also voted for Romney and would do it again. The Presidency was 'stolen' from him.","commenter_a":"Vice President Romney","post_message":"Mitt Romney just unloaded on President Barack Obama's foreign-policy legacy."},{"comment_id":"590662824455343","commenter_b":"This article is a joke. She is telling girls in a country where they are oppressed to believe in themselves. It has nothing to do with hating America or race.","commenter_a":"Get out if you don't like it, and keep your racist mouth shut, you and your husband have been nothing but a thorn in Americas side, glad your done not soon enough.","post_message":""}]
