[{"comment_id":"10153366619543635","commenter_b":"Nope. I thought you knew better than that.","commenter_a":"Quran (3:56) - \"As to those who reject faith, I will punish them with terrible agony in this world and in the Hereafter, nor will they have anyone to help.\"","post_message":"Hillary Clinton: 'Muslims Have Nothing to Do With Terrorism'"},{"comment_id":"1225473394192695","commenter_b":"@username you suck big donkey dicks","commenter_a":"A man of class, dignity, character, honesty...everything goid and positive. God bless our nominees, and the Unired States of America!","post_message":"Republican vice presidential candidate Mike Pence holds a town hall."},{"comment_id":"10153438111440496","commenter_b":"STFU","commenter_a":"Always 3 sides to a story don't be quick to judge U ppl have no idea how students behave themselves at school unless u worked at schools Unbelievable not saying what that officer did was appropriate I haven't watched the video nor do I choose to Let them finish their investigation u stay out I choose to do the same","post_message":"Video shows a 6th-grade girl at a Texas middle school being grabbed and dropped by a school resource officer. The officer is now on leave."},{"comment_id":"1385834498103243","commenter_b":"Lmao!!!! BUSTED!!!","commenter_a":"TRUMP 2016. Only liberals make excuses for crime. You do the crime you do the time cause its that simple. Trumps the man thats gonna bring back real punishments for all these thugs than thinks they can mess with other folks belongings. Trumps the man thats gonna bring back real law n order and get our country built back up.","post_message":"The West, Texas, fertilizer plant blast killed 15 people and injured 160 others."},{"comment_id":"10154904389672235","commenter_b":"First, someone like me will have to tell the old hag to STFU and get out of the lady's face.","commenter_a":"I wonder how long it willl take for it to sink in to the deplorables that this sort of behaviour is intolerable, and they will be held in contempt for it by civilized people?","post_message":"BOOM!"},{"comment_id":"1232217873516420","commenter_b":"Female dog","commenter_a":"Convicted felon","post_message":"I want to see what you all come up with... Describe Hillary in just two words... Ready, set, go!"},{"comment_id":"10154166026884342","commenter_b":"Phulleeezzzee this woman isn't going to get caught","commenter_a":"There are freaking cameras everywhere. You will get caught. Not worth it. And the problem with leaving your purse in the car is her lousy boyfriend is watching in the parking lot and waiting to break into your car as soon as you're in the store. And these are the same ones videoing as a cop takes them down and screaming police brutality. You live by the camera, you are gonna go down because of the camera. Smile!","post_message":"A California woman is drawing eyes after she appears to brazenly snatch a wallet from the purse of a fellow shopper. @webpagelink"}]
