[{"comment_id":"10152954231420399","commenter_b":"Paybacks are a bitch!","commenter_a":"Karma isn't it great","post_message":"An extraordinary act of trolling:"},{"comment_id":"10152582294965047","commenter_b":"Can't she just go away!","commenter_a":"Help us all!","post_message":"The Obama Administration tried to trick the American people through a lack of transparency.  ObamaCare has been a complete disaster, and it's time for it to go.    Sign & Share our petition to defeat ObamaCare today: @webpagelink"},{"comment_id":"10154087953651491","commenter_b":"GO AWAY","commenter_a":"I Finally found the link original watch Suicide Squad {2016} full movies @webpagelink watch Don't Breathe {2016} full movies @webpagelink watch Bad Moms {2016} full movies @webpagelink watch Fifty Shades Darker {2016} full movies @webpagelink watch Doctor Strange {2016} fulmovies @webpagelink","post_message":"Sometimes the landlord/tenant relationship can be a difficult one. But it doesn't have to be that way."},{"comment_id":"842856589085016","commenter_b":"Jesus never existed. It's all in your head woman.","commenter_a":"The should stop being christian then","post_message":"\"...a most agonizing situation.\""},{"comment_id":"10153245198116323","commenter_b":"The women has no idea , if you want to walk in the shoes of a low income American, dont play at it go and talk to one and find out how they really live from day today ,week to week,then come back and try and put your self in there shoes see then how hard it is","commenter_a":"\"watching roaches climb the wall, if you called your dad he could stop it all \"","post_message":"As Gwyneth Paltrow put it, she is walking in a low-income American’s shoes. But is she really?   The reality is more complicated."},{"comment_id":"10154898999434705","commenter_b":"Michael MacLeod are you kidding? Who says they are not. They have the most amount of refugees.","commenter_a":"Snowflakes and Hollywood dummies....read the executive order....no mention of Muslims any where. Still trying to figure out how so many of you could support muslims...they have no respect for women, queers, children, Christians and idiots like you.","post_message":"Helberg and wife Jocelyn Towne sent a clear message to Donald J. Trump."},{"comment_id":"590662824455343","commenter_b":"This article is a joke. She is telling girls in a country where they are oppressed to believe in themselves. It has nothing to do with hating America or race.","commenter_a":"Get out if you don't like it, and keep your racist mouth shut, you and your husband have been nothing but a thorn in Americas side, glad your done not soon enough.","post_message":""}]
