[{"comment_id":"10157758385010725","commenter_b":"Hillary is a crimnal so are the Radical Muslims and the Fence jumpers deport them all Wait for it","commenter_a":"aye lmao","post_message":"Thank you for the great 'TRUMP' welcoming, Virginia! I realize that takes a lot of time & coordination - and I am grateful to you all, for your support! -DJT"},{"comment_id":"1731050200496998","commenter_b":"Some mothers eat their young!","commenter_a":"Typical!","post_message":""},{"comment_id":"10153150995326051","commenter_b":"You see how gay women are not fully gay . They still want dick !!!","commenter_a":"Is it a dildo? I'm not clicking I want to guess","post_message":"The police here had seen a lot of strange things before, but even they had never witnessed something quite like this."},{"comment_id":"10153781629863132","commenter_b":"stupid girl","commenter_a":"I feel so sad for Anna and their four little M's","post_message":"Anna Duggar will likely not be leaving her husband Josh despite his admitted infidelity."},{"comment_id":"10156378664500725","commenter_b":"I have an idea. JDLTI. Just don't let them in. When you become President close all immigration for up to five years. We can take care of the terrorists in the Middle East while weeding them out here in the U.S.","commenter_a":"E","post_message":"I keep saying it. When the President of the United States of America, Barack Obama -  will not issue the words RADICAL ISLAMIC TERRORISM - the problem will NOT BE SOLVED!"},{"comment_id":"10153180223152522","commenter_b":"Really? F... off! I rather vote for Clinton. (As much as I despise her)","commenter_a":"Hell no!","post_message":"Ryan was the man to unite the party in Congress. Could he do it again for the White House?"},{"comment_id":"10154153451894197","commenter_b":"nice, she can afford to leave, no doubt on our dime.","commenter_a":"and who didn't see this coming","post_message":"Former Governor Rell is moving to Florida, and she is not happy about the direction of Connecticut.   Have you considered moving for tax reasons?  Watch Face the State with Dennis House this morning at 11.    Preview here: @webpagelink"}]
