[{"comment_id":"10153111531487483","commenter_b":"While yes , abortions do bother me, I can see where they are necessary in some instances HOWEVER, I don't believe the federal and state govts ought to pay for an abortion that is not medically necessary!","commenter_a":"Here we go again..Same poop, different day. Same old narrow-mindedness and folks being too lazy to do ACTUAL research. Some people are so close-minded that even if you had the proof right in front of their face, they wouldn't believe it. \"Oh my God! Planned Parenthood (PP) does abortions!!! We MUST stop them NOW!!!!\" *SMDH* Heaven forbid that they actually admit that PP provides other things to both women AND men as far as health screenings, treatment and counseling. So go ahead you Fools, and defund a program that low-income families have depended on for years. I just don't understand how some folks call themselves \"Christians\".","post_message":"Planned Parenthood says Medicaid patients have a right to choose their health care provider. A 21-year-old woman, who has received contraceptive shots from Planned Parenthood, joined the lawsuit against the state."},{"comment_id":"900975760004551","commenter_b":"Or woman!!!!!!","commenter_a":"Not just white men no man should talk like that it is bad what ever color they are.","post_message":"RT LeBron James: “White Men Don’t Have the Right to Talk Like Trump in Locker Rooms or Elsewhere”"},{"comment_id":"683824238474821","commenter_b":"STFU you pussy. Why don't you go join ISIS.","commenter_a":"Really? This is just pathetic. Who in their right mind would even think if suing someone because they offered a book bible or not. The soldier is not fit to be in the military. All he had to say was he was an atheist. Unless he is to ashamed too.","post_message":"An Atheist soldier is suing a Christian soldier for recommending the bible. This is blown way out of proportion. Let's backup this christian soldier. Can we get 50,000 'LIKES' for this soldiers commitment to god?"},{"comment_id":"10154760040172293","commenter_b":"Shes an indenity thief. I think Alyssa was referring to actual criminals","commenter_a":"Hopefully every single one who has blatantly broken Federal laws and made a joke of our Justice system. They are all criminals by definition. Round them all up and return them to their homes in Mexico and Central America.","post_message":"This scenario is one that President Trump opponents imagined becoming far more common were he elected."},{"comment_id":"1695824464005067","commenter_b":"@username here I even did your researching for you but you can pick from numerous articles about him dodging the draft. @webpagelink","commenter_a":"Trump you spent all night at your rally tonight, calling Cruz a liar and cheater. Your supporters don't seem to concerned about your non polices and non plans. Keep dodging Cruz in a one on one debate, it just proves that you're the real liar! Since you said you wanted a one on one debate with Cruz, you're a dodger in every way.","post_message":"Donald J. Trump said he didn't call Ted Cruz 'Lyin' Ted' in his New York victory speech because \"I thought it would be very undignified for me to get up at that particular moment with ... pretty much the world watching.\""},{"comment_id":"1144750032228005","commenter_b":"Here we have someone taking things just a lil too seriously","commenter_a":"\"Discovered\" more like created...","post_message":"Pokemon are a diverse class of creatures that were first discovered by Japanese scientists Satoshi Tajiri and Ken Sugimori in 1996."},{"comment_id":"10154111775125779","commenter_b":"Haha She landed Russell Wilson, she isn't going anywhere.","commenter_a":"We all know how this is going to end - she's going to go back to the Future.","post_message":"Ciara dropped her $15 million defamation suit against her ex-fiancé Future Friday, a year after the singer first accused the rapper of slander."}]
