[{"comment_id":"10153272764696045","commenter_b":"Steals from children and drives drunk to possibly kill someone. She needs to be in jail.","commenter_a":"Mandatory Rehab and therapy","post_message":"Amy McArthur Balch is currently being held in Morgan County Jail with no bail."},{"comment_id":"10152804039052293","commenter_b":"Wonderful news she was untouched, hope her family has a quick recovery.","commenter_a":"Amazing. I also wonder what brand car seat, because I wish to buy that for every expectant parent I know","post_message":"“Then they said her eyes opened and she started smiling,\" a relative said."},{"comment_id":"10153171021535950","commenter_b":"she gave him head while the lieing bitch watched and then joined in!","commenter_a":"From many people that know them personally, he has a few girlfriends. One in Canada. It's a marriage for show only.","post_message":"The United States' ultimate political power couple, Bill and Hillary Clinton, celebrate 40 years of marriage today. Their marriage certainly hasn't been all smooth sailing..."},{"comment_id":"893708487388873","commenter_b":"Barbara can't you see what this Idiot is doing to this country?","commenter_a":"I agree. It makes no difference to me if a Republican or Democrat occupies the White House. This HATRED for this PRESIDENT is appalling. In their HATRED they are destroying America! But they're too ignorant to realize it!!","post_message":"Too true.  Image by Occupy Democrats."},{"comment_id":"10154184964563352","commenter_b":"Melissa..legalizing illegals will devastate black employment..for every available job it will be 150 Mexicans to every 3 blacks...it be horrible for us","commenter_a":"Hes gonna stop illegals from coming taking black jobs..hes gonna kill obamacare fines..wat sensible black would disagree","post_message":"Trump says black Americans 'are going to like me better than they like Obama' – even though the president has 'a slight advantage'"},{"comment_id":"10153624584662235","commenter_b":"Ewwwwwww, Leonard...I don;t know any self respecting lesbian that would be in the room with her much less touch it.","commenter_a":"Usually, those that \"doth protest too much\" likely have closeted feelings and are gay themselves.","post_message":"NAILED IT."},{"comment_id":"10154562664816037","commenter_b":"Build Bridges Not Walls","commenter_a":"YES!! as part of an overall plan on illegal immigration . Please Remember that Sen. Hillary Clinton voted twice and lobbied for a border wall!!!!","post_message":"Would Donald J. Trump's proposed wall help?"}]
