[{"comment_id":"1252197194828825","commenter_b":"One of the 2 things I don't like","commenter_a":"Smokers are disgusting","post_message":"WARNING TO PET OWNERS: It's not just second-hand smoke that's harmful for your four-legged friends. Pets are also at risk for being exposed to residue that lingers on skin, clothes, carpets, and other household items."},{"comment_id":"1593060860989996","commenter_b":"Thats how they want America ....in a trance.","commenter_a":"May I suggest Sarah Palin as a running mate? We've heard that she not only supports you, but offered her services :)","post_message":"You could tell Donald J. Trump knew the debate went badly by the way he barreled into the \"spin room\" last night, immediately disavowing things he'd said in front of more than 80 million people just moments before. The back-peddles and lies have only grown more mystifying in the hours since."},{"comment_id":"10153396046867452","commenter_b":"what if they didn't do it... cut it off anyway????????????????","commenter_a":"Thats the best freaken law ever. Pass it nation wide","post_message":"\"They have marked this child for life, and the punishment should fit the crime.\"  If an Alabama lawmaker gets his way, part of the punishment for people who commit sex crimes against children will be castration."},{"comment_id":"10154949382818010","commenter_b":"Amen Danny. This Ed guy is Obamas gay boyfriend.","commenter_a":"Where do you think they learned that from? Very close ties to the Obama administration, and of course, \"we're with her\" too.","post_message":"You're not supposed to say, “I think we broke the law,\" even in internal emails, according to the lawsuit."},{"comment_id":"1779215949028239","commenter_b":"#Fuckhillary #Neverhillary #Nevertrump","commenter_a":"#neverhillary","post_message":"Matt Lauer asks Hillary Clinton about the qualities that make her qualified to become Commander-in-Chief.  More coverage on @webpagelink"},{"comment_id":"687362974730217","commenter_b":"It is spelled you're... You are. Your denotes ownership","commenter_a":"What! Let's see Hilary was a lawyer, First Lady, senator, Secretary of State, married to the president of the world and your comparing homes? YUP comical","post_message":"LOVE THIS!!!!"},{"comment_id":"10153746708116770","commenter_b":"That's the style whores wear today","commenter_a":"She's need to be excuted !","post_message":"Holy sheer."}]
