[{"comment_id":"978935178808244","commenter_b":"Good. She looks like a menace.","commenter_a":"hey asshats...it was a 12 year old..not 2 year old....daddy put her in harms way......","post_message":"BREAKING NEWS! Police just SHOT AND KILLED a 12-year-old girl while evicting her family from their home!   Help us SPREAD THE WORD because the #MainstreamMedia is not TOUCHING this!  From >> Counter Current News for the latest!"},{"comment_id":"496338953890018","commenter_b":"Dumb as hillbilly racist. This ain't your country. You must of been beaten to many times by your hillbilly husband. Stay the fug out of their area then. You KKKrackers have many don't go zones, outsiders not welcomed. Most trailer parks in Auburn CA. and any white town in Mississippi. Live and let live mafaacaas!","commenter_a":"yes spray the area with pig fat","post_message":"First our schools, then our public areas, what's next?  'SHARE' this post, we have to let the nation know what the MSM won't.  Do you agree Shariah must be stopped?"},{"comment_id":"10153806862081167","commenter_b":"Maybe the whole NRA could be recalled.","commenter_a":"The Cash Box Rules! \" Let's Make America Great Again\" yeah right!","post_message":"After we called them out yesterday, Bud Light seems to realize that Ted Nugent's hate is bad for business."},{"comment_id":"10154994136091800","commenter_b":"He probably knee jerked so hard he got a bloody nose and blames it on picking it too much!","commenter_a":"Trevor Noah is a puppet... Go back to south Africa where division is welcome stop trying to divide my country with your shitty humor... #Bringbackstewart","post_message":"The Daily Show recaps President Trump’s flurry of executive orders."},{"comment_id":"654997668024145","commenter_b":"WHAT a dumb bitch!!!","commenter_a":"Looks like she has eaten one to many spud herself!","post_message":"Michelle is now targeting a common supermarket food.  That's enough. We're tired of Michelle.  Do you agree Michelle should just go away?"},{"comment_id":"10155154391786729","commenter_b":"She claims not to know how they got there. That means they are there... end of story, now prosecute.... having them on an unsecured piece of equipment is a crime. Period.","commenter_a":"DON'T TRUST HER.","post_message":"Un-frigging-believable"},{"comment_id":"1252562101428763","commenter_b":"Pathetic. She should be charged like a criminal .","commenter_a":"Illegaly gotten fees and she gets a bonus?","post_message":"It's a disgrace that while millions of Americans were defrauded by Wells Fargo, the executive in charge of running a scam received a $124 million bonus."}]
