[{"comment_id":"1117162291652524","commenter_b":"Get over it she is covered in the right places and so what if she wasn't. Are you ashamed of your body so let's slam others?","commenter_a":"She is such a skank!!","post_message":"WOAH!"},{"comment_id":"10153527478874586","commenter_b":"Make this slaughter illegal! So immoral!","commenter_a":"Go to JAIL OR PRISON!!!","post_message":"Want it to be ILLEGAL for hunters to bring back lion \"trophies\" to the U.S.?  SIGN THIS NOW FOR #CecilTheLion!"},{"comment_id":"988047007995144","commenter_b":"She's just womansplaining to him","commenter_a":"That stupid bitch next to him needs to respect other people's turn to speak. How are you going to disrespect another adult like that on national tv? Shushing him?? What a fucking cunt","post_message":"I've literally watched this about a dozen times now (and it gets better every single time)..."},{"comment_id":"1244573758893966","commenter_b":"I Absolutely agree! A party of the people. Even a small number of seats in the Senate will be very influential. This would apply to the House, state governors, all the way through to mayors and local city counsels are all controlled by big money politics. We must stop trans-national corporations, and their billionaire owners from sucking the life out of us! STop the vampire billionaires!","commenter_a":"There IS at least one viable and active third party, progressive and non-corporatist: The Green Party. but pundits don't like to acknowledge they exist. It's a weird denial-fetish.","post_message":"\"We need third parties in this country. And by that I don't mean another third party supported by billionaires, that centrist, you know, in the sort of Ross Perot manner. I mean parties that represent different opinions on the spectrum in the manner of the populist party in the 1890s which was really the last time we saw a third party movement, that contested the ballot from the bottom all the way to the top and they were a real political party.   Unfortunately the techniques that the populists used are against the law in most states. If we were to repeal those laws you might have a vibrant third party scene again.\" - Thomas Frank, author of the new book \"Listen Liberal\" in a 2012 conversation with Bill Moyers."},{"comment_id":"10153592234263132","commenter_b":"She got dem dreads doh!","commenter_a":"SHE DOESNT EVEN LOOK BLACK!","post_message":"\"We are her birth parents. We do not understand why she feels it's necessary to misrepresent her ethnicity.\""},{"comment_id":"10154001788011770","commenter_b":"They not that sexy to me at all need some meat on the bones Sarah Palin is sexy","commenter_a":"Mama's baby papas maybe They look nothing alike","post_message":"Gigi and Bella Hadid proved they are the sexiest sisters in the world at the Victoria's Secret Fashion Show."},{"comment_id":"1864804617087505","commenter_b":"Are you high lady??","commenter_a":"President elect Donald Trump is a very sharp guy... He understands how bad America has been divided. Maybe Trump is trying to get a message through Kanye to America, that we need to stop all the violence and hatred. United States! Not Divided States!","post_message":"Mr. West is in the building.   Watch Kanye walk into Trump Tower and read more about his visit with Donald J. Trump here: @webpagelink"}]
