[{"comment_id":"10152998251641045","commenter_b":"She should not be allowed the 10 as pets! Remove all the animals! What if those 10 are someones pets!","commenter_a":"Did she also house cats? I haven't read of any being there, but I wondered what happened to them if there were. Being that she was acting as a shelter for the county there should have been.","post_message":"The ASPCA's disaster response vehicle is now on site in Lawrence County to help remove more than 250 animals from the shelter. Police continue to guard the entrance, admitting only those who are helping with the investigation or caring for the animals."},{"comment_id":"10153041474101051","commenter_b":"Take away the baby and tie her up so she can see how that feels .","commenter_a":"I'm assuming she gave the baby dog food.","post_message":"Police took one look at this mom's Facebook photos and arrested her immediately."},{"comment_id":"1044939055565842","commenter_b":"Watch out for the showers.","commenter_a":"Disrespectful, Ungrateful Cretins!","post_message":"Refugees in Germany are being housed in a former Nazi concentration camp"},{"comment_id":"903785579812018","commenter_b":"OH BUT HE\"S BLACK HE DON\"T KNOW NO BETTER.SHIT HANG HIS ASS","commenter_a":"So sad","post_message":"She was shot down in cold blood and there were never any riots. This was a tragedy, and she will never be forgotten. Can we get 10,000 'LIKES' in her memory?"},{"comment_id":"10154898338007577","commenter_b":"Do you know how many Christian societies destroyed each other fighting over how they would practice Christian culture? Go back to school buddy and come back when you are ready to embrace the real fate you are living in.","commenter_a":"The liberals know their perversion of modern society with their political correctness and liberal rights for the underserving criminals, non Christian cultures is coming to an end. The American people are going to start clawing their rights back under Trump.","post_message":"MSNBC continues to whine and cry over Donald Trump being democratically elected as President..."},{"comment_id":"10153555838691336","commenter_b":"Bring back W. I want the border sealed. Military USA should patrol its own borders. No longer want any language spoken in my country. No longer want to know that the 'immigrants' get to bring everyone. No Welfare, no SSA because you have a work history while an illegal immigrant. I want the next President to Stand for American Values. Jeb Bush only stands for Obama's values. Open Borders and Anyone can use our welfare system.","commenter_a":"he needs the help.....","post_message":"Yesterday, Jeb Bush told Neil Cavuto that he thought his debate performance \"went fine.\"  Do you think so?"},{"comment_id":"10155230776483690","commenter_b":"Hahaha we cn kill u indian pigs","commenter_a":"They can kill only innocents, not terrorists. Pigs.","post_message":"In less than 24 hours after Pakistan's deadliest attack in more than two years, the army kills more than 100 \"terrorists\"."}]
