[{"comment_id":"838659359573185","commenter_b":"DON'T LISTEN TO THE DUMB BLACK BITCH","commenter_a":"Bigot","post_message":"Oprah: ‘If You Hate Obama You Are Racist, If You’re Racist You Must Die’.  She is the racist.  Do you think Oprah is a bigot?"},{"comment_id":"1715229538739557","commenter_b":"True. Plus who would want to see Hillary the Hag naked","commenter_a":"She was a good looking woman, now lets see them run nude picture of Hillary or maybe Chelsea, but then that would be equal and fair treatment and they will NOT be that.","post_message":"NYPOST runs naked pics of Trump's wife... again"},{"comment_id":"957541017614653","commenter_b":"I think she's a class act!","commenter_a":"I like all three of the non professional politician candidates and Ted Cruise and Scott Walker.","post_message":"Whoa..."},{"comment_id":"1054874157886389","commenter_b":"Well lets start with little jebs mommy! She is one horrible excuse for a human being!!","commenter_a":"whatever happened to divided CHURCH and STATE,,???","post_message":"A Republican strategist had the gall to defend Jeb Bush for supporting the public shaming of women who don't live up to his strict conservative \"Christian\" standards."},{"comment_id":"997480703647380","commenter_b":"Give me a break already,sick & tired of catering to immigrants thy don't need holidays,they need to be deported Muslims & Illegal Mexicans.","commenter_a":"It will be great when Obama change s his address to any o","post_message":"WHITE HOUSE CALL PARTICIPANTS: Want To Change This Holiday to  Immigrants Day (VIDEO)  @webpagelink"},{"comment_id":"522533064595578","commenter_b":"Shut up and set down!!","commenter_a":"he is not black he had a black father and a white mother so put that in his book","post_message":"WATCH: At a rally in Harlem, Hillary Clinton suggested there was an element of racism in Republicans' insistence that President Obama doesn't have the right to nominate Justice Scalia's successor. They're acting like he's \"not the real president\" @webpagelink"},{"comment_id":"10153527478874586","commenter_b":"Make this slaughter illegal! So immoral!","commenter_a":"Go to JAIL OR PRISON!!!","post_message":"Want it to be ILLEGAL for hunters to bring back lion \"trophies\" to the U.S.?  SIGN THIS NOW FOR #CecilTheLion!"}]
