[{"comment_id":"778618008970820","commenter_b":"I am hoping for a selective hailstorm just on the protest groups, with BIG stones.","commenter_a":"This is not protesting. These are forceful dictator type actions that are not consistent with what our country is about. And if the whole point of this is to start up Martial Law, you have no idea what you are trying to start. I am confident God is bigger than this. :) Lord, protect our freedom from dictators and those who wish to act like them.","post_message":"These left-wing groups have vowed to \"shut down\" Trump's inauguration. Here's how."},{"comment_id":"10154844264313132","commenter_b":"Sorry katie but i think you are confused between who hillary is and who trump is cuz clearly he was the one interupting her on soo many questions and tring to intimidate her just like he does every other woman but thank goodness she is a strong woman and did not let him get to her lol","commenter_a":"Wow this just goes to prove that hillary is the better candidate hands down. She definately killed trump and i think he got angry and became soo defensive lol she was very prepared and he was not","post_message":"Donald J. Trump says he will release his tax returns when Hillary Clinton releases her deleted emails. @webpagelink"},{"comment_id":"957772524242927","commenter_b":"Kiss ass!","commenter_a":"Great now Quebec will never get a team","post_message":"Gary Bettman, are you listening?"},{"comment_id":"10154148373635736","commenter_b":"His daughter/wife would hate that.","commenter_a":"When they said \"small hard object\" I just assumed the president had gotten excited.","post_message":"Police received a report Friday that President Trump's motorcade \"had been struck by what was believed to be a small hard object.\" He was passing through Palm Beach on his way to his Mar-a-Lago resort nearby, where he spent part of the weekend."},{"comment_id":"10153919372908352","commenter_b":"A REAL MESS..WOW","commenter_a":"Macho","post_message":"‘I feel like a princess!': Transgender teen crowned homecoming queen at Missouri high school"},{"comment_id":"531107707082073","commenter_b":"What a bunch of trash. Next time get up and yell back and pin them against the wall. Come on white people stop taking this shit from these thugs!","commenter_a":"We need to start taking care of business.","post_message":"\"...screaming racially motivated chants such as, “F*ck you, you filthy white f*cks!”, “F*ck you and your comfort!”, and “F*ck you, you racist sh*ts!” One girl was even reported to have been pinned by protesters against a wall, who allegedly shouted “filthy white b*tch” in her face.\""},{"comment_id":"10154130394501545","commenter_b":"@username I think CNN is giving you false hopes. You might want to turn off the biased media.","commenter_a":"I love how \"news\" organizations report this as news. Headline should read \"Professor got lucky with one correct prediction, and hopes another will come true.\"","post_message":"A professor who has correctly predicted the outcome of every presidential election since 1984 has a new prediction..."}]
