[{"comment_id":"10153265498530047","commenter_b":"@username over 5million LOL. Dead people and illegals","commenter_a":"SIGN THE PETITION / CLICK ON WEB SITE Justice Scalia one of the most brilliant and ardent defenders of the Constitution has just passed away. This is a huge, deeply felt loss. We must not forget that the next justice could impact the Court and the direction of our nation for decades. The American people deserve a voice in this decision: @webpagelink","post_message":"President Obama will stop at nothing to force his nominee for the U.S. Supreme Court through the Senate before his last year in office comes to an end.      But we can stop this from happening.  SIGN & SHARE our urgent petition to the U.S. Senate today: @webpagelink"},{"comment_id":"10154151058422756","commenter_b":"To see how idiots can find an angle to go against clean energy. Wind turbines kill birds? A far less amount then any oil spill I have seen. Or pipeline that explodes. We could do this all day but this country is long past the need to go clean energy. I hope you idiots are paid to post all these ridiculous comments.","commenter_a":"Wind and solar don't make any sense, you have to cut down large areas of forest's to put up windmills on mountain tops to construct them, and they end up killing many birds. Same goes for solar, you would have to blanket the continental US with solar panels to replace fossil fuels. It's got nothing to do with \"evil big business\", wind and solar will just never be as efficient and reliable as coal, oil, and natural gas.","post_message":"A natural gas plant in Lycoming County is now complete, and it provides energy to nearly 1 million families in our area and other parts of the northeast."},{"comment_id":"1792151467673200","commenter_b":"Right a true nasty woman!","commenter_a":"The only \"educational\" facet in Rosie is her nastiness! Period.","post_message":"Rosie O'Donnell says she posted a tweet questioning whether Donald Trump's 10-year-old son is autistic because she found it \"educational.\""},{"comment_id":"345060612364120","commenter_b":"Can we trust her? What an absurd question! Of course not!!","commenter_a":"She still has no moral compass.","post_message":"Hillary Clinton's Record Begs the Question - Can We Trust Her?"},{"comment_id":"544427389064045","commenter_b":"Why we allow these Muslims remain in our country. If they hate our traditions, and our ways. LEAVE your ungrateful Muslims.","commenter_a":"Disgusting!","post_message":"Muslim Students Walk Out During National Anthem [VIDEO]  If don't want to show your respect for our country, you can leave.  Are you appalled by their blatant disrespect?"},{"comment_id":"1104014366324977","commenter_b":"How is that racist lol Muslims are a ravery of people haha and no makes them follow a old book written by a peodphie that married a 9 year old girl","commenter_a":"Hey! Don't forget that ISIS are not \"real\" muslims. And it is just a coincidence that 100% of those who join or support are muslims. This has NOTHING to do with islam. And it is only 8% of the entire population of Turkey who supports ISIS. (according to a recent Pew Research poll) But don't worry about it, they are not \"real\" muslims either. Anyone who says that the world has a problem with islam is just a racist. We all know that islam is a religion of peace. Case closed.","post_message":"EXCLUSIVE"},{"comment_id":"10154550046141037","commenter_b":"Bring them here, give them free stuff and they will be lifelong democRAT voters.","commenter_a":"So ...basically illegal immigrates are ok by her standard?","post_message":"The 730,000 young people brought to the U.S. as children without legal status are prohibited from voting, but they are still a powerful political force."}]
