[{"comment_id":"10153829751724060","commenter_b":"Well. The Christians have overcome Crusades. Try yourself to see the present and stop to be a stupid moron","commenter_a":"You mean Islam was used as a vehicle of war?","post_message":"In 2015 religion was used as a vehicle of war. My God versus your God"},{"comment_id":"10153684689187061","commenter_b":"MariaNconnor Evans","commenter_a":"I work saturdays....","post_message":"The feeling when you realize tomorrow is Friday...   -- CLICK TO PLAY GIF --"},{"comment_id":"10153067391792217","commenter_b":"One day all Europeans will see how big mistake s to accept those who come as victims and in the future their children will try to impose sharia law","commenter_a":"It's a big mistake Europe is doing. They will regret in 10 yrs time. Why can't the arabs countries take them. Sorry for the Europeans. They will lose their freedom for sure.","post_message":"The plight of people trying to reach Europe is moving many to declare \"Refugees Welcome\"."},{"comment_id":"1813062615599826","commenter_b":"She was good at taking separate vacations and other unnecessary trips at taxpayer expense!","commenter_a":"Yes","post_message":"Yes or no: Was Michelle Obama a good First Lady?"},{"comment_id":"10153154499205047","commenter_b":"I agree, so strap on your guns and make sure we have at least 30 per mile waiting 24 hours a day, around 50,000 a day, and see how long we can do it until Trump gets the 7 billion dollar wall built, and then starve everyone, because we won't have anyone to work on our farms.","commenter_a":"It is obvious they are crossing our border and Washington is doing absolutely nothing to stop it. It is also obvious that there will be another attack here in America and Washington is doing nothing to stop it. Their solution is to take our guns away from us so we have no means of protection what so ever. America wake up! We must get rid of Obama before he gets us all killed, it is just that simple!!!","post_message":"We know ISIS wants to infiltrate our homeland, yet our borders remain unsecured.  It's time to take action.  It's time to guard our borders.    Sign our petition if you agree: @webpagelink"},{"comment_id":"916716405122968","commenter_b":"@username your name says it all!","commenter_a":"someone needs to mention the senior citizens in this country. We have not had a COLA raise for two years. BS. We might be old, but WE VOTE!","post_message":"Miners have one last shot in this election - the coal industry will be nonexistent if Crooked Hillary Clinton wins the presidency this fall. It is time to MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153531144626350","commenter_b":"I agree. God bless you Lil child.","commenter_a":"This is courage","post_message":"Looking good, Leah!"}]
