[{"comment_id":"473465766111797","commenter_b":"@username you mother should have swallowed your nasty ass.","commenter_a":"They are both true. And that cannot be argued. They are both true","post_message":"Full story: @webpagelink/ Graphic by: The Free Thought Project.com <-- 'Like' (y)"},{"comment_id":"1322891364416984","commenter_b":"Yes, Hillary should go to jail IMMEDIATELY!!!!!","commenter_a":"I am not voting for Hillary Clinton.","post_message":"CORRUPTION IS INSANE.  Americans getting screwed.    @webpagelink"},{"comment_id":"1382199778464035","commenter_b":"Your a bitch","commenter_a":"I'm sure the First Sasquatch offered so much advice, what did she do...come to the defense of her brother Harambe?","post_message":"First Lady Obama took apart Trump, and just gave Republicans even more to worry about."},{"comment_id":"10152807177319753","commenter_b":"There's a lot that factors into our timely death. We can decide to die early. I.e. Suicide. And we can die cus of our own stupidity... Jumping off a building without a parachute. It can be because of health problems. But even with all these possibilities God is the one who truly decides when we go. That's why we have so many stories that are miracle stories. Ppl surviving when they shouldn't. And sometimes unfortunately we are taken so soon. The reason being that we are all here to serve a purpose on this world for God. And when we have done such... Then God brings us home. If you read her nieces comment she lived a fulfilling life. And what ever the reason may be she completed her life. Losing a loved one is hard. I have lost a dad, and seven friends and my own kid being 23. ...","commenter_a":"GOD MAKES NO MISTAKES. SHE DIED 7 DAYS LATER. THE NUMBER 7 MEANS COMPLETION. HER LIFE WAS FULFILLED. GOD MADE THIS DECISION. I SYMPATHIZE WITH THE FAMILY, HOWEVER GOD WILL MAKE SURE THOSE CHILDREN ARE LOVED THROUGH FAMILY AND ALL THAT LOVE HER. HER LEGACY CONTINUES THROUGH HER SONS.","post_message":"After 20 years of being unable to conceive naturally, the mother had spent a decade going through various fertility treatments in hopes of having children. After 30 long years, Lisa’s dream came true and she found out she was not only pregnant, but pregnant with twins. Unfortunately, the joy was short-lived, as she passed away just seven days after her babies’ births."},{"comment_id":"1344000762286340","commenter_b":"I wonder how much Hillary paid all of these women","commenter_a":"My breast feeding children touched me inappropriately. Good Lord, People,..... Killary's Husband raped people. No comparison. Doh!","post_message":"New allegations against Donald Trump."},{"comment_id":"513861468804433","commenter_b":"Go home u witch","commenter_a":"Moron Muslims are every where lock and load it's time to to what our own goverment won't","post_message":"Muslim woman makes outlandish accusations about Americans on TV.  What a joke. This is the kind of ignorance that starts wars.  Do you agree this woman needs to be silenced?"},{"comment_id":"10155002829744411","commenter_b":"Leaks: the new news.","commenter_a":"u re a loooooser baby ...so why dont you kill yourself....","post_message":" appears, however, that after eight years the administration has suddenly awoken to the threat."}]
