[{"comment_id":"10153553750251051","commenter_b":"You are a sneaky bitch that can not fool me you brought up color stop with the bullshit. @username","commenter_a":"What do you expect from a repeat offender? Hey justice system you spineless useless system! It's because if your stupidity and loop holes that got that child a life sentence. Those children were given a death sentence by this useless pos. This vile inhumane waste if life still breathes because of your inept logic. If that were my child, I'd hunt that diseased vile pos down and set his black ass on fire...","post_message":"It was already bad enough that this man raped a 14-year-old and a baby. Then it got even worse."},{"comment_id":"10155422567365615","commenter_b":"Assholes","commenter_a":"I hope Greg Abbott gets HIV.","post_message":"They say a budget is a document that turns values into money."},{"comment_id":"10156523926480354","commenter_b":"what idiot would vote for the bitch-","commenter_a":"I knew she was cleaning up crap. It continues to spew from her mouth.","post_message":"The QUEEN Shall NOT Use the Restroom With The PEASANTS!!!"},{"comment_id":"454038491472779","commenter_b":"What the Hell is wrong with this chick...one week she poses nude and another week she posts pic of her child, are we suppose to say which one we like better....you are a sad piece of work, girl","commenter_a":"Who cares????? Guess she wants him to be seen naked also. So popular for being nothings.","post_message":"Kim Kardashian West's newest snapshot of little Saint is a burst of son-shine!  (via Celebrity Baby Blog)"},{"comment_id":"10153379974755329","commenter_b":"You have a baby in your belly. No more goofing off!","commenter_a":"Michael Aragona @username @username how do you like that?","post_message":"Thank you, restaurant gods."},{"comment_id":"1713379888949123","commenter_b":"Then resign and get her out of the White House!","commenter_a":"I would like to know why people push like on these kind of post? I don't get it! Are you stupid??","post_message":"Are you... KIDDING ME!?   So sick of Barack Obama & Michelle Obama..."},{"comment_id":"10152808578696130","commenter_b":"Sadly, I could post these articles about pitbulls all day long and never be finished","commenter_a":"The purebreds are a very dangerous breed. Statistics do not lie.","post_message":"\"This bill would make Mississippi the only state in the nation with a statewide policy discriminating against a specific dog breed, and the impact on local communities, animal shelters, and law enforcement would be disastrous.\""}]
