[{"comment_id":"1038035722930072","commenter_b":"For all you little girls out there here is your biology 101","commenter_a":"Al u people that stand with planned parenthood are just as disgusting as they are., hope your babies don't get ripped apart limb from limb you sick bastards","post_message":"#BREAKING: \"Planned Parenthood & our CA affiliates today filed a lawsuit against the people behind [the] widely discredited video smear campaign,\" tweeted Planned Parenthood president Cecile Richards."},{"comment_id":"1713198075600647","commenter_b":"CRIMINAL WOMAN FOR JAIL!","commenter_a":"Some people in the USA will say anything to keep a woman from becoming president. The most investigated woman in US history has no charges against her, no trial coming, and no convictions. This is the definition of not guilty, and yet so many continue to make accusations! Trial by rumor and innuendo!","post_message":"Americans don’t need conspiracy theories and pathological self-congratulations like those offered by Donald Trump. We need leadership, common sense, and concrete plans."},{"comment_id":"10154831956721350","commenter_b":"Isn't she supposed to be in Canada?","commenter_a":"why is she here? I thought she was leaving the country?","post_message":"WATCH: We love Amy Schumer's powerful message to body-shamers! @webpagelink"},{"comment_id":"10154780872790695","commenter_b":"One tactically trained security Guard at the massacre in Orlando changed nothing.","commenter_a":"RIP young angel If the school faculty were allowed to be tactical trained and had permission to use a gun in this kind of cases our kids would be safer idiots would fear and no one will have to shed a tear","post_message":"JUST IN: The coroner has confirmed 6-year-old Jacob Hall died this afternoon.  Hall was one of three people shot during an elementary school shooting in South Carolina earlier this week."},{"comment_id":"374997102688584","commenter_b":"she broke the law driving illegal you an i would be locked up so give her 30 days an feed her the same as they feed everybody else might make her see the light or get the hell out","commenter_a":"Tuff shit!! Take it off!","post_message":"Should head scarfs be banned in America?"},{"comment_id":"621850294655889","commenter_b":"She's a mean old lady!","commenter_a":"So I wonder who the hater is in this election? Who the bigot is? Who is the person that calls black people Super Predators? Who calls half of America a Basket of Deplorables? Who calls all human beings but elites Little People? #BasketofDeplorables #Superpredators #LittlePeople #HillaryHates","post_message":"When you are president, you are president of all the people."},{"comment_id":"10152701982362869","commenter_b":"Will miss you on Fox. Now, go get 'em.","commenter_a":"Choice satellite TV doesn't show FOX NEWS anymore so I don't get to see it. All we get is liberal news and I think this is just propaganda and time to cancel choice for violation of our contract.","post_message":"This evening I wanted to share with you some news that is very personal to me.  Because you have been such a good friend and a strong supporter of all my efforts, I wanted you to know first that tonight I will do more than just say goodnight on my Fox show.  I will say goodbye.  This is the last edition of Huckabee on the Fox News Channel. It has been the ride of a lifetime, and I have never had so much fun in my life. But I also realize that God hasn¹t put me on earth just to have a good time or to make a good living, but rather has put me on earth to try to make a good life.  There has been a great deal of speculation as to whether I would run for President.  I won't make a decision about running until late in the spring of 2015, but the continued chatter has put Fox News into a position that is not fair to them. The honorable thing to do at this point is to end my tenure here at Fox so I can openly talk with potential donors and supporters and gauge support.  As much as I have loved doing the show, I love my country more, and feel that it may be time for me to leave a zone of comfort to engage in the conflicts that have almost destroyed the bedrock foundations of America.  I feel compelled to ascertain if the support exists strongly enough for another Presidential run. So as we say in television, stay tuned!"}]
