[{"comment_id":"1310724188980341","commenter_b":"This woman has nothing better to do.","commenter_a":"idiot","post_message":"Hey, stop \"appropriating\" our language..."},{"comment_id":"10153743132780950","commenter_b":"Fuck you Bitch!!!","commenter_a":"The entire staff cheats on that team !!! Even Bellicheck...fuck the entire Patriots organization!!!!","post_message":"New England Patriots quarterback announces latest move in wake of court rejecting appeal."},{"comment_id":"10153588597752042","commenter_b":"Its not indecent exposure. Breasts arent genitals and they are legal in ny. Also its 2015, so if they ban toplessness in nyc or just the times square section, men jogging around topless or wearing loose tanktops showing nipples should be banned as well. Its the same body part. As a matter of fact men in beach should wear something to cover their bare chests as well. Its only fair to women.","commenter_a":"Nope! First Amendment vs. Decency! The problem was old-styled Garbage at Times Square, that problem was solved by then-Mayor Giuliani in late 1990s. DeBlasio was too socialist today!","post_message":"NO MORE NUDITY: After several calls of criticism about topless, body painted women in Times Square, a Bronx politician has introduced legislation to ban toplessness across New York. Do you think this should be passed?"},{"comment_id":"10154661777626336","commenter_b":"I encourage all you Hillary supporters to each take in 3 Syrian refugees, because we don't want them here. Let them live in your homes. And while you're at it, since you Hillary sheep hate #Walls, start the #movement by taking the walls down, doors and windows off your houses and let people come in and out freely. And while you're at it, put up your gun free zones. #Trump2016 #BuildThatWall","commenter_a":"It's now reported that Hillary is going to appoint Loretta Lynch to the Supreme Court if elected president....pay for play, and corruption to the max. UNBELIEVABLE but not unexpected.","post_message":"\"You tell me what’s worse: Name-calling or lying to grieving parents as their sons' bodies lay cold in caskets... and then turning around and calling those parents liars?\" – Judge Jeanine Pirro @webpagelink"},{"comment_id":"10157791995705206","commenter_b":"Rhd cars are illegal in NJ","commenter_a":"I see how they survived. The driver's side is on the right not the left. If it was an American made Car. The driver would have been dead.","post_message":"How could anyone have survived this horrific car crash? @webpagelink"},{"comment_id":"10153525959526336","commenter_b":"The mom is a idiot No common sense dumb woman that is it Let lock her up in a hot car and see if she likes it That little girl was soak with sweat even with the windows rolled down a little bit duh","commenter_a":"She took one kid with her and left the other one in the car????","post_message":"Video below shows the moment that officers freed the little girl from the van."},{"comment_id":"882209121877695","commenter_b":"When they said the meek would inherit the Earth, I don't think they meant the stupid. Unless they did and if that's the case someone is so fired for reading that wrong. But I am sure that isn't the case. Though that means god is going to be ever so pissed. At least everyone of these blind hate filled asshats will be happy to know Hell is warm year round forever.","commenter_a":"Kudos to them \"good 'ole white boys\" for doing there part against ISIS by attacking an innocent old man. They should go fight in Syria if they have the courage.","post_message":"U.S. Sikhs are frequently conflated with Muslims and often wind up absorbing the backlash against Islam."}]
