[{"comment_id":"10152956795647093","commenter_b":"Definitely a woman","commenter_a":"She looks like she could be a man in a wig","post_message":"Arlington police would like your help finding a car burglary suspect caught on camera..."},{"comment_id":"1833528413366580","commenter_b":"I say build the wall right up to California and let them funnel in but the thousands and with this Joker figure out what to do with him he'll change his mind pretty quick","commenter_a":"They better stopp look and listen","post_message":"\"There’s something called CEQA in California...\""},{"comment_id":"10154322735965963","commenter_b":"Deport all illegals","commenter_a":"This is bull nothing but bull! I have family that works and pay taxes and just to renew the green card 💳 cost a lot of money","post_message":"LIVE: Minneapolis police are monitoring the Caravan of Love protest that started at City Hall and is heading toward the U of M. The estimated crowd of 2,000 is marching in support of immigrants and refugees."},{"comment_id":"10154243512856770","commenter_b":"We will send you more Muslims , you can send us the anti Muslims.","commenter_a":"I openly protest morons who throw homosexuals off buildings and burn people alive who don't bow before their god (may he eat pork)","post_message":"Police in Toronto, Ontario might charge a group of anti-Muslim protesters for violating hate crime laws."},{"comment_id":"678882268945673","commenter_b":"Rosie has the mental disorder! She is a raving maniac!","commenter_a":"I thought she was moving....","post_message":"WOW! Leftist Bully ROSIE O'DONNELL Pushes Horrible Rumor On Social Media...Suggests Barron Trump Has Mental Disorder [VIDEO]"},{"comment_id":"831073873594702","commenter_b":"She needs to eat goat meat. Raw.!","commenter_a":"Hey monkey looking good","post_message":"What's wrong with her!? You have to read this:"},{"comment_id":"602931503228475","commenter_b":"I have never heard of or seen a cow attack a person!!! No Good Worthless Muslims!!!","commenter_a":"Those men will burn in hell one day","post_message":"Two Men Were Stabbing a Girl in “Honor Killing” When This Cow DID THIS to Stop Them…"}]
