[{"comment_id":"10152908001254071","commenter_b":"Women's sports don't even count","commenter_a":"#Webelieve","post_message":"A massive blow for the U.s. women's soccer team."},{"comment_id":"474511766072737","commenter_b":"Can't do that until you remove the Muslim president who encourages them to take over.","commenter_a":"we need to take our Country back. We outnumber them let stop the insanity. Dont let any mosks be built in this country. We cant build Churches in theirs. If they dont like it here than leave. No one would care.","post_message":"Muslims force this school to ban Christian holidays.  America is under attack, this is treasonous.  'LIKE' if banning Easter is WRONG!"},{"comment_id":"1236409066433862","commenter_b":"Clifford Maclean Losee","commenter_a":"Save your money you bunch of fruit cakes!!!! You might be able to afford things if you would quit donating to lost causes!","post_message":"Michigan certifies President-elect Donald J. Trump's win in the state, awarding him 16 electoral votes. @webpagelink"},{"comment_id":"10157307268915354","commenter_b":"Definitely yes. We do not want them here. Security risks.","commenter_a":"Go back to your shithole of a country and wear your burqas there.","post_message":"WOW.  Can you name the other 2 countries?"},{"comment_id":"1103976636304606","commenter_b":"Man says something about women in sexual overtone, people are \"Shocked and Disgusted\". Welcome to planet earth.","commenter_a":"Who cares?","post_message":"Sen. John McCain has withdrawn his support for Donald Trump following the disclosure of a video recording in which the candidate made lewd comments about women."},{"comment_id":"10153577696206337","commenter_b":"yeah.. IM gross wonder how many old fat bitches are just jealous that some 16 year old whore was getting his footlong? \"young teen: my azz, she was advertising on craigslist looking for the D 16 is legal in his state moron for good reason. id pound the shit out of some 16-17 (contingent on state) year old pussy fuck yall","commenter_a":"God damn it, Jared. We don't have to worry about Ronald FUCKING McDonald FUCKING AN UNDERAGE GIRL!","post_message":"BREAKING: Former Subway spokesman Jared Fogle allegedly bragged about paying for underage sex in a series of lewd, sexually explicit texts..."},{"comment_id":"1758501704379005","commenter_b":"That cow can't just shut up can't wait till she moves to Canada","commenter_a":"yes she is","post_message":"Whoopi Goldberg Insults TV Host For Being White, See What Happens Next. She is the biggest hypocrite. What a bigot. Do you think Whoopi is a racist?"}]
