[{"comment_id":"10153202858353352","commenter_b":"Nigger Bitch??? Hahaha So Original","commenter_a":"Only because he was a black cop..... If he was a white cop that cracker would be locked up..","post_message":"Gun enthusiast who shot police chief four times during raid walks free because cops 'didn't have enough evidence to charge him'"},{"comment_id":"1457146887628950","commenter_b":"She's singlehandedly responsible for the murder of countless unborn babies! She can burn in Hell!","commenter_a":"Rest In Peace Norma. God bless you","post_message":"Norma McCorvey, 'Jane Roe' of Roe v. Wade, dies at age 69"},{"comment_id":"10154342764073701","commenter_b":"Listen to yourselves! Stop just stop! Do you realize that YOU are part of the problem?","commenter_a":"People, they are donating money to people in need. That's it! Why is everyone in such a hurry to provoke anger. Myself I feel all that needs to be said is, Thank you Disney!","post_message":"Disney announced it's donating $1 million to a fund set up to help those affected by the attack at Pulse nightclub in #Orlando."},{"comment_id":"10154274649819087","commenter_b":"Dear Democrats and Liberals, I'm noticing that a lot of you aren't graciously accepting the fact that your candidate lost. In fact you seem to be posting even more hateful things about those of us who voted for Trump. Some of you are apparently \"triggered\". Because you are posting how \"sick\" you feel about the results. How did this happen you ask. You created \"us\" when you attacked our freedom of speech. You created \"us\" when you attacked our right to bear arms. You created \"us\" when you attacked our Christian beliefs. You created \"us\" when you constantly referred to us as racists. You created \"us\" when you constantly called us xenophobic. You created \"us\" when you told us to get on board or get out of the way. You created \"us\" when you forced us to buy health care and then financially penalized us for not participating. You created ...","commenter_a":"People will never vote Democrat again, once they appoint an Islamic extremist at the helm:)","post_message":"\"People didn't vote for Trump so he could bring a white supremacist into the White House,\" Elizabeth Warren said."},{"comment_id":"689620071188876","commenter_b":"Then they should Cancel the game until they show some respect for the USA","commenter_a":"I'm done with the NFL!","post_message":"This whole NFL squad will join Kaepernick in protesting the National Anthem on Sunday."},{"comment_id":"10154323426879778","commenter_b":"Sad!! Rip LP","commenter_a":"Prayers to the family.","post_message":"The 80-year-old may have been found dead, police said Monday."},{"comment_id":"816614281820679","commenter_b":"You have got to be kidding 49. Unbelievable! Evil surely takes its toll. She looks horrible. I am older than her!","commenter_a":"Can you believe the skanky crack whore, also known as KellyAnne Conway, is only 49? She looks like she is late 60's or early 70's... This is the toll that selling your soul to the devil will take on you!","post_message":"She did sell her soul to the Devil, after all."}]
