[{"comment_id":"10153054490024877","commenter_b":"This woman proclaims her ignorance every time she opens her mouth. She would do better to be seen and not heard.","commenter_a":"This thing has no soul. Fox News is her God & it dictate that,she say the most outlandished comments.There is a special place in hell for her. #Judgement day is coming soon.","post_message":"Ann Coulter on black protestors: Haven’t we done ‘Enough’ to make up for slavery? And that's just the beginning of what she has to say.   Grio fam, this video clip is controversial to say the least. Check it out and sound off below!"},{"comment_id":"899130260122396","commenter_b":"Eat what we or go back to your own country.","commenter_a":"Just go away.","post_message":"OUTRAGE"},{"comment_id":"10153153528689071","commenter_b":"You mean in the houses where tragedy still occurred, like drownings, accidental poisonings, falls etc? Not the sharpest tool in Lowes are ya?","commenter_a":"This sort of thing happens less often in houses without guns, but I'm sure that's just a strange coincidence.","post_message":"An awful tragedy happened in Chicago."},{"comment_id":"10153592234263132","commenter_b":"She got dem dreads doh!","commenter_a":"SHE DOESNT EVEN LOOK BLACK!","post_message":"\"We are her birth parents. We do not understand why she feels it's necessary to misrepresent her ethnicity.\""},{"comment_id":"596504240534222","commenter_b":"She is such a liar!","commenter_a":"If Donald would answer the question instead of just attacking Hillary perhaps she could stop having to check and correct his accusations first before actually answering the question in her own 2 minutes. Geez it's insulting that this man shows up to a debate unprepared. #whatajoke","post_message":"RT LIVE STREAM: Hillary Clinton / Donald Trump 2nd Presidential Debate (Courtesy: Ruptly)"},{"comment_id":"10154302766323543","commenter_b":"@username The problem in California is that now illegals have driver's licenses and with that, they were simultaneously, automatically REGISTERED to VOTE as well. Thank to Jerry Brown. We in California are also overrun with Sanctuary Cities and BROKE due to these idiotic, liberal politicians!","commenter_a":"Regardless of the number, I am strongly in favor of requiring IDs for voting. NO ONE should be allowed to vote if they don't have the legal right to do so.","post_message":"Hillary Clinton garnered more than 800,000 votes from noncitizens on Nov. 8, an approximation far short of Donald J. Trump estimate of up to 5 million illegal voters but supportive of his charges of fraud. - via The Washington Times"},{"comment_id":"10154362042947756","commenter_b":"I would like to point out, this is myself debating with other women, not only do they act insane, but they will hate on any woman whom has a different opinion, get rid of the illegals, they are a drain on our economy...period, if you don't like, then let them live in your home, your a bunch of rabid animals acting like crazy people...how can anyone ever take you seriously...this was an experiment for my college professor whom wanted us to learn abouy equality...lol","commenter_a":"Well once all the blood sucking illegal's are gone, we can put money towards our vet's and the wall, we all know Mexico is to cheap and lazy to pay for it.","post_message":"President Donald Trump is expected Wednesday to move forward with plans for border wall, increased deportations."}]
