[{"comment_id":"870170056373024","commenter_b":"Illegal aliens yes. Immigrants that come in legally and get properly documented should be allowed work as long as they don't have a disease or criminal record.","commenter_a":"Me too","post_message":"71% of voters said they would be in favor of Congress passing a law making it illegal for businesses to hire illegal aliens. Don't you agree?"},{"comment_id":"750651481734699","commenter_b":"Sounds to me like the other parrents in the school system should demand the girls immediate expulsion for the good of their own children.","commenter_a":"Fuck that cop if that was my daughter he'd be a dead mother fucker","post_message":"This could be BIG. Does this change your opinion on the whole incident?"},{"comment_id":"1007831625924362","commenter_b":"Aka: a bitch wasn't a slut cause she refused to go along ( re: politically, sexually, maternally, etcetera.)","commenter_a":"Never, even when I thought it of myself. Maybe since I'm \"of a different generation \" I'm prouder of some other word","post_message":"You keep using this word. I do not think it means what you think it means. - Alisha Huber"},{"comment_id":"10153173606151602","commenter_b":"Hartford rules, its a silly name just like every other name in the minor league. The only difference is that its unique and stands out a bit because it's so absurd. I'm still going to have to fun.","commenter_a":"I feel like I am constantly defending Hartford - telling people how far the city has come, and all of the neat things there are to do here. But this? This, I cannot defend. I was super excited for this stadium, and now, for the first time, I am truly embarrassed for and by this city that I have grown to love. Temporary attention that derives from a stupid name doesn't breed long term community commitment. It just gives jaded locals more things to complain about, instead of taking pride in their city. Such a shame.","post_message":"After weeks of waiting, we now know the name of Hartford's baseball team."},{"comment_id":"460068644183716","commenter_b":"Illegals breed for welfare-their U.S. born-anchor babies support them!!!","commenter_a":"how did they get them to start with.","post_message":"Should All Illegals Collecting Welfare Be Deported?  Comment 'yes' or 'no'."},{"comment_id":"10152765458922452","commenter_b":"What a beautiful woman!","commenter_a":"NoooooooooooH! Whhhhhhyyyyyyyyyyy!! 😢😣😧😩","post_message":"This is the last year that the original version of Kraft Mac & Cheese sold in the U.S. will contain artificial preservatives or synthetic colors. @webpagelink  In January, Kraft says its macaroni and cheese will be colored using paprika, annatto and turmeric."},{"comment_id":"1135264553151680","commenter_b":"Only you idiot liberal want these invaders here... Morons","commenter_a":"But who would want to live there? Especially a refugee, who will be treated worse than they treat their own minorities and poor (which is pretty terrible).","post_message":"Fact check."}]
