[{"comment_id":"10155002538802178","commenter_b":"Please NO MORE ! Can't stand that woman, Muted ever time I seen her appear","commenter_a":"Well hopefully I will never have to see that white haired women doing Holdings commercials ever again now that it is over. During the evening news that same commercial ran 4 times an hour.","post_message":"BREAKING NEWS: Three-term 2nd District Congresswoman Renee Ellmers has lost the Republican primary to fellow Congressman George Holding, who ran in her district after a court-ordered revamp of North Carolina's congressional map moved his 13th Congressional District out of the Triangle, according to The Associated Press. Follow the latest developments at @webpagelink"},{"comment_id":"10156046538185389","commenter_b":"Sorry , but I don't think women belong in combat ! I am old fashion , I still believe in Chivalry ! :D","commenter_a":"Time to retire this so called..\" Top Admiral \"..too many PC types in the military now, arm chair leaders..!! Desk jockies..!!","post_message":"The U.S. Navy's top admiral said he believes female sailors should be welcome to join the service's elite SEAL teams, provided they can pass the training regimen."},{"comment_id":"592533384204588","commenter_b":"Matt, she's just another dumbass liberal !!","commenter_a":"TRUMP THE GREAT {ONE AWESOME GUY }","post_message":"Trump: \"We must replace the present policy of globalism....and replace it with a new policy of Americanism.\" How do you feel about this?"},{"comment_id":"973903779296042","commenter_b":"One of the stories the parents were arrested because they did it:( it wasn't an accident.","commenter_a":"I really enjoy reading all the comments by individuals who apparently parent in the most perfect way. (*said sarcastically*) It is so easy to judge someone else, heaven forbid some terrible accident happens on your watch and you have complete strangers calling for your head. In any case, my heart breaks for this family and the loss of their child.","post_message":"#BREAKING A 2-year-old has died after falling into an unsecured septic well near Burlington. >> kiro.tv/SepticWell  Henry Rosoff is heading to the area to learn more on this heartbreaking story."},{"comment_id":"1748877948703805","commenter_b":"Always been there for women? She doesn't even pay equal to men in her own foundation and campaign. Bernie's \"socialist destination\" is s fulfillment of FDR's vision. Hillary will fulfill the Koch brothers and Walton family's vision. I don't revere poverty, nor do I support buying an election and using electoral fraud to gain office. No, Bernie won't \"part the Red Sea,\" but the electorate he is inspiring will effect a revolution.","commenter_a":"It seems to me that the Super Bernie people are caught up in useless passion over issues that are neither new or original. I distinctly recall when Mrs. Clinton went to capital hill and pitched for universal healthcare on live television. She was eaten alive, but she stood her ground as she has on the grassroots level many many times. She's always been there for women especially where wages were concerned. And there is so much more. Mr. Sanders is not a bad person but it is a bit disinginuous to ride the democratic train to get to a socialistic destination. It's also unfair to insist that anyone who has made the system work for them is a bad person. Bernie is no more deserving of reverence for the money he doesn't have than Hillary for the money she does have. She worked for hers' and he worked for his. ...","post_message":"Time to unify the party."},{"comment_id":"10153232997868352","commenter_b":"Serve her right she should have been in her house doing house work or school what the hell she doing out in a battle field throwing stone, lack of parenting","commenter_a":"that is horrible. This needs to be told all over the news. Sounds like something SA would do instead of Israel.","post_message":"Palestinian girl, 14, locked up in Israeli prison for two months for throwing rocks"},{"comment_id":"10153737493874705","commenter_b":"Up Scumbag!","commenter_a":"But who won between Scumbag and Footlights?","post_message":"Oh, wow."}]
