[{"comment_id":"884938878291056","commenter_b":"I'll fuck her up","commenter_a":"@username let matce do this she won't ever have that boy again!!!!!! I'll do everything in my power to get him from her","post_message":"Woman Checks A Mother Abusing Her Autistic Son At A Wafflehouse!"},{"comment_id":"1086229651436699","commenter_b":"I bet the real problem some have is that Black females got into West point, never mind graduate from there.","commenter_a":"When you lower the entrance standards to one of the world's greatest Military Academy, this is what you get...","post_message":"The image has spurred questions about whether the gesture violates military restrictions on political activity."},{"comment_id":"10153436372151337","commenter_b":"But Mariah has the booty","commenter_a":"The only reason this game sells is because of kate upton's nice tits. Big mistake","post_message":"A NEW \"FACE\": Those Game of War - Fire Age commercials will no longer feature Kate Upton..."},{"comment_id":"10153248558026336","commenter_b":"Is eating pussy a sin??","commenter_a":"Just absolutely heartbreaking. So glad their little one survived. Prayers for all involved in this devastation.","post_message":"Melissa and Michael Mooneyhan died shielding their young daughter from a tornado in Arkansas. The girl, who is about 18 months old, survived."},{"comment_id":"10154486543656037","commenter_b":"Hillary has deceived all of u!!' Rosanna, this is what she wants. You're just as disgusting as her😎😎😎","commenter_a":"Trump has been saying the system aka Democraps is Rigged. I guess they gonna start saying build a wall next lol copy cat libtards!","post_message":"Elizabeth Warren: \"The system is rigged, and Donald J. Trump would make it worse.\" @webpagelink"},{"comment_id":"969205239835501","commenter_b":"Karma ain't she a bitch!!!","commenter_a":"Karma is a bitch. Racism and bigotry are not signs of a patriotic, freedom loving American.","post_message":"The couple that hates together stays together, but their hypocrisy has finally come back to bite them."},{"comment_id":"10153215772461943","commenter_b":"I don't trust her, Should be tried for treason","commenter_a":"Was never any doubt, when her mouth moves, she is lying!","post_message":"** Now we have smoking gun proof of Hillary Clinton involvement in the lying Benghazi  points used by Susan Rice... Please SHARE this breaking news story! **"}]
