[{"comment_id":"549294818565391","commenter_b":"Its not a womans choice to kill an unborn child if you dont want a child dont have sex its that simple","commenter_a":"It's each woman's choice.","post_message":"Today marks the 43rd anniversary of the Supreme Court's decision in Roe v. Wade. On this somber day, I know it's difficult not to be discouraged that the Supreme Court's decision in Roe still stands. But now is not the time to give up. We must work together to continue promoting a culture of life in Arkansas and America. Read more:"},{"comment_id":"1216942571674495","commenter_b":"Deceitful lying criminal. God have mercy on those who vote for monster Hillary. She will destroy this country with her crimes.","commenter_a":"How telling!","post_message":"Hillary v. Hillary!"},{"comment_id":"10152705409276051","commenter_b":"This scummy bitch deserves to die for what she did to that baby","commenter_a":"sorry sick people deserve the worse","post_message":"Officials couldn't believe that a mom would do this to her own child."},{"comment_id":"1145710305499191","commenter_b":"Women are insane! All of them!","commenter_a":"Omg Daniel Melchior","post_message":"This woman has said her ex-fiance hit her, causing a black eye and other injuries. But now his attorney says this home surveillance video tells a different story.  STORY: fox32chicago.com/news/@username-story"},{"comment_id":"1584256221591722","commenter_b":"Donna, STFU!!!","commenter_a":"When my kids were young and one of them had pulled some lame brain stunt but I wasn't sure which I'd start a mild-mannered conversation about it when they were all present. Sure enough one of them would just sort of drift away--go outdoors or to his room. It was an instant notification as to whom the culprit was. So the Puffy Orange Juvenile is drifting away? Bingo! That's enough for this old mom.","post_message":""},{"comment_id":"1639738129419643","commenter_b":"@username he hasn't done anything yet. He is the President elect. He won because People are tired of the false unemployment rate Obama is pushing. Tired of the rising cost of Insurance except for people like you who probably get it for free. Tired of the war with radical Islam that he has no strategy for winning. Tired of illegal aliens pushed on us and tired of sanctuary cities and tired of people like Kate Steinle being murdered by them. You certainly can't blame Trump for any of those things. Have a nice day in your la-la land world.","commenter_a":"Actually, Barack Obama is responsible for Trumps win because he has screwed this country so badly and people are sick of his shit and knew that Killary is not only unqualified, dishonest as hell, and a total liar but that she would continue Obamas agenda to destroy our country.","post_message":"Barack Obama said that Russia is responsible for Donald J. Trump's win, but he didn't expect Sean Hannity to knock his lies right back in his face. The democrats just got schooled.  Let's get 2,000 shares to show that America can't wait to get Obama out of office."},{"comment_id":"10154570112539497","commenter_b":"*grandma hands me a $10* \"Go get yourself a cup of coffee!\" \"Grandma, this is a $10...\" \"Then get yourself 3 cups of coffee!\"","commenter_a":"Jennifer Ann Winchester","post_message":" don tell your parentsthis is just between you and me. Good boy."}]
