[{"comment_id":"865398446828911","commenter_b":"She got what she got! Gee if you talk back to the KING media anymore you get taken down!!! Shut up Savannah!","commenter_a":"Certainly not unbiased. It's wrong, but not shocking at all that the so-called journalists have an agenda. I don't think Rand Paul was being sexist or rude at all. On the contrary, I think he was polite considering. He simply didn't let her tank-roll over him. I loved it!","post_message":"Liberal media is NO MATCH for Rand Paul!  Watch him completely DESTROY NBC host who tries to put words in his mouth!"},{"comment_id":"665165626971083","commenter_b":"Never Clinton!! She praised Robert Byrd A known KKK LEADER AND KLAN RECRUITER and a complete liar and flip flopping scumbag!! And her SEXUAL PREDATOR Husband need to be put in jail!! We need to set limits on how long you are allowed to run in government and all these establishment criminals that keep getting elected and ruining our country on both sides need to go !!!!","commenter_a":"I don't believe that !!","post_message":"Unless things change extremely fast, Clinton will officially lock up the Democratic nomination after the California primary. Will you be supporting her this November?"},{"comment_id":"10153198619131378","commenter_b":"Hell no he has lost his mind please hurry 2016 so he can take a much needed seat lol","commenter_a":"No more illegal","post_message":"\"Now we know the scale of this problem. It's significant. And there are millions of people who have been driven from their homes because of this violence,\" President Obama said."},{"comment_id":"909813239056017","commenter_b":"And ya wonder why his kids are so messed up...duh. apple doesn't fall far from the tree.","commenter_a":"Who cares, ?","post_message":"\"I'm so happy after such a long struggle to be living my true self.\""},{"comment_id":"10153236648136167","commenter_b":"Pretty sure that Mika just","commenter_a":"MSNBC is such an embarrassment to itself.","post_message":"Hours after MSNBC itself reported that this lie was debunked, Joe Scarborough was still pushing it."},{"comment_id":"10153813009729497","commenter_b":"Birth order matters: by the third kid he or she can tell through the uterine lining how lame life is going to get","commenter_a":"Most of us are now. Thanks to big business. Bought politicians","post_message":""},{"comment_id":"1086650491355306","commenter_b":"Furthermore: @webpagelink","commenter_a":"the outcome is so sad, I feel sorry for the woman relatives... I believe her suicide was due to the bad treatment she received from police, and that she was extremely emotional about it... nothing will avoid this happening again, but re-training the whole police dptm about the way they treat any ordinary citizens nowadays","post_message":"A Texas trooper who arrested Sandra Bland has been fired after being charged with misdemeanor perjury on suspicion of lying in the arrest report he filed, officials said. Read more: @webpagelink"}]
