[{"comment_id":"473948236146716","commenter_b":"Go die old bitch","commenter_a":"lost all respect for superbowl....half times and commercials...all just the liberal agenda PU not worth staying up to watch...won't bother with any of the sports hype next yr.","post_message":""},{"comment_id":"10153835564541002","commenter_b":"@username, LEAVE then!","commenter_a":"What happen to \"Land of the free\" ?","post_message":"President Barack Obama suggested maybe it's time to make voting a requirement.  Share your thoughts on this idea -- good idea or bad idea?"},{"comment_id":"10154913059491350","commenter_b":"Shawna Cargill","commenter_a":"Nick Shanahan","post_message":"CHICKEN. TOT. PIE."},{"comment_id":"10154741316933812","commenter_b":"Hillary will be president","commenter_a":"Remember when Hillary Clinton said the 50,000 emails she kept from the State Department (in violation of the Federal Records Act) were about yoga and her daughter's wedding? How many of the most recent set of 14,900 emails ordered made public by a federal court are about yoga or her daughter's wedding? I'm thinking zero. But hey: pertinent falsehoods under oath aren't criminal when you're aspiring to become the First Woman President (TM).","post_message":"Meet Meatball: The adorable, friendly and rotund pit bull mix that can't help but flash his brightest smile as soon as he sees a camera. \"As soon as the camera turns on he just gets this huge grin on his face.\""},{"comment_id":"10154772615548701","commenter_b":"Od the bitch","commenter_a":"U fux'n C U N T.... Let me c u any where... U will wish ur momma swallowed the load u were conceived...","post_message":"A Washington mother is accused of giving her three young children heroin to sleep. One of the children told investigators his parents gave him and his sisters the \"feel-good medicine.\""},{"comment_id":"10153896144132061","commenter_b":"Women get it done.","commenter_a":"Husband leaving town at a bad time","post_message":"\"This is what happens when you are 35 weeks pregnant, husband leaves town for the weekend, childcare for your 3-year-old falls through, and you have a game to cover!\""},{"comment_id":"10154259987641955","commenter_b":"Lilla Williams","commenter_a":"Good lord. I was watching a news person on Fox this morning lifting off in a balloon and thought, what if it caught on fire. Saw this later and it's so sad","post_message":"HORROR: HOT AIR BALLOON CRASHES IN TX...  16 DEAD..."}]
