[{"comment_id":"10152949520761519","commenter_b":"FWIW: Jesse, I love your points of view. Over the years your passion and knowledge have helped me evolve my own perspectives on politics and the news. However, I respectfully disagree with your use of pejorative terms to describe women in this fashion. I think it is as much demeaning to you, and women at large, as it is to the targets of your invective. I respect your assertion of your right to use these terms, and you have articulated to me in the past why you choose to use them. I respectfully disagree with it.","commenter_a":"Those Fox News bitches really whore it up with the make up, don't they?","post_message":"\"You can’t separate fiscal issues from social issues...\""},{"comment_id":"1017654374977457","commenter_b":"But if you don't punish them and just deport them, they will be back in a matter of days ! Secure the borders and then release them all back to mexico !","commenter_a":"Depends, they should first pay the consequences for their criminal behavior and then be immediately deported. Maybe the consequences should include the death penalty, financial remuneration, work to give back to the community, such as the CCC did under FDR and the DNC.","post_message":"Donald Trump and Ann Coulter think that immigrants that commit crimes should be deported right after being convicted. What do you think?  Vote in the poll and have your voice heard!"},{"comment_id":"1056006761151457","commenter_b":"Or you can stfu bitch","commenter_a":"i would of told this piece of shit to shut the fuck up, this isnt the 1960s she can shut the fuck up and get over that systematic racism no longer exist in this country and its on individual cases racism will exist every where those mother fuckers could get up at any time and leave the room she is a retard racism exist in all races my point being just take a look at BLM activist openly calling for the execution of white people and white cops enough is enough fuck this page and fuck all of you who support this piece of shit.","post_message":"It doesn't feel so good when the tables are turned, does it? The students are participating in a thought experiment in which people are prejudged on the basis of their eye color.   Shared by Occupy Democrats, LIKE our page for more!  Clip from: \"The Color of Fear\", directed by Lee Mun Wah of StirFry Seminars & Consulting.  www.stirfryseminars.com A full trailer for the film can be found online at:  @webpagelink"},{"comment_id":"10153377279001756","commenter_b":"It's not just women. I had to go to the ER with a legit panic attack and they accused me of being on cocaine.","commenter_a":"A medical professional assuming that a woman is having a panic attack instead of a real problem? Shocking!","post_message":"Often, doctors reinforced women's fears of pulling a false alarm, automatically assuming that those with heart attack symptoms were suffering from indigestion, or maybe a panic attack."},{"comment_id":"532937326855044","commenter_b":"She takes no responsibility. She whores and takes no responsibility because it is his fault. Logic?","commenter_a":"A Hole..step up to the plate and accept your responsibility!!","post_message":"What a piece of sh*t   | Liz"},{"comment_id":"10153663398345695","commenter_b":"Are you for real, time and money wasted on a couple of idiots that felt the need to drop confederate flags on a church lawn!!!","commenter_a":"Can someone please explain to me how this is a crime .","post_message":"\"What can you do? Nothing but pray for them,\" said Stacy McCrary.   Why the suspects can't be charged with a hate crime starting on Channel 2 Action News at 4 p.m."},{"comment_id":"10154216491251943","commenter_b":"WAKE UP AMERICANS .. This May be the Last Chance American and the American people (voters) have to retain and Guarantee, our American Heritages, Customs and Constitutional Rights .. We need to rid American of the Radical Muslims and Illegals who are here and trying to take over America .. Do You want a Clinton Corrupted Government Controlled Life or a Trump Love America Lifestyle for your Children's Children .. SERIOUSLY - that is the Choice Were making and There going to be Living with .. This is more for our Children and there Children than for US but only WE can Guarantee them a life and Future that we had .. Clinton will be a Disaster for America and all Americans .. Surely you can realize that - listen to the news , ,LISTEN .. WE THE PEOPLE - need to Bring back GOD, COUNTRY AND CONSTITUTIONAL FREEDOMS to ...","commenter_a":"Burn the witch!!!","post_message":"Hillary Clinton must be held responsible for using \"private\" email accounts and a hidden email server as Secretary of State to conduct government business in violation of the law!  Judicial Watch is the one organization with a proven 20-year track record of investigating, exposing, and prosecuting Hillary Rodham Clinton and company. Please SHARE!"}]
