[{"comment_id":"367721800082095","commenter_b":"Lol \"rape culture\" sweetie go live in the Congo where the war lords use rape as a tool and come back and tell me this label is \"rape culture\" rape is a serious and horrible crime that doesn't need to be trivialized with your suburban feminist mindset.","commenter_a":"Rape culture nonsense again. The world gone mad. Get a life feminists. A slogan on the beer isnt going to encourage rape for fuck sake.","post_message":"\"The perfect beer for removing 'no' from your vocabulary for the night.\"   What?!?!"},{"comment_id":"10153180740642894","commenter_b":"GTFOH. what she suppose to tell the Man not to come around cuz of the media. She ain't playing house she wit a man that has morals and wants to marry her.","commenter_a":"He telling truth i don't know why have something negative to say in all ciara interview she like drama and she was put her son in the middle that's crazy😬😬😬","post_message":"Future Covers ‘XXL’, Says Ciara Tried to Overshadow the Success of His ‘DS2’ Album [Photo]"},{"comment_id":"10152793243512144","commenter_b":"They all want to save these illegals l, as long as someone esle does it. I say for every liberal who wants a say in this, place one illegal in thier home. That's immigration reform!","commenter_a":"'Overflowing sewage'.......yes liberals are","post_message":"\"Overflowing sewage\" will do that."},{"comment_id":"10154110742322439","commenter_b":"Cowards !! Stay to fight for your country !! You are Iran's puppets !!","commenter_a":"No problem. Enlist them in the French Foreign Legion - minimum 12 year enlistment; send them to Corsica for Basic and Combat training, and then deploy them to Libya to fight ISIS.","post_message":""},{"comment_id":"10153653816037377","commenter_b":"NO AMERICAN FLAGS!","commenter_a":"The color of Hillary stage is UN blue. No America to be found.","post_message":"As the Democratic National Convention entered its second day, presumptive presidential nominee Hillary Clinton's campaign is getting ready for Wikileaks to release more purloined emails and downplaying their potential impact."},{"comment_id":"10155080825746037","commenter_b":"Andrea ... it is scientific fact that bees couldn't fly without wings, but, pull the wings off of that bee and it is still a bee ! Semper Fi","commenter_a":"There is a scientific basis for being transgender. The brain's gender identity and the genitals develop at different times in utero. So mismatches due to hormones are possible. If God knits these children together in the womb, He must do some transgender knitting. A boy who goes through a phase of wearing a dress is entirely different than a boy who persistently and insistently over a number of years says he is really a girl. Psychologically, it is best for these kids to use modern medicine to enable their outsides to match their insides.","post_message":""},{"comment_id":"10155252907224657","commenter_b":"She needs to stay, Debbie and Hillary are the face of the Democrats.","commenter_a":"Dems should stay away from emails..they really suck at it...","post_message":"BREAKING: Debbie Wasserman Schultz Will Not Preside Over Democratic National Convention Due To Email Leak"}]
