[{"comment_id":"1141758235909203","commenter_b":"Bucket of losers and needy Mexicans. She was right.","commenter_a":"Actually, The founding fathers were rich aristocrats who valued property rights at a premium, so much so that they limited the right to vote to land owners, who at the time were the billionaires of their day. It isn't right that billionaires can buy elections, but that probably would have been the intention of the founding fathers.","post_message":"When the Founding Fathers wrote the Constitution, I’m pretty sure they weren’t thinking “Let’s make sure billionaires can buy elections.”"},{"comment_id":"10154753364685225","commenter_b":"@username be quiet old hag","commenter_a":"This is what happens when you have real leadership in charge of the Country.","post_message":" is historic. The Dow Jones Industrial Average hits 20K for the first time. @webpagelink  #Dow20K"},{"comment_id":"1419706908060869","commenter_b":"What rights do women not have again?","commenter_a":"Suck it up... lol he won and he IS your president. I love liberal whining people it makes it all that more enjoyable to get on here and see them crying.","post_message":"\"You're orange, you're gross, you lost the popular vote,\" a crowd at the Women's March in Washington chanted today.  Millions marched in D.C. and around the world for women's rights and against President Donald J. Trump's inauguration: @webpagelink"},{"comment_id":"10155893910319062","commenter_b":"Nobody gets that the action he repealed would have put the housing industry back where it was a few years ago with foreclosures flooding the market again.","commenter_a":"Wait a sec! You're telling me that a billionaire scumbag that has sent jobs overseas, left commissioned workers unpaid and exploited illegal immigrants ISN'T looking out for the best interest of middle/lower class Americans? Huh. Imagine that.","post_message":"President Donald Trump blocked an Obama administration policy Friday that would have reduced the cost of mortgages for millions of home buyers."},{"comment_id":"848307568693153","commenter_b":"GO stuff your FAT ,UGLY, RACIST face!","commenter_a":"What IF I ONLY HATE \\bOBAMA'S \"WHITE\" Half???","post_message":"If you hate Oprah does that make you a racist..."},{"comment_id":"10155487950195354","commenter_b":"Then will she pay for all her vacations, her clothes, her helpers!","commenter_a":"44.4 Million on vacations alone...She need to pay that back! ..........She's NOT an elected official.........","post_message":"“I want a big paycheck for Michelle.”"},{"comment_id":"929005763900127","commenter_b":"Not as pathetic as your lying Hillary.","commenter_a":"Trump even takes a GOOD idea like term limits at EVERY level of elected governing and ruins it with his hate, ignorance, and by being the WORST candidate for President ever his pathetic nothingness and lack of depth daily shows how weak and what a fraud this TRUMP is. Pathetic. LISTEN LEARN THINK FEEL and VOTE smart.","post_message":"Donald J. Trump has vowed to limit House members to a 6 year term and Senators to 12 as part of his broader plan to \"drain the swamp\" and reduce the amount of influence lobbyists have in Washington.  Read more: @webpagelink"}]
