[{"comment_id":"10153976487996130","commenter_b":"we are living in the country that has no national insurance and crazy people can have a gun. poor sick people will die without government help and crazy people can massacre a lot of people easily and at one time with a gun.","commenter_a":"Kasa","post_message":"Another mass shooting. Another national address by President Obama."},{"comment_id":"940190486114130","commenter_b":"What a fucking shitbag","commenter_a":"Bill Clinton was President and the Commander in Chief during part of my time in the National Guard. I had no respect for him as a man but had I ever encountered him I would have rendered proper military courtesy out of respect for the office of the President. When you put on the uniform you mo longer get to pick and choose.","post_message":"HA! She should've thought twice..."},{"comment_id":"10152813313326523","commenter_b":"Glad everyone shared that video and got this no good nasty tramp bitch arrested!","commenter_a":"Black lives matter","post_message":"“It’s almost like they plan these fights, they want these fights to be on tape where they can put it on social media. This is horrible.”"},{"comment_id":"617790755078170","commenter_b":"She a geto gutter hoe send her back","commenter_a":"I agree with Brooks.And Steven Joseph Sr.God bless that soldier .And thank you for your service","post_message":"Michelle Obama wanted this army staff sergeant to do this, but he refused.  This is amazing. We stand behind this soldier 100%.  Do you support this war hero stand against Michelle?"},{"comment_id":"840275132829730","commenter_b":"It took you people 8 years to realize that,lol He is a Muslim born in Kenya and should have never been aloud to run for President!! PERIOD","commenter_a":"Like it is a suprise Not . Fools at least over half of those that voted . Voted for at the least has sympathy . Sick the same people that killed thousands . Americans voted in one that was raised Muslim . Sad","post_message":"Damning new evidence has arisen regarding Obama. There is no question now that Obama is not who he says he is. Do you agree Obama is a Muslim?"},{"comment_id":"806051249493483","commenter_b":"Republicans....","commenter_a":"What flipping IDIOT would vote for this nut","post_message":"He leads his closest competitor by 11 percentage points."},{"comment_id":"10153372997486051","commenter_b":"It's a shame that she's no longer here and those 3 scum-bags are. Too bad she couldn't have shot all 3!!!!!!!!","commenter_a":"The fearless leaders kids.","post_message":"This 76-year-old woman was confronted by 3 attackers. Rather than giving in to their demands, she reached over, grabbed a gun and decided to take all of them on."}]
