[{"comment_id":"10153151883434087","commenter_b":"@username Go back to bed & sleep it off. M. Kelly is a pain in the ass.","commenter_a":"I no longer watch The Kelly File!","post_message":"\"I liked The Kelly File much better without @megynkelly,\" Donald J. Trump tweeted. \"Perhaps she could take another eleven day unscheduled vacation!\""},{"comment_id":"10152911718959342","commenter_b":"Start lining up Muslims and illegals until they leave!","commenter_a":"Amen and Amen!!!","post_message":"FIRING SQUADS MAKING A COMEBACK? Utah -- the only state in the past 40 years to carry out a death sentence by firing squad -- is poised to bring back the Old West-style executions if the state cannot track down drugs used in lethal injections."},{"comment_id":"1203432829732943","commenter_b":"She'll pardon herself the first day in office","commenter_a":"If Killary gets elected, it may well really become illegal to read anything that could be detrimental about her and her actions.","post_message":"CNN: Remember, it's ILLEGAL to Read WikiLeaks Emails [VIDEO]"},{"comment_id":"546309585494081","commenter_b":"Another scenario: Let's raise minimum wage and keep everyone else's the same. That way their money is worthless and means less, as opposed to this minimal skill havin high school dropout with 6 kids with 4 different fathers/mothers so the price of goods will rise and you'll be in the same poverty stricken boat as you were but now you've lowered the entire middle class in it with you. And people can we get over the race thing? It's very tiresome and down right comical.","commenter_a":"This is complete and utter FAIL. If you work hard and make smart life decisions, you absolutely can succeed. What idiot came up with this B.S.?","post_message":"Seems legit."},{"comment_id":"908896759158872","commenter_b":"Us is what I recorded","commenter_a":"@username let's go to Vegas and stop off here!","post_message":"It one of the strangest motels you will ever visit  the Clown Motel, next to a grave yard in Tonopah, Nevada.  And if you don like clowns, or are afraid of ghosts, you may want to stop somewhere else.  Story: @webpagelink"},{"comment_id":"10154492398684199","commenter_b":"Wolves are not endangered.They kill livestock.","commenter_a":"Holly","post_message":"A federal judge in Tacoma has rejected plans to increase the killing of wolves in Washington state by a federal agency."},{"comment_id":"10153745269073984","commenter_b":"that bitch needs to be in prison, hell yeah she and this country need her to just go away.","commenter_a":"Yes. She is wasting our time!","post_message":"A Fox News correspondent just revealed one surprising thing about this Hillary event that you won't see on TV, and it's definitely an embarrassing moment for the Clinton campaign.  Do you think Hillary Clinton should drop out of the presidential race?"}]
