[{"comment_id":"10153676322456509","commenter_b":"Says the girl with gigantic tits and a gun in one of her photos...","commenter_a":"THUGS","post_message":"Dozens of motorcycle rallies will take place nationwide this weekend amid sky-high tensions after a biker gang shootout left nine people dead in Texas. @webpagelink"},{"comment_id":"924000977633655","commenter_b":"WHY are their women like her???","commenter_a":"Why aren't ALL men like him? God bless him and that sweet, loving little angel","post_message":"His wife said she would leave if he kept their baby -> @webpagelink"},{"comment_id":"10150798110624999","commenter_b":"@username, the Constitution says nothing about corporations having the same rights as The People, either.","commenter_a":"The constitution says nothing about abortion","post_message":"Oklahoma lawmakers have voted to ban virtually all abortions. That's flatly unconstitutional, the Editorial Board writes in The New York Times Opinion Section."},{"comment_id":"1208640665842055","commenter_b":"#NEVER HELLARY CLINTON !","commenter_a":"Be careful. People who cross the Clintons have a strange way of \"committing suicide\" by a few \"self inflicted gunshot wounds\" to the back of their heads.","post_message":"CROOKED HILLARY really SCARED  @webpagelink"},{"comment_id":"10156497004350294","commenter_b":"Looks like we need to start banning vehicles. All of these vehicles just hitting and killing people is unacceptable!","commenter_a":"So sad... prayers for the families","post_message":"The woman and a man were crossing the street when a vehicle hit them. Anyone with more information is asked to step forward:"},{"comment_id":"10156665343745725","commenter_b":"Build the Wall!","commenter_a":"Thank you Donald Trump, I know all of this campaigning is a lot of work and tiresome. I sure hope you can find all of the strength and energy you need to keep up with negative stuff, because I know you are fighting for us the people. And we sure want you to go all the way to the Presidency. There has been no one will to fight for common sense and for the normal and real people of the great country. We all just need a chance to do and be great! Thank you again","post_message":"GOOD MORNING SOUTH CAROLINA! Do not forget to get out and vote today! The poll numbers are outstanding. They mean nothing, if we don't ALL get out to the polls & VOTE! Together, we will MAKE AMERICA SAFE & GREAT AGAIN! Thank you!"},{"comment_id":"10155127516070294","commenter_b":"A**hole","commenter_a":"Blacks,, that's all they know.","post_message":"You may have seen the video circulating online...  Now, because of social media, police say two people have been arrested in the large brawl at Beachwood Place Mall the day after Christmas. More here: @webpagelink"}]
