[{"comment_id":"10153949050391037","commenter_b":"One word: uneducated","commenter_a":"Trump has had my vote from the start to finish ... Nothing anyone says can \" change \" my mind .... We need a business person in the seat to lead not be a tyrant.","post_message":"“During anxious times, it can be tempting to follow the siren call of the angriest voices. We must resist that temptation,\" Nikki Haley said."},{"comment_id":"10153366543351051","commenter_b":"why not Thugs Lives matter ... break the law assult others and what happens ??? Blacks Kill more of themselfs than any other ...... My mother taught me to dress for success not emulate Prison population booty call ...","commenter_a":"Racist idiot","post_message":"Here's why President Obama says many people misunderstand what the #BlackLivesMatter movement is truly about. Do you agree or disagree with the president's message?"},{"comment_id":"10154595808829445","commenter_b":"Pot head moms, guiding their children. What a joke ........","commenter_a":"Craig Roberts Me as a parent.","post_message":"This mom clearly thought it was high time for the kids to go back to school @webpagelink"},{"comment_id":"1007311229351882","commenter_b":"@username more people die every year in DWI accidents than in 10yrs of the war..stop whinning it will be on our soil soon.thank obama for that.","commenter_a":"Good because theyve destroyed the republican party and turned it into a warmongering party filled with neocons. Trumpism will come in to replace them and become a patriotic party for the first time in 40 years. We live in exciting times and I am honored to witness it.","post_message":"\"They are as dead as emperor-worship in Japan.\""},{"comment_id":"1803336319885605","commenter_b":"@username \"She can watch the oath from a cell like she deserves\" Proof or you're a dirty liar.","commenter_a":"I borrowed these words from Daniel Greenfield who wrote them a few months ago in Front Page Magazine: Clinton has spent a third of her adult life trying to become president. are hoping that Hillary will go to jail. But the anger, frustration and bitterness that will gnaw on her after wasting decades and a small fortune on two failed efforts to win the White House in which she had every advantage only to lose before even leaving the starting gate will be worse than any prison. January 2017, Hillary Clinton will be sitting in front of a television set watching someone else take the oath of office. Nothing the penal system has to offer would be a harsher punishment than that moment.","post_message":"Six of the biggest takeaways from the FBI's investigation."},{"comment_id":"1103463889708572","commenter_b":"@username, it's not a C-Section if the spine is snipped. That's not a C-Section, that's partial birth abortion, aka infanticide.","commenter_a":"Hillary has stated that unborn children have no rights and that they can be aborted within hours of birth. Yet, when someone kills a pregnant woman, there are TWO charges of murder. Hmmmm....","post_message":"Trump said the procedure can happen \"as late as one or two or three or four days prior to birth.\" But that is not at all likely, writes NPR's Jennifer Ludden."},{"comment_id":"10155047256148139","commenter_b":"Throw out the injunction & restore the ban","commenter_a":"this idiot can't even talk","post_message":"Listen: Oral arguments taking place regarding President Donald J. Trump's immigration executive order."}]
