[{"comment_id":"1492050597481632","commenter_b":"Then your whole family is \"skewed\".","commenter_a":"That's funny, because all of the vets in my family are voting for Hillary. Is this another skewed poll? I'd love to see where survey monkey dug up the survey subjects. Here's the problem with the poll... Only people who are passionate enough or crazy enough are going to hang on the line to take a survey at this point... I.E. Trump supporters. Most smart people usually just vote and don't waste their time with surveys.","post_message":"But Hillary Clinton is perceived more favorably on the use of nuclear weapons. Here's where things stand."},{"comment_id":"469971939860053","commenter_b":"look its him the bitch","commenter_a":"No way Michelle we have the right. Guns don't look for people to shoot look and see who are the vandals and thieves that are doing the shooting killing their own people","post_message":"Michelle Obama just made a major move on gun confiscation.  This is ridiculous, restrictive gun laws cause HIGHER murder rates.  Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10154453619319030","commenter_b":"@username @username @username Kirsten Kolch Don't call her a bitch, but BUY YO BITCH SOME CHOCOLATE!!!","commenter_a":"Ching Lee Susan Ngo lmao so this is where I heard period sync","post_message":"Key & Peele is gonna teach you dudes something at Menstruation Orientation.  Watch the full episode: @webpagelink"},{"comment_id":"1104019902949566","commenter_b":"If she would screw a muslime she would bang anyone , they are animals","commenter_a":"Why does his 15 minutes of fame feel like 15 years?","post_message":"Apparently angry that his girlfriend cheated with a “dirty Muslim,” Zimmerman posted nude pics and contact info for his now ex-girlfriend."},{"comment_id":"10155043885602908","commenter_b":"Move out of Big Blue high tax, high cost of living Commifornia. Problem solved.","commenter_a":"$7.25/hr equates to about $1250 a month before taxes. After taxes let's say $1000. I live in a studio apartment in CA and it's $885/mo. So $115 remains for 4 weeks of food, utilities, transportation to and from the job? Get real, America. Especially for a family even $15/hr would be a stretch, but it'd be better.","post_message":"It is a national disgrace that millions of full-time workers are living in poverty and millions more are forced to work two or three jobs just to pay their bills. A job must lift workers out of poverty, not keep them in it. The current federal minimum wage of $7.25 an hour is a starvation wage and must be raised to a living wage."},{"comment_id":"10153121276986051","commenter_b":"Tie her tubes. Now. Horrible mother.","commenter_a":"She is a great reason for forced sterilization","post_message":"This mom decided to let her 14-year-old have an alcohol-fueled, destructive party that lasted 3 days. You can probably guess what her neighborhood looks like now."},{"comment_id":"10153404039272293","commenter_b":"@username police kill blacks at a rate disproportionate to their total percentage of the population an assertion supported by The Guardian statistics. Police killed almost five black people per every million black residents of the U.S., compared with about 2 per million for both white and hispanic victims. @webpagelink","commenter_a":"Tamir was a 12 year old boy. TWELVE!!!","post_message":"\"I saw the weapon in his hand coming out of his waistband,\" one officer wrote in his statement. \"The threat to my partner and myself was real and active.\""}]
