[{"comment_id":"10153385776126323","commenter_b":"\"Studied film and literature\"... Bahahaha bitch please...you are obviously no intellectual titan","commenter_a":"Though at least as far as the so-called \"New Atheists\" go Dawkins - along with Daniel Dennett - actually has substance to what he says and knows how to contextualise his arguments (some of the time). Christopher Hitchens sounded like an intellectual but acted like a thug. And Sam Harris is frankly one of the most pathetic and risible writers to garner an otherwise intelligent audience in this century so far. Ego the size of a planet - with a humourless sense of his own importance despite the impotence and unoriginality of his work - without even the charisma of Hitchens or the intellect of Dawkins/Dennett to back it up.","post_message":"“How dare you force your dopey unsubstantiated superstitions on innocent children too young to resist? How DARE you?”  Is Richard Dawkins a hero, a heathen, or a liability?"},{"comment_id":"10155409638445725","commenter_b":"I hope she goes to hell","commenter_a":"Crazy selfish bitch","post_message":"Attorneys for the woman accused of faking cancer and pocketing thousands of dollars in donations from strangers, family and friends for more than a year, spoke alongside the woman today. What they said about the incident and the woman----> @webpagelink"},{"comment_id":"10153383373028984","commenter_b":"Why don't you go back to where you came from Asshole!!!!","commenter_a":"President Obama said the right thing.","post_message":"Israelis are NOT happy about this, and it's easy to see why. Whoever becomes president in 2016 will have a lot of work to do in repairing relations with Israel...  Do you support Benjamin Netanyahu - בנימין נתניהו and Israel despite what Obama does?"},{"comment_id":"10155932451330206","commenter_b":"Don't you think it's time for a woman President!","commenter_a":"Did you catch her phony southern accent from that speech she gave? Just more proof that nothing about her is real.","post_message":"Are you ready to beat Hillary? Join the team that can win in 2016."},{"comment_id":"908658009268823","commenter_b":"@username still smarter than that orangutan! That orange menace!","commenter_a":"Hillary Clinton is a walking oxymoron... Innocent yet Guilty!","post_message":"Hillary Clinton rips into Donald J. Trump for his critique of retired four-star Gen. John Allen, saying it's unpresidential to \"insult and deride our generals.\" @webpagelink"},{"comment_id":"10156228497460725","commenter_b":"Evil woman with lying eyes.","commenter_a":"Socialist controlled media ?","post_message":"Hillary Clinton is on the front page of The New York Times waving to 200 people in New Hampshire. My crowd next door was 5,000 people – no pic!"},{"comment_id":"1251273681614205","commenter_b":"They need to build a wall around Chicago... after all the illegals show up the murder rate will soar even higher","commenter_a":"Because chiraq has so much extra money laying around.","post_message":"Dem Chicago Mayor Rahm Emanuel just created a legal fund for the roughly 150,000 illegal immigrants in Chicago"}]
