[{"comment_id":"1022251871143567","commenter_b":"Trump card xxx you trump is good for God's love you trump","commenter_a":"clinton, liar, e-mails, white water, rose wood , scandals.... what's with webb hubell? is he chelsea's dad??..Vince foster?? tell America the truth...corruption with clinton foundation, schlonged by obama, OWES favors, soros, lobbyists, muslims leaders..her illict affairs with, yoko ono, vince foster etc....covering up billie's affairs..stole thousands from W H..when clintons left...benghazi, terrible lies...she let those heroes die...yeah, poooooor victim.. killary will do, or say... any thing to get elected....","post_message":"Trump Issues A Major Threat To Hillary!"},{"comment_id":"652378504952728","commenter_b":"If I were near and could get it down, I'd burn it!","commenter_a":"take it down and rub bacaon on it and wipe your ass then brun the fucking thig","post_message":"A family in Texas has drawn controversy over this flag...  The ISIS flag should never been hung in America and should be considered a traitorous act.  'LIKE' if this is WRONG!"},{"comment_id":"1023434111010933","commenter_b":"someone can't read the headline in the article lolol","commenter_a":"Stop blaming anti vaccers, we are the ones smart enough not to inject ourself or others with the disease.","post_message":"Way to go, anti-vaxxers."},{"comment_id":"10154093101217452","commenter_b":"OMG. You must be a plant. No one could be that ridiculous.","commenter_a":"We are no longer fighting soviets obama. Russia is a friend in the war against ISIS.","post_message":"\"Ronald Reagan would roll over in his grave.\""},{"comment_id":"10153251876512464","commenter_b":"Would love to see these two little girls in the White House with dad.","commenter_a":"What a special day for the whole family","post_message":"Yesterday, we spent a wonderful Sunday afternoon teaching Caroline how to ride her big-girl bike—without training wheels!  She did awesome; very proud of her."},{"comment_id":"1197816346947147","commenter_b":"She is a nasty offensive woman, and deserves being humiliated.","commenter_a":"I despise what she did to our good men and women in Benghazi and I despise her lying but this is offensive. I am embarrassed for you that you post something as low as this.","post_message":"OMG! The AP Took This Photo Of Hillary And It Proves She's Literally Full Of Crap! She Wants It Destroyed!  OOPSIE! Talk about a sh*ty situation! Let's make this viral!   Spread this everywhere if it made you LOL-"},{"comment_id":"10153778405133854","commenter_b":"Who cares what she told her daughter","commenter_a":"She is above the Law, Richard Nixon looks like a choir boy \" truth has no meany, Anymore\"","post_message":"Hillary Told Daughter Chelsea That Terrorists Were Behind Benghazi Attack The Night It Happened [VIDEO]"}]
