[{"comment_id":"1234562866583168","commenter_b":"Hillary can sell pieces of our country, lie to investigators, channel campaign money, donations and contributions to her \"charity organization\" into her own personal slush fund, and she uses one technique to keep her out of the limelight for very long........she deflects whatever she does to whomever challenges her. Harry Reid is a complete idiot. Obama's constant comments of ridiculing Trump is the same technique. How dare that piece of trash accuse Trump of not being American!!! He is lawless, devious, lying, aids the enemies to be able to be in a position to kill us, takes money and feeds people who are illegal, criminals and he DARES to call Trump Un-American??!! He is seriously sick in the head...he THINKS he is the ideal American. Why do we still have a nut in the oval office? Shame on anyone who listens to this crap....and I can't wait to have both ...","commenter_a":"Just shut up, sounds like squeaky mice got caught, just go away quietly no one will miss you...","post_message":"HEAVEN HELP US  @webpagelink"},{"comment_id":"10153047179116051","commenter_b":"What does being a feminist have to do with anything?","commenter_a":"WHAT an awful person. Take the baby and give it to someone who will love it.","post_message":"Police took one look at this mom's Facebook photos and arrested her immediately."},{"comment_id":"10154904389672235","commenter_b":"First, someone like me will have to tell the old hag to STFU and get out of the lady's face.","commenter_a":"I wonder how long it willl take for it to sink in to the deplorables that this sort of behaviour is intolerable, and they will be held in contempt for it by civilized people?","post_message":"BOOM!"},{"comment_id":"10155089338768984","commenter_b":"AND WHY SHE NOT IN JAIL.","commenter_a":"Seat her in the last row.","post_message":"The Clintons' plan for President-elect Donald Trump's inauguration were just revealed, and it's leaving everyone speechless."},{"comment_id":"10154243110114228","commenter_b":"I would of peed on that mf","commenter_a":"@username is it wrong that I laughed 😅😂😅😂","post_message":"Wait  it gets worse."},{"comment_id":"10154479010956636","commenter_b":"And I've heard real life accounts from people I know who live in Germany. But let me ask you, have you heard what white male Christians are doing in the US? They are the biggest threat at campuses nation wide. Should we not allow them into schools and colleges?","commenter_a":"Big WIN for the people!!! Let the brave Americans welcome doctors, scholars, extended families, and refugees into our Country. I promise we aren't all cowards hiding from the scary muslim doctors. The scary muslim students and those awful muslim grandparents coming for a visit!","post_message":"#BREAKING: A federal appeals court has ruled against President Trump's ban on travelers from 7 countries."},{"comment_id":"10154623463961336","commenter_b":"and she wants us deploables to pay for their free ride 😡🙄","commenter_a":"Hillary wants more illegals and she cannot even speak Spanish!","post_message":"Chris Christie slammed Tim Kaine for comments he made accusing Donald J. Trump of inciting violence at his campaign rallies, on \"Fox News Sunday.\" @webpagelink"}]
