[{"comment_id":"10155373545461162","commenter_b":"Black Women abuse their daughters and worship their sons.","commenter_a":"GM, Giving praise to God, that the baby is home safe","post_message":"HELP FIND THIS GIRL: A 12-year-old girl went missing from the Austin neighborhood on the West Side Wednesday afternoon. Claudia Jackson was last seen about 3:30 p.m. when she left her home in the 400 block of South Laramie after she was reprimanded, police said. Anyone with information is asked to call police at (312) 744-8200. \"SHARE\" to bring Claudia home. @webpagelink"},{"comment_id":"10150935097914999","commenter_b":"no clue what you're talking about?? You're not a woman so sfu!","commenter_a":"No, she's a hypocrite! Have you ever watched an abortion? I have...in 20 weeks it is a baby. In late term abortion labor is induced. The baby's head is delivered. a small incision is inserted into the back of the head the knife is twisted to kill the baby. The brains and skull is crushed.","post_message":"\"Hillary Clinton owned her feminism. She sounded like the first woman running for president, defending other women — our autonomy and our control of our own bodies,\" Emily Bazelon writes in The New York Times Opinion Section."},{"comment_id":"1199514790068549","commenter_b":"\"Tear Down This Wall!!\"","commenter_a":"Reagan might but Eisenhower would not as he was too far left for todays GOP.","post_message":"When you compare self-identified Republicans today to those of 1990, you have to wonder how well Reagan would do in the 2016 race."},{"comment_id":"10154462240499087","commenter_b":"No, former president Bush didn't listen to the Intelligence Community and he didn't wait for their final report: he ordered them to leave to start his war!!","commenter_a":"It seems funny to me that all you Democrats were screaming with President Bush took the intelligence community advice on \"weapons of mass destruction\"! How quickly we change our minds....but now we are to trust the intelligence community?","post_message":"\"Lesson #1: don’t mess with the intelligence community.\""},{"comment_id":"10153738267915575","commenter_b":"Who cares about Christians,the Muslims are under stress .fix it now","commenter_a":"Same rules should apply to all. It's a work place. Screw their constant demands. Suck it up.","post_message":"Sharia Fail"},{"comment_id":"10153311054577293","commenter_b":"Guns multiply violence and death everywhere they are available without careful screening and detailed background checks. Even the sane lose their tempers and can lose control and kill their loved ones in the heat of the moment if a gun is at hand.. Guns place the innocent at risk everywhere from homes and schools to movie theaters and offices. No one NEEDS a gun. Only fools want them.","commenter_a":"This is why we need to ban guns. If a psycho attacks children with a knife they have a fighting chance. If he had been shooting the outcome would have been very different.","post_message":"He had only one thought: “This is not going to happen.”"},{"comment_id":"10153715291715950","commenter_b":"Sorry Sara Sterling you wouldn't know the NRA from a CPA. Guns were here before you and they'll be here long after you. They can pass all the unconstitutional laws they want the gun owners will not comply. If you don't like it well then your free to pack your sh*t and leave there isn't anybody forcing you to stay here. The earth is huge...","commenter_a":"CBS once again reaching with their BS agenda! Why don't you report how gun sales are at a record high? Obama is the best gun salesmen ever. If a government ever tells you to disarm yourself you need to arm yourself!","post_message":"This brother shares the story of his family's tragic trip to a gun range."}]
