[{"comment_id":"1091990537522616","commenter_b":"Fat lady has not even cleared her throat yet.","commenter_a":"Jesus Bernie. You've given up. You're turning into what you've said you despise. All of us fought for you, not so you could buckle up like a belt and endorse Hillary. I refuse to vote for Hillary. You are letting us all down, all because of a back-room conversation where Barack likely asked you to \"fall in line\". I'm concerned, but still very hopeful that you get up on that stage at the DNC, and demand that your followers vote 3rd party!!!!!","post_message":"I want to express my pride in what we have accomplished together over the last year. But so much more must be done to make our vision a reality. Now more than ever our country needs our movement — our political revolution. As you have throughout this historic campaign, I ask for your ongoing support as we continue through the fall and beyond."},{"comment_id":"10154655715146037","commenter_b":"@username many!!! What parents dress their little girls like a sex queen? Um, JonBenet's and other child beauty pageant moms- $$$, attention, fame....","commenter_a":"I am inclined to believe the story to be true. There are just too many claims against Michael not to take them seriously. Not to undermine the victims, but the thing that I really can't grasp my head around is why the parents of all of these children that Michael victimized allowed their kids not only to sleep over at a grown man's home, but also to sleep in bed with that grown man?! This makes no sense to me and the parents of these kids should be held accountable for their actions.","post_message":"When he \"began showing signs of puberty,\" Jackson was allegedly \"no longer as interested in him sexually.\""},{"comment_id":"10155055910404411","commenter_b":"RACISMRACISMRACISM!!!!blahblah blah","commenter_a":"Funny how it's white people who are quick to discredit this as well as add in fake stats. But you're not racist right?","post_message":"D410 Code - 'to alert co-workers that  black person is in the store'"},{"comment_id":"10152698391808717","commenter_b":"She's no Zumba instructor but she's not","commenter_a":"She's a hottie","post_message":"Claremont police say two people face charges after selling cocaine, crack cocaine and heroin in a school zone. @webpagelink"},{"comment_id":"1751080988447451","commenter_b":"FUCKING IDIOT!","commenter_a":"Tyler Steinle","post_message":"You should be VERY careful with things that go BOOM!"},{"comment_id":"923406901068872","commenter_b":"would love to see ben carson and donald trump ban together","commenter_a":"Ben, that is exactly what obama has been doing for the last six years!","post_message":""},{"comment_id":"1061679133872558","commenter_b":" The US has the highest gun ownership rate in the world - an average of 88 per 100 people. That puts it first in the world for gun ownership - and even the number two country, Yemen, has significantly fewer - 54.8 per 100 people But the US does not have the worst firearm murder rate - that prize belongs to Honduras, El Salvador and Jamaica. In fact, the US is number 28, with a rate of 2.97 per 100,000 people Puerto Rico tops the world's table for firearms murders as a percentage of all homicides - 94.8%. It's followed by Sierra Leone in Africa and Saint Kitts and Nevis in the Caribbean","commenter_a":"Stephen king stick to writing shitty movies. You have no clue. How else can you explain to morons that criminals and crazies don't care about gun restrictions. Guns help protect... There are numerous countries that have worse records for mass shootings than us, that have more gun laws than we ever have had.","post_message":"Stephen King, like most reasonable people, is fed up. His message to fellow gun owners is AWESOME!"}]
