[{"comment_id":"957903450911743","commenter_b":"Muslims are still using the jiihad to increase their power and stupid European leaders are letting it happen.","commenter_a":"LanceBell fox loves you","post_message":"Spread this everywhere:"},{"comment_id":"1151519384914815","commenter_b":"Bol bitch deserved it","commenter_a":"Mykel Connors","post_message":"Chick knocks out an old lady on a bus!  #WSHH"},{"comment_id":"606469089512450","commenter_b":"Cus Beyoncé just another weak ass bitch in the guise of some sort of strong independent woman.","commenter_a":"Except she didn't do any of this and stayed with the man that's been cheating on her (and before the beehive goes crazy, I love Beyoncé...but what I said is also very true...) soooo you can't be a strong independent woman who brushes aside the fuck boy...when you're still married to him. Now if she comes out and says that they are still married cause it's business but they sleep in separate rooms and have an open relationship then awesome for them...but it's not empowering women...its perpetuating the stereotype","post_message":"14 Beyoncé \"Lemonade\" Lyrics For When Your Ex Texts You"},{"comment_id":"891291447630577","commenter_b":"Turn the channel from Fox and get educated","commenter_a":"How anyone can back him after everything going on is beyond ignorant!!!! There r reasons he's the worst president ever!!!","post_message":"This one is HILARIOUS.   Thanks to Being Liberal."},{"comment_id":"10154689577603812","commenter_b":"He also has many lawsuits in the 80's and 90's for discrimination against blacks and people of color.","commenter_a":"TRUMP STOOD UP FOR BLACKS AND JEWS: About 20 years ago the rich elites ran Palm Beach and wouldn allow Jews and blacks to use the golf and country club facilities. When he bought Mar-a-lago, MR. TRUMP WENT TO COURT TO END THAT DISCRIMINATION, won in court and forever changed how minorities are treated in Palm Beach. That THE REAL Donald Trump. What has Hillary or ANY politician done? @webpagelink","post_message":"A potentially record-breaking gap between two groups marks one of the most striking elements of preferences in the 2016 presidential race: college-educated white women for Hillary Clinton vs. non-college white men for Donald J. Trump."},{"comment_id":"1256816384396895","commenter_b":"Then those women will one day regret their stupidity!!","commenter_a":"The Clinton's know there in trouble with the common voter. So now they are trying to go woman power... so tragic.... but a lot of women will vote just cause she is a woman...","post_message":"Chelsea Clinton recently tried to stump for her mom on local TV at a rally in Michigan. Later on, she wore a shirt that had a LOT of people talking.  What do you think about what was on Chelsea Clinton's shirt?"},{"comment_id":"1595582267404994","commenter_b":"Where in the work would you ever get an idea like that???? You stupid woman!!!!","commenter_a":"This person is so ate up","post_message":"not too bright..."}]
