[{"comment_id":"347098928826955","commenter_b":"Liars never apologize! They wouldn't know how.","commenter_a":"Not only are they lying but they are racist as well! They hate white people!","post_message":"Lies www.eaglerising.com"},{"comment_id":"10153329997574342","commenter_b":"Thanks, Becky.","commenter_a":"Great picture Reed","post_message":"What a fantastic photo sent in by Reed W.  It's a shot of the sun coming up over the HPD Memorial.  Reed posted it to honor HCSO Deputy #DarrenGoforth.  @webpagelink"},{"comment_id":"1151935354873218","commenter_b":"Nasty hoe","commenter_a":"Some people are seriously fucked up! Mad, evil with a shot of mental illness.","post_message":"Damn  #WSHH"},{"comment_id":"10153819979530950","commenter_b":"Hillary has kept blacks where she thinks they belong. I am sick of her lies! Trump!","commenter_a":"What in the FACK is he talking abt? That an that has embraced white nationalism is calling Hillary a bigot.. Hillary has been to many black churches over the years and has many ppl of color as friends. Trump??? Never mind.. What a buffoon!!! Unfit....","post_message":"“We reject the bigotry of Hillary Clinton, which panders to and talks down to communities of color and sees them only as votes,” Donald J. Trump said."},{"comment_id":"10153058361321770","commenter_b":"She is a loser !","commenter_a":"I'm sorry Hillary just wasn't natural, it was forced. That being said the bill was funny.","post_message":"Hillary Clinton made a “spontaneous” campaign stop with an appearance on Saturday Night Live. She even mocks Donald J. Trump.  @webpagelink"},{"comment_id":"10152602108687061","commenter_b":"And a fat hoe","commenter_a":"Michelle looks more like a hoe everyday","post_message":"Pres. Obama: \"I have no more campaigns to run.\"  (audible clapping in chamber; pause)  Pres. Obama: \"I know, 'cause I won both of 'em.\" #SOTU2015 -- (click for audio) abcn.ws/1JbdOLY"},{"comment_id":"1763050483964389","commenter_b":"@username it's sad that you believe this corrupt liar, she panders to do nothing but destroy American interests. You will have a hard life since you choose to ignore the research that many gave to you on this post. You rather remain blind then actually see the POS that you're defending.","commenter_a":"Here's an idea, everyone who DOESNT like Hillary, don't comment. Go comment on how much you love Donald Trump and how you hate everyone except white people. And how you hate refugees fleeing their countries that are being bombed by USA and how you hate everyone. And if you like Hillary and/or voting for her... Then you comment.","post_message":"Even before his hateful speech this week, Trump has never been vague about his feelings toward immigrants."}]
