[{"comment_id":"1006273402742336","commenter_b":"You kiss your mother with that mouth?","commenter_a":"How funny, lot of idiots on here don't realize that bin laden in the white house tremendously cut funding to nasa a while back.... This is probably giving back what he took...... Lib and Bernie voters aren't expected to","post_message":"That even more than Barack Obama asked for."},{"comment_id":"10153948812912434","commenter_b":"@username you are a AntiWhite and you are for White Genocide that is why you call me a Nazi. ALL White countries and ONLY White countries are being flooded with third-world non-whites, and Whites are forced by law to integrate with them so as to “assimilate,” i.e. intermarry and be blended out of existence. Massive immigration and forced assimilation is genocide when it’s done to Tibetans in Tibet. When it’s done to Whites in White countries, it’s called “diversity.” By UN Convention, it’s genocide: “Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part.” Diversity is a code word for #WhiteGenocide!","commenter_a":"White genocide is real and we can prove it. Learn the truth. @webpagelink","post_message":"The threat of ‘white genocide’ is a conspiracy theory, promoted by elements of the so-called alt-right and fueled by anxiety over fertility and immigration trends, that was popularized by South Carolina segregationist Bob Whitaker. The idea also comes up in the writings of Dylann Roof, who murdered nine black parishioners at a church in Charleston."},{"comment_id":"10154941890619705","commenter_b":"Yeesh and I feel bad for my soy chai latte. I can't drink milk so its soy but I still feel bad about a special order. Not anymore!","commenter_a":"Melissa Lane","post_message":"And you thought your Starbucks order was complicated."},{"comment_id":"785245424951309","commenter_b":"Girl go sit down somewhere","commenter_a":"those that vote for the \"first female\" president will get the same crap that the \"first black\" man president gave us.","post_message":"President Obama is speaking at a \"Get Out The Vote\" rally in Ann Arbor.  Read more about his visit: bit.ly/ObamainAnnArbor"},{"comment_id":"644282239071875","commenter_b":"I wish you ugly frumpy women would shut the hell up. Your blind support of Hillary is going to put Trump in the White House.","commenter_a":"He needs to bow out, pledge his delegates to Hillary and move on.. Hopefully she will have a place for him in mind and he can be of some help in the future. He's led a sterling campaign, but has been on the loosing side for the last few primaries and is bound to loose tomorrow.... YAY Bernie for doing what you did, now solidify the party, tell your supporters to support Hillary and then we can all go forward to enihilating trump and winning the presidency. Your Elizabeth Warren can still BE the VP candidate and together the women can set the world on fire and win... America is ready for this.. Trump must be downed and your support of Hillary will clinch that! PLEASE..","post_message":"Does Bernie Sanders keep fighting through July's Democratic convention? Or does he bow out?"},{"comment_id":"10153858416863271","commenter_b":"Sick woman. I mean the one who posted this comment.","commenter_a":"I've been looking at her Facebook pages(she has two), I'm not justifying her actions and believe it's absolutely disgusting but I'm pretty pretty sure she's special needs. I'm not saying she shouldn't be punished or condoning her behavior but I honestly don't think she knew any better. I'll be willing to go out on a limb and say she was sexually abused. She probably did to him what had been done to her or what was told to do. I can't even imagine what's going on behind those walls.","post_message":"Jessica McCain told investigators that she recorded the sex act on a borrowed cell phone, according to court documents."},{"comment_id":"10153858888594474","commenter_b":"Actually, she needs to go to jail.","commenter_a":"Not soon enough!!!!! We might get Hillary so it will just be like having Obama in the White House.","post_message":"Let the countdown begin. Share if you're ready for the end of the Obama era!"}]
