[{"comment_id":"10155549473141729","commenter_b":"She's a deranged scumbag","commenter_a":"You have to feel for this poor delusional \"woman\". Her whole way of life is disintegrating & she needs to complain as loudly as possible so people actually hear her. Soon her dementia will kick in full blast & she will be confined to a nursing home. I can only hope she doesn't suffer. It's just too bad her legacy will be one of HATE & DIVISION !!!","post_message":"Whadd'ya think?"},{"comment_id":"10154540555266509","commenter_b":"Parental responsibility not blame the gun.","commenter_a":"more guns would have prevented this","post_message":"\"He shot straight through. \" The Florida pro-gun activist was accidentally shot by her 4-year-old son, authorities say."},{"comment_id":"1106022556087458","commenter_b":"Her agenda with democrat socialist is to end all jobs in America. Prove to Me they intend to increase opportunities . Jobless rate only lowering past few years due to millions that left and no longer participating in work force .. They want more of that trend for sure.","commenter_a":"This is the only truth she has told.","post_message":"Clinton promises to put people out of work."},{"comment_id":"361328087404039","commenter_b":"She is worse than Holder . America keeps going down hill and it will get worse .","commenter_a":"Disgrace to America","post_message":"Squishy and Weak Senate Republicans Lead the Way in Confirming Loretta Lynch as Attorney General  Real Conservatives Outraged"},{"comment_id":"10156205227255354","commenter_b":"ALL yes ALL of them...with the illegals! !!!!!!","commenter_a":"I would support someone who wants to deport all Muslims.","post_message":"Guess what percentage said they would..."},{"comment_id":"10152988460430090","commenter_b":"Don't believe this stuuuupiiidd libtard propaganda!!!!!!! 64% of AMERICANS want the PIPELINE built l!!!!!!!!!!!!!! It will create 40000 jobs!!!!!!!!!","commenter_a":"So what that the Keystone has passed the Senate! That makes this oil no less dangerous to the American people! He has every right to veto something that only benefits 2 people, and of course those who were paid, Republicans and Democrats alike. Some \" American people\" you are! Traitors to your own land! My guess is that none of you have read about the countless oil spills going on at this moment in America and Canada. With the Keystone XXL, you get only larger amounts of oil in our ecosystems. Yellowstone already has at least 50,00 gallons of oil in it!","post_message":"The House, the Senate and the American people have spoken.  Tell Obama: DO NOT VETO: @webpagelink"},{"comment_id":"10154478839956636","commenter_b":"@username without god, noone can hear you get shot. Your worldview is wuite hopeless. Without god, who will punish evil ppl then evil has won. Rofl","commenter_a":"They found the remains of velociraptor Jesus used to ride on.","post_message":"Incredible"}]
