[{"comment_id":"1374953252516136","commenter_b":"OH my goodness....Awesomem display of fireworks...:'(","commenter_a":"Happy New Year to all family and friends in London ❤❤❤❤","post_message":"We at the London Eye to welcome in the New Year."},{"comment_id":"10155015262498690","commenter_b":"Yes why give the terrorists hope? As soon as Obomber gets out, terrorist support will weaken dramatically.","commenter_a":"If 9/11 deserves a moment of silence, than The #Syrians & #Palestinians deserve that we never speak again...","post_message":"Does Assad have enough manpower and weapons to protect the territory his forces have retaken while at the same time trying to win back more areas?"},{"comment_id":"1046419898744877","commenter_b":"What a total moron !!! This woman really was an Amb. at one time ,what an asshol. she is !!!","commenter_a":"They already did you cow!!!!!!!","post_message":"Former Secretary of State Madeleine Albright says that \"nobody is going to die as a result of\" Hillary Clinton's emails."},{"comment_id":"10153141451562894","commenter_b":"She a dub","commenter_a":"@username 😕","post_message":"Kylie Jenner literally just went from 100 to 0"},{"comment_id":"10154258845019087","commenter_b":"Crooked Hillary, Star Trek, and a wussy looking dog......that fits you. #dbap","commenter_a":"Too many fail to realize that had the shoe been on the other foot, DT and his supporters would be screaming to high heaven about the system being rigged - so stuff it.","post_message":"A petition calling on the Electoral College voters to cast their ballot for Hillary Clinton instead of Trump has amassed over 600,000 signatures in less than a day."},{"comment_id":"374997102688584","commenter_b":"she broke the law driving illegal you an i would be locked up so give her 30 days an feed her the same as they feed everybody else might make her see the light or get the hell out","commenter_a":"Tuff shit!! Take it off!","post_message":"Should head scarfs be banned in America?"},{"comment_id":"1701440090108890","commenter_b":"They jeer at Cruz. Call him \"politician.\" What they surely remember is the way Cruz sucked up to Trump in the early part of the campaign. \"Lyin' Ted\" sticks because Cruz seems two-faced.","commenter_a":"All Cruz did was bash Trump. What a looser.","post_message":"\"He's gonna put a liberal on the Supreme Court. He's going to take away your Second Amendment rights. This man is lying to you and he's taking advantage of you.\" -- Ted Cruz to Donald J. Trump supporters in Indiana today"}]
