[{"comment_id":"1077284305661431","commenter_b":"Hillary for POTUS! Hillary 2016! THE MOST QUALIFIED CANDIDATE! #imwithher","commenter_a":"You will never be our president, and I cannot wait to see what you do when the FBI files against you! I think your failing political career is dead!","post_message":"“To me, that’s the best of America and it keeps me going. That sense we are all in this together. We all have vital contributions to make. And that when come together, all of us, with a sense of shared purpose and shared humanity, we can solve any problem we face. We can heal any divide. We can build a future that is far, far better than our past.” –Hillary during her speech on breaking down barriers in the African American community"},{"comment_id":"10154377596014411","commenter_b":"Does anyone realize what is happening? History is repeating itself and no one is taking notice. The Middle East is on fire. Obama and Hillary started this with Libya, they had no business getting involved. Now we have a flood of Muslims who hate American and our culture. They do not want to be equal, they want to dominate and change America and the West to a Muslim country. This is a fact, Turkish President is building mosques all over the West and no one is paying attention. In Turkey they are burning down churches, killing and raping Christians. It's a genocide but Obama only brings in Muslims no Christians. Americans are being told, to take down crosses, take pork from American public schools, allow Muslims to have pray time in public schools, Our children are learning Islam is the faith to be. WAKE UP PEOPLE. They are moving in ...","commenter_a":"I dont think people are comprehending how much people are actually crossing over in europe. its not like in north america. Canada for example scrapes the cream of the crop at 10,000 vs half a million in germany alone. So its full of feel good stories. Whats left stays in europe and the people keep coming and summer has just started. We're talking about a city moving into the EU completely needing of support. At the rate of growth. They'll have a small country entering the EU (mostly unscreened). Europes economy is already weak. Germany has a strong economy, but they're carrying the bulk of the weight. Swedens already cracking under the weight of just one year. Not to mention the culture shock of a sudden mix of two completely different cultures. Hes not saying turn them away. Obviously care for them. But you cant have this number of them ...","post_message":"Dali Lama to Germany: You're doing it wrong"},{"comment_id":"1047246341998727","commenter_b":"Illegals should have NO rights in voting, wokring or anything here....PERIOD.","commenter_a":"You gotta get all the brainless and illegals to stop voting democrats, its the democrats that arm criminals but prevent legal law abiding people to legaly arm themselves","post_message":"Hillary and Bernie want taxpayers to cover healthcare for illegal aliens. What do you think?"},{"comment_id":"10154575005093645","commenter_b":"Beyonc sucks..adele is 10 times the singer","commenter_a":"It's crazy because BEYONC deserved that award. Everyone knows it.","post_message":"She beat Beyonce in the top three categories with her comeback album , and repeated her accomplishments from 2012, when the British star also won album, song and record of the year at the Grammys.  She used her speech to honor Beyonce and her groundbreaking  album, which was also nominated."},{"comment_id":"2066498740242294","commenter_b":"Keep appeasing the beast that wants to devour you.","commenter_a":"i am a Roman Catholic and am continually amazed at what this pope utters. God forbid the Vatican is ever targeted.","post_message":"The pope claimed every religion has its \"little group of fundamentalists.\""},{"comment_id":"885760648126024","commenter_b":"Such a wonderful hero to me. He's human, makes mistakes and humbly admits it. That takes a real man. Thank you, \" W\".","commenter_a":"he is a moran.","post_message":"So funny, and 100% class..."},{"comment_id":"1072635379446872","commenter_b":"That is one sick bitch to say such a thing","commenter_a":"SHOVE A RAT UP THE NIGGAS CUNT AND COCKROACHERS UP HER ARSE, NOW RAP A SONG ABOUT THAT YAH FUKIN GOLLIWOG.","post_message":"Azealia Banks tweeted Monday that former Alaska governor and 2012 Republican vice presidential nominee Sarah Palin should be “gang-raped by black men.”"}]
