[{"comment_id":"10153321006269087","commenter_b":"What fucking jobs are the illegal immigrants are taking dum ass?? Please fucking tell me!!!","commenter_a":"94 million Americans are not working. Is it because they have become dependent upon the government? Or is it because the Illegal immigrants have all the jobs? 30 percent of all federal prisoners are illegal immigrants. Immigrants are killing Americans: According to the Center for Immigration Studies, 57 percent of the 76 fugitive murderers wanted by the FBI in 2009 immigrants entering the country illegally have a criminal record in the U.S.: In 2010, the Border Patrol reported that 212,000 illegals were caught in the Tucson, Ariz., sector alone, and as many as 30 percent of them already had a criminal record in the U.S. The Pew Research Center estimated that there are nearly 12 million illegal aliens in the nation and the key word is \"estimated\". What's wrong with deportation of illegals? The answer is: nothing. The country would be greater without them.","post_message":"\"The idea of tracking down and deporting 11 million people is absurd, inhumane, and un-American,\" Hillary Clinton tweeted. \"No, Trump.\""},{"comment_id":"10154237542506162","commenter_b":"Years wasted but enjoy that compensation my man","commenter_a":"I'm so sorry you lost all those years","post_message":"WRONGFULLY CONVICTED: A former U.S. sailor who has spent 33 years in prison will be released as early as today after new DNA evidence showed he was wrongfully convicted of murder and rape... @webpagelink"},{"comment_id":"10153578637147235","commenter_b":"How much you wanna bet that this nut case is a conservative?","commenter_a":"1st class white privilege on display. We'll get you and your little dog, too!","post_message":"This is insane!"},{"comment_id":"859150960886345","commenter_b":"You weren't forced to come either bitch!","commenter_a":"It kills me that someone who is not even from America can say such racist crap @username. Just remember or learn about the history of slavery and the continued discrimination today from immigrants like you who wasn't forced on a boat to come here. It's because of African Americans you have the freedoms you have today. Please don't comment on something you know nothing about and actually learn about the injustices African American people are facing today. You sound just like these ignorant people who always got something to say behind closed doors. I guess you wouldn't know about white supremacy because you've bought in to this bs white people have taught you in America. I guess all the killings by white police is something new. You have no idea what it's like to be black and to get even immigrants being racist towards you the same immigrants Martin Luther ...","post_message":"The Debt Collection Industry Is the Epitome of Systematic Racism"},{"comment_id":"10153728692094117","commenter_b":"Lol pussy","commenter_a":"Reason can go fuck itself. If you are a pro-Trump libertarian, like my page.","post_message":"\"You know−the Constitution−there's nothing like it. But it doesn't necessarily give us the right to commit suicide, as a country, OK?\""},{"comment_id":"10152939626746636","commenter_b":"Would you please get that hamster out of there by you're in?","commenter_a":"Gonzalo Jara is disgusting and may be homosexual. He should be banned for life!","post_message":""},{"comment_id":"10153792774496162","commenter_b":"Anna Silva","commenter_a":"Lisa DeRosa Raphael","post_message":"Lucky Charms has finally created a marshmallow-only version of its cereal: @webpagelink"}]
