[{"comment_id":"1115619658459044","commenter_b":"Yep. We're all whiney bitches to the gov and they'll find any means of manipulation and control. Welcome to the machine as we're all it's little bitch.","commenter_a":"You all are just a bunch of whining bitches!!","post_message":"Go California!"},{"comment_id":"10152821365179091","commenter_b":"PERFECT, never let her out!!!","commenter_a":"Lock her up in the crazy house and throw the key away","post_message":"\"If she is desperate, she may do the unmentionable and harm the mother and take the baby.\"  An eerie Facebook post about Dynel Lane seems to have predicted that she would act violently toward an expectant mother. Lane was arrested Thursday after police say she cut a baby out of a pregnant stranger womb.  Read the whole Facebook post --> @webpagelink"},{"comment_id":"1558544671099313","commenter_b":"Go to hell","commenter_a":"He is such a joke ! I wish he would go back to where he came he's not even an AMERICAN !!!!!","post_message":"This makes my blood boil!"},{"comment_id":"875360339257302","commenter_b":"God did not allow it but there is also an evil force in this world called Satan. Satan was at work in the guy trying to take the child but God was working when he was stopped. Give evil the name that it has and that is Satan.","commenter_a":"All the comments are giving credit to the determination and strength of the mother and the officer for being on site at the right time. Why is it so difficult for everyone to see it is the hand of God that gave the mother strength and put the officer exactly where he needed to be. We are not victims we are conquerors. We can do all things through Christ Jesus.","post_message":"Video captured a Florida mother wrestling her own daughter from the arms of a would-be kidnapper inside a store. The suspect ran out of the store but was quickly stopped by an off-duty police officer at gunpoint. @webpagelink"},{"comment_id":"10153037067141636","commenter_b":"Gays must be slaughtered like pigs","commenter_a":"The most easiest and simplest HIV aid prevention, is don't commit gay, rather is an animals behave. Don't forget you're human kind.","post_message":"The drug successfully reduced the risk of HIV infection by 86 per cent"},{"comment_id":"10153173280761491","commenter_b":"LMAO this is a joke!!!! Yea right, sure. And the first lady, Kim Kardash can show the sex tape she made in 2003 for company to the White House. This is what gave her fame and made her millions, Something she sure can be proud of and maybe even have her pres hubby pass a law that it be played in all public schools. LMAO","commenter_a":"Bernie Sanders","post_message":"It's still unclear if he's serious."},{"comment_id":"10153209825548445","commenter_b":"Not if you make the tincture right","commenter_a":"Don't make edibles at all. If you want an edible high, just buy/make tincture and eat it with cookies. Or just eat the weed in fillable capsules: 1. Decarboxylate your Dry herb 2. Fill swallable capsules with dry herb 3. swallow capsules with food and drink","post_message":"10 Commandments of #Marijuana Edible Safety"}]
