[{"comment_id":"1850656938526347","commenter_b":"Good put her away . Let her spend her millions on appeals .","commenter_a":"They should!!!!!","post_message":"My, my, my..."},{"comment_id":"729424187224050","commenter_b":"@username , The Refugees and Illegals are Already receiving benefits. THEY ALL have more benefits and Rights than the average American Citizen does!!!","commenter_a":"You want your kids seat taken at school? You want grants and scholarships used and sucked up dry by illegals and refugees? There are terminally ill, Vets, single mother and fathers and maybe you someday may need those welfare and social security benefits..but its not going to be there because of illegals, refugees, mouches and leeches will suck it all up dry...VOTE #TRUMPPENCE","post_message":"The apple doesn't fall too far from the tree..."},{"comment_id":"10155433619800500","commenter_b":"The article says nothing about the use of donor eggs, just that she sought fertility treatments.","commenter_a":"High risk of having babies w/birth defects !!!!!","post_message":"TOO OLD or OKAY? This woman is 65 years-old and pregnant with quadruplets. @webpagelink"},{"comment_id":"10154479010956636","commenter_b":"And I've heard real life accounts from people I know who live in Germany. But let me ask you, have you heard what white male Christians are doing in the US? They are the biggest threat at campuses nation wide. Should we not allow them into schools and colleges?","commenter_a":"Big WIN for the people!!! Let the brave Americans welcome doctors, scholars, extended families, and refugees into our Country. I promise we aren't all cowards hiding from the scary muslim doctors. The scary muslim students and those awful muslim grandparents coming for a visit!","post_message":"#BREAKING: A federal appeals court has ruled against President Trump's ban on travelers from 7 countries."},{"comment_id":"1354018291282776","commenter_b":"Lol a bitch","commenter_a":"Colin, the multi millionaire football player only started feeling oppressed after he began dating a devout Muslim. He now hates everything American, but still takes advantage of everything American!","post_message":"If they thought their fans would blindly go along with any insult to their country, they were sorely mistaken..."},{"comment_id":"10153470149826234","commenter_b":"By a lot !!","commenter_a":"Amy check out HR. Looks like you got low balled","post_message":"Nice work, if you can get it."},{"comment_id":"10154020579286051","commenter_b":"Old dumb bitch","commenter_a":"This is a GOP lying bash Hillary bunch of bitches","post_message":"Describe Hillary Clinton in one word."}]
