[{"comment_id":"10150716535004999","commenter_b":"I forgot to add that Polish women are among the most beautiful ladies in the world.","commenter_a":"As an alternative to the Polin museum (which is excellent) I would recommend the Warsaw Uprising Museum, which also opened in the last few years. It is a very well designed and engaging museum that brings to life this difficult piece of World War II history.","post_message":"Warsaw is finally growing into its aspirations as Eastern Europe’s culture capital. Here's what to do if you're ever there."},{"comment_id":"10154371429036491","commenter_b":"@username good luck having sex. I dont mind your sex life... duh","commenter_a":"The best birth control method is abstinence and celibacy.","post_message":"A leading medical group recommended IUDs as the best form of birth control for teenage girls today."},{"comment_id":"1219006891496424","commenter_b":"They do not have a right to do so ILLEGALLY! God's Word says to obey the LAWS!!!! Read your Bible pope.","commenter_a":"In Syria , not here!","post_message":"Pope Francis said each refugee \"has a name, a face and a story, as well as an inalienable right to live in peace and to aspire to a better future\" for their children."},{"comment_id":"1078709322150078","commenter_b":"we r so screwed if cancer is cured... prepare for the brand new disease! xD","commenter_a":"Gus Fielding","post_message":"A small trial for a cancer vaccine has been successful."},{"comment_id":"10158695661875206","commenter_b":"Check this out i mean Inc.org","commenter_a":"Humans have souls and can live etrnally and that is according to what is written in the holly scripture \"the bible.\" God forwarned us that earth will be burned during the secon d coming of jesus ... judgement day.. The bad ones will be burned and gids chosen people will be saved and have second life eternally","post_message":"If there really are multiple, interacting universes, then it would be possible for time travellers to visit Earth, and every imaginable scenario would be played out in a parallel universe at some point."},{"comment_id":"10152731282606051","commenter_b":"She is one sick bitch.","commenter_a":"She takes care of a disaled child and sick husband , I would worry aout what she would do to them as well. The punishment is far to lienient.","post_message":"This lady arranged to have a woman raped after she outbid her for a home. Some say her punishment should’ve been more severe. Decide for yourselves if that’s true."},{"comment_id":"976154972433526","commenter_b":"thats cause they want illegals to vote","commenter_a":"Buying votes","post_message":"Really?!"}]
