[{"comment_id":"901969823182419","commenter_b":"Girls like my weiner better.","commenter_a":"Nassssty fat pill..... puke","post_message":"A hot dog on a donut packed with bacon and jam... Here's where you can get it: @webpagelink"},{"comment_id":"10153637330793271","commenter_b":"Good, throw them both in jail and throw the key away!","commenter_a":"I am happy to hear this. I pray that it will bring even a little comfort to the family and friends who are grieving.","post_message":"#BREAKING: Ignacio Paul Daigle, the second suspected car thief involved in a crash that killed a young Thornton mother, has been arrested.  Good job, Westminster PD!"},{"comment_id":"10152797115634117","commenter_b":"Matthew, most of you gun totters don't have the balls to pull the trigger. But if you need a gun to make you feel like a man, knock yourself out. Guns are there for men who's wives wont let them have a penis truck. Have a nice day.","commenter_a":"And the evil liberal Democrats want to take our guns away because the police are here to protect you.","post_message":"U.S. marshal's effort to censor a citizen's recording was foiled by yet another citizen recording in this small town that collects millions in asset forfeiture revenue."},{"comment_id":"10154406846618734","commenter_b":"Really lady get over yourself. All you want is Money!!","commenter_a":"This is where feminism has brought womyn: seeing themselves victimhood is the highest calling of all.","post_message":"Do you think the claim is too much? Or just right?"},{"comment_id":"1323559051002906","commenter_b":"YOU CAN'T TAKE OUR RELIGION AWAY FROM US.","commenter_a":"Keep it. Just don't use it when class is in session.","post_message":"Teacher Demands Christian Boy Surrender His Bible, He Says No, See What Happens Next Good for him. Let's show this young Christian our support. Can we get 30,000 'LIKES' for his refusal to surrender his bible?"},{"comment_id":"10153103857862377","commenter_b":"I think a woman who has been victimized should be allowed to regain control of her life. She should not be required to Continue a pregnancy she doesn't want","commenter_a":"But what about the women in those cases! Shouldn't they be in control of their bodies after being violated so inhumanly? Of course they should! I just lost lots of respect for you! You can't make judgements on those women or decisions for them! Someone has to stand up for them!","post_message":"\"Rape and incest, I would not be in favor of killing a baby because the baby came about in that way. And all you have to do is go and look up the many stories of people who have led very useful lives who were the result of rape or incest,\" Carson said."},{"comment_id":"10154748214069486","commenter_b":"Fools all of them grrrrd","commenter_a":"WRONG!!!!...ARREST THE CLINTONS NOW!!!!...THEY WILL NEVER STOP ALL THEIR CORRUPTION UNTIL THEY ARE ALL BEHINDS BARS!!!!!!!","post_message":"Is this throwing in the towel?"}]
