[{"comment_id":"10153618306573352","commenter_b":"Please baby I have money I'm rich bitch!","commenter_a":"Well By his looks he is already seriously injured lol","post_message":"Tracy Morgan settles with Wal-Mart after store's truck hit his tour bus, killing his friend and leaving him seriously injured"},{"comment_id":"10153003347966051","commenter_b":"Hopes the woman yelling see's this video and see's what a ignorant, trashy fool she looks and sounds like!","commenter_a":"Fire her as ASAP","post_message":"This girl was trying to pay for her coffee when all of a sudden the Starbucks employee just snapped."},{"comment_id":"10153586502256336","commenter_b":"It's about time somebody is sticking up for the ppl that are born here & paid taxes, the illegals come here & get all the benefits we can't have, plus they're here to vote so they can get all the free stuff","commenter_a":"I believe that Mr. Trump will do better for the American people. And bringing back our Jobs.","post_message":"\"Our elected leaders in Congress and The White House have chosen to stand down as the sovereignty of our great nation has been violated,\" Todd Starnes wrote."},{"comment_id":"10153154056999087","commenter_b":"I dont believe Obama is favorable in other countries eyes as i have seen some of what other countries say about him bowing to the arab king,,while not saluting our countries flag that many died for.. as far as the immigrant worker.. maybe in yester year they took menial jobs but now i know plenty that take 20,00 hr jobs from americans who are willing to do it...just by being here being here illegally oh and should i mention the illegals get paid cash so most collect welfare and food assistance along with housing , wic and health benefits the whole time....im tired of seeing my fellow americans collect welfare and food assistance cos they cant find a job to support their families.. Being illegal is breaking the law..if they cant follow our law to stay out unless processed properly and not enter illegally do you really believe they will ...","commenter_a":"Donald Trump is on his way to offending every nation, we deal with.... want to really watch us lose our standing in the world? Elect this dufus.","post_message":"\"Negotiating with Japan, negotiating with China, when these people walk into the room, they don't say, 'Oh hello, how's the weather, so beautiful outside, isn't it lovely? How are the Yankees doing? Oh they are doing wonderful, great,' \" Donald J. Trump said. \"They say, 'We want deal.' \""},{"comment_id":"511120385679668","commenter_b":"Our government pushes meth, heroin and every other drug, but its OK because they say it is?","commenter_a":"Let's not forget that a large portion of the prison population in the U.S. has been incarcerated because of nonviolent drug charges.","post_message":"Listen here: @webpagelink"},{"comment_id":"10153455356180779","commenter_b":"@username Yes, she is, without a doubt!","commenter_a":"Dude is garbage. Talented but garbage. LOL trying to spark a feud with Taylor swift, makes a song about gold diggers then marries one...","post_message":"Nearly two months after 'The Life of Pablo' debuted at Madison Square Garden – followed by a Tidal stream-only release, a declaration that the album would never be on Apple Music, then the eventual dispersion of 'The Life of Pablo' to Apple Music and other streaming services – Kanye West's latest LP has finally found its way to the top of the Billboard 200."},{"comment_id":"10153340551136336","commenter_b":"I don't believed this syory","commenter_a":"If this is true, Airlines are about as out of control as the cops and tsa themselves are.","post_message":"“You wouldn’t want to watch your family member crawl onto a plane, I mean come on, this is America.”  Theresa Purcell said the American Airlines gate agent made her crawl because it was too late to set up a ramp for her to board."}]
