[{"comment_id":"10154177421583734","commenter_b":"OK, toss in Jesus too, and all the Angles, and it still won't get him the Seat.","commenter_a":"He could have God running with him . He still has no shot at winning","post_message":"Do you think Fiorina was a good choice for Cruz?"},{"comment_id":"10152797676794753","commenter_b":"Typical female.","commenter_a":"He replies.. \" sorry Hun I forgot u said light toast not dark. My bad not happen again\" lol","post_message":"A solider at Fort Bragg in Fayetteville, North Carolina, tried to bring his wife a surprise breakfast in bed Friday morning, but things went terribly wrong."},{"comment_id":"10153065871694138","commenter_b":"It was just an upgrade to walking 5 miles each day for water...","commenter_a":"He could have bought a car, he chose not to.","post_message":"He kept a perfect attendance record walking 21 miles to work every day for 10 years."},{"comment_id":"985288268192005","commenter_b":"she looks like the Queen of Qualudes.","commenter_a":"Or if she is in jail","post_message":"The Democrat Party WILL NOT let Bernie Sanders be the nominee – no matter how many States he wins, how many delegates he has or an other reason.   Watch this and tell me if you agree:"},{"comment_id":"347098928826955","commenter_b":"Liars never apologize! They wouldn't know how.","commenter_a":"Not only are they lying but they are racist as well! They hate white people!","post_message":"Lies www.eaglerising.com"},{"comment_id":"1018381961551666","commenter_b":"Monthly periids dont count woman. Come up with another strategy","commenter_a":"Yeah.... you've got such a stellar record from Benghazi, who wouldn't want to go into battle at your direction?","post_message":"We can defeat global terrorism—but only if we don’t let fear drive our response."},{"comment_id":"1568371310121541","commenter_b":"Cut their balls off and make them eat them.","commenter_a":"Hang them","post_message":"Group Of Muslim Migrants That Gang Raped 16 Year Old White Girl Get Devastating News  They deserve much worse than this.  What do you their punishment should be?"}]
