[{"comment_id":"1854247478194959","commenter_b":"Why you do this to me","commenter_a":"@username try not to cry","post_message":"Walnut the whippet was not alone on his final walk 🐶😢 #walkwithwalnut (via BBC England)"},{"comment_id":"10152849864834342","commenter_b":"Woman can be evil also.","commenter_a":"Sad.","post_message":"Rebekah Holly Speer, 36, is charged with cruelty to animals after authorities say they found several dead dogs -- at least one shot and stabbed -- at a home in the 3500 block of Deep Anchor Way"},{"comment_id":"966104673465761","commenter_b":"Islam. Definitely will Dominate. ....... Hell of Course","commenter_a":"So America here is the hope and change policy everyone voted for. And the new world order. Question. When are we as voting and tax paying Americans going to say enough is enough. These punks can speak bad about God and Jesus. But God forbid if you speak bad about a child molesting prophet like mohmed. Or that false god like allah. Islam is a belief base and history and likes. We all know that Mohamed made promise to entice the people to fight lIke animals by promising them virgins. Where in the middle east are you going to find a virgin. All the goats are taken. Our courts need to grow a spine.","post_message":"Is Obama Trying to Establish Islam as our State Religion?"},{"comment_id":"10152570556535496","commenter_b":"Oh that's right. IT'S ALL ABOUT THE MONEY!","commenter_a":"Some of you should mind your own business and stop throwing judgement at how others live their life.","post_message":"Accumulating reports are suggesting Bruce Jenner is transitioning to female and plans to document the change for a TV docu-series later this year.  See more: @webpagelink"},{"comment_id":"725495814307663","commenter_b":"Hillary is a virus!","commenter_a":"That's Tillery when we're not really being serious about lives of American citizens. She's a disgrace to represent any American. Trump 2016!","post_message":"Trump Just Leaked A Video Of Hillary Clinton That Could End Her Campaign [VIDEO]  She is panicking. See this video before it gets scrubbed from the internet.  Do you think Hillary has no place in our White House?"},{"comment_id":"10154358010096037","commenter_b":"why would u put this animals pic on here??u people r the problem,neither his name nor his pic should be glorified","commenter_a":"Coward, plain and simple. Bury him in a casket of gay smut and pork.","post_message":"Omar Mateen, identified as the Orlando gunman, pledged his support for ISIS in 911 calls made amid his attack, according to the FBI. @webpagelink"},{"comment_id":"1512943285667077","commenter_b":"While ur asses get your alcoholic drinks!","commenter_a":"@username hahaha","post_message":"\"Is there free food?\""}]
