[{"comment_id":"10154377596014411","commenter_b":"Does anyone realize what is happening? History is repeating itself and no one is taking notice. The Middle East is on fire. Obama and Hillary started this with Libya, they had no business getting involved. Now we have a flood of Muslims who hate American and our culture. They do not want to be equal, they want to dominate and change America and the West to a Muslim country. This is a fact, Turkish President is building mosques all over the West and no one is paying attention. In Turkey they are burning down churches, killing and raping Christians. It's a genocide but Obama only brings in Muslims no Christians. Americans are being told, to take down crosses, take pork from American public schools, allow Muslims to have pray time in public schools, Our children are learning Islam is the faith to be. WAKE UP PEOPLE. They are moving in ...","commenter_a":"I dont think people are comprehending how much people are actually crossing over in europe. its not like in north america. Canada for example scrapes the cream of the crop at 10,000 vs half a million in germany alone. So its full of feel good stories. Whats left stays in europe and the people keep coming and summer has just started. We're talking about a city moving into the EU completely needing of support. At the rate of growth. They'll have a small country entering the EU (mostly unscreened). Europes economy is already weak. Germany has a strong economy, but they're carrying the bulk of the weight. Swedens already cracking under the weight of just one year. Not to mention the culture shock of a sudden mix of two completely different cultures. Hes not saying turn them away. Obviously care for them. But you cant have this number of them ...","post_message":"Dali Lama to Germany: You're doing it wrong"},{"comment_id":"10154223180398984","commenter_b":"Go get a life lady","commenter_a":"Sounds like Trump paying someone else to do his DIRTY work. Why not talk about all the mistresses of Trump. It must be the big bucks from Trump.","post_message":"Wow, I didn't expect Anonymous to be the next one to come after Ted Cruz, and the hackers are claiming something BIG..."},{"comment_id":"10152947380749099","commenter_b":"Yes, because women never get pregnant on birth control....","commenter_a":"If women would practice birth control then these horrible things wouldn't happen. Bless their little souls. May God have them in his embrace.","post_message":"A man found two dead fetuses wrapped in a blanket on the street @webpagelink"},{"comment_id":"914685108573277","commenter_b":"Speaking of the specter of 72 virgins...I wonder if the aforementioned knuckleheads ever consider whether those promised virgins are male or female?","commenter_a":"Take off and landing from a carrier is inherently very dangerous. Glad the rescue folks did their job successfully as trained. Go Navy!","post_message":"The US Navy says one of its fighter jets has crashed shortly after launching from an aircraft carrier in the Persian Gulf."},{"comment_id":"10155491748590354","commenter_b":"Karma catching up with this Idiot, good !!!!!!!!!!!!!!","commenter_a":"she must be taking lessons from sharpton","post_message":"Pro tip: when bashing others to pay their \"fair share\" in taxes, it might be wise to do so yourself."},{"comment_id":"10154985023891192","commenter_b":"Because life on Earth is the only life we can observe and study, so it makes sense to look for other life within the scope of life as we know it. How could we even begin to look for other forms of life if we don't have a clue what to look for?","commenter_a":"I really don't understand the definition of \"alien life\" and why scientists think the environment needs to be remotely similar to ours to support \"life\". HUMANS need the right temperature and water.... \"aliens\" may not....??!","post_message":"BREAKING"},{"comment_id":"10157731504125354","commenter_b":"why are our prisons full of illegal aliens who have broken the law? why don't we deport them? why? why? why?","commenter_a":"She should be held personally liable.... but she won't.","post_message":"So many acts of love..."}]
