[{"comment_id":"1053358344760417","commenter_b":"shut our borders to any and all refugees ! whats wrong with you ?","commenter_a":"I'm seeing some really terrified Americans making terrible accusations about Syrian refugees .. people who are fleeing from terrorism themselves. I'm finding your people somewhat heartless and they sound from my perspective to be violent and racist themselves... No different in fact than the terrorists that have become their perpetrators. This is what fear does to people.. Aggressive behaviour .. We are so much more than this. I felt so sad when I read the response to Obamas humanitarian speech. So sad that you people have such fear and hatred inside you. This attitude of hatred and intolerance against people you don't even know personally will never make a better world. It just perpetuates the same old story. I feel Sad. Very very sad today.","post_message":"\"Many of these refugees are the victims of terrorism themselves – that's what they're fleeing. Slamming the door in their faces would be a betrayal of our values.\"  - President Obama  Watch more here: @webpagelink"},{"comment_id":"10153649297241756","commenter_b":"William, the real shame is that this woman has likely already procreated or will procreate and pass on her low level of intelligence and ignorant, backwards redneck beliefs onto her offspring.","commenter_a":"As a historical relic, it belongs in a museum. The Confederates lost the war. The only flags that should be flying at the South Carolina Capitol are the United States & South Carolina flags.","post_message":"The crowd chanted \"USA! USA!\" as the flag was lowered."},{"comment_id":"988494927933952","commenter_b":"SEND THE MUTHA-FUKA BACK TO SYRIA WITH ALL OF HIS WIVES AND A FEW WELFARE WOMEN AND THEIR CHILDREN.","commenter_a":"Hell no tell him to get a job","post_message":"How do you say, 'Kiss my ass' in Farsi? Check this crap out. @webpagelink"},{"comment_id":"10152618671965950","commenter_b":"Don't care about that spoiled rich brat.","commenter_a":"Praying for her .. loved Whitney's music.still love her music.. such a sad time for the.family.. especially Sissy Houston.. God heal Bobbi Khristina.. play her MAMA music. They say that will help. To hear someone they loved voice.","post_message":"Despite mixed reports over Bobbi Kristina Brown's condition, family members ask the public to #StillPrayForBK."},{"comment_id":"10153856538795575","commenter_b":"Great post😀","commenter_a":"People say that Mr Trump doesn't have a platform, that he just wants to make America great again. I have something to say about that, Donald Trump is not telling you his plan he's giving you an outline. Why? Every time he brought something to the table, the other candidates take it and run. Such as immigration, the wall and other issues. I can guarantee you that he won't give you his full plans in detail until he standing at the podium next to one of the Democrats. That is when he will reveal everything. He doesn't need to do that now. Donald Trump is a visionary. He doesn't go into business without a strategy, and a form of negotiation already set. This man is prepared in business and it will be prepared when the time is right in a debate. He is a brilliant man, and he will not ...","post_message":"CHAOS in Alabama --  20,000 EXPECTED AT TRUMP RALLY!"},{"comment_id":"1180033235377842","commenter_b":"Obamo is nothing but a Fuc##^#gJerk that is trying to desroy AMERICA !!!!!!","commenter_a":"Shocked, Hassan rejected Syrian refugees! Of course Obama told the Govenors to pound sand! He's sending them in under the darkness of night on buses!","post_message":"Did your state make the list?"},{"comment_id":"1673203152922095","commenter_b":"Fucktards.","commenter_a":"Oh come on....we have laws for a reason..I don't care what color your skin is...if you urinate in public..you need to be arrested!!! What is this world coming to???","post_message":"New York City’s city council is set to dilute a host of criminal laws including laws against public urination and excessive noise because council members believe too many members of minorities are getting arrested."}]
