[{"comment_id":"10153547475163812","commenter_b":"it is just showing Obama is gay and that monkey guy he calls a wife now can be legal","commenter_a":"so nig","post_message":"White House lit in rainbow colors following US Supreme Court ruling that same-sex couples have right to marry: @webpagelink"},{"comment_id":"833697490010213","commenter_b":"All babies are precious I guess your mother didn't think like you or you wouldn't be here idiot","commenter_a":"How but killing the mother so she can't have anymore kids","post_message":"How many of you would have been aborted under this perverted logic?"},{"comment_id":"10153218033713188","commenter_b":"That Mormons even call themselves Christians is a relatively new phenomenon. It dates back to at best sometime in the late 70s/early 80s. I remember a girl in my youth group had brought one of her Mormon friends one summer's eve, and I got into a conversation with her and I'll remember what she said til the day I die- \"I'm not a Christian, I'm a Mormon!\" That would have been 74 or 75. Also, the concept that \"As God was, so man is; as God is so man may become\" is utterly missing from the other thee Abrahamic faiths.","commenter_a":"Um, no. The miracle IS the resurrection. The result is the atonement.","post_message":"A little bit of what I spoke about at church Sunday."},{"comment_id":"1005620852830996","commenter_b":"Of course the wives are to blame! Sad that she hunts for weak married men because clearly she can't find one of her own! See picture !","commenter_a":"Correction - the person going out of their way to cheat is to blame for not trying to fix any problems their relationship may have, for not giving their partner a chance and lying. Women like her who go with men knowing they're are married give the rest of us a bad name, she should be ashamed of herself, coming out with drivel like that just proves she has no morals and is kind of desperate for any male attention, but she is not completely to blame here either. Fix what's wrong in your relationship and if it's unfixable then leave, DON'T CHEAT.","post_message":"Woman who has had 100 affairs with married men blames their wives"},{"comment_id":"10153600253057431","commenter_b":"Well stated @username. Irony received. 😉","commenter_a":"White supremacist exist whether as paramilitary, or the idiotic Trump supporter who thinks he owns everything and everybody telling a Hispanic American (Jorge Ramos) to go back where he came from, to people who will destroy other cultures way of life for a dollar because they have no respect for others. They are so pervasive the only way to resist them is for people of color to band together. To pretend white supremacist don't exist or that they will magically disappear is to ensure their continued control over our lives. Working together to overcome an evil is not anti-American, it's just common sense.","post_message":"Fighting White Supremacists: Don't Forget, We Are In It Together!  @webpagelink"},{"comment_id":"970311343085644","commenter_b":"Sick perverted inbred barbarians!!","commenter_a":"He'd get a face full of beer then we take it from there.","post_message":"We were drinking at local brewery in Dripping Springs last Sunday. I DARE these little hajjis to try THIS crap @ that establishment. What would YOU do? @webpagelink"},{"comment_id":"10154526553127550","commenter_b":"@username SORE LOSER","commenter_a":"All of you supposed adults in here crying are ridiculous, Republicans lived through eight years of Obama, you can survive four to eight years of Trump. Grow up.","post_message":"North Carolina has officially cast its electoral college votes for Donald Trump."}]
