[{"comment_id":"863410587096986","commenter_b":"90% London is full of foreigners, loud mouth rude boys and junkies.","commenter_a":"But london will not make exception for trump","post_message":"London's new mayor will be an \"exception\" to his proposed ban on Muslims."},{"comment_id":"870530659649023","commenter_b":"This seems to imply, the next President has to be a woman...","commenter_a":"I completely agree with her that Hillary is not the woman for the WH. And I'm looking hard to find the one who will do all they can to put us back on track as a Nation, restore our economy, and undo the damages done to our International Affairs across the world. We need to sure up our relationships with our friends and work harder with the ones who threaten the peace and safety of this world to ensure they do not get nuclear capabilities and the ability to use them. We also need to clean up our Nation from illegals and close our Borders so that they are not so easy for illegals to cross them. We need some common sense leadership for this Nation instead of all the socialism and liberalism, lies and corruption that is tearing this Nation apart. Hillary Clinton has already proven she can not ...","post_message":"Want a female president?   Skip Hillary. Look at Carly Fiorina!"},{"comment_id":"1140671769377398","commenter_b":"This lady is such a trash!","commenter_a":"Why didn't they do this when Obama was in office?","post_message":"Thankfully we have Elizabeth Warren in the Senate to call him out.  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"768694459925723","commenter_b":"With alll the evil this Bitch has done. She should be disqualified from living!","commenter_a":"Since Hillary is under investigation she should be disqualified to run for President .","post_message":"Can America survive more of the same?"},{"comment_id":"1371582852881168","commenter_b":"She's definitely a weird bitch !","commenter_a":"Stein you lost by zillions go home and get a job","post_message":"JILL is just fishing for money is all...?  @webpagelink"},{"comment_id":"10154082437051051","commenter_b":"As usual she is lying.","commenter_a":"Wrongagain.","post_message":"Hillary Clinton says there's no question Obama will go down in history as a successful president. Is she right?"},{"comment_id":"10152797088006051","commenter_b":"Burn em all down. And roast a pig in the process.","commenter_a":"That is deplorable. He is entrusted to safeguard civilians, he does not have the right to pick and choose based on his personal beliefs and bigotry. One cannot condemn an entire religion because of a group of extremist radicals. EVERY religion has its bad...Catholics raping little boys, Christians murdering and blowing up abortion doctors and clinics. With the hateful logic all mosques should burn, burn all churches as well, right? I so sincerely hope he is removed from his station. Hate begets hate.","post_message":"This fireman tweeted out the first thing that popped into his head when he heard that an Islamic Center was on fire."}]
