[{"comment_id":"10153329238969228","commenter_b":"So what Johnny they were here before you were... immigrants.","commenter_a":"A permanent plaque in the public sidewalk for a kid who tried to kill a police officer in broad daylight?! May as well let all the murderers, rapists, and sexual predators go free and give them all a museum!","post_message":"Mike Brown's dad works to remove the memorial in the middle of Canfield Drive in Ferguson.  This would have been his son's 19th birthday.    A permanent plaque will be placed in the sidewalk after a Ferguson paving project.  The objects will be temporarily stored by Urban League"},{"comment_id":"562653790568588","commenter_b":"That's bad...right :-) Bernie is a moron, a pandering moron.","commenter_a":"idiots topped with lie pudding","post_message":"No, this wasn't Saturday Night Live. Bernie Sanders actually said this in a real debate..."},{"comment_id":"1362411960521719","commenter_b":"@username Oh snap, you go mean girl. Can I sit next to you in the cafeteria? I didn't vote for the Orange white trash. but carry on with your brilliant repartee. I'm so put in my place. Yawn, on to the next idiot.","commenter_a":"Well, it's what I always say, \"if everybody says it, it must be wrong.\" The only thing wrong with @username is they are PH.D. reporting to a Honey Boo Boo and Duck Dynasty population. We are a white trash nation, of course nobody watches.","post_message":"Would launching a trade war with China help \"make America great again\"?"},{"comment_id":"10150875072404999","commenter_b":"Why should it always be hush hush? I was told by a lady that '' Your daughter loves to play sports. Make sure she doesn't mention her periods or say it hurts because her coach will kick her out especially in our school district.'' She will still participate no matter what ,but y the taboo?","commenter_a":"All power to her to be able to compete with period cramps.","post_message":"An Olympic commentator turned to Fu Yuanhui, who was grimacing in pain. “It’s because I just got my period yesterday, so I’m still a bit weak and really tired. But this isn’t an excuse for not swimming well.”"},{"comment_id":"10154496192470329","commenter_b":"Jools pls","commenter_a":"@username u at ginger boy","post_message":"Are hand jobs back and better than butt stuff? Is this 9th grade? LET THESE TWEETS DECIDE."},{"comment_id":"10153847623528812","commenter_b":"Na u should go back to Europe and take inbred fascist friends with u","commenter_a":"Beat it and take Obama too","post_message":"14-year-old arrested after a homemade clock he brought to school was mistaken for a possible bomb will be attending school in the Middle East."},{"comment_id":"10153667196560090","commenter_b":"She should be in Jail period!!!","commenter_a":"No. Send her to Prison","post_message":"Keep Hillary Clinton out of the White House!"}]
