[{"comment_id":"10154194014766509","commenter_b":"*you're *themselves","commenter_a":"Why should everyone else have to be exposed to a trans person using the opposite bathrooms and locker rooms? If a person feels they are the opposite sex, get the full operation.","post_message":"The district has one month to provide access or they will lose federal funding."},{"comment_id":"626166684240577","commenter_b":"She is a idiot ass","commenter_a":"She always does that is why nobody watches the show the POS is on.","post_message":"Whoopi Goldberg made a sad attempt to play the race card, big mistake. What liberal filth. She needs to be taken off TV. Are you tired of liberal trash polluting the media?"},{"comment_id":"1191348794238924","commenter_b":"She should keep her mouth shut and her daughter her legs shut","commenter_a":"Here is how I see it: The rediculous right always has an angle of deceit. Their only honor is to ones self and personal greed. No matter what they put out in propaganda the real truth about them shines in their actions and public statements. The problem with the left is they won't get up and go vote even by absentee ballot and let the post man do all the waiting in line when the religious right blocks off all the bathrooms.","post_message":"Sarah Palin wants you to fight against haters who want to take Christ out of Christmas by buying her ridiculous book."},{"comment_id":"542951289163244","commenter_b":"That cunt, is one letter away from ruining my name!","commenter_a":"This whole thing just happens at the EXACT SAME TIME OBAMA ANNOUNCES ILLEGAL EXECUTIVE GUN CONTROL ORDERS! This was a set up to drum up support from the sheep for this gun control garbage that will circumvent or HIPPA privacy. I for one feel that the government shouldn't have access to anyones medical records to see if they are crazy by THEIR STANDARDS, which are pretty fucked in the first place... I do not trust the most narcissistic, psychotic, murderous people in our country to choose who gets to protect themselves and the rest of us. This whole thing is under the guise of mentally ill not being armed. People that have guns will now redusr to get treatment they may need for fewer of the government coming and taking their guns by force. anyone that has EVER had treatment will loose their guns by a man with a gun ...","post_message":"So much for taking on the tyrannical federal government, ehh?"},{"comment_id":"10155795275933294","commenter_b":"Bunch of bull lock all of them up @username bond then they stop this crap","commenter_a":"He got what he deserve and they should get the same","post_message":"WATCH LIVE: Protesters have taken to the streets of downtown Portland, calling for justice for Quanice Hayes, who was shot and killed by police last week."},{"comment_id":"1181787745189978","commenter_b":"Lock her up","commenter_a":"BULLSHIT!!!!!","post_message":"******BREAKING NEWS******  Finally!!"},{"comment_id":"10152800967581545","commenter_b":"I'm with you on that","commenter_a":"Thats why i don't let my kids go to other peoples houses. I know im responsible but are they?","post_message":"Police investigated the death of a 13-year-old Garland boy as a possible suicide but later determined his friend likely shot him while the pair were playing with a gun they thought wasn't loaded."}]
