[{"comment_id":"10154404205156130","commenter_b":"Holy crap, what a bunch of drama queens.","commenter_a":"Done","post_message":"It's a tiny gesture, but it speaks volumes."},{"comment_id":"1033160160077065","commenter_b":"And why don't you keep your fat mouth shut?","commenter_a":"Divorce the fat pig and get Urself a nice slim lady!","post_message":"Wife won’t ler husband see her naked after pilling on 140lb"},{"comment_id":"10153264086439342","commenter_b":"All you women bashing this woman are evil! Women are the quickest & most harsh to tear another female apart! Low life, heartless, evil women!","commenter_a":"The amount of alcohol that it would take for me to touch that would kill me...","post_message":"A Spring woman says she was sexually assaulted by a deputy during a traffic stop earlier this summer."},{"comment_id":"10152716358611680","commenter_b":"Red herring fallacy and straw man fallacy.","commenter_a":"This is sexist and Politico and the lib media are trying to hide this story. Nice try. @webpagelink","post_message":"Kelley Paul says \"to have that label put on him, that really upset me.\" @webpagelink"},{"comment_id":"10152979977382293","commenter_b":"go to hell sodomites","commenter_a":"Some will look at this map and say that the majority of the world has become enlightened. Others will look and say that Africa, the ME and the other countries in tan and brown are the righteous ones with their religious views. I think the map speaks for itself. Homosexuality is here to stay and someone needs to tell some of these countries what century they are living in. Killing people for being gay is a sick understanding of a religion.","post_message":"Many countries still punish homosexual acts with prison time, torture and even death."},{"comment_id":"10153136670568010","commenter_b":"Amen.","commenter_a":"Mr Stewart, your request to resign has been denied. The American people need you to shed light on the ridiculousness and political shenanigans in Washington DC. Love, virtually every American.","post_message":"\"[Jon] Stewart has been a voice of astonishment and outrage, sometimes for comic effect, sometimes heartfelt and often both — a safety valve, a tonic at the end of the latest hard day, comforting confirmation that you are not the only person to find the world out of joint,\" critic Robert Lloyd says of Stewart's impending departure from \"The Daily Show.\""},{"comment_id":"10152946649009641","commenter_b":"While I despise Islam I don't hate Muslims.. At all! It's not their fault if they're born in it. But I agree with letting no more immigrants into west! None!!","commenter_a":"allTerrorists should be killed to make the world better","post_message":"Gunfire echoes from two police raids ending terror sieges around Paris. One witness says: \"It's like a war.\" Another describes how a suspect told him: \"Go, we don't kill civilians.\" @webpagelink"}]
