[{"comment_id":"10154398939341523","commenter_b":"There are TONS of awesome, respectful, wonderful men; just as there are TONS of nasty, evil, sexual predator females.","commenter_a":"I would still like to know which of my rights are being violated.","post_message":"Milwaukee County Sheriff David Clarke reacts to the Women's March in Washington to protest Donald J. Trump's presidency -- calling it \"an absolutely freak show.\" @webpagelink"},{"comment_id":"10154240769776438","commenter_b":"@username No. You're being dishonest. The \"second amendment solution\" is to use the guns to kill people, and he was talking about his followers killing Secretary Clinton, and he was talking about his followers killing the judges she will appoint as President. You can try to say that he didn't actually think they would follow his advice, but you can't say that isn't what the words mean.","commenter_a":"Hmm I wonder if he's talking about the NRA? Taking things out of context, as usual","post_message":"\"Nothing you can do folk—although, the Second Amendment people, maybe there is, I don't know.”"},{"comment_id":"1171676779558735","commenter_b":"What couples?Floyd has a harem of women like this in Vegas!!","commenter_a":"these celebrity couples are getting ridiculous.........i can understand the attraction to cash but at least try to hide it...","post_message":"Floyd Mayweather is dating a 19-year-old New Look sales assistant from the West Midlands."},{"comment_id":"10154296566836491","commenter_b":"Cristina Cojocaru","commenter_a":"I can do this.","post_message":"Prepare to be amazed."},{"comment_id":"915863931882175","commenter_b":"I think he should be raped until bleeds to death","commenter_a":"Let him go to prison and play with REAL BIG MEN","post_message":"Amanda awoke to find her baby was missing. She found her in the basement bleeding and unconscious. This man had raped the 9-month-old infant until she was brain dead. He was arrested and is in jail, but many people think he deserves a harsher punishment for his crimes. A new petition is calling for him to be hanged in public for his disgusting crime.   Should he be hanged?"},{"comment_id":"1113331872041003","commenter_b":"Lauren my family worked hard & works hard to pay taxes not to give it away to terrorists & fake MTFs who pretend to be refugees & plus why don't they fuckin claim asylum first point of call instead of wanting to come to UK ! It's not cuz of getting money & free housing is it ? This island is full & like I say open your house to a family than . No ? Thought so another one all talk no action","commenter_a":"Go back & live your life in your home as there's nothing here for you & Europe does not want you . Your president as a lot to answer for.","post_message":"Refugees are forced to travel light, and they have to carry everything they'll need for their journey inside a small backpack. What's inside? AJ+ takes a look."},{"comment_id":"565700806961575","commenter_b":"Don't they get it! We don't want her!","commenter_a":"Hillary will probably die before then of karma and natural causes!","post_message":"Trump-Clinton rematch for 2020?"}]
