[{"comment_id":"1259153044105704","commenter_b":"You could try this? :) @webpagelink","commenter_a":"Judy Acres too bad we can't watch this :( UK only","post_message":"Absolutely spectacular footage from the BBC's latest nature documentary, #thehunt. Honestly, some of these shots look almost too perfect to be real.  \"Witness a polar bear sneak up on its prey using ice holes to surprise it. This is the first time ever this has been captured on film.\"  You can watch on iPlayer here: bbc.in/1j0xI5B"},{"comment_id":"1142049429235281","commenter_b":"I'll unzip my dick for you, gurl","commenter_a":"#VoteJillStein!!!","post_message":""},{"comment_id":"10153220581496336","commenter_b":"And the rap sheet of those deceased are mind blowing. Sad to be in A profession where u care so much but the ones u protect care so little.","commenter_a":"A bad situation when police are persecuted for doing their jobs. The whole force should resign. I would.","post_message":"The booking photos of the six Baltimore police officers charged in the Freddie Gray case have been released."},{"comment_id":"1186921104703676","commenter_b":"Graciela Rojas","commenter_a":"Unfucking believeable!","post_message":"WATCH: Shocking police shooting of an unarmed black man attempting to help a suicidal man with autism, caught on camera; the man is now recovering: @webpagelink"},{"comment_id":"466981083492472","commenter_b":"Fuck them get out if our country Fucking terrorists","commenter_a":"No,","post_message":"Should Christianity Be Banned To Please Muslims?  Comment 'yes' or 'no'."},{"comment_id":"10154274649819087","commenter_b":"Dear Democrats and Liberals, I'm noticing that a lot of you aren't graciously accepting the fact that your candidate lost. In fact you seem to be posting even more hateful things about those of us who voted for Trump. Some of you are apparently \"triggered\". Because you are posting how \"sick\" you feel about the results. How did this happen you ask. You created \"us\" when you attacked our freedom of speech. You created \"us\" when you attacked our right to bear arms. You created \"us\" when you attacked our Christian beliefs. You created \"us\" when you constantly referred to us as racists. You created \"us\" when you constantly called us xenophobic. You created \"us\" when you told us to get on board or get out of the way. You created \"us\" when you forced us to buy health care and then financially penalized us for not participating. You created ...","commenter_a":"People will never vote Democrat again, once they appoint an Islamic extremist at the helm:)","post_message":"\"People didn't vote for Trump so he could bring a white supremacist into the White House,\" Elizabeth Warren said."},{"comment_id":"1641329602799278","commenter_b":"Black lives matters ass bitch","commenter_a":"This person needs to be arrested!","post_message":"This VIDEO is absolutely nuts.  “I’m going to cut you. And I’m going to get away with it. Now if you say one more word, it’s going to end very badly. Do you understand?”"}]
