[{"comment_id":"377454052442889","commenter_b":"Let's BAN Muslims, this is our country and our freedom of religion!!!! They need to go back home where they belong to do this in their own country!!!!😡😡","commenter_a":"If the Muslims choose t o.live here, Don' t tell us what you want. This is America and a lot of us are Christians and we don't need or want immigrants telling us to change our beliefs. If you don't like our beliefs and our freedoms, maybe you should g o back to you country and try to get along. If you choose to stay here and enjoy our life and freedoms, then stop telling us to give up.our beliefs. I suggest you join a branch of service and share the responsibility of living here instead of holding your hands out for every thing you can get for free. It's time we stand up to you and what you want. I'm tired of it. God bless America!!!!","post_message":"The want to change Easter in \"Spring Break\"..."},{"comment_id":"877374009072027","commenter_b":"What they should do is put them to work while they are on welfare and lowering government al expenses! A few hours here and there will save a bundle! Stop giving them a free handout and not allowing them to contribute to society! Eventually, get them a regular job and get them off welfare!","commenter_a":"Yes! To all of them!","post_message":"Do you support drug testing for welfare recipients?"},{"comment_id":"848788448587668","commenter_b":"@username is trying to use bully tactics to shut up anyone that doesn't agree with him. It won't work. We're fed up!! We will not call evil good and good evil, so crawl back to your safe space and stay out of the women's bathrooms!!","commenter_a":"I am NOT a bigot and i hate being told i am because i do not like what Target did.. that is crazy !! i really do not care what they do.. but not in the little girls room","post_message":"I hope this video makes the rounds....Target has completely LOST IT at this point....shame on them."},{"comment_id":"10154450700759411","commenter_b":"Not Only Gay, what about all females that Catholic Church burned at dark age?.","commenter_a":"We all need to REPENT turn from our wicked ways and worship the Lord Jesus. Judgment will come to all when the lord returns... Even the Pope will be judged for his words and actions.","post_message":"'The questions is: if a person who has that condition, who has good will, and who looks for God, who are we to judge?'"},{"comment_id":"10152841390816491","commenter_b":"Men wouldn't would they!!!","commenter_a":"What the hell? Who cares? I mean honestly. Who the hell cares?","post_message":"“Every ounce of milk I’m able to produce for my child is nothing short of a miracle and to watch that milk be thrown away without any regard for my baby was heartbreaking.”"},{"comment_id":"10153093955378487","commenter_b":"One lady in particular..","commenter_a":"He only knows war and how to use military might .... nothing more. He is the same type of person as McCain.","post_message":"Netanyahu wants a role in shaping the Iranian nuclear agreement, should one materialize. His recent actions suggest that he doesn't quite know what he's doing."},{"comment_id":"10155648404180354","commenter_b":"Fire the bitch.","commenter_a":"He wasn't rude, she just didn't want to answer his question! She made a very bad decision and now she doesn't want to face the consequences of her stupidity.","post_message":"What do you think? Was the reporter being rude?"}]
