[{"comment_id":"10158042812305551","commenter_b":"I have trouble with Rhinos who profess to be one thing, but are LYING. I have not trusted John McCain for several years. I am beginning to wonder about Marco. Time will tell. As for Hillary and John Kerry, They are trying to destroy what America stands for and that is FREEDOM. Than there is Eric Holder who along with Obama and Clinton, sold guns to Mexico Mafia. Corruption is what WE THE PEOPLE are sick of.","commenter_a":"Trump is right again. John McCain is no war hero and never has been.","post_message":"Two Senators Have a Problem with Tillerson, but not Hillary Clinton or John Kerry"},{"comment_id":"1695653017364810","commenter_b":"@username And she is not even bad.","commenter_a":"careful how you word that, don't say \"The GOP is the Party of White People,\" it implies all white people are Republicans. I am white, definitely not Republican.","post_message":"Because of Donald Trump, Republicans are finally being forced to admit that their party is a racist haven that caters to whites only."},{"comment_id":"946243322102083","commenter_b":"Vote UKIP","commenter_a":"And who listyens to this moron?","post_message":"Russell Brand who called voting 'a massive waste of time' no U-turns and says: 'Vote Labour'"},{"comment_id":"855612107818751","commenter_b":"So then please elaborate what does happen once that sperm penetrates that egg-I'll wait.","commenter_a":"The egg, once fertilized, then has to implant to become life. Not sure conception counts, not without implantation. Otherwise, you're telling every woman who takes birth control pills she is a murderer.","post_message":"The evidence is clear: life begins at conception!"},{"comment_id":"938381199514967","commenter_b":"Take the bitchs baby she don't need it jus like her other ones","commenter_a":"We need to all really start to focus on the hard truth of meth and the sickening epademic that is in almost every big and small town across America . I'm tired of all of the meth head thieves , I can't even imagine how many children across America are going through the same life endangering situations becouse of the parents being hooked on meth .. don't spend the tax payers money on jail , send them to treatment for several months . I'm sure these parents were decent human beings before meth took over . Unfortunately now they have like all meth heads done sinister,and incomprehensible acts . It's good to see these kids have survived when so many others don't .","post_message":"Bond's set at $100,000 for each parent after they allegedly abandoned their three young children in a house that neighbors call a mess and fire hazard.   \"Rats that were running in and out of the garage. I mean, it was horrible.”"},{"comment_id":"1727548687496080","commenter_b":"HILLARY CLINTON IS AN ARROGANT NARCISSISTIC SOCIOPATHIC LIAR AND VERY EVIL WOMAN !!","commenter_a":"Time will tell","post_message":"We'll see what ends up happening..."},{"comment_id":"10152764552031491","commenter_b":"Yes. A woman can be a missionary or a nun. But why not be a priest too? Why is this off limits? What is it about women that make them unacceptable?","commenter_a":"Ponder on Mary's llife. have a virtue of humility. For the women, if you have calling to the religious life, you can be a missionary or contemplative nun. Be prayerful anyway, the right of women is not violated instead it is transcen! Pray for the gift of wisdom and understanding. Long live Pope Francis!","post_message":"Pope Francis gave a firm no to female clergy, while saying he wants to see a “greater role” for women in Catholicism."}]
