[{"comment_id":"10152744364061051","commenter_b":"And she can spend all the money she wants...mother nature will eat you from the inside our eventually","commenter_a":"Wonder how many hungry people that money could feed? But why try to end world hunger when you can go to the gym.","post_message":"This couple spends $80,000 per year on their looks, and they say that's why they're the best looking people in America."},{"comment_id":"10154034198879749","commenter_b":"And here we have it ladies and gentlemen. You see, when you dare to question one of these social justice creatures and it becomes apparent that absolutely none of their arguments hold up to scrutiny, they start with the personal attacks just like they've been taught. Thank you Tracy, for showing us all just what an utter lack of both argument and character you possess. Why don't you pop off back to Tumblr and tell all your sympathetic sisters how the nasty misogynist was harassing you.","commenter_a":"And if they end up working less hours, and being paid less as a result I'm sure we'll hear all about the sexist \"wage gap\" a little more from the social justice cretins.","post_message":"A Bristol firm allows women to work flexibly at different times of the month to tap into employees' \"natural cycle to create happier working environments.\""},{"comment_id":"10157371541105231","commenter_b":"But they pay for it smh","commenter_a":"Sorry but if she was white I would still find this inappropriate. For me it has absolutely nothing to do with the color of her skin or the shape of her body as a human resources manager I have had to have many a talk with white, brown, and black women regarding their inappropriate attire. That's what dress codes in the workplace are for. FYI men also come to work in inappropriate attire. They tend to dress sloppy, they don't bath, and when they think they're sexy they tend to show us way more than we want to see. So it works both ways.","post_message":"It isn't the clothes they have an issue with."},{"comment_id":"10154189753241130","commenter_b":"Hillary is way too smart, too tough and too focused on governing well to let these kinds of insults throw her. And Tina Fey said it best: Yes, she's a bitch and that's great because bitches get things done!! I think Hillary should own it and we should all get behind her! I'm ready to get my bitch on, how about you?! #I'MWITHHER Vote for Hillary Clinton!","commenter_a":"Already seen and heard it.","post_message":"If Hillary Clinton wins in November, brace yourselves."},{"comment_id":"10153310533507629","commenter_b":"Women beater","commenter_a":"He is the scumbag of the earth.","post_message":"Fox News anchor Bill O'Reilly has been accused of dragging his ex-wife by her neck down a staircase in the couple’s home."},{"comment_id":"10154019133956045","commenter_b":"Ronald Collier","commenter_a":"They could have let this woman get a ride home,,, or even took her home.. she wasn't on the road at the time.. where is the love in this world? I bet she was writing an unbiased story about the council meeting discussions..","post_message":"A Franklin County teacher has been arrested while working at a second job."},{"comment_id":"10153888112799330","commenter_b":"God bless you all.","commenter_a":"I hope they gave you the treat and treatment of the hereo you are. Awesome job Officer Axel.","post_message":"Axel helped save a missing woman after finding her in a pond in Tolland early this morning. ---> @webpagelink  How about some \"likes\" for Axel."}]
