[{"comment_id":"10153564661133837","commenter_b":"If they are illegal then yes deport them and yes build a wall preferably with large guns","commenter_a":"He just wants to deport them all, and thinks they're all criminals, and wants to build a wall!!","post_message":"TRUMP LOVES HISPANICS!  Presidential candidate Donald Trump tweeted out this afternoon, \"I love Hispanics!\" to help celebrate Cinco de Mayo.  THOUGHTS - THAT'S SO NICE or THAT'S SO WEIRD?"},{"comment_id":"1302393583116762","commenter_b":"@username The woman brings up the fact that \"She voted For Trump \" herself","commenter_a":"Why does all the evidence in this video seem half baked @username? I wanna know exactly what was said before the video snippets as to why this woman feels shes being discriminated against in the first place!","post_message":"This Trump supporter went on a racist rant in a store while another customer recorded her meltdown over \"reverse racism.\""},{"comment_id":"1302991003096347","commenter_b":"Wait-what? these illegals don't like what's going to happen? well, guess what? this is still America, we have immigration laws and it looks like the authorities are going to have to start following them. Go home and come back legally and you'll be welcomed with open arms!","commenter_a":"Start packing","post_message":"BREAKING: Trump Appoints Head Of Immigration Team Illegals, Liberals HORRIFIED!!!   We're making America GREAT!!"},{"comment_id":"1717265371820481","commenter_b":"Calling for a border restored and a return to LEGAL immigration IS NOT RACIST. We will not give our country to you - but you may join our country if you ask! VOTE TRUMP!","commenter_a":"Go trump","post_message":"BREAKING: Anti-Trump protesters rally at Columbus Circle and are heading to Trump Tower. Are you there? @webpagelink"},{"comment_id":"1288527907860500","commenter_b":"Melissa these manhating proabort feminists don't get the concept of responsibility","commenter_a":"As early as 9 weeks the baby in the womb has all the same organs as you and I but in an earlier stage of development. He/she has a head, ears, nose, eyes, arms, legs, heart, brain, lungs. So tiny and so beautiful. Denying his/her humanity is denying science. Denying a human being his/her rights is against a concept of civilized society.","post_message":"Isn't life precious?"},{"comment_id":"10152858682652411","commenter_b":"She should have been tazed!!","commenter_a":"I don't condone what the the officer did but the situation would've been completely different if the little brat did what she was told.","post_message":"Breaking News: The police officer whose video-recorded actions at a North Texas pool party have drawn national attention and comment has resigned from the police force."},{"comment_id":"10155406467768812","commenter_b":"Didn't miss em. Had same day as any other.","commenter_a":"Idiots. Proof of the problem","post_message":"People protest around the country in support of a \"Day Without Immigrants,\" a protest against President Donald J. Trump's promises to crack down on illegal immigration. abcn.ws/2kX8c5V"}]
