[{"comment_id":"10153420149016350","commenter_b":"Awesome!!!!!!! Congrats to the graduates!","commenter_a":"This is Awesome!!","post_message":"The seniors only took two days to learn the performance!"},{"comment_id":"10153284807073984","commenter_b":"That thing is female !","commenter_a":"Shame on the university for hiring her and for not firing her......something is mentally wrong with her.","post_message":"Surprise, surprise, she is an extreme liberal.  Does this type of behavior from a teacher make you sick?"},{"comment_id":"1123460471025521","commenter_b":"The mother is as full of crap as the child.","commenter_a":"Instead of asking the whole world to conform to ones abnormality or difference how about assisting that person to deal with their abnormality/difference in such a way as to not draw negative attention. If one is a diabetic the whole world does not need to eat a diabetic diet. If one has a limb removed does the whole world remove a limb? Honestly I see no difference. We all have differences and we learn to deal with them, not expect others to suffer or deal with it.","post_message":"Watch this amazing video as the mother of a \"trans\" teen makes the most outrageous claim possible about North Carolina's new HB2 law.   What do you think about this mother's claim?"},{"comment_id":"10154273015234205","commenter_b":"@username you are so right ! And I'm glad I'm not the only one seeing this woman's racist side. @username you aren't from here your European American ! This isn't your merica it belongs to all the people ! No matter what your ancestors were once undocumented immigrants so don't speak as if you are a true American because a true American would realize that America isn't just for legals. If so you should of been long ago with the Damn mayflower.","commenter_a":"On October 22, 2016 Trump said that we would pay for it and Mexico would reimburse us. Check your facts people. We will get reimbursed through tariffs on anything that has to do with Mexico. Brilliant!!! That's why we hired you president Trump.","post_message":"Will Congress pay for Trump's border wall?"},{"comment_id":"10153994527466509","commenter_b":"Cnn is getting paid big time to support him.","commenter_a":"@username, is Trump paying you to write about him, not an hour passes by without you guys writing about Trump. Looks likes he is the only one running for presidency, can't even remember last time I saw a story about Obama. Please give everyone a fair playing field.","post_message":"Donald J. Trump is going to make a decision \"very soon\" regarding a third-party run, he says. @webpagelink"},{"comment_id":"583963178430303","commenter_b":"Fucking slut","commenter_a":"I think it's actually kind of good. There's a silver lining in everything. She will now live in the free world and be faced with the reality that she ruined her life. Every second of every day. Being out will slap her harder than a cell ever could after being locked up for so long.","post_message":"Leslie Van Houten has been in prison for 46 years now."},{"comment_id":"10156716294680725","commenter_b":"Trump is a scum bag who steals from Veterans!!! @webpagelink","commenter_a":"Never liked Cruz and I thought Rubio seemed like a nice guy. Not anymore...give em hell @username, your the only man that can pull this off. You have had my vote from the beginning.","post_message":"THANK YOU #TrumpTrain! Lets make it a great day! Preparing now for rally at Macomb Community College- here in Michigan!"}]
