[{"comment_id":"1178538995510357","commenter_b":"I would have moved too.","commenter_a":"Ungrateful people if they really look at the whole picture officers are out there protecting us,don't judge the rest because of the other bad apples.Now they got to deal with criminals and the society plus news reporters.Too bad the officers can't close their eyes and walk away and say I don't want to help you guys!!!!!! But they swore under oath they will serve and protect you!!!!!!!","post_message":"The officers even covered the couple's tip."},{"comment_id":"1287096984651728","commenter_b":"A Muslim Communist Terrorist...","commenter_a":"You mean 70% of America? The same 70% that pays the most taxes and fills our military ranks? I'd rather he just said thank you, ate pork and died.","post_message":"Is he racist?"},{"comment_id":"10153526551574497","commenter_b":"Now those fuckers will manage to rename their country as \"Aaaamerica\" to undisputably top the list...","commenter_a":"Not if you use America","post_message":"Via ClickHole"},{"comment_id":"10154704030031323","commenter_b":"@username Or you could just admit that you are fundamentally incorrect. That would be the mature thing to do here. You can't just use the serious topic of misogyny and sexism as an argument whenever you like. It plays a great disservice to the genuine areas where such a discourse is absolutely valid. This is about holding a proven heavily corrupted, belligerent war-mongerer to account, who happens to be a woman. End of story.","commenter_a":"Sorry Guardian, but no one actually buys the 'its because she's a woman' argument when it comes to Clinton. There are actually legitimate reasons why many do not like her. You're wasting your time.","post_message":"\"Hillary Clinton irritates people not just because of her gender, but because we simply can’t process her narrative. There are no stories that prepare us for her trajectory through life and, therefore, we react to her as if she’s a disruption in our reality, rather than a person. We love public women best when they are losers, when they’re humiliated, defeated, or (in some instances) just plain killed. Yet Clinton, despite the disapproval that rains down on her, continues to go out there and chalk up wins.\""},{"comment_id":"10154928634761320","commenter_b":"Classy","commenter_a":"drop dead.","post_message":"Happy Birthday to Secretary of State John Kerry.  He turns 73 today."},{"comment_id":"482111261979454","commenter_b":"She is in another country Germany . We have No rights there to forbid it. But in our country that's a different story all together. If swimming in a public facilities she should abide by laws of that community or township. If theme parks can refuse for you to wear cut offs then the should forbid that attire, and get out. They have more than enough money to put in their own pools. Our own laws presented by our President is destroying our country from within.","commenter_a":"This is going to far!!!","post_message":"A judge just ruled that public pools must allow Muslims to swim in 'Burkinis'.  We're tired of Muslims infiltrating our country. This stops now.  Do you agree that 'Burkinis' are WRONG?"},{"comment_id":"10153475900679705","commenter_b":"Excuse me, but what kind of a MOTHER leaves her DAUGHTER behind because there's no seat for her?!","commenter_a":"There's very easy way to avoid these things. Don't piss about at the last minute and end up being the last person to check in. Guaranteed a seat on the plane.","post_message":"Unbelievable."}]
