[{"comment_id":"10154086020097024","commenter_b":"Build that wall","commenter_a":"Prosecute every elected official in every sanctuary city as being complicit in evey crime committed by illegal aliens.","post_message":"Happening Now: Judge Jeanine Pirro delivers remarks at #CPAC2017."},{"comment_id":"755872544562858","commenter_b":"Hes a special kind of stupid isn't he!!!","commenter_a":"I think I read Obama sent his people to Israel to interfear in their election. This is like the pot calling the kettle black. Put that is what Bullies do.","post_message":"President Barack Obama says the U.S. must and will take action against Russia in response to cyber interference with the election."},{"comment_id":"10153227651945329","commenter_b":"Ikr how dare she maintain a healthy lifestyle, the bitch.","commenter_a":"She can fuck off","post_message":"More like baby washboard, amiright?"},{"comment_id":"10154543040158812","commenter_b":"Not this woman!!","commenter_a":"Hillary and her husband are as dirty as dirty can be! Can't believe this lying, two faced, arrogant broad is the Democratic nominee for President! Thank you women voters for voting for gender instead of what was best for this Country!","post_message":"An impromptu meeting between President Bill Clinton and the nation's top cop could further undermine Hillary Clinton's efforts to convince voters to place their trust in her, highlighting perhaps her biggest vulnerability. @webpagelink"},{"comment_id":"10153068305271051","commenter_b":"She is legal","commenter_a":"fire the cop,he must like young girls.","post_message":"This teen girl was with her friends when a police officer started hitting on her. She decided she wasn’t interested. Bad move."},{"comment_id":"10154290485811545","commenter_b":"Building a physical wall between MX is imsidious but ee must create a climate of understanding with the that they are responsible for these people comimg over illegal. We need to have serious talks with Mexico and make clear that vast fines will be waged against them if this invasion continues.","commenter_a":"He's lying like his president about everything","post_message":"Our Facebook stream has ended, but you can keep watching here: wfaa.com/livevideo  WATCH LIVE: Confirmation hearing for Alabama Senator Jeff Sessions, President-Elect Donald Trump’s pick for attorney general.  MORE: @webpagelink"},{"comment_id":"831862046868801","commenter_b":"You're talking about deregulation. A completely deregulated market would allow child labor and would have zero worker protections, environmental protections, etc. They'd still buy government because they don't really want a libertarian free market. They want a \"free\" market that's rigged in their favor; that's where the real money is. You can't really separate capitalism from corporations trying to exert influence over government. It's the nature of the beast. You have to find ways, instead, to make those attempts ineffectual. Starting a business always requires capital... that doesn't mean you have to be rich, per se. \"Big guys\" have economies of scale that make them hard to compete with even when the market is \"free\". It's not impossible to have a monopoly in a free market and it's not impossible (indeed, it's likely) that you'll have collusion and cartel-like behavior. I mean, the government could step in to put a ...","commenter_a":"Wealth inequality isn't a measure of economic health. Wealth inequality is merely a potential for trickle. It's nothing to be afraid of. It's something to embrace and tap into. Let's tap into that with a free market economy. What are we waiting for? @webpagelink","post_message":""}]
