[{"comment_id":"634421746711040","commenter_b":"Yur all ignorant fucks","commenter_a":"Of course he's guilty, adults never have the right to release their anger on minors, no matter the situation!! Smh!!","post_message":"Horrifying footage shows a Texas police officer body-slamming a middle school student. #MicBrights"},{"comment_id":"1056873814372366","commenter_b":"Rightly so with people like you ..muslim countries would be crazy to let you in","commenter_a":"No churches can be build in Muslim countries, why should mosques be in Britain .Woman got 200 lashes for just reading a bible in Sadia Arabia just last week.","post_message":"The largest Mosque in western Europe is engulfed in flames"},{"comment_id":"10154234462691770","commenter_b":"Typical liberals pay to play she learned from Hillary","commenter_a":"She's got to be a Democrat","post_message":"Liberal Governor Took Last-Minute Donation From A Company With $1 Billion In Contracts"},{"comment_id":"1742501459315047","commenter_b":"SORRY HILLARY IS PRISON BOUND.MAYBE YOU CAN WRITE HER.","commenter_a":"Just like she took care of the Benghazi situation?","post_message":"\"I’m afraid because these motherf—kers are coming for us, y’all.”"},{"comment_id":"1061799393879808","commenter_b":"Poor woman","commenter_a":"Mandy O'Loughlin","post_message":"They ripped most of one woman's scalp off in a horrific 30-minute 'feeding frenzy'"},{"comment_id":"745552312280553","commenter_b":"Racism 101. Get rid of free soeech","commenter_a":"Make America Great Again","post_message":"Is this still AMERICA?!"},{"comment_id":"10156208561685354","commenter_b":"So is this a rally call to hate blacks or something? I mean, if SHE said it, then EVERYBODY in the black race must feel the same way, right? You extremists only care about the opinions of other extremists. Fuck a race war, fuck a holy war, fuck an unnecessary war.","commenter_a":"There is the face of a true racist.....","post_message":"“Right now we declare, it’s open season on a motherf–king cracker. All you motherf–king crackers y’all need to watch your motherf–king heads.”"}]
