[{"comment_id":"10153474525188812","commenter_b":"Is she a Mormon? Cause those kinds believe differently.","commenter_a":"This is not ok!! he has said God made him wrong, God is NOT a liar and He makes no mistakes....repent cause looking like you made a true blasphemy against God, please don't comment ignorance, if you have an issue take it to God.....","post_message":"NEW: Meet Caitlyn Jenner -- formerly known as Bruce Jenner: @webpagelink"},{"comment_id":"758826910928758","commenter_b":"Those fucking bastards.....we gotta gut em, then kill them, then gut em again, then smoke a blunt or two and plant a tree and then maybe spread their entrails on our enemies lawn so they get the message.","commenter_a":"There's obviously some sort of mysterious group of people who have been trying to hide the advantages of the hemp plant to prouduce many of our products for everyday use.","post_message":"The solution seems obvious, doesn't it?"},{"comment_id":"1192837800775695","commenter_b":"@username talk about my mother bitch see what happens.","commenter_a":"No Obama, kiss our ass traitor!","post_message":"Not sure what he thought was going to happen when he started with the name calling, but Obama just gave him a political middle finger."},{"comment_id":"2088211734736585","commenter_b":"Stupid cow!","commenter_a":"Your a stupid person","post_message":"Cokie Roberts called supporters of Donald Trump \"morally tainted\" on MSNBC's \"Morning Joe,\" then received a heavy dose of push back."},{"comment_id":"585280771667035","commenter_b":"This photo is liiiiiiiife!!!! :D :D :D","commenter_a":"Brian Rungeling don't you like Trump's new \"Make Russia Great Again\"?","post_message":"Alec Baldwin just trolled Trump again by walking around New York City wearing a “Make America Great Again” hat — with the embroidered logo in Russian.  The timing for Baldwin’s hat couldn’t be better, coming as the president-elect sat down with security officials on Friday who told him the Russians helped him win the election — an assertion Trump flatly denies because it would contribute to the belief that his win is suspect having lost by over 3 million in the popular vote."},{"comment_id":"10153434994756636","commenter_b":"I do hope she gets all the care she needs. These countries are very poor and need all the help they can get. Imagine if you lived over there and your own children where sick. This is just heartbreaking no matter what.","commenter_a":"Her immune system must be shot to pieces - I do hope they can sort out the problem and eventually cure her. She deserved the best possible care.","post_message":"Pauline Cafferkey's in hospital for a third time"},{"comment_id":"10156504426675725","commenter_b":"Melania will be a wonderful First Lady and she'll bring class back to the White House!","commenter_a":"she'll be a 1000 time better than Michelle Antoinette Obama !!!","post_message":"My beautiful wife, Melania, shot in Trump Tower--- a great First Lady!"}]
