[{"comment_id":"988508257851300","commenter_b":"what a women feel when do this?","commenter_a":"Back before social media, women's magazines used to use this as a rule of thumb for whether you could get away with going braless (if the pen falls, you can ditch the brassiere. if it stays, strap 'em in.) Which would be shaming in the other direction, by today's standards, I guess?","post_message":"Why #Underboobchallenge is going viral."},{"comment_id":"10153910150514657","commenter_b":"Go home","commenter_a":"GITMO","post_message":"One doesn't have to think long or hard about how this would play if Hillary Clinton were a Republican (which she once was)."},{"comment_id":"588987547925154","commenter_b":"I bet I would be too.lol","commenter_a":"Lucky lol1143993849002785","post_message":"The price of gas hit 47 cents per gallon in Michigan Sunday. Michigan was the first state to have gas under $1 in likely over a decade, a senior petroleum analyst told ABC News."},{"comment_id":"10152987846462483","commenter_b":"Stfu fat cunt","commenter_a":"Chattanooga did lower the flags. A presidential declaration is not necessary for every death that occurs unless it is someone who has national level. A state or city can lower the flags without a presidential declaration. People need to inform themselves about the flag lowering issues. If we lowered the flag for every person that got killed, the flag would never be flown at full staff.","post_message":"Former U.S. Navy SEAL Marcus Luttrell pleads on his Facebook page, \"Think on it. RIP brothers, your families will miss you, the country will mourn you, and those still wearing the uniform will never forget you...Oh one more thing, lower the FLAG!!!!!!!! Sir.\"   The flag has been lowered at the United States Capitol in Washington, D.C., but no word yet on whether the flag will be lowered at The White House."},{"comment_id":"1234855006552733","commenter_b":"trump = sexual predator. You really feel ok getting behind this rapey racist creep? Wake up you ignorant fool!","commenter_a":"If you are a woman who is offended by what Donald Trump said a decade ago but you enjoyed 'Fifty Shades of Grey' and other movies and books like this than you are a hypocrite! Do you laugh when comedians talk like this or do you stand up and leave the room!?! I was not offended, I could care less what he said BS's with men in private - give me a break! I care about what he says and does now - I care about what he will do for our country! Look what Hillary did that mainstream media is covering up - her speeched released show she also refers to people as bucket of losers....has two different policies, one for public,one for private...not to mention the entire email scandal with her \"innocent\" friends all getting immunity...why do innocent people needimmunity?","post_message":"After audio was released of Donald J. Trump saying highly controversial things about women, Christian Coalition founder Ralph Reed shocked the media with a huge announcement on the Republican nominee.  Nobody saw this one coming... what do you think about what Reed said?"},{"comment_id":"1429758383703081","commenter_b":"Drain the swamp!","commenter_a":"If this is true the whole bunch including the Obamas need to be in prison. All the laws from the last 8 years need to be scaled back, especially the executive orders. So ridiculous that a birth certificate isn't presented before even running for president. So sick!","post_message":"You already know that Barack Obama's \"birth certificate image\" has been demonstrated to be fake. But now, the trail into the deception goes deeper, as the investigator handling the case has concluded that government officials were involved in the fraud that transformed America ..."},{"comment_id":"1230732883614387","commenter_b":"Well, since they found a genetic marker for homosexuality that automatically means that the same genetic marker influenes heterosexuality.","commenter_a":"No specific gene links heterosexual people and the preferred gender of their partners, and I'm fairly certain the same goes for gay people.","post_message":"The science of homosexuality."}]
