[{"comment_id":"10153153528689071","commenter_b":"You mean in the houses where tragedy still occurred, like drownings, accidental poisonings, falls etc? Not the sharpest tool in Lowes are ya?","commenter_a":"This sort of thing happens less often in houses without guns, but I'm sure that's just a strange coincidence.","post_message":"An awful tragedy happened in Chicago."},{"comment_id":"10154978803416509","commenter_b":"@username even your pussy is ugly...","commenter_a":"Anyone who is upset, mad or sad about this, please evolve otherwise you are apart of the pedophile culture.","post_message":"In a nod to a more modern approach, the Miss Teen USA pageant is ending the swimsuit portion of its competition."},{"comment_id":"558362490993134","commenter_b":"Why is it we are so intent to run our country into the ground?? Follow Trump, and mark my words, there will be a WWIII, and everyone will be pointing their guns here. We will have no allies as he will insult them all. Wake up, America.","commenter_a":"\"I will not forget.\" What in the hell do that suppose to mean?","post_message":"Do you agree with Donald J. Trump's tweet?"},{"comment_id":"10153159608716833","commenter_b":"Took out the trash.","commenter_a":"The guy with the gun did the right thing!","post_message":"Armed Citizen: Video has been released showing a man armed with a machete kicking in a Pocatello, Idaho, apartment door last year, then getting shot by the apartment resident."},{"comment_id":"10152983731016545","commenter_b":"Like all things. Just because it can be done, doesn't mean it should.","commenter_a":"What was he expecting? That's like going topless and wonder why people stare.. lol. People ask for attention only to flip once they get it.","post_message":"A Georgia man says he was harassed by police after openly carrying an AR-15 into an airport last week. Citizens are permitted to carry weapons in the open and public areas of the airport,  provided they do not move into the TSA-controlled secure areas of the airport property."},{"comment_id":"10152747797741051","commenter_b":"Not a nun no more now she's a sum cause that's what she got","commenter_a":"I thought nuns were sworn to celibacy","post_message":"A nun was rushed to the hospital with extreme pains. When the doctors told her what was happening, she couldn't believe it."},{"comment_id":"10154128479435673","commenter_b":"She needs to go. and you can go to....","commenter_a":"Too little too late Jack","post_message":"The decision not to seek prosecution of Hillary Clinton is plain wrong. I have joined several of my colleagues to do something about it."}]
