[{"comment_id":"1064573833613565","commenter_b":"So much hate is was fuels the violence like what happened in Orlando .for all that keep on with with Muslim need to die why hide your face if your so though to say thoughts words only cowers hide behind masks .....","commenter_a":"Gun control does not work and this is proof","post_message":"The FBI, Orlando Police and officials gave an update on the Pulse terror attack. Here's the latest: @webpagelink"},{"comment_id":"10156568887000725","commenter_b":"@username STOP dreaming about Hillary, she's bad news, and will never get elected...thief, lier, does NOT care about the American people, WAKE UP !! TRUMP, 2016...","commenter_a":"Today - One Year from Today - Donald Trump will be in his second day in the White House as POTUS and the Obamacare bill will be burning in a barrel on the south lawn.","post_message":"Donald Trump 1st Republican Presidential Candidate to Beat the Iowa Bureaucracy and Figure Out How to Easily Access Caucus Locations. #Trump2016"},{"comment_id":"1245886292171089","commenter_b":"@username me too","commenter_a":"Maybe they were afraid the non-white people were not going to use the proper restroom for the gender on their birth certificate. Hey, do we have to bring our birth certificates along if we visit your fine state so we can pee? Oh, nevermind, I forgot...NO ONE IS GOING THERE, so we don't need to know! As long as you have McCrory as your governor, you best get used to this kind of thing happening. (Note: this bit of sarcasm was aimed at this Nightclub, not the City of Charlotte. Charlotte is the city that passed an ordinance on Anti-Discrimination to protect the LBGTQ community, which lead to the stupid HB2 being passed by the state legislature. Too bad Charlotte suffers along with the rest of the State for trying to be open and fair.)","post_message":"This is an outrage."},{"comment_id":"1357029221003198","commenter_b":"Some more cry babies who need their blankie and bottle and their safety pin get over it!!!! God BLESS AMERICA AND GOD BLESS PRESIDENT TRUMP!!!!","commenter_a":"Like the cops dont have better things to do! Should arrest the little bitch \"barista\"!","post_message":"The anti-Trump movement enters Starbucks.  @webpagelink"},{"comment_id":"10153762499342483","commenter_b":"@username but she taking millions of dollars from terrorist country and support Obama funding Iran and terrorist","commenter_a":"Why would anyone vote for lying Hillary","post_message":"Forecasters give Hillary Clinton a big chance to win, noting that the odds of her losing the race are about the same as an NFL kicker missing a field goal from the 20-yard line."},{"comment_id":"10155222561152316","commenter_b":"Can you prove she rigged the election?","commenter_a":"Killary is our threat not TRUMP. Why wasn't she arrested for rigging the election? Yall are not covering her criminal acts, are you ?","post_message":"Republican presidential nominee Donald Trump is asserting that countries like France that he says are compromised by terrorism may be subjected to the \"extreme vetting\" he proposes as a deterrent to attacks in the U.S."},{"comment_id":"562921477245254","commenter_b":"I'm so sick of that self-righteous hateful woman.","commenter_a":"Are we surprised? She's just reminding us all what a thin skinned vindictive man Trump is.","post_message":"That didn't take long. Not even a week has passed, and the president elect's team is already warning Trump critics to be \"careful\" about the way they criticize Trump."}]
