[{"comment_id":"10153378846018037","commenter_b":"Exactly!","commenter_a":"KXAN - you love to get a good argument going, don't you?","post_message":"Did the grand jury make the right decision?"},{"comment_id":"10153754092626051","commenter_b":"Suck it up bitches!","commenter_a":"Why don't we buy them cars and houses, too? (shakes head sadly)","post_message":"California is moving forward with a bill to grant undocumented immigrants access to Obamacare. Are you for or against the move?"},{"comment_id":"10153454938709330","commenter_b":"R.I.P","commenter_a":"Just heartbreaking ... Your with your mom...Rest in Gods Grace and Peace.","post_message":"Sad news to report. Bobbi Kristina Brown, daughter of Whitney Houston and Bobby Brown, dies at 22.  More here ---> @webpagelink"},{"comment_id":"10153649045287994","commenter_b":"People are so dumb... That's all...","commenter_a":"Is a phone really worth your life","post_message":"A man was killed at Cedar Point when he entered a restricted area to look for his cell phone."},{"comment_id":"10153177685071800","commenter_b":"Lol all these super women who, according to themselves, work so much harder.... Men work more hours, more dangerous jobs. Statistics are a bitch. The pay gap is a myth. Plain, simple. Even a feminist can see it. But yall keep pretending. Keep that victim thing going.","commenter_a":"People. It takes literally five minutes or less to find a credible publication explaining exactly what the wage gap is, and it really isn't anything in fact. It's just kind of inherently flawed, it is NOT based on men / women doing the same work but rather every man's wage and every woman's wage for EVERY FULL TIME JOB PERIOD, from waitress to business executive. It doesn't mean men are paid more automatically for being men, it just means men are generally getting the higher paying jobs (which there are legitimate sociological reasons for), OR men are more willing to do dirty / dangerous jobs that women are generally unwilling to do. So assuming of ten... Oh I don't know, sewer workers making 20 dollars an hour , eight are men and two are women, and of ten store clerks making 13 dollars an hour , eight are women and ...","post_message":"Jon: You're telling me we're going to print a human heart out of a Xerox machine before women get pay equality? Kristen Schaal: I'm telling you we're going to print human hearts out of Xerox machines 30 years before women get pay equality!    ► Jon and Kristen Schaal discuss the gender pay gap: @webpagelink"},{"comment_id":"1069087446447636","commenter_b":"Put her on the street .","commenter_a":"She looks flashy","post_message":"The liberal media loved Michelle Obama's tang SOTU dress.  Take a guess at how much it cost."},{"comment_id":"10152841390816491","commenter_b":"Men wouldn't would they!!!","commenter_a":"What the hell? Who cares? I mean honestly. Who the hell cares?","post_message":"“Every ounce of milk I’m able to produce for my child is nothing short of a miracle and to watch that milk be thrown away without any regard for my baby was heartbreaking.”"}]
