[{"comment_id":"981168698591584","commenter_b":"Wow! That's insane.","commenter_a":"They have been","post_message":"Tel Aviv says the Israeli military must have a freer hand to shoot young Palestinian stone-throwers."},{"comment_id":"10156260216170725","commenter_b":"Michele the only thing dirty here is your pussy","commenter_a":"The media is always unfair to you @username but we are supporting you and what you will do for this country!!! Make Amerca Great Again in 2016!!!","post_message":"After a great evening and packed auditorium in Iowa, I am now in Colorado looking forward to what I am sure will be a very unfair #GOPdebate!"},{"comment_id":"1662896673932550","commenter_b":"Her mom's argument is invalid, he's black, cops would have shot him anyway and by the time they got their clerk would be dead too, good job armed guy! (Y)","commenter_a":"Boo hoo my thug piece of shit waste of air got shot. She wanted him in jail so she didn't have to feed his useless ass.","post_message":"Normally, I would be on the side of the shooter in most cases, but this...?...  @webpagelink"},{"comment_id":"10153277275566336","commenter_b":"Thugs!!! This has got to stop!","commenter_a":"Breaks my heart!","post_message":"Omaha, Nebraska police officer Kerrie Orozco was killed in a shootout a day before she was scheduled to go on maternity leave."},{"comment_id":"1619982001628404","commenter_b":"HILLARY WILL BRING MORE OF THESE TERRORISTS INTO THE UNITED STATES !!!!! SHE MUST BE STOPPED !!","commenter_a":"Who would predict that...lol...: @webpagelink","post_message":"Hillary Clinton's weakness while she was Secretary of State, has emboldened terrorists all over the world to attack the U.S., even on our own soil. They are hoping and praying that Hillary Clinton becomes President - so that they can continue their savagery and murder."},{"comment_id":"10153521877313822","commenter_b":"That skank!","commenter_a":"She has an incredible voice.","post_message":"JUST IN: The NFL announces that Lady Gaga will perform the National Anthem at Super Bowl 50.    SUPER BOWL COVERAGE: @webpagelink  What do you think of the choice?   (Gareth Cattermole/ Getty Images)"},{"comment_id":"10153401880031336","commenter_b":"Way to show tolerance","commenter_a":"pft just toss it in the garbage with all the other religious hog wash biblical nonsense!","post_message":"Police have recovered a relic believed by some to be the Holy Grail – the cup Christ drank from at the Last Supper."}]
