[{"comment_id":"10154034099273855","commenter_b":"I can't say anything to them they haven't already been told. I simply want to send them all a HUGE middle finger and kick in the ass!","commenter_a":"The sad face of intersectionality.","post_message":"Yes, Virginia, there ARE out Republicans."},{"comment_id":"1711501568866157","commenter_b":"Another fool... how many Muslims are you taking home?","commenter_a":"More than half of the damn country is colluding to get rid of his incompetent dumb ass! On the other hand he doesn't even need to be investigated for colluding with Russia!!!","post_message":"Donald Trump's administration is to charge Barack Obama with treason for colluding with the Deep State to overthrow The President."},{"comment_id":"10153068133586135","commenter_b":"Nope kids do not belong at wedding receptions! Especially with the cost of plates being so expensive!","commenter_a":"Can't stand the non-kid weddings. Just bring them. HA!!","post_message":"After their babysitter cancelled, Jessica Baker and her husband didn't attend the wedding because kids weren't invited. A couple weeks later, they received a bill for $75.90 in the mail to cover the meals they would've eaten at the reception."},{"comment_id":"10150808006769999","commenter_b":"Minority women...","commenter_a":"i get the point about not many women in software engineering.. but, minorities? umm..just looking around my office floor right now, all i see are minorities (asians and south asians)","post_message":"Why do so few women and minorities work in software engineering? We’re discussing reasons for the gap and what can be done to improve it.  Join filmmaker Robin Hauser Reynolds, whose new documentary, “Code,” explores the issue; Nick Rockwell, CTO at The New York Times; Minerva Tantoco, CTO for New York City; Myrna Soto, Senior Vice President Global Chief Information Security Officer at Comcast; and Jazmine Hughes, Associate Editor at The New York Times. If you have questions, leave them in the comments.  For the second half of this live stream, click here: @webpagelink"},{"comment_id":"10153647642558352","commenter_b":"She's the other woman, this is why women need to stop claiming men until they put a ring on it and claim you","commenter_a":"Sad","post_message":"GIRLFRIEND FINDS OUT ON SOCIAL MEDIA HER SUPERSTAR SOCCER PLAYER BOYFRIEND MARRIED ANOTHER WOMAN RIGHT AFTER SHE DROPPED HIM OFF AT THE AIRPORT (PHOTOS)  This is real bad!"},{"comment_id":"1134174459956481","commenter_b":"Put her in jail for contempt of court","commenter_a":"This trash needs to leave, NOW!!!","post_message":"Muslim Woman Refuses To Take Off Head Scarf In Court, So No-Nonsense Judge Does THIS In our country you have to follow the laws of our court. If not,  suffer the consequences. Do you support this no-nonsense judge?"},{"comment_id":"10153503601036770","commenter_b":"BLM? not at all! worthless savage racists. if they think that their worthless lives matter then go into the dangerous crime ridden ghettos created by blacks and convince them to stop killing each other. I would rather give black thugs target practice so that they don't hit innocent bystanders when trying to shoot each other.","commenter_a":"SCREW BLM...","post_message":"A controversy has erupted at Dartmouth College after a pro-police display was torn down by Black Lives Matter activists, who denounced it for memorializing the \"perpetrators\" of \"state violence.\""}]
