[{"comment_id":"10153366334404024","commenter_b":"I don't trust anything that Obama says or does.","commenter_a":"Get him for war crimes.","post_message":"Doctors Without Borders Rejects Obama’s Apology: Demand Investigation Into What It Said Was An Alleged “War Crime” @webpagelink"},{"comment_id":"10154980169065789","commenter_b":"@username poor little bitch, guess what trumps your president now ! Lol","commenter_a":"He's accomplished so much in such a short period of time, compared to the last administration. So thankful we have someone who will strengthen our nation and our military. God bless you President Trump!!","post_message":"Donald Trump has been in the White House for 13 days. Do you like or dislike what you've seen from his administration so far?"},{"comment_id":"10153938458440695","commenter_b":"Go home Barbara. You're drunk.","commenter_a":"We're checking on the condition of the other child injured in the crash for the Channel 2 Action News Nightbeat at 11.","post_message":"HEARTBREAKING: Police say a 12-year-old critically injured in a crash on I-285 today has died. Please keep her family in your thoughts and hug your loved ones tight tonight. @webpagelink"},{"comment_id":"1736119296633923","commenter_b":"SURE --- IF THEY PAY BACK ALL THE WELFARE AND ABORTIONS WE'VE PAID FOR FIRST --- ------ GET A FREAKING JOB.","commenter_a":"I have never believed in Slavery and have not supported anyone who did. In fact I believe we fought a war and won to free anyone who was inslaved. And Blacks are not the only people that others use as slaves, there is still human trafficing going on and woman that are used as sex slaves... Get over the past as none of us alive can be responsible for what people before us did except not let it happen again.","post_message":"Bernie Sanders Apologizes For Slavery, Demands We Compensate African Americans He can use his own money for that. Will you compensate African Americans for slavery?"},{"comment_id":"10153666209640399","commenter_b":"Fire her!","commenter_a":"I've always liked Debbie, and had a lot of respect for her, but if this thing has legs, it could spell big trouble. There is enough dishonesty in Republican Ranks, we don't need any in Progressive Ranks. We all need to watch this carefully.","post_message":"Debbie Wasserman Schultz said the DNC needed to suspend access until they can be sure that the information hasn't been \"manipulated.\""},{"comment_id":"590455354461864","commenter_b":"FEELTHEBERN AMERICA ! With occupy we had no leader ! Now with the peoples political REVOLUTION we have Bernie Sanders ! Look out corporations were coming to take our government back , your trickle-down has trickled out !","commenter_a":"He one ONE more delegate in MI and LOST by 20 in MS! That is not a win!","post_message":"WOW!"},{"comment_id":"10154265505298188","commenter_b":"Ugly woman???","commenter_a":"Ugly jacket!","post_message":"The hypocrisy of these progressives is beyond shocking."}]
