[{"comment_id":"10154879190478812","commenter_b":"Shoot back you spineless worms","commenter_a":"That's a lie. Yemenies love USA soooooooooooo much","post_message":"Two missiles fired at U.S. Navy guided missile destroyer USS Mason in international waters off the coast of Yemen on Sunday, according to the Pentagon."},{"comment_id":"10154793363900575","commenter_b":"Fucking right a wall","commenter_a":"You have a wall? Why you so upset ?","post_message":"THE WALL JUST GOT 10 FEET TALLER..."},{"comment_id":"401829593338668","commenter_b":"How very sad to read this. Our vets are not being taken care of properly and it is a shame. The President cared more for illegals then he does our veterans. Shame, shame.","commenter_a":"Semper Fi marine R I P","post_message":"RIP Marine..."},{"comment_id":"1151519384914815","commenter_b":"Bol bitch deserved it","commenter_a":"Mykel Connors","post_message":"Chick knocks out an old lady on a bus!  #WSHH"},{"comment_id":"10154212521629087","commenter_b":"The best present she could give America would either be a full confession of her crimes or better yet, get a pistol, load it, put it in her mouth and pull the fucking trigger.","commenter_a":"I believe it was the other way around. Liberal loons twisting facts to make it look good for them. Lol. Happy birthday Hillary! The best present you can offer to the American people would be to quit! :) #NeverHillary!","post_message":"\"Can we call Megyn Kelly’s total obliteration of Newt Gingrich on live television the kick off to Hillary Clinton’s 69th birthday celebration?\""},{"comment_id":"10153419994402426","commenter_b":"Because it is one agency that makes money, not cost the tax payers to operate.","commenter_a":"Theyre smart. When people are snowed in, they drink.","post_message":"Is Virginia sending a mixed message?"},{"comment_id":"10154640595946337","commenter_b":"It's all bullshit anyways..","commenter_a":"Must be nice to be rich and privileged! If I were to protest while on the job I would .get fired. Not all white people are rich and privileged.","post_message":"The Kansas City Chiefs stood with their arms intertwined as the anthem played."}]
