[{"comment_id":"10155327246350354","commenter_b":"Why in the hell would we care if illegals' feelings are hurt by AMERICANS FLYING OUR AMERICAN FLAG. IF THIS HURTS YOU, GET THE HELL OUT OF MY COUNTRY. YOU ARE ILLEGAL !!! That means you don't belong here !!!!!","commenter_a":"If these Students get public support it needs to be rescinded.","post_message":"Just when you thought this story couldn't get any more infuriating..."},{"comment_id":"642467755916056","commenter_b":"@username # F*ck Hillary","commenter_a":"Clinton the queen of Benghazi and hidden e-mails. Just look at the media. They are piling on Trump while giving Hillary a pass. The debates are still too come. There is a long way to go. Hillary is a sociopathic liar and should never be president. @username and the polls mean nothing right now.","post_message":"Hillary Clinton opened up a 15-point margin over Donald J. Trump in one of the polls."},{"comment_id":"980020968705428","commenter_b":"It's been a long time coming. Let's make this happen so our daughters and granddaughters are free from the harassment that we were told to \"just deal with it\".","commenter_a":"We need something like this! Jasmyne","post_message":"The video is intense, but its message is so needed. - Parker Marie Molloy"},{"comment_id":"10153205553056782","commenter_b":"@username...the difference is that I am a legal United States Citizen and the illegal criminal is not. They broke the law so that makes them a criminal..and as for pushing...the illegals are the ones that are not going to like the results.. You come to the U.S. legally and you are welcome with open arms. Illegals come here by breaking the law and then refuse to learn English and then demand they be given the same rights as American citizens and for things to be changed to fit them...BS!!!!","commenter_a":"This is complete BS!!! They are illegals!! NOT undocumented.... In Oklahoma you have to prove you are here LEGALLY, not an illegal criminal to get an Oklahoma ID or DL. Sign up for a DL as an illegal and get deported.","post_message":"An Oklahoma City grassroots effort to get undocumented immigrants drivers licenses is gaining momentum."},{"comment_id":"10153863012497042","commenter_b":"Stfu pussy","commenter_a":"Well, The Knicks Can't Hit A Shot, But I Guess Shots Can Hit Them...","post_message":"BREAKING: New York Knicks player Cleanthony Early was held up at gunpoint and shot in Queens just hours ago, NYPD says."},{"comment_id":"942000482502078","commenter_b":"Celebrities = whores. Whatever pays the bills","commenter_a":"(And yet he keeps playing bond...?)","post_message":"Wow."},{"comment_id":"10152633154612452","commenter_b":"You do know I meant loving","commenter_a":"@username living all the comments. Brian Williams lol","post_message":"DRAMATIC PHOTOS: Two police officers were able to save a woman trapped in a sinking BMW after smashing the vehicle's rear windshield. @webpagelink"}]
