[{"comment_id":"1313767168664034","commenter_b":"Just a bunch of self absorbed leftist lesbians.","commenter_a":"Just say there prayin see what happens","post_message":"Wait...so the WNBA is still a thing??"},{"comment_id":"10153716144117577","commenter_b":"Your talking bullshit.","commenter_a":"I am an athiest so it's all bullshit to me anyway ... but you god nuts hate the pope because he is too close to what (if he did exist) christ would have been like .. do you not remember the part in the bible where jesus said \"there is more chance of a camel passing through the eye of a needle than a rich man getting into heavn\"? .. what about his whole ghandi/ john lennon peaceful hippiness .. \"let he who is without sin cast the first stone? .. and what about how jesus spent a lot of time hanging out with the poor, sick and prostitutes .. and he fed them and helped them .., some of you extreme conservative \"christian\" extremist terrorist CUNTS should actually read your bibles once in a while ... O and by the way ... if you are a good \"christian\" why ...","post_message":"Pope Francis has strong ties to socialism and even communism and is helping to destroy the faith of the Catholic Church from within, as Infowars journalist Kit Daniels explains."},{"comment_id":"10153283527870950","commenter_b":"This BITCH makes me sick","commenter_a":"She should be treated as she treated this poor child.","post_message":"The 11-year-old girl's cousin told investigators that the young girl had a medical condition that caused her to lose control of her bladder and bowels. A family friend said the woman was upset that her daughter had the condition, and liked to keep the house spotless with bleach."},{"comment_id":"10156032956110500","commenter_b":"I got pulled over last night for four miles an hour over the speed limit and my license plate light out. I was courteous to the officer and he to me. In the end I simply got a warning from and a thank you for my courtesy towards him. I told him thanks for only a warning and for letting me know the light was out cuz I really didn't know it was. Common decency goes a long way. That woman is lucky she didn't get taken to jail for the speeding infraction. Hope she tries to challenge the ticket in court and that video gets played","commenter_a":"think she was black is what I think","post_message":"SAY WHAT? You might find it hard to believe what a driver said to a Palm Beach County Sheriff's Office deputy.  WATCH VIDEO-> 8.wfla.com/1FylO8y  What do you think of the woman's comment to the deputy?"},{"comment_id":"1134902403269479","commenter_b":"If they think it's so needed, why hasn't it been in place to stop rape before?","commenter_a":".","post_message":"Things just got seriously DANGEROUS for trans students in North Carolina..."},{"comment_id":"10154113431396037","commenter_b":"Wolves in sheep's clothing","commenter_a":"...sickos for 'god'...","post_message":"The Christian Prayer Center website not only charged consumers $9 to $35 for prayers but also \"deliberately\" confused some consumers into signing up for recurring monthly payments, according to authorities."},{"comment_id":"10155119419651320","commenter_b":"Looks pumping","commenter_a":"THE ISSUE IS NOOOOTTTTT MUSLIM!!!!!","post_message":"Democrats hold an anti-Trump protest in Washington D.C."}]
