[{"comment_id":"1173415112684267","commenter_b":"Society is being destroyed by this abomination! Gay lifestyle brought the AIDS virus, now innocent woman and children are dying because of promiscuity, bisexual acts, and gay relationships! Sin has deadly consequences that all in society pay the price for! That's why Rian!","commenter_a":"I agreed ban same sex marriages.","post_message":""},{"comment_id":"10156410898495725","commenter_b":"@username he does not have to insult Hillary's looks. She does a good job of insulting herself.","commenter_a":"I would love to watch Donald Trump debate Hillary Clinton! He will tear her a new one!","post_message":"The last person Hillary Clinton wants to run against - is Trump! I will be her worst nightmare! #Trump2016"},{"comment_id":"10153747990651178","commenter_b":"He right she butt ugly","commenter_a":"Trump all the way.","post_message":"Which corner are you in? Fiorina or Trump?"},{"comment_id":"1023434111010933","commenter_b":"someone can't read the headline in the article lolol","commenter_a":"Stop blaming anti vaccers, we are the ones smart enough not to inject ourself or others with the disease.","post_message":"Way to go, anti-vaxxers."},{"comment_id":"1440023386030632","commenter_b":"Amen","commenter_a":"It's really a fresh wind","post_message":"Find out why Judea and Samaria leaders say, 'a new wind is blowing from the US.'"},{"comment_id":"10153248022411336","commenter_b":"John V Salazar","commenter_a":"We had a similar issue at a university I worked at years ago. The guy was just a creepy freak but he cried \"academic freedom\" and got away with showing porn in a music class and \"relating it to music\". Oddly enough, once he FINALLY retired, the class was discontinued as it had no value. There are times academic freedom goes too far and yet that is the basic premise of any university and with tenured faculty your hands are tied if they \"justify\" it.","post_message":"Parents, what do you think of this? A professor at UC San Diego is reportedly asking students to be naked to pass the final exam."},{"comment_id":"1021163441238000","commenter_b":"The next deaf girl I encounter will hear me cumming","commenter_a":"Lucy Truelove","post_message":""}]
