[{"comment_id":"10152575387122217","commenter_b":"It should be illegal to sell cigarettes to pregnant women!!","commenter_a":"I think women who smoke during pregnancy are just selfish vile people. ..thinking of themselves and not there babys health....it should be illegal to smoke while pregnant !","post_message":"Should pregnant women be paid to give up smoking?"},{"comment_id":"10153377527143984","commenter_b":"Are some people just figuring out she's a LIAR and always will be!","commenter_a":"People need to wake up & research the person they are going to vote for....She is hiding so many things....","post_message":"Supporters of Hillary Clinton are reconsidering their choice for president after learning some stunning facts.   Are you glad to see Clinton's hypocrisy exposed?"},{"comment_id":"1134932883194388","commenter_b":"down, look at the squares on the sides","commenter_a":"I think up it is hard to say!!","post_message":"o.O"},{"comment_id":"10154979828776729","commenter_b":"Is a mean evil witch all she wants to do is kill us Americans in line her Pockets with more money how can she even be running for president? What is this country turned into?","commenter_a":"Bet she has an allergic reaction tonight !","post_message":"Holy cow!"},{"comment_id":"1134738373236015","commenter_b":"Actually female secretions do have some nutritional value. And ok, and maybe you should suck some more dick.","commenter_a":"Ha! Says a study funded by the patriarchy and trying to get women to scientifically be cool with swallowing men's Semen. If you're gonna be anti media, don't be pro patriarchy. It's all a part of the same machine. It's all part of the same manipulation. Fuck the patriarchy.","post_message":"And now you know..."},{"comment_id":"572505492946269","commenter_b":"If we could just get a forty hour work week and more than minimum wage so we dont have to work 2 or 3 jobs, life would be a little easier. But the government keeps bringing in illegals and sending our jobs to other countries and we cannot get away from living paycheck to paycheck. It is disguting that the most advanced country makes it citizens live like this. We know it is to control the population.","commenter_a":"Well Hillary is done if she does not win. Without her the path to a 2020 boderless world is stopped dead in it's place. Why oh Why do you think both the Republican and Democratic Party and all the World Cartel Leaders have done everything they can to get rid of Trump for a year? Jeb Bush, the heir apparent is a globalist and so is Hillary. So were the past 5 presidents. With both Jeb and Hillary running, it did not matter who won, the road to globalization was on tract. Enter Trump! Boy did he screw up their plans! No matter what they tried he did not go away! No globalization of America for him! Now as their last hoorah, most all of the newspapers have come out for Hillary and are printing every lie they can about Trump. It is only going to get worse the closer ...","post_message":"This is crucial progress in the push for better workplace policies."},{"comment_id":"853456421380774","commenter_b":"She can only be arrested if she goes to Egypt so best she stays away . But good she speaks out","commenter_a":"Good","post_message":"Clooney’s wife threatened with arrest."}]
