[{"comment_id":"575919325907618","commenter_b":"She still does this stuff","commenter_a":"I am with hillary Clinton. All the way.","post_message":"Share if you’re ready to make history."},{"comment_id":"10155598100226002","commenter_b":"Something white people started, after having intercourse with monkeys they would die from AIDS. Mosquitos was a bacteria form from their deceased corpes.","commenter_a":"Hmmmn,what's the next thing that will be killing us...SLEEP???????Always fear mongering and hysteria..","post_message":"Known to health experts as the most deadly animal on the planet, the minuscule mosquito, with its dreaded whine, is responsible for millions of deaths from multiple diseases each year."},{"comment_id":"10152737995296519","commenter_b":"Whore's goal. A quick happy ending, get the john outta there.","commenter_a":"Yep and when you have it down real well, men cum in one minute instead of two.....grrreeeaaaatt.","post_message":"\"Those who master it walk away armed with strong sexual skillsets, and even stronger vaginas\""},{"comment_id":"10153049947289170","commenter_b":"From the info I have seen, they have entire areas that could just be surrounded and taken out......all those \"unsafe for non-muslims to enter\" areas......","commenter_a":"At least someone in power will acknowledge these Muslim terrorists need to be taken out! The problem is they have almost completely taken over France at this point. Apparently France has over 750 No-Go zones in which only Muslims are allowed to live and travel in these territories. Sadly the govern has let them take over like this.","post_message":"I guess this was some reality check."},{"comment_id":"919963074724525","commenter_b":"It's not burning fast enough.hope they got all there goats out.would be a shame to lose what use to be there virgins","commenter_a":"probably after insurance so they can buy more guns???????????","post_message":"Taking bets...accident or on purpose? Was this an 'act of God'? What do you think?"},{"comment_id":"1038558619518329","commenter_b":"How many more *illegal* guns are gonna kill people before you relize that if these people want guns, they'll get 'em... Illegal or not... #howmany","commenter_a":"There goes a wasted minute that I'll never get back.","post_message":"This video is packed with more celebrities than we could count — and they have one powerful message for the world."},{"comment_id":"10154534701938271","commenter_b":"Those seven countries on which the president issued the TEMPORARY ban weren’t picked out by him. They were picked in 2015 and 2016… by the Obama administration. Trump doesn’t even list those nations specifically in his executive order, he simply lists that he’s banning those nations named in the Terrorist Travel Prevention Act of 2015. ---> @webpagelink Trump’s TEMPORARY order specifically states that only refugees from 7 countries with ISIS controlled regions. (Syria, Iraq, Iran, Libya, Somalia, Sudan, and Yemen) ONLY AFFECT 12% OF THE WORLD’S MUSLIM POPULATION","commenter_a":"President Obama issued an order similar to President Trump’s in 2011 in response to a discovery that a known terrorist had entered the United States via the nation’s refugee program. It seems that much of the country’s forgotten about that, though even President Obama, himself, apparently.","post_message":"Obama's statement said he is \"heartened\" by citizens' civic engagement, but reiterated that policies should not discriminate against people based on religion."}]
