[{"comment_id":"882254358503349","commenter_b":"My child would be instantly removed!","commenter_a":"Yes it would and yet silence from the sooo offended group.","post_message":"ISLAMIZATION: LA Public School: Teaching Kids  Is The One True God (VIDEO)  @webpagelink"},{"comment_id":"10153279094626051","commenter_b":"Get her out of there before she does any more damage.","commenter_a":"Kim Davis is where she belongs for disobeying the LAW.","post_message":"Hillary Clinton says Kim Davis belongs in jail. Do you agree or disagree with her?"},{"comment_id":"10153851389446955","commenter_b":"@username this guy Julio & Cruz are dangerous crazy nuts that do not understand our European culture & they are racist loonies. BUILD the WALL. Go TRUMP 2016. lol","commenter_a":"Little Jebbie & Cruz is a LIAR & I want to watch sue the crap out of him, maybe Cruz can get another Goldman Sachs loan to pay the damages.","post_message":"FRUSTRATED JEB: 'I Should Stop Campaigning Maybe'..."},{"comment_id":"10155234645559199","commenter_b":"Kerri Andreson","commenter_a":"Janie Marsh","post_message":"A man in his 30s drowned at the Wild Waves theme park in Federal Way."},{"comment_id":"10155483281175231","commenter_b":"They tried to walk out and no is her business she can't just do whatever she want she pulled a gun on to people what was right about that. Just suppose they had weapons you do know the 2nd amendment applies to all citizens and they feared for their lives and shot the stupid white bicth. How ignorant","commenter_a":"her joint she can say and do what she likes......whatever...I would have just walked out..who cares","post_message":"Things reportedly turned into a scene out of Pulp Fiction."},{"comment_id":"957758620983859","commenter_b":"I don't mean to sound rude on the subject but I'm soooo tired of women having kids (multiple times) and complaining about life is so hard for them. Like honestly, if you wanna take cum and get pregnant maybe you should think before just doing","commenter_a":"If you have kids you deserve the struggle. Don't have kids until you feel ready or accomplished enough to bring a new life into the world. If you have kids before the age of 21 then you are a complete idiot and shouldn't get help from anyone cause stupidity isn't worth saving","post_message":"Great point!"},{"comment_id":"10152912093186749","commenter_b":"PUKE.","commenter_a":"PUKE","post_message":"This Valentine's Day, Nicholas and Dylan are finally able to celebrate their legal marriage. This is progress. @webpagelink"}]
