[{"comment_id":"682882035184939","commenter_b":"Until the war against christians ends. All countries should carefully screen all imigrants. Period","commenter_a":"Yes absolutely!","post_message":"Our children's future is at stake! YOU DECIDE!"},{"comment_id":"10153802137316130","commenter_b":"It's almost always a woman too","commenter_a":"How romantic to threaten to blow up a plane full of passengers for your ex-wife.","post_message":"An Egyptian plane was hijacked, and several passengers were held hostage."},{"comment_id":"1148491358514249","commenter_b":"She would not make a good POTUS. She ran HP into the ground.","commenter_a":"I have thought the same thing about Carly Fiorina. I like her and believe technically she might make a good president. But she has a \"look\" about her, not about beauty or sexiness, but a look like she's been hurt badly sometime in her life and is going to have a nervous breakdown at any minute. Leadership also relies heavily on appearance and Ms. Fiorina's \"look\" just isn't motivational. It's almost all about appearance...when is the last time you've seen a multi-million dollar preacher that looks like he/she just lost their puppy? This country is going to need vitality to rebuild itself and she does not project that; FDR would not be photographed in his wheelchair and people still talk about Jimmy Carter's preacher look. We need and I haven't seen anyone that \"appears\" to resemble him, except maybe Sen. Marco Rubio, and only somewhat, a JFK.","post_message":"Trump was watching a newscast when a video clip zoomed in on rival Republican 2016 candidate Carly Fiorina. \"Look at that face! Would anyone vote for that?\"said Trump."},{"comment_id":"10153340551136336","commenter_b":"I don't believed this syory","commenter_a":"If this is true, Airlines are about as out of control as the cops and tsa themselves are.","post_message":"“You wouldn’t want to watch your family member crawl onto a plane, I mean come on, this is America.”  Theresa Purcell said the American Airlines gate agent made her crawl because it was too late to set up a ramp for her to board."},{"comment_id":"1862910250609136","commenter_b":"Girl bye, take your dirty mouth with you","commenter_a":"Go to Gitmo you A hole!","post_message":"Lol. Celebs can't even."},{"comment_id":"1228973160510939","commenter_b":"Typical liberal lesbian! Walking around with blinders on and not reporting the facts.","commenter_a":"She is the problem and needs to shut her mouth people like her have divided this country so much so sad they let her use what is suppose to be a bias platform to put out all this hate","post_message":"Run for Your Lives! Rachel Maddow is now warning that Donald Trump will definitely round up people and jail political opponents.  Meanwhile, you are accused of being a \"fear monger.\""},{"comment_id":"10154102515036409","commenter_b":"She knows how to promote something unreal as real!","commenter_a":"Yes! Prepare to have big business be hit with a steel chair! Bring Main St back to America!","post_message":""}]
