[{"comment_id":"1159279537467495","commenter_b":"The Obama 's are more racist then anyone else Michelle everytime she opens her racist mouth it's all about her give me a break and it's true the other 1st ladies have more class then she will ever have and it has nothing to do with the color of her skin if the whites are so racist he wouldn't have been in office","commenter_a":"I wish she has racism up her back side!!!","post_message":"Michelle Obama Calls Out Military Racism  This Marine Answer Is DEVASTATING!"},{"comment_id":"828484970520259","commenter_b":"What a stupid cow.","commenter_a":"A new low for commiecrats? Not so! The depths of their depravity know no bounds.","post_message":"A perfect example of the difference between Democrats and Republicans.  This is how they treat allies:"},{"comment_id":"10153961188184705","commenter_b":"Show us your Boob's lady.","commenter_a":"Hi from rio brasil","post_message":"Get an exclusive tour of the Mashable House at SXSW with Pete Cashmore."},{"comment_id":"10153458933961509","commenter_b":"Only if you let your wife ruin you financially","commenter_a":"Ambur Hearn","post_message":"How much a wedding costs in... → Chicago, IL: $50,934  → Columbus, OH: $26,245 → New York, NY: $76,328 Mapped: The Cost of Weddings, city-by-city @webpagelink w/ The Knot via CNNMoney"},{"comment_id":"10155050454914469","commenter_b":"White girl wasted","commenter_a":"I'm chocolate wasted","post_message":"BABY GIRAFFE WATCH: We are waiting for April to have her calf! Will it happen today? bit.ly/2l14Zin (Video via Animal Adventure Park)"},{"comment_id":"1033160160077065","commenter_b":"And why don't you keep your fat mouth shut?","commenter_a":"Divorce the fat pig and get Urself a nice slim lady!","post_message":"Wife won’t ler husband see her naked after pilling on 140lb"},{"comment_id":"10153110515583984","commenter_b":"I've seen out of work lesbian truck drivers. Moore looks MUCH worse.","commenter_a":"Is that Michael Moore in a Debbie Wasserman Schultz wig???","post_message":"I can't believe this radical feminist liberal would so gleefully mock and lie about a distinguished female veteran like this.  Do you support the Republican senator this woman belittled?"}]
