[{"comment_id":"1644623019109095","commenter_b":"Dear: Mr. trump; you have a nice fire burning for yourself, why open the damper and burn it out?","commenter_a":"Mr. Trump :If you truly believe in America, stop the hate talk: read, or have read to you, both the Constitution of these United States and the Declaration of Independence. My Uncles served in World War 2 to protect us from the Fascists (Dad had medical issues and couldn't serve in the military: worked for the government instead!) : by posting this, I'm hoping someone will connect the dots and know that's what you are!","post_message":"Statement on Preventing Muslim Immigration:"},{"comment_id":"915863931882175","commenter_b":"I think he should be raped until bleeds to death","commenter_a":"Let him go to prison and play with REAL BIG MEN","post_message":"Amanda awoke to find her baby was missing. She found her in the basement bleeding and unconscious. This man had raped the 9-month-old infant until she was brain dead. He was arrested and is in jail, but many people think he deserves a harsher punishment for his crimes. A new petition is calling for him to be hanged in public for his disgusting crime.   Should he be hanged?"},{"comment_id":"1406366476070873","commenter_b":"not a terrorist...a beautiful goddess.","commenter_a":"Isis Murda Spence :)","post_message":"\"Love your name. Cherish your name.\" Words of wisdom from a girl named Isis to others who share her moniker."},{"comment_id":"10154057367791600","commenter_b":"Exactlyyyyyyy","commenter_a":"My dogs would be out of there before me","post_message":"The cause of the early-morning fire is under investigation."},{"comment_id":"10153270822682061","commenter_b":"My neighbors steal them!","commenter_a":"I had a neighbor take mine. To prevent it from getting stolen. I'm glad I had neighbors watching out for me.","post_message":"WATCH: 'Bait packages' used to catch thieves stealing deliveries from front doors. What is being done to stop this from happening as we enter the holiday season: @webpagelink"},{"comment_id":"10153307893053352","commenter_b":"They both should quit. There should be a black woman on the panel discussion.","commenter_a":"Kelly your the best always classy","post_message":"Kelly Osbourne Threatens to Quit ‘Fashion Police’ Over Rancic’s Racist Remark on Friend Zendaya"},{"comment_id":"876368172456238","commenter_b":"You are so foolish. You must be a Hillary supporter? That nasty woman has direct ties with Monsanto. Do you realise that? She is one of the biggest crimals you could ever imagine. Put Google to good use and research just how evil Hillary really is.","commenter_a":"Amen!! Thats how you hurt a man with money right in his pocket. I had told myself i was not going watch nothing with his name on it.","post_message":"Kudos to NBC for doing what's right!  Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"}]
