[{"comment_id":"10153149110684877","commenter_b":"Yes, she should be arrested. This type of crap gets people killed.","commenter_a":"She deserves prison time.","post_message":"Woman claims she was attacked by black men, allegedly faked injuries with makeup. She TRIED it! You have to see the pics for yourself.   Grio fam, should authorities press charges if it's proven she faked her claims? Sound off below!"},{"comment_id":"507758516015518","commenter_b":"She is illegal","commenter_a":"@username 2016!!! LETS PUT THIS BEAUTIFUL LADY IN THE WHITE HOUSE!!!","post_message":"Very proud of our next First Lady Melania Trump! #MakeAmericaSafeAgain"},{"comment_id":"10152978726794342","commenter_b":"Yep that's some more B.S. All of the jobs that illegals are here taking were done by American citizens before you came. Your comment is without any truth whatsoever!!!","commenter_a":"All this jobs yall dnt do the hispanic race does !","post_message":""},{"comment_id":"1197370603617282","commenter_b":"Larissa Elliot","commenter_a":"Amy Batchelor","post_message":"An attempt to reproduce 100 psychology studies published in leading journals couldn't match the results in almost two thirds of cases."},{"comment_id":"10153265757247061","commenter_b":"No, he was too busy lighting our disgraced white house Christmas tree.","commenter_a":"If you have no interest in hearing President Obama, why comment? I'm sure he's not reading your negative comments. He's much too busy and has other more important things to focus on, unlike you, who clearly have too much time on your hands!","post_message":"BREAKING: President Barack Obama to address the nation from the Oval Office on Sunday night at 8pm ET, White House says. @webpagelink"},{"comment_id":"1440023386030632","commenter_b":"Amen","commenter_a":"It's really a fresh wind","post_message":"Find out why Judea and Samaria leaders say, 'a new wind is blowing from the US.'"},{"comment_id":"523635814493665","commenter_b":"Give the lady her job back, NOW!!!!!!","commenter_a":"Too bad- Boo Hoo Hoo","post_message":"A lunch lady was fired for serving pork to a Muslim student.  We are in America, give that poor lady her job back.  Do you agree Muslims have to Assimilate if they want to stay?"}]
