[{"comment_id":"10154633905401336","commenter_b":"LOL, Yahoo doesn't have that many accounts....is this a hoax for attention?","commenter_a":"Your World with Neil Cavuto----- You are talking to a brick wall today,","post_message":"Breaking News: Yahoo says at least 500 million accounts were hacked in 2014, and reportedly believes the culprit was a “state-sponsored actor.” @webpagelink"},{"comment_id":"10154710318354062","commenter_b":"GTFOH... U don't own this planet girl!! GOD knows no borders right Angie? Get off ur high horse! Stop looking down n help another up!!","commenter_a":"what part of ILLEGAL do people NOT get??? GO HOME!","post_message":"Dozens of protesters have gathered on the University of Houston campus in advance of tonight's debate. Live team coverage coming up at 6."},{"comment_id":"10153672228046130","commenter_b":"She's not plus size... She's average!!!!!","commenter_a":"How hilarious.","post_message":"A trailblazing move by Sports Illustrated Swimsuit."},{"comment_id":"963715427023908","commenter_b":"Thugs is a nice word for these fools...","commenter_a":"Disgusting!!","post_message":"SAVAGE THUGS DIG UP CONFEDERATE SOLDIER: Group Fed Up With Waiting Begin Digging Up Confederate General Grave (VIDEO)  NO RESPECT!   @webpagelink"},{"comment_id":"1033603779993966","commenter_b":"Please guys, read it again. \"The VIRUS'agrees that vaccines cause autism. Maybe vaccines cause stupism?","commenter_a":"Viruses are not to be trusted.","post_message":""},{"comment_id":"10153307893053352","commenter_b":"They both should quit. There should be a black woman on the panel discussion.","commenter_a":"Kelly your the best always classy","post_message":"Kelly Osbourne Threatens to Quit ‘Fashion Police’ Over Rancic’s Racist Remark on Friend Zendaya"},{"comment_id":"1189675974461986","commenter_b":"@username she will not loose","commenter_a":"The real problem is Bernie Sanders is NOT a democrat! No wonder he and democrats are having a problem. He should have run on his own party-- as the socialist he is.","post_message":"It's not just the Republican Party that seems to be having a problem uniting..."}]
