[{"comment_id":"1721110158153806","commenter_b":"I wanna see this dumb bitch fight off an intruder in her home with a vibrator","commenter_a":"Pedro Tosta K. Nogueira","post_message":"These students are protesting open-carry laws by handing out dildos.  #Micbrights"},{"comment_id":"10155618787016002","commenter_b":"Only if you are a pussy","commenter_a":"I thought dodge ball was thought to be bullying.....","post_message":"Note to self: Don't play dodgeball with softball pitchers."},{"comment_id":"543745795816000","commenter_b":"We need to start carrying bacon with us and when they disrespect an American Bitch slap them with the bacon.","commenter_a":"Yes,yes! Or send their butts back! We don't want them here!","post_message":"This Fox News reporter was absolutely disrespected by these Muslims.  They are out of control. If Muslims are going to live in our country they need to learn some manners.  Do you agree Muslims have to assimilate or get out?"},{"comment_id":"10152829725821051","commenter_b":"if she shop lifts why isn't' the bitch in jail","commenter_a":"You mean she isn't stealing now?","post_message":"This shoplifter has never had a job. She current lives in rent-free housing and receives monthly benefits. She says if her benefits aren't raised, she'll go back to stealing."},{"comment_id":"1566069946786462","commenter_b":"This will motivate her to lie and cheat more","commenter_a":"Yay!!","post_message":"IT'S HAPPENING..."},{"comment_id":"10153903202659641","commenter_b":"Suck one Ortiz","commenter_a":"All those who dont like Zuckerberg you are free to delete your facebook account","post_message":"Mark Zuckerberg isn't happy about what people have been writing on Facebook's chalkboards."},{"comment_id":"853953454653203","commenter_b":"Wow::hey woman-let go of her hair and fight,","commenter_a":"Can we please get the blurred trip screen out so we can actually see something?","post_message":"WILD AND VIOLENT BRAWL: An all-female fight goes down outside a gas station and the spectacle was captured on video. Kicking, punching, hair pulling. We can't make this stuff up."}]
