[{"comment_id":"10153483892683690","commenter_b":"Hello all indians! U stop nestle then stop modi too for supporting israel. Huh!","commenter_a":"Pay the bribe...","post_message":"The company insists \"Maggi noodles are completely safe and have been trusted in India for over 30 years\"  @webpagelink"},{"comment_id":"10154641793644614","commenter_b":"She's a freaking pig!","commenter_a":"Hope she rots in hell!","post_message":"The mother of Victoria Martens, the 10-year-old girl who police say was drugged, raped and killed, had allegedly used an online dating website to arrange for men to sexually assault her daughter in the past, according to a search warrant.   After her daughter was brutally killed, Martens told police that she watched her boyfriend, Fabian Gonzales, assault the little girl \"for sexual gratification,\" according to the criminal complaint.  (Warning: The below story contains graphic and disturbing content)"},{"comment_id":"10153265076161602","commenter_b":"They're asking for regulations--there is no compromise from the gun lobby.","commenter_a":"I think we can all agree that there are some people that should not have firearms. However, if you support the second amendment like I do, you need to be part of the solution. Because if we let those that are against the second amendment make the policies, what do you think will happen to 2A? Let's be proactive in this, not reactive.","post_message":"The families made it clear they are not associated with the non-profit Sandy Hook Promise."},{"comment_id":"10153181393497377","commenter_b":"Putin gives you a hard on? What's that say about you?","commenter_a":"Yah , They cant hide from the Russians is what he ment .","post_message":"Obama to ISIS Leaders: \"You Cannot Hide\""},{"comment_id":"906810012772083","commenter_b":"He hit that hoe!","commenter_a":"@username found it","post_message":"Chik-Fil-A Stays Lit!"},{"comment_id":"525207624325250","commenter_b":"Call girl wife! And not melania. Haha","commenter_a":"Can't wait! Donald has something huuuugggee. Haha lyin Ted. Spill the beans just before next primary voting!","post_message":"Ohhh boy....  You know about this, right?"},{"comment_id":"10154176687291337","commenter_b":"Good now the bitch dont have a job...now go get that unemployment check","commenter_a":"Freedom of speech, freedom of press, wwlcro American land of lies","post_message":"YIKES! Terrible move by this anchor..."}]
