[{"comment_id":"1788538208028189","commenter_b":"those look hellllllla good 😍😍😍","commenter_a":"@username LOL DUDE","post_message":"Insanely delicious."},{"comment_id":"10154557773663203","commenter_b":"Its like sayin that one is born an alcoholic or a chain smoker... It is a LEARNED action","commenter_a":"Uh...no, most Americans don't say that!","post_message":"Are gays ‘born that way’? Most Americans now say yes, but science says no"},{"comment_id":"890066024388849","commenter_b":"Our own government is gonna put us in a civil war to survive all this mess.....SOMEBODIES GOT to be making dirty money off all this illegal stuff going on....unbelievable","commenter_a":"Send all of them packing NOW.","post_message":"ILLEGAL TSUNAMI 2.0: 12,509 Illegal Kids Already Over Border In New Wave (VIDEO)  The next explosion of illegal teen border crossing is in full swing, but just one-in-six are being sent home, with most of the rest settled in the United States,...  @webpagelink"},{"comment_id":"798927580297819","commenter_b":"What a mouth","commenter_a":"Run those @ssholes out of the country...!!! Freedom of speech does not include burning our flag...!!!","post_message":"Protestors Start Burning American Flags, Immediately Receive Instant Justice From Patriotic Bikers [VIDEO]   Click the link below to watch the full video    @webpagelink/  SHARE this if you support these patriotic bikers!"},{"comment_id":"10156714822180354","commenter_b":"I'm with you Francesca ! Beyonce is just trash !","commenter_a":"That was beautiful and classy from Lady Gaga. I will NOT be watching trashy Beyonce.","post_message":"Lady Gaga's performance of the National Anthem at the #SuperBowl lights up social media.  WATCH:"},{"comment_id":"10154731295753145","commenter_b":"A lot of merchandise with the \"Trump\" name on it is lagging in sales. When the sales of anything is down, stores WILL drop them.","commenter_a":"Geez ppl grow the F up and quit crying, he is our president and what the USA needs the most is for all Americans to come together.....united as one!!! This country needs help our own people are starving let's feed them first.","post_message":"Just last week Nordstrom stopped selling Ivanka Trump fashion brand."},{"comment_id":"10153903226928797","commenter_b":"She Must Be Mentally insane","commenter_a":"Connie Reyes","post_message":"MOM HAS SHOCKING OUTBURST: The mother accused of killing her two young children and stuffing their bodies in a freezer has lashed out in court after losing her temper. What do you think? WARNING, details in this story are graphic and may be hard for some readers. Here's what mom said:"}]
