[{"comment_id":"10154496338258525","commenter_b":"Would love to see more of Bindi, Robert and Terri would love a show from the zoo. Steve will always be one of the greatest wildlife conservationist to have ever graced us with knowledge and just a fun loving man truly missed","commenter_a":"Crykie I miss him","post_message":"REMEMBERING STEVE IRWIN: His daughter, Bindi, who continues to walk in her father's footsteps, posted a touching tribute to The Crocodile Hunter on what would have been his 55th birthday. Rest in peace, Steve Irwin. \"Always in our hearts.\"  STORY: @webpagelink"},{"comment_id":"10154014226755329","commenter_b":"Wants it now","commenter_a":"Luis Lkns","post_message":"This is fact."},{"comment_id":"10152999247891037","commenter_b":"Women dont fight wars....","commenter_a":"If a woman has a bright future she has an option to abort the baby, men don't. Give Men equal rights!!!","post_message":"A new report out today from the Guttmacher Institute shows that 57% of women now live in a state considered to be hostile or extremely hostile to #abortion rights."},{"comment_id":"10153728692094117","commenter_b":"Lol pussy","commenter_a":"Reason can go fuck itself. If you are a pro-Trump libertarian, like my page.","post_message":"\"You know−the Constitution−there's nothing like it. But it doesn't necessarily give us the right to commit suicide, as a country, OK?\""},{"comment_id":"1364153086957478","commenter_b":"Let's hope NOT. NO MORE COMMON CORE! NO ON ROMNEY! KEEP your PROMISES!","commenter_a":"I agree.","post_message":"I wonder if Conway is behind the \"new\" Trump?  The whole \"lets leave Hillary alone\"... and \"lets talk to Mitt about being Sec of State\"... and \"lets hire a pro-common core Sec of Ed.\".....  It's getting harder to stay smiley faced.  We can only be pushed so far.  Enough of Mitt.  Dump him.  Give Rudy G. the job of Sec of State TOMORROW. Not only is he talented, but show some loyalty to the guy who stuck his neck out.  Stop making the man sweat it out, and start supporting the platform we voted for.  Walk the walk already.  @webpagelink"},{"comment_id":"489008974557030","commenter_b":"Our Government has NO IDEA of how many muslims (refugees, immigrants, migrants, legal or illegal) are Already in OUR country!!!!","commenter_a":"Trump","post_message":"Cheney:  think this whole notion that somehow we can just say no more Muslims, just ban a whole religion, goes against everything we stand for and believe in. Do you agree with Cheney or Trump on this issue?"},{"comment_id":"1237520902934076","commenter_b":"She's a criminal, with really bad hair.","commenter_a":"She did what she was hired to do.","post_message":"The American people deserve better. The DNC and Hillary Rotten Clinton rigged the system and completely ignored what the people wanted! They are so, SO corrupt!"}]
