[{"comment_id":"10154810175428812","commenter_b":"@username, sthu sodomite and go back where you illegally camd from before we deport you and your family.","commenter_a":"That deal needs to be voided. Why would the U.S.A provide this animals with more weapons? That is ridiculous,they are responsible for so many deaths of innocent people and some of those terrorists are amongst us her in the USA causing death and destruction.","post_message":"Senate expected to vote this week on a resolution to reject a pending arms sale from the U.S. to Saudi Arabia following reports of civilian casualties in Yemen at the hands of the Saudi-led coalition."},{"comment_id":"10153278165616336","commenter_b":"Put down the assault fork and nobody will get hurt!","commenter_a":"Ummm.. Say what fattie? You can't handle food ownership.","post_message":"\"Americans do not seem to be able to handle gun ownership in a way that permits maintenance of a civil society.\""},{"comment_id":"1141182859235076","commenter_b":"I only like woman","commenter_a":"Anyone on this thread that defends the confederate flag or the klan, please kill yourself and do not procreate.","post_message":"\"The Klan today is weak, poorly led, divided internally and without any political support\""},{"comment_id":"10152864782686336","commenter_b":"Musa, you're butt ugly!!","commenter_a":"Please disclose his identity so that these western pigs would stop blaming islam for all their atrocities.","post_message":"Breaking News: 1 of 3 suspects in Paris terror attack surrenders to police, French judicial official tells the Associated Press. @webpagelink"},{"comment_id":"10155827348030603","commenter_b":"Well if the driver is 18 then maby she should be brought up on man slaughter .","commenter_a":"I know this is a hit and run.. but why was this man in the street?","post_message":"#BREAKING: One of the suspects is also facing involuntary manslaughter and leaving the scene of an accident charges related to the hit-and-run that killed Bapi Gupta."},{"comment_id":"926693817463797","commenter_b":"Fuck u bitch","commenter_a":"Good :) anything to make more conservatives whine and bitch like the petulant children they are.","post_message":"This is just plain sad..."},{"comment_id":"10153138055390329","commenter_b":"You're an idiot, Michelle.","commenter_a":"Fuck you buzzfeed. Articles like this are the reason half the country has measles. So irresponsible for you to publish something like this","post_message":"Why would you ever want to get vaccinated? (WARNING: Contains images that some may find disturbing.)"}]
