[{"comment_id":"1616592381975838","commenter_b":"THAT WOULD BE YOU SUCKER","commenter_a":"Anytime a socialist, communist and the far-left is aware of someone who can reshape our country to what it once was, scares the hell out of them and will say things like the above. Sanders statement, viewpoints make no sense at all and fail miserably in the arena of logic.","post_message":"Sanders says Trump is \"a pathological liar who changes his mind every single day.\" Agree or disagree?"},{"comment_id":"1930654800491749","commenter_b":"Those idiots need to be kicked out of our country, not immigrants","commenter_a":"What a creepy group of corruption.","post_message":"That was quick –> Most national security advisors spend more than two and a half years in the job. Mike Flynn topped out at 24 days before resigning last night. President Donald Trump and Vice President Mike Pence claim they did not understand that Flynn was regularly in contact with Russian officials, including on the day Barack Obama imposed sanctions on Russia for interfering with the US election. That relationship could become the subject of investigation in Congress — at least one Republican, Marco Rubio, wants more information and has suggested combining it with a broader investigation into Russian meddling. To echo a Watergate-era inquiry from the late Sen. Howard Baker, “What did the president know and when did he know it?”"},{"comment_id":"10152777670593525","commenter_b":"Hahaha she can do it, especially since she has that walker she'll smoke that nigga","commenter_a":"@username Xana Smith @username Alice needs to get on her grind! Lol","post_message":"95 years old and still setting records on the track…"},{"comment_id":"10154096555057452","commenter_b":"@username Hillary lost, get over it.","commenter_a":"This man needs to be brought up on charges of treason! He's against his own country and has sold his soul to the devil. How can he take an oath to uphold and defend this country and the Constitution when he doesn't even know what it says?","post_message":"President-elect Donald Trump tweeted that China should keep the U.S. Navy drone they seized in international waters.  China has already agreed to return the drone after the United States objected to the seizure."},{"comment_id":"1743922275826047","commenter_b":"150 million + illegal immigrants and 150+ million legal citizens out of work. Do the math its a wash get em out. Deport everyone last one of them and void any overstayed visas. Goodbye and goodluck","commenter_a":"These thugs are pay by George Soro's the Super Pac for Hillary, and the Bernie idiots that have nothing better to do.......the point is you will never see Republicans act like these IDIOTS!! This only pisses more people off to vote for Trump!! Trump for President 2016!!","post_message":"***SHOCK VIDEO***  Anti-Trump protestors in Albuquerque, New Mexico stomp on police cars, light Donald Trump signs on fire, wave Mexican flags...."},{"comment_id":"10153523768927293","commenter_b":"Thank you!","commenter_a":"What do you mean by white? there are white latinos i.e. latinos of European origin, so it isnt about race? pigment and having a tan or lack of deosnt define a race....cleopatra, moses, werent caucasion? what were they then? most experts say caucasion includes indians and that middle eastern are essentially white - although some can be mixed race .. so what exaclty do you mean and why do you care so much? We could find examples of many blacks playing white characters - very common in shakespeare...so keep your racial obsession and race baiting to yourselves please WP!!!","post_message":"From “West Side Story” to “The Birth of a Nation,” watch 13 times that a white actor portrayed a non-white character on the big screen."},{"comment_id":"10154494540149586","commenter_b":"T p dig n jag s denna Jenny!","commenter_a":"Giulia","post_message":"\"I resist the systems that oppress people & animals alike.\" #WomensEqualityDay"}]
