[{"comment_id":"10153869953961680","commenter_b":"I'd rather see him on the Supreme Court.","commenter_a":"My dream for \"O\" is that he picks up where MLK left off. That he becomes a source of moral courage and reconciliation and justice for all of us here in America and around the world.","post_message":"President Obama: “He knew better than the cynic that if you look at the arc of history, human beings should be filled not with fear but with hope.\""},{"comment_id":"10153634685079255","commenter_b":"You are ill informed at your preference. REAGAN was the first president to turn a blind eye with a wink = let the Latinos and work for way below minimum wage as we all get RICH RICH =GREED TAKES OVER AMERICA AND BLATANT HATE ABOUNDS.","commenter_a":"Typical Democratic attack. People, the bottom line is this: ENFORCE THE IMMIGRATION LAWS already in place!! The Republican attacks on immigration are soley to counter Hussain Obamas illegal actions concerning immigrants! We as a Nation CANNOT AFFORD what his policy is going to do us! I believe we all know Thuh Donald's ideas are out of bounds, what is your solution?? I don't want to see children born of illegals deported,.. I do want to see those families placed into the process of becoming American citizens. The system is broken and quite frankly NO ONE has an answer to fix it, all you want to do is bitch about the other party. Politics as usual...","post_message":"Nailed it.  By Daily Kos user and AFL-CIO President Richard Trumka"},{"comment_id":"10153369802901037","commenter_b":"Tara! Mag-uber lang tayo! ;)","commenter_a":"@username gala na tayo! :)","post_message":"Thousands of Mexico City taxi drivers protest Uber, then Uber fires back."},{"comment_id":"1763064613956147","commenter_b":"Bitch I ain't finna lose my job over your racist ass. But don't let me catch you outside 2 months from now..","commenter_a":"First World Problems","post_message":"This is truly shameful."},{"comment_id":"10154082308022293","commenter_b":"Perfect boot lickers. Masters proud of you idiots. More dumb girls.","commenter_a":"I'm sure you liberals celebrated their death too.","post_message":"The discovery of two Catholic nuns found slain in Mississippi on Thursday sent shock waves through their rural community."},{"comment_id":"2193117860914394","commenter_b":"As if I would let her lick my face when she cleans her asshole 😂😂😂 come on now","commenter_a":"@username Munro","post_message":"It's not just gross, it's dangerous."},{"comment_id":"1091917874180626","commenter_b":"MAKE AMERICA GR8 AGAIN 2016! # AMERICA FIRST # BUILD THE WALL!","commenter_a":"Let's see a lot more arrests...these are terrorists!!","post_message":"Democrats' voter outreach to gang members is apparently working..."}]
