[{"comment_id":"817721241706741","commenter_b":"She hasn't even a woman very long.....","commenter_a":"I'm very happy that you are living the life you want to live, Caitlyn- but that by no means makes you an expert on all women or what is good for them.","post_message":"It takes a lot of nerve for a Ted Cruz supporter to say something like this..."},{"comment_id":"10156418546700354","commenter_b":"Obama would leave the citizens help to protect their selves just like what happen to Paris.","commenter_a":"Isn't that what Carson said and he got chastised","post_message":"This is slated to air tonight on \"60 Minutes,\" and it's going to INFURIATE liberals..."},{"comment_id":"10153709063006350","commenter_b":"I can't stand Matt Lauer -- he's too much of a liberal for me.","commenter_a":"Hope not trump !!!","post_message":"\"If I think for some reason it's not going to work, then I go back to my business,\" Donald J. Trump told Matt Lauer about whether he would drop out of the presidential race. \"There's no question about that.\""},{"comment_id":"10153774397117098","commenter_b":"No!!!! SHE IS A LYING SKANK!!!!","commenter_a":"What the hell? So these dudes were sleeping with their coworker's underage daughter? That is disgusting.","post_message":"#BREAKING...  What we're just learning on KRON News at 5 p.m."},{"comment_id":"1589593461282497","commenter_b":"What a dork...........","commenter_a":"This guy is putting himself in the same catagory as Trump when he talks this way about anyone. He could have made his point without all the cursing.","post_message":"The very end is the best part.  Thanks to The Liberal Redneck. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154105809967908","commenter_b":"Feel the Bern! Gonna be the first time I vote thanks to this man Bernie2016","commenter_a":"Yes, it is appalling.","post_message":""},{"comment_id":"10153635350921636","commenter_b":"He's definitely got issues!","commenter_a":"So kill urslf wtf","post_message":"'I could just kill myself and I wouldn’t have to face today'"}]
