[{"comment_id":"10152942742574753","commenter_b":"I have learned a lot about you guys","commenter_a":"this goes to show you the high levels of stupidity and ignorance that exist in the white race. they think they are so smart; that they know everything. yet, they do not know that there are people as Black as me with full heads of blonde hair in this world. she should have gotten more money. there is no excuse for this degree of ignorance, today.","post_message":"An arbitrator awarded an ex-Hooters waitress $250,000 in lost wages and attorney compensation after she was allegedly fired for having blond highlights in her hair. Hooters denies the allegations and says many African-American women have worked at the chain of restaurants while having various shades of hair, including blonde, without any difficulty whatsoever."},{"comment_id":"10154033103686065","commenter_b":"he is just telling it like it is....and i am him now","commenter_a":"On point and going after the media . Media is so bias and they are being called out for what they are.","post_message":"What do you think?"},{"comment_id":"1244555875564440","commenter_b":"Cruz is an idiot lady.","commenter_a":"Ted Cruz is right and is a good man! Good for you Ted! Tell that loser of of President who wants to allow criminals out of prison, and terrorists over our borders!","post_message":"Sen. Ted Cruz has some sharp words for President Obama, who he says attacked him two days in a row.  Read full story: @webpagelink"},{"comment_id":"10153383091468984","commenter_b":"If her mouth is moving she is lieing.","commenter_a":"She will say and do anything to get back in the White House but she really belongs in jail","post_message":"I can't believe she tried to pass this off as fact. Even Bill has to be shaking his head about this one...  Do you think Hillary has a problem being honest?"},{"comment_id":"10153919933534342","commenter_b":"ABC 13 Houston could you please explain what \"stunning\" about a kid riding a bike?","commenter_a":"At least its a 2 stroke bike","post_message":"Stunning video captured the moment a teen rode a dirt bike through a HS campus.  For the FULL story --> @webpagelink"},{"comment_id":"1137500072976406","commenter_b":"I agree she's a snobby cow that needs to learn a lesson and go inside but prisons are full","commenter_a":"Yet another classic case of women and their double standards...if a man had stabbed a woman, there'd be out with the pitchforks and torches baying for his blood...","post_message":"Woman who stabbed a man in the eye with her stiletto walks FREE from court"},{"comment_id":"10152487852365927","commenter_b":"Maybe your parents should have aborted both of you!!","commenter_a":"Hang them together.","post_message":"They're PROUD!?! Wow..."}]
