[{"comment_id":"10153813591902293","commenter_b":"Jealous women!","commenter_a":"Hmmm.....now what kind of people would call in and complain about a woman's bare shoulders......any guesses?","post_message":"The station received several e-mails during the broadcast complaining about her bare shoulders."},{"comment_id":"1421191604574730","commenter_b":"Go to hell","commenter_a":"He's perfect for the job and he's american","post_message":"EXPLOSIVE! CNN Columnist Says Michael Phelps Should Not Have Been The Team USA Flag Bearer Purely Because He is WHITE! Liberals are going CRAZY, injecting skin color and religion into the the olympics!   Lets GET 5,000 SHARES For Phelps! He's White and a BADASS! So what!"},{"comment_id":"10156608436570354","commenter_b":"We need to STOP celebrating arrests.... and STOP the influx of these fuckers (LITERALLY) in the first place.... They breed like rats.... Once they infiltrate, there's NO GETTING RID OF THEM.... Think of the rat problems in NYC! How about cockroaches? How about emerald ash bore? Zebra snails? Asian carp? GET IT????????????","commenter_a":"There is no such thing as \"Moderate muslims.\" They all read from the same Quran.","post_message":"German police have now made a staggering 379 charges for the attacks in which women were sexually assaulted by migrant gangs on New Year’s Eve.  All the latest DETAILS here..."},{"comment_id":"10153392928479170","commenter_b":"Don't you feel safe now that the country is being run by grunge mosh pit princesses like this character?","commenter_a":"She is a leftist loon with zero common sense. A perfect fit for the Obama team.","post_message":"The woman who gave you \"jobs for Jihadis\" is now working on the Iran nuclear deal. Time to \"Duck and Cover.\""},{"comment_id":"1406711522684967","commenter_b":"How do you know? Did you run a DNA test and look in her panties?","commenter_a":"Whenever, but still has male DNA and body parts, so still a male on the cover of the magazine.","post_message":"Vogue Paris will feature its first trans model on the cover of its latest issue."},{"comment_id":"10153115245746162","commenter_b":"What a pig!","commenter_a":"Unbelievable!!!!!!!!","post_message":"30-year-old Matthew Warner is charged with sexually abusing and killing his 19-day-old daughter.  How he almost got away with it @webpagelink"},{"comment_id":"1810345725921055","commenter_b":"Hmmm...either the cop is sissy soft or a female cause they lady whom he/she hit took that B...hit like a Champ","commenter_a":"Someone needs to get at that coward... another good cop right?","post_message":"This police officer was caught punching a woman in the face  the woman was arrested and charged with assaulting an officer and resisting arrest."}]
