[{"comment_id":"502105753294821","commenter_b":"Leave bitch!!!","commenter_a":"Trump for president!","post_message":"We'll pay for your ticket..."},{"comment_id":"979803835419705","commenter_b":"Dumb shit hoes do for niggas","commenter_a":"Looonngggg liiiive the kinggggg🦁","post_message":"The Struggle: His Mom Came Home Early So She Had To Jump Out The Window!"},{"comment_id":"556763161150305","commenter_b":"Steven...do you suck your dad off with that mouth?","commenter_a":"Oh, that's soooo terrible... You think the several thousand people he had killed didn't fear for lives? The ones who were shot, beheaded by chainsaws, scalped & skinned alive, and who had limbs broken and cut off? Extradite Chapo, throw him in ADX Florence for the rest of his life, and admit this bimbo to a psych ward.","post_message":"Emma Coronel: \"I'll follow him wherever because I am in love with him.\""},{"comment_id":"1191980840884045","commenter_b":"Seth Rich, DNC staffer, suspected of leaking information to WikiLeaks about the Clinton campaign randomly gets shot in the back walking down the street.... Why are so many Americans blind to the corruption in the Clinton campaign? People with credible evidence against Hilary are turning up dead. This is not a random instance. @webpagelink","commenter_a":"Trump will make changes, and yes Obama Trump doesn't think we faked the moon landing.","post_message":"Barack Obama’s greatest strength? “Probably that I’m always early.” hillaryclinton.com/makeaplan"},{"comment_id":"1162468617182722","commenter_b":"The magic number is 2026, half of 4051 . Bernie gets to that number the superdelegates have to support him.","commenter_a":"Bernie could win every state from here on out and Hilary would still be leading in the polls and delegate count. ..","post_message":"Hillary Clinton's margin narrows to just 6 points over rival Bernie Sanders."},{"comment_id":"1027310527363527","commenter_b":"go girl go!","commenter_a":"Now do it with 40 pounds of gear and a drill instructor screaming at you. lol","post_message":"Meet Milla, a 9-year-old girl that just dominated a Navy Seals obstacle course. (via NowThis)"},{"comment_id":"10154576995593812","commenter_b":"And Hillary gets away with what?","commenter_a":"#Belicheater","post_message":"A federal appeals court has rejected Tom Brady's attempt to get a new hearing on his \"Deflategate\" suspension. @webpagelink"}]
