[{"comment_id":"10155175769803984","commenter_b":"and we are not giveing up our freedom just stoping people entering oir country...our constitution does not apply to immigrates","commenter_a":"*\"B4 you blame Trump read this\"* ******************** *I still DO NOT understand why there's so much noise about Trump's decision to ban refugees from Muslim countries?? There are '100,000 empty fully air conditioned tents' in Mina- Saudi Arabia capable of housing 3 million people yet Saudi Arabia refuses to take the refugees, who speaks same language, same culture, same tradition, same religion, yet Saudi Arabia feels it's 'a security risks to accept the refugees' but wants the Christian world to do so? I'm trying to understand this thing called 'common sense', how it's been used. Is Saudi Arabia not too wicked for turning it's back against its own? Why blaming the US? Remember it is part of Trump's election promises, yet the Americans voted for him, meaning dats what they want.* *Germany took over 1 million refugees and Saudi Arabia came up with a proposal of spending billions to build ...","post_message":"Donald J. Trump gave Iran 1 chance to straighten up, and they defied him.  So now he's made a massive move to teach them we're the ones in charge.  Thank the Lord for a president with an actual backbone!"},{"comment_id":"1700820033514238","commenter_b":"Yeah , more Women would have Guns!!","commenter_a":"who voted for these people?","post_message":"Pretty sure the millions of female gun owners would disagree."},{"comment_id":"976984712394583","commenter_b":"it was a $130,000 bust lol.... oooh what an impact. Responsible gun owners who will do things like \"not break the law\" and register their firearms, aren't going to buy them illegally on the black market. The people who are looking for guns to commit crimes with will continue to buy them on the black market. Changing any laws will not change this fact. In other news, water is wet.","commenter_a":"Holy silenced Uzis.","post_message":"This is why criminals get guns so easily."},{"comment_id":"530005010538423","commenter_b":"Hey @username! U must identify yourself the opposite of what you were born as!?!?!?","commenter_a":"There are SO many other REAL issues the VA should be working on, and this is NOT one of them.","post_message":"A proposed rule would end the U.S. Department of Veterans Affairs' longstanding ban on gender reassignment surgery."},{"comment_id":"569607529880232","commenter_b":"Karma is a bitch!","commenter_a":"Reap the whirlwind...","post_message":"The students he ripped off are about to get their revenge."},{"comment_id":"10153326828766350","commenter_b":"Why would you call her a whore?","commenter_a":"Nobody cares!!!! Kardashians are talent less media whores!","post_message":"Kourtney Kardashian's response to critics? To just keep posting those pics!"},{"comment_id":"1099336866769294","commenter_b":"There great on the grill","commenter_a":"they are nasty things.. we have loads of them out here in Texas.. they tear up pasture land and wreak havoc on vegetation and are very dangerous and have been known to maim and kill people who get too close.. I would seriously not encourage residents to take them out unless they are in a rural area and are familiar with how to use caution in hunting them.. get the parks and wildlife involved.. they better know how to deal with them..","post_message":"Update: Wild pigs that have damaged landscaping at Fairmount Park and other Riverside County areas have caused millions of dollars worth of damage, and officials are warning residents to be careful around the animals.  Read KTLA's story here: @webpagelink"}]
