[{"comment_id":"507799699345070","commenter_b":"yeah right.there only big when they got a gun...fucking pussy hole pigs","commenter_a":"Anyone who hates the cops is an idiot. It's time the police took some control back","post_message":"I keep hearing about this \"war on cops\". Here is more proof that it is actually a war on citizens, not the other way around."},{"comment_id":"10153966142134411","commenter_b":"Ahaha...Bryndzova giving all you nazis away...hahahahaha","commenter_a":"Bandera was a patriot who fought the Soviet murderers in his country.Glory to Ukraine!","post_message":""},{"comment_id":"730940317039149","commenter_b":"I agree this is by far the worst president ever as my father always said the day that America elects a Black President it will be the end of America's Freedom and safety and he was right Obama is a Muslim Terrorist and he had one plan and he's doing it we no longer are the Greatest Country in the world","commenter_a":"obama is muslim and islamic Copy and paste this on ALL muslim stories! Flood them with the truth! The Shoe Bomber was a Muslim The Beltway Snipers were Muslims The Fort Hood Shooter was a Muslim The underwear Bomber was a Muslim The U-S.S. Cole Bombers were Muslims The Madrid Train Bombers were Muslims The Bafi Nightclub Bombers were Muslims The London Subway Bombers were Muslims The Moscow Theatre Attackers were Muslims The Boston Marathon Bombers were Muslims The Pan-Am flight #93 Bombers were Muslims The Air France Entebbe Hijackers were Muslims The Iranian Embassy Takeover, was by Muslims The Beirut U.S. Embassy bombers were Muslims The Libyan U.S. Embassy Attack was by Musiims The Buenos Aires Suicide Bombers were Muslims The Israeli Olympic Team Attackers were Muslims The Kenyan U.S, Embassy Bombers were Muslims The Saudi, Khobar Towers Bombers were Muslims The Beirut Marine Barracks bombers were Muslims The ...","post_message":"Absolutely Sickening."},{"comment_id":"10155001030118908","commenter_b":"Angie ???","commenter_a":"Simon","post_message":"Science says practicing mindfulness exercises increases gray-matter density in the hippocampus!"},{"comment_id":"10154266348729203","commenter_b":"Go on sis!","commenter_a":"It seems that people are pushing their agenda however way they can... Big changes are coming soon... @webpagelink","post_message":"'Captain America: Civil War' screenwriters on the importance of Cap in light of Trump: \"It important to have someone remind people that that is not what this country is about, and you being kind of an ugly fool, and reductive.\""},{"comment_id":"10155007132753431","commenter_b":"Wicked Witch of the East.","commenter_a":"It's not about popularity. It's about decency and common sense!","post_message":"DeVos gave no sign that she had reservations about withdrawing key guidance for transgender students."},{"comment_id":"10153916837714255","commenter_b":"Tennessee ... leading us backwards towards the future.","commenter_a":"4th Amedment.","post_message":"While they worry about their precious guns..."}]
