[{"comment_id":"1773749052877981","commenter_b":"So full of CRAP Hillary.","commenter_a":"Hillary is such a liar. Only person under investigation is Hillary and her staff... Yet Hillary tries to turn it around, LOL.... Hillary is such a liar.","post_message":"WATCH LIVE: Hillary Clinton speaks to supporters in Ohio. Ohio is a crucial swing state in the election."},{"comment_id":"1593183134313238","commenter_b":"Lol, not true bitchhhhh.","commenter_a":"Jensen Beale","post_message":"\"5 minutes\" "},{"comment_id":"10153974645223132","commenter_b":"ITS NOT A WOMEN!!!!! Check the DNA!!!! It has not had ANY of the real struggles of a REAL women. Tell it to give birth, have a period, nurse a newborn baby!!!!! Completly undeserving!!","commenter_a":"maybe if the men who hink that they are women should have the gender description of woman and all women change to the smartersex as our descriptive verb!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","post_message":"Congratulations, Caitlyn Jenner, who was an honoree!"},{"comment_id":"10153121748346615","commenter_b":"Ok. Let them run free then","commenter_a":"Start turning in the shooters.... It's that simple","post_message":"A call for peace and justice: Coming up on Channel 11 News at 6, see how dozens of residents in Homewood held a rally to honor lives lost to violence in the city."},{"comment_id":"10155164817270093","commenter_b":"Hilarious. And I can't even fault people for mistaking it as serious because that IS how absurd feminists sound most of the time.","commenter_a":"Good one!","post_message":"Talking about mansplaining, manspreading and manslamming is not enough. We also must fight against manterrogating, manpacking, mansulting, and bropen-mouth chewing!"},{"comment_id":"10153336997560927","commenter_b":"What about the perverts that are wide open now to expose themselves? Are bathrooms their safe place now to sexually harass the opposite sex? What are libtards going to do when they become victims of their own lunacy?","commenter_a":"We truly need to abolish the ACLU they are bad news for America","post_message":"ACLU: \"By requiring people to use restrooms that do not correspond to their GENDER IDENTITY, this policy not only endangers and discriminates against transgender people  it also violates federal law ...\""},{"comment_id":"10152526323082377","commenter_b":"Go away","commenter_a":"a gubbament BIG ENOUGH to GIVE you everything you WANT, is also BIG enough to TAKE EVERYTHING you have!! see what happens when you DONT VOTE!","post_message":"Oh Really..."}]
