[{"comment_id":"1801266436786153","commenter_b":"Ungrateful bitch what an embarrassment for her team disrespectful I throw her off the team","commenter_a":"Yes","post_message":"Do you think she should be KICKED OUT of the Olympics??"},{"comment_id":"1136953183031095","commenter_b":"I can guarentee she will have a fitness dvd out soon, watch this space. All these reality stars have horrible pics taken of them on the beach then get fit n do dvdds xx","commenter_a":"A well cut swimsuit would be far more flattering, although not much one can do with cellulite - ugh.","post_message":"The Only Way is Essex star soaking up those wintry rays ☀"},{"comment_id":"10153186882059641","commenter_b":"hmmm as long as it's not cooking drugs, printing fake marriage certificates, scamming, and turning young girls into prostitutes... #NOTOXENOPHOBIA AND ALL ILLEGAL ACTIVITIES","commenter_a":"I hope South Africans will not hear this, they will accuse the robot of taking their job and another xenophobia again.","post_message":"This robot chef will soon be able to cook 2,000 recipes. Pity it can’t eat them: @webpagelink"},{"comment_id":"10157180953385389","commenter_b":"she's a waste of skin!","commenter_a":"Oh, that was an Economic Speech. I did not hear anything of her plans for the economy but she was well studied on what she thought Donald J. Trump might do. Why will she not tell us her own plans?","post_message":""},{"comment_id":"1111833728854862","commenter_b":"These women must be screwed up in the head! Why would you throw everything away for a sixteen year old BOY? They should have gotten their kink a little more reasonably.","commenter_a":"\"Endured\"","post_message":"The parents of a male teen student who endured a 9-hour threesome with a pair of blonde high school English teachers have sued the teachers as well as the deep-pocketed local school board."},{"comment_id":"627551517435427","commenter_b":"Big mouth cow","commenter_a":"So we'll give her grandmother a free drink.","post_message":"This entitled woman just demanded a free drink... Because of slavery?  This is absolutely ridiculous. We owe her nothing.  Should she be compensated for slavery?"},{"comment_id":"10153836803272623","commenter_b":"Good players But it's another\"L\"","commenter_a":"Ga...NO ....Riverboat must have sank and Cam Ain't ..... stupid Panther Fans","post_message":"The New Orleans Saints beat the Carolina Panthers in a 41-38 victory Sunday in New Orleans."}]
