[{"comment_id":"10153737493874705","commenter_b":"Up Scumbag!","commenter_a":"But who won between Scumbag and Footlights?","post_message":"Oh, wow."},{"comment_id":"1143371025741432","commenter_b":"Can't stand this big ass getto fat bitch","commenter_a":"Illuminati whore","post_message":"Obama declared her a great role model for children, now Beyonce has released a sickening video.  But the violence and feminism in it isn't the worst part. Look who actually shows up in the video with her..."},{"comment_id":"10153250211681336","commenter_b":"Seems like a lot of immigrants spouting out of their pie holes when no one knows what happened yet.","commenter_a":"AM I THE ONLY ONE WHO THINKS ALL THESE DERAILMENTS IN THE LAST FEW YEARS ARE BY TERRORISTS????","post_message":"“It is an absolute disastrous mess. Never seen anything like this in my life.”  Philadelphia Mayor Michael Nutter confirms at least five people are dead and 53 have been transported to hospitals with six in critical condition after Amtrak train 188 traveling from Washington, D.C. to New York derailed Tuesday night. @webpagelink"},{"comment_id":"10154772615548701","commenter_b":"Od the bitch","commenter_a":"U fux'n C U N T.... Let me c u any where... U will wish ur momma swallowed the load u were conceived...","post_message":"A Washington mother is accused of giving her three young children heroin to sleep. One of the children told investigators his parents gave him and his sisters the \"feel-good medicine.\""},{"comment_id":"1030788763705100","commenter_b":"Yup, start by getting rid of his useless ass.","commenter_a":"Asshole","post_message":"President Obama talks about the urgency of Climate change, saying \"We've proven that the choice between our environment, our economy, and our health is a false one. We've got to strengthen all of them together.\" What do you think?"},{"comment_id":"10153335950782293","commenter_b":"When you have a citizenry that has NO respect for authority, this is what you get. Should the police just let them run wild? Why not create some \"no go zones\" and let the animals have at it.","commenter_a":"If the only way police can \"control\" crime is through the kind of brutality we see in videos, they better relearn their policing skills.","post_message":"He suggested violent crime is surging in the U.S. because police officers fear getting caught on the next video of alleged police brutality."},{"comment_id":"10153366613454712","commenter_b":"She's a joke","commenter_a":"So how is she suppose to be courageous when she hides reports that was commonly issued? She hide knife? How is she courageous? How courageous to point a muder finger at innocent driver","post_message":"Memo to Marilyn Mosby: Baltimore wants transparency, not sealed documents and gag orders."}]
