[{"comment_id":"1054816387945602","commenter_b":"Watching these comments I can't help but notice that Obama is almost as popular as burlap toilet paper....","commenter_a":"Will he be pausing to pray to the east immediately following this speech?","post_message":"President Barack Obama comments on #Brexit at the 2016 Global Entrepreneurship Summit."},{"comment_id":"10153981290586519","commenter_b":"@username The war was based on a racist desire to see Arabs burn. That's why the American people wanted it. The goal was simply to slaughter a few hundred thousand of \"them\" after 9/11, and that racism is something Clinton and half her fellow elected Democrats knowingly pandered to.","commenter_a":"The ideological purity of the Left gave us 8 years of Bush while sitting out the midterms. Sanders and his dead-enders repeat every bullshit right wing talking point. Tired of him and then.","post_message":"Establishment liberals have an unhealthy relationship with the left."},{"comment_id":"1009830989039949","commenter_b":"Don't even watch the view anymore.. THose women have so much anger in them.. They never say anything nice about anyone.. Joy was off the show for awhile,, needs to stay off the show.. Just my opinion..","commenter_a":"Who in the Hell is Joy Behar, and why is anybody listening to her or her or anyone on the View?","post_message":"Joy Behar calls out Carly Fiorina.  Is she right?"},{"comment_id":"10153525058378984","commenter_b":"I I do not believe in Political Correctness, I believe in following and standing for my Christian Convictions, and e e expecting others to respect me and what / how I live, as much as I respect others .... and I do not need the Government to tell me how to do it or try to force me to abandon any part of my faith.","commenter_a":"Frankly I dont give a damn what they say.","post_message":"Wow, I thought I'd heard it all from the politically correct left, until I saw this...  Do you think liberals are getting out of control with their constant censorship of America?"},{"comment_id":"10153704994641337","commenter_b":"Fuck off fag","commenter_a":"Here come the \"cause Obama is a Muslim\" comments","post_message":"#IStandWithAhmed: Even Barack Obama is showing his support for Ahmed Mohamed..."},{"comment_id":"10153941418821167","commenter_b":"Nope! He's going to insist that the debate was rigged.","commenter_a":"I haven't seen a whooping that bad since my cousin said the F word in front of Grandma. #KillaryKilled #TrumpTucksTinyTail #debates","post_message":"\"Overwhelmingly Hillary Clinton\""},{"comment_id":"10156175589090354","commenter_b":"Arrogant hateful ole hens that arent worth the waste of time!!","commenter_a":"Liver Transplant Recipient of 4 1/2 years. The Doctors saved my life in surgery but the Nurses kept me alive and watched over me and I would not be here without them. Bless them all.","post_message":"The #NursesUnite movement is mobilizing against liberal co-hosts of \"The View\" Joy Behar and Michelle Collins.   But now, new arrogant and elitist behind-the-scenes comments are coming to light and sparking further uproar with nurses across America..."}]
