[{"comment_id":"1250137068360096","commenter_b":"@username Oh no! not more people adopting, what a horrible place we live where people want children in their homes!!!","commenter_a":"You people know so little you call that a win just pitiful","post_message":"YES!"},{"comment_id":"10153763460367629","commenter_b":"The wall will be built of hatred and ignorance.","commenter_a":"Creepy!","post_message":"So cute!"},{"comment_id":"10153817603534497","commenter_b":"Feminism isn't a hate group.... lol Some feminists are cunts, but you can find cunts in every group of people","commenter_a":"That sad moment that a funny article about the majority of TV shows predictably lacking in certain areas turns into a feminist women hate spree. Need for feminism reconfirmed.","post_message":" part of my brain will just be switched off."},{"comment_id":"1094342837275269","commenter_b":"She ain't coming back","commenter_a":"I love Jessica Lange","post_message":"Jessica Lange announced that four seasons of 'American Horror Story' was enough and she will not return.   The star of the first four seasons of 'American Horror Story', Jessica Lange, announced that she has no desire to return to the show. Lange will however return to FX in the show 'Feud'   One actress entering her fourth season of the show that announced she will be returning is Angela Bassett. Watch Angela Bassett talk season 6 of 'American Horror Story'."},{"comment_id":"642467755916056","commenter_b":"@username # F*ck Hillary","commenter_a":"Clinton the queen of Benghazi and hidden e-mails. Just look at the media. They are piling on Trump while giving Hillary a pass. The debates are still too come. There is a long way to go. Hillary is a sociopathic liar and should never be president. @username and the polls mean nothing right now.","post_message":"Hillary Clinton opened up a 15-point margin over Donald J. Trump in one of the polls."},{"comment_id":"1478938502146617","commenter_b":"That redneck is probably terrifying his sister...err! Girlfriend!!!","commenter_a":"That woman looks like she's trying to hide her identity. I would too if I had to go to a Trump rally with that gormless chubby asshole. :(","post_message":"\"One man's sexual assault,\" one said, \"is another man's flirtation.\""},{"comment_id":"10155049282976729","commenter_b":"She is totally delusional","commenter_a":"Anyone else notice that everything killary is guilty of, she and her supporters blame on Trump? She smashes cell phones with a hammer, but Trump has a bad temper? She will raise taxes on the middle class, but people say Trump will? He never said that, yet people say he will. You give people a video link to hear someone say what you heard him/her say, people come back saying snopes says it has been altered ... Liberalism is a disease, a mental one.","post_message":"You definitely won't see this on the mainstream media..."}]
