[{"comment_id":"760411690754543","commenter_b":"We have enough oil in this country for the next 400 years but John Bush wants arab oil imported not american oil","commenter_a":"We've had enough of oil energy and oil families like yours. Get lost. You're not welcome on this planet anymore.","post_message":"If we embrace our energy revolution, we can create millions of jobs and higher wages: @webpagelink"},{"comment_id":"635686593246783","commenter_b":"@username As much as you might want there to be, there is Nothing wrong with Hillary's e-mail account! Just ask Colin Powell and Condoleezza Rice, who operated the same way.","commenter_a":"if I vote, I want it to count and be counted, that's the promise, Every Vote Counts, well except when Bush was elected","post_message":"It is probably way overdue.  Conservatives Are Destroying Our Future"},{"comment_id":"10155893910319062","commenter_b":"Nobody gets that the action he repealed would have put the housing industry back where it was a few years ago with foreclosures flooding the market again.","commenter_a":"Wait a sec! You're telling me that a billionaire scumbag that has sent jobs overseas, left commissioned workers unpaid and exploited illegal immigrants ISN'T looking out for the best interest of middle/lower class Americans? Huh. Imagine that.","post_message":"President Donald Trump blocked an Obama administration policy Friday that would have reduced the cost of mortgages for millions of home buyers."},{"comment_id":"1806351676274393","commenter_b":"My body is mine Mario, and a pregnancy I would carry, would also be my decision. You get no say. Your ignorance proves you shouldn't have any. You think no women in your country get abortions? No, they get unsafe back-alley or home abortions. Men should absolutely not get to make legal decisions over what occurs within a woman's body.","commenter_a":"Your body is your choice only when your body will have 2 heads 4 arms 4 legs..if you want a choice you should buy a pack of condoms or close the oval tubes..stop abortion in Gods name.","post_message":"In Mike Pence's name"},{"comment_id":"10154274649819087","commenter_b":"Dear Democrats and Liberals, I'm noticing that a lot of you aren't graciously accepting the fact that your candidate lost. In fact you seem to be posting even more hateful things about those of us who voted for Trump. Some of you are apparently \"triggered\". Because you are posting how \"sick\" you feel about the results. How did this happen you ask. You created \"us\" when you attacked our freedom of speech. You created \"us\" when you attacked our right to bear arms. You created \"us\" when you attacked our Christian beliefs. You created \"us\" when you constantly referred to us as racists. You created \"us\" when you constantly called us xenophobic. You created \"us\" when you told us to get on board or get out of the way. You created \"us\" when you forced us to buy health care and then financially penalized us for not participating. You created ...","commenter_a":"People will never vote Democrat again, once they appoint an Islamic extremist at the helm:)","post_message":"\"People didn't vote for Trump so he could bring a white supremacist into the White House,\" Elizabeth Warren said."},{"comment_id":"10153852384658822","commenter_b":"Women wanted equal treatment in the military.. This makes them a little more equal. Be careful what you wish for you just might get it","commenter_a":"I had 3 sons and they all registered when they turned of age. I would have not wanted them to go but if I had a daughter which I don't I would not want her to be drafted and put in the position of getting captured. It is bad enough what they do to men when captured you can imagine what they would do to women before doing to them what they do to men. I do now have a grand daughter and a grandson. I hope neither of them ever have to go thru a war. I also hope everyone else's kids don't either.","post_message":"The Senate voted this week to require women to register for the draft.   What do you think of the change?"},{"comment_id":"951876701600434","commenter_b":"Send her AND O'dummy to Gitmo!!!","commenter_a":"Hillary has character and integrity? How easy it is to forget all the criminal activity this woman has engaged in. She's nothing but a liar, cheat and disgrace to this country. She belongs somewhere alright it's called prison.","post_message":"BREAKING NEWS: AP projects Hillary Clinton as the winner of the Arizona Democratic Primary."}]
