[{"comment_id":"10156516063715206","commenter_b":"Trump is a pig and she stuck it to him with class.","commenter_a":"Watch yourself here on the video without sound even...you come off snobbish arrogant and grumpy and that is exactly what Trump meant by your face. You are well spoken, but you are not a happy person obviously. Not one smile! Mostly grimace. As to your subject matter-good for the blows to Hilliary and putting Christie in his place. But your arrogant head bobbing when talking about meeting foreign leaders etc. is just overboard. You better get on board with Trump, only the media and establishment hate him and are tryin their best to convince audience that he is hated. VOTERS want him!!! Voters love him!!!","post_message":"Putin won't listen to more talk. We need to show him there's strength, leadership, and courage on the other side. Pitch in $3 to rebuild America's role in the world.   @webpagelink"},{"comment_id":"1803612926545625","commenter_b":"I agree ...where they trained to beat the crap out of people because they ran....smh","commenter_a":"What they fail to mention is that even if this man was the actual perpetrator it's still inexcusable for the cops to beat him unless he was resisting. The police's job in this case is to apprehend suspects. Suspects are innocent until proven guilty and should be treated as such.","post_message":"\"I've never been cursed, physically abused, beaten and treated like a slave as I was two days ago.\" A retired corrections officer says he was assaulted by Garden City Police in a case of mistaken identity. CBS2's Carolyn Gusoff shares his story: @webpagelink"},{"comment_id":"2033407076758008","commenter_b":"Ghetto Trash !!!!","commenter_a":"Why would the \"demoncrats\" dump Brazil's ... nah ... to start with she's black like ODUMBER and after all she fits right in with CROOKED KILLERY ...","post_message":""},{"comment_id":"10153992150958854","commenter_b":"Who's next to meet Satan their Allah. Satan's impatient, don't keep the Virgin hags waiting.","commenter_a":"no more little asshole","post_message":""},{"comment_id":"10153580518686749","commenter_b":"@username The narrative BARACK HUSSEIN OBAMA has been pursuing is based on twisted facts and a long standard hatred against liberty and against our Republic', which he calls it America. HILLARY CLINTON being in lockstep with him, and just like him, she also felt the need to go around the world and apologize for all the things we supposedly did in the past. Never mind of all the aid and the freedom many Democracies are enjoying because of us and the blood we shed for them. We helped them and still helping them not because we but because is our duty to all the Millions of American citizens who came from those places and all their loved ones who are still living there! So, instead of leading from behind, when will our Nation have a pious and righteous President, a Constantine, a Theodosius, a Justinian, who will not be afraid, ...","commenter_a":"You're the best president, I'm from England but thanks for everything you have done Obama, especially for the LGBTQ+ community.","post_message":"President Obama's final State of the Union is on January 12. Say you'll be watching—and join the conversation. @webpagelink"},{"comment_id":"698707680267099","commenter_b":"@username ....and dumbasses vote for Hillary","commenter_a":"Liars will always call other people liars to hide the fact they are liars....haha. Seriously, he is a POS and he is nothing but a racist, a liar, a cheat, a thief, and I could go on. He is a danger to America....and if he can't run his casinos, his own campaign, think about what he will do to America. He will run it into the ground. It is pretty scary to think if he gets in the Whitehouse, he will insult other countries, and possibly be the first president to incite a war because of his mouth.","post_message":"\"Hillary Clinton  may be the most corrupt person ever to seek the presidency of the United States,\" Donald J. Trump  said."},{"comment_id":"10155026545836337","commenter_b":"Not the worse but close.","commenter_a":"Chuck is on point","post_message":"WOW. Charles Barkley torched the entire NBA..."}]
