[{"comment_id":"1573029682757155","commenter_b":"What's to be done. Vote for Hillary to screw over the vets, give away more jobs and flood us with refugees and illegal Hispanics?Seriously.","commenter_a":"@username shell say anything to get a vote this is how she really is a dirty white devil","post_message":"She used the racial slur over and over and over..."},{"comment_id":"10152574199456636","commenter_b":"Why are the females removed!","commenter_a":"After a half century of thinking / rethinking - my conclusion is that \"The Matured Feminine Approach\" (regardless the physical gender) is the today's hope for more cooperation, understanding,compassion and responsibility in the World! We need to educate and appreciate much women - especially for top leader purposes. Male thinking leaders are afraid of rivals and to lose domination","post_message":"After an ultra-orthodox Jewish newspaper removed all the female world leaders from the Paris march images..."},{"comment_id":"600892556733313","commenter_b":"She should put in jail with all Males and stay with them 24/7/365","commenter_a":"So not only he is a kid, he is also special needs. And on top of all of this, she is 71 among kids ????! The school should re think abt the age of teachers dealing with kids. In late 30s and a woman can hardly handle her own kids !!!! Shame","post_message":"71-year-old teacher Amelia Stripling was arrested and charged with 2nd degree cruelty to a child after knocking over a pre-K special needs student in Georgia.  @webpagelink"},{"comment_id":"1335655576501194","commenter_b":"Omg this little girl does need someone to beat her ass. Khloe can do it lol","commenter_a":"This lil girl is trash shame on her people need to stop giving her 5 minutes of fame","post_message":"She's calling out Kylie Jenner!  #WSHH #CatchMeOutside #KylieJenner"},{"comment_id":"10153682330001037","commenter_b":"She's nuts.","commenter_a":"Just sad","post_message":"“I honestly regret what I have done and take responsibility for it,\" wrote Petra Laszlo in a letter to a Hungarian newspaper."},{"comment_id":"1052165474817204","commenter_b":"Problem with getting help for these people is that they have to realize they have a problem and want to get help. Otherwise, it's a moot point.","commenter_a":"Why take his photo down? This is the poster boy for the NRA. His photo along with the rest should be displayed everywhere guns and ammo are sold.","post_message":"Chris Harper, 26, had posted on a blog about the TV reporter and cameraman who were shot dead: \"Seems like the more people you kill, the more you're in the limelight.\""},{"comment_id":"10155002538802178","commenter_b":"Please NO MORE ! Can't stand that woman, Muted ever time I seen her appear","commenter_a":"Well hopefully I will never have to see that white haired women doing Holdings commercials ever again now that it is over. During the evening news that same commercial ran 4 times an hour.","post_message":"BREAKING NEWS: Three-term 2nd District Congresswoman Renee Ellmers has lost the Republican primary to fellow Congressman George Holding, who ran in her district after a court-ordered revamp of North Carolina's congressional map moved his 13th Congressional District out of the Triangle, according to The Associated Press. Follow the latest developments at @webpagelink"}]
