[{"comment_id":"10154206928052431","commenter_b":"Politicians are non caring, or deliberately killing us. After all look at what Jackson did. Small pox ridden blankets. Yep and their attitude has not changed since. Maybe we should force better care of our people and not of these illegals.","commenter_a":"This is so very true. I was a cancer patient. Actively seeking medical help for confirmed CANCER in my body. The doctor at my clinic simply didnt show up for my first 3 appointments. All I needed was a consult, so they could refer me to an oncologist and behin treating the cancer. The first appointment was scheduled 1 month out, when the doctor didnt show, they had me see a nurse who confirmed I needed to be seen as soon as possible, and they scheduled me for 2 weeks later. Then, the same doctor didnt show for that appointment and it was another 2 week wait. Finally, on the 3rd no show I threw a fit and the clinic agreed to let me see a younger doctor who was actually in the clinic. And finally, after 2 months I got my referral to see the oncologist. In addition, because ...","post_message":"Natives Are Dying Because IHS Can’t Assure Timely Access to Health Care  @webpagelink"},{"comment_id":"10154126859997293","commenter_b":"They why are these alligators thriving in florida. They love the heat","commenter_a":"Why is this news? It's 90 degrees outside in a dense crowd and someone is hot. Big deal. Trump is a cold-blooded snake so I'm sure he could stand out there forever.","post_message":"Hillary Clinton was diagnosed with pneumonia before falling ill at the 9/11 memorial service."},{"comment_id":"10153396663904170","commenter_b":"She would HAMMER Hillary.. :)","commenter_a":"If Fiorina is blocked from the Republican debate in New Hampshire she should challenge Hillary to a debate there. Woman VS Woman. Hillary would never take the challenge, still the gauntlet will have been thrown.","post_message":"I love seeing GOP candidates use the media's \"gotcha\" questions to their advantage. Fiorina is turning it into an art form."},{"comment_id":"10154921930118690","commenter_b":"Karim Alyaa Dina","commenter_a":"Bal","post_message":"Integrating into a new country can be hard. That's why Horst Wenzel is teaching refugees the ins and outs of German dating culture."},{"comment_id":"1385223764854222","commenter_b":"Drive through these bloody pests.","commenter_a":"drag them off tie them up off the road direct traffic tho. Looking at the photo take to the right hand cuff or tie to the guard rail.","post_message":""},{"comment_id":"495888253922598","commenter_b":"I don't know many people that leave the doors to their homes unlocked when they leave for the day, when they go to sleep at night or just go about living with their family and friends. Also I don't know anyone that does not ask guests to leave at some point after a visit. Additionally most people use common sense to screen individuals that enter their homes. If the individual being considered as a guest is affiliated with a suspect group we error in the side of caution to protect or family and do not invite that individual or their affiliated friends into our home. In comparison to legal and illegal immigration into the USA it seems like the Democrats are telling us to unlock your doors while you sleep, don't use the locks on your doors while you watch TV, and when you leave for the day leave your ...","commenter_a":"The parallel is Jews = Christians. Not hitler to trump. Hitler killed the Jews. Not the other way around. Radical Muslims are killing Christians and Americans. Get it ?","post_message":"It would not surprise me either! What I am seeing & hearing from around the country is disturbing. Time for us all to #MakeAmericaGreatAgain. Remember! We need to energize EVERYONE to get out and VOTE!#Trump2016"},{"comment_id":"527866774028766","commenter_b":"Are you a feminist?!?!? Yea!","commenter_a":"Every time you read or hear this story it changes ... The parents are frickin LIARS ! They knew about this years ago and MORE WILL COME OUT .... He's a pervert ! So much for feeling \"SAFE AT HOME\" . He isn't the only one that should be charged ... Mom and dad .... Hi Ho , Hi Ho ... OFF TO JAIL YOU ALL GO ! SHAME ON BOTH OF YOU PARENTS ! ( to bad you don't know what the hell that means ! Mom you look up at the thing you call a husband and act like a little puppy, what , believes get everything he says , GET A BACKBONE AND WATCH OVER YOUR CHILDREN , you made them and GAVE BIRTH, ACT LIKE A MOTHER ! There would be HEADS ROLLING if this happened in MY HOUSE , believe me ! Your son should ...","post_message":"And the Duggars and police COVERED IT UP!"}]
