[{"comment_id":"10153476534618721","commenter_b":"You do not turn the Super Bowl into a platform for any agendas. The Super Bowl is about the teams on the field. That is all. If she wants to do that at her concerts, fine. But she was out of line doing it at the Super Bowl.","commenter_a":"Is Beyonce just another ghetto ho?","post_message":"\"Is Beyonce pregnant?\" and other dumb things people Googled during the singer's Super Bowl performance. (via Quartz)"},{"comment_id":"1784602218530696","commenter_b":"This lady is a clown with money. She is a joke","commenter_a":"gotta laugh at all these haters who are left over from Obamas reign! Its time to shake up the education system!","post_message":"Join us as Vice President Pence holds a swearing-in ceremony for the Secretary of Education, Betsy DeVos."},{"comment_id":"10156327692315725","commenter_b":"What are we going to do about that?","commenter_a":"You are right, Mr. Trump. I wish we could impeach Obama","post_message":"We need new leadership- fast!"},{"comment_id":"10154172313547690","commenter_b":"Like the boy didn't have enough problems then get a nasty nanny!","commenter_a":"Put me in the room with there for about 30 minutes let me drive her around and a little more","post_message":"This nanny is facing charges after allegedly abusing a 4-year-old-boy with special needs.  Luke has Down syndrome, heart defects and epilepsy. Once his mother noticed a change in Luke behavior, she decided to get a nanny cam. This is what she discovered. #NBC5Now More: @webpagelink"},{"comment_id":"749014911913950","commenter_b":"Is it possible..he can sink much lower? any bets.....again I'm speechless..he gets to just say things like this with absolutely no consequences at all!!...well..here's one consequence: VOTE BLUE UP AND DOWN THE BALLOT AND GET ALL THESE BIGOTS OUT OF OFFICE; OUT OF HOUSE AND SENATE ...","commenter_a":"Scum . Bottom feeder","post_message":"Now Trump's after dying people. See if you can stomach this. -- Annkia"},{"comment_id":"832641430106532","commenter_b":"My first thoughts also.. Selfish woman!","commenter_a":"Selfish woman","post_message":"\"...why my wife hid that letter is beyond me.\""},{"comment_id":"10153291728974726","commenter_b":"Is it just me or is it beginning to look like it is just one group of \"slick\" parasites that is destroying America.","commenter_a":"Some people get it. Too bad the entitlement crowd isn't listening! They would rather consider themselves as victims of Whitey.","post_message":"VIDEO: Tavis Smiley: Government Programs Have Led to the Dissolution of the Black Family"}]
