[{"comment_id":"10154465141311037","commenter_b":"Melania DUMP","commenter_a":"Think the media wants to sh!t all over this to distract the public on what's really going on...","post_message":"Did Donald J. Trump's campaign literally just RickRoll the nation?"},{"comment_id":"1203485969759238","commenter_b":"Send her big wampum","commenter_a":"Senator : Thank you.","post_message":"Great news! Yesterday a Texas court struck down the US Chamber of Commerce’s attempt to overturn a new Labor Department rule requiring retirement advisers to put their customers’ interests first. The decision affirms what we already knew: this conflict of interest rule was lawfully enacted and the rulemaking process took the views, costs, and benefits of all the stakeholders into account. Now President Trump needs to follow suit. He should stand up to the Chamber of Commerce — and the armies of lawyers and lobbyists that brought this frivolous lawsuit — and allow the rule to be implemented in April as planned.  Hardworking Americans saving for their retirement deserve to have a retirement adviser who is recommending the investments that are the best for their retirement security, not the ones that let advisers pocket kickbacks and prizes."},{"comment_id":"10153263448855095","commenter_b":"Arguments about religion, politics are a useless battle people nobody wins and about the refugees coming in i'm highly against it, there is no way we will know the good from the bad and I believe there are good and honest people that have been brought to America but you can bet your ass that there's a radical somewhere in the 10,000. I love my country and I'll be damned if we're gonna stand by and let our government bring in a possible threat and believe me it's very possible with the insane actions our president is taking, this will turn out bad and it will be the American people who will suffer in the end","commenter_a":"\" My parents came to this country 45 years ago searching for freedom and a chance.\" But you dont want to afford that same chance to others? What a hypocrite.","post_message":"I cannot tell you what an honor it has been to run for President of the United States of America. My parents came to this country 45 years ago searching for freedom and a chance.  When I was born, we lived in student housing at LSU, and never in their wildest dreams did they think their son would have the opportunity to serve as Governor of Louisiana or to run for President.  They raised me to believe Americans can do anything, and they were right, we can. But this is not my time, so I am suspending my campaign for President.  Going forward, I believe we have to be the party of growth and we can never stop being the party that believes in opportunity. We cannot settle for The Left’s view of envy and division. We have to be the party that says everyone in this country - no matter the circumstances of their birth or who their parents are – can succeed in America.  One of the things I will do is go back to work at the think tank I started a few years ago - where I will be outlining a blueprint for making this the American century.  We must show the way forward on growing our economy and winning the war against terror, and especially defeating radical Islam.  I realize that our country is off on the wrong track right now. Everyone knows that, but don’t forget, this is still the greatest country in the history of the world – and every single one of us should start every day by thanking God that we are fortunate enough to be US citizens.  Now is the time for all those Americans who still believe in freedom and American exceptionalism to stand up and defend it.  The idea of America – the idea that my parents came here for almost a half a century ago - that idea is slipping away from us.  Freedom is under assault from both outside our borders and from within.  We must act now, we do not have a moment to spare."},{"comment_id":"10154356585776509","commenter_b":"The mass shooter in California, were not by Americans. They should establish a law that anyone who comes into this country looking for citizenship should established themselves as Americans ,have at least 2 year or more waiting period. Until they do an extensive background check","commenter_a":"When black people kill white people and rape white women you don't see no tears from Obama. When Muslims terrorize and kill people cut Christians heads off you don't see no tears from Obama","post_message":"President Barack Obama wipes away tears while speaking about victims of gun violence: \"Every time I think about those kids it gets me mad.\" @webpagelink"},{"comment_id":"10153702399577377","commenter_b":"TRUE----BUT SHE OBVIOUSLY HAS THE WHERE WITHALL TO BUY PEOPLE OFF.","commenter_a":"SHE AND OBAMA NEED TO BE IN PRISON","post_message":"Former New York City Mayor Rudy Giuliani said Monday Hillary Clinton could possibly be the worst secretary of state in history."},{"comment_id":"10153377527143984","commenter_b":"Are some people just figuring out she's a LIAR and always will be!","commenter_a":"People need to wake up & research the person they are going to vote for....She is hiding so many things....","post_message":"Supporters of Hillary Clinton are reconsidering their choice for president after learning some stunning facts.   Are you glad to see Clinton's hypocrisy exposed?"},{"comment_id":"10153155614114411","commenter_b":"Circumcision removes most of the nerve endings from the penis - so no, it is not good for intercourse.","commenter_a":"curcumstich is good for the sexual intercorse between man woman. But the preast outbreath and homosex agenda and child melest could make Even God leave the churche..and the girls virganity and boys firs blow job...fuck them. Herpes is an evel sicknes related both to rosesicknes that makes your body ..","post_message":"Via RT America: City health officials said 17 cases of infant herpes since 2000 have been connected to the traditional Orthodox practice of sucking blood from the circumcision wounds of infants penises."}]
