[{"comment_id":"1731115690475220","commenter_b":"She should just go NOW!!!","commenter_a":"Another nut.","post_message":"Barbara Streissand says she's joining Al Sharpton and leaving the country if Donald Trump becomes president. Would you miss them?"},{"comment_id":"10154258426436509","commenter_b":"JOINING THE ILLUMINATI BRINGS YOU INTO THE LIMELIGHT OF THE WORLD IN WHICH YOU LIVE IN TODAY. YOUR FINANCIAL DIFFICULTIES ARE BROUGHT TO AN END. CALL: +@username WE SUPPORT YOU BOTH SPIRITUALLY, FINANCIALLY, PHYSICALLY AND MATERIALLY TO ENSURE YOU LIVE A COMFORTABLE LIFE. IT DOES NOT MATTER WHICH PART OF THE WORLD YOU LIVE IN. FROM THE UNITED STATES DOWN TO THE MOST REMOTE PART OF THE EARTH, WE BRING YOU ALL YOU WANT. BEING AN ILLITERATE OR A LITERATE IS NOT A BARRIER TO BEING A MILLIONAIRE BETWEEN TODAY AND THE NEXT TWO WEEKS. YOU BEING IN THIS OUR OFFICIAL WEBSITE TODAY SIGNIFIES THAT IT WAS ORDERED AND ARRANGED BY THE GREAT LUCIFER THAT FROM NOW ON, YOU ARE ABOUT TO BE THAT REAL AND INDEPENDENT HUMAN YOU HAVE ALWAYS WISHED YOU WERE. WE DON DISCRIMINATE IF YOU ARE WHITE OR BLACK. CALL: @username OR SEND AN EMAIL TO: ...","commenter_a":"Terrorist can care a crap about climate change their goal is to eliminate all others that do not believe in their religion.","post_message":"\"What greater rejection of those who would tear down our world than marshaling our best efforts to save it,\" President Obama opens up #ClimateChange conference COP21 #COP21Paris"},{"comment_id":"1113331872041003","commenter_b":"Lauren my family worked hard & works hard to pay taxes not to give it away to terrorists & fake MTFs who pretend to be refugees & plus why don't they fuckin claim asylum first point of call instead of wanting to come to UK ! It's not cuz of getting money & free housing is it ? This island is full & like I say open your house to a family than . No ? Thought so another one all talk no action","commenter_a":"Go back & live your life in your home as there's nothing here for you & Europe does not want you . Your president as a lot to answer for.","post_message":"Refugees are forced to travel light, and they have to carry everything they'll need for their journey inside a small backpack. What's inside? AJ+ takes a look."},{"comment_id":"10153189347462550","commenter_b":"Filthy pig","commenter_a":"You almost wanna teach you child at home what's going on these days","post_message":"#BreakingNews - Former Cumberland County school principal David Edwards pleads guilty to sex offenses with students.  More here shortly ---> @webpagelink"},{"comment_id":"1023152674374447","commenter_b":"This woman is nuts","commenter_a":"She's dumber than a rock.","post_message":"We asked the DNC Chair if her children were human before they were born. She gave a shocking answer..."},{"comment_id":"10153828561639369","commenter_b":"You know all people do is speculate as to what happened but there was clearly better ways to handle this situation then to get your own self in trouble and have your whole neighborhood thinking there is some psycho out there. No the kids shouldn't be doing that kind of stuff but why would a grown woman behave that way over some toys and trash.","commenter_a":"This woman didn't handle this situation well at all. That being said, don't parents teach their children what respect is any more??","post_message":"News of the weird....   An anonymous threat said, \"The children look delicious. May I have a taste?\""},{"comment_id":"10153966040516680","commenter_b":"Really Denny? Look back at this entire election process; every single act of violence was committed by the left, either A Bernie or a Hillary protester. EVERY single one of them.","commenter_a":"Tim like all rightwingers always blame someone else; it's SOP. This and other acts of violence is just a taste of what will happen if Trump is elected. Those prone to such acts will take it as de facto permission for violent acts against blacks, Latinos, Muslims, immigrants and of course their most hated enemy, liberals.","post_message":"“This act is a direct assault on people’s right to freely worship,” local authorities say."}]
