[{"comment_id":"775380562560552","commenter_b":"Your a stupid bitch","commenter_a":"This is the best show on TV. I won't be watching TLC if this is true. We can forgive things stars, football players, and men in charge of our country, but we can't forgive something a 12-year-old boy did. Standing behind the Duggars and praying for them.","post_message":"\"19 Kids and Counting\" has been canceled after Josh Duggar's shocking confession."},{"comment_id":"10153184134613984","commenter_b":"she is a drama queen & idiot.","commenter_a":"What a crock of crap!","post_message":"People are NOT happy about this, and they're calling her out for it big time.  Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"10156563653020652","commenter_b":"Man, my dog is always happy. I learn from my dog, so now I am always happy. “We understand how dangerous a mask can be. We all become what we pretend to be.” ― Patrick Rothfuss,","commenter_a":"@username - gedink jy sal ook hierdie interessant vind :)","post_message":"What can we learn from how animals cope?"},{"comment_id":"10155622855165354","commenter_b":"Pretty soon we'll be sending them on chartered flights, like the illegal immigrants we're busy with right now.","commenter_a":"uh huh!!","post_message":"Infuriating..."},{"comment_id":"10152727652141051","commenter_b":"LOL dumb ass bitches","commenter_a":"Wow how sick.could they wait until they got home","post_message":"These two women were chased out of a movie theater bathroom because the security guard thought they looked too much like men."},{"comment_id":"10154813376179312","commenter_b":"North Country isn't that bad. And the only thugs are in the future new Nazi government.","commenter_a":"Prayers for this couple and their family","post_message":"Oklahoma police are looking for this couple last heard from in St. Louis. They were on the way from McAlester, Oklahoma, to Toledo, Ohio, but called their son from the St. Louis area on Thursday."},{"comment_id":"10158044055455391","commenter_b":"@username Obama has dumped over 10,000 mostly Muslim Somalis in Minnesota, Tennessee, and other States. A Somali-born student at Ohio State University injured 11 people, one of them critically, when he attacked a crowd of pedestrians on campus in an incident one lawmaker said \"bears all the hallmarks of a terror attack.\" Authorities said Abdul Razak Ali Artan, 18, plowed a small gray Honda into the crowd outside Watts HalI, then jumped out and attacked with a butcher knife. Authorities believe he was inspired by ISIS. The latest from America’s immigrant sex crime epidemic. One refugee, Mohamed Dirshe, raped two boys at a Kansas Catholic high school, after Catholic charities gave him a home and a job there while entrusting him with their youth. In Minnesota, authorities charged Somali born Ahmed Hersi Abdi with two degrees of first-degree sexual misconduct for allegedly raping a 10-year-old girl in her apartment. According ...","commenter_a":"The United States of America should have the right to protect itself from those people who would do it harm it's not about religion or race it's about keeping very bad people out of this country","post_message":"Federal Court Rules Against Reinstating Travel Ban  Your reaction?"}]
