[{"comment_id":"1035142053187556","commenter_b":"Either sit quietly or shoot em. Dont bitch until they get pissed to","commenter_a":"I know the cops were doing wrong but for fuck sake shut your damn mouths and calm down and shit wouldn't escalate","post_message":"WTF! Just because they \"smelled marijuana\"??? Full story here: @webpagelink"},{"comment_id":"1007967755882148","commenter_b":"All parents need to step up and take charge like this mom. There would a lot less bs going on with teenagers these days.","commenter_a":"that it's mother style similar to CUBAN MOTHER BRAVO;MOTHER UNITED ja,ja,ja toma pelona qien lleve los pantalones a la hora de mandar.I ALWAY SAID TO MY SON THE DAY THAT YOU TRYING TO GOES OVER ME UNTIL THAT YOU GOES TO KNOW WHO IT'S YOUR MOTHER NEVER TRY","post_message":"Be sure to LIKE WND.com to stay connected!  @webpagelink"},{"comment_id":"1805298753047564","commenter_b":"I know Jim, I'm a diehard liberal, but when people like this commit these acts they prove that they are complete wastes of oxygen and need to be taken out of society. They are sociopaths and can never change. They must go for the safety of society!! Lethal injection is easy compared to what some people do to others. They actually are dying a much easier death than their victims.","commenter_a":"again everytime i think there should be no capital punishment, assholes like these come along and changes my mind","post_message":"The man had to crawl to save his wife."},{"comment_id":"10153532462028352","commenter_b":"And nobody in those stores were killed btw","commenter_a":"Use your brains people, this story isn't getting plastered all over the news because she's a good mother,AMERICA GETS OFF ON SEEING BLACK MEN GETTING ATTACKED.. And this is a perfect way to hide behind the actions of his mother. They love seeing black men being put in \"check\" and being demeaned in public....AND Have you ever seen a black mother hit her son for enlisting in the military to fight some people that has no effect on the oppression of blacks in America ?","post_message":"‘I didn’t want him to be another Freddie Gray': America’s favorite mom speaks out after smacking masked son and dragging him from riot"},{"comment_id":"10154452763505575","commenter_b":"That is bullshit...Rasmussen has Trump ahead of that bitch!","commenter_a":"FOX News just reported that Hillary Clinton leads Trump 48 to 41. Basically, they say Trump has lost 3 more points since the debate. Sorry FOX, but I don't believe your bullshit poll and you can take it and shove it up your #NeverTrump asses.","post_message":"It's Happening! Black Vote SURGES for Trump in last two weeks!"},{"comment_id":"932212166798963","commenter_b":"MEN are selfish!","commenter_a":"people can look at ass and other provocative videos all day. Things that children have easy access to and could potentially mess their mind, but yet everyone continues to make a big deal of pregnant/breastfeeding women. We need to get our priorities straight. #FirstWorldProblems.","post_message":"Pregnant meteorologist Kristi Gordon has been getting emails like this: \"... it is not pleasing to look at hump every day PLEASE have her take her mat leave now.\"  (Via The Huffington Post British Columbia)"},{"comment_id":"10153686388831320","commenter_b":"Disgusting these women","commenter_a":"I know it's o.k.-u know it's o.k.-get over it. body paint is o.k.- don't go if it's NOT o.k. w/u!- nuff said??","post_message":"Art or offensive? Women in nothing more than body paint and a thong are taking pictures with tourists in Times Square. How do you feel about what they do? @webpagelink"}]
