[{"comment_id":"1601073560185519","commenter_b":"@username I know I'm not saying he's illegal, he just wants every illegal to come into our country without becoming legal. He's ruining our country!","commenter_a":"She's not even a native born American trying to become the FLOTUS. Yet Donald Trump gave the current American President hell about his birth certificate! GTFOH","post_message":"Melania Trump: \"The race will be hard fought all the way to November, there will be good times and hard times...it would not be a Trump contest without excitement and drama.\" @webpagelink"},{"comment_id":"10153675997090779","commenter_b":"Dumb ass","commenter_a":"Good for him.","post_message":"Joe Walsh has revealed that, come November, he won't be casting his vote for Hillary Clinton or Donald J. Trump. Watch him explain why below."},{"comment_id":"1725002974382878","commenter_b":"Send this fool to the hangman to show that that USA won't put up with this crap, my husband post this","commenter_a":"obama 's sons if had them","post_message":"These disgusting Donald J. Trump-haters showed up to protest Trump as publicly and obscenely as possible.  And part of their protest was a SICK demonstration involving the American flag.  But before they could finish, they heard a voice give 1 order they never expected to hear..."},{"comment_id":"1419494658112647","commenter_b":"Show your junk to one of my babies and I promise you will sit to pee the rest of your sick life touch one and you will meet your maker and it won't be GOD","commenter_a":"You're one sick son of a b****","post_message":"CNN Believes That Little Girls Should Be Exposed To Male Genitals, Here The DISGUSTING Reason They Are Pushing This!"},{"comment_id":"10153141566354641","commenter_b":"She is one of the terrorists in this world","commenter_a":"The time is now, change in governance of UNCLE SAM, time for good women of UNCLE SAM to vote for Hillary Clinton, what a man can do a woman can do it better. Let's give her a chance. She will surely make the difference. UP DEMOCRATIC PARTY.","post_message":"First on CNN: Hillary Clinton’s press team is growing: @webpagelink"},{"comment_id":"10155458466225354","commenter_b":"Just a bunch of average women.","commenter_a":"I still cannot wrap my head around the positive reinforcement people give instead of being honest and constructive. Don't take her to dinner, take her to the gym.","post_message":"\"They’re no angels—and they own it\""},{"comment_id":"10154448547351523","commenter_b":"I got attacked by a rott happens. Why are you so short thinking. Now walk away","commenter_a":"SO SAD - and here come the pit bull lovers who will blame everyone/everything to protect pit bulls - how many people have to be attacked/killed before something is done to stop these attacks?? I suffered a vicious attack by a pit bull and it breaks my heart every time I hear of another pit bull attack. Pit bulls killed 232 Americans between 2005 and 2015 - here are the FACTS: @webpagelink","post_message":"\"Two pit bulls ran out after my dog and just ripped it apart.\""}]
