[{"comment_id":"1632662777034101","commenter_b":"Hope she cheats on you!","commenter_a":"I did the same thing to my fiancee. I told her if didn't register to vote, I'd be mad. She did register. When it came the time to vote early, she feet - dragged. And I told her if you didn't vote for Hillary Clinton, our relationship would be over. She voted. Emails or no emails, Hillary all the way!","post_message":"\"If you didn't vote for Hillary Clinton ... I'll seize your phone, I'll seize the car.\"  Watch this mom's impassioned plea for her son to vote for Hillary Clinton."},{"comment_id":"10154885084089411","commenter_b":"we all good woohoo like riding a wave..","commenter_a":"Leah stay safe. Xx","post_message":"URGENT New Zealand civil defense warns of tsunami, urges people on South Island to move to higher ground"},{"comment_id":"10153171021535950","commenter_b":"she gave him head while the lieing bitch watched and then joined in!","commenter_a":"From many people that know them personally, he has a few girlfriends. One in Canada. It's a marriage for show only.","post_message":"The United States' ultimate political power couple, Bill and Hillary Clinton, celebrate 40 years of marriage today. Their marriage certainly hasn't been all smooth sailing..."},{"comment_id":"10153940302636770","commenter_b":"Hillary need to be placed in jail","commenter_a":"Trump is going to say , Hillery u'r Fired !!!!!!!","post_message":"TheDC Election Night: Race is tight!"},{"comment_id":"667207133381416","commenter_b":"She should be fired!!","commenter_a":"Should absolutely be fired!!! This is a prime example of how sad our society is!!!","post_message":"VA Manager Thinks Veteran Suicide Is Funny, Here is Her INFURIATING Email Read more at @webpagelink"},{"comment_id":"10153143510309575","commenter_b":"That's a woman?","commenter_a":"Good","post_message":"An Indianapolis mother was sentenced to 60 years Friday in connection with the death of her 2-year-old daughter.  In January, she was found guilty of murder, battery and neglect of a dependent."},{"comment_id":"10153139326127293","commenter_b":"just facts he was no hunter just by what was done and his lousey shooting . he had no business hunting.","commenter_a":"he didnt know what he was doing and the guides were obviously dirty.","post_message":"How a dentist who killed Cecil the lion shelled out $50,000 for the trip."}]
