[{"comment_id":"1689347211355625","commenter_b":"Well hopefully none of these girls are lesbians because if they want shari law they could end up getting stoned to death. Bunch of fools.","commenter_a":"I'm offended that must stop OHH wait a minute I'm a white America I don't have rights !!!","post_message":"SHARIA WEEK! Islam Week At Schools In America, Administrators Demand Females Wear Hijabs To Show Support!   Lets get 3000 SHARES if you'd like to see Trump outlaw Sharia Week!"},{"comment_id":"650239665120653","commenter_b":"Congress does the budget not the President. Stop passing the buck","commenter_a":"Close off shore corporate tax loop holes. Oh, would that be a conflict in interest? Legalize marijuana. Tax the church!","post_message":"A new Congressional Budget Office report shows that President Obama’s latest budget would leave us with a $486 billion budget deficit for 2015 alone and a deficit of over $7.2 trillion from 2016-2025. That’s just another reason why my first bill in the Senate requires Congress to do its job, get federal spending under control, and pass a balanced budget."},{"comment_id":"10154243663794160","commenter_b":"I bet he's caring a lot more women. As a woman, couldn't vote for Clinton. As a woman, she's an embarrassment to women.","commenter_a":"I pray, I pray, I pray","post_message":"Donald J. Trump is losing female voters."},{"comment_id":"10153197747769094","commenter_b":"He doesn't shoot them for 30+ seconds.... You have to go out of your way to watch it.","commenter_a":"I made the mistake of watching the video from the shooter as he committed these awful murders. I wish I could take back watching that.","post_message":"Video of the fatal Virginia shootings shocked users of Twitter and Facebook when the “autoplay” function showed them what they didn’t want to see. @webpagelink"},{"comment_id":"1517455414941150","commenter_b":"So what was the cause of death?!-","commenter_a":"I think they were drugged while at the hotel bar. It is becoming more and more common in foreign countries to drug and even use ether to sedate people so they can rob them. I find the guy suspicious that said when he saw in the AM that their door was as he had left it he became worried. How did he leave it...closed like every other hotel room door? It's not like housekeeping found them. This guy called mgmt and they went in. Sounds suspicious","post_message":"The autopsy for the two American sisters found dead in their luxury hotel room determined there were \"no visible signs of injuries found on the bodies.\""},{"comment_id":"1318642101490448","commenter_b":"No dumbass that's why she lost","commenter_a":"No she is to crooked","post_message":"Honest question: Do you think Hillary Clinton would have been a better president than Trump?"},{"comment_id":"10154346437467464","commenter_b":"Because of Ted and politicians like him, we are going to have Hillary for president. There won't be a America left for another president. They will bring in millions more illegal aliens that will vote democrat and the republicans will be an endangered species.","commenter_a":"Too bad Cruz's Pride is giving it away to the democrat socialist party!!!","post_message":"Texas is blessed to be home to so many of our men and women in uniform, and El Paso’s Fort Bliss is a crucial base for those who serve on the front lines to keep our entire nation safe and secure."}]
