[{"comment_id":"10154094538521955","commenter_b":"If anyone thinks it is going to be easy taking this country back from these marxists.....think again!","commenter_a":"Police, once again are ordered to let Thugs throw rocks at them. These protests are like Disneyland for the Criminal element.","post_message":"UPDATE: RIOT AT TRUMP NM RALLY..."},{"comment_id":"10153043842829411","commenter_b":"This Germans are only the progeny of the stupid Jews that survived the holocaust.","commenter_a":"Look the Nazi are back.","post_message":""},{"comment_id":"10152980541131336","commenter_b":"These creeps need to be exterminated.","commenter_a":"Islam is winning...","post_message":"German police canceled a popular carnival street parade less than 90 minutes before it was set to begin, because of fears of an imminent Islamist terror attack."},{"comment_id":"1706668932888007","commenter_b":"Hillary is just another branch of the incompitent Obama tree. Only difference is she's a criminal and she'll be far worse for this country because she'll have to prove a point soley because she's a woman. Sorry, but I don't vote based on race or sex and I certainly won't vote for someone who has spent most of their political career filled with lies and cover ups.","commenter_a":"I CALL B.S....HILLARY HOMERS,...VOTE Donald Trump 2016..\"THE MAN FOR AMERICA\".","post_message":"Donald J. Trump's odds of winning the Republican nomination dropped 3 points on the Political Prediction Market after the #GOPDebate. Meanwhile Ted Cruz's odds ticked upward..."},{"comment_id":"649524331880703","commenter_b":"She and Bernie are behind these riots. Why do we listen to her? She is a liar!","commenter_a":"You got that all right. Randy Webster","post_message":"Disappointing to hear."},{"comment_id":"10153245155862550","commenter_b":"Candace, those who are offended by the American Flag can move!!! HAPPY INDEPENDENCE DAY Ladies!","commenter_a":"I hope they catch them...my ancestor is buried there. And who knows...some of those soldiers that they dishonored are probably non-white....my ancestor is NA. All lives matter....","post_message":"#BreakingNews Update: The Durham Police Department is investigating after a Confederate memorial in Maplewood Cemetery was vandalized.  More details here: @webpagelink"},{"comment_id":"10154276693141037","commenter_b":"Hillary needs to start leaning a bit further left, and start actually addressing the issues that the voters she's not getting care about. Her \"don't be so pie-in-the-sky\" attitude will cost her the election, and God only knows the price this country will pay with Trump in the Oval. Bernie is hanging tough because Hillary is not!","commenter_a":"I will only cast my vote for Bernie Sanders. Period. I will write him in if need be.","post_message":"Despite Hillary Clinton’s insurmountable delegate gap, Bernie Sanders coasted to victory on Tuesday, yet again."}]
