[{"comment_id":"525207624325250","commenter_b":"Call girl wife! And not melania. Haha","commenter_a":"Can't wait! Donald has something huuuugggee. Haha lyin Ted. Spill the beans just before next primary voting!","post_message":"Ohhh boy....  You know about this, right?"},{"comment_id":"10152962610452894","commenter_b":"Lady, what a dumb comment","commenter_a":"So what. If Bruce Jenner can be a woman, she can be black. People can be whatever they want.","post_message":"Exposed! Spokane NAACP Leader Rachel Dolezal Lied About Being Black — She’s Actually a White Woman from Montana [Photos + Video]"},{"comment_id":"10152940506506051","commenter_b":"Put her in jail","commenter_a":"If You all had ids in that school and there was some evidence of wrong doing you would all change your tune you have no right to judge the system until you know the true circumstances","post_message":"A dad went to school to pick up his daughter’s confiscated phone. The school principal refused to return the phone, but offered a different sort of exchange."},{"comment_id":"1082109501809405","commenter_b":"Illegal refugee returns?","commenter_a":"what about the human rights of the children and women raped and molested by islamic immigrants ??","post_message":"Amnesty Secretary General Salil Shetty said that short-term national self-interest and draconian security crackdowns had led to an \"unprecedented assault on human rights\" in 2015. Read more: @webpagelink"},{"comment_id":"10153781983829062","commenter_b":"Yeah!","commenter_a":"Oscar","post_message":"Heads up Ariana, fans... she's coming back to Texas this summer! Did you see her at the rodeo?"},{"comment_id":"716457901822319","commenter_b":"You the ugly one!","commenter_a":"She know she UgMo...lol..","post_message":"Isn't this a great response when they questioned Serena about her beauty?"},{"comment_id":"10153202984559726","commenter_b":"California can have all the nation's illegal aliens! Start shipping them over right now. California sucks donkey balls.","commenter_a":"Give them all the water they can drink!","post_message":"California proposes $1.2 billion MORE in benefits to illegal immigrants--including healthcare & Office of \"New Americans.\""}]
