[{"comment_id":"10154355156798812","commenter_b":"Yea these are the very perverted people that will claim to be transgender to gain access into bathrooms...","commenter_a":"The list of perverts who video people in bathrooms is long and does not just stop at Target! My local Old Navy had a perv filming a young girl while she was in a dressing room--her mother caught him in the act. These are not transgenders. These are simply perverted people! I am safer in a restroom with a transgender than I am with \"straight\" people! Transgenders are NOT peeping toms! If men dressing as women and claiming they are transgendered to assault little girls in bathrooms, then maybe there needs to be an anti-creepy men bill, not anti-LGBT bills, targeting Transgenders.","post_message":"Protesters inside North Carolina's statehouse staged symbolic sit-ins outside the offices of top legislative leaders."},{"comment_id":"10154899725050329","commenter_b":"All of those children have worked since before they were 16. A simple Google search would have told you that. I love how everyone assumes shit like this.","commenter_a":"I bet Ivanka or Donal Jr never humbled them selves like Sasha. It's obviously not about the money but about her learning the definition of hard work. @username Santiago Wolf @username","post_message":"\"You ain't lying around my house all summer.\" —FLOTUS"},{"comment_id":"10154886702384166","commenter_b":"We got a little here in Honea Path :-)☃","commenter_a":"got some in pelzer, they are haveing a blast in it!!!","post_message":"Sort of an encore performance of snow over parts of the Upstate just before 7 AM. Folks in Anderson could very well get a quick dusting out of this. Let us know if you do! We're on for another 2-3 more hours on FOX Carolina. -Ben"},{"comment_id":"405246192933309","commenter_b":"To many people have nothing to do but bitch","commenter_a":"What is wrong with it, it could mean God bless or whatever God you pray to","post_message":"Should this religious phrase have been banned?"},{"comment_id":"10153804494893132","commenter_b":"Stfu!","commenter_a":"Michael Jackson: Year one clean of touching little boys.","post_message":"Eat like a King (of Pop) on Michael Jackson's birthday."},{"comment_id":"902141793237008","commenter_b":"She didn't deserve this. She was a good hoe...","commenter_a":"@username it appears that maybe, a hoe can get cold","post_message":"Elizabeth Luebke died in Wisconsin after going outside in temperatures as low as as -27.5 degrees with the wind chill."},{"comment_id":"10152767737561636","commenter_b":"I'd happily punch her lights out, evil witch!!","commenter_a":"Hunt without a rifle. Even it up a bit.","post_message":"She has said she will 'never apologise' for being a woman who hunts..."}]
