[{"comment_id":"10153961468913132","commenter_b":"@username she better step away from my man","commenter_a":"@username @username @username I'm sure you've already heard, but it's foreal.","post_message":"So it IS true! Happy for Gwen Stefani and Blake Shelton. <3"},{"comment_id":"1027451010661056","commenter_b":"You old bitch","commenter_a":"Free stuff...what they don't understand is they will be paying for it out of their taxes for the rest of their lives....","post_message":"This would be comical if it weren't so dang scary."},{"comment_id":"10153917581018010","commenter_b":"Humans. When will humans realize that we are the most dangerous species.","commenter_a":"Pit bulls. When will humanity accept that this breed of dogs is classified amongst the most dangerous in the world? Hence why they are mostly bred for illegal dog fights","post_message":"A woman's 3 pitbulls mauled to death her 9-year-old brother."},{"comment_id":"10154138263431323","commenter_b":"It's about what you want to do. Maybe a younger person follows what is 'the done thing' but with age and life experience, I think women just do what they want!","commenter_a":"It's just like the shaved pubes issue - all the same arguments. 'I do it for myself' etc etc. Look, virtually no young women shaved their pubes before porn videos made men expect it. And virtually no older women dyed their hair before looking our age became unacceptable. I've had enough of all this 'I do it for me' nonsense - look a bit deeper for god's sake and let's be a bit more honest about our motives and the forces that drive us.","post_message":"“We’ve been groomed – by the media, by advertisers, and now by ourselves – to understand that our gender has to try harder, to consume more, when it comes to our appearance. We’ve been taught to fear growing old.”"},{"comment_id":"981060928642821","commenter_b":"are these women important? I never heard of any of them.","commenter_a":"Disappointed","post_message":"Television producer and writer Shonda Rhimes joined forces with the leading actresses from her various ABC shows in a campaign ad for Hillary Clinton..."},{"comment_id":"1751343418429993","commenter_b":"Bernie is to old and senile to be president. He would die in office.","commenter_a":"Your opponent is wishie washie she says what you want to hear","post_message":"I voted against the war in Iraq and I am vigorously opposed to an endless war in the Middle East that cost us trillions of dollars. What I am for is making sure that higher education is a right and ensuring that every American can go to college without living in debt."},{"comment_id":"1742230942710926","commenter_b":"Hillary can't speak without a Telepropter... She has no clue what tk say. Her speech pattern, body language, facial expression..etc. fake","commenter_a":"There is such a HUGE difference in the way Hillary speaks up to Americans and the way Trump talks down to Americans!!!! I am excited to see her win this!!","post_message":"History made. hrc.io/1YesHYS"}]
