[{"comment_id":"898217656867757","commenter_b":"That dress >>>>>","commenter_a":"She looks absolutely stunning~","post_message":"And finally Miss Viola Davis! #HTGAWM #Oscars"},{"comment_id":"735565289967382","commenter_b":"Dear God, kick this ignorant African so hard he gets back to Africa. He needs English as a second language. Also needs to be taught to not make threats. What a POS. Go back to where you came from.","commenter_a":"This guy is a fanatic. He'd better be stop or someone s going to get Bharat namely, him","post_message":"Knife wielding Muslim attacks Trump, but watched what happens next. I bet he never expected this. Let's show him our support. Can we get 30,000 'LIKES' Donald Trump?"},{"comment_id":"609058575939393","commenter_b":"Not only is she a bigot but she is a lying murdering greedy bigot!!!!","commenter_a":"NO HIL LIAR EE!!!!!","post_message":"Join me in MISSISSIPPI for a few minutes! It is time to MAKE AMERICA SAFE AND GREAT AGAIN!"},{"comment_id":"1324741860927476","commenter_b":"You need to stop getting your news from the crazy woman on the View!","commenter_a":"No terrorists came out of the 7 countries he banned why doesn't he ban Saudi Arabia where most 911 terrorists were from. Also Egypt and two other countries. Neither was the ban about illegals people with valid visas and green cards were also detained, even the ex prime minister of Norway traveling on a diplomatic passport was detained for questioning..I support Washington states action. The president is not above the LAW .","post_message":"\"We're not going to allow anyone in Washington, D.C. to trample on our rights as Washingtonians, President or otherwise.\" Gov. Jay Inlsee reacts to the judge's ruling to temporarily block President Trump's travel ban. READ MORE >> @webpagelink"},{"comment_id":"10152697644391770","commenter_b":"Thank you for giving me a laugh at your attempts to be of value to society","commenter_a":"Honesty is not an option in Obamas picks.","post_message":"Cruz explains what McConnell SHOULD have done."},{"comment_id":"1234054046635197","commenter_b":"Mary Williams jealous of a Roger Ailes flunkie?","commenter_a":"I freaking hate Megyn Faux News Kelly. Arrogant, narcissistic twit.","post_message":"Holy crap! D.L. Hughley called out Megyn Kelly and Fox News for their coverage of police brutality and he did not mince words."},{"comment_id":"516575861835702","commenter_b":"Just shut the fuck up.","commenter_a":"Here a question , if tuition is free in the next years , does my daughter get a \" Refund \" on what she has paid in so far ?If Debt relief is on the table then she should be paid back for having the cash up front to pay for her school....right ?","post_message":"\"He said if a million students march on Washington for free college, that's the only way we're going to win. That's a really inspiring thing to hear.\""}]
