[{"comment_id":"10156128714545725","commenter_b":"About time he helped his teammates out","commenter_a":"Them mugfucken Cubs been killen","post_message":"What a game! Let's hear it for the Cubs ----> @webpagelink"},{"comment_id":"10156032956110500","commenter_b":"I got pulled over last night for four miles an hour over the speed limit and my license plate light out. I was courteous to the officer and he to me. In the end I simply got a warning from and a thank you for my courtesy towards him. I told him thanks for only a warning and for letting me know the light was out cuz I really didn't know it was. Common decency goes a long way. That woman is lucky she didn't get taken to jail for the speeding infraction. Hope she tries to challenge the ticket in court and that video gets played","commenter_a":"think she was black is what I think","post_message":"SAY WHAT? You might find it hard to believe what a driver said to a Palm Beach County Sheriff's Office deputy.  WATCH VIDEO-> 8.wfla.com/1FylO8y  What do you think of the woman's comment to the deputy?"},{"comment_id":"893070080803922","commenter_b":"I wouldn't vote for Killary,If she was last person on Earth! She A Liar and a Bad egg!!","commenter_a":"The movie idiocracy.....we are living it!","post_message":"Jesse Watters: \"What do you think Hillary Clinton's biggest accomplishment has been?\"  Answer: \"She has gone around to certain places – Brooklyn, she's been to Queens.\"  MORE: @webpagelink"},{"comment_id":"10152781653123717","commenter_b":"That girl needs some help!","commenter_a":"wtf is that on the bottom left?","post_message":"Manchester police say an investigation into prostitution in the Queen City led to the arrest of six people. @webpagelink"},{"comment_id":"10154024404718352","commenter_b":"Does that look like a white family bitch???? Go fuck your self","commenter_a":"Truth is that Mom's don't know, my stepfather abused me from 4-12 and I never said a word till I was 19 although my mom asked us many of times had anyone ever touched us we always said No because not only was their sexual abuse there was physical abuse, we we're scared he was going to kill us or or mom would kill him we were worried we'd have no one... 10 is so young if she did have a stomach her mother didn't notice nor did her teachers until the birth.... All I can say is he'd be dead once I found out","post_message":"10-YEAR OLD GIRL BIRTHS BABY AT SCHOOL AFTER THINKING IT WAS JUST A TUMMY ACHE"},{"comment_id":"437108856413709","commenter_b":"He will CERTAINLY BE BETTER THAN THE MORON IN THE WHITE HOUSE NOW!","commenter_a":"Agree","post_message":"\"I will be the greatest jobs president that God ever created\". Agree or disagree?"},{"comment_id":"1212113488867185","commenter_b":"Why is it that the LIBERALS are the one who ALWAYS scream the loudest whenever Voter I.D. is even mentioned let along being considered?","commenter_a":"DESPERATE DEMOCRATS KNOW THEY CANNOT WIN FAIR AND SQUARE, THEY RESORT TO UNDERHANDED AND DEMORALIZING TACTICS!!","post_message":"Libs everywhere were thrilled when Texas' voter ID law was struck down by the courts, which ruled it it was too restrictive. That's when they read the fine print, though...  All of a sudden, liberal jubilation turned to rage and tears."}]
