[{"comment_id":"10156702895000354","commenter_b":"Yeah, poor Oprah. She probably is forced to shop at second hand stores.","commenter_a":"Black women have black privilege","post_message":"Guess how many millions of dollars actress 25-year-old Jennifer Lawrence made in 2015...  *Hint: it's more than you will make in a lifetime--by FAR"},{"comment_id":"10154502038936077","commenter_b":"There is no good reason to watch episodes I, I I, or I I I. They suck, and you know most of the back story just by watching the originals. Episode VII was a great movie and I imagine this one will be as well. The second set of three are trash.","commenter_a":"Daniel Roach","post_message":"Do you agree?"},{"comment_id":"10153442792427232","commenter_b":"Have you seen all the arrest of that originations leaders?","commenter_a":"Much like their spoksperson...LoL","post_message":"The civil rights group approved the measure Saturday at its national convention in Philadelphia to end the boycott of tourism and other economic activity. STORY HERE: @webpagelink"},{"comment_id":"1787942078130672","commenter_b":"It's a good thing you are there, because you have no idea how evil and vile that woman is.","commenter_a":"I'm not from america , i live in morocco , but i hope from the bottom of my heart for clinton to win and she really deserves to be the president of the white house because if trump was elected he is gonna make america a hell place on the planet earth","post_message":"Barack Obama was elected the 44th President of the United States on this day 8 years ago."},{"comment_id":"10156035361815354","commenter_b":"and its only the begining","commenter_a":"WHAY ELSE????","post_message":"An UNDERWATER tunnel."},{"comment_id":"870676293063413","commenter_b":"She can leave anyway. Useless","commenter_a":"Well,bye","post_message":""},{"comment_id":"1037202013040797","commenter_b":"@username oh go screw yourself you ignorant idiot i could care less about what you think ....arrogant pig","commenter_a":"Just goes to show what kind of trash is on trumps payroll he is nothing but a pig and so are his delegates OPEN YOUR EYES PEOPLE he is nothing but a piece of crap","post_message":"The Trump campaign said the man will be replaced immediately."}]
