[{"comment_id":"10153423460374087","commenter_b":"@username You will be pleased to know that I will be running for president in 2036, with @username as my running mate. We will be running on the Republican ticket which should also please you. Donald Trump is a man of one line punches with no specificity as to how he will execute his policies. I don't believe that building a wall will solve our immigration problems and banning the immigration of Muslims into the United States is unconstitutional. The First Amendment states, \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof.\" Banning Muslims from entering this nation goes against the beliefs of what our founding fathers envisioned for this nation. Now, I am not in favor of President Obama's policies and actions, but I do believe that there are much more suitable candidates for the office than Mr. Trump, at least until ...","commenter_a":"@username what politics have come to, smh","post_message":"Donald J. Trump's daughter Ivanka Trump says she may make her own political run one day."},{"comment_id":"1711501568866157","commenter_b":"Another fool... how many Muslims are you taking home?","commenter_a":"More than half of the damn country is colluding to get rid of his incompetent dumb ass! On the other hand he doesn't even need to be investigated for colluding with Russia!!!","post_message":"Donald Trump's administration is to charge Barack Obama with treason for colluding with the Deep State to overthrow The President."},{"comment_id":"10153615775017235","commenter_b":"In actuality, the video is being shown in reverse to make the officer look bad. He was actually using his gun to pull bullets out of the man in an attempt to save his life.","commenter_a":"I can show you a video where it looks like a deputy shoved a mans face into the wall. Then when you see it from the other angles you will see that the man tripped and the deputy tried to reach for him.","post_message":"Watch this. This is awful"},{"comment_id":"10153605499851509","commenter_b":"She's doing a great job just having the officers do nothing other then standing around . These Cops should be arresting them instead shes giving these rats a free for all . Disgusting","commenter_a":"Mayor is an idiot. Saw it coming, said had to give people space to destroy, DID NOT CALL A CURFEW, and tomorrow school is cancelled, wonder what the kids will be doing tomorrow DAAAAAAAA","post_message":"What started as peaceful protests days ago have turned violent, with stores being looted, rocks being thrown at police and buildings and cars set on fire. Here's what we know happened today leading up to the violence: @webpagelink #BaltimoreRiots"},{"comment_id":"10153804494893132","commenter_b":"Stfu!","commenter_a":"Michael Jackson: Year one clean of touching little boys.","post_message":"Eat like a King (of Pop) on Michael Jackson's birthday."},{"comment_id":"10153732380134091","commenter_b":"Perras mamadas no hay derecho probe criatura","commenter_a":"Terrible","post_message":"\"Take everything please. Don't kill me please.\" Those were the tragic dying words of an 11-year-old boy who was killed this week on his walk home from school."},{"comment_id":"10153287384469714","commenter_b":"We never like skinny models.we love skinned and boned and toned models that should take the run ways","commenter_a":"I think people don't get it. It's attractive to be thin but you don't have to starve yourself. You don't have to be super skinny. People like a nice figure but above all a nice personality. You don't have to kill yourself to have a nice figure. Eating right and working out makes you look nice and feel better .","post_message":""}]
