[{"comment_id":"1300696676663751","commenter_b":"Fuck yo bitch ass fuck you too pussy","commenter_a":"Fuck Donald Trump orange ass","post_message":"Clearly wasn't feeling the jersey!  #WSHH #WakaFlocka"},{"comment_id":"698707680267099","commenter_b":"@username ....and dumbasses vote for Hillary","commenter_a":"Liars will always call other people liars to hide the fact they are liars....haha. Seriously, he is a POS and he is nothing but a racist, a liar, a cheat, a thief, and I could go on. He is a danger to America....and if he can't run his casinos, his own campaign, think about what he will do to America. He will run it into the ground. It is pretty scary to think if he gets in the Whitehouse, he will insult other countries, and possibly be the first president to incite a war because of his mouth.","post_message":"\"Hillary Clinton  may be the most corrupt person ever to seek the presidency of the United States,\" Donald J. Trump  said."},{"comment_id":"1303084943055048","commenter_b":"And I would make the vandal pay for it too!","commenter_a":"Looks better like this.","post_message":"Donald J. Trump just got hacked."},{"comment_id":"578168169046751","commenter_b":"We do still have freedom of religion but I think these women would be so much better off just being free of wearing a hijab. Their so oppressed by men. Dumb the religion and live your life without restraint","commenter_a":"Let's say wear whatever you want in public, but when you go into a store, gas station, etc., EVERYTHING comes off from the neck up. Sunglasses included. And how about we lower the surveillance cameras to head height so we can get a decent face picture instead of a grainy aerial shot. Why are we continually so bad at surveillance? Be whatever religion you want, but for everyone's public safety, we deserve to get a good look at you so we can quickly identify you later on. Nuf sed.","post_message":"Pretty soon it may be illegal to wear a hijab in public in Georgia. Do you think the ban would be a good thing?"},{"comment_id":"10153055610099877","commenter_b":"Do you see the sick people that are holding office? Beautiful child; disgusting/sick thought pattern to justify abuse.","commenter_a":"The mind can be a wicked thing!!!","post_message":"Republican lawmaker: Rape can be ‘beautiful’ if it produces a child.    Grio fam, do you think anti-abortion laws should make exceptions for victims of sexual assault?"},{"comment_id":"10157089622540206","commenter_b":"White woman","commenter_a":"@username racism at it's finest","post_message":"“Because we aren’t whitewashed enough in Hollywood, apparently,” BET tweeted."},{"comment_id":"10155034427609197","commenter_b":"@username you need to kno this too, @username n Dayna Bianca Haskins too. Pass the word..","commenter_a":"@username fyii","post_message":"Could finding something on your car hood mean your safety is at risk? See why one woman's Facebook post is going viral!"}]
