[{"comment_id":"1385280774831907","commenter_b":"#NEVERTRUMP #NEVERHILLARY #NEVERBERNIE @webpagelink","commenter_a":"Have stop watch Faux News! #nevertrump","post_message":"\"In Hillary's America we focus on Hillary, but we also focus on the whole sordid history of the Democratic Party. We're telling an unknown story, and it's going to rile up this race.\""},{"comment_id":"10153000609386491","commenter_b":"The Russian lady nailed it. For me, I don't want kids and that is unacceptable to so many people. She only wanted one and that was JUST AS UNACCEPTABLE! We know what we want our families to look like. Trust us, we're women!","commenter_a":"I respect your decision to not have kids. Some people don't. It's an important job that should only be done by people who want you. BUT, I think making a decision like that at 28 years old was a little rash. A lot of things change. I had my daughter when I was 39 years old. Things that make you happy in your 20's are not necessarily going to be the same for the rest of your life. And, don't be sad for people who tell you that there is no greater love than one for a child. There isn't!! Don't knock it just because you don't understand.","post_message":"“What I want is to be happy.”"},{"comment_id":"1466756690087245","commenter_b":"Flynn has resigned!!!","commenter_a":"IMPEACH TRUMP NOW","post_message":"\"I think this guy is somebody who might want to think twice about whether he stays in the position that he has.\" -- Bernie Sanders"},{"comment_id":"512162555660096","commenter_b":"@username, Kanye will never be President.","commenter_a":"Trump","post_message":"WATCH: Video of full Donald Trump campaign rally in Phoenix, Arizona."},{"comment_id":"10153871706276051","commenter_b":"Who wears Crocs anymore?","commenter_a":"Debbie Pruitt French","post_message":"Do you wear Crocs? If so, you're probably going to want to stop ASAP."},{"comment_id":"10153969905469575","commenter_b":"Translation ?","commenter_a":"The bus should not pass that test bc there was something wrong if bus driver try back out but it's still jump forward an hit students an a frav principal an it's be proof on wthr new long time ago when they was look why bus have problems pass the test!","post_message":"In their inspection last night, police found nothing mechanically wrong with the bus involved in the fatal crash at Amy Beverland Elementary School.  Police are still awaiting the toxicology results from the mandatory blood draw, but the bus driver showed no signs of impairment."},{"comment_id":"10153167916826336","commenter_b":"I don't understand it either.","commenter_a":"They should have just as much of a right to stop and salute the flag as anyone else. Baseball is America's pastime and they deserve the right to respect the country.","post_message":"Workers say ordering them to work through the singing of the national anthem is disrespectful."}]
