[{"comment_id":"1834572823431236","commenter_b":"\"Sick\" being the operative word in this article, I and the whole world are Im sure sick of these people and their outwardly show of solidarity to the outside world to get what they want, they will never integrate, that's a fool's paradise, so all those do gooders, I hope you are happy with what you have welcomed into Christian Countries. Im off to celebrate CHRISTMAS and Happy Christmas a million times over to these sick perpetrators of evil, may our God show no mercy on you.","commenter_a":"Insane, on the highest level. How dare they exploit children like this.","post_message":"Sick parents say goodbye to their children before one of them blows themselves up in suicide attack."},{"comment_id":"474611692726438","commenter_b":"Dear god. If I were Trump, and that batshit crazy woman decided to endorse me, I would bow out gracefully. Tail between my legs. Holy cow. She is a kook.","commenter_a":"How was she ever elected Governor!!!!!!!","post_message":"Sarah Palin endorsed Donald Trump on Tuesday. The result can only be described as Palinesque."},{"comment_id":"724989260938156","commenter_b":"Honestly I wouldn't blame people for moving to canada if trump got presidency tonette kamakahi-gumapac","commenter_a":"Votefor Trump Happy Easter. Let's spend next Easter with Trump in the White House!","post_message":"Happy Easter to all, have a great day!"},{"comment_id":"10153979603521509","commenter_b":"Time for all illegals to go home","commenter_a":"Rather have trump in kkk then black panther party","post_message":"Former Ku Klux Klan leader David Duke said Donald J. Trump is the \"best of the lot\" -- but didn't endorse him for 2016: @webpagelink"},{"comment_id":"10152774860755927","commenter_b":"Is this wife beater and Obama DNA guzzler still relevant?","commenter_a":"The question is does Reid understand the U.S. Constitution? He should not try and put pressure on the Supreme Court. Reid is a pathetic old ugly man. He is mean and unhappy in life. Can't wait till he is standing before his Maker. Won't be a pretty sight for sure","post_message":"WATCH as Senator Harry Reid maligns the U.S. Supreme Court on forthcoming Obamacare decision "},{"comment_id":"10154043523939203","commenter_b":"Mr Pope! Tear down that wall!","commenter_a":"If somone keeps coming on my porch and coming in through my door and rapes and kills, at some point I am going to lock the door!","post_message":" person who thinks only about building walls, wherever they may be, and not of building bridges, is not Christian.\""},{"comment_id":"10153905891802629","commenter_b":"Hahahah. Have you seen Trump's demographics?","commenter_a":"Those bitches are sexist not voting for a woman","post_message":"Ladies be Bernin'."}]
