[{"comment_id":"10153987502144087","commenter_b":"Hillary is by no means a \"girl\". She's an old mentally disturbed hag.","commenter_a":"Wait, Hillary's a girl?","post_message":"Elizabeth Warren: \"[Donald Trump] makes death threats because he's a pathetic coward who can’t handle the fact that he’s losing to a girl.\""},{"comment_id":"591316744410090","commenter_b":"Rachel is such a Clinton lover.","commenter_a":"She is as Slimy as he is. All they have is harass Hillary. Guess what. It doesn't touch her. #ConManTrump #Hillary2016 #imwithher #StongerTogether #Trumpstaxreturns","post_message":"What is Donald J. Trump's stance on immigration? Trump campaign manager Kellyanne Conway stops by The Rachel Maddow Show to shed some light.  More from Rachel Maddow's interview with Kellyanne Conway: @webpagelink"},{"comment_id":"10153433309476051","commenter_b":"Tie her up in the yard with a plate of chicken wings just out of reach","commenter_a":"No compassion, no conscience ,scruples,morals..nothing but a worthless excuse for a person.I hope she has no children.","post_message":"Officials took one look at what this woman did to her dog and arrested her immediately."},{"comment_id":"10153396663904170","commenter_b":"She would HAMMER Hillary.. :)","commenter_a":"If Fiorina is blocked from the Republican debate in New Hampshire she should challenge Hillary to a debate there. Woman VS Woman. Hillary would never take the challenge, still the gauntlet will have been thrown.","post_message":"I love seeing GOP candidates use the media's \"gotcha\" questions to their advantage. Fiorina is turning it into an art form."},{"comment_id":"10152608166460667","commenter_b":"This is about as bad as actresses who make 10 million a film talking about income inequality","commenter_a":"American Sniper sucked! It was full of conservative propaganda. I'm shocked it was even nominated.","post_message":"Oscars count: Grand Budapest Hotel: 4 Birdman: 4 Whiplash: 3 Boyhood: 1 The Imitation Game: 1 Selma: 1 The Theory of Everything: 1"},{"comment_id":"10153728622221336","commenter_b":"Women do have their own football league, Jake...","commenter_a":"A lot of sexist men just cried.","post_message":"The Oakland Athletics have hired Justine Siegal, MLB's first female coach.  Siegal is also the founder of Baseball For All, a nonprofit organization that provides meaningful instruction and opportunity in baseball, especially for girls. @webpagelink"},{"comment_id":"10158042812305551","commenter_b":"I have trouble with Rhinos who profess to be one thing, but are LYING. I have not trusted John McCain for several years. I am beginning to wonder about Marco. Time will tell. As for Hillary and John Kerry, They are trying to destroy what America stands for and that is FREEDOM. Than there is Eric Holder who along with Obama and Clinton, sold guns to Mexico Mafia. Corruption is what WE THE PEOPLE are sick of.","commenter_a":"Trump is right again. John McCain is no war hero and never has been.","post_message":"Two Senators Have a Problem with Tillerson, but not Hillary Clinton or John Kerry"}]
