[{"comment_id":"10154030694113812","commenter_b":"I think the kind of look like little foxes... so cute!","commenter_a":"I don't know the reason they call them red pandas when they resemble Raccoons","post_message":"After a 2-year hiatus, red pandas have returned to the Smithsonian’s National Zoo and Conservation Biology Institute."},{"comment_id":"970547099705011","commenter_b":"Senior women for Democrat.","commenter_a":"All I know is that seniors tend to vote for republicans. Go ahead, drug test them. Before you knew it, you don't have their votes anymore.","post_message":"He's the one that should be drug tested."},{"comment_id":"10155922190175725","commenter_b":"#FuckTrump","commenter_a":"Trump 2016!!!","post_message":"Watch my interview with Eric Bolling that aired today- @webpagelink"},{"comment_id":"704776766379568","commenter_b":"Yes deport them","commenter_a":"Only if it's to hell. I would never let her lose on another","post_message":"Controversial photo of Michelle Obama has many calling for deportation.  She doesn't deserve to be our First lady.  Would you vote to have Michelle Obama deported?"},{"comment_id":"958028154307215","commenter_b":"@username bitch!","commenter_a":"Does she realized she joined the military to defend the constitution....if she is that ashamed of America, she should request a dishonorable discharge.","post_message":"A sailor refused to stand for the National Anthem. She might be in big trouble over the protest. Should she be punished?"},{"comment_id":"490189094517729","commenter_b":"USE PEPPER SPRAY TO PROTECT HER......SHE IS A MASTER PHD CROOK LIAR....THIEF....","commenter_a":"Cheating Trump is lying when he open his mouth and lied when he closed it. @webpagelink","post_message":"Crooked Hillary wants to get rid of all guns and yet she is surrounded by bodyguards who are fully armed. No more guns to protect Hillary!"},{"comment_id":"10153550456286337","commenter_b":"Fat lisa loeb looking bitch","commenter_a":"Yeaaaaaah... That guy can fuck directly off.","post_message":"\"Somebody who’s overweight? I find that utterly repulsive and disgusting.\"  WORST. TRAINER. EVER."}]
