[{"comment_id":"10152564279192623","commenter_b":"Notice everytime it moves up and down is when she brakes. It falls forward when she brakes. And honestly this woman in the front car has been a menace for a while now! It's about time someone got proof of her ridiculousness.","commenter_a":"the cops were called. she started in back of driver redneck lady tried to run lady and child off road first time. and slowed down to let the other in front. the phone was in a dashboard holder while taping driver not holding phone.","post_message":"WATCH: Road rage out of Randleman.   Just tilt you head and wait until about the 3-minute mark.  Egads.  Warning: Language and gestures may be offensive to some."},{"comment_id":"10153808795866336","commenter_b":"@username Typical Illegal Alien.","commenter_a":"Frankly it feels lousy to be called a murderer when all I'm trying to do is keep you safe. Im not a murder. That is slanderous. That is not how I act","post_message":"Quentin Tarantino has finally responded to the firestorm that’s been brewing since he criticized police officers at a rally last weekend, and he says he won't be \"intimidated.”"},{"comment_id":"991109084315479","commenter_b":"And those politicians won't change anything until one of them gets shot","commenter_a":"By law, the police can't do much of anything until the shooter opens fire. If he verbally threatens someone, that can bring the police into it. But by that time, someone may already be dead. Don't blame the police, don't blame the dispatchers, blame US.....because we elect the politicians that pass these laws!","post_message":"Once again, the NRA has blood on its hands."},{"comment_id":"10152820448531051","commenter_b":"John Jo, you say, don't fight the battle until they come knocking on your door, well how many Americans have been killed, beheaded, this isn't knocking on our door ,than what is. He's the BIGGEST POS TRAITOR WE HAVE EVER HAD, HE WILL GO DOWN AS THE WORST PRESIDENT IN HISTORY. HIS ONLY CLAIM TO FAME, HE TRIED TO DESTROY THE UNITED STATES. HIS ASD SHOULD BE IN PRISON.","commenter_a":"Thanks to Obama!!!","post_message":"As if ISIS didn’t have enough weapons at their disposal – now they have chemical weapons."},{"comment_id":"961446100576222","commenter_b":"Send the worthless goat-f***ers home!","commenter_a":"Don't send them to America!","post_message":"UNREAL! Muslim 'Refugees' Camp At Terror Memorial And Protest Over Lack Of Housing In Paris [Video]"},{"comment_id":"10154856564546438","commenter_b":"Fake IDs fake visas...so why are we sure illegals never voted?? Illegals pose threat because of how much they owe coyotes that families back in Mexico maybe threatened if they dont run drugs for cartels...Trump is right to close this border.","commenter_a":"Ooooo","post_message":"\"You notice the Republicans are not saying, 'Hey, those aren the facts,' or 'something has changed,' or 'he did all these other things afterward.' No, what they saying is, 'You don get to talk about that.'"},{"comment_id":"10155521409275354","commenter_b":"Europe is more evil but we r getting there","commenter_a":"The US is so backwards when it comes to nudity. It's commonplace in Europe.","post_message":"Free the Nipple!"}]
