[{"comment_id":"10154062407918812","commenter_b":"The kids in low income areas would just grow up as failures and,we'd support them as inmates. Abortion is cheaper in the long run, and saves people from being victims of their future crimes.","commenter_a":"$500,000 doesn't compare to the $500 Million taxpayer dollars that go to the organization that is (Un)Planned Parenthood, strategically placed in low income areas across America and helps thousands of new mothers kill their own children in their own wombs. Can the Fed do something about that??","post_message":"Oregon governor says armed group’s continued occupation of federal land has cost taxpayers nearly $500,000."},{"comment_id":"1639044993063408","commenter_b":"Hahahaha english language correctly? Hahahahahahahahaha english language accurately yiu filthy Camel Cunt. India will rape your mother and your sisters till kingdom come. We will shove the Quran up your mom's asshole and tear it open page by page. When yiu stick yiur forehead on the ground and say allahu fuckbur your mom will moan with pleasure coz her vagina will be stuck to your forehead. Go fuck a camel you cunt l.","commenter_a":"Arabs will and have never won against Israel. If I were Arab I'd get on me camel and hoot into the unknown if me desert shit hole.","post_message":"LIVE: Netanyahu responds to Kerry speech on Middle East"},{"comment_id":"10154255486503812","commenter_b":"@username She was talking about your looks (see, that's a joke).","commenter_a":"Because seeing a gigantic animal in front of your car with your own eyes is somehow just too hard these days.","post_message":"Moo-ve over! Volvo shows off its large animal detection system coming to its vehicles in 2017."},{"comment_id":"10153051963761350","commenter_b":"Honorary Dame in England is a big honor -","commenter_a":"I'm a fan Angelina you too pope francis","post_message":"First comes being named an honorary dame by the Queen of England, and now Angelina Jolie is shaking hands with the pope!"},{"comment_id":"638502853006960","commenter_b":"I love this picture, can you see michael adams apple. Women do not have one.","commenter_a":"I wonder if she refers to her own mother that way. Btw, the mother who also lives in the White House at our expense.","post_message":"Michelle Obama just insulted mothers everywhere... You'll be furious.  We're sick and tired of hearing about her. Let's make her go away forever.  'LIKE' if we should kick Michelle out of the White House!"},{"comment_id":"1052170041539020","commenter_b":"she sucks","commenter_a":"Great","post_message":"Clinton is clobbering Trump in poll after poll."},{"comment_id":"863959926995293","commenter_b":"Denise Lange-Baker ugly ugly ugly. @username stupid stupid stupid. Denise & Tim inbreeding at it's best","commenter_a":"Sen Blunt does it hurt to be so stupid. I imagine it must hurt","post_message":"I’m proud to co-sponsor Senator Johnson’s bill to stop President Obama’s lawless #immigration power grab. I’ll continue to working with my colleagues in the House and Senate to fight against the president’s executive amnesty and his blatant disregard for the law and the Constitution. #StopObamasAmnesty"}]
