[{"comment_id":"10153268885327452","commenter_b":"COWARDS","commenter_a":"Nancy, you cannot be serious surely...better for who? It's always been dreadful since the concept of Zionism reared its ugly head and will never be any better only worse until Zionism is banished totally and the Palestinian people allowed to dictate their own terms. Israel should have no say in the matter, only the people who lived in Palestine and can prove it, no matter what their religion, should have the say in the reconstruction of Palestine. If squatters are to be repatriated whence they came so be it including Government ministers down to the last one of them.","post_message":"Mahmoud Alayan was fatally shot by an Israeli soldier while carrying a stone in his hand"},{"comment_id":"1000833690051404","commenter_b":"@username ugly bitch but you so obsessed with nigger videos","commenter_a":"I scrolled through the comments hardly any white folks made comments why? Let this had been a story about someone doing all this to dogs, cats or a damn hamster and there would be uproar they would have condemned this women to the hottest pits of hell.","post_message":"8 Gruesome Facts About Notorious Female Slavemaster Madame LaLaurie"},{"comment_id":"10152692514188299","commenter_b":"All this talk...............start calling your congressmen, bombard them with calls until they DO something....................","commenter_a":"What the hell is wrong with this guy? Most Americans are against this.","post_message":"Five More Terrorists Transferred Out of Gitmo … @webpagelink"},{"comment_id":"543491929108734","commenter_b":"Good, send her to prison then send her to Isis!","commenter_a":"She should be jailed for life.","post_message":"For weeks, this Muslim woman sat behind her computer spreading hate and threatening the 'infidels'. She thought she was going to get away with it, then she heard a knock at the door."},{"comment_id":"10153451466636336","commenter_b":"That's why I tagged you in this lol","commenter_a":"Sarah Garvey","post_message":"NEWLY RELEASED: The official images from the christening of Princess Charlotte have been made public by Kensington Palace."},{"comment_id":"1023562641110247","commenter_b":"Conservatives can also be whiny. Like, OMG THE IMMIGRANTS ARE STEALING OUR JOBS OH NO I HAVE TO GO RE-TRAIN. I'M ENTITLED TO JOBS HERE.","commenter_a":"I don't know about my liberal comrades, but I went to work, paid bills, look after my kids, helped my neighbor fix his car, and drank. In fact I don't know a single liberal friend that did any of those","post_message":"It's a scary thought..."},{"comment_id":"698051370361332","commenter_b":"13th amendment, 14th amendment , 15th amendment. How many democrats wanted to abolish slaves, give citizenship to freed slaves ,and allow black to votes. And how many republicans wanted that. We can start there.","commenter_a":"@username @username learn from this man. Love you ladies","post_message":"Standing up for his beliefs!"}]
