[{"comment_id":"1715971748670504","commenter_b":"@username is not clearly thinking. What the soldiers need and what is spent, often wastefully, through our War budget are two separate things.","commenter_a":"Increase. I bet everyone saying to decrease posts those names on veterans day saying how you support the military. Obama cut meals for troops in a war zone. SMH","post_message":"U.S. Military Size: Increase, Decrease or Stay the Same?"},{"comment_id":"1766066213681675","commenter_b":"@username trophy wife No. 3 was a soft porn model who also lies like through her teeth. No wonder she squints so much, trying to find her sugar daddy's pee pee!","commenter_a":"\"Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s.\" --Melania Trump","post_message":"\"Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s,\"  Charles Harder, a lawyer representing Trump, said in a statement."},{"comment_id":"10153700532617894","commenter_b":"Make me. Hip hop is my lane. Silly woman.","commenter_a":"What is she doing at a T.I. concert if she don't want too be questioned.","post_message":"Model Shot at T.I. Concert to Sue ‘Heartless’ NYPD for Treating Her Like a ‘Criminal’ During Their Investigation"},{"comment_id":"10153821104831336","commenter_b":"@username sad indeed. Alana should shut her nasty mouth.","commenter_a":"I wish Obama would show the same respect for our troops. Oh my bad he puts illegal immigrants first before the fine men and women Who served our country.","post_message":"Today, Britain observed the annual Remembrance Day, a Commonwealth of Nations memorial day honoring armed forces who have died in the line of duty."},{"comment_id":"10153254470474330","commenter_b":"I do not have girls, but if I did I would not let them wear either one of the dress below. they both look trashy, Asking for Trouble","commenter_a":"The guidelines may be appropriate.....yet they would have been honored if not considered had they come a month (or more) ago while these young women were shopping for the dresses!! Kids need to learn dress code acceptance to match the occasion...and while not promoting prudeism - if that is a word, my parents in the 60's would encourage us to leave some stuff to the imagination!","post_message":"Some controversy is brewing over prom dresses at Shelton High School. On Friday, the headmaster announced that dresses with slits, cutouts and backless styles wouldn't be allowed at prom. However, students and parents say the crackdown comes too late. They already bought the dresses. ---> @webpagelink  What do you think? Should the dresses be allowed or not?"},{"comment_id":"863998766982005","commenter_b":"Women. Are. Psycho.","commenter_a":"not worth it.","post_message":"A woman has died in a car crash after chasing down her husband who was with another woman. What do you think? Crazy details here:"},{"comment_id":"1785965414966824","commenter_b":"Ancient celts had hair like dreads as well. This is her putting a modern spin as an absolute.","commenter_a":"My life my world my rules. You dont tell me what to do","post_message":"It's everyone else's fault!"}]
