[{"comment_id":"10153486843809091","commenter_b":"I hope his whole family is murdered in front of him","commenter_a":"Good!!!!","post_message":"JUST IN: A teen  from Paterson who was involved in a 'knockout game' attack posted to social media has turned himself into police. --> @webpagelink"},{"comment_id":"1171823469552530","commenter_b":"Says the self loathing woman...","commenter_a":"Go find your safe place and cry. Omg please. Give up already Donald j trump is the president","post_message":"What do you make of this? These celebrities are among the stars taking part in a telethon airing on Facebook Live during Donald Trump presidential inauguration, which will raise money for Planned Parenthood and the environmental group Earthjustice."},{"comment_id":"1384175518259929","commenter_b":"Oh maybe he doesn't want the Hillary supporters burning down our country!!","commenter_a":"Y'all got conned. 😂😂😂. Only idiots would believe him. Go ahead, chant \"Lock her up!\" If there was a reason to, he would - but there isn't.","post_message":"President-elect Donald J. Trump does not plan to pursue charges against Hillary Clinton for her personal email server or allegations of pay-for-play at the Clinton Foundation, senior adviser Kellyanne Conway says. @webpagelink"},{"comment_id":"1439684252723748","commenter_b":"Hilary is definitely not as bad. You got complacent about gore in 2000 and inflicted gwb and eight years of mayhem on the rest of the world","commenter_a":"Lord have mercy on everyone in the world if he's elected president. Somebody keep that from happening - pleeeeeease ...","post_message":"Donald Trump is spiraling out of control."},{"comment_id":"10156214701425725","commenter_b":"Look at the mad illegal alien","commenter_a":"Look at all the brainwashed Donald Trump fans... Lol","post_message":"Who is winning the debate so far (just last name)? #DemDebate"},{"comment_id":"1021126491243474","commenter_b":"And yet a student did intervene verbally and is still alive.","commenter_a":"Shame on that teacher for not standing up for that student. Even if she was being disruptive in class she still deserves to be protected and treated with decency.","post_message":"When a white Spring Valley cop brutally assaulted her classmate, Niya Kenny sprung to her defense.  How could she have known what would happen to her next  just for speaking up? #AssaultAtSpringValleyHigh"},{"comment_id":"10153033979746378","commenter_b":"She was a dummy","commenter_a":"Just wondering... Why does everyone care now all the sudden","post_message":"A woman has been arrested after removing Confederate flag from outside South Carolina Statehouse."}]
