[{"comment_id":"1825166017710828","commenter_b":"BUILD THE WALL!!! Go Trump","commenter_a":"Trump now has my vote. This lawlessness has to stop. There is nothing racist about wanting to enforce laws that apply to everyone. I do hope he can be talked out of the wall though. We need improved cooperation and relations with Mexico. Not a big wall dividing us. Both countries need to crack down on crime and make sure people moving between the two countries do it legally. Only way to have a civilized society is to enforce the laws. If laws are unfair, let's change them. But let's do it legally and civilly. Trump is not the racist monster that the liberal propaganda machine makes him out to be.","post_message":"\"Hundreds of cars were forced to make a U-turn less than three miles from a Donald Trump rally today after protesters parked in the highway to block Trump supporters from reaching the event.\""},{"comment_id":"10154086770281756","commenter_b":"I guess science works when ranchers feed their cows corn instead of grass and then have to shoot up the same cows with tons of antibiotics because they are eating GMO corn instead of organic grass. Guess what? Those antibiotics are transferred to humans who eat meat and cause cancers in humans. Be safe, don't eat meat or during dairy milk.","commenter_a":"Why? Wouldn't this be a conflict of interest? It behooves hospitals to feed their patients meat with as many antibiotics as possible so people would visit again in the future and hopefully for a much longer stay.","post_message":"Hospitals are on the front lines of the battle against antibiotic resistance."},{"comment_id":"1728134044133544","commenter_b":"Screw off with trump both candidates suck","commenter_a":"IM STAYING AROUND TO SEE HOW BAD IT IS HAHA","post_message":"This was a \"Behind the scenes TV Production Meeting\".  The really good part to me comes about half way through where we begin to discuss show on future tech and AI."},{"comment_id":"10153051549632169","commenter_b":"She will always genetically be a she period Cat is not a dog just because someone wants it to be","commenter_a":"Why are my tax dollars and donations going to publish this crap????","post_message":"From FRONTLINE:"},{"comment_id":"10155818852335354","commenter_b":"Fucking assholes!! The Dukes weren't racists!! God this country is full of weak kneed liberal scum!","commenter_a":"This is really getting crazy,who,s running this country anyway.We didnt used to have such nonesence.","post_message":"Absurdity..."},{"comment_id":"726868034170441","commenter_b":"It's our Flag. If it offends someone they need to look the other way until they LEAVE OUR COUNTRY!!!","commenter_a":"Fly high Old Glory!","post_message":"Texas man ordered to take down American flag because it offends Muslims. In our country we fly our flag. This is absurd. Do you think this is ridiculous?"},{"comment_id":"970231249739794","commenter_b":"Wth are you talking about? What woman? What illegal alien?","commenter_a":"The woman killed in San Francisco by an illegal alien will never go out with her father again.","post_message":"Some quality dad time!"}]
