[{"comment_id":"10152942237502452","commenter_b":"My question is.... Wtf was she doing in lake elsinore....","commenter_a":"Why was she in Lake Elsinore?","post_message":"The owner of Wolfee Donuts in Lake Elsinore wants an apology from Ariana Grande after surveillance video allegedly caught the pop star licking doughnuts at his shop. abc7.la/1CqmnVO   Grande also says \"What the **** is that? I hate Americans. I hate America\" when a tray of doughnuts appears in front of her."},{"comment_id":"10152783930412293","commenter_b":"Tom terrorist deserve to be pooped on and have there have there heads cut off","commenter_a":"I could hv done the same thing..those animals hv no respect for life so u respect them in death?","post_message":"The story of a Marine sniper, dead at 28, and the 38-second video clip that became part of his legacy."},{"comment_id":"1071940456151087","commenter_b":"the medias role should be to challenge state lies... now their main role is to amplify it","commenter_a":"this is not good.","post_message":"Barry Grey: Addressing the United Nations General Assembly on Monday, President Barack Obama portrayed himself and the US government as the preeminent defenders of international law and diplomacy. He did so even as the catastrophic consequences of the illegal wars of aggression he has overseen continued to send waves of refugees fleeing the ruins of entire countries—including Afghanistan, Iraq, Libya, Syria and Yemen—and as Washington took new steps to turn Eastern Europe into a militarized zone for eventual war against Russia."},{"comment_id":"10153372997486051","commenter_b":"It's a shame that she's no longer here and those 3 scum-bags are. Too bad she couldn't have shot all 3!!!!!!!!","commenter_a":"The fearless leaders kids.","post_message":"This 76-year-old woman was confronted by 3 attackers. Rather than giving in to their demands, she reached over, grabbed a gun and decided to take all of them on."},{"comment_id":"10152991625460409","commenter_b":"GOD BLESS GOV RICK PERRY. I PRAY IF THE LORD LEADS YOU TO RUN FOR THE PRESIDENCY THAT YOU WIN. YOU HAVE BEEN THE BEST GOV THAT TEXAS HAS EVER HAD. I'M PROUD TO CALL YOU A BROTHER IN CHRIST AND I PRAY THAT WHATEVER YOU ARE LEAD OF THE LORD TO DO THAT GODS BLESSINGS WITH OVERFLOW TO YOU.","commenter_a":"I never understood the concept of hurting one class of Americans helps the other! Question for Obama, if the wealthiest 1% is forced to pay their fair share as you say are they more likely to sacrifice their life style to pay the tax hike with or slash the payroll aka are jobs to pay for it ? And if given the choice between getting the rich to pay ( again as you say) their fair share or having a job to provide for my family, I'll take the latter every time!!","post_message":"This administration has failed to prioritize job creation and economic opportunity. The Washington culture may be fundamentally broken, but the American spirit that built this great nation is not. America's leaders should be working to ensure every person who wants a job, has a job. That’s what this is about – making sure mothers and fathers can provide for their families and our children have every opportunity to pursue their dreams. #SOTU"},{"comment_id":"10153070562531051","commenter_b":"She needs to be put in a hospital were criminals go. They need to put all the weirdos on a dam island somewhere.","commenter_a":"THere has to be a way to trace the video, find this woman and make her pay for this horrible murder of an innocent dog. Nothing could be gained by this act and the woman needs to be stopped before she kills again.","post_message":"First she tied the dog up. Then she took out her blowtorch."},{"comment_id":"1436141653072527","commenter_b":"Europeans, that's a joke all in its self.","commenter_a":"For all those that think protests didn't block traffic in MLK days. Stop using him as your go to pawn thinking you know something about civil disobedience and fighting for rights.","post_message":"It's the image that is defining a protest movement."}]
