[{"comment_id":"10158374011905206","commenter_b":"Sucks to suck Donald Duck","commenter_a":"Trump has created more jobs in New York than any politician, yet they screw with him because..... You know ..... Politics.","post_message":"The Attorney General ruled that the Donald J. Trump Foundation had been raising cash in the state this year when it wasn’t registered to do so — a violation of state law."},{"comment_id":"904971426268782","commenter_b":"If they are illegels they can't vote cause they,are not citizens","commenter_a":"They most definitely, without a shadow of a doubt should not now or ever be able to vote! ONLY citizens of these great United States of America have the honor and privilege to vote in elections! Period! End of story!","post_message":"Last I checked illegal means illegal and you have no rights in America!"},{"comment_id":"10153561186861323","commenter_b":"Unfortunately that's just not true. Gangs control the production in the UK just like they do everywhere else. @webpagelink","commenter_a":"80% of cannabis consumed in the UK has been grown here. Your argument on that level is invalid.","post_message":"Jay Rayner: \"We are, it seems, living in the age of the wonky moral compass: of middle-class couples who swear by their weekly organic veg box, and yet relax after dinner with a line of something produced by impoverished, subjugated Bolivian peasants.\""},{"comment_id":"10153165455697869","commenter_b":"End stupid people from breeding","commenter_a":"Amen....","post_message":""},{"comment_id":"898756240177140","commenter_b":". . . and it's just going to get worse until we deport them all ! ! ! !","commenter_a":"LOL. LOL. These retarded Liberals! Can't we all just get along... you stupid liberals have brought this into our country... and now it will be like the middle east... Socialist DEMOCRATS SUCK!","post_message":"(Video) Is 2015 the year we see outright war between radical Muslims and Americans on our streets?  As exemplified by the actions of these Texans, Americans will push back against Islamization with highly provocative moves.   Will Obama be able to keep his jihadists in check until he declares Caliphate?  Read More + Video:  @webpagelink"},{"comment_id":"1236409066433862","commenter_b":"Clifford Maclean Losee","commenter_a":"Save your money you bunch of fruit cakes!!!! You might be able to afford things if you would quit donating to lost causes!","post_message":"Michigan certifies President-elect Donald J. Trump's win in the state, awarding him 16 electoral votes. @webpagelink"},{"comment_id":"10158076017090577","commenter_b":"It is the Muslims that enslave women to the day!!!!","commenter_a":"Really? Muslims want to bring up slavery? It was Muslims that SOLD the slaves to the US. It is Muslims that perpetuate slavery in Africa and the Middle East today! Where is the outrage for THAT?","post_message":"What this guy said about America won't sit well with Donald J. Trump voters..."}]
