[{"comment_id":"10153847356156162","commenter_b":"It's sexual assault by two nasty woman....!!","commenter_a":"Working for tips...","post_message":"WANTED FOR TWERKING: Two women are being sought for sexual assault after twerking on an innocent man.  WATCH -->@webpagelink"},{"comment_id":"991950690936939","commenter_b":"Looks can be deceiving. The slob has way too much power and his history is terrible.","commenter_a":"How is Bannon so canny?? He always looks like he just work up in a bus stop with a bad hangover and isn't 100 percent sure where he left his pants.","post_message":"Trump's aides also reportedly don't know how to properly turn the White House lights on and off."},{"comment_id":"1012656692115433","commenter_b":"Is it a female? Lord have mercy she's dog ugly","commenter_a":"Racist woman","post_message":"Apparently Whoopi doesn't care if the DNC rigged the system.  Why? Because it's against a white guy. #DNC2016"},{"comment_id":"10154635406324726","commenter_b":"@username Cowardly weasel!","commenter_a":"I keep reading all these allegations of her but nothing happens. Apparently a revolution against the government is inevitable?","post_message":"Emails suggest Clinton removed diplomatic security officers so private-charity aides could hitch a ride."},{"comment_id":"607266949431150","commenter_b":"You are So Right. Walter Biscardi Jr","commenter_a":"Wow, that is a match made in heaven. Just when you thought it couldn't get any worse than McCain / Palin, the Republican Party proves us all wrong again......","post_message":"Just in: Ted Cruz will name Carly Fiorina as his vice presidential running mate, according to two sources."},{"comment_id":"10154102515036409","commenter_b":"She knows how to promote something unreal as real!","commenter_a":"Yes! Prepare to have big business be hit with a steel chair! Bring Main St back to America!","post_message":""},{"comment_id":"10154760040172293","commenter_b":"Shes an indenity thief. I think Alyssa was referring to actual criminals","commenter_a":"Hopefully every single one who has blatantly broken Federal laws and made a joke of our Justice system. They are all criminals by definition. Round them all up and return them to their homes in Mexico and Central America.","post_message":"This scenario is one that President Trump opponents imagined becoming far more common were he elected."}]
