[{"comment_id":"10153992150958854","commenter_b":"Who's next to meet Satan their Allah. Satan's impatient, don't keep the Virgin hags waiting.","commenter_a":"no more little asshole","post_message":""},{"comment_id":"10155066550807994","commenter_b":"White racist people that's who.","commenter_a":"This is how they return the favor for his dream","post_message":"I HAVE A DREAM. Before Martin Luther King Jr. gave his speech in front of 250,000 in Washington, DC - the great American delivered a very similar version right here in Detroit two months earlier. READ & LISTEN:"},{"comment_id":"548837575304535","commenter_b":"Bill Clinton could get away with anything.....all Hillary has ever cared about is \"power\". God forbid her from being President.","commenter_a":"Butch and Billy Americas First family good replacement for the Kennedys","post_message":"They can't cover this one up!"},{"comment_id":"10153286970856167","commenter_b":"Help the refugees by free their homelands from the bad people the world support with weapon and money for other profit exchange !! They are running away from their own evil ... This evil was created by the collective separations of this planet God of profit America is the only place in the planet When soon or later the origin of the people is not matter any more .. This will hopefully be our new planet order","commenter_a":"In the 1930s we turned away thousands Jews due to xenophobia, many of them later died in camps. Are we going to repeat the same mistake now?","post_message":"Since the Paris attacks, there's been a lot of hate. Here are the top five best responses to all the bigotry. Watch:"},{"comment_id":"10153772701693271","commenter_b":"If you look back, I didn't say \"productive\". I said \"meaningful\" and, I'm hardly \"bent out of shape\". Does this effect me personally? Not really. But, it does effect my community/state/culture...whatever you want to call it. A day to celebrate pot? It's laughable to most. You can think I'm ignorant all you want, I still think it's ridiculous. Again, my opinion. Not sure why you feel the need to argue with me.","commenter_a":"Go to work. Volunteer. Do something meaningful. Beyond ridiculous.","post_message":"Denver's 4/20 rally has been rescheduled."},{"comment_id":"1224050534299847","commenter_b":"Give her hell","commenter_a":"If this really occurred, the person should be discharged from Military Service.","post_message":"How sad is it that protesting the National Anthem has even extended to here?"},{"comment_id":"769546029761706","commenter_b":"karmas a bitch","commenter_a":"Tolerance! Take their Allah and Mohammed, tear up and urinate on it. Then we will talk tolerance.","post_message":"Italy: Muslims Destroy and Urinate on Virgin Mary Statue   @webpagelink"}]
