[{"comment_id":"10153745269073984","commenter_b":"that bitch needs to be in prison, hell yeah she and this country need her to just go away.","commenter_a":"Yes. She is wasting our time!","post_message":"A Fox News correspondent just revealed one surprising thing about this Hillary event that you won't see on TV, and it's definitely an embarrassing moment for the Clinton campaign.  Do you think Hillary Clinton should drop out of the presidential race?"},{"comment_id":"10152526323082377","commenter_b":"Go away","commenter_a":"a gubbament BIG ENOUGH to GIVE you everything you WANT, is also BIG enough to TAKE EVERYTHING you have!! see what happens when you DONT VOTE!","post_message":"Oh Really..."},{"comment_id":"10153472198206336","commenter_b":"She is sick!!","commenter_a":"I don't even know who she is; and if I was that bakery, I would sue her butt of, instead of letting her get away with that and having my rating dropped because of it!","post_message":"The California bakery was downgraded to a B rating after a video revealed that Ariana Grande had licked doughnuts in the store."},{"comment_id":"10153858416863271","commenter_b":"Sick woman. I mean the one who posted this comment.","commenter_a":"I've been looking at her Facebook pages(she has two), I'm not justifying her actions and believe it's absolutely disgusting but I'm pretty pretty sure she's special needs. I'm not saying she shouldn't be punished or condoning her behavior but I honestly don't think she knew any better. I'll be willing to go out on a limb and say she was sexually abused. She probably did to him what had been done to her or what was told to do. I can't even imagine what's going on behind those walls.","post_message":"Jessica McCain told investigators that she recorded the sex act on a borrowed cell phone, according to court documents."},{"comment_id":"1560863080640101","commenter_b":"Moron! She got what she deserved.","commenter_a":"VERY SAD","post_message":"This craze is out of control.  (From Elite Daily)"},{"comment_id":"10152687938146813","commenter_b":"So what? Some women don't want to have kids at a particular time. Some never want to have kids. Second, most women who have abortions do so because of financial reasons. Third, contraception isn't 100% effective. Some types are only 75% or so effective. The diaphragm in a multi-para woman has a low effectiveness rate. I've been pregnant twice on oral contraception. Each woman has her own story. If she wants to tell it, she will. Otherwise, it's none of your damned business. Oh, and if my body is affected, it is my choice. I have self-autonomy over my body.","commenter_a":"Abortion is not a method to avoid pregnancy; a woman can avoid pregnancy by using birth control provided to her for free and not getting herself pregnant. Abortion is, in reality, simply a way to avoid MOTHERHOOD; it's not 'my body, my choice,' it's 'my LIFESTYLE, my choice.'","post_message":"The question matters: More people support abortion rights when the poll language focuses on women. #LetsTalk @webpagelink"},{"comment_id":"10152873663099877","commenter_b":"She tried it, smh.","commenter_a":"I Hate when racist retract what they say! \"You're a racist\", you said it therefore you meant it!","post_message":"Giuliana Rancic Disses Zandaya's Locks: 'She Smells Like Patchouli Oil Or Weed.' Watch and read more on this including Zendaya's and Twitter's response.  Grio fam, what do you think of Zendaya's response?"}]
