[{"comment_id":"10154080042346336","commenter_b":"I care what anyone says obama was a good president.","commenter_a":"Yep, detention without trial , without legal representation ,without charge has no place in America .","post_message":"“We can try [terrorists] and put them in our maximum security prisons and it works just fine.” – President Barack Obama on closing Guantanamo Bay facility @webpagelink"},{"comment_id":"10153721123493132","commenter_b":"Just another hoe looking for her five minutes of fame smh","commenter_a":"Remember when it was shameful and embarrassing to be the other woman.","post_message":"She is no longer an employee of the family."},{"comment_id":"10154738811856336","commenter_b":"THE MINUTE YOU VOTE FOR HILLARY CLINTON YOU BECOME GUILTY BY ASSOCIATION FOR HER CRIMES. Think about that for a minute...yep every time you see her, hear her she will be lying, and you become one too...a horrible person! She let 4 beautiful men get tortured, sodomized, and killed, all because she didnt answer her phone. She deleted 33,000 classified emails after she got a supena. She will Open borders for hell to get in. ISIS will kill and you will be guilty of this. You will be guilty by association and all your friends will turn on you! All because you wanted the first woman President...We pitty you if she gets in....you won't get help from us....we will be to busy fighting for our guns to save America from her!...We choose TRUMP, a MOVEMENT beyond your reach.","commenter_a":"r I have watched Megan Kelly for a while now and use to love her show. However, I am so disappointed in her need to make a name for herself that she has sold herself to the devil and we all know who that is. Seriously, the sexual predator comment??? And you call yourself a lawyer, what happened to innocent until proven guilty or does that just apply to the Clintons! Why don't you call out Killary for disgracing the office of Secretary of State or even better her husband who has actually paid money to women for his sexual indiscretions. Oh, and how many people close to them are in the grave?? So @username...get rid of the trash and get some class....Hint\"...The Ainsley Earhardt File!!!!","post_message":"\"That's not law enforcement. That's selective prosecution.\"  Newt Gingrich reacted to the perceived double standard with the investigation into Hillary Clinton's private server, saying \"this is the kind of stuff that in a place like Venezuela, you'd understand.\""},{"comment_id":"10153512925208854","commenter_b":"They can take the next boat, plane, or train out of my country!!","commenter_a":"All those who sign this petition should be banned from the USA forever","post_message":"U.S. Citizens Sign Petition to Ban American Flag"},{"comment_id":"1771730343061531","commenter_b":"@username, no too bad YOUR MOTHER DIDN'T HAVE ONE!","commenter_a":"If anyone is out of touch with mainstream America it's conservatives. What this really should is how liberals are against bigoted, hateful, judgmental, narrow minded christian WHITE CONSERVATIVE IDIOTS.","post_message":"Democrats' threats of violence are intensifying, showing voters  how radical and out of touch Hillary Clinton and Leftist radicals truly are with mainstream America..."},{"comment_id":"1197826636921341","commenter_b":"Yeah. Pointing out the extremely horrifying problems of a crime filled cesspool part of a city and a counter culture no one is allowed to talk about unless theyre approved by liberals first is totes narcissistic. Gtfo.","commenter_a":"He wasn't making it about him, he was saying this will stop! They twist everything!","post_message":"\"Glad you’re not making this about you. Whew!”"},{"comment_id":"1470099699674042","commenter_b":"And your mom should apologise to the world at large. I think you know why.","commenter_a":"Stfu Ryan. You couldn't figure your way out of a paper bag with both of the ends open. You are an embarrassed part in the political arena.","post_message":""}]
