[{"comment_id":"1720347271558389","commenter_b":"What a pathetic slut !!!!!!!","commenter_a":"Just another Wacko;showing her ignorance.","post_message":""},{"comment_id":"693891444077370","commenter_b":"a lib angry bitch...","commenter_a":"First of all, she's just an angry bitch....second of all: who?","post_message":"Who does THIS Remind you of...."},{"comment_id":"947076032050956","commenter_b":"I agree @username. Just like the woman said about the women that doesn't help other women. Hillary thought that was cute.","commenter_a":"We need to come together against the Republican Establishment to deny Trump and Cruz of the nomination. Their strategy is despicable but simple, keep either candidate from garnering enough delegates and have a contested convention where they will steal the nomination from both men. We Trump and Cruz supporters are wanting an outsider to try to fix the corruption in the political parties and our government. We need to come together to deny the Establishment their strategy. In the meantime, have faith in both of our candidates....Trump and Cruz are both very smart men and understand exactly what the Establishmen plan is. I have hopes that within two to three weeks they will work out an agreement among themselves to make a clear pathway to victory for one of them...to help them do this we need to come together as conservatives who are sick and tired of the corruption and ...","post_message":"Shannon Bream here live from Detroit on the Fox News Facebook page! Hit 'subscribe' in the top right corner to make sure you catch all of our live videos. We'll talk to the moderators during tonight's #GOPDebate and you won't want to miss that!"},{"comment_id":"1647473612211471","commenter_b":"Trump has done nothing against the law and if he did why didn't they file charges or even report it....This is just bull and not important...but on the other hand Hillary can and will be in trouble with these email leaks...statue of limitations is not up on her...so there can be charges brought up on her","commenter_a":"The fact is, that you people have lost all credibility with anyone with the ability to think for themselves...Your obscene bias, is so obvious, it's not even funny anymore....The NY Times has even less credibility, and is viewed as even more bias and corrupt than @username or People, because the previous allegation the Times made a few months ago, was **proven false by the \"victim\" herself**. And you have to understand that the election is *temporary*, and after the election is over, your ratings will still be at records lows, except your reputation/credibility will have been permanently shot, permanently destroyed. This is the price you, your producers and executives have paid to try and skew this election towards Hillary at any and all costs...","post_message":"Ex-beauty queen says it was humiliating for Donald J. Trump to be backstage, \"before you could put a robe or kind of dress yourself, he walked in. Some women were half naked, others were in the process of changing.” @webpagelink"},{"comment_id":"10154315697078984","commenter_b":"That whore needs to go to hell","commenter_a":"She DOES NOT HAVE THE AUTHORITY TO DO THIS. ALL WE NEED TO DO IS IGNORE HER. KEEP BUYING IT SHE WILL BE GONE IN 8 MONTHS","post_message":"Michelle Obama has been messing with our children's food for years, but now she's gone to far.  She just banned one of America's favorite cereals, and there's not a darn thing anyone can do about it.  It's time to throw her and her America-hating husband out of the White House for good."},{"comment_id":"10156504426675725","commenter_b":"Melania will be a wonderful First Lady and she'll bring class back to the White House!","commenter_a":"she'll be a 1000 time better than Michelle Antoinette Obama !!!","post_message":"My beautiful wife, Melania, shot in Trump Tower--- a great First Lady!"},{"comment_id":"10153492592416336","commenter_b":"Lol, I guess I won't state the obvious...","commenter_a":"No that's not okay, nor professional. What is okay is to speak to the parents and ask them to remove the child until he or she is calmer.","post_message":"Darla Neugebauer, owner of Marcy's Diner, said she’s not sorry for yelling at a 21-month-old for crying in her restaurant because it got the girl to be quiet.  Is it okay for a restaurant employee to yell at a child?"}]
