[{"comment_id":"713245288832825","commenter_b":"I guess you are one of those women","commenter_a":"Yessss lets celebrate that we have a president think women can be treated like trash and women can stay at home creatimg babys. You women that voted him should celebrate for that","post_message":"Watch as President-elect Donald J. Trump and Vice President-elect Mike Pence kick off their  you tour in Cincinnati, Ohio."},{"comment_id":"913019148787853","commenter_b":"She's literally the dumbest woman on earth.","commenter_a":"@username @username is there anything in this world that doesn't offend people? Lol good lord","post_message":"\"Star Wars\" fact-checkers quickly took to social media to point out several holes in Harris-Perry's theory."},{"comment_id":"10155007132753431","commenter_b":"Wicked Witch of the East.","commenter_a":"It's not about popularity. It's about decency and common sense!","post_message":"DeVos gave no sign that she had reservations about withdrawing key guidance for transgender students."},{"comment_id":"1385280774831907","commenter_b":"#NEVERTRUMP #NEVERHILLARY #NEVERBERNIE @webpagelink","commenter_a":"Have stop watch Faux News! #nevertrump","post_message":"\"In Hillary's America we focus on Hillary, but we also focus on the whole sordid history of the Democratic Party. We're telling an unknown story, and it's going to rile up this race.\""},{"comment_id":"10156243420205389","commenter_b":"For what? So they can keep turning a blind eye to little boys & girls being raped every day over there? If we're not PROTECTING the innocent anymore, it's time to leave.","commenter_a":"I do not believe he is a Muslim, he is a puppet for the Muslim brotherhood without a doubt and he does hate America","post_message":"President Obama will extend the U.S. military’s stay in Afghanistan beyond the end of 2016, casting aside his promise to end the war on his watch."},{"comment_id":"10153753535205695","commenter_b":"She should be impeached","commenter_a":"I don't think she should be jailed. They should just fire her.","post_message":"#BREAKING: Judge orders defiant Kentucky clerk to jail after she refuses to issue marriage licenses."},{"comment_id":"1213265855432501","commenter_b":"I quit watching long ago. Now I know why. Bunch of bitches!","commenter_a":"Why don't they just give it up... Everytime they say something bad about Trump their show loses viewers. I never watched them but if I came across it channel surfing I'd stop and see what was on... Now I will keep surfing.... And I'm sure I'm not the only one.","post_message":"Joy Behar of 'The View' just said Donald Trump will bring “mental illness” to the White House."}]
