[{"comment_id":"985465168182267","commenter_b":"You don't support our troops, you don't support tradional marriage, I would think support you.","commenter_a":"Good I don't go there now.","post_message":"Starbucks CEO: If You Support Traditional Marriage, We Don Want Your Business  ttp://woundedamericanwarrior.com/starbucks-ceo-if-you-support-traditional-marriage-we-dont-want-your-business/"},{"comment_id":"1274512465962929","commenter_b":"Look at the fucking rat you idiot!","commenter_a":"Ray this is the first one I don't know if I would 😂","post_message":"Would you? #WSHH"},{"comment_id":"10153910090484160","commenter_b":"We need to ban this evil witch!!!","commenter_a":"Ban cars. Cars kill people. Drivers carry insurance. It is a business that determines risk and the policy cost reflects that. Require gun owners to have insurance rather than taking them away, unless, of course, you really are trying to disarm the American people.","post_message":"\"Terrorists and dangerous individuals are using guns to kill Americans. We should make it a lot harder for them to do that.\"  Hillary Clinton"},{"comment_id":"10156236766360354","commenter_b":"WHAT??? It doesn't designate the Black Lives Matter and the Black Panthers as terrorist organization for constantly calling on blacks to kill cops and white people and CAIR, but they want the NRA designated as one even though they threaten no one? This is absolute bullshit & I'm so tired of the attack on our 2nd Amendment rights!!! We MUST stand against this!","commenter_a":"NOT","post_message":"Here's how far the Left is going with this..."},{"comment_id":"10155021026963984","commenter_b":"You are so full of life, Tom, your birds, your cats, your home, Butch, your family, your love of antiques and craftsmanship, your sense of fun, on and on. Just don't want you to let what is beyond any our control override the richness of all you have in your life. Isn't it amazing how much we reveal about ourselves in little vignettes of our lives. Called sharing, and all of us as your Facebook friends enjoy your posts very much.","commenter_a":"Judge Pirro comments were so articulate, to the point, and crystal clear honest evaluation of exactly what has happened to our wonderful country in the last eight years. I remember so clearly Michelle's remarks at 44 years of age saying it was the first time she had been proud to be an American, I was shocked beyond words! To accept so much as we are given as Americans and not to be thankful and proud of our country and our fellow everyday wonderful citizens, Americans! Color or religion are immaterial, Americans and I for one am so thankful for being one and never fail to appreciate what it is to be American. Thank you Judge Pirro for your concise evaluation of Michelle Obama.","post_message":"In the final days before the Obamas leave the White House, Fox News' Judge Jeanine Pirro just gave Michelle a parting gift she'll NEVER forget."},{"comment_id":"1573634599333254","commenter_b":"I know smh that's it I'm looking for new locations tomorrow","commenter_a":"@username Eder Marure","post_message":"A drive-by shooting left 1 person dead on Cypresswood Drive on Monday night."},{"comment_id":"10153269973986167","commenter_b":"Enjoying your tax Magnus rates? And how many refugees and immigrants are you valuing?","commenter_a":"As a Scandinavian, I don't know if I should laugh or cry on your behalf....","post_message":"An actual question from last night's #GOPDebate"}]
