[{"comment_id":"10153573375216509","commenter_b":"Take away her license and fine/jail her","commenter_a":"Very cruel person","post_message":"A Texas veterinarian posted a proud photo to Facebook of herself smiling as she dangled the limp body of a cat she allegedly shot with an arrow. The vet said it was a feral tomcat. People who saw the post were outraged. Now, animal rights activists are pushing for charges.  @webpagelink"},{"comment_id":"10154450737471909","commenter_b":"Please do elaborate and share your knowledge with the rest of us","commenter_a":"Anton Deni Pamela Note the what it's about and the symbolism. I found the pine cone staffs to be interesting knowing what they really mean.","post_message":""},{"comment_id":"10152555972045667","commenter_b":"They will make some inmate a great bride.","commenter_a":"Despicable fools.","post_message":"Former Vanderbilt University football players Brandon Vandenburg and Cory Batey were found guilty on all counts for the 2013 campus rape of an unconscious woman."},{"comment_id":"1306972999355460","commenter_b":"If they come after our guns we are so screwed...This is something we better not let them do...If ever we need to fight it will be when they do come for our guns....Wake up american's...That Muslim snake in the white house is out to get us and it looks like he will stop at nothing to destroy us and our country...","commenter_a":"Yes it will!","post_message":"“An armed citizen is nothing for me to worry about”"},{"comment_id":"523889751104313","commenter_b":"Ban muslims ? Better chance at banning tards first. Show me where islam justifies it. Quote the quran. If you have brain cells, lets discuss islamic facts.","commenter_a":"Where are the idiots who just a few hours ago were blaming gun laws for this? Where are they now?? Are they all shy and in hiding after it has been proven this was done by MUSLIM TERRORISTS? Muslim terrorists killed 150 people in Paris too, and they don't have the second amendment in France, how come??? #BanMuslimsNotGuns","post_message":"Authorities have named the two attackers suspected of carrying out the shootings before being killed themselves as Syed Rizwan Farook, 28, and Tashfeen Malik, 27."},{"comment_id":"1096660043788412","commenter_b":"A woman President, fine, BUT NOT HITLERY!!!","commenter_a":"It turns my stomach to think of Hillary as president","post_message":"\"Madame President Hillary Clinton.\"  Do you like or dislike the sound of that?"},{"comment_id":"10153528204119497","commenter_b":"Ha!","commenter_a":"I see the girl inviting us to like her page is already here.","post_message":"\"I could make somebody happy, I am loving, and I deserve to be happy, too.\""}]
