[{"comment_id":"1234498396590570","commenter_b":"Carole, keep your day job and drop the politics. You're a suffering liberal.","commenter_a":"This is big news because conservatives want you NOT to notice that the economy is way up, the deficit is way down, unemployment claims are at a 42 year low, and Obama has unprecedented world approval. So Obama has almost rescued us from the disaster the Republicans left us when Bush was in office. But don't notice that stuff, focus on bathrooms and what Muslims are doing in countries you can't even find on a map.","post_message":"#BoycottTarget  #PRDisaster #TalkIsCheap"},{"comment_id":"448351221956139","commenter_b":"I'm from Texas and Perry has done a good job for jobs and everything else, except shutting the border down. He gets an F for that...........","commenter_a":"Trump,Rick Perry is a very bright man.He lead Texas very good for many years.","post_message":"It seems that Donald Trump has now turned his attention to this rival GOP candidate."},{"comment_id":"10152996410034330","commenter_b":"How about if we all carried guns to protect ourselves from worthless losers like this. Just kick them off the planet and they never will rob anyone else, thats for sure...","commenter_a":"Yes Paulette in a perfect world one could go to the ATM, grocery store, or anyplace else anytime at all, however in the real world there are criminals and scum who do prey on people when they make themselves vulnerable. Police and other security people cannot be everywhere to ensure nothing ever goes wrong. It's just common sense to use caution and good judgment when out alone.","post_message":"FRIGHTENING VIDEO:  A woman who pulled up to an ATM was kidnapped at gunpoint and forced into her trunk and the whole ordeal was caught on video ---> @webpagelink  The suspect even gave police a good look at him"},{"comment_id":"1048428675208939","commenter_b":"@username What are you reading? How did the US government start this war? The Syrians and everyone else out in North Africa and the Middle East have access to the internet and make their own decisions. When people have access to information freely they act accordingly. People have free will to think and make decisions. No one forced the Syrians to fight or oust Assad. He cracked down on protests violently and this is the result.","commenter_a":"How can Assad sleep at night knowing he is responsible for the deaths of 300,000+ of his own people. It's disgusting","post_message":"What chance is there for peace in Syria? Join our Q&A"},{"comment_id":"884069771715072","commenter_b":"Remove the traitor ASAP !","commenter_a":"Yes.","post_message":"Obama Announces DEVASTATING Executive Order Right Under All Of Our Noses.  He is completely abusing his power.  Do you think Obama should be removed from the White House?"},{"comment_id":"10154048567109203","commenter_b":"She's a turd","commenter_a":"Hillary 2016","post_message":"How could you, Will Ferrell??"},{"comment_id":"938381199514967","commenter_b":"Take the bitchs baby she don't need it jus like her other ones","commenter_a":"We need to all really start to focus on the hard truth of meth and the sickening epademic that is in almost every big and small town across America . I'm tired of all of the meth head thieves , I can't even imagine how many children across America are going through the same life endangering situations becouse of the parents being hooked on meth .. don't spend the tax payers money on jail , send them to treatment for several months . I'm sure these parents were decent human beings before meth took over . Unfortunately now they have like all meth heads done sinister,and incomprehensible acts . It's good to see these kids have survived when so many others don't .","post_message":"Bond's set at $100,000 for each parent after they allegedly abandoned their three young children in a house that neighbors call a mess and fire hazard.   \"Rats that were running in and out of the garage. I mean, it was horrible.”"}]
