[{"comment_id":"10152962989707014","commenter_b":"Get rid of illegal non English speaking students whose parents pay no taxes and there will be loads of $ and all the scores will magically rise. I wonder what it would be like if American students were able to get attention in class?","commenter_a":"My daughter started at a Charter school when she was 4 years old K-6, proceeded to a public school in Jr High which she had to test into she was then placed in ALL honor classes and has maintained a 4.0 gpa now on her way to High School on Wednesday at the age of 13....So thanks Charter schools!!!!","post_message":"There's a huge waiting list to get into in a Valley Charter school. Find out why some 1,000 parents hope to get their kids enrolled."},{"comment_id":"539890196201560","commenter_b":"She's a douche bag!!!","commenter_a":"They both should do jail time.","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"},{"comment_id":"416896861831941","commenter_b":"I do not think Hillary will win (fairly anyway).","commenter_a":"The even bigger issue is that 46% of people still think he's a good president.","post_message":"I am ONE of them...do you?"},{"comment_id":"10153254996144099","commenter_b":"Darlene is just another brainwashed white women who think all blacks are \"misunderstood\"","commenter_a":"with all the training they get they can not subdue a guy with a hammer???","post_message":"UPDATE: Police and multiple sources initially said the man was dead, though authorities later said he was hospitalized in extremely critical condition.  #BREAKING: Hammer-wielding suspect shot dead after trying to hit officer, police say @webpagelink"},{"comment_id":"10154928634761320","commenter_b":"Classy","commenter_a":"drop dead.","post_message":"Happy Birthday to Secretary of State John Kerry.  He turns 73 today."},{"comment_id":"10154082308022293","commenter_b":"Perfect boot lickers. Masters proud of you idiots. More dumb girls.","commenter_a":"I'm sure you liberals celebrated their death too.","post_message":"The discovery of two Catholic nuns found slain in Mississippi on Thursday sent shock waves through their rural community."},{"comment_id":"10154034099273855","commenter_b":"I can't say anything to them they haven't already been told. I simply want to send them all a HUGE middle finger and kick in the ass!","commenter_a":"The sad face of intersectionality.","post_message":"Yes, Virginia, there ARE out Republicans."}]
