[{"comment_id":"1146551715438403","commenter_b":"@username Why did you just not turn over your emails Hillary? Why are they finding them now on Huma's deranged husband's shared lap top? Extremely Negligent come to mind? You forgot to Bleachbit and smash this one!","commenter_a":"What's Huma and Anthony's plan? Soon as the election's over get back together?","post_message":"“The Director owes it to the American people to immediately provide the full details of what he is now examining.\""},{"comment_id":"1777618975785722","commenter_b":"so take a DNA test and you will see ALL HUMANS have African ancestry! LOL, deport yourself.","commenter_a":"DNA testing would probably show that he has minority blood in him, aboriginal or black....what a moron..","post_message":"Where does he even find these people?"},{"comment_id":"944125178989101","commenter_b":"Not unless the Bush Administration moonlighted at 7-11!","commenter_a":"That's an easy mistake to make, he thinks the guys that work at 7-11 were responsible for 9/11....sheesh.","post_message":"Donald J. Trump mistakenly refers to 9/11 as 7-11: “I was down there and I watched our police and our firemen, down on 7-11, down at the World Trade Center, right after it came down, and I saw the greatest people I’ve ever seen in action.\" READ MORE: @webpagelink"},{"comment_id":"1645030555784057","commenter_b":"Every woman who wants an abortion should see this. Children are truly gifts from God!","commenter_a":"If everyone showed that much love for their mother and all their family. This world would not be in the shape its in today. Most beautiful example for everyone!, thanks","post_message":"Incredible."},{"comment_id":"10153539342225329","commenter_b":"Women should have the right to ban ear piercing among them also.","commenter_a":"This is such BS.. I had my daughter's ears pierced when she was an infant and she felt the pain for 30 seconds. She was completely calm and pain free afterwards. Her ears healed in less than a week bc of how fast her body grew at that time. She had less risk of infection then (she was too young to play w her ears) and less healing time. I, on the other hand, had mine pierced at 6 and ended up with problems bc I took them out when I shouldn't have..","post_message":"“Severe pain and fear is inflicted upon infants unnecessarily,” the petition states. (via BuzzFeed Trending)"},{"comment_id":"10153620766011337","commenter_b":"I would only wish there were black only sororities, but no, whites are free to join and pollute the heritage","commenter_a":"So I'm just asking. On campus at Grambling University pretty sure there are ALL BLACK sorority houses. Why no uproar over that ?;","post_message":"RACIALLY INSENSITIVE? This Alabama sorority video had to be deleted after a diversity backlash.  Watch it and judge for yourself..."},{"comment_id":"10154274349426051","commenter_b":"CAN I HELP AL , GET THE HELL OUT OF THE U, S, A, DUMB ASS","commenter_a":"He is ALL mouth--did anyone really think any of these ppl. were going to leave? WHO would want them?","post_message":"The Rev. Al Sharpton has finally decided if he'll leave the country now that Donald Trump is President."}]
