[{"comment_id":"903045683051621","commenter_b":"She embarrassed us once on national TV!!! We good!!","commenter_a":"Ya own kind hate'n why can't we stick together","post_message":"Guess Who Wants To Replace Kelly Osbourne On “Fashion Police”"},{"comment_id":"10153174842954342","commenter_b":"Amyaa Brown what u done did? Lol jk","commenter_a":"Deepan Patel","post_message":"EVACUATION CHAOS: Southwest Airlines evacuated a plane at Hobby Airport when the cabin started smelling like smoke.   WATCH:"},{"comment_id":"10153589057371615","commenter_b":"Yep I had a friend who took kick boxing classes 2x a week and she was in her late 60's ! Don't underestimate a woman nomatter how old 😋","commenter_a":"Ya I'm sure she was really able to get her leg high enough to kick you","post_message":"An 80-year-old Penn Township woman is accused of crashing her convertible while drunk … then kicking an officer in the groin while being placed in a patrol vehicle."},{"comment_id":"10153304270661051","commenter_b":"(Sigh) Non sequiturs everywhere.","commenter_a":"So. Arrested him for killing a lion and thugs that kill cops are going free what's wrong with picture so animals are more important than people's lives","post_message":"Cecil the Lion's hunter has been arrested."},{"comment_id":"1022960277760501","commenter_b":"NO Hillary, Monica, & Bill in the White House ever again. TRUMP for PRESIDENT!","commenter_a":"Madame President Hillary Rodham Clinton and First Husband Bill Clinton January 20, 2017","post_message":"“Girls can do anything.”"},{"comment_id":"682882035184939","commenter_b":"Until the war against christians ends. All countries should carefully screen all imigrants. Period","commenter_a":"Yes absolutely!","post_message":"Our children's future is at stake! YOU DECIDE!"},{"comment_id":"10153206668181162","commenter_b":"I'm understand u Julie I feel the same sometimes I hate my own race the Humans!! I gonna try to adopt him.","commenter_a":"Are you kidding me??? I. HATE.HUMANS!!! Find the SOB who did this and shoot them! Disgusting! People make me sick. Praying for this poor dog <3","post_message":"\"SWEET SURVIVOR\": After being was shot twice, this dog will still survive. Police found her tied to railroad tracks and rushed her to the vet.   Once she is healthy, she will be up for adoption @webpagelink  Officers have named the dog R&R. (Photo via Twitter @TampaPD)"}]
