[{"comment_id":"10153628863174575","commenter_b":"She's just a troll, Crystal. Ignore her.","commenter_a":"I stand with Kim Davis","post_message":"Rowan County Clerk Kim Davis is under fire for defying a judge’s order to issue same-sex marriage licenses.  \"This is how gay people are treated in this country.If nothing comes of this, at least I hope that other people understand that this is wrong. It's just wrong,” said David Ermold who was denied a marriage license."},{"comment_id":"964951150247780","commenter_b":"Prove it!","commenter_a":"I support our troops; I support allowing them the victory over our enemies...","post_message":"BOOM!! If I were ISIS, I'd already be looking for cover. The U.S. Military isn't messing around here.   Do you support our troops?"},{"comment_id":"10156981662980603","commenter_b":"She's a stripper, no joke.","commenter_a":"Obviously this woman is so used to wear no or very little clothes that she sees nothing wrong with that \"outfit\" she wore.","post_message":"Do you think her shorts were inappropriate?   A. Yes B. No C. I don't know"},{"comment_id":"10157053250220354","commenter_b":"She can't keel over soon enough. Evil beast!","commenter_a":"She's choking on all her lies!","post_message":"“You all right? Any mouth to mouth CPR?” one of the hosts joked, trying to lighten the mood.  “Senator, you coughing like you have something medicinal,” another host said.  LISTEN:"},{"comment_id":"10153738132321756","commenter_b":"Awesome. catch 'em.","commenter_a":"Loved this story today! Thank you @username! Very interesting and I can't wait to watch the documentary.","post_message":"To track the route of poached tusks, investigative journalist Bryan Christy commissioned a taxidermist to create fake ivory tusks, which he embedded with specially designed tracking devices."},{"comment_id":"1008727995814878","commenter_b":"Wolves are twice the size of a coyote.","commenter_a":"I bet the majority of you couldn't spot the difference between between a coyote and a wolf either.","post_message":":("},{"comment_id":"10156946907525389","commenter_b":"@username you are just a hater. Stop disrespecting people specially Muslims.","commenter_a":"Love this man!","post_message":"\"Why didn't she say, 'Hey, make better lifestyle choices?' If you want to join something, why don't you join a church, why don't you join the Boy Scouts or the Girl Scouts?\"  Milwaukee County Sheriff David A. Clarke Jr criticized Hillary Clinton's comment on joining \"positive gangs.\" @webpagelink"}]
