[{"comment_id":"10152853716122894","commenter_b":"I get tired of hearing about this lil hoe everyday","commenter_a":"Biancaa Ft Blue","post_message":"Watch: Kylie Jenner Gets 'High as F*ck', Tries Popeye's Chicken for the First Time [Video]"},{"comment_id":"10153650644833812","commenter_b":"Feminism at its finest.","commenter_a":"Hillary Clinton has a beautiful spirit God bless","post_message":"Hillary Clinton's mom, family life at center of $2,000,000 TV ad buys directed at Iowa and New Hampshire: @webpagelink"},{"comment_id":"1024492464317039","commenter_b":"@username, we can send all illegals home and we'll start with you! Mexican Americans/Native Americans are the only people who this land belongs to. So dip","commenter_a":"Where's the mom so she can start putting graduation pictures up and say that her kid never did anything wrong that he was a good kid and never did drugs Ill be waiting","post_message":"NEW VIDEO: #Chicago police have just released dashcam video that shows a female cop being beaten by a man who was high on PCP. (WARNING: Video is very graphic and has inappropriate language) @webpagelink"},{"comment_id":"1038233369545417","commenter_b":"Can't stand her!","commenter_a":"I stop to watch her program Always bashing on the same person all the time ! I did think that during the first debate the question was legitimated after all he has to respond because the question was going to be asked from her or somebody else But after all the bashing my trust in what they call fair and balance news under her reports was gone and I was certain that She did have an agenda by starting by this type of question Also what is making me mad is all the spin around her the queen She giggles all the time even when her guests are vulgar in her program It made me laugh when I ear that she is a respectable journalist and fox stands for her Did they listen when she was giggling from her heart when somebody said that during one of the debate \" ...","post_message":"Megyn Kelly didn't hold back! (WATCH)"},{"comment_id":"10152763206590950","commenter_b":"I guess she thinks shes all that.....but no!!!!!","commenter_a":"I do not care that the towing company is predatory, this cashier just works there and does not own the company. Try yelling at the cashier at Walmart or some other heinous company because you hate the company or corporation, same thing. Misplaced and misdirected hate is never productive and just shows your true character :(","post_message":"A pretty television personality opened up her mouth and showed a lot of ugliness in a video that went viral this week. Washington D.C. reporter Britt McHenry was caught on camera giving the business to an impound clerk while retrieving her towed car. Now the people on the other end of her tirade are responding."},{"comment_id":"10153265527170950","commenter_b":"Oh stfu","commenter_a":"The blood is on their hands. This is a typical reaction from a Liberal Democrat.. Like a small child they point the blame on some one or something else.. The Democrats have made California a safe haven for Illegals, Criminals and Terrorist with their Sanctuary and open border polices.. The Blood is on your hands Moon-beam.. You and your Lawless Democrats. @webpagelink","post_message":"\"Increased surveillance, creating relationships with mosques in the Muslim American community across the country. We did that after 9/11 and prevented attacks in New Jersey and all across the country.\""},{"comment_id":"10153336327911770","commenter_b":"She looks like a c#m dumpster.","commenter_a":"Hillary is a liar murder a criminal and mocks them what a shame","post_message":"Hillary Clinton's campaign mocked the Thursday Republican debate, calling it a \"dumpster fire.\""}]
