[{"comment_id":"10153183398771234","commenter_b":"Poor deluded woman.","commenter_a":"Donald Trump you have my vote","post_message":"Has Donald Trump always been, well, Donald Trump? According to his one-time roommate, the answer is..."},{"comment_id":"1197017153648966","commenter_b":"Get her on board and watch him sink........","commenter_a":"Her only claim to fame is loosing and quitting.","post_message":""},{"comment_id":"10154040095578701","commenter_b":"Build that wall","commenter_a":"Juan Wheeler","post_message":"Oregon State Police say a traffic stop on Highway 97 in Sherman County led to the seizure of $2.3 million worth of meth and cocaine."},{"comment_id":"10153300908534411","commenter_b":"She doesn't want the truth.","commenter_a":"Blacks kill more blacks if you really want the truth.","post_message":"An analysis released last week shows that more white people died at the hands of law enforcement than those of any other race in the last two years, even as the Justice Department, social-justice groups and media coverage focus on black victims of police force."},{"comment_id":"745552312280553","commenter_b":"Racism 101. Get rid of free soeech","commenter_a":"Make America Great Again","post_message":"Is this still AMERICA?!"},{"comment_id":"10153573437688984","commenter_b":"That makes sense since she's a woman","commenter_a":"Bruce Jenner is a disgraceful, sick, fake excuse of a man. ..","post_message":"Wow. Franklin Graham just made a massive statement about \"Caitlyn\" Jenner on Facebook... now it's going viral.  Nearly half a million people just \"liked\" this post... because it's absolutely perfect.  Spread this absolutely everywhere."},{"comment_id":"944373212266686","commenter_b":"Planned Parenthoods primary function is abortion. Enough said. Defund it.","commenter_a":"Only 3% of Planned Parenthood's funding goes to providing abortion. None of that money comes from taxpayers. Defunding Planned Parenthood means defunding millions of dollars in preventive care, cancer screening, contraception (which reduces abortion), STI screening, and other such essential services. I'm pro-choice, but if you guys have such a problem with abortion, why don't you just campaign to force Planned Parenthood to stop providing abortion services and leave everything else intact?","post_message":"Wow."}]
