[{"comment_id":"10153223558734726","commenter_b":"She has already stole enough","commenter_a":"She can just get over her self classless wonder","post_message":"WATCH: Obama: Michelle Upset She's Not Being Paid as First Lady"},{"comment_id":"10150576091714999","commenter_b":"Another highly paid rapist.","commenter_a":"@username...good or bad?","post_message":"Sports Alert: Jameis Winston, the star quarterback from Florida State Seminoles Football who played under a swirl of controversy, was chosen first over all in the NFL draft by the Tampa Bay Buccaneers."},{"comment_id":"10158086481670389","commenter_b":"Good! She needed ti be fired!","commenter_a":"Glad that person was fired.","post_message":"In Case You Missed It"},{"comment_id":"1331566923530327","commenter_b":"Build a wall and make Mexico pay for it","commenter_a":"Just wait until the Beast's Administration takes over. The guy in this story will be considered \"small fry\" when the real unbridled corruption takes off.","post_message":"Top executives of  hedge fund manager Platinum Partners were arrested on Monday and charged with running a $1 billion fraud, potentially one of the largest investment scams since Bernard Madoff. We are #FacebookLive with the Reuters reporter who has been following Platinum's aggressive approach to investing and fund management. Send us your questions."},{"comment_id":"1254836874556782","commenter_b":"@username vote blue no matter who.","commenter_a":"Don't forget he also enjoys killing animals in Africa for fun, like elephants! And proudly posing for a picture with severed trunk. If that's not a dick, I don't know what is.","post_message":"Wow. Just wow."},{"comment_id":"10153780264915950","commenter_b":"Dana is a ugly bitch she loves controversy let me see where she works if she works the internet does wonders and ensure her emoloyer","commenter_a":"You're all pissed about a teenage \"KID\" using the N word a couple times in a tweet, (because according to the former Miss Teen, \"it ain't her word,-it should be no ones word, yet black America puts it out in song lyrics etc., that kids sing to) and not up in arms about a political head deleting thousands of emails and being hacked to boot. Oh, and a pretty blonde won so you're pissed there as well. News flash...the last one wasn't white! Get over it . Racism is not going away now or in the immediate future because the liberal media perpetuates most of it.","post_message":"A screenshot of 4 tweets have been making the rounds online."},{"comment_id":"10154082239191545","commenter_b":"No, I hope she goes to CNN that's where she belongs!","commenter_a":"I love strong women. She's one to not let anyone run all over her. I like her more and more as time passes.","post_message":"Are you a Megyn Kelly fan?"}]
