[{"comment_id":"1385848588104594","commenter_b":"@username orange anus.","commenter_a":"Karma is a bitch. What goes around, comes around. Your day will come, cheeto face, orange anus.","post_message":"UPDATE: Following the publishing of this article, Fox 2 posted a follow-up story saying Mike Hager, who said his mother passed away of a medical condition after being denied entry to the U.S. despite holding a green card, lied to their reporters.  Hager's mother died five days before the ban went into effect, with Trump's de facto Muslim ban playing no role, Imam Husham Al-Hussainy told Fox 2."},{"comment_id":"1033897839973602","commenter_b":"God bless you and your mommy","commenter_a":"Welcome little one","post_message":"Do you remember our story of the pregnant woman who was carjacked on the way to the hospital?  Story --> @webpagelink Well, she had her baby yesterday. Help us in welcoming the adorable Malcolm."},{"comment_id":"539522582917416","commenter_b":"Well screw the NBA Players . . . pansy ass bitches!","commenter_a":"WHO GIVES A BIG RATS ASS WHEN YOU BACK A LOSER !!!!!","post_message":""},{"comment_id":"10153011050796717","commenter_b":"Exactly what does that have to do with anything!","commenter_a":"Why does it matter what his sexual orientation is?!","post_message":""},{"comment_id":"559128170957362","commenter_b":"Real easy there big mouth, you don't like it here then PLEASE get out NOW you punk.","commenter_a":"You will get nothing from me OR anyone I know,you punk loud mouth but we have something for you. See you soon.","post_message":" WHITE PEOPLE OWE REPARATIONS. IF YOU DON GIVE IT, WE COMING TO TAKE IT."},{"comment_id":"10152607725262452","commenter_b":"How does he have signal?! Lol","commenter_a":"Meanwhile, we're all on our phones judging this man. Lol","post_message":"It's a sign of the times -- an Instagram photo shows a man missing a humpback whale surfacing just two feet away from him because he was glued to his cellphone. @webpagelink  (Photo via Instagram/Eric Smith)"},{"comment_id":"10152865678521336","commenter_b":"Christ is the answer for the muslims !!","commenter_a":"All muslims are either radical or they support it ! they follow the qoran and that is what the qoran teaches !! their leader was a pedifile and mass murderer !","post_message":"\"I think we should cut out the political correctness. This is Islamic extremist terrorism. It is not the entire Muslim religion.\"  Former NYC Mayor Rudy Giuliani said President Obama appeared weak for describing Wednesday’s deadly terror attack in France as \"senseless violence of the few.\" @webpagelink"}]
