[{"comment_id":"10157388184590603","commenter_b":"That wall doesn't work. Many people coming in illegally from Mexico are actually from Cental America.","commenter_a":"I think it will help open discussion about illegal entry into the US. Mexico has a huge wall on its border with Guatemala for the same reason.","post_message":"Do you think think this trip will help or hurt Donald J. Trump?"},{"comment_id":"616988195096921","commenter_b":"If they don't like it, what can the Republicans offer that's better. We need well educated people.","commenter_a":"Where do I sign?","post_message":"The President just announced something very BIG - a proposal to make two years of community college free for anyone who’s willing to work for it.   #FreeCommunityCollege"},{"comment_id":"10154998158283734","commenter_b":"She needs to be only allowed to Work at a Garbage Dump!! No Place else as long as she's alive!!","commenter_a":"She should get three to fives years of community service clean up","post_message":"According to police, the woman pictured below is accused of putting menstrual blood and saliva on a customer's burger."},{"comment_id":"1313010822072720","commenter_b":"And she thinks the transgendered individuals are scary","commenter_a":"sick.","post_message":"‘Are you going to let the Devil rape your children?’"},{"comment_id":"1911468415618542","commenter_b":"Buy yo mama some food","commenter_a":"All doped up","post_message":""},{"comment_id":"1156510771035618","commenter_b":"Maybe criminals should stop shooting people unwarrantedly","commenter_a":"Maybe police officers should stop shooting people unwarrantedly?","post_message":"Authorities are hunting for the gunman."},{"comment_id":"10153366613454712","commenter_b":"She's a joke","commenter_a":"So how is she suppose to be courageous when she hides reports that was commonly issued? She hide knife? How is she courageous? How courageous to point a muder finger at innocent driver","post_message":"Memo to Marilyn Mosby: Baltimore wants transparency, not sealed documents and gag orders."}]
