[{"comment_id":"1421875981165778","commenter_b":"I had heard that too but I'm not sure where to pick up meatloaf in D.C. . I wouldn't put it on the taxpayer to feed me at the White House, I just want to have the face to face.","commenter_a":"Invite me for dinner at the White House, I'll say it to your face. For real, I'll even spring for the Kentucky Fried Chicken.","post_message":"Trump sounds off on what he considers fake news: \"A source says that Donald Trump is a horrible, horrible human being. Let em' say it to my face.\""},{"comment_id":"1193282647400517","commenter_b":"If she was White n this said about Hillary she then would be in jail!!!' Evil","commenter_a":"Then arrest her!","post_message":"OOPS, Another BLM moron gets what they deserve for making violent threats, this time against The Donald. [READ BELOW]  Can we get 5,000 'LIKES' to support classifying BLM as a hate group?"},{"comment_id":"10152808578696130","commenter_b":"Sadly, I could post these articles about pitbulls all day long and never be finished","commenter_a":"The purebreds are a very dangerous breed. Statistics do not lie.","post_message":"\"This bill would make Mississippi the only state in the nation with a statewide policy discriminating against a specific dog breed, and the impact on local communities, animal shelters, and law enforcement would be disastrous.\""},{"comment_id":"10154101943008984","commenter_b":"@username , Why do you people who support only Trump find it necessary To call people names simply because they don't agree with you? Are you that insecure?","commenter_a":"Now do not get me wrong! I am for Trump 100%, think he'll be awesome BUT leave George W. Bush out of it! Take it out on Jeb because he deserves it but I don't think George does, at all!","post_message":"Donald J. Trump railed against George W. Bush for 9/11 at the last GOP debate. It got messy, and now \"W\" has responded like only he could..."},{"comment_id":"10158446067150354","commenter_b":"You little queer. I think my grandkids could fuck you up, fag!","commenter_a":"You won't stand a chance asshole come on bring it I'll save a hospital Bed it's waiting on you fucking RACIST RAT","post_message":"The shutdown of MILO event at UC Davis may be a preview of what to expect at next week inauguration of Donald Trump.   Just who are these hooligans?  Lee Stranahan investigates..."},{"comment_id":"10153477974742217","commenter_b":"When u search at this matter, u will find that these are european muslims.... not arab muslims or the east muslims. they misunderstood the islamic religion. I hope return to their mind.","commenter_a":"We reject and condemn terroristic attacks which happened in Brussels today. These attacks make our travel to the Union Europeans' countries a more difficulty, and will sufer the syrian refugees and arab muslims who work there from a compulsive procedures at this regard from now on. These actions obstruct anyone wants to travel so as learning and resume his study and those that travel to enjoy short trip. #Islam is a peace religion. we will find your media tell u that muslim persons commited these actions..... but these persons don't believe in any religion, yes. they are extremists. they don't belong to us. All of us feel sad for u","post_message":"Belgian PM calls for \"calmness and solidarity\" in \"black moment\" for country. #Brussels   Latest: bbc.in/21ENlj8"},{"comment_id":"1009683892433898","commenter_b":"ILLEGAL ALIENS should be deported not given drivers licenses and free housing and medical care.","commenter_a":"Why don't you add the rest of the story. Not only did 50% of all California driver's licenses go to illegal aliens, but they have motor voter laws so those illegals are now eligible to vote even though they are not citizens. Non-citizen should NEVER be allowed to vote and neither should welfare recipients who have been on welfare for more than two years. They should not be allowed to vote on how the money from tax payers is spent when they are not paying taxes themselves.","post_message":"Did you know HALF of all California driver’s licenses issued in 2015 went to illegal aliens?"}]
