[{"comment_id":"1732772313625197","commenter_b":"Screw those DUMBASS muslims Go to Jail,, Go to Hell,,, Go back to the desert,,,,, JUST GET OUT OF OUR COUNTRY !!!!!!","commenter_a":"If muslims want to live here then they must adhear to our laws, period. If they don't, they can move on to an islamic country..","post_message":"Muslim Woman Refuses To Take Off Head Scarf In Court, So No-Nonsense Judge Does THIS    In our country you have to follow the laws of our court. If not,  suffer the consequences.  Do you support this no-nonsense judge?"},{"comment_id":"1203461079770668","commenter_b":"how did you idiots elect this stupid liberal bitch","commenter_a":"So ignorant..","post_message":"ClashDaily.com"},{"comment_id":"472031482987432","commenter_b":"If this is the way she believes then she should go to a country that believes in that kind of stupidity. Piss on the rag heads","commenter_a":"Yes the officer was right, keep up the good work.","post_message":"A woman is suing the police department... over a hijab?  This woman broke the law, the police are completely in the right.  Do you support our police?"},{"comment_id":"10156940473490354","commenter_b":"She was having plastic surgery!","commenter_a":"Where were you Maria, when Obama was proposing this last year. That's when you should have objected! It's too late now!","post_message":"BLISTERING..."},{"comment_id":"541211179416415","commenter_b":"hey Trump when you talk about the refugees, can you name every refugee groups that lives in the United States and what kind of jobs they have to work to feed their family and children? BTW, every refugees family's that moved to United States are helping out U.S. economy by working at those places where no white man can stand to work there, also they are paid with minimum wage without complaining. so be grateful and welcome them to come and live in the United States, especially the Karen refugee.","commenter_a":"Mr Trump the solution of the conflict between Israel and Palestinians can be very simple America and Europe should stop sending billions of dollars to Palestinians so the Palestinians know that when they get up in the morning if they want to eat they have to work and not killing the Jews!!","post_message":"We’re going to come together and come up with solutions- and so far I cannot believe how civil it’s been up here! #GOPDebate"},{"comment_id":"660818097425993","commenter_b":"She needs to get Raped to change her opinion. stupid bitch.","commenter_a":"She is a disgusting, lying hag! If she can lie to children, she's a special kind of \"she-demon!\"","post_message":"This is just disgraceful."},{"comment_id":"10153634086331130","commenter_b":"It's not the point! The point is that it was NOT any of her, or YOUR, for that matter, business what that girl should or should not wear in this FREE society!! Put on your Spanx, cover your own fat, & shut the hell up!","commenter_a":"Sorry but in order for the dress to have the smooth look she does need spanx. She getting upset when she know damn well she put on spanx under her dresses. Many women fat or skinny wear spanx it's part of a woman's closet.","post_message":"\"I hope this is shared and gets back to you...\""}]
