[{"comment_id":"10154751454678010","commenter_b":"@username --You are a woman, but lady? Highly questionable.","commenter_a":"Aren't \"Indians\" a part of American History, whether or not their story is positive or negative? Why does every damn thing have to be racist? I think your article/argument would have been more effective if you had taken statements by full blooded Indians who are actually offended by this rather than just mention that the mascot and \"red face\" really \"do harm to actual people.\"","post_message":"Cleveland knows its mascot is racist. They removed \"Chief Wahoo\" from their caps at the beginning of the season.   And yet now he's reappeared on baseball's biggest stage.   via Los Angeles Times Opinion"},{"comment_id":"1065131623520589","commenter_b":"R.I.P.","commenter_a":"Awwww, RIP, Al","post_message":"RIP Al from Happy Days. He passed away on Friday at age 96."},{"comment_id":"10152838610772144","commenter_b":"We get it, dude. Strong, intelligent women scare you.","commenter_a":"Filing charges for social media is ridiculous, it wont stick","post_message":"\"The amount of gender violence that I experience is absolutely extraordinary. And a significant part of my day today will be spent filing police reports at home about gender violence that's directed at me in social media.\"- Ashley Judd"},{"comment_id":"986494124719342","commenter_b":"Who cares! Go home where u b long","commenter_a":"They have their country they can go back home anytime. We do not need to have them visit anymore","post_message":"Donald Trump's promise could change EVERYTHING!"},{"comment_id":"1031885216864241","commenter_b":"no kidding wow","commenter_a":"Kerry is a moron!","post_message":"If only he could've predicted their reaction..."},{"comment_id":"10155207615341037","commenter_b":"No politics?!?!?! You are not paying attention. 😂😂😂 LOVED it. AND what she stands for....only few understand. Good for her. NASTY WOMEN!!!!!!","commenter_a":"There was a subtle political statement in her opening songs but I felt it was out there to move people together. She was nothing less than I expected. She brought down the house. The show was amazing","post_message":"Did Lady Gaga win the Super Bowl?"},{"comment_id":"10153247983639411","commenter_b":"Why so you can kill some hardworking people going to work or school children. Blow yourself bitch and take some jihadists pigs back with you you prostitute. Hope you fry in hell you piece of shit.","commenter_a":"She shouldn't be allowed back into the UK","post_message":""}]
