[{"comment_id":"10153274785312623","commenter_b":"I think they need counseling by Dr Phill.Hey people!Wake up!Want to be with the one you love?Renew your vows yearly.Want to have it both ways and live with guilt every day?Do not get married.","commenter_a":"It's like this.If you love each other.Fine.If you have the need to stray away from your soon to be spouse to hang out with the girls.Fine.But to be with somebody while you are married?Hey you are not fooling anybody but yourself.Either be married and be happy or go two different directions. I have been with my wife fronearly 20 years and have been through the best of times and the worst of times","post_message":"The wife of a Winston-Salem man arrested for bigamy is speaking out:"},{"comment_id":"10153037067141636","commenter_b":"Gays must be slaughtered like pigs","commenter_a":"The most easiest and simplest HIV aid prevention, is don't commit gay, rather is an animals behave. Don't forget you're human kind.","post_message":"The drug successfully reduced the risk of HIV infection by 86 per cent"},{"comment_id":"10155818852335354","commenter_b":"Fucking assholes!! The Dukes weren't racists!! God this country is full of weak kneed liberal scum!","commenter_a":"This is really getting crazy,who,s running this country anyway.We didnt used to have such nonesence.","post_message":"Absurdity..."},{"comment_id":"10154860670292435","commenter_b":"Take flamethrower out there and really clean the swamp!","commenter_a":"You get a fire truck and water board them with a hydrant.","post_message":"Happening Now: Protesters outside the White House opposing President Donald J. Trump's travel ban."},{"comment_id":"1003834523018162","commenter_b":"Fuck her she hates white's. She only hires blacks.","commenter_a":"she had made millions off the white people and i do mean millions.let her take some money and give it to street people or vets which i doubt she will she would only let them starve!!!!opra disappoints me as i thought she wouild be the last person to say something like that!!!!!!","post_message":"Oprah Claims White People Are The Cause Of Racism In America.  What a hypocrite, she is the racist.  Do you think Oprah is bigot?"},{"comment_id":"10154939556251320","commenter_b":"WE DON'T NEED, YET, ANOTHER ROSIE O'DONELL barking her bossy pants ignorance our way!!","commenter_a":"All the comments below ring as TRUTH, but tolerance and inclusion goes a LONG LONG way. Whether OR not you agree with ANYONE's lifestyle choices!","post_message":"Susan Olsen, who played Cindy Brady on  Brady Bunch has been fired from her job as a Los Angeles-based radio DJ after she posted a homophobic rant on Facebook."},{"comment_id":"490189094517729","commenter_b":"USE PEPPER SPRAY TO PROTECT HER......SHE IS A MASTER PHD CROOK LIAR....THIEF....","commenter_a":"Cheating Trump is lying when he open his mouth and lied when he closed it. @webpagelink","post_message":"Crooked Hillary wants to get rid of all guns and yet she is surrounded by bodyguards who are fully armed. No more guns to protect Hillary!"}]
