[{"comment_id":"1731050200496998","commenter_b":"Some mothers eat their young!","commenter_a":"Typical!","post_message":""},{"comment_id":"10153813009729497","commenter_b":"Birth order matters: by the third kid he or she can tell through the uterine lining how lame life is going to get","commenter_a":"Most of us are now. Thanks to big business. Bought politicians","post_message":""},{"comment_id":"10153617541751770","commenter_b":"As Hillary would reply, \"What difference does it make now? I've WON! Sadly, has she?","commenter_a":"You have no anything to go on except you love to hear your lips flap self righteousness find some proof not just the dolts you hang with","post_message":"Dana Perino destroyed Hillary Clinton in an epic rant over her use of a private email server..."},{"comment_id":"975168222494648","commenter_b":"Not really , I was talking about little pussy Libtards like you Chucky boy !","commenter_a":"Yea , all money belongs to the Dear Leader. And he gives us only what we need or deserves ! Just look at how that worked out with Joseph Stalin !","post_message":"Oh no."},{"comment_id":"10153569375843203","commenter_b":"Unless Rosie O'Donnell is raping you, she isn't forcing herself on you. I know many gays and I must be lucky to have escaped their revenge and then forcing their lifestyles on me since I'm still straight. Rosie O'Donnell is and always will be a loudmouth and a celebrity. Don't like it? Don't watch her.","commenter_a":"..Many of them are miserable, intolerant people hellbent on revenge ,forcing their lifestyles on others, and making everyone else miserable also.....Example : Rosie O'Donnell - one of the most miserable, intolerant people forcing herself onto the public...","post_message":"Study finds homosexuals less healthy, happy than heterosexuals    @webpagelink"},{"comment_id":"819567068195360","commenter_b":"Build the wall. Get rid of illegals now.","commenter_a":"Those of you who are trolls (you know who you are) , really need to attempt to get some education, I.e., government or civics classes. 🇺🇸🇺🇸🇺🇸 TRUMP","post_message":"WATCH LIVE: Members of the Electoral College in Texas gather at the statehouse in Austin to vote for the president and vice president of the United States. One Republican elector, Chris Suprun, has revealed his intention to vote for John Kasich instead of Donald J. Trump."},{"comment_id":"10152924291939091","commenter_b":"A woman!","commenter_a":"That's why I like my men clean cut... No beards eww...","post_message":"How dirty is your beard?  A shocking new study found men's facial hair to contain the same bacteria found in human feces: @webpagelink"}]
