[{"comment_id":"966246990097370","commenter_b":"Umm Ferguson, Watts Riots, La Riots. White people are out of control? Ok","commenter_a":"I pray for their families","post_message":"White supremacists shoot five people near the #BlackLivesMatter protests for Jamar Clark, a 24-year-old unarmed black man who was shot earlier this month by police.  Protestors took to Twitter after the shooting & described the scene as chaotic, saying police maced the crowd before an ambulance arrived to assist the wounded.  No arrests have yet to be made. DETAILS ----> @webpagelink"},{"comment_id":"10153894992921336","commenter_b":"@webpagelink Wake up my friends. Biological Jihad being preached all over Islam is the most dangerous problem to ever face the world because the world is still ravaged by fake political correctness, and many countries are not united as they once were. Immigration without assimilation is invasion. Be a Guardian for good. #CognitiveAwareness #KnowledgeIsPower #Guardians #ProtectYourCountries #AlwaysBeReady #UniteAgainstIslam","commenter_a":"I heard that Obama does come from a family that is muslim. maybe his father but either way he does believe in their ways and as for Hilary Clinton she is a liar a thief and has no business running for president. we do not need anymore murders caused because she has better things to do like warning her family and not America about anything.","post_message":"“President Obama and Secretary Clinton just won’t say it—radical Islam. And they’re making a big mistake…They somehow think that is a declaration of war on religion. And I don’t know where they get that idea. It’s not. It is specifically identifying the enemy.” – Greta Van Susteren  MORE: @webpagelink"},{"comment_id":"10153186882059641","commenter_b":"hmmm as long as it's not cooking drugs, printing fake marriage certificates, scamming, and turning young girls into prostitutes... #NOTOXENOPHOBIA AND ALL ILLEGAL ACTIVITIES","commenter_a":"I hope South Africans will not hear this, they will accuse the robot of taking their job and another xenophobia again.","post_message":"This robot chef will soon be able to cook 2,000 recipes. Pity it can’t eat them: @webpagelink"},{"comment_id":"861748160544348","commenter_b":"No, she was a goddamned moron that left it unattended. With a toddler. Gene pool cleaned.","commenter_a":"Those women's groups are worthless. If they had any kind of gonads they'd realize that disarmed women are victims.","post_message":"BREAKING: Michigan Governor Vetoes \"Shall Issue\" Gun Bill After Criticism From Women's Groups"},{"comment_id":"848078538560940","commenter_b":"Only fucking idiots want her","commenter_a":"Am I the only person who likes her? Yikes.","post_message":"Hillary Clinton could finally shatter that glass ceiling."},{"comment_id":"994048267321588","commenter_b":"Yes. And paid for by private donations","commenter_a":"Gorgeous yet not gaudy. Most important: Everything was Made in the USA . Wasn't it?","post_message":"Michelle Obama blows $600k on ‘modest’ dining room makeover"},{"comment_id":"1285821781534200","commenter_b":"nasty reptilian","commenter_a":"Well i think there is no more people to die,there was only one left so G Michael was that,the question is why they need people to die?","post_message":"I think she was right"}]
