[{"comment_id":"1632662777034101","commenter_b":"Hope she cheats on you!","commenter_a":"I did the same thing to my fiancee. I told her if didn't register to vote, I'd be mad. She did register. When it came the time to vote early, she feet - dragged. And I told her if you didn't vote for Hillary Clinton, our relationship would be over. She voted. Emails or no emails, Hillary all the way!","post_message":"\"If you didn't vote for Hillary Clinton ... I'll seize your phone, I'll seize the car.\"  Watch this mom's impassioned plea for her son to vote for Hillary Clinton."},{"comment_id":"480699562111924","commenter_b":"What a phony. She could care less about the working class. But she's got a lot of people fooled. Poor souls.","commenter_a":"Hillary has fought all her life for the common people Bernie just the last ten years, so I want Hilary over Bernie.","post_message":"This is something all voters should see."},{"comment_id":"1150426991676729","commenter_b":"We could put all Muslims on Atlantis and let them fight it out! Yes, I know it is a fantasy that Atlantis existed but believing Islam can coexist with the rest of the world is a fantasy, too. Best hope the idiots get there and drown vforevthey realize they have been had. Obama can lead them with Hilary behind. My fantasy! Sorry, but I have problems.","commenter_a":"Way to go Angola","post_message":"Muslims have been asked to tear down their own mosques under threat of paying for the demolition fees...."},{"comment_id":"499065056962019","commenter_b":"I can't stand her. Send her back to India where her parents are from.","commenter_a":"We can't let the GOP pick and choose who they want in office. It is up to the voters! GOP take notice, heed our warning, because if this does happen, and Donald becomes and independent; there will be. Democrat elected!","post_message":"Now that she criticized him, will Donald Trump snuff out Gov. Haley's rising star?"},{"comment_id":"1028894700543062","commenter_b":"Is that a slit in her dress up to her you know what? Inappropriate for the First Lady. Not running for first slut!","commenter_a":"Moochie, it's gonna take more than $12000.00 to make you the Lady of Camelot.","post_message":"Woman of the People"},{"comment_id":"10152848525036749","commenter_b":"Happy bday!!!","commenter_a":"Happy Bday!!!","post_message":"Happy birthday to an amazing, inspiring First Lady."},{"comment_id":"979014955531025","commenter_b":"Yes yes Milana the porn star.","commenter_a":"Did anyone besides me have flash backs to Jackie Kennedy when Melania walked out Classy dressed to the nines This lady loves America This lady will be a great first lady","post_message":"Donald J. Trump made a dramatic entrance at the GOP convention and introduced his wife Melania Trump. #RNCinCLE @webpagelink"}]
