[{"comment_id":"602931503228475","commenter_b":"I have never heard of or seen a cow attack a person!!! No Good Worthless Muslims!!!","commenter_a":"Those men will burn in hell one day","post_message":"Two Men Were Stabbing a Girl in “Honor Killing” When This Cow DID THIS to Stop Them…"},{"comment_id":"1601073560185519","commenter_b":"@username I know I'm not saying he's illegal, he just wants every illegal to come into our country without becoming legal. He's ruining our country!","commenter_a":"She's not even a native born American trying to become the FLOTUS. Yet Donald Trump gave the current American President hell about his birth certificate! GTFOH","post_message":"Melania Trump: \"The race will be hard fought all the way to November, there will be good times and hard times...it would not be a Trump contest without excitement and drama.\" @webpagelink"},{"comment_id":"966993893421492","commenter_b":"Republicans and Democrats been divided .. how did he divide us.. two different view points","commenter_a":"Can't wait for Obama to get out of there so things can go back to normal once Trumps in there to clean up the mess!","post_message":"UPDATE: The White House lockdown has been lifted. Secret Service agent shot an armed suspect outside the White House compound after he refused to drop his weapon.  Breaking News: The White House is on lockdown after reports of a shooting nearby. Secret Service members and police officers are getting people off of the White House North Lawn. @webpagelink"},{"comment_id":"10153579944776438","commenter_b":"If he hates it that much, he can step down and we can keep his paycheck.","commenter_a":"lol @ headline","post_message":"\"He hates it.\""},{"comment_id":"1072164979509916","commenter_b":"If sash doesn't get picked","commenter_a":"I'm so done ffs @username","post_message":"The Bachelorette Australia favourite and Sam just happen to holiday in the same place at the same time   (via Daily Mail Australia)"},{"comment_id":"944373212266686","commenter_b":"Planned Parenthoods primary function is abortion. Enough said. Defund it.","commenter_a":"Only 3% of Planned Parenthood's funding goes to providing abortion. None of that money comes from taxpayers. Defunding Planned Parenthood means defunding millions of dollars in preventive care, cancer screening, contraception (which reduces abortion), STI screening, and other such essential services. I'm pro-choice, but if you guys have such a problem with abortion, why don't you just campaign to force Planned Parenthood to stop providing abortion services and leave everything else intact?","post_message":"Wow."},{"comment_id":"969205239835501","commenter_b":"Karma ain't she a bitch!!!","commenter_a":"Karma is a bitch. Racism and bigotry are not signs of a patriotic, freedom loving American.","post_message":"The couple that hates together stays together, but their hypocrisy has finally come back to bite them."}]
