[{"comment_id":"10157618931615389","commenter_b":"And Hillary has never lied right? Are you serious right now? Hillary has been exposed for who she is and it's not looking good for her. For she is so squeaky clean, why does she keep hiding from the media? She is always at home resting. She used her position to grant favors to foreign governments and took millions from them when they abuse women. You are worried about Trump being exposed on that debate stage? What a joke!","commenter_a":"The snake oil salesman's chickens come home to roost Monday night. Hillary & moderators will quickly expose the lying fraud artist for the flip-flopping liberal he's always been.","post_message":"\"Because they can't attack him on policy, they try to make it personal. They appeal to the emotions and the sensitivities of not only the black community, but the foreigners and females.\"  Pastor Darrell Scott said the Democrats don't attack Donald J. Trump politically because personal attacks are \"all they have.\""},{"comment_id":"10154243512856770","commenter_b":"We will send you more Muslims , you can send us the anti Muslims.","commenter_a":"I openly protest morons who throw homosexuals off buildings and burn people alive who don't bow before their god (may he eat pork)","post_message":"Police in Toronto, Ontario might charge a group of anti-Muslim protesters for violating hate crime laws."},{"comment_id":"1658190531136070","commenter_b":"Racist unethical cheater!","commenter_a":"This garbage troll shouldn't be allowed to breathe at all!","post_message":"Geraldo Calls The Constitution Bullsh*t And Then Goes On Epic Rant Slamming Americans  Kick him off Fox. He doesn't deserve to be on the air. Do you think he should fired?"},{"comment_id":"466533816861832","commenter_b":"I don't know why this is article has been shared today, because it will just upset people on a Holiday and just continues to widen the divide between the people. Because we are celebrating our country, our history, and the couragous people who protect our freedom, it seems a little rude and inconsiderate to share this message. And furthermore, I do not believe the data report anymore than I can throw a cow. I believe most of us are equal in how patriotic we are or not.","commenter_a":"Conservatives only THINK they are more patriotic. Why? God, guns and gays......","post_message":"Is this poll right?"},{"comment_id":"1080058818698124","commenter_b":"Boycott Marco and Kasich media attention until they get out! Spread the word! They have no glide path and are trying to protect rhino control on the outcome of the nominee!","commenter_a":"Trump is winning the Blaze poll 68% at this posting. Better get some bots for Cruz going so he can cheat to win, he's good at it.","post_message":""},{"comment_id":"10152859683207434","commenter_b":"@username is a pathetic cesspool. Pandering feminist Cosmo garbage","commenter_a":"Lenny Kravitz’s dick fell out on stage. Look at it dangling. Kravitz was performing at a show in Stockholm on Monday when his (perhaps cock-ringed) penis came tumbling out. Just as the rocker was getting low to the flo’, the D broke out from its restrictive leather pant cage and gave the world a show.Note how the tongue and the penis simultaneously present themselves during this tragic wardrobe malfunction. Is it a beautiful thing? Who knew.","post_message":"Note how the tongue and the penis simultaneously present themselves during this tragic wardrobe malfunction."},{"comment_id":"579405548899257","commenter_b":"@username smart woman","commenter_a":"\"Mr. Trump what would you like for dinner?\" Trump: \"I'm building a wall.\" \"Mr. Trump why don't you like Mexicans?\" Trump: \"I'm building a wall.\" \"Mr. Trump why don't you ever answer questions?\" Trump: \"I'm building a wall.\" \"Mr. Trump tell us something relevant about this presidential race.\" Trump: \"I'm building a wall.\" \"Mr. Trump are you building a wall?\" Trump: \"I'm going to make America great again!\" Well, that pretty much sums up everything this \"man\" has said all along and people will continue following his ignorance. #makeamericahateagain","post_message":"Donald J. Trump insists a judge born in Indiana is Mexican."}]
