[{"comment_id":"665165626971083","commenter_b":"Never Clinton!! She praised Robert Byrd A known KKK LEADER AND KLAN RECRUITER and a complete liar and flip flopping scumbag!! And her SEXUAL PREDATOR Husband need to be put in jail!! We need to set limits on how long you are allowed to run in government and all these establishment criminals that keep getting elected and ruining our country on both sides need to go !!!!","commenter_a":"I don't believe that !!","post_message":"Unless things change extremely fast, Clinton will officially lock up the Democratic nomination after the California primary. Will you be supporting her this November?"},{"comment_id":"634421746711040","commenter_b":"Yur all ignorant fucks","commenter_a":"Of course he's guilty, adults never have the right to release their anger on minors, no matter the situation!! Smh!!","post_message":"Horrifying footage shows a Texas police officer body-slamming a middle school student. #MicBrights"},{"comment_id":"708523179338260","commenter_b":"Bust his ass .","commenter_a":"kick its ass out of the school","post_message":"Cross dressing boy entered girl's locker room and did this.  This is wrong. The boundaries need to be drawn.  Would you want this boy in your little girl's locker room?"},{"comment_id":"10153632198263908","commenter_b":"These girls suck. There's no way around it.","commenter_a":"So enlightened yet judging girls because they take a selfie..","post_message":""},{"comment_id":"1603977773244161","commenter_b":"Revoke her clearance!","commenter_a":"BREAKING: HILLARY SET TO RECEIVE SECURITY CLEARANCE ANY DAY NOW!!! She broke the law. She exposed our nation secrets. She lied to the American people countless times. And yet, this week she is set to receive access to information she already proven she can handle. We cannot allow Hillary to put America safety at risk. Demand the FBI revoke her security clearance","post_message":"Tom Fitton is LIVE to discuss our Judicial Watch weekly update on the Obama IRS Scandal and more!   [touch sound icon at bottom right to increase the sound or turn your own volume up. Thx! . ]"},{"comment_id":"10153496846973132","commenter_b":"I highly doubt they kept having them JUST to have a girl.","commenter_a":"How selfish, to keep having kids only hoping for a gender. That 13th boy will someday realize he was only born because his parents hoped he'd be a girl.","post_message":"Maybe the 14th time's the charm?"},{"comment_id":"10154179753088645","commenter_b":"Girl bye!!!","commenter_a":"She should be offended, he was trying to hook up with another woman while she was pregnant with his kid and during his apology he never said sorry to his wife.","post_message":" does not represent the man that I know, she added."}]
