[{"comment_id":"10153141686007093","commenter_b":"No she isnt..cause when you see a 400 lb woman wear them and you can see through them then you will be on her side! !!!!!!!!!!!!!!!!!!#!!!!!!!!!","commenter_a":"She's just all butt hurt because she doesn't have a nice body to pull off wearing leggings like they're pants ;)","post_message":"It's leggings season. But according to one woman's viral rant, a lot of people don't wear them correctly... @webpagelink"},{"comment_id":"10153134477163984","commenter_b":"Already too late!! Enforce the law that is already on the books, secure the border and there would be no need for immigration reform and less deportations!!! No jobs for the American Citizens now, so let's grant amnesty to 5 million illegals!! That will get the economy and the job market rollin!!!","commenter_a":"No person has every done more to harm the best nation in the world than this man ! I am surprised a patriot has not shot him by now ?","post_message":"This is one of the scariest things I have read in a long time. If Americans don't wake up, it could soon be too late.  Spread the word about this danger."},{"comment_id":"594411744025341","commenter_b":"You probably have one between your legs Shannon!","commenter_a":"Who cares! It's an inanimate object! Ever heard of idolatry? This is it!!!! True followers of Christ don't kneel before a statue, they kneel before the one true God.","post_message":"What does sheer animalistic Muslim hatred against Christians look like? Story below."},{"comment_id":"10153592234263132","commenter_b":"She got dem dreads doh!","commenter_a":"SHE DOESNT EVEN LOOK BLACK!","post_message":"\"We are her birth parents. We do not understand why she feels it's necessary to misrepresent her ethnicity.\""},{"comment_id":"10155014119221178","commenter_b":"Democrats have always gotten away with MURDER!!","commenter_a":"Accountability was not a word he knew--or enjoyed.","post_message":"Talk about a major understatement from The Daily Beast."},{"comment_id":"880395268723393","commenter_b":"She was armed with a deadly weapon. I hope she suffered.","commenter_a":"She was probley scared when all those security came at her with guns drawn thats why she tryed to move the car. Hands on steering wheel not reaching for wepon. They didnt have to shoot her.have you noticed all the killings for petty crimes like selling cigerettes, stealing a pk of cigerettes. Being homeless, even jaywalking or talking back to police. This is not a good situation. Real criminals who rape and torture getting away with it because the police would rather arrest or kill someome who is not a threat. I am ashamed of the police who do these things and the other cops who watch and do nothing and of the law that always finds brutal cops innocent. I am afraid of the police many people are. Since when should we pay for a legalized brutal mob. May god help us","post_message":"New details emerge about the 2013 shooting of an unarmed woman on Capitol Hill."},{"comment_id":"1150086235078889","commenter_b":"Hillary Clinton for President!","commenter_a":"This guy.....God help us all if he's elected!!!! Gary Johnson!!!! Love how he talks about jobs when he's notorious for trying to break up unions and has his own clothing line made in China!!! l","post_message":"WATCH LIVE: Donald J. Trump holds rally in Florida"}]
