[{"comment_id":"10153559640036051","commenter_b":"This post gave me cancer all over again....","commenter_a":"I support guns. I love them. I have some. They are for Huntin. I believe we should be able to own guns. But this Type of rifle. I think our militry And police is the only ones who should have this kind of gun. What does a deer hunter need with somethin like that. I think somethin like a 30-06 is plenty of gun. Or somethin similar. Not just that kind. But Nothin like Whats shown. There should be a limit. But not banned","post_message":"A federal court just ruled that a Maryland law banning citizens from owning military-style rifles is unconstitutional. Do you support the court's ruling?"},{"comment_id":"838491256240234","commenter_b":"Please go back to whatever planet you came from!!!! Haven't we had enough of her?","commenter_a":"Oy! She is no longer relevant, though she keeps trying to be. Now just looks foolsih. Very sad.....","post_message":"They're back! The Palins are trying to horn in on the Duggar spotlight, regardless of how grimy."},{"comment_id":"1119178091433245","commenter_b":"She's going crazy from lack of schlong!!!!!!","commenter_a":"She is both a liar and totally stupid....and murderer.","post_message":""},{"comment_id":"741809245917684","commenter_b":"THOSE 3 BITCHES...ARE GETTING THE SHIT GANG BANGED OUT OF THEM NOW.","commenter_a":"IS is recruiting sluts for sex only son","post_message":"Aqsa Mahmood, 20, left her home in Glasgow in 2013, and married an IS militant in Syria."},{"comment_id":"10156446544055594","commenter_b":"That woman needs alot of things","commenter_a":"We all only have so many minutes that make up our lifetime. This is a premeditated act of terrorism for which they should all be jailed for a minimum of a year.","post_message":"LIVE video and coverage as protesters are being removed and traffic is backed up on the Bay Bridge."},{"comment_id":"10153356544334087","commenter_b":"Yep.","commenter_a":"Hillary should worry about that indictment coming down the pipelines in January.","post_message":"“This is truly unbelievable, that after what we’ve seen in Paris and other places, Republicans will not bring up a bill that will prohibit anyone on the no-fly list from buying a gun in America,\" Hillary Clinton said. \"If you are too dangerous to fly in America, you are too dangerous to buy a gun in America. How many more Americans need to die before we take action?”"},{"comment_id":"1750223515225265","commenter_b":"The other video was funnier and because you didn't get as many likes as her shes a dumb bitch. That's what made this video suck","commenter_a":"She had fun so you call her a dumb bitch. This kinda attitude is what gives pro 2a a bad rap. That and the stupid shit the NRA says.","post_message":"Remember that dumb bitch who went viral for laughing at herself?  @drewhopkins has outdone her.  Shop.TacticalShit.com"}]
