[{"comment_id":"1126925213993897","commenter_b":"Woman*","commenter_a":"Women?","post_message":"This woman was found dead in a shopping cart -- and police have started a murder investigation. >> kiro.tv/BodyInvestigation"},{"comment_id":"10154593663574342","commenter_b":"Okay, she looks stupid with that dress, you ain't royalty Girl... that's something Kate would wear smh...or the Kennedy","commenter_a":"just hate the way he acts , cant even wait for his wife","post_message":"First Lady Melania Trump is wearing a sky blue, mock turtleneck Ralph Lauren dress as she walks into St. John's Church with President-elect Donald J. Trump.  Watch #Inauguration Day live-->@webpagelink"},{"comment_id":"10153629371177235","commenter_b":"Gay marriage Trumps Straight Marriage, get lost Huckabee:)","commenter_a":"Down with Huckabee, as Donald would say, LOOSER..... .","post_message":"If God already 'solved' racism, he didn't do a very good job ..."},{"comment_id":"662046983985880","commenter_b":"She's not worth the used toilet paper in my toilet","commenter_a":"isnt she the wench thast triex to be a whore on every show, even the disney channel?? shes a meaningless tramp with no talent. her father is a meaningless douche with no talent. who cares whqat the slut thinks? shed vote for anyone who could give her a good orgasm","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'.  This is unacceptable, we stand against Miley 100%.  Do you agree Miley should be kicked out of the country?"},{"comment_id":"1368989116512954","commenter_b":"This is a poorly done troll job","commenter_a":"How about cutting the businesses taxes and then giving that money to illegal immigrants and other countries and people on welfare who can work?","post_message":"After liberals raised the minimum wage again, this restaurant owner had had enough. Here's how he took matters into his own hands and made sure his customers knew it...  This is what the left does NOT want to talk about when it comes to the \"fight for $15.\""},{"comment_id":"10153888604683812","commenter_b":"Bye dumbass. Take the illegals with you, of ALL nationalities","commenter_a":"I respect our president and all past Presidents. I will respect all future Presidents. ( unless Donald Trump is elected, I will move to MEXICO AND HELP BUILD THE WALL!!!!!!)","post_message":"President Obama has joined Facebook! Here's what the President wrote in his very first post: @webpagelink"},{"comment_id":"870555189755929","commenter_b":"Fuck that! Teach those fucks the appropriate way to interact with us.","commenter_a":"POLICE=Political.Oppressors.Lynching.Innocent,Citizens.Everywhere.","post_message":"Thoughts?"}]
