[{"comment_id":"10154739340963812","commenter_b":"HES STICKING TO BUILDING IT GOOD FOR YOU TRUMP BUILD THE WALL BUILD IT TALL","commenter_a":"Cause both of them know a wall isn't gonna happen, whether he wins or not!","post_message":"Donald J. Trump says that while he had a \"constructive\" meeting with the Mexican president, they \"didn't discuss\" who would pay for the border wall."},{"comment_id":"1323090797735546","commenter_b":"Woman in prison","commenter_a":"Drain the swamp","post_message":"WATCH LIVE: Bernie Sanders speaks at rally here in Phoenix, Arizona at Central High School."},{"comment_id":"10153545478606162","commenter_b":"She is a fake little creep","commenter_a":"hmmmmm, if she hates the way Americans eat why was she in a donut shop?","post_message":"ARIANA DRAMA: \"What the **** is that? I hate Americans. I hate America! That's disgusting,\" Grande said when a tray of doughnuts appeared in front of her."},{"comment_id":"1738783449718030","commenter_b":"Lmfaoooo she's just so fed up","commenter_a":"The teacher at 52 seconds hung her head low like \"these mfs here \" Ty1253184741396567","post_message":"Move over, #MannequinChallenge. The #TrumpsComingChallenge is sending students fleeing @webpagelink"},{"comment_id":"10153922019898812","commenter_b":"Anyone but Hillary!!","commenter_a":"The only thing I fear is a Republican getting elected in 2016","post_message":"President Barack Obama: \"We cannot and we will not succumb to fear.\" @webpagelink"},{"comment_id":"1886511228246156","commenter_b":"Illegal aliens.","commenter_a":"What your liberal brains are to small to realize is there is no defending illegal immigrants. They have no right to a trial. They have no right to a defense. They are automatically guilty and only entitled to deportation. If you want to be American there is a legal way. It is not easy nor will it be quick. But if you are willing to do it the legal way then you get to become an American and stay without fear of deportation.","post_message":"Janet Napolitano says the University of California will vigorously protect illegal immigrants."},{"comment_id":"10153380056966770","commenter_b":"Get rid of Obamacare and the illegal aliens!","commenter_a":"I so despise Hillary Clinton. Why don't they indict her already.","post_message":"Hillary Clinton wants to use Obamacare to provide health coverage for illegal immigrants."}]
