[{"comment_id":"758826910928758","commenter_b":"Those fucking bastards.....we gotta gut em, then kill them, then gut em again, then smoke a blunt or two and plant a tree and then maybe spread their entrails on our enemies lawn so they get the message.","commenter_a":"There's obviously some sort of mysterious group of people who have been trying to hide the advantages of the hemp plant to prouduce many of our products for everyday use.","post_message":"The solution seems obvious, doesn't it?"},{"comment_id":"10152781185011748","commenter_b":"A woman named Ann Coulter taught me to hate the republican party!","commenter_a":"Why is it still speaking?","post_message":"Ann Coulter slams college loans as a \"scam\" meant to make kids hate white people and Republicans"},{"comment_id":"10153664753098797","commenter_b":"Happy Birthday Glenn :)","commenter_a":"Happy birthday","post_message":"HEARTBREAKING AND HEARTWARMING: When Glenn turned 6, his mom threw him a big party. She invited 16 kids - but not one of them showed up.   Glenn was crushed. So his mom went on Facebook to vent. What happened next is absolutely incredible. See here - and wish Glenn a happy birthday in the comments section below:"},{"comment_id":"1085812054871914","commenter_b":"Ignorant pig","commenter_a":"Be careful what you wish for buddy","post_message":"\"I think we should take a drug test prior to the debate.\""},{"comment_id":"1048204431922451","commenter_b":"in the beginning of his campaigned media said he was a Muslim,friends of the activist terrorist eyre and his pastor mentor for 20 yrs condemned America,his wife hate America, the only PRESIDENT APOLOGIZED FOR AMERICA and the people still vote for him, and look America now, bankrupt morally,financially,economically and bankrupt spiritually. AND THE BAD NEWS HILARY GOAL IS TO FOLLOW HIS STEPS. IF ANY ONE OF DEMOCRATIC WIN, THE END OF AMERICA . WE WILL BECOME A SOCIALIST ,COMMUNIST COUNTRY LIKE CUBA AND SOCIALIST COUNTRY OUR LIFE WILL RUN BY THE GOVERNMENT. YOUNG PEOPLE ARE BRAINWASH OF THE SOCIALIST TEACHERS IN SCHOOL AND UNIVERSITIES. PRAY FOR OUR COUNTRY AND YOUNG PEOPLE,","commenter_a":"I have been saying that for years!!! He isn't going to do anything to hurt his peeps.","post_message":"Former CIA Agent Says Obama is Working With The Muslim Brotherhood Against America. ⋆ Please Share ⋆"},{"comment_id":"1242850115735016","commenter_b":"Please don't put us in danger Mr. President. It doesn't matter where you put these refugees in the US. They can still be a threat. I still can't get over 9/11","commenter_a":"How about taking care of the homeless in the country before letting refugees in? I know it might sound crazy, but give it a shot.","post_message":"After the terror attacks in Paris that killed at least 129 people, the placement of refugees fleeing Syria has come under scrutiny as more than a dozen governors - mostly Republicans - have said the do not want the refugees in their state."},{"comment_id":"10153205553056782","commenter_b":"@username...the difference is that I am a legal United States Citizen and the illegal criminal is not. They broke the law so that makes them a criminal..and as for pushing...the illegals are the ones that are not going to like the results.. You come to the U.S. legally and you are welcome with open arms. Illegals come here by breaking the law and then refuse to learn English and then demand they be given the same rights as American citizens and for things to be changed to fit them...BS!!!!","commenter_a":"This is complete BS!!! They are illegals!! NOT undocumented.... In Oklahoma you have to prove you are here LEGALLY, not an illegal criminal to get an Oklahoma ID or DL. Sign up for a DL as an illegal and get deported.","post_message":"An Oklahoma City grassroots effort to get undocumented immigrants drivers licenses is gaining momentum."}]
