[{"comment_id":"1004981906294263","commenter_b":"Hillary DESTROYED him.","commenter_a":"I believe Trump won, but barely. What he should have pushed on and pushed really hard are three things. First, he should have looked directly into the camera and said, \"Mrs Clinton has said over and over that she is infinitely more qualified than I to be Commander in Chief. She could not and actually would not protect four lives let alone 320 million. Do YOU trust her with your lives and those of your children? Mrs Clinton has said over and over that she understands the plight of the inner cities and has worked hard to erase the despair that exists in our minority communities. Tell me, Chicago, Baltimore, East Saint Louis, and every other inner city, this woman has had nearly thirty years to help you and other than pander for your vote, exactly what has she done and are your lives better? And lastly, Mrs Clinton has ...","post_message":"The 1st presidential debate in 90 seconds.  Who do you think won – Hillary Clinton or Donald J. Trump?"},{"comment_id":"1252245691520631","commenter_b":"Simple...don't allow anyone in from radical terrorist countries until their country has a way to prove who the person is. Until then they can all stay there and fight in their own countries. Make their own America or their own hell. Whatever they want. But don't do it here.","commenter_a":"Time to shut the doors to these people. All. Until there is a better system.","post_message":"Don't expect to hear a word about this in the media.   This is the kind of info that is horrible for the left."},{"comment_id":"10153148435072098","commenter_b":"Wrong person died","commenter_a":"Guess his high heels got stuck on the gas pedal haha 😂","post_message":"BREAKING..."},{"comment_id":"1370743996276280","commenter_b":"She knows, because she spent a lot of money buying all those super delegates. Fact is neither will have enough pledged delegates to win outright, so bribed insiders will determine the outcome. That's really democratic isn't it. It really the Clintons and the DNC that are killing the party.","commenter_a":"Vote SANDERS","post_message":"Hillary Clinton said what everybody outside of Bernie Sanders and his supporters are thinking. The Democratic nomination process is in effect over, and there is no way that she won't be the nominee."},{"comment_id":"10153219350514486","commenter_b":"She should EAT SHIT AND DIE !","commenter_a":"Should have been the day after she was elected","post_message":"Now that Harry Reid has announced his retirement, some Democrats think it time for Pelosi to do the same..."},{"comment_id":"10153878198208984","commenter_b":"Decrepit old Hellary needs her fatA$$ ship sunk already!!! DESPERATION makes her even uglier!!!","commenter_a":"everything about this bitch is fake.","post_message":"Wow. Hillary is in a rough spot, and what was just revealed will NOT do her any favors. I knew she had sunk low, but I didn't realize she was this low...  Do you hope Hillary loses in 2016?"},{"comment_id":"10153134788679411","commenter_b":"Punk assed bitch!","commenter_a":"Blah! Blah! Blah!","post_message":""}]
