[{"comment_id":"10153981518484749","commenter_b":"These drivers are trespassing on private property. The property owner is 100% within her rights to report each trespasser to the police and have their cars towed.","commenter_a":"why not have it towed? make a deal with a local tow company and get a commission off each car towed from your driveway","post_message":"\"Happy digging, at least it's not raining.\""},{"comment_id":"10153115245746162","commenter_b":"What a pig!","commenter_a":"Unbelievable!!!!!!!!","post_message":"30-year-old Matthew Warner is charged with sexually abusing and killing his 19-day-old daughter.  How he almost got away with it @webpagelink"},{"comment_id":"1003105503069410","commenter_b":"Taryn ignore her, she will forever think she is right about everything even though she's not","commenter_a":"Or we could just let every woman decide for herself.. If you don't agree with abortion, just don't get one. But that doesn't mean other people should be forced into the way you think..","post_message":"Not a bad thought - Let us know if you agree!"},{"comment_id":"1184087691636663","commenter_b":"Donald Trump doesn't smoke, drink or do drugs. One of biggest problems in USA. Golden Crescent (@webpagelink) Build that Wall....Fence Act of 2006...Ask yourself the ???? Make America Great Again! Corruption!!!! Stop Trump!!!!","commenter_a":"Well Done Donald.","post_message":"Thank you Republican National Committee."},{"comment_id":"10153067204246636","commenter_b":"Is she ? So sex with her is ok?","commenter_a":"Slaughter of the baby is hardly justice for the rape. Two wrongs don't make a right.","post_message":"He claimed there are always 'two victims' in an abortion"},{"comment_id":"1124537887639264","commenter_b":"It is a shame that one of the frontrunners for the Presidency is directly responsible for spreading the fears and bigotry that lead to this nonsense. Islamaphobia is going to ruin this country from within..","commenter_a":"And so it begins again The seeds of hate, distrust and ignorance have sprouted","post_message":"She never could have expected this. Not in America..."},{"comment_id":"10153228975447452","commenter_b":"*facepalm* ... She is an idiot. She should have respected their religion.","commenter_a":"Charge the lady for assault","post_message":"Attacked as they prayed?  A group of Muslim men say a worshiper was hit in the face and doused with coffee in a confrontation with an irate woman in a NorCal park. abc7.la/1Qgwbam  “You are very deceived by Satan,” the woman yells as the wild scene is caught on camera. Should she face criminal charges? Why she’s not backing down, in her own words."}]
