[{"comment_id":"861173230647951","commenter_b":"She is crazy","commenter_a":"Just 12 years? WTF","post_message":"8-year-old Julie died the same day she was going to be a flower girl at a wedding. Her mom has admitted to killing her daughter."},{"comment_id":"10154423071206336","commenter_b":"Was she deserves to do is pull her name off the ballot and put yourself in Sing Sing for 25 years","commenter_a":"I wouldn't want it anyway. It would not be sincere.","post_message":"Question Of The Day: Does Hillary Clinton owe the American people an apology for lying about her server scandal? #Hannity"},{"comment_id":"706978382784196","commenter_b":"MAKE AMERICA AMERICA AGAIN!!!!!!","commenter_a":"Come on Bill, let us hear the speakers, please.....","post_message":"Duck Dynasty on A&E's Willie Robertson, former Texas Governor Rick Perry, retired U.S. Navy SEAL Marcus Luttrell, actor Scott Baio and Patricia Smith, mother of Benghazi victim Sean Smith, speak at the Republican National Convention."},{"comment_id":"1295164193914868","commenter_b":"Then her skin is too thin. I'm sure she's seen and heard much worse. Does she know what Muslims do to women?! And she wants them here sooooo bad.","commenter_a":"She is selling her soul to the devil. She can push the likes of Clinton on us. You can't be gone soon enough!","post_message":"First Lady Michelle Obama says the revelations about Donald J. Trump's treatment of women have “shaken me to my core.”"},{"comment_id":"1066102216758740","commenter_b":"DON\"T choose Hillary!! Jump aboard the TRUMP TRAIN 2016! He will work for America!!!","commenter_a":"Why should we choose Hillary ???? Bill didn't he choose every other women BUT Hillary","post_message":"\"She's a natural leader, she's a good organizer, and she's the best darn change-maker I ever met in my entire life.\"  President Bill Clinton said Hillary Clinton is \"worth every single year she's put into making people's lives better.\""},{"comment_id":"10153728493184203","commenter_b":"No average, healthy adult woman should really be under 100 pounds!!","commenter_a":"What is their definition of fat?","post_message":"Body-shaming."},{"comment_id":"478833062241288","commenter_b":"We all know O-ass is reallllly stupid","commenter_a":"Obama'smass army of Murders.","post_message":"Here's what the NYPD Commissioner thinks of President Obama's plan to reduce overcrowding in federal prisons."}]
