[{"comment_id":"10155784573999657","commenter_b":"Does this woman ever smile?","commenter_a":"Has she and all other politicians done this already or are planning to follow what she wants?? If not why should Mr Trump do something no other politician has ever done!! Can't hold him to a standard that no one else is following or has ever followed!!!","post_message":"Ethics and Intellectual Consistency."},{"comment_id":"10156920810200354","commenter_b":"Hey Cat, I have a dog that likes cats. She break their necks and use them as a dumnbwitted limp cat as skinny playboy. Maybe I could introduce y'all. Then you and Hillary will have a lot in common except for her long awaited prison cell....Gordon, most elections was closed primaries, which means Donald couldn't continue to empty the democratic party list of intelligent members which was leaving them with the African-Americans voters and dumb and moronic white voter in that party. Anyone who could vote for Hillary must not be capable of reading or hearing...or just hate America","commenter_a":"I'm very proud of my state of Arizona. On to the White House!","post_message":"#Election2016"},{"comment_id":"1072715589511885","commenter_b":"I would call him much worse than a monkey.","commenter_a":"That's insulting to monkeys the world over!!! Ann PLEASE think before bad mouthing the monkeys...","post_message":"VIDEO: Ann Coulter Just Created A HUGE Firestorm, Outrage after Calling Obama A  On National TV Ann Coulter is under attack over this.  Can we get 5,000 'LIKES' for Ann Coulter?  @webpagelink"},{"comment_id":"10154528974934062","commenter_b":"I want to meet Bruce Jenner aka caitlyn","commenter_a":"Don't care","post_message":"Jenner is apparently in town filming her new television show, \"I am Cait.\""},{"comment_id":"1760785597541885","commenter_b":"Yes I believe","commenter_a":"Yes","post_message":"VIA : God Is Love"},{"comment_id":"1002700983109302","commenter_b":"Someone should ducktape her mouth","commenter_a":"Somehow, that doesn't look \"allegedly\".","post_message":"Woman facing animal cruelty charges after allegedly duct taping her dog’s mouth shut, then posting photos on Facebook: @webpagelink"},{"comment_id":"10154136218409384","commenter_b":"She's just the best, go home to your expensive home and shut up...","commenter_a":"Everyone should see the damage that democrat loal gov't can do.","post_message":"It was my privilege to call to order House Democrats' hearing on the Flint Water Crisis. In an American city, thousands and thousands of children have been drinking and bathing in poisonous water for more than a year. It was not an unavoidable natural disaster. It is a man-made catastrophe. Now, thousands of children are at risk of lifelong damage from lead exposure – unless we help get them the care, attention and resources they need. We have a responsibility to help the people of Flint tell their story – and to be sure that story is heard loud and clear in the halls of Congress. The story of Flint challenges the conscience of America. It holds lessons and warnings for communities across the country."}]
