[{"comment_id":"10154125640609071","commenter_b":"Success is subjective. I'm fairly certain her and her family would be happier if neither of them worked so hard at their music careers.","commenter_a":"Why would you put front and center a couple that hates police officers and deals drugs? great role models you morons.","post_message":"“You have the same number of hours in the day as Beyoncé.”"},{"comment_id":"924923120897717","commenter_b":"That is what the Supreme Court is for! To keep the Executive branch from VIOLATING THE HOLY MONKEY SNOT out of the Constitution. This administration is shameless and arrogant to the EXTREME!","commenter_a":"Yes","post_message":"A Federal Court upheld a block on Obama's executive amnesty. Do you support their ruling? -- COMMENT with YES or NO"},{"comment_id":"10153622542063188","commenter_b":"No","commenter_a":"Get serious","post_message":"Would you sign it?"},{"comment_id":"431964536928587","commenter_b":"Sluts should be treated like people. So that's fine if you treat a slut \"like a slut\" as long as you consider them people and treat them accordingly","commenter_a":"I don't understand the negative stigma behind girls being sluts. God Damnit, Men love sluts.","post_message":"Regardless of what a person wears, they are worthy of your respect."},{"comment_id":"1135446926503853","commenter_b":"And own the chef world John peck !! You're gonna kill it !!","commenter_a":"So those aren't His arms ?","post_message":"BEAUTIFUL: Former Marine sergeant John Peck lost his legs and arms when he stepped on a homemade bomb in Afghanistan.  Thanks to a double arm transplant, Peck says the best thing about having arms again is that he can hold his fiancee's hand and become a chef.  PHOTO: Brigham and Women's Hospital MORE: @webpagelink"},{"comment_id":"910100355702699","commenter_b":"She should have gotten the death penalty!!!","commenter_a":"Hey like they say, you get what you sew!","post_message":"Convicted killer Jodi Arias will now spend the rest of her life behind bars. Watch Travis Alexander's sisters beg the judge for a maximum sentence: @webpagelink"},{"comment_id":"10153377125868984","commenter_b":"This administration doesn't WANT to bring people together. They constantly pit people against each other with inflammatory, insulting rhetoric - while involving themselves with the worst of the worst (like Al Sharpton). The entire world is up in flames and it's getting worse and not better.","commenter_a":"She's just pathetic.","post_message":"Michelle Obama just issued a message to black America about what white people do to \"folks like you and me.\"  This woman needs to be exposed for what she is telling our youth... spread this everywhere so Americans know who's REALLY trying to divide the country."}]
