[{"comment_id":"10153884127193854","commenter_b":"I do not now abut you ..but me ? I am jew ...","commenter_a":"One day Michael Moore you're going to get what's coming to you youre a evil lowlife person and disgusting and Stephen Colbert had you on his show last night I wouldn't watch that democratic hypocrite of a show","post_message":""},{"comment_id":"585591074975467","commenter_b":"He must be some form of illegal alien. Where do orange people come from?","commenter_a":"Prepare for 4 years of unrelenting mocking until you take this job seriously and treat people with respect","post_message":"Trump is such a crybaby..."},{"comment_id":"10154627500178812","commenter_b":"Wow. Ugly duckling. This is the type of woman who supports men who want to take all your rights away, ladies. Feast on that.","commenter_a":"Shut up ABC, ones a Princess, the others a ugly duckling!! One upholds her beliefs, the other goes with the flow!! Referring to # 1 for the first gal, # 2 for the second picture.. ABSOLUTELY NO COMPARISON!! ABC, this would be called gender racism!!! Un Cool!!","post_message":"When you look at how much Chelsea Clinton and Ivanka Trump have in common, their friendship isn't so unbelievable."},{"comment_id":"888341521222544","commenter_b":"She sounds worse than the other guy Holder.","commenter_a":"Another dumbass handpicked","post_message":"Add your name HERE: @webpagelink"},{"comment_id":"10153511062521336","commenter_b":"None of them, should be able to Vote, till they Pay American Taxes for at least 10 years, then They would Understand, how We all feel, about having to Pay for their being here!","commenter_a":"Here is a photo and article - Are our elections being unfairly skewed through legal and illegal immigration ? @webpagelink","post_message":"Show us in one photo what you think needs to change in America and your photo could be featured in the first Republican presidential debate. Submit it here: @webpagelink  Don’t miss the Fox News-Facebook debate live from Cleveland August 6th on Fox News Channel!"},{"comment_id":"652378504952728","commenter_b":"If I were near and could get it down, I'd burn it!","commenter_a":"take it down and rub bacaon on it and wipe your ass then brun the fucking thig","post_message":"A family in Texas has drawn controversy over this flag...  The ISIS flag should never been hung in America and should be considered a traitorous act.  'LIKE' if this is WRONG!"},{"comment_id":"1854247478194959","commenter_b":"Why you do this to me","commenter_a":"@username try not to cry","post_message":"Walnut the whippet was not alone on his final walk 🐶😢 #walkwithwalnut (via BBC England)"}]
