[{"comment_id":"10154680917183352","commenter_b":"What these women would really look like without the weave an fake eyes an their natural color so much plastic they can make Tupper ware","commenter_a":"Are you removing that photo method man asked you to remove?","post_message":"BREAKING: T.I.’s Wife Tiny Reportedly Caught on Video Fighting and Beating Her Husband’s Alleged Mistress! ---> @webpagelink"},{"comment_id":"679238678931090","commenter_b":"I have been drinking Pepsi since 1966! I will NEVER BUY IT AGAIN, not because of what she said , but because TRUMP HAS SAID FROM THE BEGINNING , This country has sold out to foreign countries that hate us AND PEPSI HAS THIS WOMAN IN CHARGE OF AN AMERICAN COMPANY!!","commenter_a":"When will they ever learn.. Boycotts work..","post_message":"INSTANT JUSTICE... Let's get 5,000 SHARES for TRUMP!"},{"comment_id":"10153289049898256","commenter_b":"See? You sound like someone who is over 40.","commenter_a":"Stefan, stop being a dinosaur.","post_message":"And now an important message from Chicago Confidential columnist Melissa Harris:   Please stop putting two spaces between sentences. It makes you look like a dinosaur.  What say you: One space or two?"},{"comment_id":"614399705409669","commenter_b":"@username NO ONE IS AS CORRUPT AS SLICK WILLY & SLICK HILLY!","commenter_a":"If Trump has done anything he has brought attention to the corruption in government!! Old man Bush cannot stand that Baby Jeb was soiling his diaper on the debate stage....it's all about $$$$ & the fact that the Clintons charged $250,000 for their fundraiser the other night should make hard working taxpayers sick!","post_message":"Kathleen Kennedy Townsend says former Republican President George H.W. Bush told her he's voting for Hillary Clinton."},{"comment_id":"10152762726845779","commenter_b":"Crystal","commenter_a":"Ash Cooper","post_message":"Nirvana's 'Unplugged' concert is often presented as the band's final show, but they actually played another month of American dates after that MTV taping and then headed over to Europe the following February. The band's last concert ever took place on March 1st, 1994 in Munich, Germany, at Terminal Einz, an airplane hanger that fit 3,050 people. Click through to listen to \"Heart Shaped Box,\" the encore from that show and the last song Kurt Cobain ever played in public."},{"comment_id":"533893623467884","commenter_b":"Lol. Fuck off bitch.","commenter_a":"He has the truth. God Blessbhim.","post_message":"Obama is furious after Ted Nuget takes an epic stand against him.  He speaks the truth. Nuget needs your support.  Can we get 10,000 'LIKES' for Ted Nugent's epic stand against Obama?"},{"comment_id":"1063081163723447","commenter_b":"Get em outta here!","commenter_a":"With all the hate in this country should the media be publicizing this to stir it up. Give those people a chance... They have had enough conflict.","post_message":"Eighty-two Syrian refugees have resettled in Ohio.   >>SEE what cities they have moved to: @webpagelink"}]
