[{"comment_id":"778104105644597","commenter_b":"CNN reported on this at its finest. Condemned those who stand as patriots while providing excuses for those who slaughter innocent people . Nothing but hypocrisy!","commenter_a":"Love this lady!","post_message":"Report: Man slain by police in Boston sought to behead Pamela Geller"},{"comment_id":"10153801731062144","commenter_b":"@username I know that every pedophile must have a defense attorney, but I don't want anyone that defended one as a president! I'd quit the freakin job, go hungry, and sleep in my car before I defend a pedophile! No real woman would do what she has done!","commenter_a":"How about talking about Hillary's ethics? Imagine your little girl was brutally raped and beaten, and you had to sit in a court room and listen to Hillary attack your child to get a rapist off. Would you vote for Hillary for president? Yes? Then you must be some kind of stupid. Go Bernie!","post_message":"Democrats just released a devastating ad against Donald Trump."},{"comment_id":"1131210870268774","commenter_b":"We don't care!!! So don't vote for her and fly off to your birdie page! HILLARY FOR PRESIDENT!","commenter_a":"I am a DEMOCRAT and Hillary does NOT have my vote in the Presidential Election. @webpagelink","post_message":"In 1990, American explorer and marine biologist Sylvia Earle became the first woman chief scientist at the National Oceanic and Atmospheric Administration (NOAA). For nearly six decades, she has led an international community of scientists in the study, protection, and restoration of our planet's marine life. Her unyielding curiosity and commitment to reversing the effects of climate change are a source of inspiration for environmentalists worldwide. Thank you, Sylvia."},{"comment_id":"10158335910850389","commenter_b":"California LARGEST INSANE ASYLUM IN THE WORLD Written by Chuck Garner on January 23, 2017 6:00 am - Interesting that the LA Times did this. Lou Dobbs reported this on CNN and it cost him his job. The only network we would see this on would be FOX. All the others are staying away from it. Whether you are a Democrat or Republican, this should be of great interest to you! Just One State be sure and read the last part try for 3 times. This is only one State If this doesn open your eyes, nothing will! From the L.A. Times. 1. 40% of all workers in LA County (10.2 million people) are working for cash; and not paying taxes. This is because they are predominantly illegal immigrants, working without a green card. (Donald Trump was right) 2. 95% of warrants for murder in Los Angeles are for illegal ...","commenter_a":"\"Alternative President Donald J. Trump\" you've been in the The White House only a week and already you're a total failure and made a complete fool of yourself so no wonder you LOST the popular vote and had such a SMALL crowd at your inauguration....by the way Mr. Alternative President you are delusional and need mental health treatment so please get some professional help before your words or actions are responsible for killing people....","post_message":""},{"comment_id":"10153770425869153","commenter_b":"You can't possibly be that stupid Christine ....","commenter_a":"just read where radical islamic muslims will come in with Syrian refugees so yes I agree with Trump","post_message":"What are your thoughts on Donald Trump's comments?"},{"comment_id":"1011692715642632","commenter_b":"My family has been here for 10 generations and I voted for. Hillary. So stfu you hateful witch.","commenter_a":"I had 4 grandparents all born in America. I did NOY vote Trump!","post_message":"Fact check!  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153171665732235","commenter_b":"LMAO!","commenter_a":"you know who else loves snow days? SATAN.","post_message":"Good grief."}]
