[{"comment_id":"1190105204361047","commenter_b":"Hang the bitch!","commenter_a":"Takes time to plan a coronation!!","post_message":"Hillary thinks she's already won. This kind of sick behavior is UNACCEPTABLE in a constitutional republic!"},{"comment_id":"10154008398892093","commenter_b":"an old woman did this on her apartment and end up with this, be careful guys","commenter_a":"Well my heater doesn't work right now guess I have to dress warm going to bed. Other than that I love this weather.","post_message":"How are you preparing for the first hard freeze of the season? bit.ly/2gAPzAa"},{"comment_id":"10155273538573797","commenter_b":"build a wall...then build another wall around the south side","commenter_a":"I blame the mayor. Its his fault this stuff happens","post_message":"A 74-year-old man has been charged with shooting another man Saturday night in the Park Manor neighborhood on the South Side."},{"comment_id":"10153264300638433","commenter_b":"Ladies, please, you're both pretty.","commenter_a":"Hillary would say: what difference does it make!!","post_message":"We look at what readers have to say about our fact-checks of Hillary Rodham Clinton. What do you think? @webpagelink"},{"comment_id":"914002385301524","commenter_b":"Fkn eh one less pig on the streets","commenter_a":"How many cops DON'T get caught doing the same thing?..","post_message":"He tried to frame an innocent man for a burglary that HE committed! When that didn't work out he killed himself.  From (Y) Counter Current News - MBD"},{"comment_id":"765874163568797","commenter_b":"Unfortunately, so true.","commenter_a":"How are you guys able to post, I thought the Obama phones were shut off already?","post_message":"We have nobody to blame but ourselves..."},{"comment_id":"520938298031470","commenter_b":"This woman isn't on benefits","commenter_a":"It does make you think!!! As I pay out per week for my sons bass guitar lesson, each Saturday for my daughter to spend the day at the stables....school trips etc. ....and still moan about having no money, whilst running two cars and paying for three seats at Bath rugby...plus drinks!! This has put my \"poverty\" into a proper perspective...and changed my opinion of ALL people on benefits being the same. Good luck to her and her family.","post_message":"Kathleen Kerridge’s family food budget is £40 per week – to feed five people. She says there is a big gap between the public perception of poverty and what it means for people like her. We should stop talking about poverty, she argues, until we know what being poor in this country really means."}]
