[{"comment_id":"1292836000742177","commenter_b":"Let her out permanently.She will be a bad influence to our children.","commenter_a":"Good!","post_message":""},{"comment_id":"1219006891496424","commenter_b":"They do not have a right to do so ILLEGALLY! God's Word says to obey the LAWS!!!! Read your Bible pope.","commenter_a":"In Syria , not here!","post_message":"Pope Francis said each refugee \"has a name, a face and a story, as well as an inalienable right to live in peace and to aspire to a better future\" for their children."},{"comment_id":"1227830950637889","commenter_b":"What a idiot, Mexico is NOT going to pay for any wall","commenter_a":"the worst. the absolute worst.","post_message":"With the inauguration only 15 days away, how are you feeling?  Here's what Donald J. Trump says he will do during his first 100 days in office: kiro.tv/TrumpsFirstDays"},{"comment_id":"10153813591902293","commenter_b":"Jealous women!","commenter_a":"Hmmm.....now what kind of people would call in and complain about a woman's bare shoulders......any guesses?","post_message":"The station received several e-mails during the broadcast complaining about her bare shoulders."},{"comment_id":"10155922190175725","commenter_b":"#FuckTrump","commenter_a":"Trump 2016!!!","post_message":"Watch my interview with Eric Bolling that aired today- @webpagelink"},{"comment_id":"10150836955014999","commenter_b":"there is nothing more damaging to black community than RACISM!","commenter_a":"There is nothing more damaging to the Black community that the BLM movement. By defining racism and things like \"cultural appropriation\" as the reasons for failure of African Americans to succeed fundamentally points to solutions in the wrong place. If tomorrow, every last vestige of racism were lifted in society, would Blacks suddenly be elevated? No. The cultural deficit of the Black community is the key. Lack of educational attainment, intact families, communities with massive violence, lack of role models all are the key reasons for failure. These problems may stem from historic racism but they are not solved by eliminating racism today. So, when the BLM movement focuses on racism they are actually focusing in on the wrong items. Lifting small racists issues without fixing the basic cultural failings will do nothing. In 10 years, we may have few elements of racism left and a black community with problems ...","post_message":"\" ‘You’re free,’ they keep telling us. But she would’ve been alive if she hadn’t acted so … free.' \""},{"comment_id":"993754734001845","commenter_b":"Yep she is the one who will carry on his legacy and bring in as many illegals and muslims for us to support until we no longer have a country to call out own while she and Billy relax in their luxury cabin located in some foreign land,, NO THIS bitch can not be allowed into any public office after this!","commenter_a":"I hope when they arrest her they freeze all her assets.","post_message":"“Hillary Clinton is my candidate for President of the United States. She is best positioned to continue the progress made by President Obama on a range of issues -- from strengthening our economy to making the right investments in our infrastructure to common-sense gun safety laws to ensuring a fair criminal justice system,” Transportation Secretary Anthony Foxx said."}]
