[{"comment_id":"10156430237125294","commenter_b":"Lol the military spread photos with weapons like we were suppose to","commenter_a":"As a photographer I wouldn't have taken this picture. A girl and her bow is a great idea. But not in a threatening manner like this.","post_message":"She has to give the school another photo. But, her mom is asking why someone else was allowed to do it in the past..."},{"comment_id":"10152694433051045","commenter_b":"twatwaffle.","commenter_a":"Melissa YES HE DOES! Can you imagine just how i said that, YES HE DOES!!!!","post_message":"Alabama Chief Justice Roy Moore sent a letter to probate judges Sunday evening ordering them to refuse to issue same-sex marriage licenses."},{"comment_id":"386189561505639","commenter_b":"Keep it open and all prisoners.","commenter_a":"Open","post_message":"Do you think Guantanamo Bay prison should be closed as promised or kept open?"},{"comment_id":"10153398198117377","commenter_b":"Trump will never win. A vote for trump is a vote for Hillary..","commenter_a":"why wasn't Priebus fired after Obama won re-election? It was unreal that Obama wins re-election and the RNC looks the other way. Priebus will be gone after Trump becomes President.","post_message":"Reince Priebus is an amateur and lightweight who has been a \"disaster\" as chairman of the Republican National Committee, says Christopher Ruddy, CEO of Newsmax. “We never would've been in the situation we're in today,” if the RNC had a strong leader Ruddy told Newsmax TV. Read the full story: @webpagelink"},{"comment_id":"10153640013936636","commenter_b":"O questo o un procione non voglio altro siamo io e te li vedi li vedi Dio pinolo?!","commenter_a":"Luca sparati in bocca con me","post_message":"Red pandas have an adorable wrestling competition  Via Detroit Zoo"},{"comment_id":"931527210240361","commenter_b":"and why do women wear make-up? Hmmmm . . . .","commenter_a":"What a gent.... NOT!!","post_message":"Look on the face of woman as Lewis Hamilton sprays champagne in her face says it all."},{"comment_id":"555636131271583","commenter_b":"I HOPE THE IDIOTS NAME LIST I HAVE SEEN DO! We Will cleanup AMERICA! BY THESE WEAKKNEED BITCHES LEAVING WE CAN HAVE A REVIVED NATION","commenter_a":"If only it were true. Jobs for everyone!","post_message":"28 percent of American voters said they would likely consider leaving the country if Donald Trump becomes president."}]
