[{"comment_id":"1672143779721068","commenter_b":"Holy cow. This woman is aging in dog years. In four years, she'll be a shrunken head.","commenter_a":"That's because only stupid woman will vote for her just because she's a woman.just like people voted for Obama just because he was black.","post_message":"A great defender of women's rights? You decide."},{"comment_id":"476505799211632","commenter_b":"What an Idiot... Just Deport this Idiot out of here NOW!!!!!","commenter_a":"\"Faith Derangement Disorder\" or FDD is a Liberal description of Christianity I became acquainted with during Obama's presidency. The honorable definition of holy matrimony and any public expression of Christianity was outlawed and was destroyed during Obama's presidency. The enemies of the western world and Christianity, worldwide, are emboldened and murdering Christianity. It is Obama's use of Liberal leadership in the US and his lack of leadership outside the US that is directly responsible for Trump and the Trump movement. No one else should be held responsible for the violence worthy, deep, fundamental, divide Obama has created.","post_message":"Tommy DiMassimo, the man who was tackled by Secret Service trying to rush the stage at a Trump rally, told CNN he did it because \"Donald J. Trump is a bully.\""},{"comment_id":"662046983985880","commenter_b":"She's not worth the used toilet paper in my toilet","commenter_a":"isnt she the wench thast triex to be a whore on every show, even the disney channel?? shes a meaningless tramp with no talent. her father is a meaningless douche with no talent. who cares whqat the slut thinks? shed vote for anyone who could give her a good orgasm","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'.  This is unacceptable, we stand against Miley 100%.  Do you agree Miley should be kicked out of the country?"},{"comment_id":"10155069293808010","commenter_b":"@username well since trump is saying illegals voted for Hilary!!! I'm being sarcastic you Troll!!","commenter_a":"Oh let me guess they were illegal immigrants 2","post_message":"He operated the scheme for two years from behind bars. He and an accomplice made more than $600,000."},{"comment_id":"10154186163347483","commenter_b":"Are there illegals enrolled at AU?","commenter_a":"They get lot more money from those students. It's about money","post_message":"A statement from the university said: \"Auburn is an international university. Students, faculty and staff from all backgrounds strengthen our campus, and we remain committed to fostering an environment that upholds our values of inclusion and diversity.\""},{"comment_id":"10153378846018037","commenter_b":"Exactly!","commenter_a":"KXAN - you love to get a good argument going, don't you?","post_message":"Did the grand jury make the right decision?"},{"comment_id":"363905233797771","commenter_b":"Stupid wench. I hope her show and all of her movies bomb.","commenter_a":"And the answer to your question, YES. Oprah is a racist....","post_message":"Is Oprah a race-baiter?"}]
