[{"comment_id":"1829686510610987","commenter_b":"Just go away Jill. You are as bad as Crooked Hillary. No one believes you.","commenter_a":"So Sad, wasting more taxpayers hard earned money. I hope Trump puts that piece of shit Hillary in jail. I'll never vote for a Democrat again.","post_message":"FUBAR!"},{"comment_id":"1165741570143303","commenter_b":"Why so serious... The whole world just needs to lighten up.. even if it's for 5 minutes.. colour is talked about so much it's actually part of the problem now.. just let it be...","commenter_a":"How the hell is this pic racist!!","post_message":"Opinion is divided ... (via BBC Trending)"},{"comment_id":"1111833728854862","commenter_b":"These women must be screwed up in the head! Why would you throw everything away for a sixteen year old BOY? They should have gotten their kink a little more reasonably.","commenter_a":"\"Endured\"","post_message":"The parents of a male teen student who endured a 9-hour threesome with a pair of blonde high school English teachers have sued the teachers as well as the deep-pocketed local school board."},{"comment_id":"10152837238297483","commenter_b":"If you don't like it stay away, you certainly won't be missed .","commenter_a":"That's the problem in Alabama this history of Republican leadership we need more liberals to vote","post_message":"Columnist John Archibald weighs in on how modern-day Alabama fits into the Bible Belt:  \"Alabama ignores that 'thou shalt not kill' commandment, posting the second highest murder rate in America in 2013, the last full year available. And blessed aren't its poor. According to the National Center for Children in Poverty, half Alabama's children are low income. Yet we still tax groceries.\""},{"comment_id":"10153095892296955","commenter_b":"How childish","commenter_a":"You gotta realize Nancy Pelosi, he's a better man than you'll ever be.","post_message":"White House warns Netanyahu not to reveal Iran details...   'Days when Jewish people remain passive in face of genocidal aggression are over'...   Broadcast Networks Refuse to Carry...   'Enraged' Pelosi freaks on floor...  Dems LASH OUT at Netanyahu, Tell Him to Go Home, Call Him 'a Child'..."},{"comment_id":"10155762960395354","commenter_b":"commands...???...commands what....","commenter_a":"Obama's greatest tool in his propaganda arsenal.","post_message":"Hollywood?   Check out what he told supporters...."},{"comment_id":"10153039031790329","commenter_b":"Kriti Kothari","commenter_a":"One for you Bella La Verde","post_message":"Find out which one of these redheads will light your fire."}]
