[{"comment_id":"10157552769965725","commenter_b":"IF YOU SAW HANNITY'S TOWNHALL WITH MR. TRUMP TONIGHT- NO PARENT WOULD VOTE FOR KILLARY!! #BUILDTHATWALL!","commenter_a":"I mean that's true, but what are you going to do about that? I guess grow a garden, but then you can only harvest every year, maybe twice a year if you plant early","post_message":"Thank you TEXAS!  We are going to declare our independence from failures of the past and create a New American Future.   Once again, we will have a government of, by, and for the people. Americanism, not globalism, will be our credo."},{"comment_id":"10154249032461178","commenter_b":"She should be gangraped!","commenter_a":"Is the reverse also true?? Are you fair game if you disagree with my views?? What an idiot!","post_message":"A rapper with a history of controversy says violence against women is OK as long as they disagree with her politics."},{"comment_id":"10153532801498984","commenter_b":"put her in jail and let some women make her their bitch","commenter_a":"JUSTICE FOR ALL?????!!!!!!!!!","post_message":"The extremely disturbing video of a young girl brutally attacking a schoolmate who was holding a small child went viral, now the attacker is facing some serious consequences...  Are you hoping justice is served?"},{"comment_id":"10154090778463822","commenter_b":"@username Ummmm So your a priest and admitting being a child molester? Sound like a real POS...Find someone of legal age","commenter_a":"Penn State fans must be proud to cheer for a POS coach that condoned child molestation and rape. \"We Are....Child Molesters\"","post_message":"As soon as Paterno’s familiar image – shirt and tie, thick glasses and rolled-up pants – appeared,fans erupted and kept cheering...  GAME RECAP: @webpagelink"},{"comment_id":"1510101482356438","commenter_b":"Lol that's not even close to what Asexual means.","commenter_a":"Asexual isn't real. Asexual means you reproduce without a partner. Use a different word cause that's not how this word is used in species. Asexual is like a bacteria. You are just without-sexual-wants.","post_message":"\"I fantasize about my future with my partner, achieving a certain level of success in our careers, getting out of debt. Oh, and cake. Don't forget about cake.\""},{"comment_id":"10154753364685225","commenter_b":"@username be quiet old hag","commenter_a":"This is what happens when you have real leadership in charge of the Country.","post_message":" is historic. The Dow Jones Industrial Average hits 20K for the first time. @webpagelink  #Dow20K"},{"comment_id":"1546155322346073","commenter_b":"A Butt Ugly Bitch!","commenter_a":"How sad he is But...wait pediphiles will be the next protected people","post_message":"This is the crux of the problem"}]
