[{"comment_id":"10154151244455579","commenter_b":"A fool and her money are soon parted.","commenter_a":"Just now donated $20 for Hillary Clinton and committed to caucus in my state hope you do the same right now:) I am voting for Hillary because I fell she is the best qualified person. Three Supreme Court Justices will mostly likely be appointed and I want a democrat to be the one to select the appointees. She can do it better than Bernie plus backwards and in High Heels. We have made such progress under President Obama I would like to see how much more we can continue to do and I trust her and honestly know she will be the best Person and successor to Barack Obama additionally she has devoted her \"entire life\" to bettering the lives of the American People.","post_message":"Hillary Clinton: \"We are going to fight for every vote in every state.\" Full video here: @webpagelink #CSPANfan"},{"comment_id":"10155201901781162","commenter_b":"Maybe the writers can be more select on how they word their headlines. Maybe they do this on purpose cause they get a kick out of reading the comments. You never know.","commenter_a":"Reading is key... trumps pic did employ an illegal, but upon finding out ended her employment and aided in getting her assistance in getting legal status ... this is why america is the way it is... read a title and jump to conclusions... most of the people protesting can't really hold a conversation about why there out there.. other than 1 line headlines they repeat over and over... it's sad","post_message":"President Trump's labor secretary pick, Andrew Puzder, admits that he and his wife employed an undocumented housekeeper for years...@webpagelink"},{"comment_id":"10154323426879778","commenter_b":"Sad!! Rip LP","commenter_a":"Prayers to the family.","post_message":"The 80-year-old may have been found dead, police said Monday."},{"comment_id":"10154241596456491","commenter_b":"Trump has made America great again for sure ! Free coke floating on our shores !!!","commenter_a":"Mom Neelo","post_message":"\"I’ve found marijuana, but never cocaine like this.\""},{"comment_id":"1361368557222876","commenter_b":"Toni, I never commented previously so I don't know what your delusion of reality is. Trump never banned all Muslims. My buddy Wayne Allen is very capable of comprehending what the fuck Trump said. He isn't an intellectually lacking derelict who has lost his way and found himself sucking Democratic titty. What Trump stated is that he would implement a vetting procedure to insure ISIS doesn't send men in with the hundred thousand other young refugees this piece of shit Democratic government is wanting to allow in. I fight for the people, brotha. Not the government. I protect this land we walk on from those who wish to impose radicalism here. Those people are our government. I am the mother fucker that will bleed on my home soil, for the real interest of our nation, not individual interests. As far as Native Americans suffering from our conquering; yeah, well, that's ...","commenter_a":"You people are the most ignorant people around. Your even more so then the Trump idiots. Leave these people alone. You should be more afraid of your neighbors. More Americans kill Americans then Muslims do. Watch the news.","post_message":"More than 20 people were stung by a swarm of bees outside a mosque in Phoenix, Arizona."},{"comment_id":"10153061707381051","commenter_b":"Stupid bitch needs her face slapped until she falls out..","commenter_a":"She is no mother, glad to see someone finally called the police on one of these child abusers rather then just posting it.","post_message":"Onlookers were genuinely shocked when they saw how this teen mom was treating her child."},{"comment_id":"835498176546436","commenter_b":"Deb... Your name Is tasty.","commenter_a":"Was he speaking to an empty chair? I can't think of anybody else who would or should listen.","post_message":"The director has spoken."}]
