[{"comment_id":"386115264910101","commenter_b":"She needs to die. She would never have gotten any place in this country without white people. I hate that racist trash.","commenter_a":"She sounds like she is mad at the world .","post_message":"Oprah plays the race card again..."},{"comment_id":"10153303444396051","commenter_b":"JFK worked for no salary.","commenter_a":"Wonderful! No salary or expensive vacations. That should lower the debt that Obama has racked up.","post_message":"Donald Trump plans on working for free if he's elected president. Do you like the move?"},{"comment_id":"1024212657594017","commenter_b":"Your Emperor said himself 22 times on record that he doesn't have the power to do this. Game over.","commenter_a":"@username, President Obama has only threatened Veto if the try to screw his Immigration E.O.s, which by the way are Constitutional, your party is still playing their very dangerous game of obstructing everything President Obama does. As for your erroneous statement about the First Family's Christmas vacation, I will enlighten you as to the fact that other than Secret Service detail, they paid their own vacation expenses. The taxpayers always pick up the tab for security and use of Air Force One for ALL Presidents while they were in office. Now you go research!","post_message":"Republicans have only been in control for a week and already they are picking an unnecessary political fight that risks shutting down the Department of Homeland Security and endangering our security. Republicans should stop playing games and pass a clean bill to fund the Department of Homeland Security because the pointless, political bill passed in the House today will not pass the Senate.   House Republicans voted to tear families apart and deport young people who came to this country as babies. Tearing families apart does nothing to secure our borders, fix our broken immigration system or strengthen our economy.   This is not a game and it is time for Republicans to take their responsibility to govern seriously, instead of playing to the most extreme voices in their party."},{"comment_id":"909813239056017","commenter_b":"And ya wonder why his kids are so messed up...duh. apple doesn't fall far from the tree.","commenter_a":"Who cares, ?","post_message":"\"I'm so happy after such a long struggle to be living my true self.\""},{"comment_id":"606850699417060","commenter_b":"What a pussy","commenter_a":"Remember these Libatards,I never forget !","post_message":"List Of 31 Democrats Who Will Be Giving Netanyahu The Middle Finger, SKIPPING His Speech ⋆ UFP NEWS... @webpagelink"},{"comment_id":"1027028344015468","commenter_b":"Then slapped it in the face with my dick","commenter_a":"But if it was an Airman that got jumped the Marines would be applauded.","post_message":"We're on the look out for two scum bags who jumped a Phantom Fury vet in a case of mistaken stolen valor. If you have any information, please message the page, and we'll take care of the rest. Any factual information provided, leading to an arrest, will earn you a free Funker530 \"Winning Hand\" T-Shirt. ~Josh"},{"comment_id":"786106801492916","commenter_b":"How in the world someone in the right mind, not see how how corrupt this woman is! She meeds to go back to school , she needs to learn what the meaning of \"C\" is. Not recalling 39 very important information, i think this Rat should be in jail. Go Trump, keep doing your thing, I'm sure you can destroy her nerves, and soon she will have a nervous breakdown. This is America, American decide our President, not immigration or the Latinos. I'm a Cuban American and very proud, of this country! Trump for America","commenter_a":"Its already been answered. Its because she is CROOKED!","post_message":"The polls are close so Crooked Hillary is getting out of bed and will campaign tomorrow. Why did she hammer 13 devices and acid-wash e-mails?"}]
