[{"comment_id":"1118673694809606","commenter_b":"yeah...chickens have lips and pigs can fly!!!!!","commenter_a":"not with him in office.","post_message":"Can Obama convince voters US moving in the right direction?"},{"comment_id":"1202982936435126","commenter_b":"I agree fuck him he got that light skin nigga syndrome straight bitch","commenter_a":"That's what he gets","post_message":"Thoughts? Is this fair punishment for the crime? #KevinGates #Jail #WSHH"},{"comment_id":"1238637239481907","commenter_b":"ugly ungrateful woman -","commenter_a":"He better say that. Else Lady Chewbacca would beat his ass.","post_message":"Michelle Obama just brought down the house with a passionate speech at the Democratic convention. It's safe to say President Obama was a fan of it:"},{"comment_id":"1756313234607564","commenter_b":"Hillary the Corrupt Witch Bitch !","commenter_a":"#NeverHillary!","post_message":"***UNPRECEDENTED CORRUPTION***"},{"comment_id":"10155984952470354","commenter_b":"Hanging around With To Many Illegale,s Will Do It !!!Dry Up His Brain !!!!!!!!","commenter_a":"Jerry brown is a twit. He's spent his life in CA and knows huge fires are part and parcel with living in CA.","post_message":"Two words: Moon. Beam."},{"comment_id":"559381210853585","commenter_b":"You only opt in because the choice is an illusion. Who reads the terms and conditions on anything online these days? Very few. I haven't thought of a solution re advertising, and the way things are going its only going to become more intrusive. The advent of neuromarketing is already upon us. The introduction of the 'reactions' facility on FB not excluded.","commenter_a":"I would try and read the enclosed article but the bombardment of ads, some obscuring the text, in the first 10 seconds put me off.","post_message":"Hint: it has nothing to do with preventing terrorism."},{"comment_id":"1239107352812458","commenter_b":"And you sir are an idiot","commenter_a":"There is a way to stop and fire Donald Trump is vote against him Donald Trump you are fired ========= Vote blue up and down the ticket==================== ==========hillaryclinton.com for more information, let's unite our voices and vote blue up and down the ticket. I'm an official member volunteer online for @username.","post_message":"Our planet's future depends on the decisions we make now."}]
