[{"comment_id":"10153416181512217","commenter_b":"if I had to go, this is how I'd do it","commenter_a":"@username this is like your entire sense of humour in one headline","post_message":"Father Stephen Crossan has taken extended leave from the priesthood."},{"comment_id":"10153797001880329","commenter_b":"This bitch you can order your kid what you want ...she's ignorant as hell I would have whooped her ass","commenter_a":"It was called marcy's diner in maine and this is what the owner posted. Threatening to get physical. She is a dumb cunt. And this is someone from maine.","post_message":"Neugebauer's diner has recently become the center of a massive controversy after she yelled at a screaming child."},{"comment_id":"10157544266265206","commenter_b":"Pervert","commenter_a":"Manzoor Hassan @username ye kon ha ?","post_message":"“My heart dropped into my stomach, and I was immediately hysterical,\" the woman said."},{"comment_id":"10153867280412377","commenter_b":"When illegals, dead people and multiple pollers etc, wait c and see how it goes, did the blm intimidate or black panthers block door or maybe machines were screwed up again Save your voting receipt just incase","commenter_a":"Donald Trump has 0% chance of winning the election. Gary Johnson 2016","post_message":"Pete Hoekstra to Newsmax TV: Trump reserved the right to reject. Watch coverage on @webpagelink"},{"comment_id":"10153686958951028","commenter_b":"Not her? This is total and a unpleasant BS!!!","commenter_a":"Joseph & Christine wowwww","post_message":"Former professional wrestler Chyna has died at age 46, her manager confirmed to NBC4. @webpagelink"},{"comment_id":"10152609113745950","commenter_b":"Those \"children\" walk around with ak-47's and would not hesitate to kill an American or any other national that isn't one of their own upon first sight. They are bred with hatred from birth. Sad to say they are already tainted. BOMB THEM ALL! What do you do when roaches run rampant in your house? You call an exterminator correct? Do you take the baby roaches into consideration simply because they're innocent? It's still a roach. BOMB THEM ALL!","commenter_a":"When we get a President with a backbone to go into these countries and bomb the hell out of them, we will continue with these problems....Clean house no matter if there are innocent people or not....Get the Job Done Now...","post_message":"According to a CIA insider, it would take 100,000 ground troops to effectively respond to ISIS."},{"comment_id":"975822185786810","commenter_b":"@username...I never have been a democrate I'm an independent. I chose the best man/woman for the job. And without the independent vote...hrc will lose. So...tell me again HRC is gonna be Prez, cuz it's not gonna happen without us and my fellow Bernicrates","commenter_a":"Yet you lose to Trump. All numbers say he will wipe the floor with you! BERNIE is the only one to Win against all GOP. Numbers show it. And he's winning national polls. I WILL NEVER CAST A VOTE FOR YOU...EVER","post_message":"Know someone in South Carolina who’s not sure who to vote for today? Share this."}]
