[{"comment_id":"10153592600809607","commenter_b":"@username Many Americans want the wall. Unless they are not here legal ofc....","commenter_a":"#Trump2016 Trumping along and Making America Safe and Great Again #VoteTrump and vote often #Winning #WinningTeam #2A #Gunrights #Love #GOD #Family #TrumpTrain #FreeMarket #Religion #Veterans #Freedoms #BillIOfRights #Constitution #Liberty #FencePaidByMexico #TruthHurts #FreeSpeech and #RealJobs for Americans with a sweep in all 5 states!","post_message":"\"As far as I'm concerned, it's over,\" said GOP front runner Donald Trump. \"I consider myself the presumptive nominee.\""},{"comment_id":"1082185285137594","commenter_b":"She dropped the dollar sign a long time ago. Its just Kesha now","commenter_a":"I'm telling you, all she has to do is use a different name. Use an S instead of a dollar sign or something. Prince did it in the early 90's when he figured out the labels were raping artists and wouldn't release him from his contract.","post_message":"The Bleachers and Fun. member is joining collaborator Taylor Swift and actually doing something to help. #FreeKesha"},{"comment_id":"579271598927799","commenter_b":"As a sentence. Send her dumb ass over there and pull her passport, then pull her citizenship and tell don't come back. PS. Take the view with you","commenter_a":"Do Barry proud, he'll probably pardon her.","post_message":"Mississippi woman who attempted to join ISIS pleads GET INSTANT JUSTICE from No-PC Judge"},{"comment_id":"10152857633614753","commenter_b":"why these people even walking the earth...round them up and send them to isis","commenter_a":"Assholes a","post_message":"These people need to be banned from America."},{"comment_id":"902172716496023","commenter_b":"I stand corrected. It is Planned parenthood that started with the concept to murder black babies before they were born.","commenter_a":"Aren't the Democrats responsible for the initial abortion idea and practice? Also, the plan was to abort unborn black babies. Who's the racist? Hint...DEMOCRATS!","post_message":"Pro-abortion Congresswoman and DNC Chairwoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb baby that's not born yet. Her response? No restrictions. Period.  Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"10153062550892235","commenter_b":"Those ...fools...do not represent This Christian!😱😱. 😞😢. 😠😡. 😈😈. 😇😇","commenter_a":"Any religion that tells you where your going after you die is a CON JOB. What happens if it's just nothing but darkness after you die. You'd live your entire life by someone else's way. I say FUCK THAT! live your own life, make your own choices! Have sex with whoever you want. There is no hell. Let the pleasures flow! THERE IS NO JESUS TO SEND YOU TO A PIT OF FIRE. Hello..... your being manipulated, lied to, bamboozled!","post_message":"Way to keep it classy, bigots.   Attack a bunch of kids singing the National Anthem ..."},{"comment_id":"10152722810447014","commenter_b":"Go back to your country, boy! \"We don't like yo kind around here!\" WHITE POWER!!! Lol","commenter_a":"Her come the racist white people...","post_message":"Do you agree with President Obama's executive action on immigration, which shields millions of undocumented immigrants from deportation?"}]
