[{"comment_id":"10154556187833089","commenter_b":"Be remember all of you the one who said refugees should be banned because one tree make million of million matchbox and matchbox born millions trees","commenter_a":"How sweet of him but he just had musks blown up!!!","post_message":"Trudeau says refugees are welcome in Canada"},{"comment_id":"844804189043491","commenter_b":"Bye bye bitch","commenter_a":"never did like the ugly bitch","post_message":"Liberal trash has no place on tv. This is the best news all year. Do you think Whoopi deserves to be kicked off the air?"},{"comment_id":"491174087737551","commenter_b":"Muslims offend me. Ban them from the U.S.","commenter_a":"BS!","post_message":"Muslims Want to Change Our Nation and Obama is letting them..."},{"comment_id":"10152564935772217","commenter_b":"pussy","commenter_a":"D man is a fool is dis how you catch a thief","post_message":"Brave or stupid? This passer-by tackled a robber who'd just raided a jewellery shop in London: @webpagelink"},{"comment_id":"906562849439968","commenter_b":"Can't wait for more racial division from this fraud. She's Holder with a dress on. Worst choice ever.","commenter_a":"Wonderful","post_message":"BREAKING"},{"comment_id":"593410574181627","commenter_b":"Ex hoe for first lady wtf","commenter_a":"I wish my middle class friends a I could afford to buy that, oh, I forgot, there is no middle class","post_message":"Melania Trump, the first-lady-to-be, wore a $4,000 Ralph Lauren silk crepe jumpsuit  made in Italy on election night. #Election2016"},{"comment_id":"10153703121996051","commenter_b":"If you are joking haha good one...if not well...Abusive bitch? Kids tested? Gwah lordy be. What a generation of pansies..","commenter_a":"There are ways to pin this abuse on this bitch. The father has to use some tactics to have the courts on his side. I would get the kids psychologically evaluated, have them testify in court in regards to the mother's abuse and a list of other stuff. I would make this bitch pay!","post_message":"A dad was looking through his son's iPad when he stumbled across this footage of the boy's mother."}]
