[{"comment_id":"10155049967862619","commenter_b":"Is that how they saying thank you to Israel for taking care of there refuges and is nobody can have Golan except Israel because were given to Chosen People God so Syria,Palestinian and all Muslim keep your hands away from Israel territories.Amen.","commenter_a":"BE STRONG GOD ALWAYS WITH YOU''","post_message":"Benjamin Netanyahu - בנימין נתניהו responds to Syria!  -VirtualJerusalem.com"},{"comment_id":"10153542533598352","commenter_b":"Wtf.....it's not like her f ing nipple is sowing or something.....how about telling the girl who come with the dress so short they can't bend down to pick up something.....how about telling the girl with their clothes so tight they can't breathe.....sweetheart enjoy your time screw them.....if they still messing with you just let hulk out and tare the place apart....well I would....I can't have fun no body having fun","commenter_a":"That's messed up they just trying to find things wrong","post_message":"Mother slams school officials who insisted her daughter's floor-length, long-sleeved prom dress was 'too revealing', claiming they 'targeted' her because she is 'plus-size'"},{"comment_id":"569916976504180","commenter_b":"@username, different country different faith but people still using the text to justify murdering gays. Was it the predominantly Muslim US States that passed the \"Gay panic defense?\" @webpagelink","commenter_a":"Good on you, Bruce. Christians warned us about Sharia law, and now they've imposed their version of it on us. Irony?","post_message":"\"Some things are more important than a rock show.\""},{"comment_id":"10153328775418128","commenter_b":"I thing that puts our 18 trillion in debt in perspective...","commenter_a":"No doubt that population and geographical size - density as a dependent variable of income per-capita help construct the value perspective.","post_message":"The most valuable U.S. states by land value: 1. California 2. Texas 3. New York"},{"comment_id":"1057065101012919","commenter_b":"Those camps are for the Ameriicans. The illegals are going to be slaves & the muslims will be living in your house.","commenter_a":"Not nearly enough room for all the democrats,liberals,communists ,illegals .ect....afterwe start to round them up.","post_message":"The 800 FEMA camps across the U.S. can only hold 16 million..."},{"comment_id":"10154356048051002","commenter_b":"Women cause cancer to men with there drama lmao. Jk","commenter_a":"What doesn't cause cancer these days???","post_message":"Like your daily hot dog or bacon sandwich? You may want to think again."},{"comment_id":"10158382623765093","commenter_b":"It would be illegal to play it. It is national Security. and Illegal.","commenter_a":"Flynn talking about sanctions people what more important a Russia helping to stop ISIS around the world and stop aggression or keep Obama sanctions on them and never accomplish anything .Only reason Obama put sanctions on them while leaving was to stop Trump from making deals with the to help stop ISIS","post_message":"\"It seems inconceivable that Flynn did not consider the likelihood, the virtual certainty, that he was calling a wiretapped line.\" -- Andrew C. McCarthy"}]
