[{"comment_id":"10154298505504411","commenter_b":"stfu goat lover","commenter_a":"Go police go, do not let bastards ruin the day!","post_message":"Police deployed tear gas to disperse some particularly hostile demonstrators"},{"comment_id":"847817905266758","commenter_b":"You people are a bunch of whack jobs!","commenter_a":"Any kind of animal","post_message":"AWFUL: A family who routinely fed a mother duck and her 11 ducklings said they watched in horror as a landscaper intentionally mowed them down:"},{"comment_id":"724107867720000","commenter_b":"send thim all home, they dont belong in the USA.","commenter_a":"you dont like our flag go home","post_message":""},{"comment_id":"1471521346221666","commenter_b":"@username I cannot in this day and age believe that someone as backwards uneducated,unread as you still exists. You know all that crap has been debunked yet you continue to stream it. I don't know if you are a troll or not but there is no brain matter in your skull.","commenter_a":"He is just a rich piece of trash. Money can buy you tons of stuff, but it cannot buy you decency, morals, health or happiness.","post_message":"It just keeps getting worse!"},{"comment_id":"10155794432670354","commenter_b":"she'll never get that stink off her!","commenter_a":"What was that idiot doing there anyway.","post_message":"What was she thinking?"},{"comment_id":"532019336988646","commenter_b":"I'm not catching that disease from her","commenter_a":"Fuck that bitch","post_message":"Michelle Obama thinks you should do this instead of going to church.  She is a disgrace. Get her out of the White House please.  Do you agree Michelle is an embarrassment?"},{"comment_id":"968496726540356","commenter_b":"That thinking, @username, is why so many illegals come here. They know if they have their 'anchor' baby here, they will get to stay because that baby needs parents to care for it. More illegals come, have their babies, and get to stay...it's an endless invasion!!!","commenter_a":"If you are born in the United States and not on foreign soil like an Embassy, then you are an American, but that doesn't mean your parents or the rest of your family are!","post_message":"A few of the candidates have come out against birthright citizenship so far.  Message your Rep and make your voice heard!"}]
