[{"comment_id":"10153148951881990","commenter_b":"We should be worried about radical christian terrorists over some fake conservative progpaganda!! She can't fight for a lick of her life. Send her and all the Trump Supporters to fight ISIS or read the Koran. Stop the hate and be united...","commenter_a":"When your at a park you just want to be at peace not here anyone's religious views STFU! By the way they were not praying they were volunteering as bike stands and the lady was giving and example of white trash that needs to be recycled...please find humor in the worst of situations...or just stay angry all the time and keep saying this country is going down the drain","post_message":"Park police are recommending misdemeanor battery charges against a woman caught on video making anti-Islamic slurs then throwing coffee and an umbrella at a group of Muslim men. The woman works for California Department of Corrections: @webpagelink"},{"comment_id":"10153105977467098","commenter_b":"YUP!! We always Been Here!! Who the Real Illegals!!","commenter_a":"Every race that is not latino or native american is an illegal inmigrant or descendant OF an illegal immigrant latinos ARE from this continent OF AMERICA... North central and south AMERICA ANYONE else their ancestors came on a boat across The Ocean and The atlantic ALL WE Did WAS cross an imaginary Line Lmao.... americans huh..... WATCH WHO u call a wet back we didnt have to cross The atlantic TO GET here wet backs","post_message":"Donald Trump would not say how he would locate, round up and deport the 11 million undocumented immigrants he says must go."},{"comment_id":"1369207093090488","commenter_b":"The woman is pure evil","commenter_a":"It's time for women to shine, it's Been over due. I'm so proud a women is going to be the next President of the United States 2016 for the 20th century","post_message":"LIVE: Democratic Presidential nominee Hillary Clinton speaks at Democratic National Convention."},{"comment_id":"10153560917566615","commenter_b":"Get off of here Martha","commenter_a":"Who cares he got away with rape.","post_message":"WELCOME TO STEELERS NATION, BABY BODIE!  The newest addition to the family of The Pittsburgh Steelers QB Ben Roethlisberger is right along side the rest of the City of Champions tonight, cheering on the Pittsburgh Penguins to a Game 7 win! LET'S GO PENS!  (Photos courtesy of Ben Roethlisberger - BigBen7.com)"},{"comment_id":"1009572635788547","commenter_b":"That's terrible!!! I worry about my children everyday at school!!!!","commenter_a":"Really. Bullying. Is wrong","post_message":"A sixth-grader died Tuesday after a bully stomped on his chest during a P.E. class at a Colton elementary school, the boy's parents told KTLA.  \"This kid did it on purpose,\" said Jose Gallegos, whose 12-year-old son Dominick died after losing consciousness on the field.   However, detectives who went to the hospital where Dominick was taken said there was no evidence of an assault or physical injury that would have caused his death. Investigators are waiting for a report from the coroner's office.   Read KTLA's story here: @webpagelink"},{"comment_id":"1280477518640408","commenter_b":"Who cares,he is nobody.","commenter_a":"Who can respect this so called intelligent person (jerk), wearing a batman tshirt making important statements? My 5 year old grandson loves to wear his batman tshirt to the play ground. Makes me think Cuban is doing this for publicity. Yep...his money success has gone to his head!","post_message":"He's rooting for..."},{"comment_id":"10153003040749091","commenter_b":"Thugs","commenter_a":"Soon will catch this people what a shame.","post_message":"HOME INVASION: Men break into South Bronx home, steal necklaces, PlayStation. Watch the surveillance video of the suspects.   FULL STORY: @webpagelink"}]
