[{"comment_id":"10155008790239214","commenter_b":"@username please educate me as to exactly how NM receipt of federal dollars will be affected by the senator's boycott of the inauguration.","commenter_a":"Please don't join that ship of fools boycotting the inauguration. New Mexico needs those federal dollars.","post_message":"The president-elect is taking to twitter this weekend to harass a civil rights icon and the Director of National Intelligence. I think we can all agree that is not how Donald Trump should be spending his time."},{"comment_id":"978112395570641","commenter_b":"Did all Muslims commit those crimes ?","commenter_a":"It's disrespectful not all Muslims are terrorist or bad people it's in terrible taste it's like me driving around with a plate that says fgirlscouts just cus one gave me the wrong cookies","post_message":"A personalized license plate in Minnesota which read \"FMUSLMS\" has received condemnation from many, including the governor. Read more about how and why it was issued: @webpagelink"},{"comment_id":"599536596905185","commenter_b":"I want them to be deported and go back where they came from.","commenter_a":"I am absolutely shocked that a welfare state would attract welfare-minded reprobates who expect to receive cradle-to-grave welfare benefits, and then throw violent temper tantrums when they don't get what they think they're entitled to! Where in the world did these guys get such an idea? Oh yeah, after hearing the Marxist's constant demands for cradle-to-grave welfare benefits all of their lives.","post_message":"New post (Sweden: Muslim migrants enraged over not being given \"own house\") has been published on Jihad Watch"},{"comment_id":"10153696766386159","commenter_b":"Blue laws are state laws or local laws that regulate in state commerce and are not the purview of the Federal Government. Few states have Blue Laws any more. In our state, only alcohol (package sales) are banned and that decision is made locally - not by the state. We have dry counties and dry townships. That decision is made by local residents.","commenter_a":"Freedom OF religion is also freedom FROM religion.","post_message":" United States of America did not create religious liberty. Religious liberty created the United States of America."},{"comment_id":"1638130873118424","commenter_b":"@username we have to save American lives and that means keeping Hillary Clinton out of our WH!!!","commenter_a":"Desperate - can't stop the \"Trump Train\"! It's way too late - you GOP establishment idiots are the ones who are making it possible for the democrats to get 4 more years to continue to destroy this country! Just because Mr Trump doesn't lean to the \"far\" right, doesn't mean he's not a Republican! I don't lean to the \"far\" right, but I am a Republican! It's time for some real middle of the road compromising - more real and true policies will get passed and the stagnant economy, security, and the best welfare of Americans will come to fruition! Won't buy national review ever again - especially since they have nuts like beck involved!","post_message":"As it's starting to look more like Donald Trump will be the Republican nominee, some in the conservative movement are viciously attacking the NYC businessman. Trump supporters are going to be furious when they see the cover of this magazine...  Will this attack influence who you support for president?"},{"comment_id":"1157925847657525","commenter_b":"she should be charged with fraud.","commenter_a":"God please let this happen....she is evil as Hellary","post_message":"ClashDaily.com"},{"comment_id":"10153031859929024","commenter_b":"Maybe you should jump in front of one of the bullets too lmao","commenter_a":"let them kill each other off","post_message":"Lionel Pickens, 31, was shot multiple times in the chest around 4 a.m. Sunday at Queens Boulevard and 84th Drive in Briarwood, police said."}]
