[{"comment_id":"982915058434909","commenter_b":"wake up ladies they use you","commenter_a":"Oh please. Look at him and look at her. Enough said.","post_message":"'I thought he was The One'"},{"comment_id":"903045683051621","commenter_b":"She embarrassed us once on national TV!!! We good!!","commenter_a":"Ya own kind hate'n why can't we stick together","post_message":"Guess Who Wants To Replace Kelly Osbourne On “Fashion Police”"},{"comment_id":"873492039433845","commenter_b":"make all the illegals-legal so thats 10 million persons paying taxes. we could sell the republicans to the dog eating festival. thats say 100 dollars.","commenter_a":"cool give them texas. that would be hilarious!!!!!!","post_message":""},{"comment_id":"10154114787935329","commenter_b":"LOL Chad.... Mom I'd be so mad!!!","commenter_a":"Chad Stacy Mike Deb don't buy these for the girls!!","post_message":"\"Her butt-length hair is now chin length. I was lucky to save that much.\""},{"comment_id":"1089862507690725","commenter_b":"NO!!! Girls are NOT Intelligent enough, Athletic enough, Independent enough, Mechanically minded enough, Wood Working enough, Outdoors enough, Tough enough, Strong enough, Brave enough, Work Hard enough AND are Too clean, Too emotional, Too femine, Too Goofy PLUS don't like Spiders, Roaches, Vermin , nor Bats. Need any other reasons?? Let's stop being so PC and keep the girls where they belong, in the House, Kitchen, Laundry Room, barefoot, definitely barefoot and making babies. That's GOD'S will!!! If you don't agree, we can just have the BOYS join the GIRLY Scouts. BTW, I'm a LIBERAL, oSCUMa, Kerry and HITLERy lover!!! Can't you tell.","commenter_a":"No-they have girl scouts.","post_message":"Should girls be allowed to join the Boy Scouts?"},{"comment_id":"10153474188676350","commenter_b":"But they can't make babies it takes a man and a woman to have s baby","commenter_a":"So wrong","post_message":"#BREAKING: Supreme Court makes same-sex marriage legal nationwide in landmark decision."},{"comment_id":"10152933046001051","commenter_b":"Lady get it straight..stay home Granny! No, i'm not following you...Really!!!","commenter_a":"I sure hope not","post_message":"Here is Hillary Clinton's first campaign video. Simple question: Will she be the next President of the United States?"}]
