[{"comment_id":"877374009072027","commenter_b":"What they should do is put them to work while they are on welfare and lowering government al expenses! A few hours here and there will save a bundle! Stop giving them a free handout and not allowing them to contribute to society! Eventually, get them a regular job and get them off welfare!","commenter_a":"Yes! To all of them!","post_message":"Do you support drug testing for welfare recipients?"},{"comment_id":"934086226709659","commenter_b":"Put more women in your cabinet!","commenter_a":"I AM MY SISTERS VOICE VOTE DEM :::::::::::REVELATION 21 = THE TWO ARE ONE = TWO TRUMP AND WALKERIGHT ONLYESATANACYES <DID 911 SATANACYESEENTHREE THE FATHER THE SON THE HOLYESPIRIT <<< THEY DID IT NY INDYESHUALLHEARTRUTHEART:::::KY DC = DOVESON CHRIST < TRUE IN THE FLEASH CAME ON THE 3RDAYESON ROCKING < THE TRUTH USABLE <++++}:::::::::::::::::::::::::::::::>ART<:::::::::::::::::::::::::::::::{+++>:<>","post_message":"Born five years before most women could vote in America, Shirley has lived through the Great Depression, two world wars, the Civil Rights Movement, and the moon landing. Today, she’s rooting for something she never thought she’d live to see: the first woman president of the United States."},{"comment_id":"963407697102775","commenter_b":"she wont get elected,,,she will be placed! Voter Fraud accomplishes much! Thats why she is not worried about winning","commenter_a":"If she does get elected, invest in body-bag manufacturers....guaranteed 1000% return on investment assuming you don't get killed by her goons.","post_message":""},{"comment_id":"1704858546467924","commenter_b":"Ha-Ha! She is starting to look like James Earl Jones. Too bad she's a dumbass.","commenter_a":"Black Mrs Potato Head. yikes.","post_message":"Whoopi Goldberg is just plain GROSS...   I hope this means the end of The View!"},{"comment_id":"10154097655775736","commenter_b":"Threatening our non violent non threatening neighbors with war just because why not! Grounds for immediate impeachment!","commenter_a":"And there's no bad hombres up here?","post_message":"\"You have a bunch of bad hombres down there,\" Trump told Mexican President Enrique Pena Nieto, according to the excerpt seen by the Associated Press. \"You aren't doing enough to stop them. I think your military is scared. Our military isn't, so I just might send them down to take care of it.\""},{"comment_id":"10153865845208984","commenter_b":"TRUMP IS A LIAR! TRUMP IS A RACIST! TRUMP IS A BULLY!","commenter_a":"If you watched the last debate Carson was nervous stuttered his responses I just don't think he's hard enough","post_message":"'The Donald' just ripped into his Republican rivals today and revealed the one big reason why he doesn't think Dr. Ben Carson could do the job. Some might agree that he makes a valid point...  Do you think Trump could be right about Carson?"},{"comment_id":"1037567749698799","commenter_b":"Facebook is trying to silence him tonite","commenter_a":"Completely cut off","post_message":"Watch Live: Donald J. Trump holds a rally in Sterling Heights, Michigan."}]
