[{"comment_id":"10153036362074411","commenter_b":"I wasn't looking at the women.","commenter_a":"I've been to the Middle East and the people there are so beautiful. Their eyes mesmerize me.","post_message":"The corporal punishment will be carried out for 20 weeks after Friday prayers outside the mosque in Jeddah. That is the place famous for executions carried out in and it has got a nickname \"Chop Chop Square\""},{"comment_id":"10154444576164586","commenter_b":"I would still eat the ishhhh out of that piggy","commenter_a":"What do they expect it's part of an animal! Keep showing these disturbing photos until it makes a real difference","post_message":"This is so gross, it's no wonder so many bacon-lovers are vowing to ditch it."},{"comment_id":"10152747594996051","commenter_b":"@username smart lady","commenter_a":"All this complaining about someone suggesting that one be responsible when getting our tax money. This is crap something needs to be done but then again the bleeding heart unimformed idiots will start crying. Look around and show me the starving people just look at the size u don't get that size while starving.","post_message":"People getting food stamps in this state need to get ready for some big changes."},{"comment_id":"10154060101734087","commenter_b":"Hillary for Prison, if you vote for her you are worse then trash","commenter_a":"Suck on it Donald!!!","post_message":"Trump had choice words for a GOP senator who will not be voting for him."},{"comment_id":"10153148951881990","commenter_b":"We should be worried about radical christian terrorists over some fake conservative progpaganda!! She can't fight for a lick of her life. Send her and all the Trump Supporters to fight ISIS or read the Koran. Stop the hate and be united...","commenter_a":"When your at a park you just want to be at peace not here anyone's religious views STFU! By the way they were not praying they were volunteering as bike stands and the lady was giving and example of white trash that needs to be recycled...please find humor in the worst of situations...or just stay angry all the time and keep saying this country is going down the drain","post_message":"Park police are recommending misdemeanor battery charges against a woman caught on video making anti-Islamic slurs then throwing coffee and an umbrella at a group of Muslim men. The woman works for California Department of Corrections: @webpagelink"},{"comment_id":"10154568418189062","commenter_b":"Your right...Then she may get out and have more kids","commenter_a":"You kill your kids and get 6 years.. Serve 2 maybe 3 and then go on with your life.. Sad","post_message":"JUST IN: Barbara Russo has pleaded guilty in the drowning deaths of her 14-month-old twin daughters. The mother entered pleas of guilty to two counts of criminally negligent homicide. She was sentenced to six years in prison. More: @webpagelink"},{"comment_id":"10153263146396833","commenter_b":"She dont need a gun anyway, Shes got a face that would stop a train !","commenter_a":"Start living in the real world, hoodlums are not giving up their guns. Wake up and smell the roses gabby","post_message":"On March 4, gun control proponent Gabby Giffords joined Democrat lawmakers on Capitol Hill to push for expanded background checks on all gun sales.  Anti-gun Representative Mike Thompson (D-CA), who supports banning commonly owned semi-automatic firearms owned by millions of American, is spearheading the push."}]
