[{"comment_id":"536832686498611","commenter_b":"Some of bernies supporters have been crazy lately","commenter_a":"Hillary Clinton MAY HAVE BEEN a liberal at one point. She no longer is. She is a bought subsidiary of large business. If Sanders isn't nominated I'm staying home. She won't get my vote. Edit: I also will never forget the racism and division of Hillary supporters who made the entire DNC kiss their ass to mend fences. It's not \"her turn\" and if I had my way she would never ever see the White House.","post_message":"Let's not do the GOP's bidding."},{"comment_id":"574693549357266","commenter_b":"Whores don't have souls, so yeah...","commenter_a":"so legalise drugs, legalise prostituion, are we just going to start legalising everything?","post_message":"\"Being a sex worker isn't about lack of choice. If I really had no choice, I'd be working in a garment factory.\""},{"comment_id":"968873019828099","commenter_b":"Some dumb uuuugly woman","commenter_a":"Who is Kim Kardashian and why must I look at this?","post_message":"#KimKardashian felt #liberated, Bette Midler didn't!"},{"comment_id":"854169234726517","commenter_b":"How about rapist?","commenter_a":"If trump is despicable, what does that make Hillary ?","post_message":"\"He’s just despicable,\" Letterman said, adding that Donald J. Trump may very well prove the saying that \"anyone can grow up to be president.\""},{"comment_id":"910810348978714","commenter_b":"Showing her big fat backside...","commenter_a":"Why is it always about Kim Kardasian? And by the way, can somebody tell what she's famous for?","post_message":"Kim Kardashian leaves no curve unseen  (Vis Daily Mail Celebrity)"},{"comment_id":"10153696766386159","commenter_b":"Blue laws are state laws or local laws that regulate in state commerce and are not the purview of the Federal Government. Few states have Blue Laws any more. In our state, only alcohol (package sales) are banned and that decision is made locally - not by the state. We have dry counties and dry townships. That decision is made by local residents.","commenter_a":"Freedom OF religion is also freedom FROM religion.","post_message":" United States of America did not create religious liberty. Religious liberty created the United States of America."},{"comment_id":"1008491449210603","commenter_b":"@username You are scum simple as that!","commenter_a":"she was a drug taking piece of trash...","post_message":"Bobby Brown: 'Bobbi Kristina Brown was and is an angel'"}]
