[{"comment_id":"10153162470033908","commenter_b":"get outta here","commenter_a":"1 & 6 Katarina Koncarevic","post_message":"Here are 8 things you can do to potatoes you probably didn't know:"},{"comment_id":"10153353712173984","commenter_b":"Ugly BASTARD.","commenter_a":"Wow Al really got hammered but Al doesn't care he's laughing all the way to the bank.","post_message":"Wow! One of the top conservatives on the internet just lowered the boom on Sharpton in a big way. Many people were thinking it, but only one had the guts to say it..."},{"comment_id":"10153114659021336","commenter_b":"i just hope she is prosecuted for her crimes, and they let her know she is NOT above the law....she is a disgrace.","commenter_a":"Right on schedule.","post_message":"Let us know your thoughts on Rep. Trey Gowdy asking that Hillary Clinton agree to a transcribed interview over her deleted records and tune in to 'Special Report with Bret Baier' at 6p ET."},{"comment_id":"10153222485020329","commenter_b":"George Bush","commenter_a":"How come the penis got a fun name but not the vagina???? You're all Sexist Pistols.","post_message":"Urethra Franklin FTW. (A BuzzFeed BFF original.)"},{"comment_id":"10154180124161770","commenter_b":"She is an evil witch who got away with murder.","commenter_a":"Poor baby dog","post_message":"The entire nation thought Casey Anthony murdered her daughter..."},{"comment_id":"1768830776662660","commenter_b":"Lock Her UP!","commenter_a":"Obama is starting civil unrest with the black lives matter movement in Milwaukee, Wisconsin. The black social movement killed one white man and more than hundreds were injured at the crazy riot yesterday.","post_message":"Live now: Governor Mike Pence holds a town hall in Albuquerque, New Mexico."},{"comment_id":"10153689413136336","commenter_b":"Because 1471717696187557gallathat is not how God works in a church. If the pastor is wrong God will deal with him, it's not her place to do that. @username we don't know if he spoke to her privately & just because he rebuked her behavior doesn't mean it wasn't in love or that he doesn't love her. She may truly have been disrupting the services. God rebuked the behavior of many in the bible. The bible also says that God disciplines those he loves. No pastor is going to be able to preach in a way that makes everyone happy & making people happy isn't part of his job. He's supposed to preach the truth of God's word without compromise. His delivery can change, but the truth cannot.","commenter_a":"What kind of pastor throws out a 103 year old woman? Not even non-Christians would do this to an elderly woman. Madness. They hate her for believing the same doctrine that she learned at that church every Sunday for a century. The bible charges Christians to take care of the elderly and the widowed.","post_message":"Genora Biggs said that she and the current pastor, Rev. Tim Mattox, have long sparred over his form of preaching, which she characterizes as a \"Holiness style\" that doesn't belong in the Baptist church."}]
