[{"comment_id":"861219497357519","commenter_b":"Natalie, that is wrong. His opinion absolutely matters. Knock it off. Francisco, if you want to discuss this rationally, you'll have to like my comments so I know you've replied, no notification on a public post for me. Don't worry about the trolls. If you wish to have an objective conversation, I'm game.","commenter_a":"Chanting that you are going to make America great again is pathetic it's not the leader that makes America great it's the people that's why the revolution war was fought this country will always be a country of immigrants from all over the and we are who make America great not a \"leader\" in search for power claiming that he will make America great","post_message":"MAKE AMERICA GREAT AGAIN!"},{"comment_id":"640840709429112","commenter_b":"QUIT RAPING AMERICA ..........WHY ARE YOU NOT IN PRISON. .........WHY","commenter_a":"oooh, I bet they are shaking in their boots","post_message":"BREAKING NEWS: Obama fires back at Russia..."},{"comment_id":"923822694380650","commenter_b":"@username, Hillary is not a good choice for president. I'll take Bernie Sanders!","commenter_a":"How pathetic is this woman??? EVERYTHING she does has an ULTERIOR motive....EVERY word is calculated......she is not genuine in the least bit.....","post_message":"Hillary Clinton will soon meet this history-making couple."},{"comment_id":"1740824406204671","commenter_b":"Leave our country! We all will be keeping our guns!","commenter_a":"The question is why hasnt congress done their job and impeached him?","post_message":"Caught him..."},{"comment_id":"1641280749470830","commenter_b":"At the end when she started really going after him is when I would have had her on the ground and I would break her fucking arm and left her there to rot","commenter_a":"Knives are becoming a serious problem. Yet another unintended consequence of terrorism.","post_message":"This VIDEO is absolutely nuts.  “I’m going to cut you. And I’m going to get away with it. Now if you say one more word, it’s going to end very badly. Do you understand?”"},{"comment_id":"1260437270671484","commenter_b":"come on something good has to happen, we had a failed bomb in a car earlier","commenter_a":"El mi nomas cesar godinez ok pinches lacras puro blu cabrones","post_message":"BREAKING: Police pursuit in Palmdale, CA (Viewer Discretion Advised)"},{"comment_id":"10153061445106167","commenter_b":"Kirsten Miller - ironic that you have a rainbow avatar while desperately trying to appease muslim terrorists. now go put on your burka and be quiet.","commenter_a":"Oh so now it's America's fault a Muslim shot and killed our members of our military. And liberals are once again showing there true colors. Anyone who buys this garbage is the problem.","post_message":"Why does the media ignore how violence is now a part of American culture?"}]
