[{"comment_id":"1114415161915837","commenter_b":"Sweet! Kill all the muslims too!","commenter_a":"Two wrongs do not make it right.","post_message":"#Canada #EndTimeHeadlines #Quebec"},{"comment_id":"10153990107026955","commenter_b":"See you at Blade Show bitch!","commenter_a":"The rights to a free press, free speech, assembly, and religion are extremely important but none of them matters very much if you can’t defend your own life against aggression. Leave your hands off my guns!","post_message":"BREAKING: Active shooter at Lackland Air Force Base in Texas, at least 2 dead"},{"comment_id":"10154237264628908","commenter_b":"Safe from all the predators but not from mosquitos.","commenter_a":"I like the idea of being up off the ground. I wonder if you could feel the bear or tigers fur under your back? The option of over the water is very appealing when it comes to lions, tigers, and bears oh my! Army Ant territory too. I think I would feel safer over a calm river, not up too high, but out of reach of most animals, than on the bank. Also, I imagine up in the air, not as much heat is extracted from your body as when you are on the ground.","post_message":"These tents suspend from trees! Get the experience of a hammock and a tent all in one. Thanks Tentsile!"},{"comment_id":"10152996747985950","commenter_b":"look at the KKK what a bunch of ugly losers... lmao...","commenter_a":"Good","post_message":"More rallies have been planned..."},{"comment_id":"10155201901781162","commenter_b":"Maybe the writers can be more select on how they word their headlines. Maybe they do this on purpose cause they get a kick out of reading the comments. You never know.","commenter_a":"Reading is key... trumps pic did employ an illegal, but upon finding out ended her employment and aided in getting her assistance in getting legal status ... this is why america is the way it is... read a title and jump to conclusions... most of the people protesting can't really hold a conversation about why there out there.. other than 1 line headlines they repeat over and over... it's sad","post_message":"President Trump's labor secretary pick, Andrew Puzder, admits that he and his wife employed an undocumented housekeeper for years...@webpagelink"},{"comment_id":"10153475535382894","commenter_b":"She is the epitome of dumb!","commenter_a":"Kids are getting arrested for sexting, why is this not considered pornography and why isn't she being arrested.","post_message":"Kim Kardashian Pens Essay on Empowerment After Nude Selfie Backlash: ‘I Will Not Live My Life Dictated by the Issues You Have With My Sexuality’"},{"comment_id":"895114997196955","commenter_b":"Your mother is a rat","commenter_a":"for press tv and iran the houthi rebels who tried to overthrow the govt are not terrorists. Instead the forces fighting houthi rats are terrorists. and iran claims to be a democracy. wtf","post_message":"Saudi warplanes airdrop weapons to militants in #Yemen  Read more: @webpagelink"}]
