[{"comment_id":"10154100013603598","commenter_b":"I have no more words to write about this witch","commenter_a":"Add murdering human life to the list of HER immorality!","post_message":"Hillary Clinton: An Unborn Child Just Hours Before Delivery Has No Constitutional Rights"},{"comment_id":"391857781002516","commenter_b":"Animals! That's why they're in prison!","commenter_a":"They would live there no matter what the conditions are! They destroyed it now let them lay in it!","post_message":"The corrections officers could only watch as the thousands of inmates broke the heating, cooling, and ventilation systems, and forcefully shook the gates in the prison lawn..."},{"comment_id":"10153778518101051","commenter_b":"Whore. Really? Are you 14?","commenter_a":"Not defending her but why was the affair discovered two months AFTER she filed for divorce? Thats a little creepy on the ex husband's part.","post_message":"This man suspected his bride was up to something, so he hired a private investigator to check it out. His suspicions were ultimately confirmed and his wife was arrested shortly after."},{"comment_id":"10153209058106509","commenter_b":"Oooh looks like you are a dumb chick trapped inside human body. Go get an operation...free yourself ha!","commenter_a":"All the people who think he was a girl trapped in a boy's body are sick and have missed basic biology lessons. For that punk - rot in hell.","post_message":"Crossing out \"Josh,\" the 17-year-old signed \"Leelah\" in a suicide note.  @webpagelink"},{"comment_id":"10153041187141037","commenter_b":"Which one Rebecca?","commenter_a":"Life begins when that egg is fertilized life begins when that baby Not a fetus has a heart beat life begins when that baby can survive outside the body. This isn't religion this is real talk","post_message":"In an embarrassing setback, House #Republicans abruptly decided to drop planned debate of a bill criminalizing virtually all late-term #abortions after objections from GOP women and other lawmakers left them short of votes."},{"comment_id":"486861261504454","commenter_b":"She wouldn't make a pimple on the queens ass","commenter_a":"YES","post_message":"The Jordanian Queen just put Michelle Obama to shame.  Good. Our first lady is classless. In no way does she represent our country.  Would the Jordanian Queen make a better First Lady?"},{"comment_id":"1005304559506884","commenter_b":"@username wow dude! go tell that to china, india, russia...they pollute the air you breathe in an astronomically higher number , last i checked, the earth only has one atmosphere.","commenter_a":"God be with you and your team as you go forward for our great state of Kentucky.","post_message":"\"They bribe us with our own money to stick it to ourselves. And we will not do that anymore in the state of Kentucky.\""}]
