[{"comment_id":"10153511062521336","commenter_b":"None of them, should be able to Vote, till they Pay American Taxes for at least 10 years, then They would Understand, how We all feel, about having to Pay for their being here!","commenter_a":"Here is a photo and article - Are our elections being unfairly skewed through legal and illegal immigration ? @webpagelink","post_message":"Show us in one photo what you think needs to change in America and your photo could be featured in the first Republican presidential debate. Submit it here: @webpagelink  Don’t miss the Fox News-Facebook debate live from Cleveland August 6th on Fox News Channel!"},{"comment_id":"1084090904983990","commenter_b":"TheresaStephens I don't know how you can say that. The police might have something on him and if they have he should be charged and locked up for life. And all the tax payers money your going on about let Cliff Richard pay for it if he's guilty, let the police seize all he's wealth and money and all go in police funds. If he is guilty he's nothing else but a dirty old C@@@ I don't care about he's Christian lifestyle if he is guilty he should go away. After all Theresa God hates sexual immortality","commenter_a":"Oh for goodness sake leave the man alone. I'm not a fan but, your innocent till proven guilty. So far they haven't proven a thing. I am sure there are plenty of unturned stones in the police force that need investigating?!","post_message":"Just in...."},{"comment_id":"899517350083687","commenter_b":"GOD BLESS AMERICA ! We really need His Help !!","commenter_a":"Screw the Muslims and the Camels they rode in on!!!","post_message":"Pathetic! (MUST READ)"},{"comment_id":"10155169022694411","commenter_b":"I think the Mexicans are just being drawn back to their ancestral lands annexed into parts of the US. God gave the poor Mexicans more land but the Devil took some of it. Now the population is over flowing into another country. Build the wall on the pre annexed land boundary and the problem will be solved...","commenter_a":"That wall devided a nation. This wall divides two seperate nations. Fuck outta here","post_message":"'We Berliners know best how much suffering a division of an entire continent, cemented by barbed wire and wall, has caused'"},{"comment_id":"10152629894111519","commenter_b":"It is my business when you try to regulate contraception based on a book of myths, try to keep kids from learning factual science based off a book of myths, and try to keep people from marrying there loved ones based on a book of myths. Keep religion but don't ask for tax's breaks, don't try to teach kids pseudo science and don't knock on my door asking me to believe. A free country is where people can get elected even if they don't believe, a free country is where any two consenting adults can marry, and women can choose what they do with their bodies. This is not a perfect union, yet but well keep pushing forward while you try to stop rational thinking.","commenter_a":"Turning people against their own beliefs in an attempt to get them to believe yours. This is what you accuse religions of doing. Hypocrite much?","post_message":"Bill Maher makes a compelling case for secularism..."},{"comment_id":"10152800082481051","commenter_b":"Should have killed the scumbag the first time !!!","commenter_a":"It was a domestic violence crime, that should have kept him behind bars. You figure out why.","post_message":"This guy was released after admitting to stabbing a woman to death in front of her children. Guess what he did one month later."},{"comment_id":"10153387072137869","commenter_b":"Agree, illegal must not be here in American Soil to live and receive any government aide at the first place.Gosh, our Social Security money and taxes we are paying will be given to these illegal people who enter here in our country. BTW, before you No Brain people forget, we have more American Citizens who are diasable, and have low income but working who needs help from our government and now, who gets more benefits, these illegal. Enough is enough.","commenter_a":"STOP THE REFUGEE PLAN! Obama you are shameful sir, putting Americans in harms way! At least France understands what we are up against! You are not a King! We need to cleanup DC and his cartel and vote them all out 2016. Implement term limits and background checks to stop the corrupt career politicians. We want leaders who will enforce our CONSTITUTION the SUPREME law of the land. Enough is enough! Vote Donald trump 2016","post_message":""}]
