[{"comment_id":"10154312935051337","commenter_b":"All i can say is wow! I mean since Bran can use his powers to enter into a body does that mean he will eventually enter into the white walkers body an control him by pushing out what was put in now that would be awesome.","commenter_a":"That was by far the saddest moment of this show! Rip hodor/direwolf.","post_message":"OH. MY. GOD. Craziest Game of Thrones yet?"},{"comment_id":"1143835818981314","commenter_b":"I love the books. I have them all except the 3rd one.","commenter_a":"Tell them to send to the literacy centers ,people will buy them from the literacy centers to keep them running or they can build a literacy in the U.K. for the people there.","post_message":"A charity bookshop in Wales is begging people to stop donating \"Fifty Shades of Grey\" after becoming overwhelmed with hundreds of copies of E.L James' steamy novel."},{"comment_id":"10153789938206680","commenter_b":"yes there is, put her in jail.","commenter_a":"Former \"Bush\" defense official??? Go figure!","post_message":"The United States' adversaries, James Clad says, \"must never hear flippancy or ignorance in America’s voice.\""},{"comment_id":"10154978304691037","commenter_b":"How many more horny female teachers will yahoo report?","commenter_a":"Another ungrateful millennial.","post_message":"The 29-year-old will serve two years behind bars."},{"comment_id":"10153684804441336","commenter_b":"LGBT does not need to be taught in schools and if you read the Bible the lifestyle is an abomination to God.","commenter_a":"Those who are investigating him should be the ones being investigated. Teach our kids gay sex, Islam and the coach can't say a prayer? Freaking idiots.","post_message":"Bremerton High School assistant football coach Joe Kennedy, a 20-year U.S. Marine Corps veteran, said he has never asked students to join him in prayer; they do so voluntarily."},{"comment_id":"1025607307502400","commenter_b":"@username do you not understand what rape is? Many women are unintentionally impregnated by a RAPIST. Involuntarily having sex is what rape is, if you didn't catch that. A women's should be able to choose if she wants to have an abortion, with advanced technology we can safely perform these procedures. Abortion is NOT A contraceptive, it is a last resort and if you wanna take the baby and provide for it along with the thousands of other rape victim babies then go ahead.","commenter_a":"Look I'm not all for abortion, nor all against it, let me just say my peace like everyone else has, and that we are all entitled to.. A females choice about her body, is exactly that, her choice. I'm not saying abortion ahould be used for a form of BC or a contraception, there are other ways, educate your children, its not just the girls in this that need it. All children need to be educated. But lets get surreal, how or what do u know about that female walking in to planned parenthood, little to nothing about her story. How do u know she didn't get raped, or isn't going thru some kind of abuse (whether it be physical or emotional) u don't know. We cannot judge people, who gives another that right, and all I have to say is those doing the judging I hope to hell u ...","post_message":"Hillary's Hypocrisy is Astounding www.eaglerising.com"},{"comment_id":"10153620766011337","commenter_b":"I would only wish there were black only sororities, but no, whites are free to join and pollute the heritage","commenter_a":"So I'm just asking. On campus at Grambling University pretty sure there are ALL BLACK sorority houses. Why no uproar over that ?;","post_message":"RACIALLY INSENSITIVE? This Alabama sorority video had to be deleted after a diversity backlash.  Watch it and judge for yourself..."}]
