[{"comment_id":"10152920261777014","commenter_b":"White people belong in Arizona, unlawful criminals do not.","commenter_a":"Sheriff Joe is TRYING to do the job he was elected to do. The Feds do not like it !!!!","post_message":"YAY or NAY: Do you approve of the job that Sheriff Joe is doing?"},{"comment_id":"631371687022892","commenter_b":"What a chump","commenter_a":"Doesn't it make you wonder what Trump is holding over these guys?? I'm so dang curious but it will be years before it seeps out.","post_message":"\"After months of careful consideration, of prayer and searching my own conscience, I have decided that on Election Day, I will vote for the Republican nominee, Donald J. Trump.\""},{"comment_id":"1078041262207343","commenter_b":"Fire her now!","commenter_a":"Mandamus?","post_message":"She took an oath. And the oath didn't say: \"I will uphold the parts of the Constitution that I agree with and ignore the rest\""},{"comment_id":"1066102216758740","commenter_b":"DON\"T choose Hillary!! Jump aboard the TRUMP TRAIN 2016! He will work for America!!!","commenter_a":"Why should we choose Hillary ???? Bill didn't he choose every other women BUT Hillary","post_message":"\"She's a natural leader, she's a good organizer, and she's the best darn change-maker I ever met in my entire life.\"  President Bill Clinton said Hillary Clinton is \"worth every single year she's put into making people's lives better.\""},{"comment_id":"1658721937683357","commenter_b":"It is a machine for women. Google it.","commenter_a":"Who's Sibian?","post_message":"This may be  to a beach near you!  @webpagelink"},{"comment_id":"10158588409000354","commenter_b":"Doesn't help that he no longer has any \"insider info\" from the State Department, does it ????????? Schmuck","commenter_a":"Geez, whudda thunk it.","post_message":"You can't make this stuff up.   #ClintonCash"},{"comment_id":"288699034881182","commenter_b":"Now, have you been able to fill these jobs with non immigrants?","commenter_a":"What were they expecting to happen...","post_message":"From Oklahoma to New York, bosses fired groups of workers after they didn't show up at their jobs in order to protest at last week's \"Day Without Immigrants\" demonstrations."}]
