[{"comment_id":"10152847429722623","commenter_b":"Yeah because throwing fish chunks attracts puppies","commenter_a":"Jessica Kennedy South","post_message":"Check out this photo:"},{"comment_id":"10158563017270354","commenter_b":"She is too good for you a hole","commenter_a":"All of you hypocrites who are protesting and rioting over Trumps's decision that was very similar to Obama's that you didn't even bat an eye for, is the reason Trump will be here for 8 years.","post_message":"Grammy Award-winning rapper Eminem called President Donald Trump a \"bitch\" and fantasied about sexually assaulting conservative author Ann Coulter in a new song."},{"comment_id":"10153326702079877","commenter_b":"It doesn't make no sense for a woman to get sloppy drunk","commenter_a":"I just don't understand","post_message":"Man finds wife naked in bed with her father...then gets stabbed after an altercation. Read more of the details below.   Grio fam, we can't imagine. What would you do?"},{"comment_id":"10157491368855389","commenter_b":"Now she needs to seperate from our government. A few years in the slammer or off to Syria where she'll be treated like every other woman.","commenter_a":"Don't care for your relationship with the Hil, but good for you on your separation from the Weiner. Anyone deserves better than that scumbag.","post_message":""},{"comment_id":"10154682154393984","commenter_b":"She's the whore of Babylon","commenter_a":"Let me tell you all her dx.......she needs Jesus Christ!!! Maybe she is possessed by a demon, highly likely......! God has allowed her to come to ruin because she wont turn from her wicked ways.....for those who do not like my comment.....read your bible, you will find out lots a things God allowed to turn people away from sin!!!","post_message":"There's been lots of speculation about what might be ailing Hillary Clinton, if anything. One dental expert took a look inside Hillary's mouth... and almost instantly, he said he knew the condition that's been causing all of her health problems.  Could this expert be right?"},{"comment_id":"635677536633830","commenter_b":"Demons","commenter_a":"@username read the top comment 😂😂😂","post_message":"Name it!  #WSHH"},{"comment_id":"863410587096986","commenter_b":"90% London is full of foreigners, loud mouth rude boys and junkies.","commenter_a":"But london will not make exception for trump","post_message":"London's new mayor will be an \"exception\" to his proposed ban on Muslims."}]
