[{"comment_id":"863625973741296","commenter_b":"Absolutely. ...praying for him and his family","commenter_a":"Allready did","post_message":"Kentucky Police Officer Shot Down In Cold Blood, Killer Still On The Loose The media is silent, no Al Sharpton, no Obama, nothing. Will you pray for him and his family?"},{"comment_id":"10153762472156337","commenter_b":"Id smash her tuppence!!!","commenter_a":"Whatev","post_message":"HOW MUCH???"},{"comment_id":"1143755872353195","commenter_b":"If you don't like rules there move back to Kuwait!","commenter_a":"OLD POST, YOU GUYS.","post_message":"Muslim Welfare Diva Refuses To Take Off Headscarf Gets BRUTAL Message From Judge (VIDEO)  BOOM! This judge smacks her silly! Can we get 1K Likes for this awesome JUDGE!"},{"comment_id":"10154075647091770","commenter_b":"You are totally right, Tucker.","commenter_a":"We turned to Hollywood to be entertained...NOT FOR POLITICAL COMMENTARY OR OP-ED! It really is that simple.","post_message":"Tucker Carlson has a message for Hollywood liberals"},{"comment_id":"481313708745082","commenter_b":"nimby. they do not want to see oil rigs, how ever it is okay to strip mind in my back yard to get sand to build the roads to their beachfront homes. what a bunch of hypicrites.","commenter_a":"Thank you @username for your support for our coast !!","post_message":"With all the updates today, I wanted to make sure that you caught this earlier post with my statement on the Administration’s decision to protect the Atlantic from offshore drilling...so I’m sharing it again."},{"comment_id":"10156017725535405","commenter_b":"Btw, Bob, Walker has never had a surplus. He borrowed $3 billion in a series of loans, threw it in the bank and called it a \"surplus\" withput taking into account the 30 debt payments on his loans. Links to the official records are here, mostly oin the footnotes: @webpagelink","commenter_a":"Scott's ok in my book. He reduced my property tax by about $500. Better than tax and spend Doyle who raised every tax and fee he could, typical tax and spend democrat. Scott let's clean house, enough with the time for a change, it's definitely time for a change.","post_message":"Governor Walker was on \"The Kelly File\" last night, highlighting his plan to challenge big-government special interests at the national level and put the hardworking people of America back in charge."},{"comment_id":"10153767217919497","commenter_b":"Let's really make a team effort to versnitchinize the fizemignots.","commenter_a":"Area intern tells employer \"I'm more into first person shooters, than platforming\" is fired on the spot","post_message":"The buzzword has yet to be expounded on or put in context by anyone at the company."}]
