[{"comment_id":"10155938644580354","commenter_b":"OF COURSE NOT! Did anyone actually think these weasels with their blood money in their pockets would do anyting to regulate Planned Parenthood? LOLOLOLOL Fell off the dumb truck, did ya?","commenter_a":"Go back to work useless bastards","post_message":"GOP consultants who hate the grassroots--and their values--continually boast about the historic majority they won in the House, purely by their own DC insider wisdom.  But if these are the best results we can get from that majority, what have they actually accomplished?"},{"comment_id":"10153404466085950","commenter_b":"Go Trump!!! Scared?? Everyone's voting for him!!!! I'm scared of Hillary lying Clinton!!!! Speak for yourself sweetheart","commenter_a":"I'm hoping that if he's the Republican candidate, people will be scared to vote Republican and will therefore vote Democrat.","post_message":"BREAKING: Donald J. Trump will win the South Carolina Republican primary, CBS News projects @webpagelink"},{"comment_id":"10152776744107217","commenter_b":"Vicki Wray better start thinking of other names 😂😂😂😂","commenter_a":"Beautiful names xxx","post_message":"#RoyalBaby: Introducing Charlotte Elizabeth Diana - she'll also be known as HRH Princess Charlotte of Cambridge"},{"comment_id":"10153238029913822","commenter_b":"You guys sound like some broke ass jealous bitches!","commenter_a":"How tacky of a wedding pic","post_message":"Personal chefs, fancy cars, an expensive pool & more… at 35,000 square feet, it’s described as the biggest house in Pa.  And now it's the focal point of allegations made in a massive federal tax fraud investigation: @webpagelink"},{"comment_id":"923311821095206","commenter_b":"Mexicans never botherd me. Keep'em! Deport Trump!!-","commenter_a":"Not a good idea!!! Go Trump","post_message":"Excellent idea! Share if you support this.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1254290281276196","commenter_b":"He prefers giving the jobs to refugees and Muslims what a POS","commenter_a":"What is he on Obama didn't do anything to create jobs","post_message":"Yesterday, news swept the nation about the amazing feat President-elect Donald Trump was able to accomplish before even taking office. Trump, along with Vice President-elect Mike Pence, forged a deal with Carrier, keeping 1,000 jobs in the US. However, not everyone is taking the news quite so well, and none other than the current president and his administration had a sickening response.  @webpagelink"},{"comment_id":"10152919389451491","commenter_b":"I always knew that America needed more violent rape on TV.","commenter_a":"Patrick","post_message":"Game of Thrones is famous for its tragic weddings, but last night the show pushed that into even darker territory."}]
