[{"comment_id":"10154172496221717","commenter_b":"Indiana needs to leave the transgenders alone!!!","commenter_a":"They refused to hear the bill and it's officially dead.","post_message":"Freedom Indiana warns that the the proposed legislation \"could be used to target transgender individuals for discrimination and harassment.”"},{"comment_id":"10152921328085950","commenter_b":"Wow, Janet Fix, your comment just proves how uninformed you are. Or are you just trying to be obnoxious?","commenter_a":"lol If its Michelle Obama I'm asking for two fives.","post_message":"Move over, Alexander Hamilton... A woman is about to replace you on the $10 bill."},{"comment_id":"580176688837290","commenter_b":"Invite a Muslim man into your home and let him do what he would do in his home country. Do you have any idea what he would do to your mother? How about sister, assuming you have one? Go on, have fun. And don't you dare do any harm or call the cops because he would be following the Quran.","commenter_a":"Those who think this is funny, should be ashamed of yourselves. How would you feel if that happened to you. In America we treat each other equally (treating others the way we want to be treated. Think about that) no matter what religion we have.","post_message":"INSTANT JUSTICE..."},{"comment_id":"10154501984339087","commenter_b":"@username So they get deported five or six times then come back and kill innocent people. Did you know that most of them send money back across the border to help their families come here.","commenter_a":"Trump cost himself the popular vote. He already said he is keeping Obama's amnesty in place. So if he's blaming the illegals why would he keep them here? He is such a lying fool and his supporters suck it up.","post_message":"\"He said 3-5 million 'illegals' voted so that's why he lost popular vote,\" one Democratic aide said about President Trump's comments at the meeting."},{"comment_id":"10153982553531955","commenter_b":"Fire her!","commenter_a":"Where is this? Chicago..oh yeah..that crime riddled LIBERAL MESS..that place where there are 100's of black on black murders each week..that place where black lives matter the LEAST...that place where this ignorant fool of a so called teacher is. SAD AND IGNORANT.","post_message":"Public School Teacher Preaches \"Fuck The Police\""},{"comment_id":"10153263722107411","commenter_b":"Hold my dick!!","commenter_a":"Yea , meanwhile the murder capital award goes tooo","post_message":"THIS JUST IN: Mayor Rahm Emanuel is expected to introduce an ordinance that will raise the minimum age to purchase tobacco products from 18 to 21."},{"comment_id":"10154392573271491","commenter_b":"It's only a temporary ban, you guys make it seem like it's a ban forever and second why is it that USA always has to help the world, we have our own problems to take care of... Maybe once things are clear here and we are able to eradicate a huge chunk of terrorism, because it's honestly never gonna go away completely, then the ban can be lifted... What does it matter where the terrorist attacks that were here came from, people just want to open the borders like its nothing, let's spend some of that money here for once and help American citizens instead of foreigners for once or for now at least...","commenter_a":"She fails to understand we are trying to make sure those same radical Islamists, like the same ones who tried to kill her, stay out of our country. I'm saddened to see a survivor of radical Islamic terrorism can't sympathize with the U.S. trying to prevent terrorists from sneaking in as refugees!","post_message":"Malala Yousafzai: \"I am heartbroken that today President Trump is closing the door on children, mothers and fathers fleeing violence and war.\""}]
