[{"comment_id":"1304805006248280","commenter_b":"That's what he wants beware","commenter_a":"They try to do anything they can to make his life more miserable-how petty!!!!!","post_message":"TRUMP WON'T BE ABLE To Use Oval Office For A Year Have To Use Nixon's Old Office Across Street"},{"comment_id":"10154855250569062","commenter_b":"please name a book that would represent all citizens lol come on now. Tennessee is like 81% christian so i think the book works fine @webpagelink/ it represents the people not the government, so there is your seperation :P","commenter_a":"Even when I was an atheist, the bible was a good read. Some of them just need to get their head out of their butt to look at things objectively.","post_message":"Good idea? Bad idea?"},{"comment_id":"1124537887639264","commenter_b":"It is a shame that one of the frontrunners for the Presidency is directly responsible for spreading the fears and bigotry that lead to this nonsense. Islamaphobia is going to ruin this country from within..","commenter_a":"And so it begins again The seeds of hate, distrust and ignorance have sprouted","post_message":"She never could have expected this. Not in America..."},{"comment_id":"10154085001886800","commenter_b":"Eve, the most hated woman to ever exist.","commenter_a":"More specifically, women are paying for it. Eve ate the apple, now we're cursed with periods, painful pregnancy, and really shitty mood swings.","post_message":"Connecticut lawmakers want to get rid of the statute of limitations on child sex abuse cases, but they're running into opposition from the Roman Catholic Church."},{"comment_id":"1371649186228159","commenter_b":"There's a Q now, what does that stand for?","commenter_a":"They absolutely deserved it. As a proud member of the LGBTQ+ community I am shocked at half of these comments. You show that crown off with pride honey because you really deserved it.","post_message":"Hateful backlash from jealous female classmates angry at being beaten by a 'boy'"},{"comment_id":"1397444103681973","commenter_b":"Welcome to the internet hun.","commenter_a":"90% percent of the people calling others cry babies are the same who were crying and complaining when obama was president.","post_message":"This one sums up today's women's rights marches beautifully..."},{"comment_id":"681700478660950","commenter_b":"My life","commenter_a":"@username you","post_message":""}]
