[{"comment_id":"1247431258610235","commenter_b":"Shut Up!","commenter_a":"Black guy shoots a white guy who was trying to help a female. Sad. When do the riots start?","post_message":"SHOOTING CAUGHT ON CAMERA: New Orleans police are searching for the man shown in this video shooting a med student who was trying to stop the suspect from allegedly attacking a woman. The suspect can be seen shooting the student in the stomach after a verbal confrontation, and then attempting to shoot him again when his gun appears to jam. Read full story: @webpagelink"},{"comment_id":"10153311857346323","commenter_b":"It's an attempt at humour, not political analysis. Lighten up.","commenter_a":"Guardian is now as bad as the Daily Mail , completely biased with dumb pointless analysis , just left versus right , I used to appreciate the Guardian but sadly it has lost its way","post_message":"Bill Brewster: \"The Milibands have arrived just in time for Ibiza's season opening parties, but there are plenty of issues on which they could campaign in Ibiza. There are the young workers on zero-hour contracts who flyer the beaches, often working on a basic of €50 per week. Then there’s the scandalous prices of the leading clubs, or the police, often accused of corruption and being heavy-handed. Mind you, after the campaign he’s just had, if I were him, I’d kick back the slingbacks and hit the horse drugs.\""},{"comment_id":"10153641389062994","commenter_b":"I still don't understand all the female supporters on here. He hates you.","commenter_a":"He did a great job!!!","post_message":"Donald J. Trump is in Birch Run and will take the stage in just moments. Watch what the GOP contender has to say about Michigan, this country, his campaign, and who knows what else."},{"comment_id":"1014917681925727","commenter_b":"Alex, it was a hot springs then we saw in the photograph.","commenter_a":"Christopher Sorrentino","post_message":"Hot springs have injured or killed more people in Yellowstone National Park than any other natural feature."},{"comment_id":"640840709429112","commenter_b":"QUIT RAPING AMERICA ..........WHY ARE YOU NOT IN PRISON. .........WHY","commenter_a":"oooh, I bet they are shaking in their boots","post_message":"BREAKING NEWS: Obama fires back at Russia..."},{"comment_id":"10153580518686749","commenter_b":"@username The narrative BARACK HUSSEIN OBAMA has been pursuing is based on twisted facts and a long standard hatred against liberty and against our Republic', which he calls it America. HILLARY CLINTON being in lockstep with him, and just like him, she also felt the need to go around the world and apologize for all the things we supposedly did in the past. Never mind of all the aid and the freedom many Democracies are enjoying because of us and the blood we shed for them. We helped them and still helping them not because we but because is our duty to all the Millions of American citizens who came from those places and all their loved ones who are still living there! So, instead of leading from behind, when will our Nation have a pious and righteous President, a Constantine, a Theodosius, a Justinian, who will not be afraid, ...","commenter_a":"You're the best president, I'm from England but thanks for everything you have done Obama, especially for the LGBTQ+ community.","post_message":"President Obama's final State of the Union is on January 12. Say you'll be watching—and join the conversation. @webpagelink"},{"comment_id":"10152601716778837","commenter_b":"Stupid a$$ b**ch...","commenter_a":"Another arrest, more jail. He's a bully and is still playing god. It's just a matter of time before he kills again..","post_message":"BREAKING -- George Zimmerman arrested in Florida @webpagelink"}]
