[{"comment_id":"10153253749121800","commenter_b":"Heard this on 98 rock on way to work....halliarous!","commenter_a":"Masoud Jalali","post_message":"\"To be clear, a guy on CNN just said, 'Hey, if people are looking for news, I'm sure they can find it somewhere.'\" -- Jon Stewart"},{"comment_id":"10153687678068487","commenter_b":"A drama queen is bad enough! But a stupid, manipulating drama queen can mess up your day! She's the wolf in sheep's clothing! Voters...do your own fact checking!","commenter_a":"Fiorina wasn't \"confused\". She was lying.","post_message":"No one can find the scene that Fiorina described at the debate in the Planned Parenthood videos."},{"comment_id":"10154303589011051","commenter_b":"Immigrants are always welcome, if they come legally and come to be A PART OF AMERICA. If they come to just spread their own countries ideals that conflict with the ideals of the USA, then why come at all? As for who said anything about Sharia Law...that is one of the biggest current issues with immigrants going to the US. They believe in it. They shouldn't be in our country if they do.","commenter_a":"What a wonderful way to make immigrants feel welcome (ps: that's sarcasm) or perhaps immigrants aren't really welcome? In your hearts do you hate people who haven't been born here or speak with an accent or celebrate holidays differently than you do? Whatever happened to \"We hold these truthes to be self-evident- that ALL men are created equal.\"? Or do we really mean all white northern European men are created equal?","post_message":"Do you agree or disagree with this Theodore Roosevelt quote?"},{"comment_id":"846208402083168","commenter_b":"Sounds like she has her head screwed on pretty straight !","commenter_a":"Amazing !!i am actually so happy for this girl... Finally, someone who I think really deserves and will truely appreciate what has just happened to her...","post_message":"\"I’m just grateful for this moment.\""},{"comment_id":"1039384902787653","commenter_b":"Wow! Just listen to some of the crazy sh*t that this woman is saying! Talk about freakin' scary! Someone needs to go get her, put her in a straight jacket and lock her up! She is dangerous to herself and others around her! Saying Obama is the antichrist?? Have no clue where this kind of idiot gets off saying the things she does but if I were the CIA, I would be kicking her door down and taking her to GITMO...where she clearly belongs.","commenter_a":"REALLY?? Look I'm half German and spend a lot of time there. Yes it's difficult times there and a clash of civilizations so to speak.but to package this as a massive multicountry deliberate planned invasion of extremists is ludicrous. What is true is that Western Europe in its liberalism has forgotten it's Christian faith and there is a faith vacuum. Alberi wieder des Infoax viel dies Michael Lenz","post_message":"This woman is BUCKETS full of crazy!"},{"comment_id":"1274246805922508","commenter_b":"Of course it's happening in England and if Americans don't wake up, you will see it here too. Open the Bible and read it with your family. it will show you who God is and who this muslim god is. Protect your family at all costs.","commenter_a":"If this is allowed to happen in the US, then mistakes have been made, and someone will need to pay!","post_message":"This school has taken things WAY too far. This is ridiculous. Is this school committing a crime?"},{"comment_id":"10153713644828984","commenter_b":"Yes build it. And people American people will have a job and steel prices go up. And we win!!!!!","commenter_a":"Build the wall. Put censors all along the border and give the border patrols the order to shoot any one who gets over or under the wall. Illegals will stop coming.","post_message":"Boom! Critics of Trump's border wall just got silenced in an EPIC way by The Donald himself. There's no way they can argue this one!  Do you agree with what Donald Trump just said about a border wall?"}]
