[{"comment_id":"1073442816041814","commenter_b":"We all get there no matter who you are 4 days coming it will be so funny she doesn't know what she's talking about but you have to look at it he's an ignorant liberal socialist!!!!!!!! When she gets old just let her die!!!!!!!!! She is stuck on stupid!!!!!!!","commenter_a":"You will be old idiot","post_message":"Totally nuts!"},{"comment_id":"10156446544055594","commenter_b":"That woman needs alot of things","commenter_a":"We all only have so many minutes that make up our lifetime. This is a premeditated act of terrorism for which they should all be jailed for a minimum of a year.","post_message":"LIVE video and coverage as protesters are being removed and traffic is backed up on the Bay Bridge."},{"comment_id":"1746704652254245","commenter_b":"Wow really Michelle Pugh, you put yourself in that situation for sleeping with her father\" a married man: but you won't tolerate public shaming Really looks like an excuse to try to squeeze money out of someone which is his daughter SMH say;s a whole lot of type person you are!!!!!!!!! No class!!!!!!!!!!!!!!!!!!!!","commenter_a":"Nasty is all I can say","post_message":"Michelle Pugh's life has changed dramatically in the short few months since her four-year affair with Ozzy Osbourne was revealed."},{"comment_id":"10154656538916037","commenter_b":"Did she forget her campaign started birther in 08. non issue move along...Besides Obama is not running...","commenter_a":"Thats the problem here, nobody questions.... Some Americans are like a bunch of sheep","post_message":"“For five years [Donald J. Trump] has led the birther movement to delegitimize our first black president.\""},{"comment_id":"10153850884477235","commenter_b":"Only a woman who knows full well that things have changed since the days of screen time for weather \"girls\" only could say something so offensive. She is not worried about being masculinized out of a job.","commenter_a":"Mentally challenged","post_message":"The stupid, it burns."},{"comment_id":"10153591914773132","commenter_b":"Ha","commenter_a":"Well I don't think prada makes sandals his size","post_message":"Looking good, Caitlyn Jenner!"},{"comment_id":"1252562101428763","commenter_b":"Pathetic. She should be charged like a criminal .","commenter_a":"Illegaly gotten fees and she gets a bonus?","post_message":"It's a disgrace that while millions of Americans were defrauded by Wells Fargo, the executive in charge of running a scam received a $124 million bonus."}]
