[{"comment_id":"1136752646369001","commenter_b":"No the world is laughing at America","commenter_a":"The most pathetic, delusional president in history by far. Terror, hatred, murder and division all over the world like none in recent history and he says something so outrageous? Embarrassing and the world is laughing at this fool.","post_message":"Obama thinks we're living in the most peaceful time in history."},{"comment_id":"10153256753408445","commenter_b":"All I know is I'm gonna smoke so yea u can lick my ass crack","commenter_a":"yea lets kill all those smokin weed dumb fkin pigs lay em all down permanently","post_message":"#NEW - Hundreds of Local Cops Are Requesting Armored Trucks To Fight War on Weed"},{"comment_id":"10154270105832293","commenter_b":"Feminist spotted","commenter_a":"If you have an ounce of common decency, you're statistically more likely to support Hillary Clinton.","post_message":"If you have daughters, you're statistically more likely to support Hillary Clinton."},{"comment_id":"10153105302477144","commenter_b":"Funny. I thought she sounded a lot like Hillary Clinton","commenter_a":"She is my number 2 choice. I am all about Bernie, but hif he doesn't get the nomination, I will give it all to get this woman in office bcause the alternative side is terrifying.","post_message":"\"The defining economic challenge of our time is clear. We must raise incomes for hard-working Americans so they can afford a middle-class life.\" — Hillary Clinton"},{"comment_id":"10153963536777235","commenter_b":"And a large percentage of illegal immigrants simply come here legally with a visa and just don't leave.","commenter_a":"The wall is absolutely absurd. See the ocean? You can use it to go around the big ugly wall. See the airplanes? You can go over the wall. Ask El Chappo about going under things. It's nostril flaringly stupid. Ancient technology. Pre airplane, backhoe and no ocean on either side. It would be funny if there weren't so many truly stupid people believing it. Gag, cough, hurl.","post_message":"BUSTED!"},{"comment_id":"10153335080543487","commenter_b":"@username - actually that's what women think but if you're not paying attention, between sitting down and standing up, sitting down is far messier.","commenter_a":"They should also sit down to piss. In solidarity.","post_message":"From our archives: An ethicist explains why he and his fiancee rejected this centuries-old tradition."},{"comment_id":"10153215543531519","commenter_b":"She now has to move from comedian to propagandist. Not an easy feat","commenter_a":"Last nights show was unfunny. Amy Schumer was not funny last night IMHO. She's really being pushed right now, and while I think she can be funny, there are way funnier female comedians.","post_message":"Watch: Amy Schumer crushed it on \"SNL\" last night, but this gun commercial parody might be the most brilliant short clip the show has done in years"}]
