[{"comment_id":"10153188126467293","commenter_b":"What is this, then? \"That multicolored background is not gonna save you.\"","commenter_a":"That qualification was executed with a double standard.","post_message":"For all those who doubt the women's accomplishments."},{"comment_id":"1110152195742243","commenter_b":"IF Hillary does get in I cannot wait to see people like YOU have to bend over and grab their ankles because of all the Radical Muslims and Syrians she plans to bring into the USA. Within her first 100 days she wants totally open borders and wants to bring in a minimum of 65,000 more Syrians. And within her time as president she plans to bring in a minimum of 1 MILLION Muslims! ....IF Trump does not get in, you can kiss your azz goodby and say hello to ILLEGALS, MUSLIMS, THUGS, and SYRIANS who will rape (you and your family), rob, and want everything you have worked for...........and they will get it! .The USA will go into total bankruptcy, and become a totally socialist nation!............IF this happens, Just Remember: \"I Told You So\"....AND YOU DESERVE IT!","commenter_a":"Republican nominee Donald Trump disdain for the American worker is legendary at this point. He been caught refusing to pay people for doing their jobs, told them that they don deserve a minimum wage, and offers benefit plans that actually won help working families, and scammed thousands of Americans out of their hard-earned money with his fraudulent . He doubled down on insulting the American working class in a truly insulting fashion earlier today when speaking about how too many Americans are working two jobs just to make ends meet, but told the crowd that , I working harder also, so I don feel sorry for any of you. It true. You think this is easy? Mr. Trump has never truly done a day of in his life. After graduating from his high-priced university, he was given a loan of a million dollars from his father, with which he began ...","post_message":"Today - I outlined a plan for American economic revival - it is bold, ambitious, forward-looking plan to massively INCREASE JOBS, WAGES, INCOMES and opportunities for the people of our country!"},{"comment_id":"10153366619543635","commenter_b":"Nope. I thought you knew better than that.","commenter_a":"Quran (3:56) - \"As to those who reject faith, I will punish them with terrible agony in this world and in the Hereafter, nor will they have anyone to help.\"","post_message":"Hillary Clinton: 'Muslims Have Nothing to Do With Terrorism'"},{"comment_id":"449908955134145","commenter_b":"Can't answer the question, Joey?","commenter_a":"This is absolute overkill. I get we should police the police but come on. You're going out of your way to stop an officer from doing his job","post_message":"This baby faced cop looks fresh out of the academy and willing to follow any order he is given. Luckily this veteran government accountability activist planted some seeds in his mind about who he is actually working for and how liberty is a better solution.  Watch the epic schooling RANT: @webpagelink"},{"comment_id":"10154490094079342","commenter_b":"@username so it's okay for a woman to put her hands on a man and act like a man but the second she get treated like a man she wanna cry and say, \"I'm a girl!\" FOH! Keep your hands to yourself. Period!","commenter_a":"Kindergarten lesson, first rule. Keep your hands to yourself.","post_message":"The video shows the woman shove Mixon, then he punches her in the face."},{"comment_id":"870560229647985","commenter_b":"Not bad for Teddy... only two outright lies in 4 sentences lol","commenter_a":"Love Ted Cruz","post_message":"Listen to how this Obamacare question from CBS News correspondent is phrased -- and then Ted Cruz's answer:"},{"comment_id":"10153573077978352","commenter_b":"Christina you're dumb","commenter_a":"Te'ron Walker because most black people blame whites for everything. When no white people alive today had a damn thing to do with the past. Not all white people are racist. There are plenty of black racist people though because all whites \"owe\" blacks every damn thing when we're not the ones that had anything to do with anything that happened before. Y'all need to take that shit up with all the dead white people. Oh, and the blacks too since whites weren't even the ones to START damn racism. Ignorance is bliss people.","post_message":"High school principal fired after racist outburst at ‘all the black people’ leaving Georgia graduation ceremony early"}]
