[{"comment_id":"556755621195285","commenter_b":"@username y'all race invented HIV and experimented on other races but that heroin epedimic spreading HIV all thru the white folks Hood. Keep sharing needles junky..","commenter_a":"Same white dudes screaming how they would beat her ass are the same ones who scream don't hit a woman when it's a white woman !!! Good news is that it is fact that by 2030 the white race will be a minority ! 😉. So that always makes me smile when I see the racist still holding on to a failed system ! But that's ok the rest of the world has moved on! Just look at the population ... your country is now little Mexico right under you nose while you tried so hard to oppress the blacks you let in millions of mexicans , Muslims , Somalis! Now you mad !","post_message":"She took his crowbar away and went crazy! "},{"comment_id":"10152685223867894","commenter_b":"That Bitch Messy Asl !!","commenter_a":"Tameka Lovinglife Mccraney These Celebrity Couples And Exes Are So Messy Lol","post_message":"Naya Rivera Announces Her Pregnancy on the Same Day as Big Sean's Album Release [Photos]"},{"comment_id":"10152933531687434","commenter_b":"Sex is only for straight, married, rich people!","commenter_a":"It's like they WANT teenagers to have babies. No sex ed, no planned parenthood. Since we know abstinence only education does not work, what else can we take from this?","post_message":"“If they’re doing such a great job, why aren’t these things better?” Bobby Jindal asked of Planned Parenthood."},{"comment_id":"810146635842580","commenter_b":"Aye.","commenter_a":"now they need to lock him and the rest that have been letting him get away with everything.","post_message":"Supreme Court Strikes Down Obama's Executive Immigration Order  This is huge. Finally the Supreme Court does something right.  Do stand behind their decision?"},{"comment_id":"1017395615037845","commenter_b":"@username Border security is far more lax than it has ever been. Obama gives the border patrol and ICE orders to stand down all the time, which is a major contributing factor of the explosion in the illegal alien population in the US. The illegal population here is at an all-time high. There should never have been a healthcare mandate. This isn't a socialist regime. The people (or at least the majority of us) don't like the mandates, individual or business. I assert that you condoned Fast-N-Furious because you're the one who said things are better than they were \"under the misery of Bush\". Businesses salivated at the prospect of cheap labor, so when Bill Clinton signed NAFTA into law they didn't mind one bit firing millions of employees -many of whom had to seek any type of welfare they could in order to get by. Not good for economy ...","commenter_a":"You are MOST WELCOME here in the great state of Pittsburgh, Pennsylvania Mr. Trump!! I cannot WAIT to see you tomorrow!! You build that wall and we'll provide the steel!!! Come on Yinzers!!! Vote Trump!!!","post_message":"THANK YOU CALIFORNIA, MARYLAND, PENNSYLVANIA, & NEW YORK! I appreciate your unbelievable support. Together, WE will MAKE AMERICA SAFE & GREAT AGAIN!"},{"comment_id":"10154376028466509","commenter_b":"He's dead lady.","commenter_a":"Biden would be a better president than Hillary.","post_message":"President Barack Obama presents \"four big questions that we as a country have to answer \" during his State of the Union address.   #SOTU updates: @webpagelink"},{"comment_id":"10156284558895725","commenter_b":"I am a US Navy veteran having had taken my Philippine born wife through the immigration process. The immigration process can always be improved but, to give out amnesty to the illegals is like saying don't worry about the long waits in line; hundreds of dollars spent on forms; and the months it takes to swear in as a US citizen. If illegal immigrants want amnesty then pick a number; pay a penalty, and follow the process including all the fees. People who are following the rules are deeply wronged by illegals jumping the line by receiving amnesty.","commenter_a":"God Bless Donald Trump as he is our next real President.","post_message":"Press Conference LIVE"}]
