[{"comment_id":"10154451806701336","commenter_b":"@username no he wants to ban people ! Refugees are properly vetted - since we have had close to a million come in since 911 !","commenter_a":"Something is wrong with the America I grew up in.. it's called liberalism!","post_message":"Just In: Elderly patient and nurse shot and killed at hospital in Titusville, Florida. Police have not released information on suspect or motive. More: @webpagelink"},{"comment_id":"596204130539541","commenter_b":"@username I think most people are okay with accepting refugees. PROVIDED, that they become members of the country they decide to make home. Non of this lets make Sharia law zones like back home bollocks. How do you separate the good from bad? Only allow families in? That hardly sounds fair. Just be aware that when you accept them in you accept responsibility for them. Anyone raped. Any bars burned down. Any cartoonists shot. You are responsible for those by knowingly understanding some of the bad is coming with those who need your countries protection.","commenter_a":"The assumption that these guys are all refugees is really telling. *Open your eyes a bit, these fuckers are homegrown. Isis is betting on you hating and attacking refugees to add fuel to their fire. You're all being played.","post_message":"Some experts say it's only a matter of time before the heart of the European Union sees tragedy."},{"comment_id":"858391040863023","commenter_b":"Hillary should be strapped to the front of the bus in bumper to bumper traffic.","commenter_a":"another clown to join the clown bus! Out of touch with reality","post_message":"Dr. Ben Carson is running for president. Here's where he stands on the issues..."},{"comment_id":"10153503971232464","commenter_b":"That's an awesome plan, and repeal Obamacare! Defund Planned Parenthood & NO to Iran Deal! Cruz/Trump--2016","commenter_a":"@username 2016!","post_message":"If I'm elected President, the very first thing I intend to do is rescind each of President Obama's illegal and unconstitutional executive actions! #CruzCountry"},{"comment_id":"889715544460386","commenter_b":"So tired of this progressive rant. If you come here illegally you need to go home. PERIOD!","commenter_a":"Are they trying to lose the election?","post_message":"She says the holiday-season roundups were \"mass deportations\" that are sowing \"division and fear.\""},{"comment_id":"10154453372292149","commenter_b":"She, Bill are too quiet. Beware: they are coming back.","commenter_a":"Go to Jail........","post_message":""},{"comment_id":"619503418188720","commenter_b":"This monkey is a joke.","commenter_a":"Spoken like a true tyrant.","post_message":"Barack Obama: Soft on ISIS, Brutal on States"}]
