[{"comment_id":"10153509704082452","commenter_b":"So she sees a medieval torture device in her snatch, boy that's a bright one right there. I feel sorry for whoever got that scag pregnant.","commenter_a":"LOL........","post_message":"A pregnant woman said she saw an image of the crucifixion of Jesus Christ during her ultrasound."},{"comment_id":"10154237264628908","commenter_b":"Safe from all the predators but not from mosquitos.","commenter_a":"I like the idea of being up off the ground. I wonder if you could feel the bear or tigers fur under your back? The option of over the water is very appealing when it comes to lions, tigers, and bears oh my! Army Ant territory too. I think I would feel safer over a calm river, not up too high, but out of reach of most animals, than on the bank. Also, I imagine up in the air, not as much heat is extracted from your body as when you are on the ground.","post_message":"These tents suspend from trees! Get the experience of a hammock and a tent all in one. Thanks Tentsile!"},{"comment_id":"10153943709566509","commenter_b":"Humans ruin everything they touch.","commenter_a":"why kill the bear!!!!!! humans were encroaching on it's territory! makes me ill","post_message":"Fatal human-bear encounters in Yellowstone National Park are rare, a spokeswoman said. @webpagelink"},{"comment_id":"10154476827456636","commenter_b":"@username the most powerful twat in the world more like.","commenter_a":"Whether Trump comes, makes a speech in parliament, or visits the queen, is irrelevant, it was the speed with which he was invited by May, that smacks of embarrassing desperation to me.","post_message":"More as we get it"},{"comment_id":"1076375005794438","commenter_b":"I bet you are one of those that says it was just \"locker room talk\" when Trump spoke of grabbing a woman's pussy, aren't you? \"Hey, boys will be boys\"","commenter_a":"The flight attendant was not harassed, intimidated or any other federally worded names that aren't allowed. She made a mountain out of a molehill. Very irritating.","post_message":"Alaska Airlines confirmed that a different passenger's Facebook post detailing the incident on Flight 520 was accurate."},{"comment_id":"513245565531981","commenter_b":"I rarely say bad things on fabebook , but she 's a real bitch.","commenter_a":"Coulter and FOX's best days are wayyy behind them. Here's hoping this ideology of thiers dies a slow death","post_message":" know what this convention really needed? An angry Muslim with a thick accent,\" she said."},{"comment_id":"1091281260931621","commenter_b":"False? He plead guilty and was a registered sex offender.","commenter_a":"Best known for being a paedophile.","post_message":"RIP Jackass star Vincent 'Don Vito' Margera"}]
