[{"comment_id":"1221148801300111","commenter_b":"Such a demented mind-set. Let us all pray that the Lord will convict her and turn her from her wicked ways.","commenter_a":"Evil","post_message":"“Christian” Abortion Doc Says: “I Love” Killing Babies in Abortions, “I’m Proud to Do So”"},{"comment_id":"530424503814796","commenter_b":"I'd be out of a job!","commenter_a":"what is illegal is letting ASS HOLE groups like the GAY patriot put their STUIPD SHIT on facebook they should be put in jail for life","post_message":"A popular company is forcing their employees to wear head scarfs.  This has to be illegal.  Would you quit if they tried to force you to wear a headscarf?"},{"comment_id":"1156511254368903","commenter_b":"The land belong to native american until white screw it up.","commenter_a":"NO TO CHINA!!!! Our land is for the American People!! and Washington State's water belongs to THEM!","post_message":"Farmers from drought-parched California are finding greener pastures in the Pacific Northwest. And so are buyers from China."},{"comment_id":"575161529335569","commenter_b":"That sick women will never be fine ! Who you kidding !","commenter_a":"Why is this such a big deal? After some rest, and antibiotics she will be fine.","post_message":"Is Hillary Clinton just run down, or is it more serious?"},{"comment_id":"10153043842829411","commenter_b":"This Germans are only the progeny of the stupid Jews that survived the holocaust.","commenter_a":"Look the Nazi are back.","post_message":""},{"comment_id":"1134932883194388","commenter_b":"down, look at the squares on the sides","commenter_a":"I think up it is hard to say!!","post_message":"o.O"},{"comment_id":"945737062128382","commenter_b":"Most Muslims are opportunists & try to take advantage of our awesome OPEN accepting country and are trying to push their false religious bogus rules and regs on us. Too late. Two wars have been fought on our soil and much blood shed to protect our American way of life and that includes the right to run a busniess free of foreign rules... do not continue trying to bring foreign laws into the equation..it doesnt fit!!!. America's laws are the way we live life..NOT islam..thats for syria etc..those rules are SOOO not ever going to work here so just try to relax and accept it. Get some counseling. Maybe then you will be happier and free from manmade male imposed non Christian laws. They always seem so negative..no joy in life! You're in America..rejoice..embrace your new life here. Jesus will set you free from the bondage of FALSE RELIGION...ask the ...","commenter_a":"She must follow the rules of the country where they live and enjoy the luxury of that country. If they don't, they must return back where they came from.","post_message":"Muslim woman wouldn't remove hijab, but hypocrisy bit her in a BIG WAY!"}]
