[{"comment_id":"1102356133153121","commenter_b":"dumb bitch","commenter_a":"Yooooooo I Knew She Was A Tranny!!","post_message":"‘I Stand Corrected:’ Wendy Williams admitted fault and apologized for her remarks about HBCUs.  Williams spoke with Roland Martin on Thursday's edition of The Wendy Wiliams Show where the NewsOne Now host eloquently summed up America's troubled past of slavery, segregation, and the oppression of African-Americans. WATCH the discussion and the NewsOne Now recap -> @webpagelink"},{"comment_id":"10154062439342541","commenter_b":"Too much fat around the waist can't grab that skank","commenter_a":"Big deal. There's a position waiting for her in the White House after January, 2017. She seems to have the required credentials/ideology that would qualify her for employment under that administration.","post_message":"The non-profit director who called First Lady Michelle Obama an \"ape in heels\" has been fired for good."},{"comment_id":"10158731027245206","commenter_b":"No pair of shoes, living or dead, is worth 700 buckers. Stop it. This makes me miss the old days, when you'd never hear about some spoiled girl and her \"serious,\" attention-getting problems.","commenter_a":"Material stuff irrelevant .. dog love for ever by the way very ugly shoes","post_message":"This mischievous pup sunk her teeth into some high fashion — literally — when she chowed down on her owner’s new $700 Christian Louboutin heels."},{"comment_id":"10152619754670950","commenter_b":"So than move Israel and let him be your leader, see ya, we don't need ya!!","commenter_a":"The only backlash is from the white house... I welcome him anytime.","post_message":"Israeli PM Benjamin Netanyahu is going forward with plans to speak to Congress next month @webpagelink"},{"comment_id":"10153018260001130","commenter_b":"Darin, what exactly, is a slut?","commenter_a":"abstinence based=teachs them nothing and then they get curious and then once curious they start having sex and when that happens boom teen pregnancies and after that begins the slut shaming when the only people who should really be blamed is the schools and parents for not being more educational","post_message":"Young people still aren't getting much from sex ed."},{"comment_id":"10155104320669614","commenter_b":"Liliana Sanchez ghetto AF.","commenter_a":"Losers","post_message":"Officers recovered a large amount of stolen mail, checks, W-2's, government identification cards, and narcotics after arresting the pair, authorities say.   Police estimate there are more than 50 victims in San Bernardino and Riverside counties."},{"comment_id":"367420580112903","commenter_b":"Rot in Hell B#$%H !","commenter_a":"Good for him !!!!","post_message":"INSTANT Justice: Judge: \"I Hope You Die in Prison!\"  Watch the video!"}]
