[{"comment_id":"10153700840423812","commenter_b":"She just mad cause she can't have a slice lol","commenter_a":"Some one pls buy these ppl a cake.","post_message":"Couple married for 60 years eats a piece of their original wedding cake every anniversary. They store cake in a coffee can, and moisten it every year with brandy before eating another piece. @webpagelink"},{"comment_id":"10154563996420575","commenter_b":"Obama had better shut and realize all America wants his ass fried!","commenter_a":"Oh, like he did?","post_message":"WOW! Obama says he hope TRUMP will be able to stand up to PUTIN. ---After getting steamrolled by Vlad for eight years!"},{"comment_id":"991950690936939","commenter_b":"Looks can be deceiving. The slob has way too much power and his history is terrible.","commenter_a":"How is Bannon so canny?? He always looks like he just work up in a bus stop with a bad hangover and isn't 100 percent sure where he left his pants.","post_message":"Trump's aides also reportedly don't know how to properly turn the White House lights on and off."},{"comment_id":"889715544460386","commenter_b":"So tired of this progressive rant. If you come here illegally you need to go home. PERIOD!","commenter_a":"Are they trying to lose the election?","post_message":"She says the holiday-season roundups were \"mass deportations\" that are sowing \"division and fear.\""},{"comment_id":"1344000762286340","commenter_b":"I wonder how much Hillary paid all of these women","commenter_a":"My breast feeding children touched me inappropriately. Good Lord, People,..... Killary's Husband raped people. No comparison. Doh!","post_message":"New allegations against Donald Trump."},{"comment_id":"1062159727157832","commenter_b":"If that were to happen then only the criminals will have guns.","commenter_a":"Aaw Fuck, here we go. Egotistical morons doing \"research\" and thinks their Right. Others just making shit up, then there's the name caller who judges everyone else..No One has a Fuckin Solution?! Then don't write Anything","post_message":"Karl Rove had a unique idea during a Fox News interview: The only way to stop people like Dylann Roof is to completely repeal the Second Amendment."},{"comment_id":"1911468415618542","commenter_b":"Buy yo mama some food","commenter_a":"All doped up","post_message":""}]
