[{"comment_id":"10154276693141037","commenter_b":"Hillary needs to start leaning a bit further left, and start actually addressing the issues that the voters she's not getting care about. Her \"don't be so pie-in-the-sky\" attitude will cost her the election, and God only knows the price this country will pay with Trump in the Oval. Bernie is hanging tough because Hillary is not!","commenter_a":"I will only cast my vote for Bernie Sanders. Period. I will write him in if need be.","post_message":"Despite Hillary Clinton’s insurmountable delegate gap, Bernie Sanders coasted to victory on Tuesday, yet again."},{"comment_id":"457420381115209","commenter_b":"NO Never they Are NOT The Only Ones With Slavery in their History/Background Stop the Hate All People in JESUS NAME Ps139 Amen","commenter_a":"Hell no","post_message":"Should Blacks Be Compensated For Slavery?  Comment 'yes' or 'no'."},{"comment_id":"10153628847251336","commenter_b":"Shes so nasty","commenter_a":"She is a disgusting person trash","post_message":"What did you think of Miley Cyrus' barely-there ensemble?"},{"comment_id":"1385280774831907","commenter_b":"#NEVERTRUMP #NEVERHILLARY #NEVERBERNIE @webpagelink","commenter_a":"Have stop watch Faux News! #nevertrump","post_message":"\"In Hillary's America we focus on Hillary, but we also focus on the whole sordid history of the Democratic Party. We're telling an unknown story, and it's going to rile up this race.\""},{"comment_id":"10155008881554411","commenter_b":"Zeyad Hopkins : @webpagelink","commenter_a":"She didn't spark anger, in fact Saudis didn't care. But @username has a case against Saudi and the USA, and yes I don't like Saudi but let's not start spreading bullshit and hate","post_message":"Just days after Merkel said burka should be banned in her own country."},{"comment_id":"1480806588645751","commenter_b":"@username, Nancy is not well educated. Clinton or Trump presidency will lead to WWlll. We need to stop voting for the lesser of the two evils. I bet Nancy has never heard of Machiavelli.","commenter_a":"And Hitlery wants to bring thousands of Syrian refugees to our country. This has to be stopped!! TRUMP/PENCE 2016","post_message":"Manhattan bombing in Chelsea has similarities to the Boston Marathon bombings of 2013, say explosives experts"},{"comment_id":"10153170103931770","commenter_b":"She's improved at lying ! And she makes Barb not feel like such a hag.","commenter_a":"Crap","post_message":"Barbra Streisand said she thinks Hillary Clinton's campaign strategies have improved a lot over the last few months."}]
