[{"comment_id":"810160139094199","commenter_b":"guns? what guns? we aint got no stinking guns. Now lets play hide and go seek...","commenter_a":"And hopefully this is what ends up being her downfall","post_message":"Band-aids don't fix bullet holes You say sorry just for show If you live like that, you live with ghosts..."},{"comment_id":"10156072417220603","commenter_b":"Well take up not enough jobs with the people that keep letting foreigners in the country.","commenter_a":"Yall saying people should be able to support themselves are not understanding that jobs at McDonald's etc are NOT meant to support a family. If you have a job there and have a family they (McDonald's) and us (people that will take the hit of a min wage increase because the cost of products will go up) should not have to pay for your poor choices for not being mature and either going to college or tech school or working your way up in a company. Min. Wage jobs are for high school/college students so if youre past those ages and still making min. wage you should've made better choices and should stop expecting the same pay as people that did!","post_message":"Do you think the minimum wage should be raised?"},{"comment_id":"10155194763231178","commenter_b":"why r these liberal women ,so f-in ugly?","commenter_a":"Just another hypocrite.","post_message":"The New York Times reporter smeared the Tea Party as racist a few years ago.... now she's urging the left to start copying it."},{"comment_id":"10153608753847452","commenter_b":"its not up to us, it's the law. Our ancestors are no longer the subject for this. Hell I have family members that came here undocumented, but then did what they had to do to become citizens as fast as they could. I'm talking about the ones that come here and don't try.","commenter_a":"Smart or not, she needs to be deported, if she has not already applied for citizenship. Nobody ever said all undocumented immigrants were dumb, she's obviously not dumb by getting into Yale. Very sensitive subject. I feel like she's making herself the mascot for this whole subject.","post_message":"A valedictorian dropped a bombshell in front of thousands at her graduation in Texas - she revealed she's an undocumented immigrant. @webpagelink"},{"comment_id":"10154352617716880","commenter_b":"Yes. That's correct too. And once it's 10% conquest begins. Not sure if it's even possible to fix now.","commenter_a":"Could it be because there are too many Muslims in France?","post_message":"A French parliamentary report reveals its reasons."},{"comment_id":"10152911982215671","commenter_b":"Make sure you know the true story. I have never met the families that need their child taken. All my experience is the other side where CPS literally kidnaps the children for the hospital on lies and stories that get twisted and turned, so it sounds like abuse. Looks like we know opposit ends of the fight with CPS. No matter what is going on in these children's lives, I just wish the children were put first. When you take children from their homes, good or bad homes, put them in counseling. Do not drug them all up and do not allow them to be abused by the system.","commenter_a":"How about CPS just stop stealing kids!","post_message":"Sacramento County CPS is holding an event at 6:30 p.m. on Wednesday, but if you can't make it, we've included contact information to find out more about the program."},{"comment_id":"10153497527962464","commenter_b":"@username Add me..","commenter_a":"from Egypt we Love you. And we will redeem you, Mr. President.","post_message":"Headed into the #GOPDebate. Join us at 9pm ET on Fox News and tedcruz.org/debate"}]
