[{"comment_id":"1404176169614167","commenter_b":"We disgusted to look at you and your ugly ass fucking husband !!!!!","commenter_a":"Not sure who you are polling.. please tell me why democrats lost so big this election... because people were disgusted with her and her husband!!","post_message":"Michelle Obama continues to rank as one of America's most admired First Ladies. Do you admire her?"},{"comment_id":"600457780118425","commenter_b":"You fukn punks need to get out of our country. You are a disgrace to black people everywhere. You bitches are pathetic excuses for human beings.","commenter_a":"How much did Soros pay them??????","post_message":"Trump Hating Thugs Spit On Flag… Look What Happens Next [VIDEO].  If you don't respect Ole' Glory then you can leave our country.  Do you think these thugs should be deported?"},{"comment_id":"10152982438537217","commenter_b":"Hooray! Now show me the first 4 corpses of native Indians killed by the illegal immigrants from Eng And.","commenter_a":"Bet the Native Americans are over the moon about this! #genocide","post_message":"They were four of the first English men to colonise America"},{"comment_id":"10152972310600950","commenter_b":"She didn't have to do or not do anything. Her life doesn't go by some imaginary rulebook that you made up for social and community etiquette in the trans community. She can do whatever she wants however she wants, regardless of who it offends.","commenter_a":"If you have to ask if you are supporting your community the right way, then maybe you should be questioning your actions in the first place and the reasons behind them. He/she should have started a discussion forum with the transgender community prior to his/her transformation","post_message":"Caitlyn Jenner is starting to write about \"serious issues and lessons that I am learning through this process.\""},{"comment_id":"1404388792935308","commenter_b":"For those of you that vision oriented. 😝","commenter_a":"Michael is a cutie, btw. 😉","post_message":"You have to admit that this is a pretty great way to highlight the hypocrisy of anti-trans politicians."},{"comment_id":"1205517149514372","commenter_b":"Go away, Racist, Tax Evader, Liar, Sharkton! No more White House Visits! Hopefully Sharkton and Hillary share the Big House soon!","commenter_a":"Loser!","post_message":"Rev. Al Sharpton warned that \"all that many of us have fought for all our lives is at stake\" following Donald Trump's victory in the presidential election and vowed that \"we are not going down without a fight and Donald Trump needs to know that.\""},{"comment_id":"10153653127786336","commenter_b":"Obama should be deported with all of the illegals...","commenter_a":"make me sick","post_message":"\"The Obama administration is very friendly to individuals who are transgendered who are illegal immigrants. They provide them taxpayer-funded hormone treatments [and] special accommodations.\" – Tom Fitton, president of Judicial Watch, Inc."}]
