[{"comment_id":"1219402711410410","commenter_b":"i did not know we had 18000 + illegals in our country keep signing and we can take the list and round them all up and send them all home illegals NO legals YES if any one wants to come live in the U.S.A do it right by the law and we will embrace you any thing illegal in America will be prosecuted to the full existent of the law Americans don't care where you are from just do it wright","commenter_a":"Likely, they/#SNL have to give \"equal time\", since the top candidate from the other party was prominently featured.","post_message":""},{"comment_id":"10154409316811336","commenter_b":"I think like all of us Trump thought no this can't be and thus he thought it was a joke! Then reality of course set in and the man thought as we all do who would expect anything different from the Clintons? My question what is next to come it is something every single day?","commenter_a":"Why would Trump think that such a meeting would be just a joke? All of these democrats are capable of any despicable act imaginable! They have proven it over and over again, but all we ever do about it is whine like little punks! obama should be in prison, hillary should be on trial and lynch should be removed and arrested as well! ENOUGH with the beating around the bush! We need to hit them on the head! They need to be punished severely NOW!!!","post_message":"“I'm flabbergasted by it.”  Donald J. Trump reacted to the news that Attorney General Loretta Lynch met privately with former President Bill Clinton amid the DOJ’s investigation into Hillary Clinton’s emails. Full interview tonight at 10p ET."},{"comment_id":"10153186802728203","commenter_b":"\" \"There is very little in the Bible which reflects the modern idea of one man and one woman united by love, Jimmerson said explaining her support for gay \" \" Let's see Genesis 1 & 2 gives us the pre-fall structure of marriage. This was reiterated by JESUS in Matt 19 and Mark 10. There is no higher attestation then that.","commenter_a":"That's not up for contemplation if they did be sure to expel them right away","post_message":"Southern Baptist affiliate may expel church for performing same-sex ‘wedding’"},{"comment_id":"10152934995226680","commenter_b":"Seems you want to engage in gossip. I got better things to do with my time. Scoot along Andrew.","commenter_a":"Bernie's right. The biggest mistake of the Clinton administration was dismantling Glass-Steagall.","post_message":"Bernie Sanders: \"Allowing commercial banks to merge with investment banks and insurance companies in 1999 was a huge mistake.\""},{"comment_id":"10153899711236509","commenter_b":"I'd hate to see when an STD breaks out lol!!!","commenter_a":"Mahalia","post_message":"Imagine living in a town where everything you need is under one roof. Welcome to Whittier: @webpagelink #GreatAmericanStories"},{"comment_id":"540250699432857","commenter_b":"Really? ?? So does that go both ways, women cant be trusted watching kids that arent theirs I? ?? Your blanket statement, is kinda bullshit","commenter_a":"Some people treat their animals better than they treat their children. Why not take the baby with you? Never trust boyfriends with your kids.","post_message":"A woman and her friend wanted to run to the store, so she asked her boyfriend to watch her friend's kids for a little while. The women returned about a half hour later to find the man had done something horrific."},{"comment_id":"10153759061706051","commenter_b":"This is soo EVIL & SICK!!! Where were\\\\ R the kids parents??? Future Monsters in Society?","commenter_a":"poor little guy. he wanted to belong with the older ones. I hope the parents of this little guy sue the crap out of the murder's parents. The older kids had to be displaying signs of aggression.","post_message":"A 6-year-old boy was brutally tortured and killed by 5 other children. It gets worse."}]
