[{"comment_id":"10153848371885779","commenter_b":"Not*","commenter_a":"RS, why in the world does a music magazine now consider itself a forum for serious topics and an authority on what people ought to think? You are obviously pushing a liberal agenda when Noone with any sense is turning to you for any of this. Go cover a Backstreet Boys reunion show and leave these matters to serious adults in unbiased forums.","post_message":"At last night's #VPdebate, Mike Pence explained that his faith controls his position on abortion. But Pence's stance is nothing short of cruel toward women."},{"comment_id":"10156316346195725","commenter_b":"@username , but Muslims will not vote for him","commenter_a":"We need you now Donald Trump!!!","post_message":"Remember, I was the one who said attack the oil (ISIS source of wealth) a long time ago. Everyone scoffed, now they're attacking the oil."},{"comment_id":"501575200039916","commenter_b":"WANTS TO KEEP AMERICANS STAGNANT, MOVING BACKWARDS AND PAY HIGHER TAXES TO SUPPORT IMMIGRANTS COMING OVER OUR BORDERS FROM ISIS COUNTRIES TO PUT AMERICANS IN GREAT DANGER, WANTS TO KEEP MINORITIES IN DEMOCRATIC OPPRESSION, POVERTY, JAIL, AND HIGH CRIME, NO FUTURE, WELL WHY NOT VOTE FOR HILARY CLINTON.","commenter_a":"Yes","post_message":"Question of the Day: Should the media be giving Tim Kaine's past comments about President Bill Clinton more attention? Share your thoughts below."},{"comment_id":"10155007132753431","commenter_b":"Wicked Witch of the East.","commenter_a":"It's not about popularity. It's about decency and common sense!","post_message":"DeVos gave no sign that she had reservations about withdrawing key guidance for transgender students."},{"comment_id":"1802278956685902","commenter_b":"She is winning calm down","commenter_a":"Bahahaha 95% of the comments are anti Hillary and they have us believing she is winning...","post_message":"We're in Denver, Colorado, where both Bernie Sanders and Elizabeth Warren are holding a rally for Hillary Clinton."},{"comment_id":"866091750103560","commenter_b":"What do ya expect Dennis. I go out most days an feel I'm surrounded by backwoods hicks!! It kinda sucks being from a big city","commenter_a":"Its a LED light, idiots!","post_message":"A Tennessee mom claims she saw pentagrams in her kid's school bus brake lights. She says it's a threat to God and parents should be outraged: @webpagelink What do YOU think?"},{"comment_id":"968324823259627","commenter_b":"Bitch please","commenter_a":"This is ridiculous! Trump can beat Hillary or Bernie with one arm tied behind his back. America has made their choice. No more corrupt, lying, manipulative, smooth talking politicians. We want our country back! We have a real shot with Trump, and we're not going to be tricked any more.","post_message":"“Let me be clear on one thing tonight. This campaign is just beginning,” Bernie Sanders said. “When we come together, and don't let people like Donald Trump try to divide us, we can create an economy that works for all of us and not just the top 1 percent.\""}]
