[{"comment_id":"1043006319050712","commenter_b":"Limit the size of corporations ! Make them pay better wages and of course pay there taxes !","commenter_a":"It is important for one of the worlds' largest companies making huge profits, paying substandard wages, few benifits, manufacturing goods in the worst labor markets, akin to slavery to also hide it's money to avoid paying taxes to the government that provides medical care and food stamps to it's employees. After all what fun would it be to make obscene profits if you actually paid your fair share of taxes.....","post_message":"You won't find a Wal-Mart store in Luxembourg, but it does help the retailer avoid major US taxes."},{"comment_id":"10154588771167178","commenter_b":"Are expecting any more snow or ice around Roanoke Rapids?","commenter_a":"Is it going to be windy today?","post_message":"WRAL Elizabeth Gardner is taking questions now about today's forecast and what you should expect. For the latest weather conditions go to wral.com/weather."},{"comment_id":"10155422567365615","commenter_b":"Assholes","commenter_a":"I hope Greg Abbott gets HIV.","post_message":"They say a budget is a document that turns values into money."},{"comment_id":"615536761924441","commenter_b":"It open season on black people out here...I swear..the day when the rabbit has the gun is almost near.","commenter_a":"Well world, what do you think of the greatest country in the world now???","post_message":"Remember little Aiyana Stanley-Jones? She was only 7-years-old and ASLEEP when a Detroit cop fatally shot her in the head. Now it's official: EVERY LAST CHARGE against the cop who killed her has been DROPPED! He will face NO punishment AT ALL!  Are you surprised?"},{"comment_id":"1076190982460519","commenter_b":"She has never been distinguished! She has always been a fraud and an embarrassment to our country!","commenter_a":"Stop muddying the waters, Democrats. SMH","post_message":"FBI  Federal Bureau of Investigation Director James Comey testifies on Hillary Clinton Email Investigation before House Oversight Committee. Complete video here: @webpagelink"},{"comment_id":"10153105977467098","commenter_b":"YUP!! We always Been Here!! Who the Real Illegals!!","commenter_a":"Every race that is not latino or native american is an illegal inmigrant or descendant OF an illegal immigrant latinos ARE from this continent OF AMERICA... North central and south AMERICA ANYONE else their ancestors came on a boat across The Ocean and The atlantic ALL WE Did WAS cross an imaginary Line Lmao.... americans huh..... WATCH WHO u call a wet back we didnt have to cross The atlantic TO GET here wet backs","post_message":"Donald Trump would not say how he would locate, round up and deport the 11 million undocumented immigrants he says must go."},{"comment_id":"556485904539702","commenter_b":"Will her top fall off?","commenter_a":"What about the Blonde girl on the right? I didn't see anything unusual about her.","post_message":"TAKE A CLOSER LOOK A THE BLONDE GIRL ON THE RIGHT..."}]
