[{"comment_id":"10156149159940354","commenter_b":"There's NO MYTH! ASSHOLE! I RESCUE PIT BULLS TOO, It's Dumb F**KS like you and your brother James that give Pit Bulls a bad Rap! Also DumB F**KS like this woman in the article! Check Cesar Milan, Pit Bulls & Parolees, Etc etc! OH NEVER MIND You're probably a Liberal Obama lover too!","commenter_a":"I OWN PIT BULLS, It would be impossible for me to order mine to attack ANYBODY! I could leave them in a room with an infant crawling on the floor without a worry! THIS woman IS THE REASON Pits have a bad Rap! These dogs were trained to be mean! Lock her ass up for 25 YRS! I Doubt the two dogs can be saved, they'll have to be put down!","post_message":"***WARNING: GRAPHIC VIDEO***"},{"comment_id":"10153748697767629","commenter_b":"If white women didn't flunk every black and Latino out we might have the blacks in college and in education that we need.","commenter_a":"When are we going to start making teachers uncomfortable and scared? its a white, more privileged profession with more time off. Especially at the college level. Shouldn't they fear being shot in the head too? Thankfully we are getting guns on college campuses so that all authority can be radically challenged with an in your face confrontation. The Russian left has always known the power of confronting authority so I'm glad America is catching up. War and Revolution baby! Just like the founding fathers intended.","post_message":"This is beautiful."},{"comment_id":"965206956824108","commenter_b":"Heena thank you for that original post. More level headed than many on social media. Personally I think Islam and Christianity are both a blight to our species- but it is your RIGHT to believe whatever you want. I'll gladly defend your right to be or believe whatever you want. I know Islam and Christendom view me as an abomination because I am gay- I think that is incredibly stupid but I still respect their right to believe it. There is no reason a female officer could not have dealt with this lady and, after checking for contraband, allowed her to keep it on.","commenter_a":"I'm so tired of seeing this article. I wear a hijab and I've been wearing it for 10 years and it's just as much my identity. But if I'm asked to take it off, I will. There's plenty of times I've been asked to remove it for security reasons and I comply, and that's not even because I got arrested. I'm pretty sure God isn't going to smite me for showing my hair to comply with the laws of the country I was born in and choose to reside in, which ironically gives me more religious freedom than living in a Muslim country. Is it entirely fair that this happened, probably not. A female officer could have taken her picture. But that didn't happen, and unfortunately being asked to remove your headscarf in a non-Islamic county doesn't amount to a violation of rights in the same way as it would ...","post_message":"“I’ve worn my scarf for 12 years and my religion says that I can’t take it off. It’s not just a religious issue; this is a part of me. It’s my culture, my life and my identity.”"},{"comment_id":"1021313581261452","commenter_b":"Nasty bitch","commenter_a":"I hate to admit it but Fiorina is right, maybe the first time in her life, but........","post_message":"Haha, it's true though"},{"comment_id":"10157626698695603","commenter_b":"Stupid woman needs to be arrested .","commenter_a":"Thank God someone called the police and didn't just stand around videotaping it.","post_message":"Thankfully, the cats were not injured during the rampage."},{"comment_id":"10152908663462434","commenter_b":"And he testified she was having a good time. Three sides to every story- his, hers and the truth","commenter_a":"Everyone acts like this is an isolated case. Boys pressure girls into having sex every day.","post_message":"In interviews with police, Labrie denied raping the 15-year-old, saying he’d put on a condom for what was supposed to be a consensual encounter before experiencing a “divine inspiration,” as he put it, and leaving the room. In testimony, he said the hook-up was consensual, and that having penetrative sex with the girl “wouldn’t have been a good move for me.”"},{"comment_id":"1019686794754611","commenter_b":"Words that are meaningless. Go Hillary, really, go (away)","commenter_a":"whole as in Benghazi?????","post_message":"\"Despite what you hear, we don't need to make America great again. America has never stopped being great. But we do need to make America whole again.\"  Moments ago at her #SCPrimary victory speech, Hillary Clinton invoked Donald J. Trump's campaign."}]
