[{"comment_id":"10152910640286770","commenter_b":"Buzz off you jerk!","commenter_a":"Who is this \"Jon Stewart\"? Is he Portuguese?","post_message":"Jon Stewart: \"Donald J. Trump has no control over the projectile vomit of dickishness that comes out of his mouth every time he opens it.\""},{"comment_id":"10153258826178812","commenter_b":"women are such babies","commenter_a":"Is it necessary to show this photo? This was someone's child, a little more respect would be great. Rest in Heaven, thank you for your service","post_message":"Navy officials: Navy SEAL killed in parachute accident in California: @webpagelink"},{"comment_id":"10153221769812894","commenter_b":"Bitch u jealous","commenter_a":"I think this is wrong she was not a president she did some great things yeah but to change it from what it is is in my opinion just wrong see this is what's wrong with people they vote for stupid shit like this but don't vote for education or something we really need Gosh America where are your priorities????","post_message":"Harriet Tubman Wins Vote to Replace Andrew Jackson on the $20 Bill"},{"comment_id":"10150715134694999","commenter_b":"@username Illegal immigrants steal roughly 9 billion dollars worth of resources reserved for American citizens every year. Deporting them per our existing laws will save us a ton of money...any more brain busters?","commenter_a":"What's even more appalling is that he's polling at 39% of Republican + Republican-leaning registered voters in the latest CNN poll. ...What does this say about our country and how folks want our supposed leaders to behave? What is this acceptance of ongoing crass commentary? ...And what happened to equanimity and professionalism?","post_message":"Donald J. Trump called Hillary Clinton's mid-debate bathroom break \"disgusting.\" Frank Bruni says it's \"the rare man-child who finds that worthy of ridicule.\"  Read on in The New York Times Opinion Section."},{"comment_id":"968496726540356","commenter_b":"That thinking, @username, is why so many illegals come here. They know if they have their 'anchor' baby here, they will get to stay because that baby needs parents to care for it. More illegals come, have their babies, and get to stay...it's an endless invasion!!!","commenter_a":"If you are born in the United States and not on foreign soil like an Embassy, then you are an American, but that doesn't mean your parents or the rest of your family are!","post_message":"A few of the candidates have come out against birthright citizenship so far.  Message your Rep and make your voice heard!"},{"comment_id":"1834572823431236","commenter_b":"\"Sick\" being the operative word in this article, I and the whole world are Im sure sick of these people and their outwardly show of solidarity to the outside world to get what they want, they will never integrate, that's a fool's paradise, so all those do gooders, I hope you are happy with what you have welcomed into Christian Countries. Im off to celebrate CHRISTMAS and Happy Christmas a million times over to these sick perpetrators of evil, may our God show no mercy on you.","commenter_a":"Insane, on the highest level. How dare they exploit children like this.","post_message":"Sick parents say goodbye to their children before one of them blows themselves up in suicide attack."},{"comment_id":"919439784782166","commenter_b":"She is a no brainier!","commenter_a":"Sarah Palin has a mental drought that no reservoir will cure.","post_message":"Sarah Palin is here, and she's got some wisdom for y'all."}]
