[{"comment_id":"10153004075042061","commenter_b":"These magnificent creatures were never meant to be made to stand on their heads or do any of the other ridiculous tricks they're forced to do.","commenter_a":"Stop hitting elephants.","post_message":"An elephant attacking your car - never a good thing: abcn.ws/1LxMzPP"},{"comment_id":"10154481500504199","commenter_b":"Your mom is overrated. #yesidoknow","commenter_a":"Overrated.","post_message":"Sorry, but we have to ask...  Who's planning on seeing Star Wars: The Force Awakens?! [via.q13fox.com/Iat0q]  Photo manipulation by Mara Leite Photography"},{"comment_id":"10153661295271955","commenter_b":"You have the hots for Hillary... admit it already :)","commenter_a":"Weak weak weak.","post_message":"BEING BORING: CBS ENDS DEM DEBATE 7 MINS EARLY"},{"comment_id":"524738424381756","commenter_b":"As i said before i will not debate with obama supporters. All they do is cry about being poor and then vote for people to make them worse instead of seeing a man whos going to build our country full of jobs. Then again many of Obama's supporters are on welfare anyway so theres no speaking to any of you. You are the problem","commenter_a":"This parent is teaching her kids so wrong. She needs to be having her to hold up a Trump/Pence sign for a better future for her and her child. No one wants to live under the reign of Obama anymore and we definitely don't want to have any parts of Hillary Clinton so she can continue the mess that he's made","post_message":"This 4-year-old was inconsolable when she found out Obama was leaving office  she wants four more years!  #MicBrights"},{"comment_id":"10153594366538352","commenter_b":"Kiss my black ass old lady!","commenter_a":" Wait let me get this straight well never mind because I know if he was black it would've been reported when he took a crayon from school because that's how deep they dig! #BlackManCantFartWithoutBeingCalledAnAnimal","post_message":"Biker killed in Waco shoot-out was a law-abiding decorated Vietnam veteran with Purple Heart, records reveal – despite police claims that all 9 dead were criminals"},{"comment_id":"1000660886660326","commenter_b":"Send her to Pluto to cool off!","commenter_a":"I bet her mother is sooooo proud...","post_message":"'I'm not really ashamed'"},{"comment_id":"1128296473875405","commenter_b":"Hillary is a Crooked lying Killer, Put Her in Jail & Make America Safe Again!!!","commenter_a":"Quanell X, leader of the New Black Panther Party in Houston, Texas, said this week on a local news program that black Americans should examine Donald Trump outreach to the black community and the relationship that black voters have with the Democratic Party. @webpagelink","post_message":"What you need to know about the \"alt-right,\" and Donald J. Trump connections to white supremacy and hate groups: hrc.io/2c3kLXT"}]
