[{"comment_id":"10152835488861051","commenter_b":"What a bitch","commenter_a":"What kind of a person hurts an old lady. Hope she is sued . She needs jail time","post_message":"This 71-year-old woman tried to park in a handicap spot in the Walmart parking lot. That's when all hell broke loose."},{"comment_id":"10154883181056509","commenter_b":"Please be honest... Why are 37% of Federal prison sentences illegal immigrants? Tell American's the $100 Billion illegal immigration cost in tax dollars each year, this would pay the college for American citizens. The $12 Billion per year Illegal immigrants cost California taxpayers. The $Trillions Immigration Reform will cost taxpayer's in benefits due to the average 10th grade or less education level of illegal immigrants who will be on additional welfare for the next 50 years, will be receiving more free or low cost healthcare, which is breaking the bank of middle income families now. Tell them that 5,000 come in on a daily basis. Tell them about the identity theft of illegal immigrants who use stolen Social Security numbers to take American jobs and the IRS admitted to Congress that they did not notify the person or business that the illegal alien was again breaking laws and ruining American ...","commenter_a":"Speaking of an etiquette guide to Muslims, what does this particular group of 1.6 billion people believe about homosexuality?","post_message":"There are 7 billion people in the world. And a full 22% of them -- 1.6 billion -- are fasting from sunup to sundown. Every day. For an entire month."},{"comment_id":"10154303194092042","commenter_b":"Id take anyone over Hillary. Shes a liar, a deceiver and manipulator and its all on record.","commenter_a":"That is what Donald Trump gets for once again trying to go after Hillary Clinton. If he keeps it up, well then, it's absolutely over for him. No one, I mean, NO ONE, would ever trust Donald Trump as president of the United States. It just isn't going to work.","post_message":"#DeleteYourAccount: Hillary Clinton has had enough of Donald J. Trump's comments on Twitter."},{"comment_id":"761877867244155","commenter_b":"STFU Shannon....stop raising a queer!","commenter_a":"A lot of folks are making \"wink wink\" comments but she is a sexual predator and you might feel differently if it were your son who was involved. I hope she gets treatment and does not teach again. Find another profession--I can think of one.","post_message":"The running joke was allegedly: \"Who is Ms. Altice sleeping with now?\""},{"comment_id":"10155438408395354","commenter_b":"If she had a brain, she would be dangerous","commenter_a":"she can also take credit for being a slut.","post_message":"\"sooooo bad a$$ Senator Cottons voicemail box is fulllllllllll!\"  ....we didn't forget the apostrophe, Miley did."},{"comment_id":"10156742074775354","commenter_b":"the millennials need to really research socialism & check out the countries that have it now & they are worse off than ever ...want to wait in lines for food? be lucky to get a loaf of bread, some milk & maybe a little veggies or fruit...guess they would change their minds if they really knew what that would do to this country....jobs worse, financially drained families from such high taxation etc...healthcare would be ...forget it...more deaths ...socialism is plain & outright destruction & more misery than this country could stand....then we'd have bigger problems with the refugees forcing their crap down our throats...is that what you want you idiot millennials?","commenter_a":"This millenial would like to thoroughly dissociate himself with most of the rest of the generation.","post_message":"GENERATION SANTA CLAUS?"},{"comment_id":"1773738762840165","commenter_b":"Yea but she doesn't wear that dress well as Melania .Petty old lady","commenter_a":"This is just tacky and remarkably low class.","post_message":"10/10 burn. 🔥"}]
