[{"comment_id":"10152963504506130","commenter_b":"What was she thinking? Dumb model!","commenter_a":"Well they can't fire her now that the world is laughing at it. PR, people, PR.","post_message":"Whoops."},{"comment_id":"10154165590671746","commenter_b":"Yes ! Now the lazy legal Immigrants have no excuse of not being able to find jobs","commenter_a":"Please restaurant owners get new workers","post_message":"Two South Shore restaurant owners were put on notice by their staff either early Thursday morning or Wednesday evening: Workers would be no-shows for the 16th \"out of protest.\""},{"comment_id":"10152853316636051","commenter_b":"i am with william ship all the illegal immigrants back were they belong and out of here let them do it legally then the trash want make it \\\\","commenter_a":"Deport them all. No hearing, no delay! They broke the law, boot their butts out. Seal the boarders, with deadly force authorized.","post_message":"ICE just rounded up and arrested more than 2,000 immigrants over the course of a five-day operation."},{"comment_id":"10153821325285329","commenter_b":"Beth Carpenter","commenter_a":"Arthur Smith -- perhaps Tiona might be interested in this.","post_message":"He says he plans to read every last book. (via BuzzFeed Trending)"},{"comment_id":"1252197194828825","commenter_b":"One of the 2 things I don't like","commenter_a":"Smokers are disgusting","post_message":"WARNING TO PET OWNERS: It's not just second-hand smoke that's harmful for your four-legged friends. Pets are also at risk for being exposed to residue that lingers on skin, clothes, carpets, and other household items."},{"comment_id":"1701440090108890","commenter_b":"They jeer at Cruz. Call him \"politician.\" What they surely remember is the way Cruz sucked up to Trump in the early part of the campaign. \"Lyin' Ted\" sticks because Cruz seems two-faced.","commenter_a":"All Cruz did was bash Trump. What a looser.","post_message":"\"He's gonna put a liberal on the Supreme Court. He's going to take away your Second Amendment rights. This man is lying to you and he's taking advantage of you.\" -- Ted Cruz to Donald J. Trump supporters in Indiana today"},{"comment_id":"1202757773119671","commenter_b":"Yes Ivanka Trump would not be anywhere without her rich daddy!","commenter_a":"If it was not for her family name no one would listen to a word this really stupid spoiled brat has to say. You actually have to do something or have accomplished something to be a voice worth listening to and this twit as done nothing. Additionally hanging around with a child molester like Dunham shows just how pathetic she is.","post_message":"Chelsea Clinton tried to shame Ivanka Trump on live TV, but it immediately blew up in her FACE! This proves that Hillary Clinton has NO CHANCE!   Let's get 3,000 SHARES to show that we don't need a Clinton anywhere near a position of power!"}]
