[{"comment_id":"687880108038609","commenter_b":"of course they arn't all murders and gang members that's why the wall will have a door or did you miss that part in the cnn chopped up version of that speech? the ones who want to be Americans can stay the rest can f off.","commenter_a":"These comments are disturbing. These are parents, children, families...not murders, drug dealers or rapists. Instead of \"building a wall\" or treating them like shit we should be coming together with Mexico so that they don't need to come here. They need help, we have a problem, so why are the two countries not putting their heads together to figure out a way to HELP","post_message":"Thousands of Central American children and families are arriving in Texas."},{"comment_id":"1814189528815874","commenter_b":"Hillary is use to debates Trumps not and can't even deal with a woman with a baby during his speech","commenter_a":"Wait until the debates, when Hildebeast turns into a shrieking harpy on stage when confronted about her many, many schemes, scams & failures. Take a poll then.","post_message":"A new Fox News poll shows Democratic nominee Hillary Clinton leading Republican nominee Donald J. Trump 49 percent to 39 percent among likely voters, while 61 percent of respondents say they consider Clinton to be dishonest."},{"comment_id":"10153263957778690","commenter_b":"I can't believe that I was able to watch this! Sometimes I can watch videos on here and sometimes not.","commenter_a":"the dictator in his fine living room....the syrians refugees knocking doors around the world hungry and cold...wtf?","post_message":"Syria: Broken Nation. To mark the four year anniversary of the conflict in Syria, Al Jazeera English will feature special coverage throughout the month of March.   In this film from June 2013, we follow Syrian exiles who risk their lives smuggling essential supplies to those fighting the regime inside Syria."},{"comment_id":"10152570556535496","commenter_b":"Oh that's right. IT'S ALL ABOUT THE MONEY!","commenter_a":"Some of you should mind your own business and stop throwing judgement at how others live their life.","post_message":"Accumulating reports are suggesting Bruce Jenner is transitioning to female and plans to document the change for a TV docu-series later this year.  See more: @webpagelink"},{"comment_id":"537404189787632","commenter_b":"YOU HAVE FORGOTTEN THAT YOU ARE NOTHING MORE THAN AN ACTOR WITH AN OPINION--AND NOT A VERY INTELLIGENT ONE-MAYBE YOU WOULD LIKE TO JUMP ON THAT PLANE THAT SO MANY OF YOU ACTORS ARE GOING TO BE ON IF TRUMP WINS???!!!!NANCY","commenter_a":"He's a self important cunt, that's what he is. Like his opinion matters. I like his acting, but when it comes to a political opinion, I'll form my own and he can fuck off with his.","post_message":"Robert DeNiro is a ________________."},{"comment_id":"831331320235298","commenter_b":"Go back to Italy ya wop","commenter_a":"Reveal his name.","post_message":"A soon-to-be police officer just posted this comment publicly to our page. Is this a thinly disguised threat of violence against citizens? Doesn't sound like this guy should be allowed to roam the streets with a loaded gun in the near future."},{"comment_id":"569607529880232","commenter_b":"Karma is a bitch!","commenter_a":"Reap the whirlwind...","post_message":"The students he ripped off are about to get their revenge."}]
