[{"comment_id":"999687850098947","commenter_b":"FGM - Female Genital Mutilation. The stats about it: @webpagelink","commenter_a":"The awkward moment where liberal values clash with Islam and no one wants to stand up for the gay man to avoid insulting Muslims...","post_message":"“My religion is very clear about what happens to gay people...\""},{"comment_id":"1077069452383729","commenter_b":"@username she better be overreacting","commenter_a":"Yo this made me think if that shyt gonna hurt @username","post_message":"She's not ready for a tattoo"},{"comment_id":"10153188126467293","commenter_b":"What is this, then? \"That multicolored background is not gonna save you.\"","commenter_a":"That qualification was executed with a double standard.","post_message":"For all those who doubt the women's accomplishments."},{"comment_id":"1149152748439068","commenter_b":"Kegels engaged automatically","commenter_a":"not a big white shark, just a fox shark","post_message":"Just stay calm, nothing to be afraid of ..."},{"comment_id":"1100128256666646","commenter_b":"The refugees are not the terrorists. As more information becomes available, the assumption that they are looks more and more ridiculous. Also, the vetting for the small percentage of refugees the US has been willing to accept is much stronger than anything happening in Europe at this time. Shame on our Governor. She is smart enough to know better.","commenter_a":"Governor Baker of MA has stated they're not accepting Syrian refugees. When will we hear this from you, Governor?","post_message":"President Obama has issued a proclamation ordering the lowering of flags on all public buildings and grounds to half-staff immediately and until sunset, Thursday, November 19, in honor of the victims of the terror attacks in Paris.  Governor Maggie Hassan has issued the following statement:  “I continue to join all Granite Staters and all Americans in mourning with and sending our thoughts and prayers to the people of France following these horrific terror attacks. State emergency management officials and the State Police will continue working with national Homeland Security, the FBI and local police departments to exercise extra vigilance and ensure that all necessary security precautions are taken in New Hampshire. As people across the country and the world stand together in support of the French people and one another, these heinous acts of terror will only strengthen our collective resolve to rid the world of violent extremism.”"},{"comment_id":"331807290546859","commenter_b":"Dump trump and his bitch wife","commenter_a":"trumpers are ALL bullies! Only bullies attack a man 4 against 1, not to mention punching a poor old dog.... Their mothers must be so proud","post_message":"Trump, your 'bad hombres' are right here.  Shared by Occupy Democrats. Video credit: ABC 7 News - WJLA."},{"comment_id":"895578827165435","commenter_b":"nothing ever happens to her for her lies!!!!","commenter_a":"Keep digging, @username.","post_message":"As the Speaker notes— Having finally heard from Secretary Clinton yesterday, we are left with more questions than answers. These public records at issue are broader than Libya and broader than Benghazi. The Secretary of State has enormous responsibility and jurisdiction and the public, the media and Congress have a legal right to access these public records without impediment."}]
