[{"comment_id":"1040857019285867","commenter_b":"Go back to Cuba shitstain.","commenter_a":" II Bill of Rights. A well-regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed........................ . MOLON LABE (Come And Take Them). Obama, you pussy, from my cold dead hand!. . \"A well-regulated militia being necessary to the security of a free state, the right of the people to keep and bear arms shall not be infringed.\" \"I ask, sir, what is the militia? It is the whole people, except for a few public officials.\" George Mason, in Debates in Virginia Convention on Ratification of the Constitution, Elliot, Vol. 3, June 16, 1788.. NOT ONE of the new obama regulations will prevent a terrorist or thug from securing a weapon and using it ... That is the issue.... This is just more political BS for resume enhancement..... Terrorist and thugs DO NOT buy their ...","post_message":"This is only the beginning folks..."},{"comment_id":"10154795972864456","commenter_b":"Happy Birthday","commenter_a":"Happy birthday 🎂🎂❤️❤️🎈🎈","post_message":"Help us wish Ms. Effie of Union Springs a happy 108th birthday!!!!"},{"comment_id":"10154485481559641","commenter_b":"What @username said ,is d same as oral sex...@ @username,gay pple does disgusting things as such too","commenter_a":"ORAL FECES SEX ..The Insanity, of those who participate in the ingesting of feces want acceptance for this \"NASTY\" diseased behaviors. Why because it makes for sickness, spreads a few disease`s to other humans that are deadly and dangerous disease`s. Calling the practice of ingesting feces \"normal and natural\". Tainted Blood, Fecal Infections and Perverted. Science tells us humans not to injest one anothers feces. The spread of disease is everyones business. Equality or Insanity.","post_message":"\"This will be the 22nd marriage equality bill in Australia and we still haven't got (LGBT) marriage ... what are we doing wrong here?\""},{"comment_id":"2076295639262230","commenter_b":"Who is Jill Stein?????","commenter_a":"Throw your support behind TRUMP all of you Bernie supporters!!!!","post_message":"Breaking News: Democratic National Committee Chairwoman Debbie Wasserman Schultz will not preside over her party’s convention in Philadelphia following email leak suggesting anti-Bernie Sanders bias, Fox News confirms. @webpagelink"},{"comment_id":"587553231404572","commenter_b":"Obama is putting up a higher fence around the white house this summer because people keep climbing it!!!! what about our borders?? WE NEED A WALL!!! WE NEED DONALD TRUMP NOW...","commenter_a":"You don't need a political decoder ring to understand Donald Trump he's a straight talker who speaks from the heart who's the only true outsider funding his own campaign and he's set the agenda on everything that matters. Indiana show your support and get out and vote Donald Trump for the republican nominee. If your standing with Trump your standing FOR America! TRUMP NATION 2016! # never lyin ted!","post_message":"I will not let you down. Lets MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1302393583116762","commenter_b":"@username The woman brings up the fact that \"She voted For Trump \" herself","commenter_a":"Why does all the evidence in this video seem half baked @username? I wanna know exactly what was said before the video snippets as to why this woman feels shes being discriminated against in the first place!","post_message":"This Trump supporter went on a racist rant in a store while another customer recorded her meltdown over \"reverse racism.\""},{"comment_id":"10153320570936509","commenter_b":"The $2.1 billion isn't what I'm talking about...., keep reading.","commenter_a":"Tax break? He promised not to raise taxes on anyone making less than $250,000 then slams Obamacare down the throats of every American which is one of the largest tax increases in the history of our country aimed directly on the shoulders of the \"middleclass\".","post_message":"Many in the middle class, particularly the single and the elderly, won't see any tax breaks under Barack Obama's Middle Class Economics plan: @webpagelink"}]
