[{"comment_id":"10153528631451955","commenter_b":"What a cunt! I hope she ends up in jail!","commenter_a":"She's been divorced 3 times. If god forgave her for that 3 times, he'll forgive her for issuing a gay marriage license once haha","post_message":"DEFIANT: Judge orders KY clerk to appear in court after she again denies gay marriage licenses..."},{"comment_id":"10152692190456636","commenter_b":"Because of course it's the woman's fault! We are female, wear thongs and stiletto heels so obviously that translates to \"I want sex and will have it with anybody and my screams of no & stop obviously mean, yes!\" And if you go to court they ask questions about your underwear and what we're you doing out. Never ask the rapist what he was wearing or why he thought you walking down a street by yourself translates to brutally attack and rape me. It's 2015 the world has come far but on certain things importance ranks zero.","commenter_a":"road","post_message":"'I witnessed this years ago, after I was raped myself'"},{"comment_id":"10154716215431800","commenter_b":"Better? Human Rights just went out the door the moment Trump was elected, something that America has practiced for decades and what the world envied us the most....Hypocrisy much?","commenter_a":"oh yeah, I heard President Duterte say Trump was just like him. Changing the world...but is it for the better?","post_message":"Donald Trump, fresh off Hair Force One, meets President Obama at the White House."},{"comment_id":"1002745926520222","commenter_b":"HITLERY, MURDERS AMERICANS IN THE WOMB!!!!","commenter_a":"Stop Hate Dump Trump","post_message":"WATCH LIVE: Donald Trump speaks at his second campaign event, this time in Eau Claire, Wisconsin. Earlier in the day, he spoke to supporters in Valley Forge, Pennsylvania."},{"comment_id":"10154527348963352","commenter_b":"Kiss his ass","commenter_a":"I agree with him!","post_message":"RUSSELL SIMMONS GOES OFF ON OBAMA WITH NO KIND OF RESPECT! BASICALLY SAYS OBAMA AIN'T SH*T! (PHOTOS) @webpagelink"},{"comment_id":"10154128479435673","commenter_b":"She needs to go. and you can go to....","commenter_a":"Too little too late Jack","post_message":"The decision not to seek prosecution of Hillary Clinton is plain wrong. I have joined several of my colleagues to do something about it."},{"comment_id":"506647236198456","commenter_b":"That will get her dinner at the White House.","commenter_a":"I want proof. Then it's not just a vague fb post...","post_message":"Beyonce Posted Letter Hours Before Dallas Shooting, Calling Blacks to  Against Police, That Murder Should Not Go   CHARGE HER WITH INCITING VIOLENCE!   Let's get 5000 SHARES if you think she should be held accountable!"}]
