[{"comment_id":"10154927346797577","commenter_b":"Dose right here john make u wish u were born female","commenter_a":"Sweden should book these cunts two seats each for return home to goat fucksville, one for them n one seat beside them for their amputated cocks. U no im right so u lefties stay to the fucking left.","post_message":"5 Afghan refugees convicted of raping a young boy will not face deportation because their “homeland is too dangerous.”"},{"comment_id":"10153355011548984","commenter_b":"That mayor is an idiot.","commenter_a":"So what would you call someone who would break out the windows of someone elses property or burn someone elses businesses or homes?","post_message":"Both Obama and Baltimore's mayor have called the rioters by a one-word name that has generated controversy..."},{"comment_id":"10154357824606037","commenter_b":"Trump doesnt want muslims in the US..period..so","commenter_a":"Trump... ISIS...Today","post_message":"A man armed with guns and explosives told police he was in the area for West Hollywood's gay pride parade."},{"comment_id":"10153950458738690","commenter_b":"Actually another problem is that we have a long border with Afghanistan which is called Durand Line and Afghanistan does not accept it as an International Border and those terrorists move in between both countries and attack and then we blame to each others.","commenter_a":"This the same Pakistan my country Nigeria, training army to fight terrorism, have Pakistan already solved there Taliban terrorist? Terrorist are political party, negotiations is the solution to terrorism.","post_message":"At least 12 dead as suicide bomber on a motorbike crashes into government office."},{"comment_id":"10153833449353145","commenter_b":"Ignorant uniformed woman!","commenter_a":"Totally stupid. It's an illegal drug! Small amounts lead to large amounts. Bad enough there is a jerky a.. Attorney who is trying to legalize marijuana in Orlando. Get a grip. Bad enough this state is number one in the country with the worst drug problem!!","post_message":"This would be a major change in Orlando, but is it a step in the right direction or should leaders nip this in the bud? Let us know what you think."},{"comment_id":"1753310708283376","commenter_b":"F all them towel heads and illegal immigrants. It's time to Trump all your dumb asses","commenter_a":"What did you expect of an ILLEGAL, MUSLIM, ALIEN who should be IMPEACHED AND TRIED FOR TREASON AGAINST THE USA! HOWEVER, the ELECTED OFFICIALS WILL DO \"NOTHING\" AGAINST THIS \"TERRORIST\"!","post_message":"Obama Admits He Is Embarrassed By Americans [VIDEO].  He is the worst president in the history of our country.  Do you think Obama is the embarrassment?"},{"comment_id":"370743173113977","commenter_b":"Should have thrown the book at her!!!","commenter_a":"Hell yes she deserved it!","post_message":"Did she deserve that?"}]
