[{"comment_id":"10154089965446336","commenter_b":"Yeah, lice likes very clean hair. If you put products in their hair it's likely they won't get it. Oily hair care products are","commenter_a":"It's not super lice it's called...ignorance. Schools inform by sending a note that lice has been found in the classroom. The person is not identified at all..not even to the parent. Infested child goes untreated. Why? The same reason some are abused and some are not, the same reason some parents care about their children and others don't. Children are going untreated and/or not treated properly. This has been going on for years.","post_message":"What can you do if your child is affected?"},{"comment_id":"10152512178746316","commenter_b":"Most doctors are not looking out for you, just the bottom dollar. Research apricot kernels","commenter_a":"Cannabis oil all the way! Id never ever do chemo","post_message":"Radiation and surgery provide more burden than benefit, destroying prostate cancer patients' quality of life in their final years. What would you do if you were diagnosed with cancer? @webpagelink"},{"comment_id":"10154111775125779","commenter_b":"Haha She landed Russell Wilson, she isn't going anywhere.","commenter_a":"We all know how this is going to end - she's going to go back to the Future.","post_message":"Ciara dropped her $15 million defamation suit against her ex-fiancé Future Friday, a year after the singer first accused the rapper of slander."},{"comment_id":"10153690719066130","commenter_b":"Andrew Ritchie","commenter_a":"Woof, there are some dumbass people on this feed. The benefits outweigh the risks.","post_message":"This vaccine is drastically reducing HPV cases in teenage girls, but some parents can't get over the stigma."},{"comment_id":"1369855736388104","commenter_b":"Those women are vicious hacks for hillary.they don't care what she did against America or the corruption & lies they are all part of the corruption .","commenter_a":"What a waste of her time. They just want their ratings to increase with all the drama","post_message":"The claws really came out..."},{"comment_id":"1358974884162256","commenter_b":"All these fat women suddenly come in and attack her breasts? Like, I can see the v necks but in this day and age, you call that too much? Stay jealous.","commenter_a":"You look amazing! Good for you!","post_message":"She was drinking four litres of Coca-Cola a day  (Via Daily Mail Australia)"},{"comment_id":"10153774397117098","commenter_b":"No!!!! SHE IS A LYING SKANK!!!!","commenter_a":"What the hell? So these dudes were sleeping with their coworker's underage daughter? That is disgusting.","post_message":"#BREAKING...  What we're just learning on KRON News at 5 p.m."}]
