[{"comment_id":"1307978642581533","commenter_b":"@username,you're lying, white folks were looting,breaking in stores,starting fires at the riots especially in Ferguson. As a matter of fact,the cops had pulled over a pick-up truck with 4 white guys in it with molotov cocktails. And this was Ferguson. In Atlanta, 10 white people were arrested for trying to block traffic,they were the first to do it. During the L.A. riots, white girl made the front page. She was running out of the store arms full of clothes. And you have never heard a black person say they burn and loot because of their culture. So you're lying again. Speak on the whites that loot and burn when their favorite team loses. Stop acting like whites are not out here doing the same. Oh boy, I should have known you was going to bring the President into the post,typical of your kind. Always finding a reason to blame him. ...","commenter_a":"Black on Black crime strikes again. No outrage as usual by BLM or anyone in the racist black groups of Cop haters. Where's the concern for this boy ? No concern since it was a \"Culture\" killing ? Heard that whites don't understand their \"Culture\" I understand you folks don't give two shitts when it's black on black crime.","post_message":"A 3-year-old boy on a shopping trip with his grandmother was shot and killed during an apparent road rage incident, police said. @webpagelink"},{"comment_id":"10155262901820231","commenter_b":"Fraud!","commenter_a":"He's just a man and not god","post_message":"Social media: 1  Ceflo Dollar fundraising for a private jet: 0"},{"comment_id":"10152630103907894","commenter_b":"Ladies love you to death but clearly you are being unfair in this matter 70 to 80 percent of custody battles in this country land in your favor whether the father is fit or not whether he is financially stable or not so for you guys to be sitting here some type of quote unquote outraged about this is ridiculous. knock it off.","commenter_a":"Some women needs to be careful who they sleep with","post_message":"Ludacris Wins Primary Custody of His Daughter"},{"comment_id":"10153867338207212","commenter_b":"And she's voting for Hillary. Smh","commenter_a":"She's such a cute lady- I wanted to hug her!!","post_message":"Thousands of Oklahomans are voting early, including a 100-year-old woman who has a message for young voters. #News9"},{"comment_id":"10153612165593984","commenter_b":"My, my, my....Welcome Home....but, don't ever come back!!!!","commenter_a":"Way to go kenya","post_message":"Wow. These 10 million Kenyans just sent Obama a VERY bold statement about his visit... they aren't pulling any punches.  Obama needs to pay attention to this...  Good for Kenya..."},{"comment_id":"10153377171751320","commenter_b":"scumbag","commenter_a":"When he is in need, they should all turn their backs on him again,but for good. He stinks as a Mayor . 👎🏻","post_message":"ACTIONS SPEAK LOUDER THAN WORDS... NYPD Officer Brian Moore was shot in the head, killed in the line of duty and Mayor de Blasio was a no show at his death announcement. Click here to read why he said he wasn't there: @webpagelink"},{"comment_id":"1619826891648925","commenter_b":"@username Killary's hips are evidently widening. Must be all the hot sauce and watermelons she stashes in her pants.","commenter_a":"Why I'm backing D.T., he's against the establishment, can't stand Obama & Hillary, called out lying Cruz, wants America first, he doesn't come from a political family, treats his 30,000 employees with respect, supports law enforcement, will put a border up, deal with illegals & radical muslims, doesn't act like a scumbag politician, he's not part of the \"Good Old Boys\", helps military and families, great family man, very passionate about this country & the citizens, doesn't take BS from anyone and wants to Make America Great Again! #VoteTrump2016","post_message":"FLORIDA -- THANK YOU --- WE CAN WIN! Lets MAKE AMERICA GREAT AGAIN!"}]
