[{"comment_id":"10153573375216509","commenter_b":"Take away her license and fine/jail her","commenter_a":"Very cruel person","post_message":"A Texas veterinarian posted a proud photo to Facebook of herself smiling as she dangled the limp body of a cat she allegedly shot with an arrow. The vet said it was a feral tomcat. People who saw the post were outraged. Now, animal rights activists are pushing for charges.  @webpagelink"},{"comment_id":"817688164952017","commenter_b":"Chesimard is a scum pig who needs to be extradited back to NJ to finish her punishment.","commenter_a":"And they wonder why there is racism in American. They are the worst and the rest of us are reacting to this sort of crap and the disproportionate numbers of black's in prison. Clean up your own house first and quit committing crimes and we might actually start to listen. Until then FY.","post_message":"[Video] INSANE LIST OF DEMANDS BY BLACK COLLEGE STUDENTS Includes Naming College Hall After Notorious Cop Killer"},{"comment_id":"1562229620730818","commenter_b":"Whoopi needs to zip her mouth too!!!","commenter_a":"About time","post_message":"I love ABC for doing what's RIGHT!   Rosie O'Donnell & Whoopi Goldberg have no place on TV."},{"comment_id":"432105150316631","commenter_b":"Haul her a•s to jail ???","commenter_a":"I would love to jerk the whole outfit off. Would stop a lot of shoplifting for a start😡👳🏾","post_message":"NO SHARIA LAW IN AMERICA!"},{"comment_id":"10154653842272639","commenter_b":"No they don't, they just have a problem with a stupid woman lying and telling everyone it's Alternative Facts..... You are a White Neo Nazi KellyAnne and that is what the problem is.....You don't have power, you have NOTHNG!!!!!","commenter_a":"No we have a problem with fact challenged people","post_message":"“It turns out that a lot of women just have a problem with women in power,\" Kellyanne Conway said about the historic Women's March on Washington."},{"comment_id":"10152614023801519","commenter_b":"Paula - The money spent by Democrats and Republicans on the Senate election was about equal - Big Corpoarate Money did not win the election for Republicans. The major reason was that 70% of Americans think the country is heading in the wrong direction under six years of the Obama administration. The WSJ Editorial Democrats vs. the Middle Class shows the devastating impact of Obama and Democratic Party progressive policies over the last five years on the middle and lower income class. Progressive Policies buy votes, but destroy prosperity. Anybody with incomes less than $70,000 has been devastated with losses of around 6% to 8% while inflation lowers buying power. @webpagelink","commenter_a":" 12-Step Program for Recovering Democrats is a WSJ Editorial to help Democrats make a recovery from the shock of the last election. Liberals call Republicans names when they have no rational argument to make. @webpagelink","post_message":"Jon Stewart lines 'em up and knocks 'em down..."},{"comment_id":"989615211072231","commenter_b":"Awesome","commenter_a":"WTG BOLTS! :-) :-)","post_message":"GO BOLTS! Tampa Bay Lightning wins Game 2 of the #StanleyCupFinal, ties series 1-1!   WOOOOOOO HOOOOO! Missed a moment? Check out the game details: @webpagelink"}]
