[{"comment_id":"588976734614882","commenter_b":"She couldn't sexually satisfy ol slick willy either","commenter_a":"Don't want her in the War Room...Remember Benghazi!!!","post_message":"Ahead of President Obama's speech to the Democratic National Convention tonight, The White House released excerpts touting Hillary Clinton's experience."},{"comment_id":"10153247740094411","commenter_b":"Suck it up mother fucker","commenter_a":"När Israel skrotat alla sina atomvapen, har dom först då, rätt att ha trovärdiga synpunkter.","post_message":"BREAKING"},{"comment_id":"10156983080310354","commenter_b":"throw his ass in prison HES NOT FIT TO WALK STREETS WITH REAL AMERICANS","commenter_a":"Only 5 years?! When he gets out of prison,strip him of his Texas residency,send him to live where he belongs ,Washington D.C.,with all the rest of the anti-American felons.","post_message":"You heard about this, right?"},{"comment_id":"10153716144117577","commenter_b":"Your talking bullshit.","commenter_a":"I am an athiest so it's all bullshit to me anyway ... but you god nuts hate the pope because he is too close to what (if he did exist) christ would have been like .. do you not remember the part in the bible where jesus said \"there is more chance of a camel passing through the eye of a needle than a rich man getting into heavn\"? .. what about his whole ghandi/ john lennon peaceful hippiness .. \"let he who is without sin cast the first stone? .. and what about how jesus spent a lot of time hanging out with the poor, sick and prostitutes .. and he fed them and helped them .., some of you extreme conservative \"christian\" extremist terrorist CUNTS should actually read your bibles once in a while ... O and by the way ... if you are a good \"christian\" why ...","post_message":"Pope Francis has strong ties to socialism and even communism and is helping to destroy the faith of the Catholic Church from within, as Infowars journalist Kit Daniels explains."},{"comment_id":"630413113793105","commenter_b":"okay so heres why i still disagree, especially in regards to syrian refugees. the poison example is still not a good one, because no damage that isis can do to the country is comparable to the damage that poison will do to a persons body. it would be tragic to lose people in attacks, but it wouldnt be strictly \"devestating\" to the country. the united states stregnth and resolve would be largely unchanged. refuting refugees is stupid, and here is why i think so. for one, the refugee vetting process is the most extensive and thorough process that is in place, if any sort of check is going to detect a potential terrorist, this is the one. refugees take about two years to finish vetting and finally get relocated, and they dont even get to choose where they go! they get sent to a country that is assigned to them. ...","commenter_a":"@username thoughts","post_message":"Donald J. Trump tweeted about the case, saying Bonifacio Oseguera-Gonzalez \"should have never been here.\""},{"comment_id":"665165626971083","commenter_b":"Never Clinton!! She praised Robert Byrd A known KKK LEADER AND KLAN RECRUITER and a complete liar and flip flopping scumbag!! And her SEXUAL PREDATOR Husband need to be put in jail!! We need to set limits on how long you are allowed to run in government and all these establishment criminals that keep getting elected and ruining our country on both sides need to go !!!!","commenter_a":"I don't believe that !!","post_message":"Unless things change extremely fast, Clinton will officially lock up the Democratic nomination after the California primary. Will you be supporting her this November?"},{"comment_id":"10154662205964575","commenter_b":"Good she needs to be arrested!","commenter_a":"Yes this girl has done this before. She willingly is w him! She needs to be charged for running away over and over again. And it's her mothers vehicle. Something needs to be done!","post_message":"UPDATE: The teen at the center of the Amber Alert has been found safe, according to police.  --------------------- An Amber Alert has been issued for a for a missing 17-year-old girl who authorities believe is in extreme danger.   Police believe an escaped convict out of Hancock County, Dustin Fisher, 20, abducted the teen. Fisher is also considered a violent sex offender."}]
