[{"comment_id":"10154498468358690","commenter_b":"Julia I was having discussion with other posters in the same tone.. You should be ashamed that you cannot tell the difference . Who do you think you are to tell others ? Get off my post ! Then hit the block button . Theres a good little troll.","commenter_a":"What nonsense. The trouble began when Islam became the majority religion. ISIL is just a mixture of many Islamic terrorist organizations. The mistake the US made was leaving all the weapons and armory behind thinking Iraq would use them to fight them , instead a lot of the Iraqi army used them against eachother.","post_message":"The Iraqi town of Saadiya's problems began after the 2003 US invasion."},{"comment_id":"1705936436359891","commenter_b":"Oh shut up! The murdering, lynching KKK will be around to continue their hate. It would be great for you all to go back where you came from. The Indians would love it!","commenter_a":"so Black lives matter can protest anywhere and everywhere, but no other group can.hum? not that i agree with the kkk but they do have the same rights as Black lives matter.","post_message":"By the time this KKK rally was over, blood was on the sidewalks and ambulances were on the way:"},{"comment_id":"959095867528667","commenter_b":"I want to hear the story too","commenter_a":"Trump fix SS","post_message":"DML discusses the best way to fund Social Security, and how the media disrespects veterans.  Please watch and share."},{"comment_id":"10155025508527577","commenter_b":"Ya genius. We don't want to pay for more illegals shit.","commenter_a":"maybe he just doesnt want to pay for someone else shit .. just like any normal person doesnt want to pay for anyone elses shit .. especially for something as stupid as a wall . didnt work for china back when they made one what makes you think itll work today.. there will always be someone smarter than the measures put in place to stop advancement ... explosives arent hard to get in mexico especially if you are a well connected cartel ... people will be getting killed while the wall is being built kidnapped and the likes the wall if stupid for so many reasons .. just increase personnel and the available resources to combat the problem and it will in turn become easier to manage the flow of illegal immigrants coming in ... and if you think we as the u.s. government doesnt profit off cartel youre dumb","post_message":"The Mexican President was funded by the Juarez Cartel and that’s why he is against the Trump border plan:"},{"comment_id":"10153527468435399","commenter_b":"Now,that's got to be a bunch of crock,they don't even know that hag.","commenter_a":"Why is a rally in Peru for a clerk in Kentucky hard to fathom? Does Rob Schneider work for this firm?","post_message":"According to a report by ThinkProgress, the rally never actually happened."},{"comment_id":"569672173222127","commenter_b":"Why does this women even receive a paycheck? I'd rather they give that money to a homeless woman in front of a 7-Eleven. You'd probably even get smarter conversation.","commenter_a":"Wasting your breath talking to these Trump members on his staff. They're like the movie The Stepford Wives! I think they all got their brains reprogrammed to say exactly what Trump wants & needs them to say to keep him looking sane!! It's scary!!","post_message":"\"'Alternative facts' are not facts. They're falsehoods.\" Sean Spicer, Conway, and Trump tried to lie about the size of the inauguration crowd, but Chuck Todd didn't let them get away with it.   Shared by Occupy Democrats, LIKE our page for more! Video from Meet the Press."},{"comment_id":"10154710318354062","commenter_b":"GTFOH... U don't own this planet girl!! GOD knows no borders right Angie? Get off ur high horse! Stop looking down n help another up!!","commenter_a":"what part of ILLEGAL do people NOT get??? GO HOME!","post_message":"Dozens of protesters have gathered on the University of Houston campus in advance of tonight's debate. Live team coverage coming up at 6."}]
