[{"comment_id":"557366464412130","commenter_b":"She's anti-woman.","commenter_a":"and, an eyesore.","post_message":"Carly Fiorina is gaining in the polls because Trump gave her his attention in a tweet. Now Republicans are claiming she supports women's rights."},{"comment_id":"732442150279696","commenter_b":"close our borders and weed out this cancer trash","commenter_a":"Get registered to vote the right way. Offer your Sr. Neighbors etc a ride to vote. Get things changed in this country!","post_message":"BREAKING: Muslim Civil War Erupts In Ohio After Patriot Rips Apart A Quran [VIDEO] Watch what happens in the crowd right after he started doing this. Do you think we should close our borders?"},{"comment_id":"966246990097370","commenter_b":"Umm Ferguson, Watts Riots, La Riots. White people are out of control? Ok","commenter_a":"I pray for their families","post_message":"White supremacists shoot five people near the #BlackLivesMatter protests for Jamar Clark, a 24-year-old unarmed black man who was shot earlier this month by police.  Protestors took to Twitter after the shooting & described the scene as chaotic, saying police maced the crowd before an ambulance arrived to assist the wounded.  No arrests have yet to be made. DETAILS ----> @webpagelink"},{"comment_id":"10154838480761729","commenter_b":"Nothing will stop this because they want to become martyrs and are ready to die for Allah. Killing them before they kill you is the only solution.","commenter_a":"Here we go again, it's the guns! Oh wait, I thought ALL guns were illegal in Germany? They need to tell these criminals that they are not supposed to have guns! How dare them break the law and get illegal guns! They need to make more gun laws because that will make it harder to get guns.","post_message":"UDPATE: Authorities warning MASS TERROR ATTACK UNDERWAY  Manhunt underway, public transit shut down..."},{"comment_id":"10153009688681051","commenter_b":"Of course hollis god says if you're not with me your against me.. you send yourself to hell .. Muslims will enjoy and do enjoy rape murder and torturing you then sending you to hell.","commenter_a":"How disgusting and disgraceful. Christians are always like keep Christ in christmas, being back the pledge and the nativity scene and I love rebel flags, but the moment another person who doesn't believe their same beliefs is shamed, they point fingers and laugh. all of these people that think deeply offending someone's religion is a joke don't deserve to bear the name of christian. Have some discipline...","post_message":"The Muslims who thought they were buying halal products at this store just found out they had been eating pork the whole time."},{"comment_id":"392182107608412","commenter_b":"He had a gun in front of him , h9w do you know his hands were uo you cant see shit . You fuckers are stupid to believe that its the cops fault or the military fault if not for either you fucking scumbags wouldnt have a place to trash , rob and i really can care less if you dont cosider me a fellow american if you believe that fuck was innocent your as bid of a piece of shit as he WAS dont even call yourself an american you fucking soft liberal scumbag go catch a bullet.and if you th8nk i cant handle a weapon then come up to ny and find out get the fuck out of my country and go fuck your allah in the ass","commenter_a":"Dont hate the cops, hate yourselves for breaking the law and being to stupid and lazy to get a job","post_message":"\"I ain't doing nothing. I'm not reaching for nothing, bro.\""},{"comment_id":"889958597769015","commenter_b":"Don't like her!","commenter_a":"What is there left to say. Sarah Palin \"will send them to kick Isis out\"sounds like he will put troops on the ground. Just what Isis wants. She sounds as bad as Trump. She doesn't even know what is coming out of her mouth. Mental problem. Think before you vote!!!!","post_message":"“No more pussyfooting around!”  That’s what she said... Here are the best one-liners from Sarah Palin's endorsement of Donald J. Trump: @webpagelink"}]
