[{"comment_id":"10152854969571051","commenter_b":"Let behead these scumbags..What the F**k is wrong with people..Your parents should get their asses kicked","commenter_a":"Tell me where they live. I'll do the rest...","post_message":"These teens beheaded a puppy with a machete and posted the video to Snapchat. Then they picked up another puppy and did it again. And they didn’t stop there."},{"comment_id":"1700232733582570","commenter_b":"Lose with Cruz.... I like it","commenter_a":"Having recently switched parties for \"one day\" Republican status I will vote cruise to stop Trump in April 26 Pennsylvania primary then probably vote for Hillary in November. Question: what is the brand of the dress Nicole Wallace wore today?","post_message":"Joe and Mika are here to discuss the state of the 2016 race following the Wisconsin primaries – and much more! #24Live"},{"comment_id":"10155080239376037","commenter_b":"Wow, just wow! How much tin foil DO you go through a week???","commenter_a":"Being \"sold to us\" as home Terrorist attack.... Each minute the MSM spews more misinformation pushing their Naritive. My guess , MK Ultra mind control at work...., , distraction? Agenda? To be determined. ?..","post_message":"Suspect Esteban Santiago, who was carrying a military ID, allegedly opened fire, killing at least five people before being taken into custody."},{"comment_id":"10153724102627217","commenter_b":"Ms. Herod... Majority of UK science budgets are coming from EU... Now a lot of most important science projects are too expensive for even the US alone... Not to mention working scientists who are working in UK aren't British, but from EU who are paid by EU... UK's science sector is one of the biggest looser after EU exit...","commenter_a":"Lol pmsl...so now learning science has alot to do with brexit...not very intelligent then are you...we had science before we went into it we still have it & for all the years to come ...please stop with the crap ..we are & we will be better of out","post_message":"Are you a scientist worried about #Brexit? Here's the latest."},{"comment_id":"792840600880967","commenter_b":"I agree, but so does the weak Democratic Party leaders who have also FAILED us.","commenter_a":"I'm a democrat, Maxine Waters please sit down and regroup. The Democratic Party is weak weak weak and has no legs to stand on and you, Nancy Pelosi and Chuck Schumer need to be replaced period.","post_message":"Maxine Waters on Trump advisers: \"This is a bunch of scumbags. That's what they are, who are all organized around making money.\" @webpagelink"},{"comment_id":"941236165936132","commenter_b":"Je vais m'y opposer a son mariage ! Ce n'est pas normal qu'il est pas pense a nous...","commenter_a":"@username il nous a meme pas invite","post_message":"Congratulations Nikki Reed and Ian Somerhalder!"},{"comment_id":"824106447706135","commenter_b":"Just revoke her security clearance. How could she be president without clearance?","commenter_a":"Ohhh I wish!!!","post_message":"Former Attorney General Michael Mukasey has been making the rounds .."}]
