[{"comment_id":"501775896685267","commenter_b":"She is a POS!!!!!!!!LIAR too!!!!","commenter_a":"NO","post_message":"Hillary Clinton has been defying stereotypes about what women can accomplish her whole life. Would you like to see her do it again this November?"},{"comment_id":"509489615909884","commenter_b":"No She is a pig.","commenter_a":"She is also a jackass","post_message":"Canada: Muslim Conservative who decried party's Islamophobia is really a Liberal"},{"comment_id":"1045431208809965","commenter_b":"This is not news worthy.","commenter_a":"Who cares?","post_message":"BREAKING> Beijing wins bid to host 2022 Winter Olympics. China's capital will be first city to host summer & winter games."},{"comment_id":"1329355063770614","commenter_b":"And yet, billions of US tax dollars are given to foreign governments each year without the consent of tax payers. It's disgusting and so sad that we have Americans living like this and Obama and the entire Democratic party wants to bring hundreds of thousands more refugees into this country to live on the taxpayer dole! How stupid are we to keep putting these people into positions of power this way?!!","commenter_a":"There are many homeless in the Seattle area that live in tents because they don't want to have the restrictions that comes with living in a homeless shelter. Restrictions with when they come and go and what goes on there.","post_message":"OBAMA PUSHES AMERICANS INTO TENT CITIES.  Hillary will keep them there.  VIDEO  @webpagelink"},{"comment_id":"935042419864513","commenter_b":"Our borders have never been as bad as they are now. Obama is to blame for that! You never hear about it on the news either. I have family in the South and they say it's scary whst is coming into our country right now illegally.","commenter_a":"Good going trump lets get started right now throw Obama in jail and you can take over tonight","post_message":"Donald Trump's announcement is something we've never seen in history!  This is HUGE!"},{"comment_id":"886020504921859","commenter_b":"You are right Mary the bitch owes Haiti","commenter_a":"Shut it down.. take some of the millions and help Haiti which some of it was supposed to be used for. Then rehire ALL NEW PEOPLE IN THE VA HOSPITALS AND HELP OUR VETS. some of those people are the rudest uncaring and unhelpful people around hire enough to take care of the vets so they don't have enough to wait so long for appointments etc. Help Americans for God's sake.","post_message":"Hillary devastated after finding out this about her foundation.  It's all coming crashing down.  Do you think the Clinton foundation should be shut down?"},{"comment_id":"10155581523315192","commenter_b":"Girl should be held responsible for her actions!!!","commenter_a":"Not news.","post_message":"This came to light when a mom received a nude picture of her daughter in a text message:"}]
