[{"comment_id":"1760785597541885","commenter_b":"Yes I believe","commenter_a":"Yes","post_message":"VIA : God Is Love"},{"comment_id":"10153197145938721","commenter_b":"My Eulogy: @webpagelink","commenter_a":"Welcome HTML5 banners.","post_message":"With Google putting the brakes on Flash in Chromethe world most popular web browseradvertisers will need to seek other ways to get their messages out."},{"comment_id":"1784031898507079","commenter_b":"She is a heartless bitch!","commenter_a":"She still hasn't gone to Louisana like she said she would after the devastation from the recent tropical storm that passed through there . And wasn't it her and her campaign who accused Trump of making Louisana a political stunt when he went to help after? Here she is making it political when it's time to focus on evacuations, preparation and people's well being.","post_message":"As Florida residents prepare for Hurricane Matthew's impact, Clinton buys ads on the Weather Channel."},{"comment_id":"10154933688831037","commenter_b":"She's a snake!!!","commenter_a":"This girl looks horrible, think she needs some rest.","post_message":"Trump will \"be the president of all Americans, including those that did not vote for him.\""},{"comment_id":"488312324683981","commenter_b":"Hmm if firearms are a replacement for a small penis what are females replacing with firearms @username???","commenter_a":"Gun Worship in The United States of Guns is Killing US...","post_message":"SCARY!!"},{"comment_id":"1381800741835583","commenter_b":"Smart woman makes Hillary look like ??? 😝","commenter_a":"Obama couldn't stand her, or for that matter, none of the democrats.","post_message":"Let's go back to 1990, October 30th, 1990. It's in London, in Parliament, Margaret Thatcher, during a debate on rejecting a move toward a more closely united Europe.Let's go back to 1990, October 30th, 1990. It's in London, in Parliament, Margaret Thatcher, during a debate on rejecting a move toward a more closely united Europe."},{"comment_id":"1160655937308596","commenter_b":"Many Muslim women are sick of being told what they are and what they can be from western women who have no clue about their culture, that's why Muslim Feminism had to develop on its own instead being part of the bigger movement, _that's_ sad if you ask me. Feminism should be about equality not about following one group of women's notion about what you should look, feel or talk like.","commenter_a":"I'm seeing a lot of diversity in the Muslim community about the concept of World Hijab Day (non-Muslim women wearing the hijab for a day in solidarity). Would love to get your thoughts on whether it's cultural appropriation, or upholding the more conservative aspects of your faith. I did participate last year, but not sure if I will again.","post_message":"Her \"Ask a Muslim\" booth was a huge success! - Parker Molloy"}]
