[{"comment_id":"930011010437419","commenter_b":"Lady u need help fuck grump","commenter_a":"\"Semame?\" Really, is spell checking really that difficult? I'm only pointing this out because it's a constant with your memes and videos. As funny as they are and as much as I enjoy them, please, for the love of God, use spell check. You look like buffoons when you misspell such easy words.","post_message":"WATCH: 10 years ago, Sesame Street called out trashy Donald Grump.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154766887574199","commenter_b":"What's his out of state criminal history? 50k for even felony Malicious Mischief is absurd. He's got no in state history.","commenter_a":"they got me y'all i should have never came down","post_message":"Prosecution had asked for court to set $100,000 bail; judge set it at $50,000"},{"comment_id":"910810348978714","commenter_b":"Showing her big fat backside...","commenter_a":"Why is it always about Kim Kardasian? And by the way, can somebody tell what she's famous for?","post_message":"Kim Kardashian leaves no curve unseen  (Vis Daily Mail Celebrity)"},{"comment_id":"1012624708881318","commenter_b":"@username. She speaks 5 languages!! How many do you speak?","commenter_a":"I honestly can't stop crying right now to know that this monster is playing with families like this when his wife can't even speak English herself","post_message":"Watch protests at U.S. airports in opposition to Trump's executive order restricting travelers from specific countries.  Read more details on the travel restrictions issued by President Trump: @webpagelink"},{"comment_id":"10155795275933294","commenter_b":"Bunch of bull lock all of them up @username bond then they stop this crap","commenter_a":"He got what he deserve and they should get the same","post_message":"WATCH LIVE: Protesters have taken to the streets of downtown Portland, calling for justice for Quanice Hayes, who was shot and killed by police last week."},{"comment_id":"10153557014143984","commenter_b":"To the Ignorant person that said I must be an illegal immigrant you just showed you how ignorant you are. I'm an American. A REALISTIC AMERICAN!!!!! I agree with the person that mentioned the abuse of the welfare system, but those are Americans doing that. Illegal immigrants can't get benefits!!! To the person who said that the companies are putting money in their pockets I agree, but as soon as they have to pay minimum wage and provide benefits and go legit the cost will be passed onto the consumer it always does. To the person that mentioned Hispanic, Mexican etc. I never mentioned any group of people I made a general comment about all immigrants. You just showed how stupid you are that just because I mentioned working in Orange fields you automatically stereotype I was talking about Spanish people. Here's a little info for you not only Spanish ...","commenter_a":"This country was built by immigrants both legal and illegal. Im tired of hearing people complain about illegal immigrants!!! Who the hell do you think are working the lowest paying jobs that without them this country would not function. Will any of you go clean toilets for 6 dollars an hour (that's if they can get that much). NO!!! Would any of you go to the orange fields and go pick oranges for hours in over 98 plus degree weather for pennies a bag. HELL NO!!! But you like when you don't have to pay an arm and a leg for orange juice. If there were to be no illegal immigrants the costs of a lot of things people enjoy would sky rocket because the company would have to pay out more for employees passing the increase on to the consumer!!!!!! Everyone needs to back off immigrants because unless your ...","post_message":"There have been many to come out against Trump after his comments on illegal immigration, but one beloved politician just did exactly the opposite.   Do you support this Republican for taking a stand for Donald Trump?"},{"comment_id":"949480448492859","commenter_b":"I know and all white people are racist, and all blacks are bad and all people named Ana are jerks. Yeah I get it.","commenter_a":"Whatever people think about Trump, he's not as stupid or delirious as the Democrats who put Israel and the USA in jeopardy of a nuclear strike, and gave the biggest supporter of terrorists over $150 billion dollars to wipe us out... Our government is carrying political correctness to the point of suicide, just like all the European nations did by taking in millions of so-called refugees... People think it might be dangerous if Trump has his hands on the nuclear arsenal... how is that any worse than giving nukes to our biggest enemy who daily threaten our extinction and Israel's extinction??? AND CRUZ was behind all these deals. We don't need him in the WHITE HOUSE. Lawyers are liars and he is not different than the rest of the lawyers around this country.","post_message":"Carly Fiorina: It's time to unite behind Ted Cruz: @webpagelink"}]
