[{"comment_id":"10153287154044714","commenter_b":"Nope. She's a woman!","commenter_a":"Your father is a man I don't care he changes","post_message":"An incredibly touching story"},{"comment_id":"702518316605413","commenter_b":"What is wrong with these kids???!!! They're turning into barbarians! Totally unacceptable!!!!","commenter_a":"Now the parents most likely were at the welfare office getting stamps like all the other unemployed shit they can't flip a burger over that's too hard","post_message":"Three students were arrested yesterday at William Allen High School In Pennsylvania.  Other students stood by and watched as they did this to her. Will you pray that this officer will be ok?"},{"comment_id":"10153146203991051","commenter_b":"Caucasian women are most desire able","commenter_a":"I'm not racist but do y'all notice that the teachers who have sex with students be Caucasian? Hum!!!!","post_message":"This teacher was arrested for having sex with her students. While she was out on bail, she got busted doing it again."},{"comment_id":"836075406488713","commenter_b":"Punch her out, Sarah!","commenter_a":"Between Hillary or Sarah it would be Sarah in a heartbeat.","post_message":"“I’m ready for Hillary, are you? Are you coming?”  - Sarah Palin"},{"comment_id":"10153539685509641","commenter_b":"How many ISIL recruiters are. among all these \"refugees\" ..wait untill they settle.No more Europe for me..is unsafe now..","commenter_a":"Couple of years from now the refugees will try to change europe like the country they just left... they will get offended by the host country's culture and practices and might demand for sharia law in europe.. the European politicians will never learn their lessons... just take a look at UK, France and sweden .... RIP EUROPE.. well played saudi Arabia, Kuwait and other middle eastern countries who smartly looked away.. My only hope is that the refugees respect the host country's culture and laws and abide by it and never dream of changing it... but I doubt it strongly","post_message":"Today, German Chancellor Angela Merkel said her country is pledging an additional 3 billion Euros to the migrant crisis. French President Francois Hollande said France will accept 24,000 new refugees, and British Prime Minister David Cameron said the UK will take up to 20,000."},{"comment_id":"10154125640609071","commenter_b":"Success is subjective. I'm fairly certain her and her family would be happier if neither of them worked so hard at their music careers.","commenter_a":"Why would you put front and center a couple that hates police officers and deals drugs? great role models you morons.","post_message":"“You have the same number of hours in the day as Beyoncé.”"},{"comment_id":"10153675906043132","commenter_b":"Ben's is too good for her He's lucky she sent him home He had too much class for her","commenter_a":"Shawn wins - there.","post_message":"Last night's The Bachelorette: Let's discuss."}]
