[{"comment_id":"10154980169065789","commenter_b":"@username poor little bitch, guess what trumps your president now ! Lol","commenter_a":"He's accomplished so much in such a short period of time, compared to the last administration. So thankful we have someone who will strengthen our nation and our military. God bless you President Trump!!","post_message":"Donald Trump has been in the White House for 13 days. Do you like or dislike what you've seen from his administration so far?"},{"comment_id":"10153683223480575","commenter_b":"Leave my country!","commenter_a":"You got to be kidding.","post_message":"Pig books now banned.... They might offend Muslims."},{"comment_id":"835512459884693","commenter_b":"Crazy woman","commenter_a":"The truth is not in her.","post_message":"Pelosi glosses over spiking costs under the ACA for millions of Americans."},{"comment_id":"10155201433711320","commenter_b":"There's no Native American blacks and Latinos in Eastern Europe. The perfect place for RACIST AMERIKKKA","commenter_a":"Yeah the country is being lead by white supremacy you people find this okay?? oh wait a minute...This is RACIST AMERIKKKA. WHAT more can you expect.","post_message":"This is a live look at Washington, D.C.  Are you pleased with what our nation's leadership is doing right now?"},{"comment_id":"841387199293221","commenter_b":"Lol bitch ass no life","commenter_a":"Who cares about a road named after we want justice for her and her killer or killers in jail for murder so sad hoping we get justice sad it takes this to game a road names after you praying for your family and friends rip Sandra justice 4 Sandra","post_message":"It is the same stretch of road on which she was arrested."},{"comment_id":"853572084739045","commenter_b":"Lol! Wow!","commenter_a":"I agrees with the Judge! Come here by the proper channels! WTH","post_message":"Here's a breakdown of what the immigration ruling means."},{"comment_id":"1155787421127301","commenter_b":"lmao ...#NeverCrookedHillary #JillnotHill","commenter_a":"Hillary for the love of God stop drinking!!! Your pandering is psychotic, you're losing touch with reality and becoming paranoid!!! You look old and tired!!! Put the vodka bottle down and go to bed!!! VOTE TRUMP MAKE AMERICA GREAT AGAIN !!! '","post_message":"A young girl asked Hillary, \"Do you think when you're president, you'll be paid as much as a man?\""}]
