[{"comment_id":"10157173546425354","commenter_b":"what a stupid whore","commenter_a":"Bill Vito: Gee, I hope she doesn't have any of those baby killing guns around.","post_message":"Democrat Sen. Barbara Boxer says the physical violence among Democrats is \"frightening\" and that she \"doesn't know what would have happened if I didn't have security.\""},{"comment_id":"1140671769377398","commenter_b":"This lady is such a trash!","commenter_a":"Why didn't they do this when Obama was in office?","post_message":"Thankfully we have Elizabeth Warren in the Senate to call him out.  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153544166434024","commenter_b":"NY is the capital of THE WORLD! If you don't want to spend money LIVE SOMEWHERE ELSE! As far as Cruz goes I thought Republicans want smaller government. ??? Good get out of our marriages and get out of our doctors offices. (Women's Drs offices)","commenter_a":"Freedom of speech... He's right about the liberals in NY. Who cares. NY is insanely wrong when it comes to taxes and wages... The truth hurts.","post_message":"WATCH: Ted Cruz slams Gov. Cuomo and Mayor de Blasio when asked about calls for an apology for his remarks on \"New York values.\"  Your reaction to Cruz's latest comments?"},{"comment_id":"2196085043950203","commenter_b":"When is she moving. Shut her up","commenter_a":"She needs ducktape","post_message":"The Left in America is unhinged: why is this woman on TV?"},{"comment_id":"1043277849065296","commenter_b":"Stupid cow! Needs to get over herself","commenter_a":"What a cow!!!","post_message":"'His career won't suffer, but I've been told I'm ruined'"},{"comment_id":"980529482041405","commenter_b":"She crazy bruh","commenter_a":"She is so confused 😂😳","post_message":"Watch: She has to be seen to be believed. Somebody take away her car keys!"},{"comment_id":"10154040095578701","commenter_b":"Build that wall","commenter_a":"Juan Wheeler","post_message":"Oregon State Police say a traffic stop on Highway 97 in Sherman County led to the seizure of $2.3 million worth of meth and cocaine."}]
