[{"comment_id":"10154026278303812","commenter_b":"She killed herself she was the ignorant idiot","commenter_a":"How about a conviction and prison time for a change, send the message loud and clear.","post_message":"JUST IN: TX grand jury indicts trooper who first stopped Sandra Bland in her car on perjury charge. @webpagelink"},{"comment_id":"10152943913476051","commenter_b":"Laura Mae Floering go break a hip old saggy tits","commenter_a":"We can't have white history month United white college fund White entertainment television White colleges That would be racist right?","post_message":"When a deli owner posted this sign on the front of his business, he didn’t think it would be that big of a deal. Well, it was. Now he's dealing with the consequences."},{"comment_id":"10153006629032756","commenter_b":"no it isn't all urine its sweat also, you ever lean on a couch and your arms start itching well that usually sweat, other bodily liquids like tears, saliva and other related stuff can cause the burning of the eyes too","commenter_a":"Jason Meade","post_message":""},{"comment_id":"1153858647985703","commenter_b":"It's the \"Chicago way\".... the end justifies the means.","commenter_a":"And all his ISIS appointees and advisors!","post_message":"Does this about sum it up?"},{"comment_id":"10152856733741051","commenter_b":"Cheryl, get real, freak!!","commenter_a":"He is a Race Baiter distracting from what he is secretly doing to America. His agenda is clear to me, DESTROY AMERICAN FROM WITHIN!!!","post_message":"President Obama hopes that Wednesday night's shooting of two police officers doesn't distract people from one really important fact about Ferguson."},{"comment_id":"10153234607601491","commenter_b":"Imagine... First lady of America has a sex video. No please!!! Cant call kim a lady!","commenter_a":"Lol","post_message":"Kanye and Kim Kardashian West are looking forward to redecorating the White House."},{"comment_id":"10153304856351350","commenter_b":"Lol!! Someone stop these people from reproducing!! It's not attractive lol","commenter_a":"@username Katie Pollard","post_message":"Congratulations are in order (again) for the Duggar family!"}]
