[{"comment_id":"10153845765260950","commenter_b":"@username are you a woman? No! Then it's not your say!","commenter_a":"Republicans already passed a Zika bill. Democrats voted against it because defunding planned parenthood was attached. Democrats had rather murder the unborn than prevent the born from being deformed. You see stopping Zika is bad for buisness at Planned Parenthood!","post_message":"President Obama blasts Republicans in Congress for refusing to approve requested amount to fight against Zika."},{"comment_id":"10153010443401336","commenter_b":"I bet you don't even know what a p value is lmao.... Please don't reproduce...:)","commenter_a":"should be legal everywhere","post_message":"Possession of marijuana is no longer a crime in Alaska, but smoking it in public can lead to a $100 fine.  Should more states follow suit?"},{"comment_id":"1422508754431832","commenter_b":"Yes","commenter_a":"Yes, totally!!","post_message":"Should Washington require drug testing for unemployment benefits?   A. Yes.  B. No, it's spending a lot of money on little gain  C. This is a bit unfair for states that legalized pot  D. Only for those who lost jobs to drug use E. Enter your own anwser"},{"comment_id":"10154049332181749","commenter_b":"Immigrants don't commit horrible crimes, don't you look at crime statistics? They commit the FEWEST horrible crimes by a massive margin.","commenter_a":"Yeah... It's not like we have any other threats that are more prevalent. Like terrorists, a government who's trying to destroy our freedoms, our Constitution, or our country for that matter, illegal immigrants crossing our borders and committing horrific crimes... No no climate change is so dangerous. Good thing we have you to keep us safe from uhhhh... the sun.","post_message":"The Clean Power Plan helped pave the way for the historic Paris Climate Agreement—the first-ever global climate deal."},{"comment_id":"10156528840915389","commenter_b":"She's a troll. Ignore her and maybe she'll go away","commenter_a":"The best parts of LIFE are free and easy to do.","post_message":"ICYMI: 89-year-old World War II veteran Bryan Sperry scores a touchdown during The University of Kansas alumni flag football game! Sperry played on the Kansas Football team from 1946-1948. @webpagelink"},{"comment_id":"480699562111924","commenter_b":"What a phony. She could care less about the working class. But she's got a lot of people fooled. Poor souls.","commenter_a":"Hillary has fought all her life for the common people Bernie just the last ten years, so I want Hilary over Bernie.","post_message":"This is something all voters should see."},{"comment_id":"717976815002166","commenter_b":"Did you read what I said? Or did I lose you after ESPN? By law, you cannot force someone to give up their body, body parts, body tissue to ANYONE, regardless of their life being in danger. So you can't force a woman to give up her body and blood and essence to someone who you've notably identified as a completely other person. And ps, bananas also have their own DNA. Oh shit looks like we can't eat fruit.","commenter_a":"I read Planned Parenthood does 30% of all abortions. Who is doing the rest of them?","post_message":"Appalling on every level. THEY MUST BE STOPPED!"}]
