[{"comment_id":"10153338017932411","commenter_b":"So the nets they snag your tuna in make those fisher people littler dicks?","commenter_a":"All the idiots who says no different then fishing. Big men that kill nature as sport. Little dicks!","post_message":"The Facebook video of the incident quickly went viral, attracting comments like, “Someone should drag that guy around in the water just for pictures.”"},{"comment_id":"10153169080361336","commenter_b":"What's up with that first woman who RAN in the other direction? Nice.","commenter_a":"They only pitch in to help the fallen man and good Samaritan after RUNNING AWAY FIRST!","post_message":"The 28-year-old hero leaped on to the tracks to save the man from getting hit by a train and other commuters helped to pull them both to safety."},{"comment_id":"10154729609496729","commenter_b":"Unfit evil lying grandma killery","commenter_a":"She only said it because she wanted to diffuse Trumps statement. Too late to get on that band wagon. Meanwhile American lives are lost due to stupidity.","post_message":"Whoa. About damn time."},{"comment_id":"398088506982411","commenter_b":"Send them back to where they came from. They have no rights....they aren't AMERICAN citizens!!","commenter_a":"deport every one them but their country dont want them either they dont know the meaning of being human it seems","post_message":"This is not a good image for those who are trying to support the rights of illegal aliens."},{"comment_id":"10154030310632061","commenter_b":"Hillary can send emails to Satan but Donald still won't get my vote!!","commenter_a":"She should be in jail!!! And she should have never been allowed to run for president! Now we have two people running and I can't stand neither","post_message":"The newly discovered emails that prompted the FBI to reopen the investigation into Hillary Clinton private server came from a separate federal investigation of former Congressman Anthony Weiner, multiple sources tell ABC News."},{"comment_id":"10154235562969456","commenter_b":"Who's going to put the food on your table ? This country needs illegal immigrants who work for low wedges and keep the prices down .. trump and the gop knows that but keep believing this idiot","commenter_a":"The man never said he was against the Mexican people or their country, traditions, etc. ! JUST those entering our country illegally! Even Hispanics that came to the United States and became citizens LEGALLY, support his platform on this subject. Why would anyone think it’s okay to go to a foreign country, have anything and everything that country has to offer and get it for nothing! I don’t believe any other countries in the world would allow that…why should we?! My husband and children are of Hispanic decent and their relatives came to this country, did what was expected and became citizens legally. It can be done! So, go ahead Donald..build that wal!","post_message":"Despite promises to build a wall along the Mexican border, Donald Trump is still a fan of Cinco de Mayo. >>> @webpagelink"},{"comment_id":"10153516807860575","commenter_b":"Schmuck must go!","commenter_a":"He looks mentally ill.","post_message":"The Gateway Pundit - DISGRACEFUL: Mitch McConnell WILL NOT Allow Vote to Defund Planned Parenthood (VIDEO)"}]
