[{"comment_id":"1629456670679882","commenter_b":"Little Winnie bitch","commenter_a":"Toddler, bigot, lier","post_message":"Think quick! Then, click \"like\" on your favorite answers in the comments.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153953951823690","commenter_b":"How can funding settlement building be tax exempt these people are supporting a war.","commenter_a":"As an American, I'm happy to see this. It is long overdue for this to come to light. Being against apartheid SA, then without question supporting Israel is disgusting hypocrisy. That support fuels additional tension between the US and the middle east. It must end and Israel needs to be held accountable.","post_message":"A lawsuit has been filed in a US court seeking to stop non-profit groups from sending billions of dollars worth of tax-exempt donations to support illegal Israeli settlements and the Israeli army @webpagelink"},{"comment_id":"10152956045287093","commenter_b":"Don't leave the drawers open","commenter_a":"@username pretty sure this is my dresser lol","post_message":"RECALL ~ IKEA is recalling 27 million adult & children’s dressers because of a tipping hazard…2 toddlers were killed when their dressers tipped over on them… @webpagelink"},{"comment_id":"927870117281087","commenter_b":"How many illegitame grandkids does it take to keep her quiet","commenter_a":"I'm with you Sarah","post_message":"Sarah Palin goes off on Obama to his face. What a woman. Let's show her our support. Can we get 10,000 'LIKES' for Sarah Palin's stand against Obama?"},{"comment_id":"10154276196928128","commenter_b":"more like a buzzard ,she will eat america alive","commenter_a":"People seem to forget!! This is what happens when you mess with the Clinton's!! You can share this from my page if you want. And I did not write this I copied it from someone else that posted it. And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course we forget what has happened to many of the Clintons. 1- James McDougal Clintons convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr investigation. 2 Mary Mahoney A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown .. The murder happened just after she was togo public w:th her story of sexual harassment in the White House. 3 Vince Foster Former White House councilor, and colleague of Hillary Clinton at Little Rock ...","post_message":"Aaron David Miller asks: Is Hillary Clinton's hawkish past an accurate indication of how she would behave as president?"},{"comment_id":"10153389153527169","commenter_b":"Don't despair. I have a niece named Gretchen. You are not alone! ;)","commenter_a":"Try being a Gretchen. I was literally the only one in my entire school all through k-12. I NEVER encounter tiny Gretchens but I'm only 31 so maybe there's still time?","post_message":"Is Your Name Going the Way of the Dodo Bird? (From OZY)"},{"comment_id":"10153844148480579","commenter_b":"Only when they try to use it as the basis of their platform or legislation. Then it is a big negative.","commenter_a":"Media Silent As Muslims Ethnically Cleanse 60,000 Christians In Philippines By: Daniel Greenfield When thousands of Muslims become refugees, then you can’t get the media to shut up about it for weeks. Thousands of Muslim migrants... jewsnews.co.il","post_message":"Do you consider religion when evaluating a candidate?"}]
