[{"comment_id":"10156470803785354","commenter_b":"They KISS ASS better then the others!!!","commenter_a":"There are thousands of kids bullied every day but Muslims are going to have our government defending them. That is so wrong. Why are they more important than the rest of the kids in our country. B.S.","post_message":"And check out Rush's epic take on this..."},{"comment_id":"10153482045808984","commenter_b":"She is a nut","commenter_a":"I would hate to have lived under her roof , she is not fit to be president. Or anything else.","post_message":"Hillary Clinton is known for her liberal view on just about every topic she chooses to sink her teeth into. And looking at this, her next move might be to include children in her agenda...  Do you think Hillary needs to be stopped?"},{"comment_id":"10154256296041130","commenter_b":"is she for Citizens United? how about the ACA? How about Roe v. Wade, what's her position there? Now compare Republican's position on these...","commenter_a":"Only further proving that Hilary is a Republican, but delusional liberals will still vote for her","post_message":"\"This is not a traditional race, and these are not traditional times.\""},{"comment_id":"10156388002150389","commenter_b":"Muslims are the problem!","commenter_a":"He was a Muslim. What else is there to know?","post_message":""},{"comment_id":"10153469105041746","commenter_b":"Lol this chick gets her history from Hamilton","commenter_a":"Think about these 2 statements: \"Make America Great Again,\" and \"America Is Not Great.\" If you support the first one, but are angered by the second, you need to take Logic 101. As for the statement on this woman's hat, \"America Was Never Great,\" I strongly disagree. I saw Hamilton: An American Musical and there was a time when greatness abounded. Since then, we've alternated between great and not so great, sometimes concurrently. It's a big country!","post_message":"Meet the 22-year-old between the controversial hat."},{"comment_id":"10154360418471729","commenter_b":"...she IS A LIAR !!!...always been and always will...","commenter_a":"Now...that looks like an angry candidate!","post_message":"The truth hurts. Especially if you're Hillary Clinton."},{"comment_id":"10154577963871323","commenter_b":"President Mitterand had wife and kids plus a lover with who he had a girl!!! Lol","commenter_a":"If it was France or even Italy it wouldn't be an issue and would be distasteful to bring up in public. In America there is a certain ownership in marriages rather than partnership. Maybe she loves him as a man and equal in mind, the fact that he does have a wandering eye (penis) may be something she is willing to accept the way we accept a partner's handbag obsession.... Just saying....","post_message":"The end of a relationship – even a years-long marriage, even an otherwise-good relationship, even with children in the mix – is, at this point, the only acceptable consequence of infidelity, and staying is posited as the inexplicable choice for a woman to make.  But life and love are more complicated than that for many people, even in 2016."}]
