[{"comment_id":"10153019932341323","commenter_b":"No, but look what women can do with them, much healthier than smoking.","commenter_a":"How much for the tampons?","post_message":"Only in New Orleans..."},{"comment_id":"10153917677820695","commenter_b":"Is that the guy walking/running or it's the photo of a car he supposedly driving?","commenter_a":"Police just released this surveillance photo of the man, who was driving a silver car. They say the victim was a 65-year-old woman.","post_message":"#BREAKING: Officers are searching for the man who sped away from the Walmart parking lot.  We have a reporter on the way to the scene and will have a live report on the Channel 2 Action News Nightbeat at 11."},{"comment_id":"1112768188788371","commenter_b":"This is his third baby mama. The guy is an absolute psycho and she is a dumb doormat.","commenter_a":"It's not about breastfeeding. It's domestic violence. He has strict rules for his partner, including this new one related to breastfeeding. He's a controlling arsehole.","post_message":"He wants his wife to stop breastfeeding when their son turns 8 months old."},{"comment_id":"818380371637006","commenter_b":"These women supporting Hillary are the most delusion bunch I have ever encountered... I'll leave this video of a woman providing facts about Hillary, so that you know just how delusional to are, and if you still support her after watch this video, you are just as bad as she is. ALL WOMEN SHOULD WATCH THIS BEFORE VOTING FOR HILLARY CLINTON: @webpagelink","commenter_a":"I was delighted and elated to put my vote for y-o-u Hillary! Ive been waiting for this moment and plan to bake cookies to celebrate your election. Much love kindness snd goodwill, Jean","post_message":"\"Get this Donald: Nasty women are tough. Nasty women are smart. And nasty women vote.\" —Elizabeth Warren IWillVote.com"},{"comment_id":"10154579846521337","commenter_b":"Uproxx spreading the word of obama lets keep stoking the fires of divison","commenter_a":"Why is the kid running? I mean...I personally see cops running towards me I'll probably freeze like a deer in headlights. The cops would've likely seen their theory was ridiculous once they got close to the kid and moved on.","post_message":"“I was scared for my life. I was thinking that they were going to shoot me.”"},{"comment_id":"10153923340133635","commenter_b":"Vicki C: So true re immigrants across the border. They caused more than half our hospitals and emergency rooms to close in Los Angeles years ago!!! Now, it's difficult for REAL Americans to get care when they require it. Just disgusting! Add to that, the planeloads of moozies Ovomit has been bringing in for years and I'm surprised any healthcare is available at all! Even our Vets can't get care and they should be first!","commenter_a":"Border Patrol Agent Defies “Gag Order” to Expose Obama The massive exodus of illegals crossing over into Texas and other border states is becoming more than local communities can handle. This influx of illegal immigration is causing emergency shelters, areas typically designated for use during catastrophes, to overflow, leaving local government scratching their heads as to what to do with immigrants who have no place to go and can’t be deported back to their home country.... Border Patrol agent Hector Garcia accused the Obama administration of “aiding, abetting and facilitating the smuggling of illegal aliens across the border.” In an interview with CNN, Garza said the current influx of illegal immigrants is “organized” and “orchestrated” by the drug cartels. Additionally, he said the federal government is giving illegal immigrants a “free pass.” He said the feds are using the equivalent of the honor system in asking illegal immigrants to later ...","post_message":"#1 Republican President Teddy Roosevelt was also a proponent of eugenics theories by Planned Parenthood founder Margaret Sanger"},{"comment_id":"1017395615037845","commenter_b":"@username Border security is far more lax than it has ever been. Obama gives the border patrol and ICE orders to stand down all the time, which is a major contributing factor of the explosion in the illegal alien population in the US. The illegal population here is at an all-time high. There should never have been a healthcare mandate. This isn't a socialist regime. The people (or at least the majority of us) don't like the mandates, individual or business. I assert that you condoned Fast-N-Furious because you're the one who said things are better than they were \"under the misery of Bush\". Businesses salivated at the prospect of cheap labor, so when Bill Clinton signed NAFTA into law they didn't mind one bit firing millions of employees -many of whom had to seek any type of welfare they could in order to get by. Not good for economy ...","commenter_a":"You are MOST WELCOME here in the great state of Pittsburgh, Pennsylvania Mr. Trump!! I cannot WAIT to see you tomorrow!! You build that wall and we'll provide the steel!!! Come on Yinzers!!! Vote Trump!!!","post_message":"THANK YOU CALIFORNIA, MARYLAND, PENNSYLVANIA, & NEW YORK! I appreciate your unbelievable support. Together, WE will MAKE AMERICA SAFE & GREAT AGAIN!"}]
