[{"comment_id":"10153394569638984","commenter_b":"What's her problem. Can't she walk straight.","commenter_a":"Crook ( I mean acorn or nut ) probly isn't far from the tree","post_message":"Shakedown artist Al Sharpton’s eldest child wants damages for “loss of quality of life,\" but looking at her recent photos, something seems a little fishy about the claim...  Are you glad to see the younger Sharpton outed for this?"},{"comment_id":"858172280911557","commenter_b":"We'd be better served to ban the Muslims from our country period!","commenter_a":"Stick to your guns. We support you","post_message":"UPDATE: Gun Range Ban On Muslims Draws Fire  In the five months since Jan Morgan banned Muslims from her gun range in Hot Springs, Ark., business has boomed and predictions of a lawsuit brought by federal civil rights enforcers have so far proved inaccurate. Morgan, who claims keeping Muslims out of her Gun Cave... #guns #islam #shootingrange  @webpagelink"},{"comment_id":"10153982553531955","commenter_b":"Fire her!","commenter_a":"Where is this? Chicago..oh yeah..that crime riddled LIBERAL MESS..that place where there are 100's of black on black murders each week..that place where black lives matter the LEAST...that place where this ignorant fool of a so called teacher is. SAD AND IGNORANT.","post_message":"Public School Teacher Preaches \"Fuck The Police\""},{"comment_id":"10153287154044714","commenter_b":"Nope. She's a woman!","commenter_a":"Your father is a man I don't care he changes","post_message":"An incredibly touching story"},{"comment_id":"10153425250862217","commenter_b":"I had a design like that when I was in seventh grade in 1993. It was an idea from Dick traci and knight rider. Knight could talk to kit with. Glade it took so long for this to happen 23 years was all! lol","commenter_a":"Yall now getting this lol to late","post_message":"It's a lot more hi-tech than our day. Times tables written on our arms was the height of sophistication back then..."},{"comment_id":"10154144312645861","commenter_b":"I'm sure they don't assume Christians drink wine and eat tiny pieces of bread for attention, nor insult their robes or any other attire calling it dress up. OR stand up and interrupt their prayers/services when they disagree with it! Freedom of religion, and simple respect...ever heard of it? I hope you don't expect anyone to respect your religion!","commenter_a":"He wanted attention, he wanted to upset people. Someone should tell him his dress is too big for him/her....but not to worry Halloween will be here soon enough, and he can go get a new costume to play dress up in.","post_message":"\"I saw community of people come together and take a stand for what was right.\""},{"comment_id":"10153708694531955","commenter_b":"Stop all immigration","commenter_a":"Stupid people.","post_message":"Congress to vote on right of Muslims to migrate..."}]
