[{"comment_id":"1362072713808008","commenter_b":"ROTFLMFAO!!! Opine from the woman actually wearing an \"A$$\" hat! You just CAN'T make this stuff up!","commenter_a":"The Judge is a lawyer for La Raza. He is literally a La Raza Grand Dragon.. He has literally helped many illegal immigrants break the law in this country. Donald Trump could go further and he didn't but when you start doing some digging this Judge doesn't seem like a very nice man. A lawyer for a group who has said many times to \"kill all white people\".. Okay.. Donald Trump could go further.. You may very well make him show his hand and there's a lot to show on this judge and the company he keeps. The ONLY racism here is of the judge and the people he represents. Imagine if the Judge was a KKK member presiding over a case that affected black men. You'd be outraged. You know you would. How is the Donald going to get a fair shake when the judge is soooo clearly biased ...","post_message":"By refusing to denounce Donald Trump’s attack on Judge Curiel for the racism it clearly connotes, it shows Senate Republican Leader Mitch McConnell is the poster boy for the Republican spinelessness that allowed Trump to be the Republican nominee for President of the United States.   Senator McConnell has so fully embraced Donald Trump that we are all unclear as to where Trump’s platform ends and Senate Republicans’ begins."},{"comment_id":"10153455879676350","commenter_b":"Yeah a good dad would have married her","commenter_a":"Give it up. There are lots of dads out there that do the same","post_message":"\"In my stupid and exhausted brain, I thought only mothers should be that calm with a brand new baby, but it took only minutes of watching Carson with Jack and I knew...he was meant to do this.\"  Read Siri's sweet words about Carson Daly."},{"comment_id":"10153047231286615","commenter_b":"Dogs are innocent. At least a human can report what happens to them and make the choice who they stay with","commenter_a":"But you are all ok with James Harrison? He beat his girlfriend. Vick never harmed A HUMAN BEING.","post_message":"DEVELOPING: Quarterback Michael Vick is on his way to #Pittsburgh to meet with the Steelers, according to ESPN's Adam Schefter..."},{"comment_id":"1192440530796417","commenter_b":"She abstained from marriage and birth control","commenter_a":"I don't think abstinence means what she thinks it means.....","post_message":"Teen abstinence superstar Bristol Palin just gave birth to her second little bundle of hypocrisy."},{"comment_id":"10154323067108822","commenter_b":"Fourteen people are DEAD!","commenter_a":"So glad to see everyone is a judge!!! Are the kids wrong for what they did? Yes! Should they be punished for what they did? Yes! No one who made any of these comments could be their parents I'm sure or you wouldn't be saying such hate filled things. No one is going to win in situations like this, I pray all the families and businesses can come back from this, I pray something can be salvaged somewhere. And I pray everyone who has hate in their hearts can change. This world would be a much better place if people loved like they are supposed to, to much greed and hate now. How would any of you feel if they were your family members or if you lost someone. I'm sure some of you are christians?? Think about what you could do for someone instead of spreading hatred and negativity!","post_message":"JUST IN: 2 juveniles have been charged with starting the Tennessee wildfire that killed 14 people."},{"comment_id":"10155622855165354","commenter_b":"Pretty soon we'll be sending them on chartered flights, like the illegal immigrants we're busy with right now.","commenter_a":"uh huh!!","post_message":"Infuriating..."},{"comment_id":"678004185692498","commenter_b":"What self respecting woman wouldn't lash out at a woman trying to seduce her husband?","commenter_a":"“Bimbo eruptions.” “I would crucify her.” “We have to destroy her story.” These are just some of the things said and done by @username to undermine women who accused her husband, Bill Clinton, of infidelity and even assault. Hypocrites!","post_message":"\"This is not something that we can ignore. It's not something we can just sweep under the rug as just another disturbing footnote...this was not just a lewd conversation, this was not just locker room banter. This was a powerful individual, speaking freely and openly about sexually predatory behavior.\" —First Lady Michelle Obama on Trump"}]
