[{"comment_id":"10153880714231509","commenter_b":"It's her baby. If she says no then it's human trafficking.","commenter_a":"It's HER baby. Period. And the father and her can share it.","post_message":"Should the surrogate mother be able to keep her? This baby's future is now in the hands of the courts: @webpagelink"},{"comment_id":"10154707923201800","commenter_b":"hahahah omg yes!","commenter_a":"Now we're fucked. Like the Civil War and the Civil Rights Movement, this is yet another horrible scar on our nation. The damage was already done, and now it's just worse. I seriously hope our younger generations, myself included, can fix this within our lifetime. Shame on all of you who made this happen.","post_message":"Ready for either outcome. Tune-in to our LIVE Election Special tonight at 11/10c! #election2016"},{"comment_id":"596504240534222","commenter_b":"She is such a liar!","commenter_a":"If Donald would answer the question instead of just attacking Hillary perhaps she could stop having to check and correct his accusations first before actually answering the question in her own 2 minutes. Geez it's insulting that this man shows up to a debate unprepared. #whatajoke","post_message":"RT LIVE STREAM: Hillary Clinton / Donald Trump 2nd Presidential Debate (Courtesy: Ruptly)"},{"comment_id":"1003105503069410","commenter_b":"Taryn ignore her, she will forever think she is right about everything even though she's not","commenter_a":"Or we could just let every woman decide for herself.. If you don't agree with abortion, just don't get one. But that doesn't mean other people should be forced into the way you think..","post_message":"Not a bad thought - Let us know if you agree!"},{"comment_id":"1404359436262533","commenter_b":"Craigslist HIRED HACKS.","commenter_a":"Sorry not happening!","post_message":"WATCH LIVE: Local organizations are protesting at Phoenix City Hall to call upon Mayor Greg Stanton to make Phoenix a sanctuary city, among other actions."},{"comment_id":"10154563993751336","commenter_b":"No illegals. Period. No other country puts up with this crap. Not even Mexico. No more paying Welfare, etc., for these people. They break our laws and then steal from us. Those of us that actually pay federal taxes are sick and tired of working so they can have Free Medical, welfare, EBT cards, educate THEIR children, Welfare..Etc., Out they go. Deport them and build the wall.","commenter_a":"I'm all for Trump winning this upcoming election, but building the wall is a joke, and thinking he can make Mexico pay for it is a bigger one. Wall or not you're going to have illegals come in.","post_message":"\"[Donald J. Trump] has stuck to his guns on the idea that we're going to have a border, we're going to enforce the border.\"  Gov. Mike Huckabee joined Howard Kurtz on \"MediaBuzz\" today to react to the GOP presidential nominee \"softening\" his tone on immigration. @webpagelink"},{"comment_id":"1860114807561813","commenter_b":"What a couple of scheisters! They both belong in prison...","commenter_a":"They may have topaysomeback taxes.","post_message":"ANTI-TRUMP REP JOHN LEWIS Skipped Out On Paying Taxes On His DC Townhouse...He must have consulted with Rev Al Sharpton..."}]
