[{"comment_id":"10153864065907042","commenter_b":"Really 😂😩 home boy was like f that","commenter_a":"Angelo Djresearch Ravioli smh","post_message":"QUEENS 'GRINCH' STEALS CHRISTMAS: A postal worker in Ozone Park, Queens threw away 1,000 pieces of mail -- all because he was \"overwhelmed by the holiday season.\""},{"comment_id":"1272820716123006","commenter_b":"Women like you make me so embarrassed for my gender! The same that screwed America with Obamacare. Truly disgusting","commenter_a":"There is a clear path of the Democratic Party to take the presidency, the house and the senate... This is the core issue why the FBI director was pressured to make the announcement... #Ihaveherback Grab them by the polls vote blue","post_message":"JUST IN: Federal investigators looking into Hillary Clinton email matter have obtained the warrant needed to start reviewing emails found on laptop used by Anthony Weiner and Huma Abedin."},{"comment_id":"10153146604638690","commenter_b":"the terrorist girl.","commenter_a":"There is no age for crimes, a criminal is a criminal. You use children to score PR points in the media. These rocks can kill the passenger inside the car.","post_message":""},{"comment_id":"10153348953162217","commenter_b":"I saw a mother the other day getting into her car with her pjs, slippers and a cup of tea/coffee. I would be so embarrassed to take my kids to school like that.","commenter_a":"It's really difficult to put a top and jeans on. Come on it's 2016 😉","post_message":"\"There has been an increasing tendency for parents to escort children while still wearing their pyjamas and, on occasion, even slippers.\""},{"comment_id":"10153428454984087","commenter_b":"She is the biggest liar in history ,ashamed she was the first female to prove it.. Disgraceful bitch.","commenter_a":"Go go go >3","post_message":"\"Do you believe that The State Department, on NEW YEAR'S EVE, just released more of Hillary's e-mails,\" Donald J. Trump tweeted. \"They just want it all to end. BAD!\""},{"comment_id":"1750956915163116","commenter_b":"Leave voters have woken up, it's time for these people to accept this country belong to people who have been here for centuries. The racist abuse that comes from people who have no rights to be here, is killing our country. EU is based on lies and corruption, people need to be protected from people who have no respect for the British people. Immigration need to be stamped out people who are not suppose to be here should be returned home. Enough of the rubbish people keep trying to push the boundaries of the country to an extent of hatered breeding in a peaceful country. Stay campaign maybe help all those who have no rights to be here, leave campaign had been made to rebuild their country for those who live for the moment.","commenter_a":"A \"so-called\" majority can be wrong. The referendum was a bad idea. The parliament are the elected representatives meant to lead and decide. It's a bad outcome for everyone, and is a very bad example to all in the world on how to get along in the global economy, and especially from a social perspective. We live on the same planet. We're not going anywhere else soon. We should share it. Borders are historically recent and arbitrary. Nationality is random (not a choice where you are born, just luck). It is not the most important thing. We all belong to the same human race.","post_message":"Join our live debate and tell us where you stand on a second referendum on leaving the EU."},{"comment_id":"10153947614518855","commenter_b":"They have tiny dicks lol","commenter_a":"@username @username she was a grindho","post_message":"Surprised?"}]
