[{"comment_id":"10155558251545354","commenter_b":"If I was her I would bow out of this hot potato that may leave egg on her face!","commenter_a":"Who really cares Baltimore's become the septic system of America","post_message":"Uh oh...."},{"comment_id":"1111506912205431","commenter_b":"The video basically implied that Donald Trump was a racist simply because he doesn't want illegal immigration in this country. There is an enormous amount of drug trafficking, Sex trafficking and a lot of bad people are coming through our borders. Yes their are a lot of great Latinos in this country and my husband is one of them but what basically everybody is saying is that Donald Trump is a horrible person and a racist simply because he wants to stop illegal immigration in this country. let's not get started on what people are saying about Donald Trump supporters. That we're ignorant that we are racist. And please don't lecture me on how I should respond to things! Like I'm some child in a classroom and you're the teacher. You're being extremely condescending.","commenter_a":"This is total bullshit!!Mexicans that think we are racist because we want to have a wall how about the wall you have between Guatemala and the Mexico border. None of you ever answer that question. (and if you want to get technical it's not a wall it's a huge fence with Barbwire on top of it)And I'm not a racist my husband is Latino and my children are considered biracial so stick it where the sun don't shine,I don't want to hear any of that crap.The people in this country are totally fine with legal immigration it is illegal immigration that Americans have a problem with. I don't see Mexico having open borders and even if they did they certainly wouldn't be giving illegal immigrants welfare food stamps Medicaid I could go on and on and it's all being paid for by the hard-working American taxpayers.it sucks when you live ...","post_message":"The Latino community has a powerful message for Donald Trump.  #MicBrights"},{"comment_id":"1134174459956481","commenter_b":"Put her in jail for contempt of court","commenter_a":"This trash needs to leave, NOW!!!","post_message":"Muslim Woman Refuses To Take Off Head Scarf In Court, So No-Nonsense Judge Does THIS In our country you have to follow the laws of our court. If not,  suffer the consequences. Do you support this no-nonsense judge?"},{"comment_id":"10152908663462434","commenter_b":"And he testified she was having a good time. Three sides to every story- his, hers and the truth","commenter_a":"Everyone acts like this is an isolated case. Boys pressure girls into having sex every day.","post_message":"In interviews with police, Labrie denied raping the 15-year-old, saying he’d put on a condom for what was supposed to be a consensual encounter before experiencing a “divine inspiration,” as he put it, and leaving the room. In testimony, he said the hook-up was consensual, and that having penetrative sex with the girl “wouldn’t have been a good move for me.”"},{"comment_id":"10154991575839170","commenter_b":"Donald Trump our President will repeal it !!! And all politicians will live on the same policies","commenter_a":"He's a turncoat I do not trust him","post_message":"We didn't like it at the time, but let's compare what would have happened then to what's about to happen now."},{"comment_id":"10154038574341337","commenter_b":"Fuck, fuck, fuck a duck Screw a kangaroo Sixty-nine a porcupine And hope he blows you too....","commenter_a":"South Park did it best. See: Mystery of the Urinal Deuce","post_message":"MURDERED BY OBAMA? These Antonin Scalia conspiracy theories are insane..."},{"comment_id":"10154258847492014","commenter_b":"Go ahead and lose money for a day. It don't prove we need illegal's coming here, not when Americans of all colors need a job and are living on the street. Before some moron says something stupid, yes there is Americans that will do the jobs illegals are doing for les money.","commenter_a":"Isn't it illegal to employ illegal immigrants? You are not paying taxes for those employees right? The people Trump wants deported are Criminals! Are those the employees you have working for you? Why don't we work together to find a way to get the immigrants who want to become American citizens and follow our laws a way to do that, like most of our grand and great grand parents did.","post_message":"\"It's snowballing into something huge and is sending a message about the importance of immigrants to the economy\""}]
