[{"comment_id":"1042991895769865","commenter_b":"Assholes","commenter_a":"The WORST representation of what New Yorker are really LIKE! He's a Schmuck","post_message":"Let's try this again.  (And hey, while you're here, make sure to RSVP for our \"Vote against Trump\" page, and let the world know you are going to vote against him:  @webpagelink/ )"},{"comment_id":"1243167749095092","commenter_b":"When i said this far. I'm talking about she's the presidential candidate. Her ass should be in jail by now.","commenter_a":"WAIT!! Who is to say she has gotten \"This Far!\" The News Media!?? Her rallies attract less than 400 people on the average. I believe. I know democrats who are voting for trump that have told me They don't even like him but Hillary will destroy this country! Everything we see and hear is from the \"NEWS MEDIA!\" Listen America, I saw and heard an interview with George Soros overseas last week. He said Donald Trump will win the popular votes of the American people by a \"Landslide!\" BUT!..We have found the Achilles heel of Western Civilization. The electoral votes. Hillary will win by the way the electoral votes have been put in place....America this is scary. The election is rigged way more than the news media is letting us know. I'm sure Donald Trump knows this too. Personally I am praying and asking God to intervene in this election ...","post_message":"Arkansas's attorney general just issued a jarring statement about Hillary Clinton, the state's least favorite daughter.  What the AG says needs to be seen by every American."},{"comment_id":"10152859650389877","commenter_b":"Girl, bye.","commenter_a":"It looks like there's another sign that says \"Down\" so, I'm hoping the other sign, which we can't see, says with... Would spell out \"Down With White Power\". I'm curious to know what the colors of the other team are?","post_message":"High school students flash 'white power' signs at basketball game. Read what happened next below.   Grio fam, what should the punishment be 4 this ignorance? #soundoff"},{"comment_id":"10153555053111037","commenter_b":"I bet you any money she can't breathe anymore","commenter_a":"When will people learn the cops will not lose!! I don't care what color u r, she said \" I'm gonna see u in court \"! She baited him. Why would cops kill her in jail? It's another cry baby black!","post_message":"Newly released dash cam footage shows the events that led to Sandra Bland’s arrest."},{"comment_id":"10153933617414411","commenter_b":"Go fuck a pig!","commenter_a":"This is what happens when Islam gets a hold of a country. Back to the dark ages we go","post_message":"BREAKING: 8 coalition troops killed across Afghanistan"},{"comment_id":"1222586881085915","commenter_b":"I can't believe a woman would even consider voting for Trump unless they are Transgender.","commenter_a":"It's pretty obvious that TRUMP will be President --- and I can't wait -- Hillary would be a disaster ---No one can say that TRUMP would be worse than Obama or Hillary --- Remember don't listen to polls or media -- they are just media bias--- TRUMP TRAIN all the way to DC ---- Don't forget to VOTE in the remaining Primaries","post_message":"An honor to receive the support from golfing legend, Jack Nicklaus. I will defeat Crooked Hillary Clinton in November, and we will MAKE AMERICA SAFE & GREAT AGAIN!"},{"comment_id":"968012613239597","commenter_b":"Wtf? This is annoying. She was extremely fat, tried out for a show, lost all kinds of weight and is now complaining. If it was horrible she should have left. Choices! I'm sure this wasn't the first time she felt humiliated. I mean come on... She was all about it when she was trying to win some money... She sucks","commenter_a":"Totally off topic but her mannerisms remind me of Ginny Goodwin as Gigi in He's Just Not That Into You","post_message":"The way she describes her experience competing in the show ... it's so messed up."}]
