[{"comment_id":"621940064660952","commenter_b":"everyone can do something....u are allowed to make a certain amount of money....pay enough and you can get any documentation from a doc. disable now a days has a broad spectrum.....defining disabled. ....I know Vets that have missing limbs and they have to prove every year that the limb is still missing and gas nit grown back","commenter_a":"these so called christian politicians could learn some thing about welfare and hand outs to people who don't want to work. 2 Thessalonians chapter 3 verse 10. (even when we were with you we commanded you this,if anyone will not work neither shall he eat. amen.","post_message":""},{"comment_id":"10153526627596636","commenter_b":"She is full of hatred","commenter_a":"Burma/Myanmar is a country with many problems, including persecution of muslims. From what I've read of the interview the journalist only wanted to talk about the problems of the muslims and presumably that was not what Aung Suu Kyi was expecting since no one had bothered to tell her that the main topic of the interview would by the persecution of the muslim minority. No politician likes to go into an interview unprepared.","post_message":"According to the man who revealed it"},{"comment_id":"876414139081949","commenter_b":"You guys should follow the example of other country's. In Panama there is a big movement right now. No more inmigrants! Everybody is taking the social media and demanding that all the undocumented get out of the country! So let your voice be heard!","commenter_a":"Grinning fool. Poster picture for Term Limits.","post_message":"Click to see the back-room deals Republican leaders are making to fund Obama's executive amnesty..."},{"comment_id":"955924071085730","commenter_b":"Jan St John...ROFLMAO!!!! James Taylor is a lawyer with no training in climatology ...he's a sr. Fellow at the heartland institute which draws major funding from the likes of the coke bros,exxon and a number of other oil&gas companies....this is the best you can come with","commenter_a":"It was 40 above in Alaska last week.","post_message":"TELL ALL YOUR FRIENDS"},{"comment_id":"1765714417015228","commenter_b":"You girls sound like that reporter that went over there to prove her point and got killed by them. LOL","commenter_a":"Totally believe women should be able to wear burkas as part of their religious dress, same for the Jews and their hats, etc. This is disgusting.","post_message":"The bill wouldn't just prohibit Muslim women from wearing burqas or veils in state driver license photos, it would also ban them from covering their faces while driving and possibly while on any public property."},{"comment_id":"10152712712566545","commenter_b":"That was a WOMAN.","commenter_a":"That lady in the van just opened a can of Whoopass","post_message":"Here's the incredible ending to a nerve-wracking chase in Dallas County. We'll have the latest on News 8 at 4.  TO WATCH/READ MORE: @webpagelink"},{"comment_id":"1061299707312818","commenter_b":"What an ass! Leave already.","commenter_a":"yah these dumbASSES are going to tell me to be tolerant with the beheading of CHRISTIANS in the MIDDLE EAST, hay DUMBass just cause a lot of people cannot believe that you are a focking muzlum dose not mean I'm going to kiss the muzlumz assss as they behead more Christians, BTW who the fock are you to tell us to be tolerant with the shayton muzlumz? name one Christian that has beheaded a muzlum this month, or this year, or even this century, you bass TURD have allowed so many innocent Christians to be killed by your demonic muzlum family, you have their blood on your hands, and their blood is crying out to GOD ALMIGHTY FOR JUSTICE. allahoooo ACHK BARR and GRILL YOU FOCKING BASS TURD.","post_message":"The Obamas have always gleefully kicked Christians to the curb during Christmas. This year was no different."}]
