[{"comment_id":"10153264086439342","commenter_b":"All you women bashing this woman are evil! Women are the quickest & most harsh to tear another female apart! Low life, heartless, evil women!","commenter_a":"The amount of alcohol that it would take for me to touch that would kill me...","post_message":"A Spring woman says she was sexually assaulted by a deputy during a traffic stop earlier this summer."},{"comment_id":"1114761541897178","commenter_b":"Do me a favor. Never EVER put this ugly bitch's face on my timeline again","commenter_a":"moron","post_message":"***FIRESTORM OF DEMOCRAT LIES***"},{"comment_id":"10153065703956717","commenter_b":"Glad she's getting threats! Don't go to sleep, bitch!","commenter_a":"Another reason I wouldn't live down south.","post_message":""},{"comment_id":"1012758612153724","commenter_b":"Well, now that she will be sitting at the grown-ups table, we will notice just exactly how much food she gets all over her face.","commenter_a":"I think DT,were say that she was ugly!!!","post_message":"Carly Fiorina will finally get her chance in prime-time."},{"comment_id":"1042027782504360","commenter_b":"Bitch would've been sucking soup out of a straw...","commenter_a":"This warms my soul.","post_message":"This is some serious racism. Would you have slapped her after she spit on you?"},{"comment_id":"10154030694113812","commenter_b":"I think the kind of look like little foxes... so cute!","commenter_a":"I don't know the reason they call them red pandas when they resemble Raccoons","post_message":"After a 2-year hiatus, red pandas have returned to the Smithsonian’s National Zoo and Conservation Biology Institute."},{"comment_id":"10154464695802994","commenter_b":"If it is against her religion for birth control, she shouldn't be having sex out of wedlock either then","commenter_a":"Babies are blessings and I'm sure she loves them. But it's probably time for some birth control. 3 kids at 20 is quite a bit, but 6 is a lot (seeing as if they weren't twins someone would have to start around 13 and have a baby every year so I'm sure it hasn't happened much)","post_message":"\"My regrets would be timing, but I'm really happy that I can even create babies or have life because some women can't do that,\" 20-year-old Danesha Couch said."}]
