[{"comment_id":"1542774025748103","commenter_b":"As usual women come ro the rescue","commenter_a":"What kind of crap insinuating Hillary in this???","post_message":"YES!"},{"comment_id":"10154378040854024","commenter_b":"Wow! That woman is looking dumber every day!","commenter_a":"Flippin greedy, deranged, bitch whore!","post_message":"“Now this is just getting ridiculous. She didn’t actually meet the standards in PA to have a recount, so she’s going to try to evade them by calling them ‘unconstitutional’. She raised enough money specifically to deal with the fees and then pulled out when asked for it. The whole point is to tie up the electors so they can’t vote for Trump.”"},{"comment_id":"1044948272235591","commenter_b":"The RINOS & Dumocrats ALL SLEEP IN THE SAME BED. THEY are disgraceful group of piglets!","commenter_a":"Your a lier just like Obama you have so many people out here out of work and homeless what planet are you living on why don't you idiots venture outside the District of Columbia and visit the real Americans.","post_message":"Get in line, Americans. Paul Ryan knows best."},{"comment_id":"1249235748461513","commenter_b":"Hillary laughed after getting a child Racist off with 2 months served !!!","commenter_a":"In 1978, Bill Clinton violently raped Juanita Broaddrick in a Little Rock, Arkansas, hotel room, then, as he was leaving, looked at her bloody lip and said: \"Better put some ice on that. Corroborated by five contemporaneous witnesses Knowing full well about Bill Clinton proclivity to sexually assault women, about three weeks after that rape, Hillary Clinton cornered Broaddrick at a party and said, pointedly, just want you to know how much Bill and I appreciate the things you do for him. Do you understand? Everything you do. In the early 1990s, Bill Clinton invited a young female staffer to his hotel room at the Excelsior Hotel in Little Rock, dropped his pants and said, it. As CEO of an organization, Bill Clinton had a young female intern just months out of her teens, perform oral sex on him while he made business calls. That girl name was Monica Lewinsky. ...","post_message":""},{"comment_id":"10153286048671717","commenter_b":"Hideous bitch","commenter_a":"If u don't like the laws, move No one is keeping u here.","post_message":"Indiana legislative proposals: Washington florist to testify against LGBTQ protection bills"},{"comment_id":"10154077831881509","commenter_b":"Tell them to eat pork!","commenter_a":"I don't think I have read more ignorant comments than those supporting Ben Carson. Yes, Carson is entitled to his opinion but it shows the complete lack of understanding of the way our nation operates. A man who believes he can pick and choose which laws to obey is not qualified to run as President. Where are all the Christians who were crying about religious liberty? This man wants to take away the religious liberty of a very large portion of those practicing a different religion. A very sad day for America and those haters bashing the Muslim faith.","post_message":"A call for Dr. Ben Carson to drop out: @webpagelink"},{"comment_id":"10152943913476051","commenter_b":"Laura Mae Floering go break a hip old saggy tits","commenter_a":"We can't have white history month United white college fund White entertainment television White colleges That would be racist right?","post_message":"When a deli owner posted this sign on the front of his business, he didn’t think it would be that big of a deal. Well, it was. Now he's dealing with the consequences."}]
