[{"comment_id":"10153875809248352","commenter_b":"Thank you Doriaan. This bitch hatin ain't she?","commenter_a":"Instant reflex nigga don't touch me while I'm performing bitch you lucky that's all you got...KEVIN GATES THAT MOTHAFUCKING NIGGA","post_message":"RAPPER BRUTALLY KICKS FEMALE FAN BECAUSE SHE TOUCHED HIS SHORTS. REALLY? #DISGUSTING"},{"comment_id":"10154318363317232","commenter_b":"Why aren't they being plowed through? Run these scumbuckets down!","commenter_a":"Sent in the robot","post_message":""},{"comment_id":"451917294996564","commenter_b":"As far as I know, no Subway in America has made this kind of change.","commenter_a":"So how many muslims vs AMERICANS are there in the U.S. that needs changes. REALLY?","post_message":"Should we boycott Subway?"},{"comment_id":"952645251457544","commenter_b":"I would kick they asses!!!","commenter_a":"Somebody goin down tuh-dey d'ere boy! This is a sign that everybody is not equipped to run a daycare. Idiots!!!","post_message":"Cornelius Jones went to pick up his one-year-old daughter, Journee, from daycare... only to find the facility closed. After hearing his daughter’s cries, he flagged down police who found the young one crying & crawling in the dark.   Employees said they thought Journee was a doll. DETAILS ----> @webpagelink"},{"comment_id":"1134932883194388","commenter_b":"down, look at the squares on the sides","commenter_a":"I think up it is hard to say!!","post_message":"o.O"},{"comment_id":"10153588117402235","commenter_b":"An abortion is cheaper than kids...just sayin","commenter_a":"Ummm...2 things here...this jail is ridic for withholding/failing to administer medicine for an inmate...but also, stop having kids if you can't afford them...now these kids will be a burden on the system and are at risk to perpetuate this same cycle...aren't condoms like $5 wtf","post_message":"He was arrested for unpaid child support.   Now he's dead."},{"comment_id":"10153035284712434","commenter_b":"Go move to syria ...bitch","commenter_a":"It is inhuman to turn these people away. The terror experienced in Paris for one night is what they go through on a day to day basis and you want to send them away? Have some empathy, what if it was you and your child fleeing this barbarism? Turning them away is no better than away Jewish refugees during WW2 (see SS St. Louis). How anyone can see their suffering and simply ignore it or tell them to leave defies any and all tenants of a Christian faith, humanity, and what America stands for.","post_message":"How very Christian of them."}]
