[{"comment_id":"1171676779558735","commenter_b":"What couples?Floyd has a harem of women like this in Vegas!!","commenter_a":"these celebrity couples are getting ridiculous.........i can understand the attraction to cash but at least try to hide it...","post_message":"Floyd Mayweather is dating a 19-year-old New Look sales assistant from the West Midlands."},{"comment_id":"10153182951850950","commenter_b":"Oh, just stop with the outrage already. African countries sell these permits for more than the price of the average house in the USA, and only allow hunters to take the old males that have already reproduced. The people in the communities get the meat, sometimes by the ton.","commenter_a":"Sad. Money wins","post_message":"Though Zimbabwe's national parks authority said the shooting of a massive African elephant was legal, some conservationists said it's unethical."},{"comment_id":"10153647495544877","commenter_b":"@username is fine. Off subject. .but i had to get that out there. Hey boo...","commenter_a":"Let's try something new black America. Let's not break the law and put yourself in a position to get shot and I bet pretty good money u will live. Lol","post_message":"Thousands of Asian-American Protesters Rally in Support of Officer who Killed Unarmed Man in Housing Stairwell. Watch how it all unfolded below.   Grio fam, protesters said this is '1 Tragedy, 2 Victims.' What's your reaction?"},{"comment_id":"10153391178593132","commenter_b":"And there's that mentality, \"if you're white you can't have an opinion.\" Yet we're the racist ones right? You do know every time you say that you shame someone of color who is dignified and intelligent, because they get lumped in with the likes of you.","commenter_a":"I don't like playing the race card!! But this is proof!!! Wow!! If she was Latin or a African American person! She wouldn't get off so easily! They shoot to kill us... Jt saying","post_message":"Ouyang told authorities that her behavior was a cry for help."},{"comment_id":"10153316215802377","commenter_b":"\"We're\" what has he got to be mad about - he's part of the problem.","commenter_a":"I'm glad he didn't get it for president.","post_message":"\"Certainly part of what is behind the energy and the passion for Donald Trump on the Republican side and [Vermont Sen.] Bernie Sanders on the Democratic side is the frustration and anger people feel in this country,\" Mitt Romney said."},{"comment_id":"10154889313644411","commenter_b":"Well hes planning to shut alot of military bases around the world, and hes said hes not paying into nato waist of money he said, at the end of the day we all have to wait and see what hes going to do, you never know he might do a better job than all the other so called politicians in the past.....see how","commenter_a":"He has a point, and America needs a business man to balance the books and help the American people.","post_message":""},{"comment_id":"10154175784276509","commenter_b":"So how bad do you want a woman elected?","commenter_a":"Bernie Sanders cannot win a national, general election. Social media supporters should probably accept this.","post_message":"Bernie Sanders is signaling that he's increasingly willing to take personal shots at his chief rival Hillary Clinton in the Democratic primary."}]
