[{"comment_id":"10154264988769062","commenter_b":"Outta place.","commenter_a":"I hope they put trash bags in his cell.","post_message":"CORRECTION: The Harris County Sheriff's Office released a corrected mugshot of Shannon J. Miles. The mugshot displayed at the HCSO press conference was incorrect. Miles is charged with capital murder in last night's shooting death of Deputy Darren Goforth.@webpagelink"},{"comment_id":"10153794102616051","commenter_b":"Agree,she should be in prison","commenter_a":"AGREE","post_message":"Donald Trump says Hillary Clinton's record of scandals make her unqualified to be president. Do you agree or disagree?"},{"comment_id":"10153540749847452","commenter_b":"Yousef Danial","commenter_a":"Mariah Morgan Savannah Marshall wtf hahaha","post_message":"A suspect wanted for attempted murder hits multiple cars while trying to escape the California Highway Patrol during a chase on the 91 Freeway in Orange County. abc7.la/1NlhVx9"},{"comment_id":"1159279537467495","commenter_b":"The Obama 's are more racist then anyone else Michelle everytime she opens her racist mouth it's all about her give me a break and it's true the other 1st ladies have more class then she will ever have and it has nothing to do with the color of her skin if the whites are so racist he wouldn't have been in office","commenter_a":"I wish she has racism up her back side!!!","post_message":"Michelle Obama Calls Out Military Racism  This Marine Answer Is DEVASTATING!"},{"comment_id":"502459539951113","commenter_b":"RINO","commenter_a":"Who cares about Romney! Let's move on and win this one!","post_message":"You cannot be serious."},{"comment_id":"863625973741296","commenter_b":"Absolutely. ...praying for him and his family","commenter_a":"Allready did","post_message":"Kentucky Police Officer Shot Down In Cold Blood, Killer Still On The Loose The media is silent, no Al Sharpton, no Obama, nothing. Will you pray for him and his family?"},{"comment_id":"10153974959029087","commenter_b":"@username I would be suprised if you cared.","commenter_a":"Funny to read some of the Trump supporters defenses that show they didn't read the article. First, the pictures weren't taken outside of the US, they were taken here. So the argument that they \"could have been taken outside of the country\" doesn't hold weight. Second, yes, models come here and do photoshoots \"all the time\", however, as the article states, there is a way to do it legally, and a way to do it illegally/fraudulently. From her own statements, it seems there might be a case where it was done wrong. And lastly, it does matter because Trump's platform is \"do it the right way, she did it the right way\", and if she didn't do it the right way, then it is yet another lie and makes them hypocrites. I realize she isn't running, but he is so he made this an issue. If this were the Michelle ...","post_message":"Melania Trump has said she first came to the United States in 1996 on a short-term visa, which wouldn't have allowed her to work as a model. But a recently published nude photo shoot shows that she was working in the country in 1995."}]
