[{"comment_id":"10153667597986770","commenter_b":"She belongs in prison!","commenter_a":"Prison","post_message":"Hillary Clinton thinks she should be president. But does she really belong in prison? @webpagelink"},{"comment_id":"1048204431922451","commenter_b":"in the beginning of his campaigned media said he was a Muslim,friends of the activist terrorist eyre and his pastor mentor for 20 yrs condemned America,his wife hate America, the only PRESIDENT APOLOGIZED FOR AMERICA and the people still vote for him, and look America now, bankrupt morally,financially,economically and bankrupt spiritually. AND THE BAD NEWS HILARY GOAL IS TO FOLLOW HIS STEPS. IF ANY ONE OF DEMOCRATIC WIN, THE END OF AMERICA . WE WILL BECOME A SOCIALIST ,COMMUNIST COUNTRY LIKE CUBA AND SOCIALIST COUNTRY OUR LIFE WILL RUN BY THE GOVERNMENT. YOUNG PEOPLE ARE BRAINWASH OF THE SOCIALIST TEACHERS IN SCHOOL AND UNIVERSITIES. PRAY FOR OUR COUNTRY AND YOUNG PEOPLE,","commenter_a":"I have been saying that for years!!! He isn't going to do anything to hurt his peeps.","post_message":"Former CIA Agent Says Obama is Working With The Muslim Brotherhood Against America. ⋆ Please Share ⋆"},{"comment_id":"605402049616235","commenter_b":"@username AMEN! She's just a stupid troll!!!","commenter_a":"He was probably drunk while being on the snowmobile. It will take more than duct tape to shut his wife's mouth.","post_message":"\"Knowing Todd, once he's cognizant, he'll probably ask docs to duct tape him up and he'll call it good. He's tough,\" Sarah Palin said."},{"comment_id":"1137481012959422","commenter_b":"Get the hell out, asswipes!","commenter_a":"I wish Scottland would welcome me in. I've had it with the states.","post_message":"In case you missed it: Syrian refugees arrived in Scotland this week. This is how they were greeted."},{"comment_id":"10153781629863132","commenter_b":"stupid girl","commenter_a":"I feel so sad for Anna and their four little M's","post_message":"Anna Duggar will likely not be leaving her husband Josh despite his admitted infidelity."},{"comment_id":"1256135284407480","commenter_b":"Er, spider silk has almost nothing to do with a spider's reproductive system, other than if some species use it for mating rituals. So I don't think you can rape a spider. If they were to take off the harmless pins, it would find a corner and immediately start building a web, because it's a spider and it has no conscience. The closest I can relate to this spider is giving blood.","commenter_a":"Wow. That's horrific and pretty fucked up","post_message":"Poor spider!"},{"comment_id":"10153880713234753","commenter_b":"Do better job then Hillary","commenter_a":"Vote trump","post_message":"A Latino Trump supporter in California claims it’s a lot more difficult to publicly support Donald Trump than to come out as gay. Juan Hernandez, who is a member of the Log Cab Republicans, a gay conservative group, indicated that he was leaving the Trump rally in San Jose, California, on June 2, when a mob of violent Trump protesters attacked him, breaking his nose in the process. A friend was similarly set upon by the assailants, some of whom carried the Mexican flag and were burning the... @webpagelink"}]
