[{"comment_id":"10152827185410047","commenter_b":"Welfare mothers should not get any money either","commenter_a":"like","post_message":"Planned Parenthood is the leading abortion provider in the United States while continuing to receive millions of dollars in federal government funding each year.   Our tax dollars shouldn't be funding the slaughter of innocent unborn babies. SIGN & SHARE to defend life and defund abortion: @webpagelink"},{"comment_id":"1096976973728618","commenter_b":"No! You think this is a country of racism then take your black brethren with you and YOU all move out. You own colour sold and brought you here, stop acting like everyone else owes you something.","commenter_a":"Why?? Why would you tarnish your gold!! The first black woman and you trash your chance to be a roll model and a proud American! Wtf is wrong with you! You just ruined your chance at becoming everything I wished for you! You Dumb bitch!!!","post_message":"I can't even anymore with this garbage..."},{"comment_id":"933218310052361","commenter_b":"So how many snipers are needed to guard them from poachers?","commenter_a":"There's a herd in Florida too.","post_message":"Well, would ya look at that! (via TakePart.com)"},{"comment_id":"10154978304691037","commenter_b":"How many more horny female teachers will yahoo report?","commenter_a":"Another ungrateful millennial.","post_message":"The 29-year-old will serve two years behind bars."},{"comment_id":"1196992380374839","commenter_b":"Too bad all his accusers wernt nasty enough!!! .lmao...","commenter_a":"Not going to happen!","post_message":"We're in Raleigh, North Carolina where Elizabeth Warren is campaigning for Hillary Clinton. @webpagelink"},{"comment_id":"1867582453468544","commenter_b":"Stupid bitch","commenter_a":"you make it like i did , hard work bitch , no hand outs","post_message":"One of the co-founders of Black Lives Matter just said that \"white folks\" need to \"sacrifice\" THIS for her movement... this is an outrage.  America needs to know the goals of this movement... they're not going to like this."},{"comment_id":"863998766982005","commenter_b":"Women. Are. Psycho.","commenter_a":"not worth it.","post_message":"A woman has died in a car crash after chasing down her husband who was with another woman. What do you think? Crazy details here:"}]
