[{"comment_id":"692204600931973","commenter_b":"RIGHTTTTT","commenter_a":"@username WHAT THE","post_message":"This robot wants a family...and to destroy humans."},{"comment_id":"792840600880967","commenter_b":"I agree, but so does the weak Democratic Party leaders who have also FAILED us.","commenter_a":"I'm a democrat, Maxine Waters please sit down and regroup. The Democratic Party is weak weak weak and has no legs to stand on and you, Nancy Pelosi and Chuck Schumer need to be replaced period.","post_message":"Maxine Waters on Trump advisers: \"This is a bunch of scumbags. That's what they are, who are all organized around making money.\" @webpagelink"},{"comment_id":"10153279094626051","commenter_b":"Get her out of there before she does any more damage.","commenter_a":"Kim Davis is where she belongs for disobeying the LAW.","post_message":"Hillary Clinton says Kim Davis belongs in jail. Do you agree or disagree with her?"},{"comment_id":"1167985886552093","commenter_b":"Who cares she's a phony crook sanders all day","commenter_a":"I am voting for HRC!","post_message":""},{"comment_id":"1048601445225209","commenter_b":"I know... she has effectively modeled pant suits for old bags of dirt","commenter_a":"So tell me and please be honest what has Hillary done for America like a policy or a law or something that has benefited us you know she's been in politics for over 25 years been the first lady and a senator and Secretary of State what actually has she done for us and don't use her as an example.","post_message":"What our president says matters. We can't let Donald J. Trump's hateful words speak for us."},{"comment_id":"957772524242927","commenter_b":"Kiss ass!","commenter_a":"Great now Quebec will never get a team","post_message":"Gary Bettman, are you listening?"},{"comment_id":"10152809432022060","commenter_b":"Ummmm she made that choice! PLEASE quit pretending she was Innocent!","commenter_a":"Oh yea she looks real scared. She was with him two weeks? Cant lay her choices on him.","post_message":"Faced with the vicious way in which Dexter Allen is accused of killing the victims, Haraquon Degruy's mother believes she was trapped, unable to flee for fear of repercussions against herself or her family."}]
