[{"comment_id":"10153335080543487","commenter_b":"@username - actually that's what women think but if you're not paying attention, between sitting down and standing up, sitting down is far messier.","commenter_a":"They should also sit down to piss. In solidarity.","post_message":"From our archives: An ethicist explains why he and his fiancee rejected this centuries-old tradition."},{"comment_id":"1028894700543062","commenter_b":"Is that a slit in her dress up to her you know what? Inappropriate for the First Lady. Not running for first slut!","commenter_a":"Moochie, it's gonna take more than $12000.00 to make you the Lady of Camelot.","post_message":"Woman of the People"},{"comment_id":"599148503619234","commenter_b":"Yeah bitches","commenter_a":"We all know who... @username Daniel Hughes @username","post_message":"This is so accurate  #WSHH"},{"comment_id":"1017002171709344","commenter_b":"I would feel equally disgusted voting for either one.","commenter_a":"That's a Question ?","post_message":"Multiple Choice Quiz time, Republican kiddies! Which answer did you choose? A or B?"},{"comment_id":"10153132008994497","commenter_b":"Conceded bitch... this shit practically writes itself. Lol","commenter_a":"This sick beat. Oh no!! Now what? Gimme a break. Never heard something so idiotic. A phrase? Boooooo!! :)","post_message":"From our sister publication:  The A.V. Club: \"From this day forward, any and all sick beats belong to Taylor Swift, under penalty of law.\""},{"comment_id":"427202340738140","commenter_b":"Pharmaceutical companies cannot profit so much that's why they do not do what they are supposed to do is protect the public","commenter_a":"Lauren Martin","post_message":"This video is from a new documentary The Culture High which looks at both sides of the marijuana prohibition argument."},{"comment_id":"10153724968238145","commenter_b":"Wow the desperation of perverts grown woman don't want you so you seek a teenager . Get rid of scum bag .","commenter_a":"Glad they got him.","post_message":"BREAKING: This happened at the Publix on SR-434 and Wekiva Springs Road. Angela Jacobs will have a live report at 12pm."}]
