[{"comment_id":"10154131351242232","commenter_b":"She doesn't stand a chance against Trump","commenter_a":"Well we are screwed","post_message":"#Breaking. Hillary Clinton has won the Pennsylvania Primary and is about to take the stage. @webpagelink"},{"comment_id":"1954618021430775","commenter_b":"It aint over till the fat lady sings,lol","commenter_a":"Mark my words, in future presidential elections, candidates will try to do what Donald Trump is doing.","post_message":""},{"comment_id":"914975468564571","commenter_b":"Yup the woman is a <unt","commenter_a":"The mayor told the police to stand down and let them destroy the city so blame her and your president","post_message":"BALTIMORE: Shop Owners called police 50 TIMES  and no one came!  @webpagelink"},{"comment_id":"10153969418599575","commenter_b":"Mike Carter was it ever great? Living on credit was the way to create happiness, no one is talking about the pitfalls!","commenter_a":"None of the other Candidates are even mentioning Veterans! They have already had 6 Debates. I am going to watch the other channel and vote for Trump!","post_message":"Donald Trump is going to skip Thursday's GOP debate.   “We’ll have an event here in Iowa, with potentially another network, to raise money for wounded warriors,” he said. “And Fox will go from probably having 24 million viewers to about 2 million.”"},{"comment_id":"10153561023428984","commenter_b":"Go back home you stupid little bitch!!!","commenter_a":"Twitter Bomb her page till she leaves! REMOVE ALL of the spoiled \"idols\" your kids listen too, that say they Hate the Country that gave them the Opportunities to influence them!","post_message":"Globally known, pop-star diva Ariana Grande just told the world that she hates America... so karma just got its PERFECT revenge.  Her snobbery and selfishness are famous so this is not a huge surprise... she deserves what she gets."},{"comment_id":"10155458466225354","commenter_b":"Just a bunch of average women.","commenter_a":"I still cannot wrap my head around the positive reinforcement people give instead of being honest and constructive. Don't take her to dinner, take her to the gym.","post_message":"\"They’re no angels—and they own it\""},{"comment_id":"10153184382439255","commenter_b":"History has lots of examples of jobs we don't want. Thank of all those guys running the gas chambers who were out of work when the Nazi Death camps closed. You are truly pathetic.","commenter_a":"Stunning. You're actually in favor of businesses shutting their doors, laying off people and possibly going under all in your vendetta against one man? You are truly pathetic","post_message":"A sign of victory."}]
