[{"comment_id":"540250699432857","commenter_b":"Really? ?? So does that go both ways, women cant be trusted watching kids that arent theirs I? ?? Your blanket statement, is kinda bullshit","commenter_a":"Some people treat their animals better than they treat their children. Why not take the baby with you? Never trust boyfriends with your kids.","post_message":"A woman and her friend wanted to run to the store, so she asked her boyfriend to watch her friend's kids for a little while. The women returned about a half hour later to find the man had done something horrific."},{"comment_id":"1158332250952774","commenter_b":"I am an American who moved abroad and I get better healthcare for very cheap and birth control and maternity leave and the whole shebang... Anyone working gets rights to this in other countries. I can't believe America is fighting such a simple idea. A healthy population is a productive population. You want more able workers? Make sure they can remain healthy enough to work!","commenter_a":"Todd...more than 3 million more said No to Trump than yes!","post_message":"WATCH LIVE: The Women's March on Washington following Donald J. Trump's inauguration –— over 500,000 are in attendance."},{"comment_id":"10153962435457235","commenter_b":"ive got a few vulgar words for this trump ish.... can not stand her face, her voice, or any damned thing that comes out of her mouth. this woman is a vile creature that needs to crawl back under whatever rock she slithered out from.","commenter_a":"Founding father of porn.","post_message":"It's hard to imagine the GOP getting more juvenile than this -- but let's see what happens tomorrow!"},{"comment_id":"10153652189710530","commenter_b":"Save the geese. Ban airplanes.","commenter_a":"Doug smith- what are they going to do? They can potentially set fire to a blanketed horse causing severe burns or death. It's all fun until it's one of your loved pets. Caroline Torr This horse was in a field when a Chinese lantern landed on top of the horse's blanket and set the horse on fire! Chinese lantern may look amazing when let off but do you know where yours lands after you have seen it fly away??? What do u think happens to the wire frame of the lantern? The ban of Chinese lanterns needs to happen and can't come fast enough for me!!","post_message":"Should there be exceptions to Canton's sky lantern ban?"},{"comment_id":"1795749220655470","commenter_b":"The point is assult rifles are banned already....","commenter_a":"Too bad what you carried in Iraq was a selective fire M4, not a semi-auto ArmaLite rifle, you can't teach common sense, but you can at least know the difference between an Assault rifle and a AR-15","post_message":"I know assault rifles. I carried one in Iraq. They have no place on America's streets. #Orlando"},{"comment_id":"749959158486192","commenter_b":"Lots of people spoke up and condemned him for the remarks you speak of. This time he just happened to use a word that always triggers outrage.","commenter_a":"Is it just me or are we seeing all these white women and men speaking up because Trump spoke about another white woman? they didn't care about the Latino beauty queen, or black women, gay women, heavy women and 'not a 10 women'....Why now?","post_message":"Looks like all the rats are jumping the Trump ship. --Andrew"},{"comment_id":"10152593835691135","commenter_b":"Something my psycho ex would do","commenter_a":"YUCK","post_message":"Some men will try almost anything when it comes to building their body...  The latest craze: drinking breast milk.  STORY: @webpagelink"}]
