[{"comment_id":"10154592681344445","commenter_b":"Yup, they are trying to invade the US as we type. Better build that wall.","commenter_a":"Now that half the Republicans in the house have been officially brain-washed, his confirmation will take place. This country will be taken over by Islam, when it happens. Bad news for women and gays.","post_message":"\"I am confident he will serve the American people with integrity and a steadfast commitment to justice,\" the president said. @webpagelink"},{"comment_id":"10153006139081602","commenter_b":"I think it would help lessen the burden on other welfare programs, if some benefit recipients were getting educated and coming off programs.","commenter_a":"Better to pay for this than all the bums on welfare and any state run handout that people take advantage of.","post_message":"Two years of community college could now be free for all, according to a plan President Obama is scheduled to propose Friday."},{"comment_id":"966056150146121","commenter_b":"Slow learners. Blacks keep voting Democratic even though Dems have done nothing but baby them and keep them down.","commenter_a":"They STILL haven't learned about the democrats !!!!!!!!!!!!!!!!!","post_message":"LANDSLIDE"},{"comment_id":"10152906901509270","commenter_b":"Unreal !!! This makes me sick !!!","commenter_a":"It's just Wrong. Wanna bet the Commander in Chief authorized this crap..","post_message":""},{"comment_id":"10153238433806782","commenter_b":"So you have no problem sharing a restroom with men? That's not how I perceive most women feel","commenter_a":"Oh for Pete's sake, does government really belong in the restroom???? Work on something that really matters! Schools, roads, infrastructure, the things government does belong. Are you going to post guards in every bathroom and have to check your \"plumbing\" to see what you are equipped with to make sure you are going to right one???","post_message":"A similar bill was filed in Oklahoma: @webpagelink"},{"comment_id":"10153004075042061","commenter_b":"These magnificent creatures were never meant to be made to stand on their heads or do any of the other ridiculous tricks they're forced to do.","commenter_a":"Stop hitting elephants.","post_message":"An elephant attacking your car - never a good thing: abcn.ws/1LxMzPP"},{"comment_id":"1385476598133803","commenter_b":"@username Total dumb ass","commenter_a":"I say that's bullshit, race problem was minimal until we got this racist Muslim traitor idiot in the white house, Obama administration and his friends are the problem with this country now.","post_message":"The majority of Americans say there's still widespread racism against African-Americans in our country. Do you agree or disagree?"}]
