[{"comment_id":"10153546137853352","commenter_b":"Black cop should shoot to kill her ass","commenter_a":"And today in white folks news","post_message":"Tulsa Woman Caught At Funeral Home Cutting Up Face, Hair, and Messing Up Makeup of Corpse Who Once Dated Her Boyfriend"},{"comment_id":"386189561505639","commenter_b":"Keep it open and all prisoners.","commenter_a":"Open","post_message":"Do you think Guantanamo Bay prison should be closed as promised or kept open?"},{"comment_id":"10153302910759087","commenter_b":"But the sheep love the Queen of BS and her Lies, Hillary the evil millionaire theft by deception. and lair","commenter_a":"Carly doesn't back down from a fight. I would NEVER go on that show after that BS. She's a better woman than I!","post_message":"“My message to the ladies of ‘The View’ is, ‘man-up,’” Carly Fiorina said. “The Obama administration, for example, has been bad for women. Planned Parenthood is harvesting body parts. If you don’t like those facts and those messages, than man up and debate me on them. Don’t sink to talking about my face.”"},{"comment_id":"1590956274524819","commenter_b":"I won't stay there","commenter_a":"The should arrested the hotel owners and the stupid cops that arrested the veteran.","post_message":"I am boycotting this hotel. Veterans deserve BETTER!"},{"comment_id":"678380735661527","commenter_b":"@username idiot","commenter_a":"well, well, well, so hillary's leaks are coming out! She makes fun of Catholics and Evangelicals, are you going to report on this? Well probably not since another leak talks about how you in the media and donna Brazile help her by giving her question that will be asked in the debates with Bernie, so she could memorise her answers. Hemmmm ,poor Bernie. They even told her when to smile. But guess you won't be report this becuase you're as guilty as she is. What a shame that we can no longer trust the media, the FBI, and of course lying bigoted hillary. We already knew she found millions of people deplorable and unredeemable, but now she hates Catholics and Evangelicals. . Thanks Wickie Leaks for giving us the truth because we know the media won't.","post_message":"\"I regret coming to the Trump support event, and in particular allowing my son to be a part of it,\" one donor said."},{"comment_id":"10156577107260725","commenter_b":"Rand Paul is already crying he is your typical corrupt out of touch Washington politician. He wants to rid us of the US military. So that jerk will be at the debate.","commenter_a":"I can make a difference between Winning & Losing & i really want Donald Trump to Win. I have lots of valuable inputs to give. How do i get in touch with you. Warm Regards, @username...","post_message":""},{"comment_id":"1684551998460631","commenter_b":"I am not an American, but I and we all are interested in your politics. Because we other part of the world are concern for peace and prosperity. And Why so much hate? Why so many wars? Do you think that is the solution? What is the meaning of diplomacy for you guys? Is it only war? Do you think that in this 21st generation you are again doing politics for religion ? And certain race? Is that how you want to see American politics ? How come you think Obama foreign policy is miss leading you guys? Do you got the proper answer? He talks about climate change, which is happening and strongly scientist also believe that, he try to bring your army back in your country from Iraq and afganishtan, he shown us that diplomacy and foreign policy is not only about to hate and make enemy. He ...","commenter_a":"Trump doesn't back down from our enemies Obama. You are nothing but a coward. Your nuclear and foreign policy has only weakened us, and made it easier for Iran and ISIS to kill us.","post_message":"Speaking at the close of the Nuclear Security Summit, President Obama said Donald J. Trump's nuclear comments show he \"doesn't know much about foreign policy or nuclear policy or the Korean peninsula or the world generally.\" @webpagelink"}]
