[{"comment_id":"10152729868175667","commenter_b":"Oh calm yer tits..it's just fun","commenter_a":"I may stop following USA Today because of this specific post. The guy isn't even old enough to run and you're reporting it like its important, which just means you made a joke out of yourself.","post_message":"President Flame would be a pretty epic name. Just saying."},{"comment_id":"10153289049898256","commenter_b":"See? You sound like someone who is over 40.","commenter_a":"Stefan, stop being a dinosaur.","post_message":"And now an important message from Chicago Confidential columnist Melissa Harris:   Please stop putting two spaces between sentences. It makes you look like a dinosaur.  What say you: One space or two?"},{"comment_id":"10153753811221051","commenter_b":"So tell me, how does a colored woman have a bronzed beachy glow? They want whites only.","commenter_a":"Oh lame. So now every ad for everything (make-up, sports, clubs, restaurants...) has to have a picture of male and female, old and young, straight and gay and transgendered, and ever single culture/race, etc. on EVERY single ad so as not to exclude? STOP IT.","post_message":"It only took a few hours for this photo to spark outrage. Take a look and decide for yourself if it's worthy of the controversy."},{"comment_id":"10154976296372789","commenter_b":"@username Wanting President Trump to fail is wicked. I don't ascribe to that just as I did not ascribe to it when the right vowed to block the former president and cause him to fail. But seeking truth and speaking truth to power is not wicked","commenter_a":"The left will fail. Wickedness will not prevail.","post_message":"'What I don't like about what is going on now, is there is an absolutely frenzied and concerted attempt to delegitimize, sabotage and destroy the Trump presidency before it even started.\"  Piers Morgan believes that the mainstream media is fueling \"hysterical\" attacks on President Donald J. Trump, and it's fundamentally \"un-American.\" What do you think? @webpagelink"},{"comment_id":"1150998668273937","commenter_b":"There are 5 videos.","commenter_a":"This girl was told to leave the classroom. She refused. An officer was called since a teacher cannot physically remove a student from a classroom. The officer asked her to come with him, she refused and pushed him. She had then assaulted a police officer. Which is an arrest-able offense. She then resists arrest while further assaulting the officer (hitting him). Why does anyone think this is ok? These children have no respect for authority. I see most people defending her. Seriously?","post_message":"This guy can bench press 605 pounds, and he threw that tiny girl across the room. And the one they arrest is the girl who was brave enough to stand up to him."},{"comment_id":"10153655296938854","commenter_b":"Kerry is no better than anyone else, if he was involved...Then buddyboy...fess up. This whole situation is starting to smell like Watergate. Where's Woodward and Bernstein...Let them have a crack at it!!! Somebody needs to tell Trey Howdy you have full reign, do whatever you need to do, just get to the bottom of this!! And I'll bet you BARACK OBAMA'S NAME is all over it, just like Richard Nixon's was in Watergate. The major difference between the two is that PEOPLE DIED IN BENGHAZI. And just to show the impertinence of Hillary when she said, \"What difference does it make now?!!\" The difference is you Communist is that AMERICANS DIED YOU HEARTLESS WITCH!!","commenter_a":"Elijah Cummings is one of the dumbest mf'rs on this planet....voted for by a large number of even dumber mf'rs in his illegally gerrymandered district. He is so stupid, that he has no business in congress, and along with the rest of the liberals in Congress and the white house, he should be swinging at the end of a rope. He knows what he's done....we know what he's done.....","post_message":"Elijah Cummings: “Shockingly Disrespectful” To Subpoena John Kerry About Benghazi…"},{"comment_id":"980597458645157","commenter_b":"Let's start following it, shall we?","commenter_a":"God bless the Constitution of the USA","post_message":"Happy Constitution Day!"}]
