[{"comment_id":"10152727264626051","commenter_b":"This woman is sick, she needs to lose her own child and put into intense therapy with jail time.","commenter_a":"Gross!!!!!!","post_message":"This kid never really thought about why his mom was so excited when his 11-year-old friend came over. Now he knows."},{"comment_id":"10152995709171130","commenter_b":"I suggest we send her subservient hormonal ass straight to the Canadian border now!","commenter_a":"Ridiculous! Comment for someone that should know better Ms. CEO.","post_message":"What the..."},{"comment_id":"931627590204327","commenter_b":"From Shyann Malone - This is the coldness I experienced when getting into the car this morning! 40 In St. Pete at 3am. Heat on Full Blast!","commenter_a":"Mulberry","post_message":"Brrrrrrrrrrr! This was St. Pete at around 3a.m. this morning.  Who's the coldest in the Bay area? Show us how frigid it is at your location. Snap a pic and post it in the comments below."},{"comment_id":"566305263572986","commenter_b":"When are they going to be persecuted?","commenter_a":"Vote! Vote Donald J Trump!","post_message":"WIKILEAKS BOMBSHELL.... The election should be OVER. The Clinton campaign admits to Obama having emails from Hillary off her personal server and that the president knew before he heard about it from the press.  SEE EMAIL"},{"comment_id":"1287096984651728","commenter_b":"A Muslim Communist Terrorist...","commenter_a":"You mean 70% of America? The same 70% that pays the most taxes and fills our military ranks? I'd rather he just said thank you, ate pork and died.","post_message":"Is he racist?"},{"comment_id":"10153532801498984","commenter_b":"put her in jail and let some women make her their bitch","commenter_a":"JUSTICE FOR ALL?????!!!!!!!!!","post_message":"The extremely disturbing video of a young girl brutally attacking a schoolmate who was holding a small child went viral, now the attacker is facing some serious consequences...  Are you hoping justice is served?"},{"comment_id":"10153104689788855","commenter_b":"WTF? The Advocate (or at least the staff involved in this article) clearly don't know what \"Twink\" is. These men are just aging well and don't have the outward appearance of what one would typically expect of their numerical age.","commenter_a":"Daryl Stephens is a hot man","post_message":"Sometimes, twink is forever (right, Darryl Stephens?)"}]
