[{"comment_id":"10153155195841323","commenter_b":"It's dangerous to be right when the government is wrong. -Voltaire","commenter_a":"reminds me of the USA..","post_message":"Inside B’Tselem, the Israeli human rights group accused of treason for documenting the violations of its own government."},{"comment_id":"10154038430603812","commenter_b":"Arrogance is all she has left to run on.","commenter_a":"Differences are fine but you should not say that you are all so much better than the Republicans. I will not be voting for a person who thinks they are better than others!!! Shame on you","post_message":"“I think it’s time for us to have the kind of spirited debate that you deserve us to have. We’re so much better than the Republicans, but we do have differences and you deserve to know what those differences are.\""},{"comment_id":"10153266875433010","commenter_b":"Except for leaving him to near starve and die for 66 days","commenter_a":"God is good all the time... :-)","post_message":"His family reported him lost at sea 66 days ago. He said he survived by rationing his food and drinking rainwater.  “...everyday I was like, 'Please God, send me some rain, send me some water.'\""},{"comment_id":"979982332037226","commenter_b":"Yawn. Y'know, feminism isn't out recruiting fuckwits today, to my knowledge.","commenter_a":"I will never call myself a feminist simply because feminism has no true definition. sure it has a dictionary definition but 9 times out of 10 people who support \"feminism\" have a different approach to it and have values that don't support equality. Men aren't afraid of powerful women I wish there were more powerful women because I can't stand submissive people. If I could find a woman that would stand up to me (in a loving way not a psychopath way like a lot of women think they need too)I would be very happy. I will say this again and again feminism is not the way to gain equal rights for all, because of its aggressive nature it will always have people fighting against it. Also the word feminism does not need to exist if it simply means equality then we can just say equality. I refuse to label ...","post_message":"Well said.  Like ATTN: on Facebook."},{"comment_id":"10154186390606336","commenter_b":"Just stop. Women are not physically equal to men.","commenter_a":"They should open up the navy seals to women","post_message":"✓ 36-mile race ✓ 8-kilometer swim ✓ 25 obstacles   Her reason for completing the race? She was bullied in school. (CC: U.S. Navy)"},{"comment_id":"10153419994402426","commenter_b":"Because it is one agency that makes money, not cost the tax payers to operate.","commenter_a":"Theyre smart. When people are snowed in, they drink.","post_message":"Is Virginia sending a mixed message?"},{"comment_id":"935435836504943","commenter_b":"Mexicans dont pose much of a threat like ISIS refugees picked a wrong time to come over","commenter_a":"The Federal government cant property vet any of these refugees because there are no records on any of them! Hickenlooper is putting Colorado communities at risk as well as the Federal Government! 26 States as of today have refused to take any. Less States mean more refugees per State. Obama wants upwards of 200,000 refugees! If we would have wiped them out early, the world would not be in this position! How many refugees would we receive in your State if only 10, 5 or 2 States allow them? They will migrate to other states and most will go on welfare, food stamps and Obama care, not to mention the cost to educate them or the real cost of American lives from terrorist attacks in our communities! What price do you put on that Mr Speaker!? Hickenlooper as well as the Federal is putting our communities at a security risk ...","post_message":"Our nation has always been welcoming, but we can’t let terrorists take advantage of our compassion. We should not bring Syrian refugees into this country unless we can be 100 percent confident that they are not here to do us harm."}]
