[{"comment_id":"1247969895269376","commenter_b":"So we can take hus away also. He is more privileged than her.","commenter_a":"Are you kidding me? He is simply making a point that she is a privileged elite who lives by one standard of protection and expects the little people--the unworthy stupid masses--to try and survive under a different one. It's called irony. To deliberately misinterpret and inflame his message (as a call to 'assassination'???!!!) is just proving Hillary right--her sheeple are the stupid masses. I say, let's prove her wrong and show some common sense.","post_message":"DISQUALIFYING! This is the SECOND time he suggests that Hillary should be shot. What is WRONG with him?  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153362565997093","commenter_b":"Chale","commenter_a":"Como estuvo en la manana @username","post_message":"CAUGHT ON CAM ~ Tuesday morning's severe storms blow through a Far North Fort Worth neighborhood... @webpagelink"},{"comment_id":"10153327078532411","commenter_b":"So this really can happen? My phone is usually under my pillow","commenter_a":"@username can I have electronics in the bed","post_message":"This is why you don't sleep with your cell phone."},{"comment_id":"10158517971145725","commenter_b":"Another triggered cornflake with vagina envy","commenter_a":"You could fill 2 grand canyons with the amount of leg and vagina hair at this march","post_message":"Despite organizers saying the Women's March on Chicago was too big to march, demonstrators are on the move.   Live updates: nbcchi.com/lsLGCKs"},{"comment_id":"606800519482594","commenter_b":"HILLARY you have no CREDIBILITY ! YOU LIE SO MUCH WE CAN'T TRUST YOU EVEN WHEN YOU DO TELL THE TRUTH YOU'VE LIED SO MUCH WE CAN'T TELL! SO GO POINT YOUR FINGER FULL OF BULL SHIT IN SOME ISLAMIC WORLD THAT BOUGHT AND SOLD YOURSELF TO ! DUMB ASS LIEING BITCH!","commenter_a":"This woman is a total disgrace to America and to all human beings!","post_message":"Hillary Clinton just said Donald Trump is too dangerous to be President of the United States. This is why."},{"comment_id":"947076032050956","commenter_b":"I agree @username. Just like the woman said about the women that doesn't help other women. Hillary thought that was cute.","commenter_a":"We need to come together against the Republican Establishment to deny Trump and Cruz of the nomination. Their strategy is despicable but simple, keep either candidate from garnering enough delegates and have a contested convention where they will steal the nomination from both men. We Trump and Cruz supporters are wanting an outsider to try to fix the corruption in the political parties and our government. We need to come together to deny the Establishment their strategy. In the meantime, have faith in both of our candidates....Trump and Cruz are both very smart men and understand exactly what the Establishmen plan is. I have hopes that within two to three weeks they will work out an agreement among themselves to make a clear pathway to victory for one of them...to help them do this we need to come together as conservatives who are sick and tired of the corruption and ...","post_message":"Shannon Bream here live from Detroit on the Fox News Facebook page! Hit 'subscribe' in the top right corner to make sure you catch all of our live videos. We'll talk to the moderators during tonight's #GOPDebate and you won't want to miss that!"},{"comment_id":"10153778726835575","commenter_b":"These fuckers are welcome in GB but not Trump. Insane.","commenter_a":"LET'S HOPE ALL OF THESE PROPAGANDA CRAP WILL DISAPPEAR WHEN TRUMP IS SITTING IN THE OVAL OFFICE....OUR ONLY CHANCE..","post_message":"London Islamists think ISIS snuff videos are a riot!"}]
