[{"comment_id":"935609056472847","commenter_b":"But they were fat girls","commenter_a":"They must not live near a Mcdonalds","post_message":"She says her two best friends turned on her and beat her for nearly two hours."},{"comment_id":"1219218918112237","commenter_b":"This is how Clintons work! So illegal!","commenter_a":"THIS PERSON NEED'S TO RESIGN IMMEDIATELY,BILL CLINTON HIRED HER TO WORK FOR THE DOJ WHEN HE WAS PRESIDENT.DO YOU THINK THERE MIGHT BE LITTLE THANK YOU PAYBACK.","post_message":"The DOJ is still investigating Hillary Clinton for possible criminal wrongdoing regarding her private email server, so why would Attorney General Loretta Lynch meet privately with former President Bill Clinton?"},{"comment_id":"10153263146396833","commenter_b":"She dont need a gun anyway, Shes got a face that would stop a train !","commenter_a":"Start living in the real world, hoodlums are not giving up their guns. Wake up and smell the roses gabby","post_message":"On March 4, gun control proponent Gabby Giffords joined Democrat lawmakers on Capitol Hill to push for expanded background checks on all gun sales.  Anti-gun Representative Mike Thompson (D-CA), who supports banning commonly owned semi-automatic firearms owned by millions of American, is spearheading the push."},{"comment_id":"990765034279620","commenter_b":"Not empowering ,because ur shity woman","commenter_a":"I love them","post_message":"Photoshop this."},{"comment_id":"746903725500205","commenter_b":"she is a disgarce and should be reprimanded so should cbs and the nfl they truly are responsible for giving this racist cop hating person a platform in which she was able to spread hate and racism","commenter_a":"YES.","post_message":"Congressman Absolutely Unloads On Beyonce For Vile Halftime Show  She completely overstepped her boundaries.  Do you agree with this Congressman?"},{"comment_id":"10153665573326077","commenter_b":"Yep bet you never did anything wrong in your life","commenter_a":"Wth is wrong with kids nowadays... Everyday they are up to something crazy !! Yesterday was drinking fuel with soda , today is this , tomorrow?? What??","post_message":"Have you heard of the \"duct tape challenge?\""},{"comment_id":"928001893961910","commenter_b":"Thank you Rubio for all your hard work. God bless you and your family.","commenter_a":"NO RUBIO ND NO CRUZ.","post_message":"Marco Rubio is a friend and a colleague who ran an optimistic campaign focused on the future of our party, conservative principles, and uplifting the American people. The Republican primary was stronger because of the ideas he brought forth.   Marco’s story embodies the promise of our great nation. I know he will continue to be a champion for limitless opportunity in America, and I wish Marco, Jeanette, and their four kids the very best."}]
