[{"comment_id":"10152774860755927","commenter_b":"Is this wife beater and Obama DNA guzzler still relevant?","commenter_a":"The question is does Reid understand the U.S. Constitution? He should not try and put pressure on the Supreme Court. Reid is a pathetic old ugly man. He is mean and unhappy in life. Can't wait till he is standing before his Maker. Won't be a pretty sight for sure","post_message":"WATCH as Senator Harry Reid maligns the U.S. Supreme Court on forthcoming Obamacare decision "},{"comment_id":"10153529915413010","commenter_b":"slave labor??","commenter_a":"Here's an idea..... Send the illegals home and put nonviolent incarcerated inmates to work on these farms.","post_message":"\"We have a large population of people who came here to work, not to be any kind of a security threat to anybody,\" said Bryan Little, of the California Farm Bureau Association.   \"And they came to work in an industry that needs them badly.\""},{"comment_id":"10156316346195725","commenter_b":"@username , but Muslims will not vote for him","commenter_a":"We need you now Donald Trump!!!","post_message":"Remember, I was the one who said attack the oil (ISIS source of wealth) a long time ago. Everyone scoffed, now they're attacking the oil."},{"comment_id":"551295498386832","commenter_b":"Hillary is crooked af it's the perfect excuse.. Get a life.","commenter_a":"Love you Bernie but I can't support your endorsement. I know you'll continue to do what you can from your position and if given the opportunity to support you I will do so. But it looks like I will have to change my vote to Trump this year. I will not support Hillary under any circumstances.","post_message":"Thank you, Bernie Sanders. Proud to fight alongside you."},{"comment_id":"10153095274501600","commenter_b":"JERK","commenter_a":"there needs to be an (unlike button)","post_message":"“We are entering the curvy girl era and when all eyes are on the bikini babes of Sports Illustrated, it would be a great time to have the conversation about the rise of the curvy girl,” a spokeswoman for Sports Illustrated said."},{"comment_id":"1741083142832713","commenter_b":"She plagiarized!","commenter_a":"Keeping it classy!","post_message":"\"On July 28, 2006, I was very proud to become a citizen of the United States – the greatest privilege on planet Earth.\"  Melania Trump, wife of presumptive GOP nominee Donald J. Trump, spoke about her pathway to U.S. citizenship and thanked veterans who protect the freedoms we enjoy as Americans. @webpagelink"},{"comment_id":"10153704994641337","commenter_b":"Fuck off fag","commenter_a":"Here come the \"cause Obama is a Muslim\" comments","post_message":"#IStandWithAhmed: Even Barack Obama is showing his support for Ahmed Mohamed..."}]
