[{"comment_id":"10153302141658812","commenter_b":"women wearing tuxs are on fashion runways @webpagelink so why can't she wear one?","commenter_a":"Every single girl should show up in a tux, and every single guy should show up in a dress.","post_message":"Principal says gay student can't wear tuxedo to prom. @webpagelink"},{"comment_id":"1272631619499754","commenter_b":"There are hundreds of billions of untaxed dollars, probably trillions going to Mexico every year through the boarder in drug profits. An effective wall and boarder security will prevent tons and tons of drugs from coming in, as a result people wont be able to buy as many drugs so the money they would normally be using to buy drugs will be spent on other things that will help the economy. So not only will it prevent drugs from coming in but it will prevent billions from going out to Mexico and that money instead will be cycled through the US economy and taxed every step in the cycle. This wall will also help clean up the drug abuse problem our society has and save many lives to overdose and drug related violence. Not to mention illegal immigrants not paying taxes but also sending their extra money back to Mexico. ...","commenter_a":"LOL..heck he doeesn't even know what he is talking about how can he keep up with himself...just hilarious to watch each day what has changed. Ya know, I think his hairdresser is leaving the bleach on too long and it is affecting his brain..just a thought.","post_message":"As the Trump campaign tries to pitch minority voters, Donald J. Trump's  position on immigration seems to keep changing."},{"comment_id":"887276944740413","commenter_b":"@username, I agree with you're sentiment. However, that's just what they want so they can finish sweeping this crime under the rug and most likely murder you while you were in jail. Count on Yashua Yahwashi to help you win this battle. I came not to bring peace but a sword.","commenter_a":"This is such a travesty. These judges are complicit in the cover-up. I remember when that girl Natalie Holloway was murdered on vacation. That case went on and on until they put that guy Ian Vandersloot (sp?) in prison. White parents rarely have the burden of proof put upon them. They should start a GoFundMe page.","post_message":"Parents of Kendrick Johnson (Teen Found Rolled Up in Mat at H.S Gym) Ordered to Pay Hefty Legal Fees"},{"comment_id":"10152814296572377","commenter_b":"Creepy lady","commenter_a":"and Obama has invited them...","post_message":"Geller stands tall saying \"Give Me Liberty or Give Me Death,\" even though she is being targeted by ISIS. But they aren't just coming for her she says..."},{"comment_id":"665165626971083","commenter_b":"Never Clinton!! She praised Robert Byrd A known KKK LEADER AND KLAN RECRUITER and a complete liar and flip flopping scumbag!! And her SEXUAL PREDATOR Husband need to be put in jail!! We need to set limits on how long you are allowed to run in government and all these establishment criminals that keep getting elected and ruining our country on both sides need to go !!!!","commenter_a":"I don't believe that !!","post_message":"Unless things change extremely fast, Clinton will officially lock up the Democratic nomination after the California primary. Will you be supporting her this November?"},{"comment_id":"1648860662067713","commenter_b":"Why doesn't that useless cunt step in front a speeding train??","commenter_a":"Rosie O'Donnell is against guns, but it's ok for her body guard to carry one to protect her!!! Crazy!!","post_message":"YES!  This is why we love you Tom Selleck."},{"comment_id":"10157109427360354","commenter_b":"but.. its ok if your a doctor and have permission?","commenter_a":"She looks evil!","post_message":"A woman from Boulder, Colorado, was sentenced to 100 years in prison for attempted murder and unlawful termination of a pregnancy after attacking a stranger and cutting her baby out of her womb."}]
