[{"comment_id":"445100202281687","commenter_b":"Hey here is an idea to the asshole who runs this page, stop defending these fucking criminals. Weed is ILLEGAL. Don't fucking run asshole. The fucking cop should have curb stomped him","commenter_a":"this police guy is a liar ,you deserved your termination,your insane....","post_message":"This is just disturbing. What a lame excuse this cop who has been reported multiple times in the past used for his violent behavior. Now he is defending his actions.   Do you think his violence is justified?  *Warning* GRAPHIC Video: @webpagelink"},{"comment_id":"10153061896611051","commenter_b":"She did nothing wrong. I applaud her.","commenter_a":"What IN the hell is this World coming too this kid don't have MONEY and she was nice too give her food too eat I thank her for her kindness and Love and a heart, caring!!!!!","post_message":"A hungry first grader who didn't have money for lunch started crying in front of this kitchen manager, so she gave her some food. Bad move."},{"comment_id":"10154085001886800","commenter_b":"Eve, the most hated woman to ever exist.","commenter_a":"More specifically, women are paying for it. Eve ate the apple, now we're cursed with periods, painful pregnancy, and really shitty mood swings.","post_message":"Connecticut lawmakers want to get rid of the statute of limitations on child sex abuse cases, but they're running into opposition from the Roman Catholic Church."},{"comment_id":"10153899711236509","commenter_b":"I'd hate to see when an STD breaks out lol!!!","commenter_a":"Mahalia","post_message":"Imagine living in a town where everything you need is under one roof. Welcome to Whittier: @webpagelink #GreatAmericanStories"},{"comment_id":"10153043089801519","commenter_b":"Right? Because...ick.","commenter_a":"#dontbethatguy","post_message":"\"He then sent me five nude photos of him lying in bed, his penis prominently displayed...\""},{"comment_id":"1593060860989996","commenter_b":"Thats how they want America ....in a trance.","commenter_a":"May I suggest Sarah Palin as a running mate? We've heard that she not only supports you, but offered her services :)","post_message":"You could tell Donald J. Trump knew the debate went badly by the way he barreled into the \"spin room\" last night, immediately disavowing things he'd said in front of more than 80 million people just moments before. The back-peddles and lies have only grown more mystifying in the hours since."},{"comment_id":"934315223319642","commenter_b":"Michelle Owen Nyki KiKi 😂😂😂😂","commenter_a":"AHAHAHAGA help","post_message":"Via The Everlasting GOP Stoppers"}]
