[{"comment_id":"10153141690015861","commenter_b":"@username she can ride that motorcycle off into the sunset away from here.","commenter_a":"Class act!! Thank you obama for showing Oklahoma some love... Unlike our governor.","post_message":"President Obama released a powerful statement to the friends and family of the people who lost their lives in the Oklahoma City Bombing, referencing the strength and unity of our community."},{"comment_id":"1187041288042639","commenter_b":"How is she even allowed to run for president with all of this disgrace","commenter_a":"They all need to be arrested clean the White House and all the corruption--- this needs to be done ASAP","post_message":"In response to the revelations about the pay-to-play scandal tied to former Secretary of State Hillary Clinton non-state.gov email system and the Clinton Foundation, Judicial Watch announced that it will host an educational panel discussion:   Scandal Update  Emails and the Clinton Foundation.  Panelists include author of the New York Times best-seller Clinton Cash and President of Government Accountability Institute Peter Schweizer; Joe diGenova, former U.S. Attorney, Independent Counsel and founding partner of the Washington, D.C., law firm diGenova & Toensing; and Chris Farrell, director of investigations and research at Judicial Watch. Moderator will be Judicial Watch President Tom Fitton.  [for higher volume touch sound icon on screen  ]"},{"comment_id":"10153799805727623","commenter_b":"They need to be handcuffed at all times !","commenter_a":"Now report how many inmates are killed by correctional officers every year","post_message":"4 correctional officers are assaulted at a North Carolina prison:"},{"comment_id":"10153311054577293","commenter_b":"Guns multiply violence and death everywhere they are available without careful screening and detailed background checks. Even the sane lose their tempers and can lose control and kill their loved ones in the heat of the moment if a gun is at hand.. Guns place the innocent at risk everywhere from homes and schools to movie theaters and offices. No one NEEDS a gun. Only fools want them.","commenter_a":"This is why we need to ban guns. If a psycho attacks children with a knife they have a fighting chance. If he had been shooting the outcome would have been very different.","post_message":"He had only one thought: “This is not going to happen.”"},{"comment_id":"10153137881829342","commenter_b":"And is Charlize Theron the president of the NAACP claiming to be white? I think we got there can be white africans","commenter_a":"she is white as white can be. she is born and raised African. @webpagelink","post_message":"When asked if she was African-American, she responded that she didn understand the question. When asked,  your parents white? Dolezal removed her microphone and walked away from the interview."},{"comment_id":"10153900410909753","commenter_b":"She seriously thinks you meant the kids! Wow","commenter_a":"how is a fence gonna help if they can just climb up it just as well... they need electric fence for them... its really sad that they r doing sumthing about it after a lil boy lost his life....","post_message":"The Disney World alligator attack that killed 2-year-old Lane Graves in Orlando, Florida devastated the nation. Nearly a week after the tragedy, authorities have just released the chilling 911 call made after the toddler was dragged into the water by an alligator. Calls were made Tuesday evening alerting EMS officials that a little boy was attacked and dragged into a lake by an alligator at the Seven Seas Lagoon resort at Disney World. One of the calls was from a woman presumed to be a... @webpagelink"},{"comment_id":"10152621933698067","commenter_b":"You nuts lady!","commenter_a":"Of course it is not free but at least your taxes are going to education instead of wars all the time. I can't believe how many Americans are so brainwashed against a little socialism. You guys at \"the top\" gotta get back to basics. The greed in your country is appalling. We are the lucky ones to still have subsidized healthcare. Taxes should go first to education and not onky spelling and writing, but to teaching life-skills, budgeting, health. 2nd to health including dental health. Tax the crap out of the fat and sugar laden processed foods. Start caring for community and stop supporting the conglomerates. Yay for Obama. The best president since JFK, only mote moral in his private life.","post_message":"BREAKING: President Obama to call for 2 years of free community college for all students. More details to come."}]
