[{"comment_id":"10152759669890779","commenter_b":"let me tell you what happin to RED ASS.","commenter_a":"Today is your birthday? What's today?","post_message":"Twenty years have puff-puff passed since the stoner comedy Friday lit up movie theaters and became not just a cult sensation but a bona-fide classic. Ice Cube spoke with us about the success of the movie, the \"Bye Felicia\" meme and why the film is so beloved. \"It's cool – get high and all that – but the movie is memorable because it's the day that the bully got his ass whooped, and everybody loves that day.\" Click through for the full interview."},{"comment_id":"10155567292775294","commenter_b":"She was making over $20 an hour..... This has nothing to do with wages","commenter_a":"If Walmart would pay decent wages this would not have happened","post_message":"The woman is accused of stealing from the Decatur, Texas store for more than a year, sometimes stealing thousands of dollars a day:"},{"comment_id":"1566069946786462","commenter_b":"This will motivate her to lie and cheat more","commenter_a":"Yay!!","post_message":"IT'S HAPPENING..."},{"comment_id":"945737062128382","commenter_b":"Most Muslims are opportunists & try to take advantage of our awesome OPEN accepting country and are trying to push their false religious bogus rules and regs on us. Too late. Two wars have been fought on our soil and much blood shed to protect our American way of life and that includes the right to run a busniess free of foreign rules... do not continue trying to bring foreign laws into the equation..it doesnt fit!!!. America's laws are the way we live life..NOT islam..thats for syria etc..those rules are SOOO not ever going to work here so just try to relax and accept it. Get some counseling. Maybe then you will be happier and free from manmade male imposed non Christian laws. They always seem so negative..no joy in life! You're in America..rejoice..embrace your new life here. Jesus will set you free from the bondage of FALSE RELIGION...ask the ...","commenter_a":"She must follow the rules of the country where they live and enjoy the luxury of that country. If they don't, they must return back where they came from.","post_message":"Muslim woman wouldn't remove hijab, but hypocrisy bit her in a BIG WAY!"},{"comment_id":"517409361772081","commenter_b":"Gina, Your hypocrisy is the true embarrassment to this country","commenter_a":"That gold digger hooker and Trump is everything that is wrong with corrupt capitalism. Trump and his bailouts and bankruptcy. People think he loves this Country when all his jobs are overseas! He makes me sick with all his lies. I will turn democratic before that bozo clown gets my vote. Donald Duck is a embarrassment to the American people, especially to the Republicans!! He needs is a psychologist not the White House","post_message":"\"When I don't agree with something, I tell him.\"  Melania Trump, wife of Republican frontrunner Donald J. Trump, said she is not a \"yes person\" to her husband, and in fact told him to go lighter on Jeb Bush earlier in the campaign. @webpagelink"},{"comment_id":"1141182859235076","commenter_b":"I only like woman","commenter_a":"Anyone on this thread that defends the confederate flag or the klan, please kill yourself and do not procreate.","post_message":"\"The Klan today is weak, poorly led, divided internally and without any political support\""},{"comment_id":"10153687678068487","commenter_b":"A drama queen is bad enough! But a stupid, manipulating drama queen can mess up your day! She's the wolf in sheep's clothing! Voters...do your own fact checking!","commenter_a":"Fiorina wasn't \"confused\". She was lying.","post_message":"No one can find the scene that Fiorina described at the debate in the Planned Parenthood videos."}]
