[{"comment_id":"10155528648886729","commenter_b":"Let those people lose a day's wage and let those business' lose a day's earnings. Who cares. We should have no illegals working, instead the long term welfare kings and queens should be working to earn those welfare checks.","commenter_a":"I have a question. If all the Chavez supermarkets, which the Hispanic community supports by shopping there, closes for the day where will a mother go to get that gallon of milk she needs? Also, will the supermarket pay any employee that doesn't work today?","post_message":"Oops."},{"comment_id":"10153671011123132","commenter_b":"Being a hooker.","commenter_a":"Oh pleeeeeeeze, her profession is/was a stripper. She posts lots of photos of her body parts all the time. How do you think she pays her bills?","post_message":"Whoa!"},{"comment_id":"392158754326577","commenter_b":"I hope Trump wins the nomination. Then The Americans will for sure vote for a demokrat, whether it be Hillary or Bernie. No way the Americans are that stupid!!","commenter_a":"Isn't his stand against Muslims prohibitive by the Constitution and therefore automatically eliminates him from presidential nomination?","post_message":"Let’s stop the racism. Let’s stop the xenophobia. Let's stop Trump. #GOPDebate"},{"comment_id":"1879546605644644","commenter_b":"She should be in jail","commenter_a":"How is she any different that a Timothy McVeigh home grown terrorist?","post_message":"Ugh"},{"comment_id":"10153959517171337","commenter_b":"\"Drink the kool-aid.. Sheep.. Libtard... Scandals...\" Meanwhile, there's Trump. All of those things wrapped into on ball of hair. HA HA HA!!","commenter_a":"Haha that bitch will do anything for votes. She's trying to win the young/urban vote lol tomorrow she'll be in overalls with a straw in here teeth talking to some farmers. Line up kids, get your blow job from Hillary !!!","post_message":"R.I.P Dabbing  @webpagelink   (2015-2016)"},{"comment_id":"1411157285603697","commenter_b":"Californians will get tired of being victims eventually and deal with these guys.. meantime lets send liberals refuges and illegals to them","commenter_a":"Brown is a two-time failure as governor.","post_message":"More are coming..."},{"comment_id":"10153826016756680","commenter_b":"Trump's no. 1 fan has a warning for us. David Duke Warns If Hillary Is Elected Black Men Will Rise Up, Kidnap White Women From Walmart And Rape Them ! The Republicans little secret that Trump exposed. 40 percent of them are racist and were dormant waiting for an opportunity like Trump. Vote blue from the top of the ticket to the bottom","commenter_a":"Thank you Hillary. As a gay man I understood it took you a while to get where you are, but I applaud you for your commitment to stand up for LGBT rights. #ImWithHer","post_message":"The NCAA announced it will relocate all of its championship events from North Carolina scheduled for the current year."}]
