[{"comment_id":"10153863416478812","commenter_b":"Lmaooo @username","commenter_a":"@username @username @username Abbas Maki @username @username the title and the caption are hilarious! I feel bad laughing lmao","post_message":"UNEXPECTED VISITOR: An 83-year-old thought the loud noise she heard was just the weather. When she looked outside, she found a Ford Mustang parked…on her roof. @webpagelink"},{"comment_id":"849701391772757","commenter_b":"No more Somalis","commenter_a":"Part of barack islama's let everybody from any country come in when they want. No bg checks.","post_message":""},{"comment_id":"10153396131721130","commenter_b":"Some chick stealing ya flow.","commenter_a":"@username, you could do a better job at this! But either way, I like it.","post_message":"“This s***t was dope as hell.”"},{"comment_id":"604736083067982","commenter_b":"Duuude, no he doesnt. He definitely and truly does not mean that. From the bottom of his good heart he really doesn't want people to support her fracking, wall Street, lying ass.","commenter_a":"Love ya Bernie but, not a chance in hell I will give that pos garbage my vote! Not like it matters anyway I have lost all faith in the US government and any honesty within.","post_message":""},{"comment_id":"1093998960667966","commenter_b":"party endorsed toadies dont age well","commenter_a":"PUT these clowns out too pasture","post_message":"BEYOND TIME  America's Freedom Fighters"},{"comment_id":"876831439029591","commenter_b":"She needs to be fired because she should have done her job and not entertained the situation. She should have ignored the customer and sat her butt down.","commenter_a":"She needs to be fired.","post_message":"A woman caught on camera head-butting another woman at a Walmart says she has no regrets. The fight took place after the woman says she received poor customer service from a tax preparer: @webpagelink"},{"comment_id":"611768719013707","commenter_b":"She's a piece of shit black bitch. That's all","commenter_a":"The Bitch is an idiot!!!!! Ignore her!!!","post_message":"Michelle Obama is trying to close all American museums for this absurd reason.  She is a racist. This is complete madness.  Do you think Michelle Obama is out of her mind?"}]
