[{"comment_id":"1014316725248091","commenter_b":"Sondra, you sound like someone who doesn't know what she is talking about. For many women PP is the only place where they can get cancer screening. PP provides birth control. How dare you assume that you get to make the health decisions for even a single person. Shame on you.","commenter_a":"Mr. Bera, the real \"consequences\" of ending funding to PP would be an end to PP altogether..they should be brought to justice for their depravity and disregard of the law by selling baby parts-- we taxpayers have been funding them TWICE OVER for years and are sick of their lies are many other reputable womens health centers you know all of this but are afraid to vote your conscience.I'm really ashamed of you..and if you are a pyhsician as you claim, you are not a humanitarian nor a normal human being.","post_message":"As one of the few practicing doctors serving in Congress, I understand the real consequences ending federal funding to Planned Parenthood would have for patients. That’s why I stand with Planned Parenthood and will not vote to defund it. We need to keep politicians out of the exam room and instead work together to make sure women have access to preventive health care → @webpagelink"},{"comment_id":"1246991831993261","commenter_b":"goodbye both...","commenter_a":"thats \"goodbye America\"...","post_message":""},{"comment_id":"10152856733741051","commenter_b":"Cheryl, get real, freak!!","commenter_a":"He is a Race Baiter distracting from what he is secretly doing to America. His agenda is clear to me, DESTROY AMERICAN FROM WITHIN!!!","post_message":"President Obama hopes that Wednesday night's shooting of two police officers doesn't distract people from one really important fact about Ferguson."},{"comment_id":"10153548009250575","commenter_b":"Women need to be cooking and cleaning for a man. Free time and they just get weird.","commenter_a":"That's just fkn nasty!!!!","post_message":"The Gateway Pundit - GROSS. Leftist Artist Uses Her Menstrual Blood to Paint Angry Portrait of Donald Trump"},{"comment_id":"1012758612153724","commenter_b":"Well, now that she will be sitting at the grown-ups table, we will notice just exactly how much food she gets all over her face.","commenter_a":"I think DT,were say that she was ugly!!!","post_message":"Carly Fiorina will finally get her chance in prime-time."},{"comment_id":"1285345191558532","commenter_b":"She is the Bitch.!","commenter_a":"love Hillary...Kill Babies.... $$$$$%","post_message":"The star actress makes an excellent point.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"458794547627679","commenter_b":"Hillary is not worthy of being president. Why would a progressive vote for her?","commenter_a":"These Sanders supporters that would rather see a Trump presidency were never Bernie supporters, they were Hillary haters. Any progressive ideas or policies would be set back decades with a Trump presidency. Not to mention how far back we would be set back with a conservative tilted SCOTUS. It is a sad day for this country. Donald Trump is going to be the next president. God help us all.","post_message":"Trump is in the lead? This is terrifying."}]
