[{"comment_id":"10153677657398132","commenter_b":"She to good for him it's time she finds a real man","commenter_a":"More like scott dick sack !","post_message":"\"They urge her to never take him back.\""},{"comment_id":"10153396293173525","commenter_b":"@username, yes I do know that. It has never happened despite 45 of 50 states allowing open carry, and some that have NEVER PROHIBITED it since they became states. No open carrier has ever been \"taken out' by a criminal.","commenter_a":"Kinda think it's dumb. Makes you a target basically. Someone will see ur gun and be like let me take them out first... Ya kno... Element of surprise is better.","post_message":"OPEN CARRY: The same law that's being proposed here in Florida just went into effect in Texas, and to celebrate, several groups rallied at the State Capitol carrying their guns.  STORY: @webpagelink"},{"comment_id":"814574258686460","commenter_b":"The ladies of The View were rude and disrespectful. It seems like they only invited you on the show to badger you. Whoopi is worse than Bill O'Reilly. She kept interrupting you & would not let you get your point across, and Joy just laughed at everything you said like it was some kind of a joke. They don't care about their guests' viewpoints at all. I have to say that I admire you for being the great person that you are.","commenter_a":"Thank you, Dr. Carson, for remaining the gentleman you are while on The View today. I must say I stopped watching that show years ago. I watched today because you were on. I have great respect and admiration for you. Donald Trump is not my first choice for President. I will vote for him if he is the Republican nominee. Maybe some of your calmness, thinking before you speak, will rub off on Donald if he is nominated and elected President. The women of The View are not my cup of tea. I turned the show off as soon as your segment was over.","post_message":"I would like to thank the Ladies of The View for having me on. Though we disagree on politics, the beautiful thing about America is that we're able to have platforms where we can discuss those differences. I will continue to work hard to ensure that this remains for generations to come."},{"comment_id":"741319736029564","commenter_b":"@username. That's ridiculous.","commenter_a":"It's just sad. Sad. You are more worried about getting the United States into a war than you are taking care of the people of your own state. @username - makes a great point why, why Tom do you keep opening yourself up to this and then turning around and bragging about Trump being as good as his word. That's worked well for this country so far hasn't it?","post_message":"The president said we were putting Iran on notice, and I'm glad to see he's as good as his word. Iran's ayatollahs will stop their provocations only if the U.S. shows strength and resolve. These sanctions are long overdue, and they're sending the right message to the regime in Tehran: Cease and desist immediately."},{"comment_id":"10152849864834342","commenter_b":"Woman can be evil also.","commenter_a":"Sad.","post_message":"Rebekah Holly Speer, 36, is charged with cruelty to animals after authorities say they found several dead dogs -- at least one shot and stabbed -- at a home in the 3500 block of Deep Anchor Way"},{"comment_id":"10153122540893984","commenter_b":"This lady need to go and get a life !!!","commenter_a":"She hit the old nail right on the head! Hopefully, this congress will \"grow a pair\" and knock him right off his \"High Horse\"!","post_message":"This lady's fightin' words will get your blood flowing on a Monday.  Do you support this kind of boldness on Fox News?"},{"comment_id":"678882268945673","commenter_b":"Rosie has the mental disorder! She is a raving maniac!","commenter_a":"I thought she was moving....","post_message":"WOW! Leftist Bully ROSIE O'DONNELL Pushes Horrible Rumor On Social Media...Suggests Barron Trump Has Mental Disorder [VIDEO]"}]
