[{"comment_id":"834253316765245","commenter_b":"Send her back where she came from","commenter_a":"Put her in jail","post_message":"This is as low as it gets.  She is a traitor.   What do you think her punishment should be?"},{"comment_id":"10153948812912434","commenter_b":"@username you are a AntiWhite and you are for White Genocide that is why you call me a Nazi. ALL White countries and ONLY White countries are being flooded with third-world non-whites, and Whites are forced by law to integrate with them so as to “assimilate,” i.e. intermarry and be blended out of existence. Massive immigration and forced assimilation is genocide when it’s done to Tibetans in Tibet. When it’s done to Whites in White countries, it’s called “diversity.” By UN Convention, it’s genocide: “Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part.” Diversity is a code word for #WhiteGenocide!","commenter_a":"White genocide is real and we can prove it. Learn the truth. @webpagelink","post_message":"The threat of ‘white genocide’ is a conspiracy theory, promoted by elements of the so-called alt-right and fueled by anxiety over fertility and immigration trends, that was popularized by South Carolina segregationist Bob Whitaker. The idea also comes up in the writings of Dylann Roof, who murdered nine black parishioners at a church in Charleston."},{"comment_id":"1222107054548141","commenter_b":"Fucking weird bitch","commenter_a":"@username @username wdf","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"},{"comment_id":"10152758056381051","commenter_b":"In her own bed? I would've picked something heavier than a shoe! Id burn the bed.","commenter_a":"He is scum her bed he needs to loose his penis cause hr is thinking with his small head","post_message":"When this wife got home and found her husband in bed with another woman, she decided to teach him a lesson."},{"comment_id":"10154727514062235","commenter_b":"Between crooked Trumpkin and crooked Hillary I'm going to vote for Hillary.","commenter_a":"A vote for Donald Trump or any politician who supports his candidacy is a vote for discrimination. Period. No exceptions. No excuses. You might as well tell your Black, Latino, Asian, LGBTQ, Muslim, Jewish, Native American, non-Christian, disabled and woman fellow Americans they are not welcome in the U.S.","post_message":"Okay, Mr. Trump adviser, there is a big difference between a fact and just something you wish was true."},{"comment_id":"10154310886941178","commenter_b":"Spanish came from Spain which invaded south and north america long,long ago.So yes,spanish speakers invaded,killed and stole land long before white people.Feel better now?","commenter_a":"All you Mexican flag holders need to go back to the country you remain loyal to. Only legal Mexican are loyal to the USA. We welcome the ones that come in legally to assimilate and make America their country.","post_message":"The LA Times gets political over the Trump protests.  Here's their biggest concern..."},{"comment_id":"10153851537376162","commenter_b":"They are bad dogs they should exterminate that race!!!","commenter_a":"Let me guess it was a pit bull??","post_message":"PET ATTACK: A 34-year-old woman with physical disabilities is in critical condition after she was brutally attacked by her family pet on Chicago's Southwest side."}]
