[{"comment_id":"1142049429235281","commenter_b":"I'll unzip my dick for you, gurl","commenter_a":"#VoteJillStein!!!","post_message":""},{"comment_id":"10156577141610603","commenter_b":"Now we have another whack job in Washington today. Something is in the air, like desperation.","commenter_a":"According to public records, Ford has an extensive criminal history, including charges for burglary, fleeing police officers, grand theft and an unspecified felony. Most of the incidents occurred in Broward County, Fla., and date back to 1996. His girlfriend said: He is an alcoholic, violent, depressed. It’s my belief he is in desperate need of medical & psychological help!”","post_message":"Cedric Ford was at work when he was given a 'protection from abuse' order roughly 90 minutes before he went on Thursday's deadly shooting spree, according to police."},{"comment_id":"1166997406690286","commenter_b":"We also have an excess of employers giving jobs to illegals. So really we don't have an illegals problem we have an employer problem. If there were no jobs to be had there would be no illegals.","commenter_a":"I don't want more foreigner coming in. that is for sure.. but.. there are right now 10 jobs for every man women and child in this country.. way way more jobs than people.. way more.. so..","post_message":"Do you agree with Senator Sessions on this?"},{"comment_id":"10153489141693984","commenter_b":"No that bitch crazy","commenter_a":"Hope she isn't elected.....","post_message":"With what we know about Hillary's perfectly planned events, it is not too far-fetched to believe what these people are accusing her of...  Are you hoping all the Clinton controversy will force Hillary out of the race?"},{"comment_id":"10153986549963132","commenter_b":"stupid bs, she feels fat and ugly.grow up kim.","commenter_a":"Oh please. She acts like she is the only woman that has ever had problems while Pregnant.","post_message":"Kim Kardashian West is opening up about what could potentially be a very scary delivery."},{"comment_id":"1286274651384789","commenter_b":"Go home.","commenter_a":"Why is this degenerate getting so much coverage....He's Disgraced HIS SON who died in 2004!!","post_message":"Khizr M. Khan has published papers supporting the supremacy of Islamic law over -made Western law  including the very Constitution he championed in his Democratic National Convention speech attacking GOP presidential nod Donald Trump."},{"comment_id":"10153743354289614","commenter_b":"He doesn't like illegals","commenter_a":"You know TRUMP is mad!","post_message":"BREAKING: Mexico has defeated the U.S., 3-2, in the CONCACAF Cup match at Rose Bowl Stadium in Pasadena."}]
