[{"comment_id":"406947019493592","commenter_b":"Another ride, but this time take obummer out","commenter_a":"Good for them!","post_message":"Enough is enough for these bikers..."},{"comment_id":"1150363668364697","commenter_b":"In other words you won't be out of pocket otherwise you could still go ahead and spend a tiny bit of the fortune you have made from the British people, you'r an utter disgrace to this country. put some back in instead of out you fuckwit arsehole virgin c**t.","commenter_a":"Tell us what the deal was, then we can make a judgement. Could be bs. for all we know.","post_message":"And Richard Branson has cancelled a deal costing some 3,000 jobs..."},{"comment_id":"926308994070863","commenter_b":"Nope, I kill the bastard and accept id be going to prison my whole life, but at least my child would live.","commenter_a":"It's possibly the worst idea in history to allow the shooting of a cop. Even the absolute worst cop could be clubbing a baby and still, if he were shot and killed in the act he'd die a hero and we'd never hear the end of it. We need to shoot cops, but with our cameras, never ever with a gun.","post_message":"Some states are dealing major setbacks to the Police State."},{"comment_id":"1359423070754409","commenter_b":"WOW gives a whole new meaning to hard boiled and 3 minute egg","commenter_a":"So we're any charges filed on the creeps who took advantage of her bad luck?","post_message":"The woman admitted she exchanged sex for money and that she performed sexual acts in a chicken coop."},{"comment_id":"1140355262709675","commenter_b":"@username, I see you as the Liberal that you are, crying for this BS, but you'd be the first one to file a complaint AFTER you've been accosted by a perv in the women's bathroom.","commenter_a":"No, I'm not done shopping at Target. Do all these people really believe they'll be attacked? Get over yourselves.","post_message":"Target just announced that transgenders will be able to use any bathroom they want. I'm pretty sure they were not expecting what happened immediately after their announcement...  Are you done shopping at Target?"},{"comment_id":"10153294543663701","commenter_b":"Lets here the song about an old woman molesting you when you were a kid.. LMAO!","commenter_a":"@username :)","post_message":"Garth Brooks rocked the Rose City on Sunday! If you missed out, the Moda Center just announced that limited tickets are available for his three remaining Portland performances."},{"comment_id":"1830025417217655","commenter_b":"Maybe he was looking at her pussy to grab it.","commenter_a":"Maybe he needed help figuring out how to fill out the ballot","post_message":"LOL!  Image by Occupy Democrats, LIKE our page for more!"}]
