[{"comment_id":"914001441995307","commenter_b":"Awsome woman!","commenter_a":"Barry Sheldon this was what I was talking about earlier","post_message":"BREAKING VIDEO: Mother Beats Her Son When She See Him Rioting in Baltimore  Mother of the Year Award? She goes straight hood on her son.   @webpagelink"},{"comment_id":"1267659423273512","commenter_b":"JUST SHOOT THIS BITCH==PLEASE.","commenter_a":"SOMETHING TO THINK ABOUT -- do you know that Hillary will be bringing into the USA thousand of Refugees and Illegals just within the first year. ISIS has told the US that they will be sending in ISIS men and Rascal Islamic's in with them. Do you want to keep your family safe from the Radical Islamic's and the Illegals along with the threat of Sharia Law . Also the threats that the BLM has made to all Americans and Hillary is behind them also. Then you need to put your family first and vote for TRUMP . Because if you vote for Hillary you might just as well kiss your ass and the USA goodbye. We need to take our Country back Hillary has already proven that she is trying to destroy us. Don't forget our men in Benghazi and all the Email scandal and the Clinton Foundation . ...","post_message":"It's even WORSE than you thought!! @webpagelink"},{"comment_id":"10153694890631323","commenter_b":"What are black women always the ones who show so much ignorance","commenter_a":"If they aren't defined by it than why change your sex medically? Come on","post_message":"They could have made something positive, but the new Channel 4 series Girls to Men is demeaning to trans people on so many levels: \"Greater visibility for trans people should not mean even more close-up shots of genitalia and 'Ooh, don’t they look different – almost like real men' montages. It should be about taking the focus off surgery, suffering and sensation, because a transgender man is not defined by those things any more than the next person\""},{"comment_id":"10152561774511813","commenter_b":"Gigantic assholes.They should both be ass-raped, and have the first miracle ass-babies. See how they feel about the issue then.","commenter_a":"ACLU Are you helping folks like this from gov't overreach? @webpagelink","post_message":"Are these people who we want to make decisions about a woman’s reproductive care? Tell politicians: don’t turn back the clock on women’s healthcare. @webpagelink"},{"comment_id":"1125221904203952","commenter_b":"Wow...you can't judge an entire religion by the actions of a few?!!! wow...where have we heard that before? yet...it goes ignored, until that line of thinking works for the christian cult members....then its supposed to be real........nice one cindy! this is just more proof that there is no such thing as \"GOD\"....or if one is up there, he is a mean spirited, vindictive SOB and i want nothing to do with him","commenter_a":"I hope all these co called Christians that praise what has happen have something awful happen to them Human beings were killed it does not matter who or what they were. You poeple should be ashamed","post_message":"This is not how decent people react to tragedy."},{"comment_id":"10155445943810725","commenter_b":"Sadly though it still happened :(","commenter_a":"Everyone who leaves their child with anyone should have a nanny cam.","post_message":"Nanny cam video reveals horrific new details on how a babysitter tortured a 3-year-old girl (Warning: Disturbing content)-----> @webpagelink"},{"comment_id":"500607250129855","commenter_b":"Smoke them if you got them, probably can get the best shit.","commenter_a":"This right wing crap. I am right of the right and this is crap","post_message":"The White House is in uproar after Obama daughters caught doing THIS.  This is outlandish. These are the daughters of our president.  Would you vote to kick the Obamas out of the White House?"}]
