[{"comment_id":"10154427590982577","commenter_b":"Shes just a lil woman thang. Ughk. Hillary should be in prison.","commenter_a":"Isn't it funny how she plays dumb to this stuff too? On her 60 minute interview she said she had no knowledge of these emails even though it's all over the news. She plays dumb to every scandal and people still blindly follow this idiot","post_message":"Wikileaks Crashes The DNC   The Clinton campaign is pointing its crooked finger at the Russians as the culprits responsible for hacking the emails of the Democratic National Committee going all the way back to last summer. John Podesta, the chairman of the 2016 Hillary Presidential campaign claims Russian President Vladimir Putin is aiding Donald Trump’s campaign because there is as AP reports  “a kind of bromance going on”.  As if one more fabrication of reality could sway the narrative back to the Democrat's camp. And whether the Russians hacked the DNC emails or if it was the Romanian hacker claiming responsibility known as Guccifer 2.0 really doesn’t matter.  What matters is that now the American people know how riddled with deception the DNC truly is. The political machinery propping up Hillary's campaign is quickly coming apart at the moment she should be dominating. The released 19,252 wiki leaks internal emails that were hacked from seven officials at the DNC have served as a battering ram, exposing a organization laden with deceptive practices on a monumental scale.  Aside from the DNC's obvious favorability of Clinton over Sanders because of her gender and the jabs taken at Sanders religion. The emails detail a manipulation of the media of grotesque proportions. Relegating mainstream media to nothing less than a propaganda machine.  In this email the DNC’s National Press Secretary Mark Paustenbach says of a Politico reporter Ken Vogel “ Vogel gave me his story ahead of time/before it goes to his editors as long as I didn't share it. Let me know if you see anything that's missing and I'll push back.\""},{"comment_id":"10153378871661130","commenter_b":"@username get a life and get out of the reproductive business of women.","commenter_a":"Planned Parenthood is more than abortions and those who only focus on that are very closed minded. I support planned parenthood.","post_message":"The REAL truth."},{"comment_id":"933218310052361","commenter_b":"So how many snipers are needed to guard them from poachers?","commenter_a":"There's a herd in Florida too.","post_message":"Well, would ya look at that! (via TakePart.com)"},{"comment_id":"2125671227658021","commenter_b":"And also a puppet parasite. She made thousands of ill people live in poverty and her life was everything except that. What a lie! ........ the same thing happens with jews, they say they are the people of god! Which one? Money god?","commenter_a":"MOther Theresa ... Love, Hope and Charity... Saint of the people ... Pray for us ... Amen.","post_message":"Mother Teresa is set to be canonized – made a saint in the Roman Catholic Church – on Sunday @webpagelink"},{"comment_id":"471302453029710","commenter_b":"Shut up bitch","commenter_a":"Lovely comments. Your humanity cards should be revoked. Two pilots died. They weren't bombing anyone. They didn't authorize an invasion. They may have left families. They made modest incomes. Let's hope we can oppose Russian foreign policies without celebrating the deaths of two everyday Russians. Condolences to their families.","post_message":"This is the sixth military aircraft accident in the country in just under six weeks."},{"comment_id":"10152814272036973","commenter_b":"Dogs hurt others to protect themselves, their pack, or their belongings out of instinct. Humans have the ability to think before they hurt others, yet they still choose to do it. This is why I care about animals more than most people.","commenter_a":"To bad people don't care bout homeless people as much as they care about dogs. Smh","post_message":"Every day, on average, three dog bites serious enough to break this skin are reported to authorities in the Portland area. In round numbers that's roughly 1,000 people injured annually."},{"comment_id":"10153306961394087","commenter_b":"Build that big beautiful wall!","commenter_a":"The Trump Haters are the biggest whiners and cry babies in America ! Say all you want ,Hate all you want !.. But you cannot stop the train from heading to the White House !.Donald J. Trump for President 2016 !","post_message":"\"I don't know if that's because she is incompetent, or she doesn't like me or maybe she's given instructions from up above,\" Donald J. Trump said about CNN reporter Sara Murray after accusing her of purposely not recording the large crowds outside Trump's book signing event in New York."}]
