[{"comment_id":"911808665590508","commenter_b":"Go home","commenter_a":"Ok send these people back where they came from.....F them!","post_message":"OUTRAGEOUS: MUSLIM Students At Public School Walk Out When NATIONAL ANTHEM Plays  Lets get 3000 SHARES if we should deport them!"},{"comment_id":"642968752533659","commenter_b":"Amazing that this man who is causing all this problem is in cahoots with the Clinton foundation. Also the Muslim brotherhood. Look it up. He's also a lawyer who helps to bring in people illegally. Real \"good\"guy...and why was he attacking Trump? Trump did not want the war nor was he president or a senator who voted for the war. Nor is he the president now who has let ISIS run amok.","commenter_a":"He doesn't need to apologize. Hillary Clinton needs to apologize. If we did not go to Iraq their son would still be Alive. Hillary is to blame for running arms to muslim brotherhood. Khan attack Trump on national television. Trump responded. And cnn is Hillary Clinton fan club. Lol","post_message":"\"Is it difficult for your father to apologize?\" a co-host asked Eric Trump"},{"comment_id":"523889751104313","commenter_b":"Ban muslims ? Better chance at banning tards first. Show me where islam justifies it. Quote the quran. If you have brain cells, lets discuss islamic facts.","commenter_a":"Where are the idiots who just a few hours ago were blaming gun laws for this? Where are they now?? Are they all shy and in hiding after it has been proven this was done by MUSLIM TERRORISTS? Muslim terrorists killed 150 people in Paris too, and they don't have the second amendment in France, how come??? #BanMuslimsNotGuns","post_message":"Authorities have named the two attackers suspected of carrying out the shootings before being killed themselves as Syed Rizwan Farook, 28, and Tashfeen Malik, 27."},{"comment_id":"10153656983536813","commenter_b":"Straight up asswipes.","commenter_a":"Lazy , sloppy police work, just pin it on anybody to close the case","post_message":"Children should get to talk to a lawyer before they are interrogated by police."},{"comment_id":"1132859160143668","commenter_b":"Ian, Trump has also excepted money from the Saudi's, ad a matter of fact, he owes them for a billion dollar hotel project in the UAE. So....please.","commenter_a":"I'm no trump supporter but things like this are just bias non stories. I'm sure if we went through each candidates individual supporters we could find a long list of unsavory people who believe and do unsavory things.","post_message":"The young, black protester was being escorted out at the time of the incident."},{"comment_id":"1262038440498279","commenter_b":"I don't. Some women do.","commenter_a":"As a man, I have to ask, what is it that you women want from me? More of my money in divorce court? You want me to stop holding the door open for you? Maybe I should stop fixing your car or the plumbing in your home. In combat, maybe you should \"take the point,\" would that make you happy? Centuries have passed since Adam & Eve and the world is still asking, \"what do women want.?\"","post_message":"Huge crowds are marching worldwide for women's rights."},{"comment_id":"10153335574974384","commenter_b":"A complete waste of good female human flesh.","commenter_a":"Communist scum.","post_message":"Celebrating Women’s History Month by honoring women of \"Supreme\" achievements! Indeed, an inspiration to us all."}]
