[{"comment_id":"10153239066656491","commenter_b":"No he wouldn't lol. Hagrid wouldnt be close to slytherin","commenter_a":"All muggles should be sorted to Hufflepuff.","post_message":"J.K. Rowling isn't afraid to tell Harry Potter fans when they're wrong."},{"comment_id":"696420180548560","commenter_b":"Personally I am glad that Texas is not taking any refugees. Imagine the amount of terrorist polluting the state.","commenter_a":"Good for you Texas Gov.!!!! Let's hope that our spineless president doesn't stymie this action.!!!","post_message":"Texas Gov. just released this very bad news for all refugees. The are setting a trend. Let's spread this. Can we get 75,000 'LIKES' for the great state of Texas?"},{"comment_id":"932260496814809","commenter_b":"You believe and listen to the \"man hating\" feminists which aren't a legitimate example of the feminist movement.","commenter_a":"Thank you. It's time the \"real\" (for lack of a better term) feminists become the majority over the \"man-hating\" feminists.","post_message":"It's so misunderstood, but they clear it up — by using the word 32 times. - Rebecca Eisenberg"},{"comment_id":"10153673371886336","commenter_b":"Exterminate them all","commenter_a":"And they wonder why their lives don't matter?","post_message":"Scott Lattin and his family painted the words “police lives matter” on the back window of their truck.  Then, someone spray-painted obscenities about the police on their car and wrote “black lives matter” in spray paint across the side of the truck.."},{"comment_id":"10153653064325575","commenter_b":"Please get rid of this POS","commenter_a":"100% pathetic - Trump 2016 !","post_message":"Talk about OUT OF TOUCH!"},{"comment_id":"449908955134145","commenter_b":"Can't answer the question, Joey?","commenter_a":"This is absolute overkill. I get we should police the police but come on. You're going out of your way to stop an officer from doing his job","post_message":"This baby faced cop looks fresh out of the academy and willing to follow any order he is given. Luckily this veteran government accountability activist planted some seeds in his mind about who he is actually working for and how liberty is a better solution.  Watch the epic schooling RANT: @webpagelink"},{"comment_id":"10153154499205047","commenter_b":"I agree, so strap on your guns and make sure we have at least 30 per mile waiting 24 hours a day, around 50,000 a day, and see how long we can do it until Trump gets the 7 billion dollar wall built, and then starve everyone, because we won't have anyone to work on our farms.","commenter_a":"It is obvious they are crossing our border and Washington is doing absolutely nothing to stop it. It is also obvious that there will be another attack here in America and Washington is doing nothing to stop it. Their solution is to take our guns away from us so we have no means of protection what so ever. America wake up! We must get rid of Obama before he gets us all killed, it is just that simple!!!","post_message":"We know ISIS wants to infiltrate our homeland, yet our borders remain unsecured.  It's time to take action.  It's time to guard our borders.    Sign our petition if you agree: @webpagelink"}]
