[{"comment_id":"981969021843756","commenter_b":"Republicans want to end abortions so that they will have more population to draw on for their future wars. Think about it: End abortions, brings on many children that the parents can't care for (likely because of finances). The child likely grows up in poverty, being told (by the same people that ended abortions) he/she is a leech on society (parents likely getting assistance), so that child will grow up and most likely do one of two things (a few will take a different path, of course). 1) begin a criminal career 2) join the military to be fodder Republicans want to abort YOUR children when they are adults....THAT is why they want to end the termination of unwanted pregnancies.","commenter_a":"Attack on women!!!!! All you saying baby killers start adopting them then...start helping poor young women survive during pregnancy and after child is born, start fighting for wic, head start, etc...how many severely disabled children have you adopted? Big mouths refuse to help real babies only care for fetus","post_message":"Every child is a gift from God.  That's why the House just passed some of the most pro-life legislation to ever come before Congress – banning abortions after 20 weeks."},{"comment_id":"10153233939551130","commenter_b":"Shame on you, damned sexist!","commenter_a":"\"Just to hold it in your hand\"... Yeah, that's not how tampons work >;)","post_message":"The best way to bring a tampon to the bathroom is just to hold it in your hand."},{"comment_id":"10153443725952293","commenter_b":"O AGORA SOSSEGA E ME DEVOLVE MEU DESODORANTE","commenter_a":"Victoria Dowsley","post_message":"Why it’s smart to buy the men’s version of almost anything."},{"comment_id":"1731115690475220","commenter_b":"She should just go NOW!!!","commenter_a":"Another nut.","post_message":"Barbara Streissand says she's joining Al Sharpton and leaving the country if Donald Trump becomes president. Would you miss them?"},{"comment_id":"1302393583116762","commenter_b":"@username The woman brings up the fact that \"She voted For Trump \" herself","commenter_a":"Why does all the evidence in this video seem half baked @username? I wanna know exactly what was said before the video snippets as to why this woman feels shes being discriminated against in the first place!","post_message":"This Trump supporter went on a racist rant in a store while another customer recorded her meltdown over \"reverse racism.\""},{"comment_id":"1193491007392830","commenter_b":"@username she better pray that she does. Her crooked butt will see prison bars.","commenter_a":"Horrifying? No, what is horrifying is you ignoring the pleas for help from four Americans, for 13 hours, while they were tortured, raped, and murdered, you evil witch.","post_message":"Debate question: Will Donald Trump accept the results of the election?  Donald J. Trump: “I will tell you at the time. I’ll keep you in suspense.”  Hillary Clinton: “That’s horrifying.”"},{"comment_id":"518655931675108","commenter_b":"@username no all men do not have affairs!!","commenter_a":"Thank you Marine for speaking the truth Hillary is a liar and murderer and should be put in the electric chair, Bill is as bad as Hillary and I can understand why he was screwing Monica. From what I read Hillary likes screwing with other women","post_message":"Marine Confronts Hillary To Her Face About Benghazi, And Then THIS Happens [VIDEO]  Let's show this man our support!  Can we get 30,000 'LIKES' for this Marine?"}]
