[{"comment_id":"1961690760557329","commenter_b":"How gorgeous is their baby gonna be @username @username can't believe one of my other husbands got someone else knocked up tho wtf","commenter_a":"Montana Cases","post_message":"Congratulations Rosie Huntington-Whiteley!"},{"comment_id":"10153394565113984","commenter_b":"As my friend @username said, stone the bitch!! I agree","commenter_a":" sorry, I can't take her seriously.","post_message":"The mother of condemned Boston Marathon bomber just made a chilling threat to America following her son's sentencing...  Do you think this Boston bomber got what he deserved?"},{"comment_id":"1412614535483745","commenter_b":"Hey opee what the fuck did you ever do for our country. Not a damn thing. Any thing you have to say a worth shit. And as far as that POS obummer did even less.","commenter_a":"Keep you nose out of politics...you are best doing commericials for Weight Watchers...I am sure you need the money! Why don't celebraties keep their big mouths shut!","post_message":"This is a coordinated, collaborative effort on the part of the news and entertainment media to destroy Donald J. Trump, his administration, and the half of the country who supports them.  But notice the part of the Oprah story the media WON'T want to report."},{"comment_id":"10153082331816600","commenter_b":"I agree Kaliah Nichole! I am not a fan of what Obama is doing either, however, to say that vaccinations don't work is absolutely ridiculous! The comment about hippie is because there are so many people \"hippies in the 70s\" that thought that we were all invincible and that we shouldn't have any restrictions and that the whole world was all about \"love\". This is not a game and even though our children get vaccinated and should be immune and resilient to certain viruses, this is not a game and not all immunizations are foolproof! So it's better to be safe than sorry and if people don't want to have their children vaccinated then they should all go to a communal area and go to school with each other and spread diseases amongst one another.","commenter_a":"Let's BAN @username! Go to a foreign country and bring back all types of diseases and parasites because of your lack of knowledge! Clearly by the looks of your picture you're a hippie who thinks that every thing you do is okay and that your indestructible because you smoke weed! Get an education and do your research!","post_message":"If a parent refuses to vaccinate their child and the child goes on to spread a deadly illness to others, do you think there should be consequences?"},{"comment_id":"10153184918416336","commenter_b":"never believe this man promise. that's look errr. that's look that can behead you, rape your children and take your wives.","commenter_a":"The face of evil.","post_message":"Abdul Rahman Shalabi, who allegedly served as a bodyguard for Usama bin Laden, went before a parole board to ask for his release so he can marry and have a family."},{"comment_id":"1360485817324205","commenter_b":"She is so stuck on herself. She thinks she's some sex goddess that's all she talks about. Blaaaaa get her gone I say!!!","commenter_a":"Dennis, please read the below with your comments","post_message":"SEAN STRIKES BACK AT MEGYN.  Good.  Now she's at odds with Hannity & O'Reilly.  See what Hannity wrote to her:  @webpagelink"},{"comment_id":"10152933046001051","commenter_b":"Lady get it straight..stay home Granny! No, i'm not following you...Really!!!","commenter_a":"I sure hope not","post_message":"Here is Hillary Clinton's first campaign video. Simple question: Will she be the next President of the United States?"}]
