[{"comment_id":"848307568693153","commenter_b":"GO stuff your FAT ,UGLY, RACIST face!","commenter_a":"What IF I ONLY HATE \\bOBAMA'S \"WHITE\" Half???","post_message":"If you hate Oprah does that make you a racist..."},{"comment_id":"1541468506160349","commenter_b":"If, they take away guns criminals will build bombs !","commenter_a":"America has got to be in the grip of a a gun cult. When reason and logic doesn't work, you know the NRA propaganda has got a serious grip on us. We've shown the world how much our armed gun citizenry has worked - America's mass shootings are on a continuous news cycle being aired around the world. They must think we are arrogant when we refuse to look at their own country's statics as proof that less guns indeed do work. It's so logical, so reasonable, less guns, less gun related deaths. Yet we continue to be surprised at each mass shooting and continue to have vigils and prayers only to buy more guns. Other country's must laugh sadly at our arguments of death by spoon, forks or auto or our description of a gun being an inanimate object or that guns don't kill. Other countries must seriously hate ...","post_message":"Mic drop.   Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"475027816013769","commenter_b":"Guess she is a shameful person.","commenter_a":"Remember, she was also \"ashamed\" that Bush was from Texas","post_message":"Dixie Chicks member Natalie Maines also took aim at Donald J. Trump, tweeting, \"As long as Donald Trump's decisions for America are as solid as his decision about his hair, we're in good shape.\""},{"comment_id":"10153822005111519","commenter_b":"It doesn't fit her","commenter_a":"Plus not just only black ppl have this done. White and other colors do 2.","post_message":"Lil’ Kim’s bleached skin and blonde hair are the tragic result of sexism, racism, colorism"},{"comment_id":"1033684776642992","commenter_b":"Really???? No more than white folks killing each other!!! Racist azzes!!!","commenter_a":"where is black lives matter now?","post_message":"A deadly weekend"},{"comment_id":"10153310533507629","commenter_b":"Women beater","commenter_a":"He is the scumbag of the earth.","post_message":"Fox News anchor Bill O'Reilly has been accused of dragging his ex-wife by her neck down a staircase in the couple’s home."},{"comment_id":"10153643721675399","commenter_b":"Couldna said it better! <3","commenter_a":"Well, Clinton IS the least batshit crazy Republican running...","post_message":"He also called Trump a \"narcissistic BULLYionaire\""}]
