[{"comment_id":"10154520499329705","commenter_b":"Silly women. Tricks are for kids. Everyone knows women aren't real people. We should go back to the original constitution. Only men should vote and black guys should only count as 1/3rd a vote. I think Trump can help make that happen #Trump2016atleastIdidntrapethem","commenter_a":"More mainstream media hype to distract from the real issues. Wake up people.","post_message":"The Times to Donald Trump: Make. Our. Day."},{"comment_id":"644282239071875","commenter_b":"I wish you ugly frumpy women would shut the hell up. Your blind support of Hillary is going to put Trump in the White House.","commenter_a":"He needs to bow out, pledge his delegates to Hillary and move on.. Hopefully she will have a place for him in mind and he can be of some help in the future. He's led a sterling campaign, but has been on the loosing side for the last few primaries and is bound to loose tomorrow.... YAY Bernie for doing what you did, now solidify the party, tell your supporters to support Hillary and then we can all go forward to enihilating trump and winning the presidency. Your Elizabeth Warren can still BE the VP candidate and together the women can set the world on fire and win... America is ready for this.. Trump must be downed and your support of Hillary will clinch that! PLEASE..","post_message":"Does Bernie Sanders keep fighting through July's Democratic convention? Or does he bow out?"},{"comment_id":"10154228719381545","commenter_b":"I, personally, am quite capable of disliking people of ANY color, @username, if the person deserves it. Stop with the cries of racism because somebody doesn't like a person born with more melanin. I would despise that woman if she'd been born gold-leafed. You're a relic. 'Cut it out.'","commenter_a":"I for one can't wait till they are gone. The money she spent from our taxes is overwhelming. And her lavish vacations are a discrase. I could go on bit I will stop there. Good bye get out!","post_message":"There are certain words that have been used to describe Michelle Obama: Open. Authentic. Unapologetic. It’s that last one that Oprah Winfrey zeroed in on."},{"comment_id":"445168402354286","commenter_b":"Folks are worried about our second ammendment. How about change and uphold immigration laws. For starters vette K1 Visas correctly. Frankly, the current laws aren't upheld now by the lawless folks in our country and government.","commenter_a":"I believe K-1 is a Fiance Visa, wherein the couple must marry within 3 months.","post_message":"***BREAKING***  Muslim Killer Tashfeen Malik was in America on a K-1 (fiancée) visa and held a Pakistani passport.  DEVELOPING..."},{"comment_id":"993754734001845","commenter_b":"Yep she is the one who will carry on his legacy and bring in as many illegals and muslims for us to support until we no longer have a country to call out own while she and Billy relax in their luxury cabin located in some foreign land,, NO THIS bitch can not be allowed into any public office after this!","commenter_a":"I hope when they arrest her they freeze all her assets.","post_message":"“Hillary Clinton is my candidate for President of the United States. She is best positioned to continue the progress made by President Obama on a range of issues -- from strengthening our economy to making the right investments in our infrastructure to common-sense gun safety laws to ensuring a fair criminal justice system,” Transportation Secretary Anthony Foxx said."},{"comment_id":"1130148643687222","commenter_b":"Never. Who would be stupid enough to want murderer Hillary to be over our beautiful nation and wonderful people.","commenter_a":"Utah vote TRUMP!","post_message":"**BREAKING**"},{"comment_id":"10153454337713984","commenter_b":"BITCH","commenter_a":"Garbage! They want us to kidos their feetj!","post_message":"This incident has led to calls for a boycott of United Airlines, but not everyone is jumping on board...  Do you think this airline attendant acted fairly?"}]
