[{"comment_id":"883127565153756","commenter_b":"We have aspects of both a Republic, and a Democracy","commenter_a":"We will never know the truth.","post_message":"I really hope everyone on Facebook reads this."},{"comment_id":"1562229620730818","commenter_b":"Whoopi needs to zip her mouth too!!!","commenter_a":"About time","post_message":"I love ABC for doing what's RIGHT!   Rosie O'Donnell & Whoopi Goldberg have no place on TV."},{"comment_id":"10150935097914999","commenter_b":"no clue what you're talking about?? You're not a woman so sfu!","commenter_a":"No, she's a hypocrite! Have you ever watched an abortion? I have...in 20 weeks it is a baby. In late term abortion labor is induced. The baby's head is delivered. a small incision is inserted into the back of the head the knife is twisted to kill the baby. The brains and skull is crushed.","post_message":"\"Hillary Clinton owned her feminism. She sounded like the first woman running for president, defending other women — our autonomy and our control of our own bodies,\" Emily Bazelon writes in The New York Times Opinion Section."},{"comment_id":"1056873814372366","commenter_b":"Rightly so with people like you ..muslim countries would be crazy to let you in","commenter_a":"No churches can be build in Muslim countries, why should mosques be in Britain .Woman got 200 lashes for just reading a bible in Sadia Arabia just last week.","post_message":"The largest Mosque in western Europe is engulfed in flames"},{"comment_id":"10153847356156162","commenter_b":"It's sexual assault by two nasty woman....!!","commenter_a":"Working for tips...","post_message":"WANTED FOR TWERKING: Two women are being sought for sexual assault after twerking on an innocent man.  WATCH -->@webpagelink"},{"comment_id":"10153428454984087","commenter_b":"She is the biggest liar in history ,ashamed she was the first female to prove it.. Disgraceful bitch.","commenter_a":"Go go go >3","post_message":"\"Do you believe that The State Department, on NEW YEAR'S EVE, just released more of Hillary's e-mails,\" Donald J. Trump tweeted. \"They just want it all to end. BAD!\""},{"comment_id":"709650085834839","commenter_b":"Exactly why I pointed it. Most like her, only dodge and deflect.","commenter_a":"This is not even true and amounts to propaganda plain and simple. And of course this is coming from Florida where an election was rigged. Why don't you educate your fellow man instead of scaring them and filling their tiny little minds with this ignorance; there are so many untruths in this article, number one being the use of the term \"body parts\". Since the majority of abortions are performed at the 12 week mark, these are embryos with no body parts to speak of. There are no videos that show any of this yet that is the main point of your argument. Second, fetal tissue is donated to medical research which is legal and most republicans voted it in (look up fetal tissue for medical research law) and had been, most recently, used very successfully in the treatment of Parkinson's disease. Since most conservatives don't believe in welfare, Planned ...","post_message":"I Freaking KNEW it."}]
