[{"comment_id":"10154555374851337","commenter_b":"She's a big mouthy bitch lol","commenter_a":"Angie Hoekema","post_message":"WATCH Nancy Grace argue that Brendan Dassey's conviction shouldn't have been overturned..."},{"comment_id":"10153218039995090","commenter_b":"Stop Hillary!","commenter_a":"REMEMBER THE.LINTL Whttps://www.facebook.com/judy.winders/posts/@username LINTON. MURDER LIST","post_message":"Taking a road trip this summer? Show that you are committed to Stopping Hillary.  Take the pledge & get your free Stop Hillary bumper sticker: @webpagelink"},{"comment_id":"1748972275334787","commenter_b":"Even if the woman was standing to pee, they are inside a stall with the door shut, Us woman don't peek under the stall to watch other woman pee...only pervs do that","commenter_a":"The thing that makes me LAUGH is people have most likely ALREADY shared a bathroom with someone who is trans and didn't even know it!","post_message":"It doesn't make ANY sense…  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"569607529880232","commenter_b":"Karma is a bitch!","commenter_a":"Reap the whirlwind...","post_message":"The students he ripped off are about to get their revenge."},{"comment_id":"414886538699640","commenter_b":"She needs to keep her legs closed and get a f*^king job....lazy ass","commenter_a":"That's sick","post_message":"She wants one more HUGE favor from us..."},{"comment_id":"10153767217919497","commenter_b":"Let's really make a team effort to versnitchinize the fizemignots.","commenter_a":"Area intern tells employer \"I'm more into first person shooters, than platforming\" is fired on the spot","post_message":"The buzzword has yet to be expounded on or put in context by anyone at the company."},{"comment_id":"667515520077863","commenter_b":"I hope she killed herself!","commenter_a":"Terrible","post_message":"This Texas mother and vocal gun advocate snapped and took the life of her own two children over a simple family argument after spending years criticizing Democrats for \"wanting to take her guns away\":  \"A family spat started inside the married couple’s Houston-area home and spiraled into gun violence that spilled out onto their street.  “It was a family argument that turned into a shooting,” Fort Bend County Sheriff Troy Nehls told the Houston Chronicle. “But we’re still trying to put the pieces together.”   Read more HERE: @webpagelink  Thanks to Point Counter Point."}]
