[{"comment_id":"10154736947540575","commenter_b":"Ignorant bitch. You voted hate. You liberal clowns","commenter_a":"Were was Meryl Stereo about the man that was attached and tortured. Oh yes, he was White.","post_message":"BOOM! Kellyanne Conway Schools Elitist Meryl Streep... ---VIDEO"},{"comment_id":"982852498479883","commenter_b":"racist hater sit down and shut up","commenter_a":"Oh, sure, especially the way he goes to other countries and slams the US, apologizes for America and bows to other world leaders and racist michelle complains that she wakes up in a house built by slaves, was not proud of her country til barry started destroying it and spends millions of taxpayer dollars taking her huge crew on vacation around the world. They are an embarrassment.","post_message":"Are you proud to have the Obamas representing America around the world?"},{"comment_id":"10154282422068128","commenter_b":"\"So Veli, I saw an article about you in the WSJ today...\" Haha, but my only interactions with him were over email, so as far as I know...","commenter_a":"@username veli?","post_message":"“Just when I wanted to nominate Jill Watson as an outstanding TA,\" it turned out she was computer."},{"comment_id":"1257627894274548","commenter_b":"NEVER Hillary!","commenter_a":"It's really quite a disgrace that The Ben Howe Show would've released this right before the election. This clearly shows who he's in the tank for. There's absolutely no reason for this nonsense. He does realize he could've made a three-part documentary on the \"sociopath\" Hillary Clinton, right? Worse yet, her scandals are writing themselves as we speak.","post_message":"“I believe that what happens after this election will define the future more than the election itself.”"},{"comment_id":"10150721738224999","commenter_b":"To bad nothing could have been done to stop the shooting of the first graders. If Obama wants to stop senseless violence he should stop pursuing senseless executive orders and do something like support Kates law. Crimes that are preventable through deTerence and viligiliant police enforcement can actually stop senseless gun violence. Almost nothing at all can stop a crazy person from attacking an elementary school and killing first graders. Fortunately it is an extremely rare event. The vast majority of senseless killings are actually far more preventable. Obamas convictions are misdirected. How about deporting all the illegals from the country. That right there would prevent thousands of senseless violent crimes. Read the stats. Not all illegals are criminals but none of them have the right to be here so if one of them commits a murder its because our goverment is to spineless to enforce the law. Enforce the ...","commenter_a":"I still think about Sandy Hook so much. I can't get past it. My heart still aches for those precious little ones & I still cry. Thank you Mr. President for taking a step in gun control.","post_message":"Shedding tears over the 2012 deaths of children in a Newtown elementary school, President Barack Obama announced executive actions he will take on gun laws. @webpagelink"},{"comment_id":"595624923955506","commenter_b":"yesssss bitch","commenter_a":"@username thought of you bb","post_message":"♫ I'm dreaming of a cheesy Christmas.... ♫"},{"comment_id":"10154440357348256","commenter_b":"ANY WOMAN BUT HILLARY!","commenter_a":"Looking forward to the Change!","post_message":"All 50 signed a letter warning that, if elected, Donald Trump \"would be the most reckless President in American history.\""}]
