[{"comment_id":"599148503619234","commenter_b":"Yeah bitches","commenter_a":"We all know who... @username Daniel Hughes @username","post_message":"This is so accurate  #WSHH"},{"comment_id":"1412614535483745","commenter_b":"Hey opee what the fuck did you ever do for our country. Not a damn thing. Any thing you have to say a worth shit. And as far as that POS obummer did even less.","commenter_a":"Keep you nose out of politics...you are best doing commericials for Weight Watchers...I am sure you need the money! Why don't celebraties keep their big mouths shut!","post_message":"This is a coordinated, collaborative effort on the part of the news and entertainment media to destroy Donald J. Trump, his administration, and the half of the country who supports them.  But notice the part of the Oprah story the media WON'T want to report."},{"comment_id":"486035008253746","commenter_b":"Cover her ugly ass back up. Been eating too many Chitterlings","commenter_a":"Cover her face??","post_message":"A woman is suing the police department... over a hijab?  This woman broke the law, the police are completely in the right.  Do you support our police?"},{"comment_id":"1088416937887089","commenter_b":"The bill won't pass....however, illegals vote any way. There are organizations who are illegally registering them. Absentee ballots are also one of their goals.","commenter_a":"The American people doesn't want this law to pass..it is unfair to the American people! !!!! They dont pay taxes and most doesn't even speak English. ..They dont have a right to vote....And they shouldn't get any kind of welfare either....","post_message":"THE PARTY OF CRIMINALS: New Bill To Give Illegals Right To Vote!  Do you agree Illegals have NO rights, especially voting rights!?   @webpagelink"},{"comment_id":"10153509190373132","commenter_b":"Let her die with respect!!!","commenter_a":"I'm all for it I had to watch my husband die stage four brain Cancer that spread to all organs and bones to see him in so much pain and high doses of morphine to watch what he went through and reading about Brittany I say go for it the right to die with dignity God bless my heart goes out to you and all of you that are going through hell","post_message":"\"I can't wait. My daughter can't wait. I owe this to myself, and I owe this to my daughter. She's either going to come home and she's going to have to discover my body, or she's going to have to watch me die painfully.\""},{"comment_id":"1146246835410774","commenter_b":"Yes is no and no is no! Stupid males! Raaarg","commenter_a":"Dennis Kiil Andersen Mats Hellan Tobias Berntsen @username Magnus Nadheim sykt at denne artikkelen faktisk er legit og ikke laget for tull","post_message":"It's not just \"no means no\" and \"yes means yes.\""},{"comment_id":"1436806433003369","commenter_b":"@username Your vagina is showing....","commenter_a":"#NeverHillary #DNCLeaks #DemExit #StillSanders","post_message":""}]
