[{"comment_id":"506081702885118","commenter_b":"Fuck you too. Bitch ass gringo","commenter_a":"Im mexican and even i say fuck mexico.","post_message":"\"When you're in danger, they're the last people you think to go to.\""},{"comment_id":"10154592575994062","commenter_b":"Hang these neggos today !!!","commenter_a":"They don't even care that they took someone life, so no one should care when they are giving them the chair","post_message":"TODAY: 4 accused of robbing a Houston restaurant and killing a man are scheduled to appear in court."},{"comment_id":"10154734635153797","commenter_b":"I can't believe this! That's why having your ccw's is so important. I will not leave without my .22, might not kill you, but it could save my life. Idk how the laws are there but here in Ohio, especially in Cleveland where I'm from. You need to be carrying. I would've helped her in a heartbeat. No questions asked. Then criminals would think twice, if we all start defending ourselves.","commenter_a":"I'm so mad right now not only at the whole situation but nobody had the compassion to help her I'm thinking of that was my Mother, sister auntie etc... praying..","post_message":"CTA VICTIM ID'D: The woman who was stabbed repeatedly on a crowded Red Line train Thursday afternoon has been identified as 25-year-old Jessica Hampton."},{"comment_id":"10154526553127550","commenter_b":"@username SORE LOSER","commenter_a":"All of you supposed adults in here crying are ridiculous, Republicans lived through eight years of Obama, you can survive four to eight years of Trump. Grow up.","post_message":"North Carolina has officially cast its electoral college votes for Donald Trump."},{"comment_id":"1577321485900379","commenter_b":"Women yes! Hillary no!!!!","commenter_a":"No victory to any women! She does NOT represent me! she's a liar, fraud.. and doesn't even come close to respectable... What a shame for \"women\"","post_message":"Hillary Clinton: “We’ve reached a milestone: The first time in our nation’s history that a woman will be a major party’s nominee for President of the United States.”"},{"comment_id":"10155915782125354","commenter_b":"I'll bet the gals concerned about this shirt just flat out don't qualify to wear one.","commenter_a":"dont want one dont buy one...must everything be a crisis?","post_message":"Feminists are up in arms about this T-shirt. Should Target cave to their demands?"},{"comment_id":"650239665120653","commenter_b":"Congress does the budget not the President. Stop passing the buck","commenter_a":"Close off shore corporate tax loop holes. Oh, would that be a conflict in interest? Legalize marijuana. Tax the church!","post_message":"A new Congressional Budget Office report shows that President Obama’s latest budget would leave us with a $486 billion budget deficit for 2015 alone and a deficit of over $7.2 trillion from 2016-2025. That’s just another reason why my first bill in the Senate requires Congress to do its job, get federal spending under control, and pass a balanced budget."}]
