[{"comment_id":"1482883781727172","commenter_b":"Once the snowflakes find out the expense of their new revolution will cost them their Pot money....they will reconsider. But hey...the gun community is an inclusive bunch. This should be interesting to watch. They will be easy to spot wearing their skinny jeans with a big bulge printing for me to keep an eye on.","commenter_a":"These people give a new meaning to the word stupid!","post_message":"Unreal."},{"comment_id":"992902970750561","commenter_b":":/ I think misogyny runs pretty rampant here. Look at what happened recently in Alberta. A dead woman's genitals were presented in court as evidence that she was stabbed in the vagina after she died from internal injuries to that organ. Usually, a doctor simply saying \"there was a stab wound\" would be alright.","commenter_a":"How long before someone argues some ridiculous point on this?!","post_message":"Thanks for the image, ATTN:!"},{"comment_id":"10153288794126336","commenter_b":"we do love blonde women with breast enhancements and tight dresses , you nasty girl","commenter_a":"on fox news war on women","post_message":"Memorial Day originally honored soldiers from which American war?  How well do you know your #MemorialDay history? Take this quiz with FOX & Friends Weekend! #ProudAmerican"},{"comment_id":"1331566923530327","commenter_b":"Build a wall and make Mexico pay for it","commenter_a":"Just wait until the Beast's Administration takes over. The guy in this story will be considered \"small fry\" when the real unbridled corruption takes off.","post_message":"Top executives of  hedge fund manager Platinum Partners were arrested on Monday and charged with running a $1 billion fraud, potentially one of the largest investment scams since Bernard Madoff. We are #FacebookLive with the Reuters reporter who has been following Platinum's aggressive approach to investing and fund management. Send us your questions."},{"comment_id":"965007433534716","commenter_b":"2 pussy's","commenter_a":"Freya Mistry Rayan Mistry","post_message":"Donald Trump and Jeb Bush are fighting over who is tougher. What do you think?"},{"comment_id":"1817386261807116","commenter_b":"I agree! She is pure evil!!","commenter_a":"Totally agree with Newt Gingrich! She has no scruples! She belongs in prison! Cannot stand this heartless woman! She just won't disappear!","post_message":"Newt Gingrich says Hillary Clinton is without a doubt one of the most corrupt politicians in American history. Do you agree or disagree?"},{"comment_id":"913019148787853","commenter_b":"She's literally the dumbest woman on earth.","commenter_a":"@username @username is there anything in this world that doesn't offend people? Lol good lord","post_message":"\"Star Wars\" fact-checkers quickly took to social media to point out several holes in Harris-Perry's theory."}]
