[{"comment_id":"10153426857830329","commenter_b":"Faketalian !!! Grossest shit ever.","commenter_a":"@username oh my gawd we need to go","post_message":"We all knead this."},{"comment_id":"10153792774496162","commenter_b":"Anna Silva","commenter_a":"Lisa DeRosa Raphael","post_message":"Lucky Charms has finally created a marshmallow-only version of its cereal: @webpagelink"},{"comment_id":"509555075871545","commenter_b":"We will never stop fighting for animals! <3","commenter_a":"OMG ! Enough already ! So very very sad...Cruelty to these animals is dead wrong wrong wrong. Aaron for putting this out there for all to see ! Thanks Keep showing everything you can. You are doing important work. This is your real work here on the planet '","post_message":"It takes the feathers of approximately 75 birds who go through THIS to make ONE down comforter.  It's 2016. There is no excuse for this."},{"comment_id":"10153193077162093","commenter_b":"Women choose their boyfriends over kids all the time. Its only when something bad happens they realize how STUPID they are. If nothing wouldve happened she wouldve kept doing it. Shame it takes something like that to open up some people's eyes","commenter_a":"Skin her and drop her in a lemon juice bath 3 times a day for life.","post_message":"The mom said she desperately wants to be able to go back and make a different choice about leaving the house that fateful day.... @webpagelink"},{"comment_id":"10154241596456491","commenter_b":"Trump has made America great again for sure ! Free coke floating on our shores !!!","commenter_a":"Mom Neelo","post_message":"\"I’ve found marijuana, but never cocaine like this.\""},{"comment_id":"1694209280599095","commenter_b":"Illegal aliens have to register for the draft as do green card holders and U.S. citizens or immigrants who are born male and have changed their gender to female! You want to see a run for the border, get a good skirmish started in NK and use a military draft to man it, you'll see the mad rush to leave the U.S. by freebie wanters.","commenter_a":"And \" The last person that wants to play the nuclear card...is me. But you can never take cards off the table \" - Donald Trump -","post_message":"\"America's commitments to defending our allies remain iron clad.\""},{"comment_id":"980977625292266","commenter_b":"Send them all back to where they came from. We don't need the ANY illegals","commenter_a":"once again in the world of idiots we see how stupid people can get. illegal in country, on welfare, sucking tax payers money and they say they have rights? the only right they have is to get the hell out","post_message":"A group of illegal aliens filed a federal law suit in Georgia for what they claim to be a violation of their constitutional rights by denying them driver's licenses."}]
