[{"comment_id":"10154600253629170","commenter_b":"All the hildebeast fears is losing the election and facing her well deserved comeuppance .","commenter_a":"The FBI said that she had no intent when she broke the law, but Trey Gowdy said in the documents they received from the FBI, that there were no questions to probe if there was any intent. No questions of why, she had a private server. No questions at all, to prove intent. Sounds very fishy. They ( the FBI) just threw that in, ( No intent ) to get her off , from all the crimes that she committed","post_message":"The one thing she fears the most."},{"comment_id":"10154437809561491","commenter_b":"Sorry, no. She is front and centre in this kangaroo court of #45. She cannot have it both ways.","commenter_a":"Let the woman live her life. Sure, I cannot stand Donald Trump to save my life. But what is going to set us apart him? We do not judge people based off of the behavior of someone else. That's what being a liberal is all about. Acceptance of each and every person on the basis of their individual character.","post_message":"The Internet is not happy with the latest post by Ivanka Trump's brand."},{"comment_id":"1089823474413307","commenter_b":"Rhonda, your ignorance of reality is amazing!","commenter_a":"This administration MUST GO, PERIOD. Why is O allowed to take actions that have harmed this country in the eyes of the world???","post_message":"Yesterday, the Pentagon announced that the Russians could be told the location of our ground Special Operations troops in Syria, so that their Russian Air Force avoids them. This is a grave mistake. Once again, the President's administration demonstrates their inability to lead as Commander-in-Chief. Because he does not have an effective strategy for defeating ISIL/ISIS, he is putting troops on the ground without the protection of our air forces and asking the Russians, politely, to not bomb them. For over 50 years, our air forces have ensured no member of the American military has been killed by an enemy airstrike. I hope the Administration’s poor decision-making does not change this fact.  @webpagelink"},{"comment_id":"10153424908946094","commenter_b":"I wonder if the folks at Apple are thinking \"PLEASE Mr. Snowden, don't support us!\".","commenter_a":"Citing an 18th century law concerning iPhones?!","post_message":"A major debate over privacy and online encryption has erupted after the computer giant Apple announced it will resist a court order to help the FBI break into an iPhone recovered from one of the San Bernardino shooters."},{"comment_id":"10152614023801519","commenter_b":"Paula - The money spent by Democrats and Republicans on the Senate election was about equal - Big Corpoarate Money did not win the election for Republicans. The major reason was that 70% of Americans think the country is heading in the wrong direction under six years of the Obama administration. The WSJ Editorial Democrats vs. the Middle Class shows the devastating impact of Obama and Democratic Party progressive policies over the last five years on the middle and lower income class. Progressive Policies buy votes, but destroy prosperity. Anybody with incomes less than $70,000 has been devastated with losses of around 6% to 8% while inflation lowers buying power. @webpagelink","commenter_a":" 12-Step Program for Recovering Democrats is a WSJ Editorial to help Democrats make a recovery from the shock of the last election. Liberals call Republicans names when they have no rational argument to make. @webpagelink","post_message":"Jon Stewart lines 'em up and knocks 'em down..."},{"comment_id":"1154513944599658","commenter_b":"Open primaries work just fine Terrence.","commenter_a":"Yea- Bernie baby! This was a closed primary and they are near a tie!!!!! Can you imagine if they \"allowed\" everyone to vote?!!!!! #therevolutionishere","post_message":"UPDATE: Sanders wins the Oregon primary, while Clinton appears likely to eke out a narrow win in Kentucky. Sanders' cut into Clinton's 270+ pledged-delegate lead likely will be single-digits."},{"comment_id":"1024965370917718","commenter_b":"@username Agreed!","commenter_a":"Being vegetarian doesn't change much in the lives of cattle however. Nor hens. It's better than being an omnivore, yes, but still not cruelty free. Although nothing truly is. From medical treatments, medicine, to our pets sustenance, to palm oil, to beauty and household products, etc. As for diet, we are naturally omnivorous. We would not have survived very well as a species without meat as sustenance and the remainder for clothing/tools, along with plants, fruits, nuts, etc. Especially in the North.","post_message":""}]
