[{"comment_id":"10152628178977016","commenter_b":"Brainwashed female.","commenter_a":"I sympathize with her feelings, but do believe that never including those with whom we disagree in any discussion only solidifies the differences. Perhaps something of event speakers' words sank into W's cranium. Perhaps his presence will help some haters think twice about their positions.","post_message":"Civil rights movement leader Diane Nash calls former President George W. Bush's attendance at Selma anniversary \"an insult to people who believe in nonviolence.\""},{"comment_id":"1084003008332003","commenter_b":"#VOTETRUMP AND BUILD THAT WALL!!!!","commenter_a":"Melania will have the last laugh. She is smarter and prettier than this idiot, not to mention more accomplished and wealthier.","post_message":"Unreal..."},{"comment_id":"665287136906749","commenter_b":"sadistic bastards will rot in hell.......","commenter_a":"Horrifying...","post_message":"The religion of peace continues to disappoint. @webpagelink"},{"comment_id":"1541783172796541","commenter_b":"#__ #__ #StopYazidiGenocide #StandforYazidiWomen","commenter_a":"Hire them!! If they can do the job, HIRE THEM !!","post_message":"If your business or organization is hiring and needs someone to get the job done, hire a veteran."},{"comment_id":"10155461378486509","commenter_b":"trump Come clean , admit your a Rapist and we will feel sorry for you and vote for Hillary ,","commenter_a":"I'd love to see Trump supporters try to deny he said the things he was filmed saying.","post_message":"Watch Anderson Cooper repeatedly ask Donald J. Trump about sexual assault at the last debate. @webpagelink"},{"comment_id":"807700012661940","commenter_b":"But she did. Shouldn't no one not have to go anywhere because fools can't handle their jobs.","commenter_a":"She should have never went to TX in the first place TX is not place for decent law abiding people as we see what happened to her over a signal change, TX is a rebel state always has been that way, and their federal support for programs should be stopped right away. Any kind of support needs to be stopped and let them people that love that place pay for their own social ills then see how they like that","post_message":"\"How did switching lanes turn into all of this?\""},{"comment_id":"1009572635788547","commenter_b":"That's terrible!!! I worry about my children everyday at school!!!!","commenter_a":"Really. Bullying. Is wrong","post_message":"A sixth-grader died Tuesday after a bully stomped on his chest during a P.E. class at a Colton elementary school, the boy's parents told KTLA.  \"This kid did it on purpose,\" said Jose Gallegos, whose 12-year-old son Dominick died after losing consciousness on the field.   However, detectives who went to the hospital where Dominick was taken said there was no evidence of an assault or physical injury that would have caused his death. Investigators are waiting for a report from the coroner's office.   Read KTLA's story here: @webpagelink"}]
