[{"comment_id":"10156981805725725","commenter_b":"Someone should exterminate these lowlifes","commenter_a":"You sorry protesters making violence! Mr. Trump paid for that rally in Cali you only making yourself look bad @username will even make America great for you guys. Stop making yourselves look like fools!! Thanks Bernie for the awesome soundbite!! I think that is personally the best campaign slogan to help @username. \"Hillary Clinton had bad judgement.\" @username 2016!! MAGA! Get out and vote Indiana and California!!! We are behind you 100% Mr. Trump in Mississippi!! My in laws in California are voting for @username!! Across the nation Trump 2016!! Your vote matters love America and vote Trump!","post_message":"Thank you Costa Mesa, California! 31,000 people tonight with thousands turned away. I will be back! #Trump2016"},{"comment_id":"10152607725262452","commenter_b":"How does he have signal?! Lol","commenter_a":"Meanwhile, we're all on our phones judging this man. Lol","post_message":"It's a sign of the times -- an Instagram photo shows a man missing a humpback whale surfacing just two feet away from him because he was glued to his cellphone. @webpagelink  (Photo via Instagram/Eric Smith)"},{"comment_id":"1076190982460519","commenter_b":"She has never been distinguished! She has always been a fraud and an embarrassment to our country!","commenter_a":"Stop muddying the waters, Democrats. SMH","post_message":"FBI  Federal Bureau of Investigation Director James Comey testifies on Hillary Clinton Email Investigation before House Oversight Committee. Complete video here: @webpagelink"},{"comment_id":"10153268989822894","commenter_b":"A marriage should have 3 parties involved at all times!! Furthermore, I don't think women will ever understand how men think..ijs","commenter_a":"Y'all are so quick to judge. Giving him passes to cheat, doesn't necessarily mean he has cheated. And because she's allowing him to do it without being affected means that nothing is wrong with her self-esteem. If she just doesn't want to give her man something, then she leaves it up to him to decide where to get it. And who's to say he's making the decision to cheat? I highly doubt if she's allowing him to do it and not caring, then he isn't. That's so not how men work. And to say that they shouldn't have gotten married is stupid because they've been married for a while and I'm sure she has grown to bring about this decision with her husband. And you're not married for sex anyways. LOL!","post_message":"Mo’Nique Explains Why She Gives Her Husband ‘Free Passes’ to Cheat: ‘They May Give Something I’m Simply Not Willing to Do’"},{"comment_id":"10154118857949087","commenter_b":"Stop it with the memes already! I wish @username would disable them.","commenter_a":"He will be just fine. It's Hillary The Post needs to be concerned about.","post_message":"“It’s beyond debate that Donald Trump is unfit to be president.\""},{"comment_id":"1291576474195436","commenter_b":"Gonna be great for tranny sex!","commenter_a":"Private stall restrooms make it no longer an issue for either side of the issue","post_message":"Target will invest in private stalls in response to protests from customers over its policy allowing transgender customers and employees to use the restroom that aligns with their gender identity.  Do you like Target's move toward inclusivity? Or were you opposed to its policy?"},{"comment_id":"10154425900258366","commenter_b":"There is no wall","commenter_a":"Who f****** cares. Now it will be a party. They're gonna roast him like never before.","post_message":"BREAKING: President Trump has officially announced that he will not attend this year's White House Correspondents' Dinner."}]
