[{"comment_id":"10153380246347217","commenter_b":"Gotta look for the soundtrack","commenter_a":"Ly try it","post_message":"Meowvellous! 🐈"},{"comment_id":"10158588409000354","commenter_b":"Doesn't help that he no longer has any \"insider info\" from the State Department, does it ????????? Schmuck","commenter_a":"Geez, whudda thunk it.","post_message":"You can't make this stuff up.   #ClintonCash"},{"comment_id":"537705639687363","commenter_b":"@username you are wrong ! All the other religions follow AMERICA Laws!! Only Muslims want to bring in their Sharia laws for their JUSTICE , and their law on us and they can't , because Our Constitution, And We As Real American Citizens Will not change our Laws of Justice, for their BARBARIC 7th century murderous, degrading practice!!! Ship you are a bleeding heart Liberal!! Trump is not trying to divide us , He is trying to save this Country from people like you, Hillary, Bernie and that kiss ass Muslim OBAMA!!","commenter_a":"American Muslims are American. Just like American Catholics. Just like American Jews. Just like American Methodists. Just like American Presbyterians. And all the other Americans of various religions. Stop trying to divide us. Trump wants to secure our borders. Why is that wrong? Trump wants to end ILLEGAL immigration. Why is that wrong? Trump wants to verify that legal immigrants are not here to harm our citizens or create havoc. Why is this wrong?","post_message":"This is what American Muslims think about our presidential candidates. You might not be too surprised by what they had to say."},{"comment_id":"1724899471110412","commenter_b":"And what did she sound like a complete or just partial idiot","commenter_a":"Scared Bitch? Sure sounds like you are!!","post_message":"If Democrats REALLY believed Trump's speech was ineffective, they'd want him to give MORE speeches like that, not fewer."},{"comment_id":"1230794190274923","commenter_b":"Umm for a free orgasm I bet you would.","commenter_a":"@username how do we get our hands on some of those mushrooms!","post_message":"This fungus can give a woman an instant orgasm."},{"comment_id":"521473731374253","commenter_b":"Piece of shit impeach this Muslim before it's to latr","commenter_a":"Good every state should ban the refugees from any where. This is our country not theirs.","post_message":"List growing rapidly....America is waking up!!!!"},{"comment_id":"1052165474817204","commenter_b":"Problem with getting help for these people is that they have to realize they have a problem and want to get help. Otherwise, it's a moot point.","commenter_a":"Why take his photo down? This is the poster boy for the NRA. His photo along with the rest should be displayed everywhere guns and ammo are sold.","post_message":"Chris Harper, 26, had posted on a blog about the TV reporter and cameraman who were shot dead: \"Seems like the more people you kill, the more you're in the limelight.\""}]
