[{"comment_id":"10153796714106636","commenter_b":"Lady please..take a seat!!","commenter_a":"Obama has destroyed this country and race relations in US","post_message":"\"Black men dying and being forgotten. People retaliating against the people that are sworn to defend us. We have to come together and end all of this.\""},{"comment_id":"934295046610968","commenter_b":"Run Sarah RUN!! President Palin has a certain \"RING\" to it !!!","commenter_a":"SHE IS OK WITH TORTURE. REMEMBER?","post_message":"When Sarah Palin posted a picture on Facebook bragging about how her son used their family dog as a \"stepping stone,\" she proved once again that animal abuse doesn't bother her at all, and animal rights groups are now slamming her for it."},{"comment_id":"10152864725267623","commenter_b":"Bajajajajaja!!!! Girl white isn't in it either! Lol","commenter_a":"Lmfao!!!! I am loving how pressed these folks are over this!! Get over it people...and move on!! I'm so happy with my President!","post_message":"Check out what the Obama administration did to the White House:"},{"comment_id":"10153148918692217","commenter_b":"@username yeah because he will send you back to Mexico..... and will put a full stop to cross jumping.... All those tunnels on the US border in Texas will also be sealed.","commenter_a":"old news.","post_message":"Using their tune? Donald J. Trump needs to \"Dream On\" 🎶"},{"comment_id":"10153615882695329","commenter_b":"Seriously. That woman should have said no or let's go home first. She's just as guilty! Time served smh. Bs","commenter_a":"And why is no one hating on the woman for this? MENISTS","post_message":"A Florida man was sentenced Monday to two and a half years in prison for having sex on a beach in front of other beachgoers, including children."},{"comment_id":"10154760040172293","commenter_b":"Shes an indenity thief. I think Alyssa was referring to actual criminals","commenter_a":"Hopefully every single one who has blatantly broken Federal laws and made a joke of our Justice system. They are all criminals by definition. Round them all up and return them to their homes in Mexico and Central America.","post_message":"This scenario is one that President Trump opponents imagined becoming far more common were he elected."},{"comment_id":"1746275522311169","commenter_b":"Larry, I didn't say \"fire a weapon,\" I said \"purchase and carry a firearm\" Should a gun shop sell a firearm to an 11 year old?","commenter_a":"Back then it was muskets against muskets. Now we have semi autos and the government has fully autos. Seems like we are already behind with the second amendment.","post_message":"#LiberalLogic"}]
