[{"comment_id":"843772605660081","commenter_b":"We no longer have a president. I impeached him for tyranny & not protecting Americans & for not following our constitution. Since we have no leader, no harm fine, no foul. Hearing whst a great leader has to say like Mr N is hood hoe America","commenter_a":"Good he's not good enough to walk in Bibis shadow !","post_message":"Socialist Senator Bernie Sanders: \"The idea that the president wasn’t even consulted… that is wrong and not a good thing for our country.”"},{"comment_id":"1372039169498167","commenter_b":"Illegal aliens out of my health care","commenter_a":"Politics is what got you your \"free\" healthcare. We the people are tired of being forced to pay for it, So please feel free to sit down and STFU.","post_message":"HERE IT IS!"},{"comment_id":"10153587762999087","commenter_b":"She's above the law.","commenter_a":"Bloody Hell , Hillar-ious Hellary should have been an evil stand up comedian..","post_message":"Hillary Clinton on dropping out of the race if indicted: \"Oh for goodness, that is not going to happen. I'm not even answering that question.\" #DemDebate"},{"comment_id":"711877645667193","commenter_b":"LETS PRAY TRUMP OUT OF OFFICE! !","commenter_a":"True","post_message":"Together, we will MAKE AMERICA GREAT AGAIN! SHARE = God Bless Rev. Graham !"},{"comment_id":"1080503548665334","commenter_b":"Fry that evil cow!","commenter_a":"Liar liar North Korean Pants suit is on FIRE!!!!","post_message":"“Stunning”"},{"comment_id":"10152822135907434","commenter_b":"You are no gentleman.","commenter_a":"Sure, dude.","post_message":"\"It’s not just about me. It’s about all of us accepting one another.”"},{"comment_id":"10152705258007144","commenter_b":"How can we believe anything he says after lying so many times??..and they said Obama lies!!!! And I am one of the 47%!","commenter_a":"Dipshit: Same path doesn't equal new outcome","post_message":"Mitt Romney is quickly rebuilding his campaign network for an \"almost certain\" run."}]
