[{"comment_id":"10152996938497293","commenter_b":"Sorry you can't understand science. Maybe you should go back to high school.","commenter_a":"So the WaPo says evolution is fact, even though it's theory that can't be demonstrated? Bias is a wonderful thing.","post_message":"This can go down as one of the best examples ever of why it's downright impossible to convince someone who's \"opposed\" to evolution that it's a basic fact."},{"comment_id":"1141996625817686","commenter_b":"Just jealious she can kick your butt","commenter_a":"The. \" Token Brunette \" on Fair and Balanced \" comedy show !","post_message":""},{"comment_id":"1642423912674968","commenter_b":"@username health INSURANCE is NOT health CARE","commenter_a":"Wait....hold on a second. Usually stories like this are about people fighting to keep someone alive who wants to die. This time, this poor guy wants to live and the hospital wants to take his life, while he is coherent and of sound mind? I didn't read the story, but I would bet this is all because of $$$ or medical insurance!","post_message":"Heartbreaking video shows Chris Dunn nodding and putting his hands together in prayer when asked if he wants to live."},{"comment_id":"10154144312645861","commenter_b":"I'm sure they don't assume Christians drink wine and eat tiny pieces of bread for attention, nor insult their robes or any other attire calling it dress up. OR stand up and interrupt their prayers/services when they disagree with it! Freedom of religion, and simple respect...ever heard of it? I hope you don't expect anyone to respect your religion!","commenter_a":"He wanted attention, he wanted to upset people. Someone should tell him his dress is too big for him/her....but not to worry Halloween will be here soon enough, and he can go get a new costume to play dress up in.","post_message":"\"I saw community of people come together and take a stand for what was right.\""},{"comment_id":"10153306961394087","commenter_b":"Build that big beautiful wall!","commenter_a":"The Trump Haters are the biggest whiners and cry babies in America ! Say all you want ,Hate all you want !.. But you cannot stop the train from heading to the White House !.Donald J. Trump for President 2016 !","post_message":"\"I don't know if that's because she is incompetent, or she doesn't like me or maybe she's given instructions from up above,\" Donald J. Trump said about CNN reporter Sara Murray after accusing her of purposely not recording the large crowds outside Trump's book signing event in New York."},{"comment_id":"1171553619565468","commenter_b":"I can't even watch the View. Those women are bullies and *itches and make me want to slap them.","commenter_a":"Whoopie and Joy make me sick. They are so rude and disrespectful that I'm amazed they still have jobs.","post_message":"Whoopi and Her Liberal Hacks at 'The View' Tried to Bully Trumps Manager, But She Knocked Them The Hell OUT in Front of MILLIONS! (VIDEO)  Everyone's SICK of Hillary's scandals! Lets get 4000 SHARES if you are too!!!"},{"comment_id":"10153805945213908","commenter_b":"@username While I agree you should be happy with your body, I suggest that this woman is also happy. Some tall women are naturally thin thighed.","commenter_a":"again...give this skinny woman some food...why do all naked women have to be super skinny ???","post_message":"A very powerful message here."}]
