[{"comment_id":"10158034065045277","commenter_b":"No","commenter_a":"No","post_message":"Right-to-Work... Right for Missouri? We want to know your opinions, so tell us!"},{"comment_id":"766779530124121","commenter_b":"Vile woman","commenter_a":"LUCIFER CAN just go Home--The party is over--GOD BLESS AMERICA","post_message":"Thank you Indianapolis for the welcome. #ChooseCruz tomorrow: @webpagelink"},{"comment_id":"10154923446001337","commenter_b":"No I didn't miss the point Sorry somebody got killed but I live in a town that that happens every day every single day. I'm so used to it that I'm tired of hearing about it. The human species will keep killing each other forever and there's nothing nobody can do about it so why I get pissy.","commenter_a":"So fucking what. There are bigger things in this world to worry about.. it's a fucking word. Nothing else","post_message":"YIKES. The Joe McKnight case took another strange turn..."},{"comment_id":"10153527468435399","commenter_b":"Now,that's got to be a bunch of crock,they don't even know that hag.","commenter_a":"Why is a rally in Peru for a clerk in Kentucky hard to fathom? Does Rob Schneider work for this firm?","post_message":"According to a report by ThinkProgress, the rally never actually happened."},{"comment_id":"10153740832391800","commenter_b":"Chris, honey, being a salty bitch isn't going to solve the problem.","commenter_a":"Islamic Extremists: Kills people that don't share their beliefs, Christian Extremist: Kills people that don't share their beliefs! I say, we should worry about these pro-life extremist before we worry about extremists on the otherside of the earth!","post_message":"In the wake of a shooting at a Colorado Planned Parenthood, the media questions whether or not it was an act of domestic terrorism.  ►Watch last night’s full episode now: @webpagelink"},{"comment_id":"10153157305281636","commenter_b":"very wicked woman ! she deserve it.","commenter_a":"The states where the capital punishment extists are muderers on the level of the nation.","post_message":"Even Pope Francis made a last-minute appeal for clemency"},{"comment_id":"10154568418189062","commenter_b":"Your right...Then she may get out and have more kids","commenter_a":"You kill your kids and get 6 years.. Serve 2 maybe 3 and then go on with your life.. Sad","post_message":"JUST IN: Barbara Russo has pleaded guilty in the drowning deaths of her 14-month-old twin daughters. The mother entered pleas of guilty to two counts of criminally negligent homicide. She was sentenced to six years in prison. More: @webpagelink"}]
