[{"comment_id":"769355346496407","commenter_b":"I am on Pam side screw the rest of them assholes.","commenter_a":"Bullshit she clearly antagonized this lame ass broad","post_message":"She believes she saved lives by hosting the contest."},{"comment_id":"1838073153099439","commenter_b":"Well, she's certainly dum enough for the part!","commenter_a":"But she looks like Hulk Hogan","post_message":"Amy Schumer has been cast to play a blonde doll with impossibly perfect physical proportions...."},{"comment_id":"1350622528302641","commenter_b":"Lady you're an idiot","commenter_a":"Nobody cares","post_message":"Islamic leaders respond to OSU attack today."},{"comment_id":"800883556714802","commenter_b":"Rheemyck Contreras","commenter_a":"Lexx Kennedy can we get one","post_message":"WATCH: Black panther creeps up on a man not paying attention? Wait for it... wait for it..."},{"comment_id":"10154462240499087","commenter_b":"No, former president Bush didn't listen to the Intelligence Community and he didn't wait for their final report: he ordered them to leave to start his war!!","commenter_a":"It seems funny to me that all you Democrats were screaming with President Bush took the intelligence community advice on \"weapons of mass destruction\"! How quickly we change our minds....but now we are to trust the intelligence community?","post_message":"\"Lesson #1: don’t mess with the intelligence community.\""},{"comment_id":"657878574399677","commenter_b":"Shame should be heaped on this persons head. Open your mouth and sing HIS praises..not for Trump but to glorify His name. Shame on you lady!! :-(","commenter_a":"The member states that \"she could never throw roses to Hitler\" code for she supported Stalin 😉 she's irrelevant...","post_message":"More pre-inauguration insult and upset from progressives — 'I could never sing for him.'"},{"comment_id":"10153400594587994","commenter_b":"those that wanna look like a female do!","commenter_a":"Just put a weave on it everybody else does....","post_message":"We've all had them -- but this bad hair cut even brought the hairdresser to tears."}]
