[{"comment_id":"1021313581261452","commenter_b":"Nasty bitch","commenter_a":"I hate to admit it but Fiorina is right, maybe the first time in her life, but........","post_message":"Haha, it's true though"},{"comment_id":"10153762472156337","commenter_b":"Id smash her tuppence!!!","commenter_a":"Whatev","post_message":"HOW MUCH???"},{"comment_id":"10153395061888690","commenter_b":"Saudi is bad for woman, Iran is worst. Pakistan is the best Muslim country for Muslim woman.","commenter_a":"Iranian cancerous mullah regime needs to be removed surgically.they are biggest violators of human rights.","post_message":"Prominent Iranian activist \"forcibly arrested\" by security forces in Tehran @webpagelink"},{"comment_id":"796247023857405","commenter_b":"Her mouth is perfectly formed for Donny DOUCHEBAG ...","commenter_a":"DISGUSTING human being !!","post_message":"This woman is a disgusting POS!"},{"comment_id":"1263988416963489","commenter_b":"@username yes it means no crime was committed. It means she's innocent of any wrongdoing. This is America.","commenter_a":"Did they fit her for her orange jumpsuit yet? A woman in the White House is just a novelty. Wake up America! She is a criminal!!","post_message":"“The other day, Mr. Trump accused me of playing the ‘woman card’…”  WATCH: During her victory speech tonight, Hillary Clinton turned her attention to Donald J. Trump and Republican talking points."},{"comment_id":"1103463889708572","commenter_b":"@username, it's not a C-Section if the spine is snipped. That's not a C-Section, that's partial birth abortion, aka infanticide.","commenter_a":"Hillary has stated that unborn children have no rights and that they can be aborted within hours of birth. Yet, when someone kills a pregnant woman, there are TWO charges of murder. Hmmmm....","post_message":"Trump said the procedure can happen \"as late as one or two or three or four days prior to birth.\" But that is not at all likely, writes NPR's Jennifer Ludden."},{"comment_id":"10153059782796770","commenter_b":"She's a lier","commenter_a":"She is a crook always has been!","post_message":"Hillary Clinton: “I have gone further than anybody that I’m aware of in American history … to try to be as transparent as possible”"}]
