[{"comment_id":"10153286970856167","commenter_b":"Help the refugees by free their homelands from the bad people the world support with weapon and money for other profit exchange !! They are running away from their own evil ... This evil was created by the collective separations of this planet God of profit America is the only place in the planet When soon or later the origin of the people is not matter any more .. This will hopefully be our new planet order","commenter_a":"In the 1930s we turned away thousands Jews due to xenophobia, many of them later died in camps. Are we going to repeat the same mistake now?","post_message":"Since the Paris attacks, there's been a lot of hate. Here are the top five best responses to all the bigotry. Watch:"},{"comment_id":"10154550859487464","commenter_b":"There are much better health coverage alternatives out there. Feel free to private message me for details.","commenter_a":"We tax payers all got fleeced big time.","post_message":"“The reality is the Affordable Care Act is no longer affordable for increasing numbers of people.”  #FullRepeal: @webpagelink"},{"comment_id":"1281953805157000","commenter_b":"Fuck Obama and his white trash skank bitch Hillary","commenter_a":"Our wonderful President, sorry to see you and your family go.","post_message":"President Obama has been known to break into song from time to time..."},{"comment_id":"10154028997088132","commenter_b":".. she is ugly","commenter_a":".. & soo - Kris Jenner is ugly","post_message":"Grandma Kris Jenner has arrived!"},{"comment_id":"1508345139225610","commenter_b":"His wife has his balls..","commenter_a":"SEE THIS IS THE SHIT THAT HAPPENS WHEN WE APPEASE TERRORIST SUPPORTING NATIONS JUST LIKE JMMA(THE PEANUT BRAIN) CARTER AND BILL(I DID NOT HAVE SEXUAL RELATIONS WITH THAT WOMEN) CLINTOOOON DID,, NOW OBAMA IS DOIN SAME THING BUT THIS TIME HE HAS LET THEM GO NUKE,,,THEY PLAY WITH US BECUAS ETHEY KNOW OBAMA DOESNT HAVE THE BALLS TO DO ANYTHING SAD","post_message":"JUST IN:"},{"comment_id":"543375892529200","commenter_b":"She wouldn't survive!","commenter_a":"She should go to Sinaloa, they've been purging for a couple of years now, plenty of Mexicans to choose from there","post_message":"\"I would kill as many Mexicans as I could in one night.\"  A waitress, who was apparently upset that a customer didn't leave a tip, has been fired after she tweeted a racist comment."},{"comment_id":"10153860038833812","commenter_b":"We can't erase history, if we could, blacks wouldn't be here ! We'd have gotten rid of them and shipped them back to Africa.","commenter_a":"Idiots!","post_message":"University of Mississippi quietly removes the state flag with its Confederate battle emblem from its place of honor on campus after students and faculty called it a divisive symbol that undermines efforts to promote diversity, tolerance and respect."}]
