[{"comment_id":"10153448214053984","commenter_b":"That lady has a problem nice in front of kids","commenter_a":"He was absolutely right in what he did. People like her should be called out. They have no respect for any rules, they think they don't apply to them.","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"1122007374532683","commenter_b":"She's in a bikini with something over it, not a big deal. Trumps wife on the other hand is butt ass naked and might be the next First Lady.","commenter_a":"Erik Björnfot","post_message":"#President #Obama's Daughter #MaliaObama twerks & shows her booty cheeks at #Lollapalooza! #WSHH"},{"comment_id":"10154344957028753","commenter_b":"@username so you are ok with building a wall by cutting programs like help Americas like are vets and retired or elderly and poor, like a childrens education, too what build a wall that will no nothing in the end 10 years from now when or if is done, I will not give my money for a wall I rather help Americas, the environment, help kids have a good education, and yes help those illegals trying too become citizen that cant afford too pay 5000 dollars too take a class to become a legal citizen,a wall will do nothing ,ask any Germany how the berlin wall worked for them, most European, middleeast and faeest ppl come tho Canada, Toronto airport is a major gate way too northamerica, why not a wall there, this as nothing too do with topps illegals it has too do with dons ego, he has too ...","commenter_a":"I'm okay with that. I would rather pay for a method to keep illegals out as much as possible, than to pay for their food, housing, health insurance, etc. and also feel the wrath of the homelessness because they invade my husbands profession.","post_message":""},{"comment_id":"10153150009791037","commenter_b":"They will bitchhh","commenter_a":"USA ... root cause of evry problem in world!!!","post_message":"#NorthKorea fired two short-range ballistic missiles into the sea and vowed \"merciless\" retaliation as the U.S. and South Korea kicked off joint military drills denounced by Pyongyang as recklessly confrontational."},{"comment_id":"1620111051603386","commenter_b":"She is the problem. She is not the solution.","commenter_a":"Why would ya go through all that trouble goin through background check to legally obtain firearms when you can buy plenty of illegal stolen or undocumented firearms anywhere at any time any type sky is the limit . People make a living doin this everywhere !GUN CONTROL IS A FAIRYTALE ! A JOKE ! WASTE OF TAXPAYER S $ so don't buy into Obummers. And Hillary BS ! Think for yourself folks those talking heads are also very empty.","post_message":"“You shouldn’t be able to exploit loopholes and evade criminal background checks by buying online or at a gun show…We have to make it harder for people who should not have those weapons of war.”  – Hillary Clinton reacts to the #OrlandoShooting @webpagelink"},{"comment_id":"1589904131315822","commenter_b":"That's the stupidest reason I heard from a grown ass stupid woman/mother","commenter_a":"My choice was Bernie Sanders, but now I have to vote for Hillary Clinton because I 'm a navy mom and I don't want my son to be under the regulation of Donald trump, he said that he likes war.","post_message":"Oprah BEGS America: You don't have to LIKE Hillary, but you MUST vote for her!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1364153086957478","commenter_b":"Let's hope NOT. NO MORE COMMON CORE! NO ON ROMNEY! KEEP your PROMISES!","commenter_a":"I agree.","post_message":"I wonder if Conway is behind the \"new\" Trump?  The whole \"lets leave Hillary alone\"... and \"lets talk to Mitt about being Sec of State\"... and \"lets hire a pro-common core Sec of Ed.\".....  It's getting harder to stay smiley faced.  We can only be pushed so far.  Enough of Mitt.  Dump him.  Give Rudy G. the job of Sec of State TOMORROW. Not only is he talented, but show some loyalty to the guy who stuck his neck out.  Stop making the man sweat it out, and start supporting the platform we voted for.  Walk the walk already.  @webpagelink"}]
