[{"comment_id":"944373212266686","commenter_b":"Planned Parenthoods primary function is abortion. Enough said. Defund it.","commenter_a":"Only 3% of Planned Parenthood's funding goes to providing abortion. None of that money comes from taxpayers. Defunding Planned Parenthood means defunding millions of dollars in preventive care, cancer screening, contraception (which reduces abortion), STI screening, and other such essential services. I'm pro-choice, but if you guys have such a problem with abortion, why don't you just campaign to force Planned Parenthood to stop providing abortion services and leave everything else intact?","post_message":"Wow."},{"comment_id":"10152871964481491","commenter_b":"Says the woman whose profile pic looks as if she is in drag!!!! You should never talk about anyone's looks!!!","commenter_a":"Quit posting this, she isn't even a woman, so stop it","post_message":"“You’re too young for a 51-year-old!”"},{"comment_id":"991326630995465","commenter_b":"I will never refer to you as a woman, just a bitch!","commenter_a":"I will never refer to him as President, just trump, no capital t","post_message":"From placing sworn white supremacists in key cabinet positions to sucking up to Vladimir Putin, Trump's actions speak for themselves... he is a clear and present danger to the survival of our country."},{"comment_id":"1788331291434935","commenter_b":"She is a nasty woman","commenter_a":"If those liberals ever lost their middle fingers they'd never be able to drive in Oklahoma.","post_message":"Leftist Amy Schumer battling charges of racism..."},{"comment_id":"10153879434881337","commenter_b":"and fuck u bitch","commenter_a":"FUCK OBAMA!!!!!!!","post_message":"PRESIDENTIAL APPROVAL: Kendrick Lamar keeps it short and sweet with his reaction to Barack Obama's \"song of the year\" praise..."},{"comment_id":"10153362630049641","commenter_b":"Whatever tickles your fancy. Hope you get a free lifetime of ky jelly .","commenter_a":"This country is going to hell in a hand basket.","post_message":"The White House takes on rainbow hues to celebrate the Supreme Court's marriage equality decision: @webpagelink"},{"comment_id":"10152535254222623","commenter_b":"It'd be great if people actually read, studied and paid attention in school and did something with their lives except screwing, rolling blunts, and figuring out ways to commit crimes.","commenter_a":"Look at the parents. Poor child","post_message":"A mother and father have been charged after police found video of a baby playing with a real handgun."}]
