[{"comment_id":"10153187905664087","commenter_b":"If posting in the comment section of a facebook page is being \"involved in politics\" then we really are in trouble.","commenter_a":"For better reasons why we should have retention elections of these SCOTUS. Congress can't be trusted to impeach these first year lawyers in black robes!!","post_message":"#BREAKING: Rowan County Clerk Kim Davis was released from federal custody today and ordered not to interfere \"in any way, directly or indirectly, with the efforts of her deputy clerks to issue marriage licenses to all legally eligible couples.\""},{"comment_id":"1136245463077540","commenter_b":"Amen","commenter_a":"I didn't vote for you the 1st. , or the 2nd. , time! Most all of us True Americans want you out. You, and your Obamanites have done nothing but take America to a all time low!!!","post_message":"YES!"},{"comment_id":"1150774161677077","commenter_b":"She needs to be unseated","commenter_a":"Trump will get rid of the Democrats and Republicans that have been in the Senate and Congress way too long and Barbara Boxer is one to go for sure. All of a sudden because Hillary lost the election now the Electoral votes have to go, maybe if you picked a candidate that wasn't crooked and a continual liar you might have had a better chance. Enough of the liberal bulls--t accept the loss and move on.","post_message":"This comes after Hillary Clinton won the popular vote, but lost the election."},{"comment_id":"10153246589888445","commenter_b":"I hope all these dumb fucks on her get arrested by the feds no one wants your dirty swag bitch","commenter_a":"Haha don't worry we got your back here in co haha oh and water","post_message":"NEW: California Wildfires Are Affecting the Pot Industry."},{"comment_id":"10153618174361051","commenter_b":"America will pay. Cheaper to build wall than to keep paying for the illegals.","commenter_a":"There will only be a wall if the Donald pays for it,because Mexico says they will NOT pay for any wall!","post_message":"Donald Trump reiterated this week: If he becomes president, he's building a wall at the border. Would you be for or against the wall?"},{"comment_id":"606850699417060","commenter_b":"What a pussy","commenter_a":"Remember these Libatards,I never forget !","post_message":"List Of 31 Democrats Who Will Be Giving Netanyahu The Middle Finger, SKIPPING His Speech ⋆ UFP NEWS... @webpagelink"},{"comment_id":"1110454952404615","commenter_b":"She is nasty and mean.","commenter_a":"Yes she has","post_message":"MULTIPLE CHOICE QUIZ time, kiddies! Which answer did YOU choose? A or B? Enjoy and SHARE with 1M peeps! @webpagelink"}]
