[{"comment_id":"1187550147931680","commenter_b":"It is her job totally, but let's be fair, her job duties changed abruptly in June after SCOTUS ruled. That said, she should resign if she can't/won't carry out her duties and leave her religion out of the office. She can be as devout as she wants, but not on the taxpayer's dime. Those couples are paying her salary and deserve better","commenter_a":"If she don't want to issue gay marriage licenses she shouldn't have to...","post_message":"JUST IN: Kentucky clerk who refused marriage licenses for gay couples taken into custody @webpagelink"},{"comment_id":"556763161150305","commenter_b":"Steven...do you suck your dad off with that mouth?","commenter_a":"Oh, that's soooo terrible... You think the several thousand people he had killed didn't fear for lives? The ones who were shot, beheaded by chainsaws, scalped & skinned alive, and who had limbs broken and cut off? Extradite Chapo, throw him in ADX Florence for the rest of his life, and admit this bimbo to a psych ward.","post_message":"Emma Coronel: \"I'll follow him wherever because I am in love with him.\""},{"comment_id":"1370428343050216","commenter_b":"Keep this animal in jail","commenter_a":"These two idiots actually represent the sick mentality of the republican party. They are both sick and depraved. What I really find interesting is how much american men admire that behavior and vote for them. They seem to have a lot in common with these two.","post_message":"SPREAD HIS SHAME."},{"comment_id":"1269958509763867","commenter_b":"And they're all dumb white girls 😂","commenter_a":"Great President!","post_message":"This is why we are going to miss him."},{"comment_id":"10153265757247061","commenter_b":"No, he was too busy lighting our disgraced white house Christmas tree.","commenter_a":"If you have no interest in hearing President Obama, why comment? I'm sure he's not reading your negative comments. He's much too busy and has other more important things to focus on, unlike you, who clearly have too much time on your hands!","post_message":"BREAKING: President Barack Obama to address the nation from the Oval Office on Sunday night at 8pm ET, White House says. @webpagelink"},{"comment_id":"968873019828099","commenter_b":"Some dumb uuuugly woman","commenter_a":"Who is Kim Kardashian and why must I look at this?","post_message":"#KimKardashian felt #liberated, Bette Midler didn't!"},{"comment_id":"1747275395512005","commenter_b":"@username if it isn't Mr. Trump YOU will be voting in Hillary","commenter_a":"The only thing that needs to change is HIM OUT OF THE WHITE HOUSE.","post_message":"Obama says \"we\" need to pray for the \"strength to change.\" It's yet another of his disgusting refusals to acknowledge the realities we face."}]
