[{"comment_id":"571151523088148","commenter_b":"Woopi is possessed. She can't help it.","commenter_a":"This is the woman who tried to lower the RAPE benchmark by stating in defense of an acused rapist that it wasnt \" RAPE rape.\" I heard her with my own ears.","post_message":"Did Whoopi just blame women for having affairs with Bill Clinton?  Watch the clip."},{"comment_id":"10153572356905329","commenter_b":"Yeah Cheryl. You stupid bitch.","commenter_a":"Not very honest of you @username - you have deliberately failed to mention the marginalization & persecution of christians & other groups who morally oppose same sex marriage, & the hardship & tyranny they now endure. You have also quite 'conveniently' chosen to ignore the increasing body of evidence that is emerging of the sense of loss, disadvantage & suffering, those raised in same sex relationships, & who have now reached adulthood, have & are experiencing - nor the vilification & persecution they can face for daring to speak out....","post_message":"Eighteen other countries have legalized same-sex marriage before America. Let's see how some of them are holding up."},{"comment_id":"10155461378486509","commenter_b":"trump Come clean , admit your a Rapist and we will feel sorry for you and vote for Hillary ,","commenter_a":"I'd love to see Trump supporters try to deny he said the things he was filmed saying.","post_message":"Watch Anderson Cooper repeatedly ask Donald J. Trump about sexual assault at the last debate. @webpagelink"},{"comment_id":"1260466927330937","commenter_b":"@username agreed! She's a fecking CRIMINAL... PERIOD!","commenter_a":"Watergate would be jaywalking compared to the Clinton scandals","post_message":"Rudy Giuliani claims the Clinton Foundation scandal will be \"bigger than Watergate.\" Do you think there is truth to what he is saying?"},{"comment_id":"1313767168664034","commenter_b":"Just a bunch of self absorbed leftist lesbians.","commenter_a":"Just say there prayin see what happens","post_message":"Wait...so the WNBA is still a thing??"},{"comment_id":"10152981477461717","commenter_b":"Sissy bitch is not a word used to just discriminate against gays. Sheesh. Stop trying to be a victim.","commenter_a":"Donald Trump for president! Fuck that sissy bitch Anderson.","post_message":""},{"comment_id":"10153638768074062","commenter_b":"And take your bimbo wife with you!","commenter_a":"Kanye, please listen to the voices in your head and leave the country!","post_message":"Kanye West opens up about rushing the stage during Beck's acceptance speech at the Grammys.   He says the voices in his head told him to do it.  He's also now calling Beck one of the nicest and most respected people in the industry.  Check out what else Kanye had to say and let us know... Is this really just too little, too late? @webpagelink"}]
