[{"comment_id":"797236390409541","commenter_b":"Stfu no one wants to hear your mouth.","commenter_a":"Donald Trump is a BIG Government Authoritarian and progressive fraud from New York City He's NEVER been a conservative, and he NEVER will be conservative -- he's an actor, a phony, pretending to be what he's not.","post_message":"I'm getting really tired of this."},{"comment_id":"420321631489464","commenter_b":"how about someone do a drive by on these losers, it would do the world a great deed.","commenter_a":"Non existent","post_message":"Can you Imagine the Media Coverage if These Guys Were White?"},{"comment_id":"1007291799323583","commenter_b":"Social Media: What a bunch of freakin half wits. I wish we could send them all out on a barge in the middle of the ocean sink the barge and see how many swim back. Social media morons the world would be a better place if we took your cell phones away until you learn what they are supposed to be used for. One irresponsible person does not make everyone irresponsible. Wake up! This is exactly what Obama wants, take our guns so he can declare the U.S. a dictatorship and he would be the dictator!","commenter_a":"no","post_message":"Here we go..."},{"comment_id":"826467044152094","commenter_b":"Is Hillery totally without fault? Let's look over her speeches. Hillery would say \"WHAT DIFFERENCE DOES IT MAKE!\"","commenter_a":"Give it up Matt . Hey Matt how about Hillary apologize to the American people for all the lies she told and those four dead Americans she left to die in Benghazi 😡","post_message":"NBC's Matt Lauer is still OBSESSED with Melania Trump's speech. #RNCINCLE"},{"comment_id":"10155570976260603","commenter_b":"A woman of her word. Bet that room is clean.","commenter_a":"Crazy old bat.","post_message":"She told her grandchildren that if they didn't clean their rooms, they would lose their pets. The family cat was later found in the freezer.   Robin Smith KMOV is in Madison County finding out more on this animal cruelty case and the possible punishment she could be facing on News 4 at 5:00."},{"comment_id":"10152746929711167","commenter_b":"Name a lie, Grace? You've apparently chosen to forget the lie about \"sharia no-go zones in France!!!!\" that Fox had to retract. Of course you forgot it--you wipe your brain before turning on Fox News, don't you?","commenter_a":"You've got to love the weasel attempt by the corporate media to create a special category of \"non-journalism journalism\" for Fox News and Bill O'Reilly, whereby they get to brag about being \"Fair and Balanced No-Spin Zone\" news reporters and join the White House press corps, but get a free pass to lie to their audience.","post_message":"Normally, you can't get this many Americans to agree what color the sky is."},{"comment_id":"1052974981463934","commenter_b":"Where is our government's back bone they should have someone down there telling them that we have our own laws. Instead they act they have a yellow streak down their backs this is the USA if they don't like it leave","commenter_a":"Go back to your shit hole in the sand\"","post_message":"Muslims OUTRAGED After Texas Major After She Bans Shariah Court... [VIDEO]  She's taking heat.  Do you support this Texas mayor?"}]
