[{"comment_id":"452480794942501","commenter_b":"She's still a bitch! Stfu bitch!","commenter_a":"Fu:-)k her!","post_message":"Should We Ban This Word To Please Michelle?  Comment 'yes' or 'no'."},{"comment_id":"1130843966969767","commenter_b":"Good keep them there and deport them","commenter_a":"Like packs of hyneas.","post_message":"UNREAL! SOMALI MUSLIMS RAMPAGE Through Mall Of America In Minnesota...10 Arrested [Video]"},{"comment_id":"712674415565701","commenter_b":"Fuck off you nasty hoes.","commenter_a":"Her tale is just the beginning...there's getting ready to be an avalanche of women coming forward...","post_message":"\"His hands were all over me. It was an assault.\" Here, Jessica Leeds of New York tells how a three decades ago Trump raised the armrest separating their seats on a plane and reached up her skirt.  Video by Occupy Democrats, LIKE our page for more. Credit: New York Times."},{"comment_id":"10153072204470329","commenter_b":"Girl I'm trying to kick it with u","commenter_a":"Leida Maria1020806391970270610210023845541574Alicia Jo","post_message":"We all have that one co-worker who is obsessed with Beyoncé...  via BuzzFeed BFF: @webpagelink"},{"comment_id":"524146164440320","commenter_b":"Pos","commenter_a":"Why was he even there!!!! Ugh","post_message":"I don't even know what to say."},{"comment_id":"1797347700498169","commenter_b":"If a cop ask you multiple times to put your hands where I can see them you do it!","commenter_a":"How you raise a black son in America? Tell them not to break the law and do what a cop is telling you to do. That's how","post_message":"It's an important question, without easy answers."},{"comment_id":"364315750438606","commenter_b":"Orrrrrrrrrrrrrrrr, build a big wall around it and let in any idiot who wants to live like an animal.","commenter_a":"Solution for Baltimore. Dismantle the police department and incorporate law enforcement into the Department of Social Services. Terminate all police officers. Fund the law inforcement portion of social services with Federal dollars. Social Services pay gang members $100,000 plus benefits and pension to each gang member, no identification or proof of residence required. Pay each adult $500,000 for new housing or relocation. No identification or proof of residence required. No follow up for use of housing fund. Encourage business owners to allow no cost to their merchandise (free) .","post_message":"Democrat Candidate for Senate in Maryland Blames Republican Governor for Baltimore Education Problems"}]
