[{"comment_id":"1759075771038433","commenter_b":"@username...No evidence??? HOW ABOUT 4 DEAD AMERICANS.... HOW ABOUT ERASING YOUR EMAIL TO HIDE IT, WHEN ASKED...HOW ABOUT MISHANDLING TOP SECRET INTELLIGENCE... THAT'S ALL BEEN PROVEN. .. YOU CAN'T PICK AND CHOOSE....YOU CAN LEAD A HORSE TO WATER, THEN HOLD HIS DAMN HEAD UNDER, UNTIL IT QUITS KICKING...THAT'S WHAT IT TAKES, WITH PEOPLE LIKE YOU, IT SEEMS.","commenter_a":"So would we all. As a matter of fact, orange jump suits would look good on all Socialist-Democrats.","post_message":"“Hillary, I’m waiting for what you promised me. All I heard was you getting on TV, calling me a liar. That’s not true, Hillary. I am not the liar. You are the liar.”"},{"comment_id":"863625973741296","commenter_b":"Absolutely. ...praying for him and his family","commenter_a":"Allready did","post_message":"Kentucky Police Officer Shot Down In Cold Blood, Killer Still On The Loose The media is silent, no Al Sharpton, no Obama, nothing. Will you pray for him and his family?"},{"comment_id":"1224908530916491","commenter_b":"Kaboom, Kaboom no more Illegal Protesters' .","commenter_a":"Abba Father, we thank You Lord for Your anointed and pray for Your strength for the road ahead to exact Your purpose for such a time as this to UNITE AMERICA, ISRAEL'S DEFENDER, UNDER THE ONE TRUE GOD FOR THE GLORY OF YOUR NAME! In Jesus Name, Amen!","post_message":"The group of seven men and three women stood across the inbound lanes holding banners reading #SomosVisible, or #WeAreVisible, and another reading \"Resist, Organize, Rise Up.\""},{"comment_id":"10154844264313132","commenter_b":"Sorry katie but i think you are confused between who hillary is and who trump is cuz clearly he was the one interupting her on soo many questions and tring to intimidate her just like he does every other woman but thank goodness she is a strong woman and did not let him get to her lol","commenter_a":"Wow this just goes to prove that hillary is the better candidate hands down. She definately killed trump and i think he got angry and became soo defensive lol she was very prepared and he was not","post_message":"Donald J. Trump says he will release his tax returns when Hillary Clinton releases her deleted emails. @webpagelink"},{"comment_id":"474611692726438","commenter_b":"Dear god. If I were Trump, and that batshit crazy woman decided to endorse me, I would bow out gracefully. Tail between my legs. Holy cow. She is a kook.","commenter_a":"How was she ever elected Governor!!!!!!!","post_message":"Sarah Palin endorsed Donald Trump on Tuesday. The result can only be described as Palinesque."},{"comment_id":"10157050589675206","commenter_b":"Ok girl","commenter_a":"Nuts!","post_message":"“We are lucky that we have this son who loves Prophet Muhammad that much.”"},{"comment_id":"10152900481316336","commenter_b":"Racist bitch^^^","commenter_a":"She must be a Muslim....no sensativity to killing her own new born?","post_message":"A New Jersey woman who authorities say put her newborn baby in the middle of a road and set the child on fire was charged with murder."}]
