[{"comment_id":"1154513944599658","commenter_b":"Open primaries work just fine Terrence.","commenter_a":"Yea- Bernie baby! This was a closed primary and they are near a tie!!!!! Can you imagine if they \"allowed\" everyone to vote?!!!!! #therevolutionishere","post_message":"UPDATE: Sanders wins the Oregon primary, while Clinton appears likely to eke out a narrow win in Kentucky. Sanders' cut into Clinton's 270+ pledged-delegate lead likely will be single-digits."},{"comment_id":"1144395032262257","commenter_b":"there you go with that section 8 typing again, you must have failed computer class terribly lmao","commenter_a":"All people Trippn over a nigga who didn't stand for the pledge of allegience. And y'all got Nazi's on the mo fucking police force. OPEN y'all damn eyes","post_message":"And the police union says it's no big deal 😠😠"},{"comment_id":"479436158913631","commenter_b":"She is a POS that has never done anything but take all she can get. She's an entitlement ho that plays the race card to get her way.","commenter_a":"VETERANS I'VE GOT NO RESPECT FOR THIS WOMAN WHAT SO EVER.","post_message":"Michelle Obama just made an outrageous claim...  Our soldiers fight and die for our country, Michelle takes lavish vacations.  Do you respect our veterans over Michelle?"},{"comment_id":"571151523088148","commenter_b":"Woopi is possessed. She can't help it.","commenter_a":"This is the woman who tried to lower the RAPE benchmark by stating in defense of an acused rapist that it wasnt \" RAPE rape.\" I heard her with my own ears.","post_message":"Did Whoopi just blame women for having affairs with Bill Clinton?  Watch the clip."},{"comment_id":"10153778405133854","commenter_b":"Who cares what she told her daughter","commenter_a":"She is above the Law, Richard Nixon looks like a choir boy \" truth has no meany, Anymore\"","post_message":"Hillary Told Daughter Chelsea That Terrorists Were Behind Benghazi Attack The Night It Happened [VIDEO]"},{"comment_id":"10153148435072098","commenter_b":"Wrong person died","commenter_a":"Guess his high heels got stuck on the gas pedal haha 😂","post_message":"BREAKING..."},{"comment_id":"460068644183716","commenter_b":"Illegals breed for welfare-their U.S. born-anchor babies support them!!!","commenter_a":"how did they get them to start with.","post_message":"Should All Illegals Collecting Welfare Be Deported?  Comment 'yes' or 'no'."}]
