[{"comment_id":"10154101943008984","commenter_b":"@username , Why do you people who support only Trump find it necessary To call people names simply because they don't agree with you? Are you that insecure?","commenter_a":"Now do not get me wrong! I am for Trump 100%, think he'll be awesome BUT leave George W. Bush out of it! Take it out on Jeb because he deserves it but I don't think George does, at all!","post_message":"Donald J. Trump railed against George W. Bush for 9/11 at the last GOP debate. It got messy, and now \"W\" has responded like only he could..."},{"comment_id":"1116402168438318","commenter_b":"Darren VM They don't want the imbecile either, probably why he ran here! LOL","commenter_a":"I don't understand how this humiliates Obama. I don't understand why Michelle is included in this. I don't understand why any sane American will be for humiliation of an American President regardless of agreement on issues.","post_message":"Obama may think he's Europe's favorite politician, but Queen Elizabeth just made a stunning announcement that put Obama right in his place.  You know Michelle was furious when she heard about this."},{"comment_id":"10154506279023812","commenter_b":"Lana Mushamel Rico","commenter_a":"Rip Rico!","post_message":"Marine combat dog that served two tours in Afghanistan and went on 240 missions is laid to rest. RIP Rico."},{"comment_id":"787208168094254","commenter_b":"That woman's a little unhinged!","commenter_a":"You are a has been. Good luck in finding work. You might need President Trumps help in finding a job.","post_message":"Classy!"},{"comment_id":"10153253284026756","commenter_b":"i like to read porn not watch it as much","commenter_a":"Meanwhile, people are praising a movie about a creepy, abusive man who likes to manipulate women into believing they want to be treated like emotional and sexual slaves.","post_message":"In which the vice president manages to invade all of our personal spaces, simultaneously."},{"comment_id":"10153884962054228","commenter_b":"They need to die","commenter_a":"They should be beat to death","post_message":"The child was locked in a room, bound with duct tape over his eyes, beaten with belts and a hammer.  That is not the worst part."},{"comment_id":"10152926251994071","commenter_b":"Their porn is awesome. Fully filled girls, unlike the skinny twigs the US has to offer.","commenter_a":"Small wonder. Have you ever seen their porn? Horrifying.","post_message":"It's a \"time bomb.\""}]
