[{"comment_id":"992259924200395","commenter_b":"I do not believe recreational marijuana should be legalized. Medicinal marijuana, yes. But there are enough zombies wandering our streets and driving our roads already, we do not need a bunch of stoners driving.","commenter_a":"It's about time, the stigma needs to go.","post_message":"Finally! It's time to stop throwing kids in prison over a little pot."},{"comment_id":"1076789345700753","commenter_b":"Put a bullet in his face. Is she was my daughter or sister, that's exactly what would happen","commenter_a":"ugly pig!!!!!!","post_message":"HATE CRIME! Swept under the rug because she's white and they were black lives matter thugs.  ARE YOU SICK OF THE DOUBLE STANDARD?"},{"comment_id":"1202757773119671","commenter_b":"Yes Ivanka Trump would not be anywhere without her rich daddy!","commenter_a":"If it was not for her family name no one would listen to a word this really stupid spoiled brat has to say. You actually have to do something or have accomplished something to be a voice worth listening to and this twit as done nothing. Additionally hanging around with a child molester like Dunham shows just how pathetic she is.","post_message":"Chelsea Clinton tried to shame Ivanka Trump on live TV, but it immediately blew up in her FACE! This proves that Hillary Clinton has NO CHANCE!   Let's get 3,000 SHARES to show that we don't need a Clinton anywhere near a position of power!"},{"comment_id":"10154338817664411","commenter_b":"Arabic jews were never persecuted. This crap comes from your corrupted zionist controlled medias. Actually the white European jews were always persecuted by europea christians and Hitler etc. Can't you see the difference between a white European non-semitic jew with blonde hairs and blue eyes and a semitic middle eastern jew? Obviously you can't. You're a trash.","commenter_a":"There are calls by scientists and engineers, presidents etc etc etc etc etc to re - open the 911 case for new investigation. Suddenly the Saudi propaganda is out just at a time when the world is waking up to the 911 israeli zionist connection. Truth will prevail 😂","post_message":"Man wants to buy a plane & an abandoned building to 'prove it once and for all: Was 9/11 a hoax or was it real?'"},{"comment_id":"659550864214259","commenter_b":"#lastword","commenter_a":"@username @username This is so true!","post_message":"How true is this?  Thanks to www.republicandirtytricks.com"},{"comment_id":"10152982491580927","commenter_b":"She is only interested in Pelosi.","commenter_a":"She wouldn't know, hers never started","post_message":"Pelosi:  think I know more about this subject than you, with all due respect."},{"comment_id":"1333179716775079","commenter_b":"Um isn't that the parents job? How is this not just instantly obvious?...","commenter_a":"Pssst......they only care about the fetus until the second it is born. When it is a child they lose all interest. They don't feed, clothe, vaccinate, educate, protect, nurture, house, inspire, enrich or love it.","post_message":""}]
