[{"comment_id":"1093117534044369","commenter_b":"He should be slut shamed with a fire ant bath!!","commenter_a":"The term \"slut shame\" is fucking ridiculous in and of itself, but saying that the judge was \"slut shaming\" a rape victim is fucking horrendously disgusting. This judge should be suspended, and whoever made the title for this article should be fired.","post_message":"Holy sh*t."},{"comment_id":"10154146599832541","commenter_b":"Can we deport you? Bigots not needed in America.","commenter_a":"Aren't Obama's illegal immigrant aunt and uncle still here? They should be top priority for deportation.","post_message":"Joel LaPierre will have to keep his racist thoughts to himself from now on."},{"comment_id":"10153414475016167","commenter_b":"Damn uppity women with their words and assertiveness","commenter_a":"They should know we Chicago folks like a good shout out. Have they never been to a Cub, Bear or Hawks game? It is enthusiastic and honest.","post_message":"Add this to the list of things the media would never attack a male politician for:"},{"comment_id":"838459919590086","commenter_b":"Women who love Trump here.","commenter_a":"Montana here.","post_message":"LIVE NOW: Donald Trump expected to arrive at a \"Thank You Rally\" in Cincinnati, Ohio soon. It's the first of several stops for the President-Elect's thank you tour."},{"comment_id":"10157208654565294","commenter_b":"Preach!","commenter_a":"God I wish we could stop talking about this guy. Who cares he's a waste and obviously doesn't want to try and help himself in anyway. Glad he's at least not on the Browns any more.","post_message":"\"I hate to say it but I hope he goes to jail. I mean, that would be the best place for him.\""},{"comment_id":"10153888604683812","commenter_b":"Bye dumbass. Take the illegals with you, of ALL nationalities","commenter_a":"I respect our president and all past Presidents. I will respect all future Presidents. ( unless Donald Trump is elected, I will move to MEXICO AND HELP BUILD THE WALL!!!!!!)","post_message":"President Obama has joined Facebook! Here's what the President wrote in his very first post: @webpagelink"},{"comment_id":"1602106276760398","commenter_b":"Yeah well Thats all she does. Thats why she'll never be president.","commenter_a":"Donald J. Trump, Gary Johnson & Hillary Clinton's position on #StandingRock is clear: they ALL support Wall Street's attempts to rape & plunder the natural world (and us) to death. The ONLY candidate who TRULY supports clean energy & kids health is @username. #InvestYourVote #NoDAPL #SilenceIsConsent!","post_message":"My running mate, Ajamu Baraka, and I stood in September with #NoDAPL water protectors at Sacred Stone Camp in North Dakota, where the Dakota Access pipeline is being built in violation of a 19th-century U.S. treaty with the Standing Rock Sioux.  The desecration of sacred land and the 500-year violence against indigenous people must end if we are ever to see a just society that works for all of us, not just the 1 percent.  jill2016.com/standingwithstandingrock"}]
