[{"comment_id":"943670819034115","commenter_b":"lol..that is a joke...that skank aint pretty at all..not cause her skin color..its because shes ugly..Id rather hit precious","commenter_a":"She is the most racist, evil, conniving bitch to ever be in the white house! With her 22 \"assistants\"! And you know most of them are probably white so she can treat them like slaves!","post_message":"Americas Freedom Fighters"},{"comment_id":"917835871594729","commenter_b":"This is a very old photo of Hillary...she has become too old and out of date to be the Democratic President we need!","commenter_a":"Be nice if She would make up Her mind!","post_message":"Are you supporting Hillary 2016? Then go to DemStarter.com right now and show your support: @webpagelink  Hillary is in 3rd place in pledged support behind Elizabeth Warren and Bernie Sanders on DemStarter.com, but we're still just days into it.  Go to DemStarter.com, and show your support for Hillary, or for your favorite Democrat!"},{"comment_id":"10153631429237098","commenter_b":"Get your mind out of the gutter ladies.","commenter_a":"What a pig, No little girl's first introduction to sex should be with some slime like this.","post_message":"#BREAKING - The dental assistant was arrested over the weekend for allegedly molesting a sedated 8-year-old girl  Police say there may be more potential victims"},{"comment_id":"401125753409052","commenter_b":"Josh go live with the muzzies and obey THEIR laws in their land!!!","commenter_a":"It should be like that in America, too!","post_message":"\"I don't want to take off my Muslim Head Covering in Court\"..."},{"comment_id":"10154580142688132","commenter_b":"Me too! Those hot mamas work for those bodies!!","commenter_a":"I personally loved it","post_message":"Fergie is making a statement!"},{"comment_id":"10154133286695399","commenter_b":"Oh look it's a troll","commenter_a":"The republican party is an organized seditious criminal conspiracy. There is no reasonable basis for Ryan's actions.","post_message":"\"Briefings for the candidates will be provided on an even-handed non-partisan basis,\" James Clapper told Ryan."},{"comment_id":"1723610494573092","commenter_b":"Thanks a fucking lot to the woman who decided to skip her period and have this douche","commenter_a":" Marihuana is not physically addictive, but isn't pshycologically just as dangerous!?! Just because one bad and dangerous thing(alcohol) is legal - does not mean that legalizing another is a good idea!!!","post_message":"Alcohol is 114 times more deadly than marijuana.  Like ATTN: on Facebook."}]
