[{"comment_id":"10156071527715354","commenter_b":"@username... we are talking about illegal aliens. Not the Mexican race. You should set yourself on fire -","commenter_a":"then you go ahead Ricky and pay for all the welfare benefits, health insur, food stamps, free college tuition (Dream Act) for ALLLLL the illegals pouring into the country. Cause we cannot keep paying for all this under the radical liberal orders--the pot has run out--this is why we SCREAM and beg for a man like Donald J. Trump to stop all this madness.","post_message":"BEHOLD, America!   One of liberalism's finest minds--a political Zeus!--hath spoken!   #Livin’LaVidaLoca"},{"comment_id":"1029959687044503","commenter_b":"But we DONT need Hillary Clinton.","commenter_a":"If republicans don't come around on immigration they are through.","post_message":"Hillary Clinton's aggressive and boldly progressive stance on immigration just wiped the floor with Republicans and their obstruction and xenophobia. This is..."},{"comment_id":"10153936928466130","commenter_b":"Tell his ex wife that. She's the one plastering the photos to every tabloid she can find.","commenter_a":"This is so incredibly none of anyones business--","post_message":"Amber Heard claims she’s the victim of repeated incidences of domestic violence."},{"comment_id":"10153228353231336","commenter_b":"Hawraa is unaware of the meaning of the word AND. Grow up little girl.","commenter_a":"This is dead on right...but the morons and libs will be outraged!!! If you can't handle the truth","post_message":"“It is the behavior of individual human beings, not big daddy government that leads to success.” — Bill O'Reilly  WATCH Monday's Talking Points Memo and weigh in: @webpagelink"},{"comment_id":"1750200585039682","commenter_b":"Wear a condom then you stupid, despicable woman","commenter_a":"Couldn't just let her be adopted.........","post_message":"What a horrible woman"},{"comment_id":"10153025279926491","commenter_b":"What's the deal with communist people looking at all the post in this feed? Makes me wonder if they sent people like in Ukraine to start protest and eventually riots and killings. So far 5 have msg me and I've called their bluffs. Busted","commenter_a":"American Folks are in desperate need of a National Refresher course on the Civil War and American Reconstruction, so with that been said, let just stop framing the Confederate Battle Flag issue as a \"free speech\" issue and call it what it is, TREASON !!, and that's a fact jack","post_message":"Many still support the current flag."},{"comment_id":"609058575939393","commenter_b":"Not only is she a bigot but she is a lying murdering greedy bigot!!!!","commenter_a":"NO HIL LIAR EE!!!!!","post_message":"Join me in MISSISSIPPI for a few minutes! It is time to MAKE AMERICA SAFE AND GREAT AGAIN!"}]
