[{"comment_id":"10153943709566509","commenter_b":"Humans ruin everything they touch.","commenter_a":"why kill the bear!!!!!! humans were encroaching on it's territory! makes me ill","post_message":"Fatal human-bear encounters in Yellowstone National Park are rare, a spokeswoman said. @webpagelink"},{"comment_id":"1349866401695684","commenter_b":"Ember Kellough When the left wants to bring in millions of illegals and Syrian's it isn't from having a heart but instead to eventually expand their voter base, all about power and control with the left. When they do gain that we can kiss our Country goodbye or stand up and fight them in another civil war. When over 60% of births are coming from liberals it's difficult to not see it coming. The commie left will turn America into another Detroit and Baltimore.","commenter_a":"Obama is: 1st.muslim 2.gay 3.communist Don't be surprised, he's doing exactly what he said, fundamentally transforming the country. America \"voted\" for this.","post_message":""},{"comment_id":"1101655299855480","commenter_b":"Can't be bothered. This isn't science its novelty","commenter_a":"I'm skeptical. Tree rings are concentric not spiral. How would the needle track?","post_message":"Find out what tree rings sound like:"},{"comment_id":"10156920810200354","commenter_b":"Hey Cat, I have a dog that likes cats. She break their necks and use them as a dumnbwitted limp cat as skinny playboy. Maybe I could introduce y'all. Then you and Hillary will have a lot in common except for her long awaited prison cell....Gordon, most elections was closed primaries, which means Donald couldn't continue to empty the democratic party list of intelligent members which was leaving them with the African-Americans voters and dumb and moronic white voter in that party. Anyone who could vote for Hillary must not be capable of reading or hearing...or just hate America","commenter_a":"I'm very proud of my state of Arizona. On to the White House!","post_message":"#Election2016"},{"comment_id":"10153409124091955","commenter_b":"End and rescind birthright citizenship, build the wall, kill el shorty, deport the stragglers.","commenter_a":"kinda gives credence to Mr. Trump's assertions on illegals huh","post_message":"EL CHAPO WARNS TRUMP TO SHUT MOUTH"},{"comment_id":"10154094208712483","commenter_b":"I always love the people who shout about \"Damn SJWs always trying to shut down things they don't like! Get over it!\" because they're the same people that whine about things like the \"War on Christmas\". Who needs those safe spaces again?","commenter_a":"Oh no! Somebody got offended again so let's shut it down!","post_message":"The series, which has elicited a fierce backlash, will be shelved."},{"comment_id":"10154997509084626","commenter_b":"YOU ARE AN INSULT TO ALL WOMEN","commenter_a":"The embryo inside you, is not your body","post_message":"LIVE STREAM: Women's March on Washington"}]
