[{"comment_id":"10153415746649024","commenter_b":"She is not eligible to run..","commenter_a":"The sad truth is that DUMB PEOPLE WILL STILL VOTE FOR HER! !!!! IT SHOULD BE ILLEGAL TO RUN FOR OFFICE IF THERE IS SO MUCH CORRUPTION IN YOUR HISTORY !!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10154007115431770","commenter_b":"IDIOT","commenter_a":"Another side affect of using baby powder........ugh","post_message":"When Tucker Carlson got the best of this anti-American-Flag student, it reminded us of the old Thug Life meme. Welcome to the Tuck Life."},{"comment_id":"10152995083802869","commenter_b":"Isn't there something about judging a tree by the fruit it bears. This sir, is what you stand for and represent.","commenter_a":"I can't believe he found a woman stupid enough to marry and procreate with him.","post_message":"Janet and I want to affirm our support for the Duggar family.  Josh’s actions when he was an underage teen are as he described them himself, 'inexcusable,' but that doesn’t mean 'unforgivable.'  He and his family dealt with it and were honest and open about it with the victims and the authorities.  No purpose whatsoever is served by those who are now trying to discredit Josh or his family by sensationalizing the story.  Good people make mistakes and do regrettable and even disgusting things.  The reason that the law protects disclosure of many actions on the part of a minor is that the society has traditionally understood something that today’s blood-thirsty media does not understand—that being a minor means that one's judgement is not mature.  No one needs to defend Josh’s actions as a teenager, but the fact that he confessed his sins to those he harmed, sought help, and has gone forward to live a responsible and circumspect life as an adult is testament to his family’s authenticity and humility.  Those who have enjoyed revealing this long ago sins in order to discredit the Duggar family have actually revealed their own insensitive bloodthirst, for there was no consideration of the fact that the victims wanted this to be left in the past and ultimately a judge had the information on file destroyed—not to protect Josh, but the innocent victims.  Janet and I love Jim Bob and Michelle and their entire family.  They are no more perfect a family than any family, but their Christian witness is not marred in our eyes because following Christ is not a declaration of our perfection, but of HIS perfection.  It is precisely because we are all sinners that we need His grace and His forgiveness.  We have been blessed to receive God’s love and we would do no less than to extend our love and support for our friends.  In fact, it is such times as this, when real friends show up and stand up.  Today, Janet and I want to show up and stand up for our friends.  Let others run from them.  We will run to them with our support."},{"comment_id":"10153554399159087","commenter_b":"Naw a wall sounds great how's how is he going to pay for it? Oh it's free lol fool","commenter_a":"Trump offering free stuff, free deportations, and a free wall. damn national socialist","post_message":"If Donald J. Trump is victorious in several March 15 winner-take-all contests, including Ohio and Florida in which he is currently leading, it would take an “extraordinary effort to defeat him,” Karl Rove said."},{"comment_id":"10154608447428690","commenter_b":"@username - Did I hurt your feelings? While you're defending her she's planning on how she'll enjoy all her wealth somewhere in the world while you'll be paying taxes up the wonker. It's called Sod's law.","commenter_a":"She is every color on the a--hole rainbow.","post_message":"\"I am innocent, I am an honest person and I have never committed a crime.\" @webpagelink"},{"comment_id":"547509162098460","commenter_b":"I can t push like I push agree!","commenter_a":"sounds like you support clinton ted","post_message":"Our nation is at war. From 9/11 to the Boston Marathon, from Fort Hood to Chattanooga, from San Bernardino to last night’s horrific attack in Orlando, radical Islamic terrorism has declared jihad on America. Early reports indicate the Orlando terrorist had pledged his allegiance to ISIS, and he had previously been investigated by the FBI. And yet, as with the prior attacks, we were not able to act to stop this act of vicious terrorism that has now murdered 50 and injured more than 50 others.   Our hearts go out to those killed and wounded last night. Our prayers are with their families, and with all their grieving loved ones.      It is a time for action. We need a Commander in Chief who will speak the truth, and who will unleash the full force and fury of the American military to utterly destroy ISIS and its affiliates. We need to pass the Expatriate Terrorist Act, so that known ISIS terrorists cannot use U.S. passports to return to America and wage jihad. We need a President who is serious – who will identify the enemy by name and do everything necessary to defeat it.   The next few days will be sadly predictable. Democrats will try to use this attack to change the subject. As a matter of rigid ideology, far too many Democrats – from Barack Obama to Hillary Clinton – will refuse to utter the words \"radical Islamic terrorism.\" They will claim this attack, like they claimed every previous attack, was isolated and had nothing to do with the vicious Islamist theology that is daily waging war on us across the globe. And they will try to exploit this terror attack to undermine the Second Amendment right to keep and bear arms of law-abiding Americans.   Enough is enough. What we need is for every American – Democrat and Republican – to come together, abandon political correctness, and unite in defeating radical Islamic terrorism.   ISIS doesn’t just target soldiers. They don’t just target Republicans. Or Jews. They also target Christians and fellow Muslims. They target each and every one of us. As we saw this morning, they target the gay and lesbian community. Their objective, which they broadcast worldwide, is to murder or forcibly convert every single American.   For all the Democrats who are loud champions of the gay and lesbian community whenever there is a culture battle waging, now is the opportunity to speak out against an ideology that calls for the murder of gays and lesbians. ISIS and the theocracy in Iran (supported with American taxpayer dollars) regularly murder homosexuals, throwing them from buildings and burying them under rocks. This is wrong, it is evil, and we must all stand against it. Every human being has a right to live according to his or her faith and conscience, and nobody has a right to murder someone who doesn’t share their faith or sexual orientation.  If you’re a Democratic politician and you really want to stand for LGBT, show real courage and stand up against the vicious ideology that has targeted our fellow Americans for murder.   Today, all of America stands in solidarity with the people of Orlando. All of us should lift them up in prayer, demand action, and if you have any information about the Orlando shooter or potential radical Islamic terror plots, please act to keep us safe by using the FBI tips website: @webpagelink"},{"comment_id":"10153152461759170","commenter_b":"Because many people don't understand the effects of war on our men and woman of the war they fight overseas and home. It's the sadest thing I've come to know and yet sooooo many people can't understand. Watch and learn what they suffer along with there Loved ones. Then remember there sacrifice!!","commenter_a":"No they don't hate war movies, they hate war movies when an American is the Hero.","post_message":"No one should be surprised that American Sniper didn't win much at last night's Oscars..."}]
