[{"comment_id":"10153649297241756","commenter_b":"William, the real shame is that this woman has likely already procreated or will procreate and pass on her low level of intelligence and ignorant, backwards redneck beliefs onto her offspring.","commenter_a":"As a historical relic, it belongs in a museum. The Confederates lost the war. The only flags that should be flying at the South Carolina Capitol are the United States & South Carolina flags.","post_message":"The crowd chanted \"USA! USA!\" as the flag was lowered."},{"comment_id":"10153355238128984","commenter_b":"They love talking about themselves. Bunch of dumb thugs. God make them go back under the rocks they crawled out of.","commenter_a":"A is A. (Aristotle)","post_message":"Both Obama and Baltimore's mayor have called the rioters by a one-word name that has generated controversy..."},{"comment_id":"10153237445176323","commenter_b":"Godddd she's so needy. That hoe def aint loyal. We all know what happens to hoes like that...they get burnt","commenter_a":"@username @username dam Cheryl is annoying... Defriend straight away","post_message":"When is Cheryl's birthday?"},{"comment_id":"1080661608696757","commenter_b":"Stfu!","commenter_a":"Way to go Lebron!! Millionaire rappers should do rap outs in support of someone who pointed an EXACT replica of a Colt 1911 at police. Yes it was a pellet gun, but if the child was educated at home on gun safety and how to never point anything that resembles a gun at police officers he would be ALIVE today.","post_message":"\"This issue is bigger than me; it’s about everyone. And gun violence and tragedies and kids losing lives at a young age, some way, somehow we need to understand that that matters more than just an individual.\"  - LeBron James"},{"comment_id":"10153467245366770","commenter_b":"@username are you doing your homework?","commenter_a":"According to Roger Stone, 182919686769s Mens Fashion Editor and the only named \"source\" in the National Enquirer smear story about Ted Cruz cheating on his wife with five women. Ted Cruz doesn't have time for that crap, he's too busy pushing back the establishment.","post_message":"\"Despite the old guard and amateur pundits blaming Donald J. Trump and the majority of GOP voters who support him, much of the rift in the Republican Party has been caused by Texas Senator Ted Cruz conning nationalists into believing he is one of them.\""},{"comment_id":"695324637324781","commenter_b":"Get ISIS and obammy out of AMERICA first. We need to protect ourselves and children. Then we can help ours.","commenter_a":"Wipe them off the face of the earth!!!!!!","post_message":"An innocent American girl was found in the middle of this ISIS debacle. America now truly stands with France against ISIS. Do you think that America should wipe ISIS from the face of this planet?"},{"comment_id":"10157731504125354","commenter_b":"why are our prisons full of illegal aliens who have broken the law? why don't we deport them? why? why? why?","commenter_a":"She should be held personally liable.... but she won't.","post_message":"So many acts of love..."}]
