[{"comment_id":"10152867699771636","commenter_b":"how sad that people still think he's anything other than a disaster capitalising tory.","commenter_a":"Don't tell me he plans to run for leader of Labour Party again?","post_message":""},{"comment_id":"1673051799421609","commenter_b":"WOW SHE'S AS DELUSIONAL AS HER WACO HUSBAND!","commenter_a":"she is nasty","post_message":"While speaking to a crowd recently, Michelle Obama suggested men viewed her as a sex symbol. She didn't anticipate the response. The video speaks for itself."},{"comment_id":"1252245691520631","commenter_b":"Simple...don't allow anyone in from radical terrorist countries until their country has a way to prove who the person is. Until then they can all stay there and fight in their own countries. Make their own America or their own hell. Whatever they want. But don't do it here.","commenter_a":"Time to shut the doors to these people. All. Until there is a better system.","post_message":"Don't expect to hear a word about this in the media.   This is the kind of info that is horrible for the left."},{"comment_id":"450455948478319","commenter_b":"Get off her fat butt and walk. That does not cost. Stop whining and exercise at home. Absolutely disgusting.","commenter_a":"Yet she has enough to do that fugly bozo the clown hair color","post_message":"Should All Welfare Abusers Be Arrested?  Comment 'yes' or 'no'."},{"comment_id":"10153248545727217","commenter_b":"The smog isn't real. It's just a liberal conspiracy. Keep on polluting.","commenter_a":"And yet wherever they go they reply their failure productive system: massive production and consumption with no protection of the environment....","post_message":"Smog \"red alert\" in Beijing"},{"comment_id":"665938460232774","commenter_b":"heard it thinking it wouldn't be thattttt bad, me after: ok he's officially a pig","commenter_a":"Jasmine","post_message":"\"When you're a star they let you do it.\" -Donald J. Trump"},{"comment_id":"10154079129819091","commenter_b":"Pence CNN 9/8/16 \"I think it's inarguable that Vladimir Putin has been a stronger leader in his country than Barack Obama has been in this country.\" Pence VP Debate 10/04/16 \"That is absolutely inaccurate. I said he's been stronger on the world stage.” Like his master Trump, Pence lies about his lies. The Trump campaign hostility towards President Obama is a national disgrace. President Obama is 100 times the leader that Trump or his boy Pence will ever be.","commenter_a":"The problem with Kaine was when Kaine spoke, Pence let him speak but the minute it was Pence's turn, two seconds into his turn Kaine was interrupting him, he's such a putz.","post_message":"VP nominees Tim Kaine and Mike Pence were both on the attack Tuesday night:"}]
