[{"comment_id":"1066446510115069","commenter_b":"THIS DUMB FK ,THINKS ,PEOPLE, WITH MONEY .WILL REALLY ,DONATE MONEY, IF THEY,GET TAX BREAKS ,WHILE PUT ALL THERE ,MONEY IN OVERSEA ,ACCOUNTS ,AND SHIPPING OFF MIDDLE CLASS JOBS OVERSEAS ...REALLY ,YOU DUMB AZZ MORONS ,,,WHO VOTE ,WITHOUT ,COMMONSENSE!! THESE FKS HATE FKGERS HATE THE POORPEOPLE ,VETERANS ,SENIORS ,AND OTHER AMERICANS ,,REALLY DUMB AZZES REAGAN ,TRICKLE DOWN ,MY AZZ ,YOU FOOLS ...THIS GUY IS A FRICKEN CARPET BAGGER,,,FOOLS !!!!!!!!!!!!!REALLY!!!! LMFAO!!!!!","commenter_a":"Following in the footsteps of Reagan and Bush Jr.","post_message":"Just like the rest of the GOP candidates, Rubio's tax plan is a massive handout to the wealthiest of Americans."},{"comment_id":"1155392447817135","commenter_b":"Since she can't take the heat she gets out of the debate. (Kitchen).","commenter_a":"She knows she has already taken both sides of every topic. There's simply nothing left to lie about.","post_message":"Would Clinton benefit from another debate with Sanders?   She doesn't think so."},{"comment_id":"1136375496397870","commenter_b":"SHE IS A DEMON POSSESSED WOMAN.","commenter_a":"Yes put Her in Prisone for life. For all the life's she took. Hillary Clinton we know what your up to and trust me God has not forgotten about you either.","post_message":""},{"comment_id":"1258505287549557","commenter_b":"Nah yo Grandma shouldn't have been hoeing around on Christmas eve. Her old ass shoulda been inside","commenter_a":"Damn WsHH with the sad ass news but was santa cryin like that when his reindeer ran Grandma over","post_message":"This is heartbreaking. #WSHH "},{"comment_id":"968012613239597","commenter_b":"Wtf? This is annoying. She was extremely fat, tried out for a show, lost all kinds of weight and is now complaining. If it was horrible she should have left. Choices! I'm sure this wasn't the first time she felt humiliated. I mean come on... She was all about it when she was trying to win some money... She sucks","commenter_a":"Totally off topic but her mannerisms remind me of Ginny Goodwin as Gigi in He's Just Not That Into You","post_message":"The way she describes her experience competing in the show ... it's so messed up."},{"comment_id":"10154128479435673","commenter_b":"She needs to go. and you can go to....","commenter_a":"Too little too late Jack","post_message":"The decision not to seek prosecution of Hillary Clinton is plain wrong. I have joined several of my colleagues to do something about it."},{"comment_id":"10153988476564255","commenter_b":"Who is this dumb bitch this must be Stacy dash sister","commenter_a":"Unbelievable!!!","post_message":"This is how Fox News celebrates Black History Month."}]
