[{"comment_id":"10155222561152316","commenter_b":"Can you prove she rigged the election?","commenter_a":"Killary is our threat not TRUMP. Why wasn't she arrested for rigging the election? Yall are not covering her criminal acts, are you ?","post_message":"Republican presidential nominee Donald Trump is asserting that countries like France that he says are compromised by terrorism may be subjected to the \"extreme vetting\" he proposes as a deterrent to attacks in the U.S."},{"comment_id":"10153822005111519","commenter_b":"It doesn't fit her","commenter_a":"Plus not just only black ppl have this done. White and other colors do 2.","post_message":"Lil’ Kim’s bleached skin and blonde hair are the tragic result of sexism, racism, colorism"},{"comment_id":"10152612105311636","commenter_b":"Stupid women","commenter_a":"Because it causes serious mental health pronlems","post_message":"Remind us why this isn't legal in the UK again?  via Independent US"},{"comment_id":"10154970022528690","commenter_b":"The world and so call United Nation have no interest in alepo people just because they are muslim, if its christian region this is happening the UN will have take action, but we the muslims are just folding our arm doing nothing, the only thing is to back to Allah, by saying; HASBUNALLAHU WANI'IMAL WAKIL, WANI'IMAL MAULA WANI'IMAL WAKIL,","commenter_a":"there is tubelight, internet, electricity bla bla. it seemed she is speaking from hotel pan pacific Singapore. we didn't heard even a sound of bullet fired. weird.","post_message":"Residents of East Aleppo are giving their final messages to the world."},{"comment_id":"603575639802390","commenter_b":"Dumb bitch but I completely understand there decision to shoot the Silverback.","commenter_a":"If you are such a negligent parent that you allow your 4 year old child to fall into the pen of a wild animal, you should have to descend into the pen yourself and fight the animal with your bare hands to show society that you are still fit to be a parent.","post_message":"The zoo's decision to kill a 17-year-old, critically endangered gorilla after a 4-year-old boy fell into the animal's habitat has sparked outrage."},{"comment_id":"1118891848162172","commenter_b":"YES! And I hope they do throw her in jail!","commenter_a":"WTF!! Put her ass in jail! She is just as guilty, that's premeditated...she knew about the plan and let it happen","post_message":"She reportedly \"tried to talk him out of it,\" but that's it."},{"comment_id":"552107031615918","commenter_b":"Jordan get out of here with that nonsense.","commenter_a":"Doesn't affect me. I'll be voting for Bernie.","post_message":"In response to a VICE News FOIA request, a federal judge on Thursday ordered the State Department to release the bulk of the remaining Clinton emails before the February 27 contest."}]
