[{"comment_id":"10153359922053984","commenter_b":"No more Muslims in this country. Enough is enough. Send the Muslims and Obama packing.","commenter_a":"Trey I love you to the moon and back, you are our only hope!!!!!! Keep up the wonderful things you are doing.","post_message":"Classic Trey Gowdy. State Dept. wants to send Muslims to these U.S. states, but they'll have to get through him first.  Do you agree with Gowdy's demands?"},{"comment_id":"10156327027695389","commenter_b":"Cuff the lying witch already.","commenter_a":"Sounds like a recommendation for an Indictment may be in the new future. If the DOJ rejects it.....Will their be alot of resignations from the FBI??","post_message":""},{"comment_id":"10153631699856680","commenter_b":"Voter beware..","commenter_a":"We need to Unionize and fight back go on strike. I want those Rust belt Democrats to lean left and far left.","post_message":"They used to be Democrats. Now they really could hand Donald J. Trump the White House."},{"comment_id":"1078709322150078","commenter_b":"we r so screwed if cancer is cured... prepare for the brand new disease! xD","commenter_a":"Gus Fielding","post_message":"A small trial for a cancer vaccine has been successful."},{"comment_id":"1949307655356344","commenter_b":"Lies alternative facts deceitfulness racism and separation was exactly what Obama and the Democrats have done way before Trump was elected....that is why he won and until democrats realize it then Trump will get 8 years. I am a registered Democrat and I realized in this election just how racist lying criminals they are I voted for Trump and will give him a chance. I will never vote Democrat again as long as they keep doing what their doing by destroying this country","commenter_a":"I am not a Trump fan but I do believe in freedom of expression be it what it may We all have a right to voice our opinion and if she chose do it the way she did we all have to respect that America has always been great and Trump did not bring that greatness he has brought lies alternative facts deceitfulness racism and separation of a great country . I only hope that he is stopped before he deletes all the greatness in which this country was founded on","post_message":"24 Hours After The Grammys \"Make America Great Again\" Singer Posts Stunning News"},{"comment_id":"10153571120640779","commenter_b":"It's a bitch...","commenter_a":"Karma.","post_message":"USA Swimming, the national governing body of competitive swimming, has banned convicted rapist Brock Turner for life."},{"comment_id":"10158427286480206","commenter_b":"Where were these feminist when Bill was galavanting around town assaulting women and Hillary was defending him?","commenter_a":"Wonder if they \"smoked\" cigars afterwards, with Bill.... 2016, the year that people protested over a word... terrific.","post_message":"A mostly-female crowd chanted \"GOP, hands off me and \"Trump thinks he runs this town, p---y came to shut it down\" outside of Trump Tower."}]
