[{"comment_id":"1079209208779497","commenter_b":"She got them takin away bc of her psychological problems","commenter_a":"Run, mom, run. I was involved in a custody battle with my ex who had money and guess what? I lost!!","post_message":"Hillsborough Sheriff's detectives are asking for the public's help locating two missing twin girls who are believed to be with their biological mother who just lost custody of the girls."},{"comment_id":"10153882907494024","commenter_b":"The monkey bitch and her brood can't be gone soon enough for my taste.","commenter_a":"She complains about the \"house\" she lives in. Is she chained to the wall-?? Just move, bitch-!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10153535673013352","commenter_b":"Rosey got no pics cuz she is a big fat pig","commenter_a":"Ape in the house","post_message":"The squatter from hell: Woman ‘moves into $800,000 Martha’s Vineyard vacation home and sells the owner’s possessions in a yard sale’"},{"comment_id":"1716476818593163","commenter_b":"Well she is a WITCH.","commenter_a":"what a joke. anyone with any brains would look at her trend to not do the right thing. we have had enough bad behavior in the white house the past 2 elections we do not need more.","post_message":"According to Hillary's campaign manager, voters trust Hillary because she's completely upstanding, honest, and scandal-free. Claims to the contrary are nothing more than a GOP witch hunt."},{"comment_id":"1724892717782853","commenter_b":"We are in America! Speak English woman! Lol","commenter_a":"@username they read my post!","post_message":"\"Hail Hydra\" are two words no one ever expected Captain America to say."},{"comment_id":"696420180548560","commenter_b":"Personally I am glad that Texas is not taking any refugees. Imagine the amount of terrorist polluting the state.","commenter_a":"Good for you Texas Gov.!!!! Let's hope that our spineless president doesn't stymie this action.!!!","post_message":"Texas Gov. just released this very bad news for all refugees. The are setting a trend. Let's spread this. Can we get 75,000 'LIKES' for the great state of Texas?"},{"comment_id":"10152862835371336","commenter_b":"The ft hood shooter was an American serviceman","commenter_a":"What about Benghazi and Ft. Hood?","post_message":"\"This is an act of violence, an act of terrorism that we condemn in the strongest possible terms, and we are going to stand shoulder to shoulder with our allies in France.\" – White House Press Secretary Josh Earnest on America's Newsroom moments ago"}]
