[{"comment_id":"1785556881731423","commenter_b":"The white house will probably be full of naked stripper","commenter_a":"Trump will bring that back","post_message":"Yes!"},{"comment_id":"10154378006503352","commenter_b":"What is a thot?","commenter_a":"Why do they have to call her a thot??? Ridiculous article","post_message":"New photos of Amber Rose Doing Naked Sunbathing Indicate She Might Have Been Wearing Booty Pads All Along – Her Behind Disappeared! (PHOTOS)"},{"comment_id":"10153138669086378","commenter_b":"She gets off on it","commenter_a":"Weird","post_message":"BREASTFEEDING FRIEND'S SON: A photo of a Bala Cynwyd woman breastfeeding not only her own son, but her friend's son, is generating controversy.  See more about her decision, and let us know what YOU think in the comments below:"},{"comment_id":"10153459531098855","commenter_b":"Attention whore","commenter_a":"Even her wig looks sad to be there","post_message":"Not another one!"},{"comment_id":"10153880758701337","commenter_b":"Lesbians","commenter_a":"Who the fuck cares..","post_message":"Justin Bieber has more than 50 tattoos yet this one fit perfectly in an unexpected spot..."},{"comment_id":"1091280717559605","commenter_b":"@username, are you really that concerned this man will not reach his full potential of sexual pleasure!? He's a man for christ sake! The last thing he needs is anymore reason.. I don't miss the excess skin they removed from vag after giving birth. Wasn't doing me any good, and it would've been in the way. You still got the umbilical cord hanging out of your puss or what!? Never know, you might miss it..","commenter_a":"I knew it caused both my boys pain, but I still had them both circumcised. Haven't regretted the decision at all.","post_message":"Maybe that circumcision was a bad idea after all, huh?"},{"comment_id":"1169723563063063","commenter_b":"SHES ONE HELL OF ALOT BETTER THAN THE TRANNY AMERICA HAS PARADING AROUND AS A WOMAN NOW! THE TRANNYS NAME IS MICHAEL! ODUMBASS LOVES HIS GAYS! DAMN THAT IS ONE BUTT UGLY GORILLA FAVED TRANNY! MELANIA HAS MORE CLASS IN HER CRAP THAN THE TRANNY HAS IN HIS WHOLE BODY! P.S. TUCK THAT SCHLONG TRANNY!","commenter_a":"Agree","post_message":"I agree!"}]
