[{"comment_id":"10153513356977061","commenter_b":"Oh god please... What a fake","commenter_a":"Worst First Lady and president ever ....E V E R ...","post_message":"WATCH: Pres. Barack Obama and First Lady Michelle Obama do the Whip/Nae Nae at The White House Easter Egg Roll. abcn.ws/1VPZxxV"},{"comment_id":"1000554689985003","commenter_b":"I also work in the water industry and watched this guys demonstration. What a bunch of BS on several accounts. First my information comes from the following website: Water Encyclopedia - Ogallala Aquifer. According to this site the average depth of the Aquifer he is referring to is between 60 to 200 feet. Some sections of this Aquifer is over 1000 feet deep. Anyone that understands anything about water understands ground filtration. This particular Aquifer happens to be receiving it's water from snow and rain run off from the Rocky mountains. Fracking or not is very very unlikely to have any effect on the quality of water in his state. True fracking does use water in it's process - untrue it does not simply dump untreated water back into the Aquifer. This guy's demonstration is about as truthful as someone video taping a moose pissing on a snow bank in ...","commenter_a":"yup......and one \"spill\" accidently of course.......stop this madness!","post_message":"It's simple, really. If this is what you're willing to do to the water, you should be willing to drink it. These committee members weren't."},{"comment_id":"1352047571524023","commenter_b":"Lock her up","commenter_a":"Merry Christmas from Michigan","post_message":"Pat Dollard LIVE! The secret Truth of Obama"},{"comment_id":"654122978061007","commenter_b":"I know you do","commenter_a":"Omg I want to hold one!!! @username","post_message":"PANDAMONIUM: 4-month-old giant panda cubs at The Toronto Zoo are learning to walk."},{"comment_id":"571042013020392","commenter_b":"If this is true, why doesn't every woman in America have problems????","commenter_a":"let them out . turn the puppys loose","post_message":"Every woman needs to read this!"},{"comment_id":"453308998193014","commenter_b":"She's in AMERICA and that gives her the right to display the flag. Leave it up !!!","commenter_a":"Yes","post_message":"Do You Support This Woman's Refusal To Remove Her Flag?  Comment 'yes' or 'no'."},{"comment_id":"10156418546700354","commenter_b":"Obama would leave the citizens help to protect their selves just like what happen to Paris.","commenter_a":"Isn't that what Carson said and he got chastised","post_message":"This is slated to air tonight on \"60 Minutes,\" and it's going to INFURIATE liberals..."}]
