[{"comment_id":"1204270932993102","commenter_b":"Ape woman","commenter_a":"never heard of him !!","post_message":"Are you proud to have Michelle Obama as America's First Lady?"},{"comment_id":"1050080195049016","commenter_b":"another dumb btch","commenter_a":"So Donald Trump you are not the savior we need for this country, I do not think you will bring jobs or prosperity when you do not even pay great wages for people that work for you. I think you are a disaster waiting to happen, you really belong in a reality series not president, I hope the people wake up before you end up our dictator","post_message":"ICYMI: Ivanka Trump took the stage in South Carolina and said, “My father is an incredibly hard worker and he’ll be working for each and every one of you.”   (CC: Donald J. Trump, Sean Hannity)"},{"comment_id":"10152758056381051","commenter_b":"In her own bed? I would've picked something heavier than a shoe! Id burn the bed.","commenter_a":"He is scum her bed he needs to loose his penis cause hr is thinking with his small head","post_message":"When this wife got home and found her husband in bed with another woman, she decided to teach him a lesson."},{"comment_id":"10153356544334087","commenter_b":"Yep.","commenter_a":"Hillary should worry about that indictment coming down the pipelines in January.","post_message":"“This is truly unbelievable, that after what we’ve seen in Paris and other places, Republicans will not bring up a bill that will prohibit anyone on the no-fly list from buying a gun in America,\" Hillary Clinton said. \"If you are too dangerous to fly in America, you are too dangerous to buy a gun in America. How many more Americans need to die before we take action?”"},{"comment_id":"718949644953580","commenter_b":"HAHA. Chickenshit. Stay home and tweet like a little bitch.","commenter_a":"chickenshit can't take the heat","post_message":"Pathetic."},{"comment_id":"10153210594174270","commenter_b":"Every female to attempt the Marine Corps Infantry Officer Course...failed. And that's a fact","commenter_a":"Come on you all should know that males have to make second attempts at ranger school sometimes. This is not a female only type thing. Please for your sake do at least a google search of something before acting like only females get the second attempt","post_message":""},{"comment_id":"10154268169886409","commenter_b":"You are just like all the other trump bashes before u run your mouth have your facts straight instead what other haters say","commenter_a":"Hitler Trump should be impeached we need to start a petition like the U.K. did to ban him from the U.S. because his a embarrassment. He is the real criminal, he committed fraud, his involved with Putin and hacking the election in his favor, he refuses to show his taxes because he probably commited fraud if he doesn't have anything to hide then he should show his taxes. He did not put his businesses in a blind trust he continues to profit from his businesses while his in office. He hasn't paid taxes in over 20 years you Trumpeters created this monster by continuesly supporting him now his out of control.","post_message":""}]
