[{"comment_id":"584420751713216","commenter_b":"STOP muslim immigration permanently !","commenter_a":"Yes!!!! And not just muslins!!!!","post_message":"Question of the Day: Should we halt Muslim immigration until the federal government can get it under control?"},{"comment_id":"10154139052147869","commenter_b":"Yes, she should move to Berkeley!","commenter_a":"Backward looking. When was the last time she looked in a mirror ...","post_message":"Another thing noticed in the Wikileaks release of the full transcripts Hillary Clinton’s paid appearances for Goldman Sachs: she described Republicans as “backward-looking” and fundamentally un-American.”  So in addition to being rednecks (according to Bill), people who don’t support her politically are racists, sexists, homophobes, xenophobes and Islamophobes; a “basket of deplorables” who are backward, irredeemable and fundamentally un-American.    So I have to wonder: why does she want to be the leader of all us horrible people?  If she hates everyone who disagrees with her that much, instead of running for President, why doesn’t she just run for mayor of Berkeley?"},{"comment_id":"10155508321034778","commenter_b":"Round \"us\" up ans ship us out? Why would they round up and ship out legal immigrants or citizens?","commenter_a":"No. they are here to serve and protect us. Not round us up and ship us out. That's not part of their job. That's ICE's problem and a federal issue. They want people out then they can do it themselves.","post_message":"Should local police departments participate in immigration raids?  Explain why and your comment could be used on #OffScriptOn9 at 7 p.m.  Full story-->@webpagelink"},{"comment_id":"10154681794980329","commenter_b":"@username Cringe worthy.. Sounds like a super basic bitch thing to say lol","commenter_a":"As a 6 foot tall lady who is all leg, YAAASSS, SEND THEM ALL TO ME.","post_message":"\"I might keep the jeans for fun now,\" one recipient told BuzzFeed News."},{"comment_id":"639736896151349","commenter_b":"That's great and all but how do these women make money now?","commenter_a":"yeah and there'll be some bleeding heart liberal who'll be out fighting for robots rights and defending human trafficking because \"pedophelia is a disease!\" and we \"shouldn't judge\".","post_message":"Experts believe that cyborg prostitution will help ‘clean up the industry’ by reducing sexually transmitted diseases and ending sex slavery."},{"comment_id":"10153251176006509","commenter_b":"Ignore luci. She is a troll.","commenter_a":"White supremacy tip of the day: If a black person commits a crime, blame him and every black person via Al. If a black person is the victim of a crime against them by a white person, blame him and every black person for bringing the violence upon them.","post_message":"A device had detonated, but failed to ignite a gasoline can placed alongside it. The incident left some shaken in Colorado Springs. @webpagelink"},{"comment_id":"1257498034286119","commenter_b":"I this this guy is secretly obsessed with pussy lol","commenter_a":"QUESTION: How can you call yourself a patriot and support 33 Benghazi hearings but NOT ONE on whether Russia infiltrated the White House...?","post_message":"Drip. Drip. Drip. Republicans in Congress need to drop the political charade and help us get to the bottom of this."}]
