[{"comment_id":"1199514790068549","commenter_b":"\"Tear Down This Wall!!\"","commenter_a":"Reagan might but Eisenhower would not as he was too far left for todays GOP.","post_message":"When you compare self-identified Republicans today to those of 1990, you have to wonder how well Reagan would do in the 2016 race."},{"comment_id":"10153179280538690","commenter_b":"Learn to convey your thoughts properly before getting all nationalistic. It makes you look even more ignorant than you already are for making such a bigoted comment.","commenter_a":"I think some American got fid up angry because some Muslim in America lived there got passport got education and freedom, then they turn back against Americans burning their flag and terrorizing people.","post_message":"Police have not yet given any possible motive for the attack. The hashtag #ChapelHillShooting  has gone viral, many of the tweets criticising the US and other Western media for not covering the shooting.   @webpagelink"},{"comment_id":"560619820771155","commenter_b":"Happy Thanksgiving Dr. Carson and family!","commenter_a":"God bless and keep you both always,many more Thanksgiving to share our blessings.","post_message":""},{"comment_id":"1676793319209552","commenter_b":"Yes Obummer did start all of this. And he has not came out publicly and stood up for the Cops Or American Christians. But he sure as hell has Stood up for the Dammed Muslim's. When are the People going to stop his ass","commenter_a":"I stand with local, county, and state law enforcement I have zero faith in federal law enforcement.","post_message":"At least there are a few people out there with the guts to say what needs to be said.  @webpagelink"},{"comment_id":"10154215455576770","commenter_b":"Lock her up","commenter_a":"As a retired military wife she Makes me sick!!! Like she ever cared about America!! She cares only for herself and if you support her I feel sorry for you!!!","post_message":"Hillary Clinton responded within minutes."},{"comment_id":"10157168676140293","commenter_b":"Get off it already. There are bigger issues in our country to deal with such as gun control, racism and all these shootings, immigration, abortion, same sex unions, and the list goes on. Not whether or not she used the same words as our current first lady or not. I don't care if she copied the whole speech word for word as long as he can put our country in better shape than out current president and first lady.","commenter_a":"Not her fault...She just read what they gave her.. Don't blame her...","post_message":"Melania Trump's speech last night at the 2016 Republican National Convention is now the subject of a plagiarism controversy.  READ why some are saying some of her words were lifted from the current First Lady:"},{"comment_id":"10153032834297452","commenter_b":"I was waiting for Hillary Clintons campaign team to do this, desperate move. The army rangers officially lead the way of u know what. Ooooo rah to the hoooo ya","commenter_a":"Well done!!","post_message":"U.S. Army Capt. Kristen Griest (left) and U.S. Army 1st Lt. Shaye Haver (right) will graduate Friday at Fort Benning, Georgia along with 94 men. They will be the first women to graduate from the Army's notoriously grueling Ranger School. @webpagelink  Griest said her successful completion of the two-month program shows that women \"can deal with the same stresses and training that men can.\""}]
