[{"comment_id":"10153332153777377","commenter_b":"But yet Megyn cried otherwise. Such a Bimbo.","commenter_a":"BBB gave Trump an A on his Trump University, so Cruz needs to hit the unemployment line","post_message":"Ted Cruz hammered Donald Trump on Thursday, tweeting out what he called a \"Certificate of Deception\" for Trump's now-defunct Trump University."},{"comment_id":"1092750970772962","commenter_b":"Omg when I hear you little sheep that follow that lying bitch it makes me gringe","commenter_a":"Unfortunately Tronald Dump has his followers their just as dumb as he is at this point Dump can say whatever he wants and he will still have his followers sad what this country has become but we can stop this Dictator in November do the right thing VOTE BLUE","post_message":"LOL"},{"comment_id":"10153026521466955","commenter_b":"Women of the world just took a hit, sorry","commenter_a":"it's all lies and if you even think for a moment it's true then your the fool","post_message":"MAG: Bruce Jenner 'Transitioning into a Woman'... Filming momentous docu-series..."},{"comment_id":"496937747163472","commenter_b":"Put the hag in prison","commenter_a":"I like that picture of Hilliary, \"hands up, bitch, you're under arrest.","post_message":"New documents released shows incriminating evidence that could put Hillary away for good.  She is a terrorist. We need to act now.  Should Hillary Clinton be arrested for treason?"},{"comment_id":"1741105056106659","commenter_b":"BWAHAHAH AND THAT'S WHAT MAKES AMERICA GREAT!","commenter_a":"Carla Stovall Jeanne' Cleopatra Thompson Anthony Stovall BLOOP!!!!","post_message":"TRUTH: Kaepernick's critics are failing to see the larger point. Roland Martin nailed it with this one.  Shared by Occupy Democrats, LIKE our page for more. Video from MSNBC."},{"comment_id":"520761104778849","commenter_b":"Muslims are taking over united states they run all motels and 7 elevens in the country I don't know if its cause our government gives them a break on payinv taxes!","commenter_a":"political correctness......","post_message":""},{"comment_id":"1480804778605937","commenter_b":"FEAR-MONGERING ULTRA-RIGHT FASCISTS!","commenter_a":"Well, there's this...@webpagelink","post_message":"Washington State Republican Party chair Susan Hutchison​ is holding a news conference after the Washington state attorney general announced a lawsuit against President Donald Trump over the immigration executive order. >> kiro.tv/WASuesTrump"}]
