[{"comment_id":"10154452763505575","commenter_b":"That is bullshit...Rasmussen has Trump ahead of that bitch!","commenter_a":"FOX News just reported that Hillary Clinton leads Trump 48 to 41. Basically, they say Trump has lost 3 more points since the debate. Sorry FOX, but I don't believe your bullshit poll and you can take it and shove it up your #NeverTrump asses.","post_message":"It's Happening! Black Vote SURGES for Trump in last two weeks!"},{"comment_id":"626503050873607","commenter_b":"Man she's one ugly silver back","commenter_a":"I am sick of all the threats and lies on FB have you no shame? This President only has a year to go what do you gain with the BS about him and his family. Crawl back in your hole!","post_message":"Michelle Obama was just hit with a multi-million dollar law suit for this reason.  Totally justified. She deserves prison.  Do you agree Michelle Obama is a criminal?"},{"comment_id":"899754210061920","commenter_b":"What do you care what she does or has? She doesn't have 2 brain cells to rub together!","commenter_a":"From what I understand, they don't drink alcohol at all. So I don't think she would fit in. Sad thing is that because of the alcohol and drugs she uses, she looks a lot older. I'm actually older than she is!","post_message":"Is Lindsay Lohan converting to Islam?    See what she was photographed holding."},{"comment_id":"880663015326781","commenter_b":"Alex Peterson hahahaha","commenter_a":"Tyler Simmonds @username Ashley Mckendrick","post_message":"Dolphin seduced me, claims man who had sex with marine mammal."},{"comment_id":"10153470149826234","commenter_b":"By a lot !!","commenter_a":"Amy check out HR. Looks like you got low balled","post_message":"Nice work, if you can get it."},{"comment_id":"10153816577949160","commenter_b":"You believed that nonsense? Sue glad Donald never cheated at anything.","commenter_a":"When can we not have to listen to lying cheating Teds shrill voice cry over everything. Ted cheated on his wife then lied about it.","post_message":"Donald J. Trump just won Indiana. Here's what that means.  READ MORE: @webpagelink"},{"comment_id":"1781647542076913","commenter_b":"I know that's Ivanka on the right, who's that chick on the left side?","commenter_a":"We need a food addict intervention for Mr. Moore. A good barber, too.","post_message":"Michael Moore is a ____________."}]
