[{"comment_id":"1218431098240658","commenter_b":"May be time for this earth to be cleansed ethnically.... all with religions other than HUMANITY should be wiped off...","commenter_a":"When will it all fcking stop!!! I think when religion stops their will be peace once again","post_message":"BREAKING: Russian ambassador shot dead in Turkey by gunman screaming 'We die in Aleppo, you die here'"},{"comment_id":"10155794432670354","commenter_b":"she'll never get that stink off her!","commenter_a":"What was that idiot doing there anyway.","post_message":"What was she thinking?"},{"comment_id":"10152505642191770","commenter_b":"She finally bought herself some new boobs?","commenter_a":"People dont realize that both Kim K and Paris are shrewed business women.","post_message":"Remember Paris Hilton? She's back, and she's letting it all hang out."},{"comment_id":"1090355681009413","commenter_b":"IT'S CALLED CORPORATE WELFARE , and it's been going on for way tooooooo long , and it needs to STOP !!!!!!!!!!","commenter_a":"the republican way","post_message":"Congress continues to let billionaires slide and pats the back of the wealthy while every day Americans suffer. Sign your name to help raise the minimum wage →   @webpagelink  (Hat tip to The Other 98%"},{"comment_id":"10153936528885695","commenter_b":"You run like a girl","commenter_a":"Jose Arellano that's probably why we saw the traffic earlier today","post_message":"Wait for it...wait for it -- a police officer chased three shoplifting suspects across Georgia 400 after this car crash. See the full video, plus we'll explain how it all started, at 5:14! @webpagelink"},{"comment_id":"10154490901549062","commenter_b":"She has that privilege","commenter_a":"Well at least she looks happy.","post_message":"The Drug Enforcement Agency has confirmed that a woman arrested for allegedly selling drugs in College Station is the daughter of a DEA agent."},{"comment_id":"472875716234055","commenter_b":"fk you brenda","commenter_a":"Idiots!!!!!!!!! disgraceful cannot wait till they are gone from the white house.","post_message":"I cannot believe they DID THIS on the same day! I am sick and tired of a president that doesn't care for our Marines and Veterans!"}]
