[{"comment_id":"10154292587651336","commenter_b":"@username he has submitted the required financial statements","commenter_a":"Running a country isn't the same as running a business. It'd better not be, since Trump has a habit of declaring bankruptcy...and that's not an option for the country. Sure, he's rich. However, he STARTED really rich and would be about as wealthy now or even more so if he didn't go into business at all, based on average stock market gains. @webpagelink/ With his unwillingness to release his tax returns and his inability have to have a serious discussion of policy, beyond 140-character tweets and repetition of: \"tremendous\", \"problems\", \"so many people tell me\", \"better deals\", and \"believe me\", Trump is most certainly NOT qualified for the job.","post_message":"\"I feel Mr. Trump can come and get us better deals. He is a businessman,\" former Kentucky councilman David Abbott said. \"I don't want my children Dave and Erika to grow up in debt all their lives.\""},{"comment_id":"10153715295681336","commenter_b":"Nancy Pelosi ? What are you smoking?","commenter_a":"As a GOP Tea Party, it's the best news I have heard this whole year! This RINO had to go, he's dishonest, he campaign as a Tea Party Patriot and then became a Liberal hack as many of them usually do! When I saw Nancy Pelosi defending this clown, I knew we were betrayed.","post_message":"“It’s become clear to me that this prolonged leadership turmoil would do irreparable harm to the institution… This morning, I woke up and I said my prayers...and I decided, you know, today is the day I’m going to do this.”  Moments ago,  Speaker John Boehner announced why he has decided to resign this year."},{"comment_id":"1604088796561359","commenter_b":"someone get through their thick headed skins, that this is America and we do not have to do it. You respect my religion and I will respect yours, but this is not freedom of religion or freedom of anything but trouble. Your here follow our ways like all other immigrants have done.","commenter_a":"First of all why would you apply for the job at the place if you're Christian?","post_message":"THIS Muslim Company in The U.S. Is Forcing Their Christian Employees To Wear Headscarfs!"},{"comment_id":"10152715652847293","commenter_b":"Way to bury your head in the sand. Typical liberal","commenter_a":"we have chosen not to see the film because we don't support war/killing...either way, the good thing is it got people thinking/talking...or, at least, trying to talk/think...","post_message":"Regardless of what Bradley Cooper wants, his movie American Sniper has become political."},{"comment_id":"10153277341923188","commenter_b":"I do believe the \"offended\" have been organized by an outsider to bombard anyone helping to stabilize the area. It is not Whole Foods, The National Guard or the Police who need scrutinized! It's the Promoters who keep unrest in the media way beyond the time it is newsworthy! Always seems to be when there is a \"Political\" issue, Ferguson-illegal aliens, Baltimore- Clinton Foundation and the very questionable donations. Of course the nuke treaty with Iran, etc.! Protesters in both cities started out fairly calm. Then hordes of people started pouring out of the woodwork, looting, burning, destroying, many were not even from that area! How did they get organized so quick? I agree that All Lives Matter in every community. I also believe a huge % of our Police Departments are doing what they have to do with the Thugs who lack any respect for our laws! Rap sheets ...","commenter_a":"So sad they were doing the right thing.","post_message":""},{"comment_id":"10153444075108132","commenter_b":"Pretty sure she's had surgery and botox.. or some serious airbrushing was done. Cripes everyone at 50 has a wrinkle.","commenter_a":"Thank you for picking someone normal and down to Earth without a bunch of surgery","post_message":"Sandra Bullock is PEOPLE's #MostBeautiful Woman! @webpagelink"},{"comment_id":"856127001183895","commenter_b":"Did Japan apologize for pearl Harbor, Bataan, and the rest of the atrocities committed by the Japanese military?","commenter_a":"Did Japan apologize foe pearl harbor","post_message":"Castro criticizes President Obama for not apologizing to Japan during a trip to Hiroshima in May."}]
