[{"comment_id":"10153834511188721","commenter_b":"Suck on these nuts","commenter_a":"@username Beetje bullshit dat \"size of the earth\" Nog steeds wel zieke shit, though!","post_message":"Space, folks. (via Mic)"},{"comment_id":"10150618266494999","commenter_b":"Benny no where have I said or implied \"let the floodgates open and let every single person just come on in\". If you read my 1st few words, you would see that just putting a concrete wall around the WHOLE country is not the answer. Take the opportunities away and well, you should be able derive the answer. The ones that are here, are, whether you believe it are not, contributing to society already. They cut your lawns, serve your food, make your sandwiches etc etc. Even work the farms. I am not for illegal immigration whatsoever but to say they who come over bring us problems!!...I think we have benefitted more from them than not. I am just saying not all illegal immigrants are Mexicans. As for your Chinese response, true they would love to come to America. A lot do make it here (illegally I may add). Have ...","commenter_a":"This is how people misinterpret words. Trump was talking about ILLEGAL immigrants. No offense was towards Bushs wife. Unless of course she is illegal.","post_message":"\"He’s not a stupid guy, so I don’t assume he thinks that every Mexican crossing the border is a rapist,\" Jeb Bush said of Donald J. Trump."},{"comment_id":"1516900544996637","commenter_b":"And crooked lying hellary deleted 33,000 incriminating emails. That's why 5 people were given immunity so they wouldn't be prosecuted. Now why would they need that??? Here's the definition of immunity: Law. exemption from criminal prosecution or legal liability or punishment on certain conditions. Did hellary ever find the 6 billion $$$ that has been missing while she was SOS??? It's most likely in the clintons Swiss bank account! Wake up liberals!!! @webpagelink","commenter_a":"Trump is nothing but a CRIMINAL.. A FRAUD... CON ARTIST.","post_message":"City of Phoenix to Trump: Our cops didn't endorse you."},{"comment_id":"10154840376458812","commenter_b":"Yes sir he is.... Charmayne E bradley it saddens me so much to see baby's getting killed for nothing...i will continue to pray for them u and I . I often wonder what this world would be if everybody get together and love one another and stop with all the violence n hate","commenter_a":"Lord Jesus Christ our world is in dire need of ur help Jesus Christ plz help us all this world is beginning to all apart we don't know who to trust people are turning on each other and lord we don't know why r where all this hatred is coming from plz lord take care of all of us show us to love n trust n help one another the world is big enough for us all.respect love n in god we trust.....","post_message":"Video shows Syrian girl rescued from rubble after airstrike on east Aleppo neighborhood that killed at least 23 people, including 16 members of the girl’s family, activists say. @webpagelink"},{"comment_id":"10155026953658812","commenter_b":"lol except this lady started it in 2000 so moms the stealer lol","commenter_a":"@username it's like moms!!","post_message":"“Back in 2000, I got out this plain white tablecloth and put it on the table and my teenage kids looked at me like I was crazy when I said, ‘I want you to sign this tablecloth.’ Then a few years later the [grandkids] came along and now we have 16 years of memories on the tablecloth.”"},{"comment_id":"1762539284023573","commenter_b":"Adrian Chapman, Anyone that thinks trump is a racist has their head up their ass. Do you even know what the definition of racism is? Illegal immigrants are not a race. Stopping the flow of terrorism from Muslim dominate countries is a precaution to stop terrorism. Not all Muslims are terrorist but terrorist come from Muslim nations. Common sense not racism.","commenter_a":"How many TRUMP SUPPORTERS do you see on national news blocking highways, trying to stop other candidate's supporters legal right to rally.","post_message":"15-year-old groped and pepper sprayed at Trump rally"},{"comment_id":"2004741493095269","commenter_b":"Because he does suck dick","commenter_a":"Why does he always look like he is about to suck a small dick?","post_message":"What an idiot."}]
