[{"comment_id":"10153180567873690","commenter_b":"its for this reason lisa muslims want to have it all they fight amongst each other blame the west and on top of it want sympathy from westerners as you said americans fought to be where america is today we still struggle with our own issues but theres a constant progression all be it slow .. why is it that muslims are dying to come here ? why cant they look around at the state of their people and see its something wrong with their way of life ? why is the rest of the world capable of governing their own but arab leaders oppress and steal from their citizens speak to arabs off record they all say they hate arabs and wish they werent arab .. very telling .","commenter_a":"my favorite is when muslims say 1400 years ago christians did this or that f off! the world has moved on everyone except muslims. ha and ohh in the time of muhammed this or that again f off that was 3500 years ago not relevant .","post_message":"Opinion: The religious identity of violent perpetrators is only highlighted when they're Muslim. @webpagelink"},{"comment_id":"10153992040756336","commenter_b":"This is a must read. I copied it from a post. These are things you need to know about Islam and Muslims. Allah IS NOT the same God who is worshiped by Jews and Christians. Allah is no more a God than the Golden calf of Egypt. Allah predates Islam by over a thousand years, and was a minor deity in the Temple of Baal, the Canaanite Sun God, who was worshiped throughout the Middle East. Baal (ba'al) was an ancient Canaanite and Mesopotamian deity associated with agriculture. He was believed to be the \"giver of life\" and mankind was dependent upon him for providing what was necessary to sustain the farms, flocks and herds. Allah was the moon god who's sign was the crescent moon. Mohammad, born 570 years after the Birth of Christ, was very familiar with Judaism and Christianity and stole traditions from both religions to create ...","commenter_a":"Why does Christianity need protecting? It is the dominate religion and is afforded special privileges. Christians are just upset that they don't have the right anymore to force their beliefs on others.","post_message":"Donald J. Trump spoke about protecting Christianity during a speech at Liberty University today. @webpagelink"},{"comment_id":"1538102683151787","commenter_b":"What a bitch","commenter_a":"That was totally uncalled for she was just trying to start trouble!","post_message":"RACIST: Welfare Queen Attacks Man For Being White, Watch What Happens Next [VIDEO]  Racebaiters will never say anything about this.  What would you do in this situation?"},{"comment_id":"1736517199968208","commenter_b":"go figure a REAL SHARK swimming the the ocean trying to grab a yummy meal.....SFPeopls","commenter_a":"Oh please! 1,000,000+ to 1 he'd do anything. If he wanted to harm them...he could have done it in seconds. Relax!","post_message":"Terrifying video shows a shark swimming metres away from people at Hollywood Beach in Florida, prompting people to flee to safety.   Credit: Caters TV"},{"comment_id":"1141996625817686","commenter_b":"Just jealious she can kick your butt","commenter_a":"The. \" Token Brunette \" on Fair and Balanced \" comedy show !","post_message":""},{"comment_id":"10153188549718812","commenter_b":"Why don't they beat men cuz the guy cant","commenter_a":"Good","post_message":"JUST IN: NASCAR says driver Kurt Busch has been suspended indefinitely: @webpagelink"},{"comment_id":"10154692047301037","commenter_b":"Guess she can dress anyway she wants. Is that a big deal?????","commenter_a":"Hillary is on heroin!She wears long sleeves always even when its 95° out.And she fell out at the 9/11 memorial. And she'd have to be on heroin to put a U.S.Ambassador in a war zone with a couple of bodyguards. The last one he may have had some info that could get her convicted and that was a way to off him.","post_message":"“He has delusions—I’m not talking about being crazy, but for example when he told everybody he was very smart not to pay taxes, then denied he said it in front of a hundred million people.”"}]
