[{"comment_id":"1322268537812600","commenter_b":"Hillary is NOT going to like her karma.","commenter_a":"Plane will be landing in Ecuador with pallets off fresh untraceable cash very soon....","post_message":"Smells like OBAMA....!  Details:  @webpagelink"},{"comment_id":"943876645729114","commenter_b":"Put her as a no fly list and jail","commenter_a":"🖕🏿","post_message":"When this Black Lives Matter entitled brat threw a fit on an American Airlines flight after not getting her way she started up the accusations of racism immediately.   'LIKE' if you think this race-baiting BLM supporter got what she deserved."},{"comment_id":"10153588995871943","commenter_b":"With her I the White House nothing will change. Don't forget we will get a sexual predator along with her. What a deal.","commenter_a":"I WANT TO KNOW WHY - OUR PEOPLE WERE ABANDONED?!!! Just like Clinton's hubby refused adequate forces for BlackHawk Down - I'll NEVER get the images of OUR PEOPLE BEING DRAGGED THROUGH THE STREETS.....NEVER. That's the REAL RECRUITING Message: \"America is WEAK!!!\"","post_message":" Obama administration and Clinton officials hid this compelling Benghazi email for years, said Judicial Watch President Tom Fitton.   The email makes readily apparent that the military was prepared to launch immediate assistance. The fact that the Obama administration withheld this email for so long only worsens the scandal of Benghazi. Please SHARE!"},{"comment_id":"10154571318628797","commenter_b":"Build The Wall","commenter_a":"She could have easily just left..but she didn't so who's fault is that?","post_message":"DENTAL DEATH: April went to the dentist to have a procedure and she was understandably nervous about it. After it was over, April collapsed and died in the parking lot. Now her family wants to know why the dentist went through with the procedure despite warning signs."},{"comment_id":"1135446926503853","commenter_b":"And own the chef world John peck !! You're gonna kill it !!","commenter_a":"So those aren't His arms ?","post_message":"BEAUTIFUL: Former Marine sergeant John Peck lost his legs and arms when he stepped on a homemade bomb in Afghanistan.  Thanks to a double arm transplant, Peck says the best thing about having arms again is that he can hold his fiancee's hand and become a chef.  PHOTO: Brigham and Women's Hospital MORE: @webpagelink"},{"comment_id":"10154542886848984","commenter_b":"And Whoopie Goldberg and all those cackling The View women!!! BYE FLEICIA!!! Lol","commenter_a":"Gotta go with Ted on this one, but he left off Kanye West off his list. Maybe when West leaves the country, he'll take the Kardoucheians with him.","post_message":"Rock legend and conservative firebrand Ted Nugent has released his 20 reasons to vote for Donald J. Trump, and they've gone viral. No wonder. Look at what he's saying here.  Finally someone will tell the blunt truth about Trump versus the establishment. You've gotta love this!"},{"comment_id":"921197848005881","commenter_b":"Good Luck ! KILLARY sold out America to the highest bidders..several Muslim countries, big businesses, private persons gave millions to the made-up Clinton \"Foundation\". The Clintons PRIVATE SLUSH FUND. Only 10% is donated. KILLARY then sold 20% of America's uranium to Russia. OBUMMER Paid 400 Million to Iran in foreign currency , cash. That's not mentioning all the lies that has been told to the AMERICAN PEOPLE. The Democratic Party is now just socialists, communists. All of you need to see Clinton Cash. Many of top government positions or Muslims. If Hillary is the next POTUS, she'll be sending all of us a prayer rug, burqa's & hijab's for you female family members...now I expect you to call me a racist (against muslims) & bigot as that what you call anyone that disagrees..Pity for us all! 🇺🇸❤️🇺🇸❤️🇺🇸❤️","commenter_a":"With all the facts about this man being super unfit, I don't see how people still stand behind him. I guess they have no concerns for our future and the future of our children. If he gets elected I hope someone assassinate him.","post_message":"LOL! Spot on!  Made by Walt Handelsman, go give him a LIKE! Shared by Occupy Democrats."}]
