[{"comment_id":"10152685223867894","commenter_b":"That Bitch Messy Asl !!","commenter_a":"Tameka Lovinglife Mccraney These Celebrity Couples And Exes Are So Messy Lol","post_message":"Naya Rivera Announces Her Pregnancy on the Same Day as Big Sean's Album Release [Photos]"},{"comment_id":"1555989074419098","commenter_b":"We'd have have a democracy in the first place to lose. Seem that ideal is long gone","commenter_a":"This is a response to the hard tack to the left by progressives. This is the fruit of your insane policies and social engineering. You have created the potential for an authoritarian American government. It won't happen instantly, but in increments. I have to admit, I prefer this future to a nation that celebrates stomping upon our flag, allowing veterans to die waiting for medical treatment in favor of allotting medical benefits to illegal aliens, and referring to children as purple penguins.","post_message":"The frightening rise of authoritarian populism in the West is a very real, clear and present danger, writes Mike Lofgren, a former congressional staff member."},{"comment_id":"10155015963219199","commenter_b":"Always use condoms jeez you never know who has it.","commenter_a":"This senseless act could have been avoided if we would have banned all Mustangs after the first Mustang ran into a crowd.","post_message":"Surveillance video shows a man on a bicycle in the Phoenix area being run down by a Ford Mustang."},{"comment_id":"1362411960521719","commenter_b":"@username Oh snap, you go mean girl. Can I sit next to you in the cafeteria? I didn't vote for the Orange white trash. but carry on with your brilliant repartee. I'm so put in my place. Yawn, on to the next idiot.","commenter_a":"Well, it's what I always say, \"if everybody says it, it must be wrong.\" The only thing wrong with @username is they are PH.D. reporting to a Honey Boo Boo and Duck Dynasty population. We are a white trash nation, of course nobody watches.","post_message":"Would launching a trade war with China help \"make America great again\"?"},{"comment_id":"753100741547170","commenter_b":"That whore cares so much about the us she built a school in Africa!!!!","commenter_a":"Fuck that","post_message":"Obama Wants To Put Oprah Winfrey’s Face On The New Dollar Bill.  This is ridiculous. Leave the dollar alone.  Do you think they should get the dollar bill as it is?"},{"comment_id":"10153655296938854","commenter_b":"Kerry is no better than anyone else, if he was involved...Then buddyboy...fess up. This whole situation is starting to smell like Watergate. Where's Woodward and Bernstein...Let them have a crack at it!!! Somebody needs to tell Trey Howdy you have full reign, do whatever you need to do, just get to the bottom of this!! And I'll bet you BARACK OBAMA'S NAME is all over it, just like Richard Nixon's was in Watergate. The major difference between the two is that PEOPLE DIED IN BENGHAZI. And just to show the impertinence of Hillary when she said, \"What difference does it make now?!!\" The difference is you Communist is that AMERICANS DIED YOU HEARTLESS WITCH!!","commenter_a":"Elijah Cummings is one of the dumbest mf'rs on this planet....voted for by a large number of even dumber mf'rs in his illegally gerrymandered district. He is so stupid, that he has no business in congress, and along with the rest of the liberals in Congress and the white house, he should be swinging at the end of a rope. He knows what he's done....we know what he's done.....","post_message":"Elijah Cummings: “Shockingly Disrespectful” To Subpoena John Kerry About Benghazi…"},{"comment_id":"1000192243373586","commenter_b":"The little bitch should serve time.","commenter_a":"It's not white privilege. It's called \"daddy is connected\". Still doesn't make it right","post_message":"This girl had so many drugs that her sentence should be more than 200 years -- read on to find out what she's going to actually get."}]
