[{"comment_id":"10153477334723984","commenter_b":"She doesn't care , she just wants the money,","commenter_a":"Go die you ugly whore what a fucken disgrace","post_message":"Pop star Miley Cyrus just said something highly disturbing about Christians. It's especially sad when you consider where she came from..."},{"comment_id":"1130900020321866","commenter_b":"@username, it's a meme, I'm not a cop. Ignorant women these days, geez.","commenter_a":"I don't see a problem. Carson is honest and leaves room for error. The ONLY perfect man was crucified. Trump/Carson. Make America Great Again","post_message":"Dr. Ben Carson just made an absolutely stunning statement about Donald J. Trump.  What Carson said has some asking if he's really on Trump's side at all.  NOBODY saw this coming..."},{"comment_id":"10153194834046717","commenter_b":"Fuck you bitch","commenter_a":"Many Jamaicans are F'd up; bleaching, trickery, conning, God awful people!!","post_message":""},{"comment_id":"651012365080931","commenter_b":"The most Corrupt Woman in the world","commenter_a":"SEE YOU IN PRISON SOON HILLARY = JAIL TIME FOR #YOU !!","post_message":"La decisión que tomemos en cuatro días tendrá un efecto en nuestro país por décadas. hillaryclinton.com/planparavotar  Comparte esto si estás de acuerdo:"},{"comment_id":"731938580238084","commenter_b":"We need to look at all facts here. It looks like the victim went looking for trouble. YOU DON'T ASK YOUR SON TO GO GET THIS GUN! I have a feeling she could have been alive today if she had acted like a responsible adult and called the police if he had threatened her. Also, if she was the victim of a gun fight which she started. I WOULD JUST CALL THIS SAD! SAD SHE DID NOT HAVE BETTER SENSE AND LESS ANGER!","commenter_a":"WaaaWaaaa!!!!","post_message":"He suffered a severe head injury, records show."},{"comment_id":"1300733136636619","commenter_b":"Crooked Hilary!! She lose everything ad her life evil woman!","commenter_a":"The Clintons are Milliinaires who t.Trump values over his loser voters","post_message":"They illegally set up a charity to line their pockets for foreign influence...most countries call that treason."},{"comment_id":"10157328778620354","commenter_b":"Kimberly Dawn Horvath Mullins , most Muslim immigrants are actually highly educated doctors, lawyers, computer engineers. Kimberly, you're just a mailman right? Soon you'll be replaced by a drone LMAO, and go back to your trailer living off welfare again LMAO.","commenter_a":"Still waiting for some idiot liberal to explain to me how importing hordes of stinking uneducated radical muslim savages is good for America. Other than dumbass mouthpiecees spouting the usual \"that's not who we are\" bullshit.","post_message":"\"How did we get in the position where we’re screwed if we’re not in the good graces of the Muslim community? Maybe we should stop doing that.\""}]
