[{"comment_id":"10154274724531320","commenter_b":"Let us see the lady you're talking to.","commenter_a":"Where is Greg?","post_message":"Good Day After Show!"},{"comment_id":"10153431181609497","commenter_b":"Get rid of her for your own future. You can never be president if you only eat pizza.","commenter_a":"Dad's girlfriend orders pizza every night.","post_message":"\"One time, she even let us get cheesy bread and watch an R-rated movie.\""},{"comment_id":"10153148300259575","commenter_b":"You certainly are. \"Judge and be judged\" Crystal. I PROMISE you God is watching your actions as much as he's watching mine. Typing \" under a homosexuals death does not, in fact, secure your ticket to heaven babes.","commenter_a":"Let's see if she can have god change his mind","post_message":"A terminally ill woman whose desire to have her same-sex marriage recognized by Indiana before she died helped galvanize efforts to overturn the state’s gay marriage ban has lost her battle with cancer.  Niki Quasney died Thursday, gay rights advocacy group Lambda Legal said Sunday. She was 38."},{"comment_id":"1386005081478024","commenter_b":"Thank God! We are the voice of this babies.","commenter_a":"So let me get this straight.. These wingnut lefty/leberial woman who are marching all over today are really attempting to fight over their treasured planned parenthood. They want to keep the free goverment \"healthcare\" for women. Correct me if I'm wrong but, isn't their local welfare office giving out medical cards to cover 100% of their \"healthcare\" needs?? Oh wait, this is primarily an adult sized temper tantrum because they want the right to abort babies. PLAIN AND SIMPLE. Can't wait for Trump to sign the bill for defunding😡🇺🇸","post_message":"Baby-killing organizations that have been using government money to fund their sick, worldwide abortion agenda just got some seriously bad news... here's what Donald J. Trump just did to send them into total panic.  A lot of liberals are going to be furious about this... what do you think?"},{"comment_id":"1538992396141613","commenter_b":"Are these women able to drive their car alone?","commenter_a":"Sorry, I may sound ignorant of the culture, but these women appear to be upper class, mostly because they speak English well, they are educated. I wonder what life is like for poor Muslim women, if their freedoms are the same?","post_message":"These Muslim women are calling out stereotypes, throwing out labels, and asking others to see them as people first and foremost. (via Bustle with more info at u.pw/1qv4Eb0)"},{"comment_id":"527974647394206","commenter_b":"It is not the gun! It is the government's purposeful lack of enforcing the gun laws that we already have, allowing criminals and drugs to pour into this country, no border protection, telling people to rise up and kill cops, stop that, then you will see these horrific murders stop. Wake the frig up.","commenter_a":"They are banned and have been for many years","post_message":"The shooter in Orlando used an AR-15, the same semi-automatic assault rifle used in Newtown and Aurora. There is no constitutional right to easily slaughter 50 people. End of discussion.  Image by Occupy Democrats, like our page for more."},{"comment_id":"10152578505267217","commenter_b":"Can't stand the woman!","commenter_a":"Congrats Serena","post_message":"Serena Williams  jumped for joy on winning the Australian Open and her 19th Grand Slam."}]
