[{"comment_id":"1056082027782443","commenter_b":"She needs to speak for herself. Some of us still clean our own houses.","commenter_a":"Well it's probably good she is his ex wife lol","post_message":"Donald J. Trump's ex-wife spoke out in support of the GOP candidate and the need for legal immigrants."},{"comment_id":"1850656938526347","commenter_b":"Good put her away . Let her spend her millions on appeals .","commenter_a":"They should!!!!!","post_message":"My, my, my..."},{"comment_id":"10153751767926135","commenter_b":"Burn that bitch.","commenter_a":"Obama will appoint her a Czar!","post_message":"She's accused of stealing to pay for expensive cars, a motorhome and even vacations."},{"comment_id":"1309116862459880","commenter_b":"Now if they can do something about her mouth....","commenter_a":"Seeing as she is costing taxpayers tons of $$$ for her moronish actions maybe a class action suit should be filed against her for $100M","post_message":"Just in!!"},{"comment_id":"457572411058203","commenter_b":"I hate that vile bitch. Dumbest wokman on the planet.","commenter_a":"Sarah and her offspring are all a blight on humanity and whatnot, but the dog doesn't seem bothered. That said I still wouldn't stand on a dog..","post_message":"Just when you thought Sarah Palin couldn't sink any lower, this happens. If this woman can't teach her own kids to have respect for animals, she has no business even thinking about running for anything in 2016.  ~Darrell"},{"comment_id":"1410976518925134","commenter_b":"like dying in the sea coming from Europe to steal Mexican and Native American land?","commenter_a":"I wish people would realize this is actually happening and innocent people are losing their lives! of course under ignorant trump supporters everyone is Mexican","post_message":"Donald J. Trump is already deporting people to Mexico  even if they're not Mexican."},{"comment_id":"496037443910043","commenter_b":"MR TRUMP WHEN YOU BECOME PREZ> HANG A FEW DRUG DEALERS ON COURT SQUARE THEN THEY WOULD THINK TWICE ABOUT SELLING DRUGS TO YOUNG CHILDREN AND DESTROYING ENTIRE FAMILIES!!!!!!!!","commenter_a":"Get them out!!!!!!!!!!!!!!","post_message":"Drug dealers are pouring in from the southern border. We will build a wall on time and on budget. #GOPDebate"}]
