[{"comment_id":"1385223764854222","commenter_b":"Drive through these bloody pests.","commenter_a":"drag them off tie them up off the road direct traffic tho. Looking at the photo take to the right hand cuff or tie to the guard rail.","post_message":""},{"comment_id":"1332532336775650","commenter_b":"Trump \"Hillary is a Bigot\" there you go! This is exactly where this phrase came from~ the Pot Calling the Kettle Black. Okay you Mexicans can stay in the US , But must pay, I will Not build the Wall, Mexico will not have to pay for it , I Love the Mexicans, my African Americans, Muslims and attractive women... I was only Joking, being sarcastic, just a suggestion. I love Rachel Maddow! ha","commenter_a":"I think it is hilarious the Trump supporters come to a Hillary site and post their idiotic remarks. Like their posts have any meaning or validity. It's not like they are going to have any affect on changing Hillary supporters minds.,","post_message":"8 things you can do *today* to help elect Hillary: hrc.io/2bQizDc"},{"comment_id":"10153246796329607","commenter_b":"Stop them now!!!","commenter_a":"Yes","post_message":"QUESTION OF THE DAY:   Should the U.S. stop accepting Syrian refugees? #FOX45QOD"},{"comment_id":"1174759955897808","commenter_b":"And assholes will be assholes!","commenter_a":"They are F'n PIGS... We learned that in the sixties... How soon the ignorant forget. PIGS BE PIGS... NOTHING HAS CHANGED","post_message":"We FINALLY have the proof!"},{"comment_id":"760301420735133","commenter_b":"She should be Punished!","commenter_a":"Smh so much attention on my comment i got exactly what i was looking for... #Exposed","post_message":"Terrible."},{"comment_id":"1316522848388184","commenter_b":"Trust me, women punish themselves way more than is good for them.","commenter_a":"He makes no sense why this man Willi never be president we heard what u said","post_message":"Trump manages to offend women in a completely new way."},{"comment_id":"946243322102083","commenter_b":"Vote UKIP","commenter_a":"And who listyens to this moron?","post_message":"Russell Brand who called voting 'a massive waste of time' no U-turns and says: 'Vote Labour'"}]
