[{"comment_id":"10154129877777377","commenter_b":"I hope this woman lives in Fear for quite awhile.","commenter_a":"I am not a Trump fan by any means, and both the Obama and Bush daughters had their fair share of bashing on social media, but this crossed the line.","post_message":"Katie Rich has been suspended indefinitely from her job as a writer on NBC's \"Saturday Night Live\" after making a tweet about Donald Trump's 10-year-old son, Barron, the Chicago Sun-Times reports."},{"comment_id":"10153755826404062","commenter_b":"Shut up racist b*tch","commenter_a":"He is not the president and she is not the first lady he is Mr George Bush and his mama, I mean his wife, since you Obama haters want to go there!","post_message":"Give a big howdy to President George H.W. Bush and wife Barbara, who are out enjoying RodeoHouston today! :)  Photo: RodeoHouston  RodeoHouston news: @webpagelink"},{"comment_id":"10155491748590354","commenter_b":"Karma catching up with this Idiot, good !!!!!!!!!!!!!!","commenter_a":"she must be taking lessons from sharpton","post_message":"Pro tip: when bashing others to pay their \"fair share\" in taxes, it might be wise to do so yourself."},{"comment_id":"1145710305499191","commenter_b":"Women are insane! All of them!","commenter_a":"Omg Daniel Melchior","post_message":"This woman has said her ex-fiance hit her, causing a black eye and other injuries. But now his attorney says this home surveillance video tells a different story.  STORY: fox32chicago.com/news/@username-story"},{"comment_id":"917056878424478","commenter_b":"#fuckhillary she and the DNC planted this upon us","commenter_a":"#fucktrump","post_message":"Friday, January 20, 2017: Presidential Inauguration of Donald Trump & Mike Pence - LIVE on C-SPAN, C-SPAN Radio & @webpagelink"},{"comment_id":"1033066763409083","commenter_b":"Maybe we could stop the flow of heroin coming into the U.S.","commenter_a":"To associate with Hillary Clinton, you are an EMBARRASSMENT to the residents of VA and to the military who live and serve here!! DISGUSTING!!","post_message":"I’ve seen firsthand how significant an impact the opioid and heroin abuse epidemic is having on communities and families in Virginia. More Virginians now die from these overdoses than car accidents, and law enforcement currently lacks the tools to save more lives. I’m pleased the just passed Comprehensive Addiction and Recovery Act (CARA) will encourage co-prescribing of naloxone – a life-saving drug – alongside opioid prescriptions and also implements a measure to protect the elderly from medication abuse. I worked with a bipartisan group of colleagues to draft and introduce these provisions. Lastly, while I am pleased Congress was able to work in a bipartisan way to address this crisis, we should keep working to provide emergency funding that is critically needed for state substance abuse programs, law enforcement, treatment and other priorities authorized in this bill."},{"comment_id":"10152578499710950","commenter_b":"Sore ass losers.","commenter_a":"Redonkulous !!!","post_message":"\"Uh, excuse me?\"  LISTEN: Reporters ask New England Patriots coach Bill Belichick about \"Deflate-Gate,\" and he is not amused: @webpagelink"}]
