[{"comment_id":"10154165020726943","commenter_b":"Hillary, you look really tired. Even with all that makeup on. Just think how tired and hot you'd be if you were in Louisiana now like Donald Trump. Think how tired you would be if you had his schedule. Think how exhausted you would be trying to be President every single day. Please just give up now. With all your money, wouldn't it be nice to just stay home and spend time with your grandchildren?","commenter_a":"keep up the good work","post_message":"A federal judge in Washington, D.C. ruled Friday that Hillary Clinton must answer written questions from a group that filed a lawsuit over her private email server.  Lawyers for Judicial Watch, a conservative government watchdog organization, asked to interview her under oath as part of their Freedom of Information Act lawsuit against the State Department. - via NBC News"},{"comment_id":"10154356855773256","commenter_b":"She's an idiot","commenter_a":"She copied a kiwi who did this. Lame","post_message":"If others have the right to have their opinions of the divine reflected in their driver's license photos, then so should members of the Church of the Flying Spaghetti Monster."},{"comment_id":"1155965127752480","commenter_b":"I made the same point on a post on face book and was told I was comparing apples to oranges. P","commenter_a":"Cecil the Lion was made up of \"clumps of cells\"...WTH. Clumps of cells are ALIVE! All those dunderheads seem to forget that THEY were clumps of cells at one time too!","post_message":"I am one of the people being pilloried, by the way, in elements of the Drive-By Media for daring to compare Planned Parenthood to Cecil the Lion.  People on the left who are overly concerned with Cecil the Lion say they are offended that they are being accused of caring more about animals than they are about \"clumps of cells.\""},{"comment_id":"10153318704229614","commenter_b":"This is why women live longer than men..","commenter_a":"The stupidity is strong with this one","post_message":"A shirtless man got himself into quite a predicament after climbing up a basketball hoop in Seattle and somehow managing to get stuck upside down.   Hanging by a foot, the man flailed and thrashed about while officers tried to figure out how to get him down.    Eventually, a couple of firefighters came in with a ladder, cut the net down and rescued him.   \"He may be arrested for property destruction, or at least goal-tending,\" the Seattle Police Department tweeted on Friday.   Read KTLA's story here: @webpagelink"},{"comment_id":"587553231404572","commenter_b":"Obama is putting up a higher fence around the white house this summer because people keep climbing it!!!! what about our borders?? WE NEED A WALL!!! WE NEED DONALD TRUMP NOW...","commenter_a":"You don't need a political decoder ring to understand Donald Trump he's a straight talker who speaks from the heart who's the only true outsider funding his own campaign and he's set the agenda on everything that matters. Indiana show your support and get out and vote Donald Trump for the republican nominee. If your standing with Trump your standing FOR America! TRUMP NATION 2016! # never lyin ted!","post_message":"I will not let you down. Lets MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1767802863447868","commenter_b":"Dirty old lady","commenter_a":"So, Madonna sexually assaults a minor, but it's all good because she's a female. Yay equality. #BecauseFeminism","post_message":"“Seriously, why would I sue Madonna for the best moment of my life?”"},{"comment_id":"10154466806054087","commenter_b":"Never heard of the cunt, what's his legacy (kissin obamas arse for the last 8 yrs","commenter_a":"That stupid ass gave one to Helen Degenerious ,she does help poor,but I think Hillary paid her millions to be on her show.","post_message":"President Obama awards VP Joe Biden the Presidential Medial of Freedom. (Photo: NICHOLAS KAMM/AFP/Getty Images). READ MORE: @webpagelink"}]
