[{"comment_id":"866555523379870","commenter_b":"She is a disgrace can u imagine Laura Bush or Jackie Kennedy doing this ?","commenter_a":"We sure never seen Jackie Kennedy doing something like this. She had class","post_message":"No. Class.   Spread the word."},{"comment_id":"10153370779851094","commenter_b":"The key attraction is hate and greed from the 1%ers and the few others who will complain we made a mistake were on rationing due to war in Syria Making America Great the trump way hahahah!","commenter_a":"People love to be dominated and abused.","post_message":"Is Donald Trump's candidacy a short-term spectacle or a national nightmare in the making? Mark Karlin discusses the dangers of writing off the billionaire's current electoral efforts."},{"comment_id":"1316090455150672","commenter_b":"Swamp monsters","commenter_a":"tells you a lot about this so called president","post_message":"Truly deplorable.  Thanks to 1533 Days."},{"comment_id":"10153131425722293","commenter_b":"They are our imagine of the \"freedom\" .","commenter_a":"Yes.","post_message":"Experts fear a whole slew of risks that may follow should these tribes come into full contact with the outside world."},{"comment_id":"10155382822311729","commenter_b":"Dumb ass","commenter_a":"What legacy?? Racial divide war on our police officers open our boarders to ever illegal and terrorist trillions of dollars in debt millions on vacations for him and his family no decent jobs no affordable healthcare despicable treatment of our military and veterans... shall I continue I say good riddance finally this country is going to get a leader who's for American and its people we have hope finally","post_message":"Yes."},{"comment_id":"1191417507545813","commenter_b":"HELL, IF THESE PEOPLE WORKED AT A JOB AS HARD AS THEY DO PROTESTING THIS STUPID CRAP, THEY WOULD HAVE PLENTY OF MONEY !!!!!!!!!!!","commenter_a":"So the dems want to shut down Graceland via their personal propaganda terrorist cult Black Lives Matter AND they want to label WikiLeaks a terrorist organization and have put a DEAD OR ALIVE bounty on Julian Assange. These ARE troubling times. I can't believe they think the American people are that stupid. Enough is enough. Stop with the violence and let us now hear what the Clinton camp thought should be deleted. (Despite the State Dept. request for ALL email on server) I think at the end of the day people of all colors and beliefs in America will find they thought we were all stupid enough for them to screw all of us. We really all need to stick together. Unity matters now. #HumanLivesMatter #AllLifeMatters #TruthMatters Now let THAT sink in.","post_message":"Leaders of the protest say they chose Graceland because \"it demonstrates one of Memphis's most common forms of financial inequality and because the site has ties to ... the death of unarmed teen Darrius Stewart.\""},{"comment_id":"10155561062180389","commenter_b":"She should be in prison !!!!!","commenter_a":"She plays the game , professionally ! I simply am astounded at America, Congress, and all the the subterfuge !","post_message":"Question of the Day: Does Hillary Clinton owe the American people an explanation about these new allegations?"}]
