[{"comment_id":"421180878069520","commenter_b":"^^ this idiot supports sanctuary cities and providing safe harbor to illegal alien criminals","commenter_a":"Hillary belongs in prison.","post_message":"More than $400 million has poured into the presidential race so far."},{"comment_id":"10156505662180354","commenter_b":"Give the stupid bitch the boot for good. Free her up so she can go over the Syria and suck up to those murdering rag heads.","commenter_a":"GOOD! This \"professor\" NEEDED to be fired!","post_message":"Read the Christian college's powerful statement..."},{"comment_id":"1746704652254245","commenter_b":"Wow really Michelle Pugh, you put yourself in that situation for sleeping with her father\" a married man: but you won't tolerate public shaming Really looks like an excuse to try to squeeze money out of someone which is his daughter SMH say;s a whole lot of type person you are!!!!!!!!! No class!!!!!!!!!!!!!!!!!!!!","commenter_a":"Nasty is all I can say","post_message":"Michelle Pugh's life has changed dramatically in the short few months since her four-year affair with Ozzy Osbourne was revealed."},{"comment_id":"543491929108734","commenter_b":"Good, send her to prison then send her to Isis!","commenter_a":"She should be jailed for life.","post_message":"For weeks, this Muslim woman sat behind her computer spreading hate and threatening the 'infidels'. She thought she was going to get away with it, then she heard a knock at the door."},{"comment_id":"10150864251334999","commenter_b":"He will blame the baby","commenter_a":"He will either win, or drop out so he can always claim he would have won otherwise. If he does stay till then end, and doesn't win, the reaction will look like this: 1. Demand a recount 2. Blame it on voters who didn't want to make America great again. 3. Complain that the GOP is at fault for not supporting him enough. 4. Blame his VP. 5. Demand to see Hillary's birth certificate","post_message":"The latest guessing game is whether Donald J. Trump will drop out of the presidential race before Election Day."},{"comment_id":"10153662067420950","commenter_b":"Teresa you need a big fat,one stuck in your mouth so you can't talk but choke","commenter_a":"Trump's mouth is actually helping to elect Democrats in November. I wonder how many Republican leaders were meeting this morning and asking one another \"How in the hell can we shut this guy up?\"","post_message":"\"I'll say one thing about the Democratic Party,\" Trump observed. \"At least they stick together.\""},{"comment_id":"1058315940902294","commenter_b":"Stupid white girl","commenter_a":"Dr. Cornel West is as arrogant and blind as Bernie. Blaming good Democrats for not getting things done and ignoring Republican majorities blocking them. They don't help. They just \"manage\" from the side lines. Bernie at least has worked some in legislation, but not as hard or as successfully as Hillary. Dr. West has done nothing put complain that people who are doing the heavy lifting are not working hard enough.","post_message":"What do you think about his choices?"}]
