[{"comment_id":"10153460799391130","commenter_b":"When bitch steals ur face 😠","commenter_a":"Alyse Kozis @username - she makes one of your faces Karlie 😂😂","post_message":"Instagram's @Daddyissues_ hilariously meme-ifies herself."},{"comment_id":"10153470149826234","commenter_b":"By a lot !!","commenter_a":"Amy check out HR. Looks like you got low balled","post_message":"Nice work, if you can get it."},{"comment_id":"1815699362041993","commenter_b":"Can't stand that wretched woman","commenter_a":"I was gonna click for sound but then I saw a clip of Tomi Lahren pop up and thank god I dodged that bullet #iamsaved #toliveanotherday","post_message":"Republicans think protesters should just get over it and accept the results of the election just like they did when Obama won in 2008 and 2012  Oh wait..."},{"comment_id":"10158282673955294","commenter_b":"Today????????","commenter_a":"Does this mean Chris Jericho, aka Y2J, has been signed to a lifetime contract with WWE? If not, they're stupid idiots!","post_message":"A group of scientists have moved the \"Doomsday Clock,\" a symbolic countdown to the end of the world, to two and a half minutes to midnight."},{"comment_id":"10153721482309641","commenter_b":"Rap Artists RToy : Here it is the good part of Qur'an 5: 32 Qur: Whoever kills an innocent person it is as if he has killed all of humanity","commenter_a":"Quran (5:33) - \"The punishment of those who wage war against Allah and His messenger and strive to make mischief in the land is only this, that they should be murdered or crucified or their hands and their feet should be cut off on opposite sides or they should be imprisoned; this shall be as a disgrace for them in this world, and in the hereafter they shall have a grievous chastisement\" Quran (8:12) - \"I will cast terror into the hearts of those who disbelieve. Therefore strike off their heads and strike off every fingertip of them\" No reasonable person would interpret this to mean a spiritual struggle. Quran (8:15) - \"O ye who believe! When ye meet those who disbelieve in battle, turn not your backs to them. (16)Whoso on that day turneth his back to them, unless maneuvering for battle or intent to join a company, he ...","post_message":"\"I think he damaged all his brands in all Muslim countries.\""},{"comment_id":"10152732275938645","commenter_b":"fat a** hoe.","commenter_a":"Report me all you want trick","post_message":"The victim said the attacker threatened her during the rape, saying he knew where she lived and would return to kill her if she called the police."},{"comment_id":"10153087493924641","commenter_b":"Castration ? Wicked ladies always love that","commenter_a":"Rape cases are very high in India....those men need castration","post_message":"India has banned a controversial rape documentary. Are they protecting women or restricting free speech?"}]
