[{"comment_id":"10153738132321756","commenter_b":"Awesome. catch 'em.","commenter_a":"Loved this story today! Thank you @username! Very interesting and I can't wait to watch the documentary.","post_message":"To track the route of poached tusks, investigative journalist Bryan Christy commissioned a taxidermist to create fake ivory tusks, which he embedded with specially designed tracking devices."},{"comment_id":"657878574399677","commenter_b":"Shame should be heaped on this persons head. Open your mouth and sing HIS praises..not for Trump but to glorify His name. Shame on you lady!! :-(","commenter_a":"The member states that \"she could never throw roses to Hitler\" code for she supported Stalin 😉 she's irrelevant...","post_message":"More pre-inauguration insult and upset from progressives — 'I could never sing for him.'"},{"comment_id":"1823601691207734","commenter_b":"Share it with everyone, we must insure Hillary is not elected!","commenter_a":"\"BILL CLINTON'S LOVING WIFE --- by DICK MORRIS If you happen to see the Bill Clinton five minute TV ad for Hillary in which he introduces the commercial by saying he wants to share some things we may not know about Hillary's background, beware as I was there for most of their presidency and know them better than just about anyone. I offer a few corrections: Bill says: \"In law school Hillary worked on legal services for the poor.\" Facts are: Hillary's main extra-curricular activity in 'Law School' was helping the Black Panthers, on trial in Connecticut for torturing and killing a 'Federal Agent.' She went to Court every day as part of a Law student monitoring committee trying to spot civil rights violations and develop grounds for appeal. Bill says: \"Hillary spent a year after graduation working on a Children's rights project for poor kids.\" Facts are: Hillary interned ...","post_message":"He actually said it."},{"comment_id":"1510900072276579","commenter_b":"They hate immigrants but call themselves Europeans?! Ok then go back to Europe ya fuckin assholes.","commenter_a":"\"We as Europeans\" Sorry if you live in America and have done for generations your not Europeans, there are many non-white people who are more European than you Anyone who holds any level of feeling that they are culturally attached to every other white person on the planet in some way is just weird","post_message":"\"Hitler did nothing wrong! I feel like there are two sides.\" - Tila Tequila"},{"comment_id":"10157011618750354","commenter_b":"Would someone please tell me why these THUGS have not been arrested or gased?","commenter_a":"Dumb ass negros !","post_message":"WATCH the insane footage of the BLM radicals...  \"I will f*ck sh*t up!\""},{"comment_id":"966202806772801","commenter_b":"#dumbasses","commenter_a":"Robbie Raul Markosyan","post_message":"Kate Upton among scores taking part in #HoldACokeWithYourBoobsChallenge for breast cancer... unaware the trend ISN'T raising money"},{"comment_id":"1015238835192369","commenter_b":"Not that she's seeming to give a flying bigoted spit spatter regarding the education of people in that group however. Still a power bred over privileged crusty plantation damsel. Like seven generations later. She still wants her back washed by the maid.","commenter_a":"Batshit crazy.","post_message":"Nancy Pelosi identified what she called the \"three G's\" – reasons why white males favor Donald J. Trump over Hillary Clinton. @webpagelink"}]
