[{"comment_id":"10152526323082377","commenter_b":"Go away","commenter_a":"a gubbament BIG ENOUGH to GIVE you everything you WANT, is also BIG enough to TAKE EVERYTHING you have!! see what happens when you DONT VOTE!","post_message":"Oh Really..."},{"comment_id":"533893623467884","commenter_b":"Lol. Fuck off bitch.","commenter_a":"He has the truth. God Blessbhim.","post_message":"Obama is furious after Ted Nuget takes an epic stand against him.  He speaks the truth. Nuget needs your support.  Can we get 10,000 'LIKES' for Ted Nugent's epic stand against Obama?"},{"comment_id":"903185543037635","commenter_b":"Noooo... lol. You gals need to stop. Many African men have monster sized d****. That mess ain't fun.","commenter_a":"She's ungrateful","post_message":"Apparently, she didn't see it until after the wedding..."},{"comment_id":"807700012661940","commenter_b":"But she did. Shouldn't no one not have to go anywhere because fools can't handle their jobs.","commenter_a":"She should have never went to TX in the first place TX is not place for decent law abiding people as we see what happened to her over a signal change, TX is a rebel state always has been that way, and their federal support for programs should be stopped right away. Any kind of support needs to be stopped and let them people that love that place pay for their own social ills then see how they like that","post_message":"\"How did switching lanes turn into all of this?\""},{"comment_id":"607285086107002","commenter_b":"I didn't know the definition of feminist included wanting to have sex with your daughter. @webpagelink","commenter_a":"idc. I would still rather have him as a president than Hillary","post_message":"Trump has been accused of sexism by his critics"},{"comment_id":"10152570108341770","commenter_b":"She's not upset about the coat, it's that her father is a turd and her mother is a pig.","commenter_a":"I guess so","post_message":"What do you expect when you dress your toddler in a $3,500 fur coat, Kim Kardashian?"},{"comment_id":"858391040863023","commenter_b":"Hillary should be strapped to the front of the bus in bumper to bumper traffic.","commenter_a":"another clown to join the clown bus! Out of touch with reality","post_message":"Dr. Ben Carson is running for president. Here's where he stands on the issues..."}]
