[{"comment_id":"1263663783712155","commenter_b":"Dump her. No more talk about her.","commenter_a":"She's a slut see her tapes she delete the best ones","post_message":"The media's having a field day with Alicia Machado's attacks on Donald J. Trump.  But there's a lot in her past they won't report. And we're not talking about the sex tape everyone else is fixated with..."},{"comment_id":"10153137548926051","commenter_b":"Obviously had to have his eyes closed, or blind to begin with!!! Maybe blind and she had a sexy voice!!! NAH.... Couldn't see something this ugly having anything sexy!!!!","commenter_a":"This unfortunate woman needs anger management & some AA meetings. A bit of dental work and make-up wouldn't hurt either--She was probably brought up in poverty. sandi","post_message":"When this woman's boyfriend refused to get intimate with her, she snapped."},{"comment_id":"10153490516091337","commenter_b":"You mean unlike theAmerican Killers of babies, rapist, serial killers, the ones signing up to be terrorist! Jake you're a blinded fool!!","commenter_a":"Illegal immigrants are coming in from all over South America , through Mexico, and the Mexican government is doing nothing to prevent it. And if you people watched anything besides cnn and msnbc, you would know that a lot of them, not all, maybe not a majority, but a lot, are killers, rapists, or drug cartel agents, and since crossing our border which is leaking like a sieve have continued those harmful activities in the US. But obviously Trump is a bigot for describing what is really occurring. The fact is he is one of the few candidates who has described a coherent plan for what he would do as president, and been more open to the media by far in the short time since announcing his candidacy than Hillary ever has. I hope he blasts her back into the Stone Age in the general election if he wins the ...","post_message":"\"It’s not Mexicans necessarily. They’re coming from all over.\"  2016 GOP presidential candidate Donald J. Trump talked about \"killers\" and \"rapists\" again..."},{"comment_id":"475027816013769","commenter_b":"Guess she is a shameful person.","commenter_a":"Remember, she was also \"ashamed\" that Bush was from Texas","post_message":"Dixie Chicks member Natalie Maines also took aim at Donald J. Trump, tweeting, \"As long as Donald Trump's decisions for America are as solid as his decision about his hair, we're in good shape.\""},{"comment_id":"10155086794306729","commenter_b":"What did she care....that bitch was in it for the money.","commenter_a":"Pantsuit Nazi...","post_message":"Wow... Help spread the word folks!"},{"comment_id":"1772923492974110","commenter_b":"@username .. Tippu tip, one of the greatest slave traders known to man that had over 10,000 slaves in Zanzibar, grandmother was a muslim slave. The problem with islam is the contradictions. You inherit the greatness of your lineage as well as all of the ills. The first step for Muslims to get passed this & be accepted in the international community is to accept the past for what it is & stop lying, deflecting, & manipulating it. It only creates more RAGE! Everything in this video is FACT and supported with 100's of years of abundant evidence. This video is actually a low ball. The actual number of victims of islamic genocide s 100 - 150 million deaths. Please stop telling me about \"bilal\" that was a slave in the first place by an arab. Abu bakr freed 3 personal pagan slaves for bilal's emancipation. Am I suppose to ...","commenter_a":"This is the blind teaching the blind. A ratings based media hub focusing on the impulses of the ignorant. This is not accurate about Muslims and therefore makes it inaccurate of Arabs. All Arabs aren't white. There was a black Arab named TIPPU TIP, he was one of the biggest contributers to slavery. He was very black. Look him up. Also, a Arab can't teach islam. Because Islam isn't synonymous with Arabs, it's more wide spread with Asians. Indonesia is the largest population of Muslims. All Arabs aren't muslim. And there were many Arabs who rejected Prophet Muhammed. I love history but I hate when people try to each topics of sensitive topics but pose a biased view. Black people must realize we are not all the same. Americans aren't the same a all Africans. We know why we're African, but most don't know we're more American than the white ...","post_message":"10 Facts About The Arab Enslavement Of Black People Not Taught In Schools"},{"comment_id":"844804189043491","commenter_b":"Bye bye bitch","commenter_a":"never did like the ugly bitch","post_message":"Liberal trash has no place on tv. This is the best news all year. Do you think Whoopi deserves to be kicked off the air?"}]
