[{"comment_id":"1301607906602125","commenter_b":"sharon when and if hillar y gets on i hope she puts the syrian refugees near u look what happened in europe well maybe u can get 1st taste of the syrian refugees in ur neighborhood","commenter_a":"Trump totally blew that first questions......He's the greatest at deflection.....LOL.......all he can say is we got to stop the jobs from leaving.","post_message":"WATCH LIVE: Hillary Clinton and Donald J. Trump square off in their first debate."},{"comment_id":"797236390409541","commenter_b":"Stfu no one wants to hear your mouth.","commenter_a":"Donald Trump is a BIG Government Authoritarian and progressive fraud from New York City He's NEVER been a conservative, and he NEVER will be conservative -- he's an actor, a phony, pretending to be what he's not.","post_message":"I'm getting really tired of this."},{"comment_id":"1720336911319665","commenter_b":"@username ....but she can't stay out of the politics, can she?","commenter_a":"Fake awards made fake news today with the known results by the presenter Warren Beatty, admitting \"I KNEW WHO WON (in this super secret ballot), SO I WAS PUZZELED WHY IT WASN'T LA LA LAND\". Just like Hillarys victory, she won until reality stepped up and slapped her in the face.","post_message":"La La Land producer Jordan Horowitz has been praised for his handling of the epic #Oscars fail."},{"comment_id":"953133518031452","commenter_b":"Wow, county officials must be really threatened by gays getting married. We should tie them to chairs, and make them watch gay marriage ceremonies for weeks on end, to desensitize them.","commenter_a":"Go to the gulf and marry on a ship!","post_message":"They just cannot deal"},{"comment_id":"1563876947236715","commenter_b":"She a crook herself","commenter_a":"Sarah, go walk to the end of that bridge in your yard and ask Vlad of he is afraid of Trump...","post_message":"Sarah Palin called out Mitt Romney on Facebook for attacking Donald J. Trump."},{"comment_id":"1006130662760739","commenter_b":"And that White women take full advantage of affirmative action every day, it's not just for black people","commenter_a":"Does he ever need a history lesson. Start with \"When Affirmative Action Was White,\" and \"The Half Has Never Been Told,\" to start.","post_message":"The famous actress' brother brags about manipulating affirmative action policies to get into medical school."},{"comment_id":"1241741129230844","commenter_b":"Donald Trump made racist white folks take they mask off, if you support Trump you are lowKey crazy and Racist, Trump's rich ass don't give a fck bout the poor, #BlackLivesMatter #Mexicans , he dont give a fck bout people from the bottom, the ones stuck in the hood, he only gives a fck bout the rich white and wealthy, ,...he started a Race war, he just motivated and inspired the KKK even more, kkk supports him to the fullest, he's gonna make this country more heated and more and more hatred between white people and the rest of the Race's , ...fck hillary too, but trust me Donald Trump is not a good option, he wanna make America white again","commenter_a":"Be a good time to start deporting.....thats how you catch illigals hold a Trump rally just bring in the busses and load them up....lmao","post_message":"Protesters remove their clothes at a Trump rally just before they flood the streets and destroy property."}]
