[{"comment_id":"10154075062351037","commenter_b":"And she banged Frank enough to make Dutch jealous, and to tell him to eff off. 😘","commenter_a":"one classy Lady that loved her husband and her country","post_message":"“She totally saw her role as supporting and defending her husband.”"},{"comment_id":"10153415357404486","commenter_b":"Deport illegals with a QUEER under each arm","commenter_a":"QUEERS WIN !","post_message":"The Supreme Court just changed everything - what do you think?"},{"comment_id":"949797868421279","commenter_b":"Funny more women looking to have affairs on there then men","commenter_a":"Huffington Post UK, bad for those men, they cheating dirtbags and deserve no such discretion...\" ? The point of a dating site is to meet potential partners, usually of the opposite sex. How many women are subscribed to Ashley Madison I wonder? Oh, wait. I forgot! If a woman is on a site like this it can't be because she is a \"cheating dirtbag\"! It must be because she is \"exploring female empowerment\". Both sexes have a sex drive that can override sensible decision making processes. Both men and women are equally capable of cheating on their partners, so please The Huffington Post drop the \"all men are evil\" act and think before you type!","post_message":"“Too bad for those men, they’re cheating dirtbags and deserve no such discretion...\" Ashley Madison"},{"comment_id":"516575861835702","commenter_b":"Just shut the fuck up.","commenter_a":"Here a question , if tuition is free in the next years , does my daughter get a \" Refund \" on what she has paid in so far ?If Debt relief is on the table then she should be paid back for having the cash up front to pay for her school....right ?","post_message":"\"He said if a million students march on Washington for free college, that's the only way we're going to win. That's a really inspiring thing to hear.\""},{"comment_id":"10153687985087169","commenter_b":"A felon with a gun is a criminal.They do not obey the laws regardless of how many charges they have against them,They don't care,They will always have guns,You can't get a gun away from a criminal because they are lawbreakers Question for all you anti gun people.Thugs break into your home holding guns on you.Wait a moment,Felons with guns???but,Why is that?Felons are not supposed to have guns .Thats illegal. You have a young daughter,They start to molest your daughter and one of them makes a careless move and you have a chance to grab his gun and protect your daughter possibly saving her life as well as the rest of your family,Ok would you reach for it? To protect your daughter from a horribe experience? Or would you think,I won't use a gun to protect my family because I don't believe in guns altho the thugs that are not supposed ...","commenter_a":"As long as our leaders and the media continue to terrorize the masses over the threat of foreign extremist violence, our actual gun violence nightmare here will continue to grow unabated.","post_message":"On May 9 and 10th, the two-night event \"Armed in America\" explores gun violence in the U.S. Tune in each night for an Independent Lens | PBS documentary followed by a town hall discussion."},{"comment_id":"10152564458982623","commenter_b":"Pure trash . Should have ran over her .","commenter_a":"Idiot.","post_message":"It's the video everyone is talking about.  The woman recorded in a terrifying road rage incident in Randleman has been charged."},{"comment_id":"817400965070133","commenter_b":"Full fledged ASSHOLE and you too @username...go back to Mexico you illegal alien!","commenter_a":"And you Bill de Blasio are a Asshole !!!!! At least Mr. Trump has the balls to stand up for what he believes in !!!","post_message":"\"I didn’t realize this was in question. Behaves like a racist, speaks like a racist…of course @RealDonaldTrump is a racist,\" New York City Mayor Bill de Blasio tweeted."}]
