[{"comment_id":"10152979209831770","commenter_b":"Let's make her the next target. I doubt if anyone would miss her.","commenter_a":"She knows that is not true.","post_message":"Congresswoman Gwen S. Moore thinks Scott Walker's policies are \"literally\" lynching black people."},{"comment_id":"10154299130956077","commenter_b":"Trump women are hot","commenter_a":"Shots everytime trump stutters or says he has property there","post_message":"Hillary Clinton and Donald J. Trump meet in St. Louis for the second presidential debate."},{"comment_id":"10152809432022060","commenter_b":"Ummmm she made that choice! PLEASE quit pretending she was Innocent!","commenter_a":"Oh yea she looks real scared. She was with him two weeks? Cant lay her choices on him.","post_message":"Faced with the vicious way in which Dexter Allen is accused of killing the victims, Haraquon Degruy's mother believes she was trapped, unable to flee for fear of repercussions against herself or her family."},{"comment_id":"10154001788011770","commenter_b":"They not that sexy to me at all need some meat on the bones Sarah Palin is sexy","commenter_a":"Mama's baby papas maybe They look nothing alike","post_message":"Gigi and Bella Hadid proved they are the sexiest sisters in the world at the Victoria's Secret Fashion Show."},{"comment_id":"10154506279023812","commenter_b":"Lana Mushamel Rico","commenter_a":"Rip Rico!","post_message":"Marine combat dog that served two tours in Afghanistan and went on 240 missions is laid to rest. RIP Rico."},{"comment_id":"837639489700820","commenter_b":"I will destroy humans","commenter_a":"Eloise Nicholls Regan Howard Louise Hemmings Sydnie-Jo Goodison Megan Wilkins @username","post_message":"This robot wants a family...and to destroy humans."},{"comment_id":"1495765340483209","commenter_b":"Wow ease up on the drugs girl, you're delusional.","commenter_a":"Hillary, is the only sane choice. Trump is the village idiot. Daily mail must be endorsing trump. Plus, what's wrong with being short?!!","post_message":"She hasn't got her way...and she won't get commercial breaks for coughing fits or fainting spells"}]
