[{"comment_id":"10153440650715329","commenter_b":"What the fuck? Did you just call yourself a whore?","commenter_a":"This chick needs to get over herself. My mother was a lathe oporater at a pipe yard in the 70's and never whined about the way she was treated. Obviously this girl ain't from Texas. Suck it up buttercup.","post_message":"preach"},{"comment_id":"1714145238857650","commenter_b":"@username pull your head out of your buttocks. 99% of the terrorist are Muslim. Hillary wants to open up the flood gates so they can just stroll on in. Terrorism will be coming to America with them. Wake stupid!","commenter_a":"How about we stop all these moronic memes and make sure everyone is registered to vote, so he doesn't get elected!","post_message":"LOL! It's hard to disagree.  Image by Occupy Democrats, LIKE our page for more."},{"comment_id":"1777971925823252","commenter_b":"She's cheating with a cheater, duh.","commenter_a":"Can't stand him. Good voice but once a cheater, always a cheater . Maranda your so much better without him. Keep up the good music. He's trash and so is She. .","post_message":"Whoa..."},{"comment_id":"554182668075021","commenter_b":"What lower wages, you mean lower taxes. If you don't want to birth a child, just keep those nasty little knees together","commenter_a":"They are poor, jobless and believe the American dream is dead because they are stupid enough to keep being tricked into voting democrat.","post_message":"Last year was the first time that millennials surpassed baby boomers and Gen-Xers to become the largest voting demographic in the US."},{"comment_id":"1584256221591722","commenter_b":"Donna, STFU!!!","commenter_a":"When my kids were young and one of them had pulled some lame brain stunt but I wasn't sure which I'd start a mild-mannered conversation about it when they were all present. Sure enough one of them would just sort of drift away--go outdoors or to his room. It was an instant notification as to whom the culprit was. So the Puffy Orange Juvenile is drifting away? Bingo! That's enough for this old mom.","post_message":""},{"comment_id":"10153486926096770","commenter_b":"Conservative Populist? Lmfao","commenter_a":"Trump your next President.","post_message":"After acknowledging he will now raise money for the general election, presumptive Republican presidential nominee Donald J. Trump has named a national finance chairman who has a history with some organizations that could clash with his conservative populist message."},{"comment_id":"10155108703501320","commenter_b":"Take a good look at the non Christians. What ever you do this the least of theas you do to me","commenter_a":"No one, has the right to decide about the live of a anborn child. Every one has the right to live and be loved","post_message":"WATCH LIVE: We're at the The March for Life where thousands of anti-abortion activists are marching on Washington."}]
