[{"comment_id":"828087617226661","commenter_b":"Do you think if someone wrung her neck her face would pop off???","commenter_a":"I can't see her face without wanting to punch her in it.","post_message":"A perfect example of the difference between Democrats and Republicans.  This is how they treat allies:"},{"comment_id":"1571937346447279","commenter_b":"Get a new woman then!","commenter_a":"In the singing voice of Brad Paisley: Im gonna miss her.... I love my husband AND my guns!","post_message":"\"Sex strike\"  WATCH:"},{"comment_id":"10153935380939456","commenter_b":"Ikr and people smuggle exotic animals and plants like that don't spread diseases but I guess everything that's wrong with the world is only caused by illegals.","commenter_a":"I'm stuck between laughing out loud at the idiocy of Jennifer and lucindas comments, or just being out right dumbfounded! But no, I laughed, y'all's ignorance just made my day 😂😂😂😂 Lol don't be mad cuz your wall can't stop illegal entry of virus spreading... Mosquitos 😂😂😅","post_message":"An illness is spreading around the world, and there's mounting evidence linking it to a terrible birth defect."},{"comment_id":"10153200958788837","commenter_b":"?","commenter_a":"That cop needs to be arrested for having an illegal \"agresive breed\"","post_message":"PUPPY THROWN - Local 10's Michael Seiden has the latest on a poor little puppy that was thrown from a passing car right near the North Miami Beach Police Department"},{"comment_id":"957930547633333","commenter_b":"If she finds it so offensive get another job quit inflicting her stuff on us","commenter_a":"Let her rot there.","post_message":"Some people just never learn."},{"comment_id":"2076295639262230","commenter_b":"Who is Jill Stein?????","commenter_a":"Throw your support behind TRUMP all of you Bernie supporters!!!!","post_message":"Breaking News: Democratic National Committee Chairwoman Debbie Wasserman Schultz will not preside over her party’s convention in Philadelphia following email leak suggesting anti-Bernie Sanders bias, Fox News confirms. @webpagelink"},{"comment_id":"1106662279389311","commenter_b":"Kick their sorry butts off the team!!","commenter_a":"They obviously don't have good leadership, good manners, honor and respect come from the top. Must be some bad coaches and school administration!!! Teaching them disrespect and telling them it is \"freedom of speech\". Just wait they will soon have wished they hadn't disrespected this country. Muslims and sharia law will be your worst nightmare!!!","post_message":"This is beginning to happen nationwide and it is a travesty!  Do you hold Barack Obama responsible for his role in the #BlackLivesMatter movement to disrespect our flag?"}]
