[{"comment_id":"10153162470033908","commenter_b":"get outta here","commenter_a":"1 & 6 Katarina Koncarevic","post_message":"Here are 8 things you can do to potatoes you probably didn't know:"},{"comment_id":"1954618021430775","commenter_b":"It aint over till the fat lady sings,lol","commenter_a":"Mark my words, in future presidential elections, candidates will try to do what Donald Trump is doing.","post_message":""},{"comment_id":"10153291728974726","commenter_b":"Is it just me or is it beginning to look like it is just one group of \"slick\" parasites that is destroying America.","commenter_a":"Some people get it. Too bad the entitlement crowd isn't listening! They would rather consider themselves as victims of Whitey.","post_message":"VIDEO: Tavis Smiley: Government Programs Have Led to the Dissolution of the Black Family"},{"comment_id":"10154774473425575","commenter_b":"@username - islamic women are smart enuf to use these clueless American women to further their islamic agenda. but the women marching think its a march to protest defunding planned parenthood. very sad to be very dumb.","commenter_a":"can the 200K marching women be shipped to syria or where ever hamas HQ is? - lmao","post_message":""},{"comment_id":"10155252907224657","commenter_b":"She needs to stay, Debbie and Hillary are the face of the Democrats.","commenter_a":"Dems should stay away from emails..they really suck at it...","post_message":"BREAKING: Debbie Wasserman Schultz Will Not Preside Over Democratic National Convention Due To Email Leak"},{"comment_id":"10152747797741051","commenter_b":"Not a nun no more now she's a sum cause that's what she got","commenter_a":"I thought nuns were sworn to celibacy","post_message":"A nun was rushed to the hospital with extreme pains. When the doctors told her what was happening, she couldn't believe it."},{"comment_id":"895683467194573","commenter_b":"He's not crazy, his mother had him tested!","commenter_a":"I know he's an idiot","post_message":"President Paul?"}]
