[{"comment_id":"10153165284351770","commenter_b":"This woman is so wrong for our country.","commenter_a":"This lady is delusional, don't they do mental checks before putting people in these high ranking positions??","post_message":"Attorney General Loretta Lynch suggested that President Barack Obama could call for Congressional action for increased gun control in the wake of the San Bernardino terrorist attack.  Read more: @webpagelink"},{"comment_id":"1228973160510939","commenter_b":"Typical liberal lesbian! Walking around with blinders on and not reporting the facts.","commenter_a":"She is the problem and needs to shut her mouth people like her have divided this country so much so sad they let her use what is suppose to be a bias platform to put out all this hate","post_message":"Run for Your Lives! Rachel Maddow is now warning that Donald Trump will definitely round up people and jail political opponents.  Meanwhile, you are accused of being a \"fear monger.\""},{"comment_id":"10154809033061320","commenter_b":"Whoopi goldberg should move now she is very hard on the eyes","commenter_a":"Hillary 2016❤️❤️","post_message":"REPLAY: Donald Trump in Raleigh, North Carolina."},{"comment_id":"1203191243053664","commenter_b":"Fry the bitch!!!!","commenter_a":"She's as much of a terrorist as he is because she knew and said nothing!!! Life in prison or deport and never allow her back in our country.","post_message":"WIFE PLAYED A ROLE:  @webpagelink"},{"comment_id":"10153472198206336","commenter_b":"She is sick!!","commenter_a":"I don't even know who she is; and if I was that bakery, I would sue her butt of, instead of letting her get away with that and having my rating dropped because of it!","post_message":"The California bakery was downgraded to a B rating after a video revealed that Ariana Grande had licked doughnuts in the store."},{"comment_id":"10153724288582577","commenter_b":"Your wife is ugly.","commenter_a":"Fuck you Zuckerberg. I'm gonna blast Facebook non stop u faggot piece of shit","post_message":"Facebook CEO Mark Zuckerberg was caught discussing the censorship of anti-migrant posts at the United Nations development summit Saturday while speaking with German Chancellor Angela Merkel."},{"comment_id":"10152703657281051","commenter_b":"This woman is clearly abusing the system!","commenter_a":"Christine I enjoyed reading your comment I too came from a family of 11 I'm number 10 my daddy was the sole provider he injured himself and was off of work for a couple of months my mom said they had to get assistance which was very hard for my father when he returned to work he paid every cent back its funny how people can respond so quickly maybe we should just pray","post_message":"This mother of 11 lives almost entirely off government benefits. Last week, she announced some big news."}]
