[{"comment_id":"10153385027713984","commenter_b":"Just GO away!!!!!!","commenter_a":"Freedom of speech","post_message":"Obama is trying to shut Fox News down for good... sadly, this is Obama's America.  He knows he is failing and is desperate to silence his critics... share this with everyone."},{"comment_id":"457420381115209","commenter_b":"NO Never they Are NOT The Only Ones With Slavery in their History/Background Stop the Hate All People in JESUS NAME Ps139 Amen","commenter_a":"Hell no","post_message":"Should Blacks Be Compensated For Slavery?  Comment 'yes' or 'no'."},{"comment_id":"607961416030479","commenter_b":"Make America Mexico! Isn't that what the dumbass idiots where chanting when they where protesting Donald trumps rallies! Trump 2016 build that fucking wall!","commenter_a":"God damn! @username","post_message":"The Zetas tortured and killed around 150 people, and then incinerated the bodies or dissolved them in acid."},{"comment_id":"10153238433806782","commenter_b":"So you have no problem sharing a restroom with men? That's not how I perceive most women feel","commenter_a":"Oh for Pete's sake, does government really belong in the restroom???? Work on something that really matters! Schools, roads, infrastructure, the things government does belong. Are you going to post guards in every bathroom and have to check your \"plumbing\" to see what you are equipped with to make sure you are going to right one???","post_message":"A similar bill was filed in Oklahoma: @webpagelink"},{"comment_id":"10153513415174342","commenter_b":"They should serve the same time they kep him as their slave...","commenter_a":"Where are theBLM in this?","post_message":"A doctor and his wife moved from Nigeria to Britain in 1989 and with them came a 13-year-old -- whom they told officials was their son."},{"comment_id":"818351058200569","commenter_b":"If he is here illegally, he should return home and come back through the front door!","commenter_a":" quality I would most like to magnify in human race is empathy. It brings us together in a peaceful, loving state, A very wise and educated man say it.","post_message":"New Latthivongskorn was brought to the United States from Thailand when he was 9 years old. New grew up in San Francisco, California, became an excellent student, and dreamed of becoming a doctor. A month after New graduated from Cal-Berkeley with honors, a 3.7 grade point average, and a major in Molecular and Cellular Biology, President Obama established the DACA program. DACA has allowed New to begin medical school and pursue his dream of becoming a doctor. New and other Dreamers like him have so much to contribute to our country. But if the Republicans have their way, New will be deported back to Thailand. Let’s remind them that #DACAworks."},{"comment_id":"897157403654934","commenter_b":"she gave her all, wasnt a armchair quarterback","commenter_a":"She did it great","post_message":"“It took heart, guts, determination, falling down and getting up, and a little motivation from the crowd to get across the finish line.   Check this out.”"}]
