[{"comment_id":"943053922418420","commenter_b":"It's like 5 minutes and it's good. Watch it goddamn!","commenter_a":"@username watch the video xo","post_message":"Alan Watts delivered this profound message decades ago, and unfortunately not much has changed.  Vis Reset.Me"},{"comment_id":"127969217779704","commenter_b":"@username go away criminal","commenter_a":"Great job police and K9. POS got what he deserved. Just hope the dog doesn't get any disease from the scumbag!!","post_message":"A police dog takes a big bite out of crime, subduing a carjacking suspect involved in a high-speed chase and spectacular injury crash.  Eyewitnesses capture the drama on camera as the suspect tries to flee. Eyewitness News live with the condition of the innocent driver injured in the La Puente crash. Tonight at 11 from ABC7. abc7.com/@username/"},{"comment_id":"10154913059491350","commenter_b":"Shawna Cargill","commenter_a":"Nick Shanahan","post_message":"CHICKEN. TOT. PIE."},{"comment_id":"1713989815484209","commenter_b":"The Senate's duty is to listen to its constituents. Therefore it should or should not act on this matter based on what they know we want.","commenter_a":"Oh how quickly Obama forgot that he filibustered the nomination of Supreme Court Justice Samuel Alito in 2006. Hypocrite!","post_message":"\"I have fulfilled my constitutional duty. Now it's time for the Senate to do theirs.\"   WATCH: President Barack Obama says if the Senate does not vote on SCOTUS nominee Merrick Garland, \"our democracy will ultimately suffer.\""},{"comment_id":"10153074180200090","commenter_b":"she is evil and lies so much her nose is growing!","commenter_a":"Question? Why do Hiliary, Rosie and Michelle always have their mouth open when they never say anything.","post_message":"Take the survey if you know Hillary Clinton is trapped in a web of lies: @webpagelink"},{"comment_id":"10153232858118812","commenter_b":"Lmao. Good one. People need to chill out.","commenter_a":"If you don't like gay marriage, then don't get married to a gay person.... Problem solved! Cora Newton","post_message":"Filing joint taxes isn't just for traditional married couples anymore: @webpagelink"},{"comment_id":"1052426431445034","commenter_b":"You do realise the Weasel is trying to kill the Woodpecker, right ?","commenter_a":"Nature is amazing! Humans could learn from it.","post_message":"This amazing photograph shows a weasel RIDING a woodpecker!"}]
