[{"comment_id":"10153987081447894","commenter_b":"D muthafucka!!! Learn to speak English!! Well Muthafuck you!!!!","commenter_a":"My condolences to his family and friends 🙏🏽😔","post_message":"Actor Bill Nunn, Best Known as Radio Raheem in ‘Do the Right Thing,’ Dead at 62 [Photos]"},{"comment_id":"430432623811698","commenter_b":"Soon Obama can seal the new border and Mexico can deal with these ingrates..LOL","commenter_a":"more obama (gov't) bullshit!","post_message":"BREAKING..."},{"comment_id":"10153584880961336","commenter_b":"@username , IT should be ALL who are here illegally as they ALL have committted a crime by INVADING this country","commenter_a":"So, let me get this strait... Trump is going to deport all immigrants, and take away citizenship from persons naturalized in the United States....That is going to be a lot of deportation since we all have immigrant backgrounds so who is going to check the Family Trees to see how far it goes back..... and who's going to be the \"Gate Keeper\".... I wonder if Trump will also deport himself and his family as well or he planning on being the only person left in America....","post_message":"Donald J. Trump pledges to eliminate the \"biggest magnet\" for illegal immigration by ending birthright citizenship for the children of illegal immigrants. @webpagelink"},{"comment_id":"1426892224004095","commenter_b":"It is an eye opener!! The horror will be if Hillary is actually elecyrd. Then the real horrors will begin.","commenter_a":"Excellent movie! A must see!","post_message":"Hillary's America might just be the scariest movie you see all year...  hillarysamericathemovie.com/#tickets"},{"comment_id":"10153610090283598","commenter_b":"But everything is wrong with killing someone to gain at their expense!","commenter_a":"Wow. So you can't be \"successful\" without birth control? Women can't be successful if they become mothers? Women can't be successful unless they're childless? This modern feminist movement is ridiculous. It tells women they can't have a life if they have kids. True feminism teaches that women can do anything they set their minds to because they are strong and capable. And another thing, Miss Lawerence. You have access to condoms and birth control through many other outlets that do not kill innocent children for profit. It is delusional to believe otherwise.","post_message":"Hunger Games Actress Jennifer Lawrence: Thanks to Planned Parenthood I’m a Successful Woman"},{"comment_id":"1027501837293064","commenter_b":"What a lying bitch , she tried to be the center if attention and it didn't work out for her. There is nobody left for her to blow, so she wants to quit. Awe.... poor little helpless girl who swallowed so much she is choking on it. Lol","commenter_a":"She brought it on herself","post_message":"Megyn Kelly has stunned her fans and Fox News with an announcement that changes everything.   She's put Fox in a VERY hard position and disappointed a lot of her fans."},{"comment_id":"10153244539676756","commenter_b":"And women like @username have no problem eating corn on the cob with those buck teeth!!","commenter_a":"Glad I live in the U.S.!!","post_message":"In Russia, women are prohibited from doing 456 types of work.   In Nigeria, it's not a crime to hit your wife for the purpose of \"correcting\" her.   In Iran, a woman can be jailed for not following the Islamic dress code, which includes wearing a hijab."}]
