[{"comment_id":"10154098589214753","commenter_b":"She could be doing a whole lot worse,she is doing what she wants before going to collage,seems like a good idea to me .She may not be so inclined to act foolish when she gets there and will take her studies more seriously.Enjoy your year off","commenter_a":"Wow! This is not news...who cares?","post_message":"Malia Obama has been embroiled in a pot smoking scandal after footage was released of her smoking at the Lollapalooza music festival in late July. The first daughter opted to attend the Chicago event instead of joining her parents for the Democratic National Convention in Philadelphia. It was a decision that led to big headlines for all of the wrong reasons. Images of Malia twerking and partying it up were posted online. It wasn’t just her wild behavior that got attention, but who she was... @webpagelink"},{"comment_id":"467147946806146","commenter_b":"Gary McGowan, an interesting read!","commenter_a":"That headline...shame on you, @username.","post_message":"\"When we get the wrong answer, in medicine, that not a matter of academic sophistry  it causes avoidable suffering, bereavement, and death.\""},{"comment_id":"10153555838691336","commenter_b":"Bring back W. I want the border sealed. Military USA should patrol its own borders. No longer want any language spoken in my country. No longer want to know that the 'immigrants' get to bring everyone. No Welfare, no SSA because you have a work history while an illegal immigrant. I want the next President to Stand for American Values. Jeb Bush only stands for Obama's values. Open Borders and Anyone can use our welfare system.","commenter_a":"he needs the help.....","post_message":"Yesterday, Jeb Bush told Neil Cavuto that he thought his debate performance \"went fine.\"  Do you think so?"},{"comment_id":"10154450737471909","commenter_b":"Please do elaborate and share your knowledge with the rest of us","commenter_a":"Anton Deni Pamela Note the what it's about and the symbolism. I found the pine cone staffs to be interesting knowing what they really mean.","post_message":""},{"comment_id":"421180878069520","commenter_b":"^^ this idiot supports sanctuary cities and providing safe harbor to illegal alien criminals","commenter_a":"Hillary belongs in prison.","post_message":"More than $400 million has poured into the presidential race so far."},{"comment_id":"10154635398261037","commenter_b":"To impregnate your mom? Yes.","commenter_a":"And she'll be knocked up again within the month","post_message":"Panna Krom, now 26, was convicted at 17 of killing her newborn in a toilet to hide the pregnancy from her parents."},{"comment_id":"822517567938820","commenter_b":"This woman is crazy saying Hillary is the most loved and respected woman in the world! She's been hanging around Hillary to much, and Hillary's lying is rubbing off!!","commenter_a":"Security should of threw her out on her ass. The demons must be running scared.","post_message":"Watch: Dem Chair Shows Up INSIDE GOP Convention Arena And Does The Unthinkable  It is amazing to see to what extent the Democratic party will try to derail Trump's campaign.  Do you stand behind Donald Trump?"}]
