[{"comment_id":"10153740988490530","commenter_b":"This Bi..ch ran him over!! WITH HIS OWN TRUCK!!! She must pay!!!","commenter_a":"wow that's just a tragedy all over... All those lives destroyed forever","post_message":"Police say addiction led a suburban mom to carjack and run over a senior citizen in a Burger King parking lot."},{"comment_id":"10152987583472014","commenter_b":"If you don't want the responsibility of a baby, get yourself fixed or some type of contraceptive","commenter_a":"Punch her in the face","post_message":"A teen mother says she didn't know she was pregnant before delivering a baby girl, but court documents detail chilling details of her searching the Internet for ways to induce a miscarriage while 38 weeks pregnant."},{"comment_id":"10154382479866159","commenter_b":"Now is a good time to venture into the moving industry !!","commenter_a":"I know a lot of people I hope does this.","post_message":"\"Make dating great again!\""},{"comment_id":"1224050534299847","commenter_b":"Give her hell","commenter_a":"If this really occurred, the person should be discharged from Military Service.","post_message":"How sad is it that protesting the National Anthem has even extended to here?"},{"comment_id":"1515340161809773","commenter_b":"Well... he lost the popular vote, so that's clearly not true. But you're right, Bernie supporters should feel cheated.","commenter_a":"Obviously people approve of Trump more then Hillary 🤗🙃 Let's be honest he won because of crocked Hillary's disapproval. Bernie supports should feel cheated... he'd be the next president if she hadn't been the democratic candidate.","post_message":"Do you approve of Donald J. Trump?"},{"comment_id":"10154315697078984","commenter_b":"That whore needs to go to hell","commenter_a":"She DOES NOT HAVE THE AUTHORITY TO DO THIS. ALL WE NEED TO DO IS IGNORE HER. KEEP BUYING IT SHE WILL BE GONE IN 8 MONTHS","post_message":"Michelle Obama has been messing with our children's food for years, but now she's gone to far.  She just banned one of America's favorite cereals, and there's not a darn thing anyone can do about it.  It's time to throw her and her America-hating husband out of the White House for good."},{"comment_id":"1081156815254321","commenter_b":"DEPORT ALL MUSLIMS FROM AMERICA IMMEDIATELY : DESTROY EVERY MOSQUE ASAP !","commenter_a":"Back to disliking France again","post_message":"Establishing 'good relations' before Trump takes office..."}]
