[{"comment_id":"10153968798483352","commenter_b":"Nasty bitch","commenter_a":"What!?","post_message":"Escort madam reveals in explosive tell-all book how University of Louisville basketball team ‘paid her $10K for 22 sex parties’ with troupe of strippers including three of her own daughters"},{"comment_id":"1761764947438429","commenter_b":"@username you do realize Hilary wants to deport illegal immigrants too right? She announced it this last week.","commenter_a":"Women should feel insulted that the first female ever to be nominated also happens to be a corrupt, cold, calculating, ruthless, lying crook. If we're going to give the distinction of 'first woman nominee' or, God forbid, 'first woman president' to anyone, she is, quite literally, the last woman in the country who deserves the honor.","post_message":""},{"comment_id":"10153081593500090","commenter_b":"She is also a terrible so called human being !","commenter_a":"esta esta mas choteada que cantante desafinado","post_message":"She may be hiding emails, but there's no hiding this fact: Hillary Clinton would make a terrible president.  Tell us WHY you don't want another Clinton in the White House: @webpagelink"},{"comment_id":"10153865214066680","commenter_b":"Yea she can teach them how to lie, cheat, and steal.","commenter_a":"Oh yeah","post_message":"“Hillary has spent her entire career bringing folks together on behalf of our kids,\" she says."},{"comment_id":"914002385301524","commenter_b":"Fkn eh one less pig on the streets","commenter_a":"How many cops DON'T get caught doing the same thing?..","post_message":"He tried to frame an innocent man for a burglary that HE committed! When that didn't work out he killed himself.  From (Y) Counter Current News - MBD"},{"comment_id":"818351058200569","commenter_b":"If he is here illegally, he should return home and come back through the front door!","commenter_a":" quality I would most like to magnify in human race is empathy. It brings us together in a peaceful, loving state, A very wise and educated man say it.","post_message":"New Latthivongskorn was brought to the United States from Thailand when he was 9 years old. New grew up in San Francisco, California, became an excellent student, and dreamed of becoming a doctor. A month after New graduated from Cal-Berkeley with honors, a 3.7 grade point average, and a major in Molecular and Cellular Biology, President Obama established the DACA program. DACA has allowed New to begin medical school and pursue his dream of becoming a doctor. New and other Dreamers like him have so much to contribute to our country. But if the Republicans have their way, New will be deported back to Thailand. Let’s remind them that #DACAworks."},{"comment_id":"10153203209001336","commenter_b":"THANK GOD THERE ARE MOTHERS LIKE HER I WOULD DO THE SAME THING IF IT WAS MY KID!!","commenter_a":"Lets hope she isn't accused of child abuse!","post_message":"VIDEO: A woman is seen beating a rioter in Baltimore. It turns out he is her son."}]
