[{"comment_id":"10153648281727093","commenter_b":"What an ignorant woman.","commenter_a":"She shoulda kept her mouth shut. Definately part of the problem not the solution... Our Dallas officers have absolutely ZERO to do with the recent ON CAMERA MURDERS of those men. So NO JOHNSON IS NO MARTYR. HE WAS A VILE POS THAT GOT JOHNNY C4d","post_message":"The first African-American Miss Alabama said she knows it's not right to feel this way, but can't help it... @webpagelink"},{"comment_id":"519371271599548","commenter_b":"He did not mention deporting a large number of illegals, he did not mention anything about building walls, that's why he failed to stop the influx of illegal immigrants that we have now. Nothing is impossible, if we want to do it. If we can dig tunnels below, we can build walls above.","commenter_a":"It doesn't sound like trump at all. That's most probably what trump should have said. Everything bill Clinton said has been implemented. He doesn't mention deporting 12 million people (impossible to execute), he doesn't mention building a wall (idiotic and impossible to execute)... So no, doesn't sound like trump at all. This sounds like someone that actually has a executable plan, unlike trump. Not to mention calling a whole nation rapists, murders and drug dealers.","post_message":"Do you think this sounds a lot like Donald J. Trump?   MORE: @webpagelink"},{"comment_id":"905632936170129","commenter_b":"No mames wey pobre jente k vive cercas!!!","commenter_a":"Luis atacko godzila.","post_message":"Huge Chemical Plant Explosion In Tianjin, China!"},{"comment_id":"10155549473141729","commenter_b":"She's a deranged scumbag","commenter_a":"You have to feel for this poor delusional \"woman\". Her whole way of life is disintegrating & she needs to complain as loudly as possible so people actually hear her. Soon her dementia will kick in full blast & she will be confined to a nursing home. I can only hope she doesn't suffer. It's just too bad her legacy will be one of HATE & DIVISION !!!","post_message":"Whadd'ya think?"},{"comment_id":"10154949669541037","commenter_b":"Great, ban it in the entire America now. God didn't create us females to abuse our bodies atall. You could always give up for adoption if it's already done. But prevention is better.","commenter_a":"Here we go....","post_message":"The law bans abortion once a fetal heartbeat can be detected, as early as six weeks after conception."},{"comment_id":"647855782048269","commenter_b":"@username, no, she's a \"feminist\" and \"peace activist\" from Argentina. All my friends would describe themselves as feminists (male and female). None of them support Trump. Funny that.","commenter_a":"The insult 'a basket of deplorables', is the best exhibit of Hillary Clinton discriminating personality. There is a big number of registered democrats (like myself) for Donald J. Trump. So all democrats and independents (forget the republicans) supporting Trump, are that? That is how cheat this woman is. If elected, she will do the same to any ethnic group rejecting her, and will blow up one country after another, starting with Russia. Deplorable, is Hillary Clinton for expressing herself that way about the 75% of US citizens. (Ivan Mintz/Eric Trump)","post_message":"Republicans slammed Hillary Clinton for saying that half of Donald J. Trump’s supporters fit into a “basket of deplorables.\""},{"comment_id":"791848880944157","commenter_b":"The entire so called debate is a joke as always .FEAR CARD PLAYING BIG TIME .....VOTE BERNIE VOTE BLUE GIVE YOURSELF A CHANCE","commenter_a":"I feel like they act like they want to think of us but yet foot in mouth with trump!!","post_message":"Donald J. Trump is a chaos candidate, and he'd be a chaos president. #chaospresident"}]
