[{"comment_id":"747243702046419","commenter_b":"Women hate mothers. Go figure.","commenter_a":"@username same story but the comments...","post_message":"\"There's no difference in me feeding my baby with my breast than you feeding yourself with a spoon.\""},{"comment_id":"10153462081617452","commenter_b":"Get a life lady!!","commenter_a":"She should be FIRED ...","post_message":"\"You're saying I can't have a hairstyle because of your culture? Why?\"  San Francisco State University is investigating a confrontation between a black student and a white student over dreadlocks."},{"comment_id":"1200289290023832","commenter_b":"It just needs to be remembered do this with no violence unless it is used on them and if the illegal aliens respond with violence deal with them direct and swiftly. No questions just stomp them and dump them back across the border.","commenter_a":"She just deserve a raspberry. It is the to be said to her. Our immigration system needs work but she is really talking about letting illegal aliens in. The term illegal means we have acknowledged that they have committed a non-legal act, thus becoming a criminal. That means do not pass Go do not collect 200 dollars. They are already being coddled at our expense. If, they are caught they should be taken direct to be fingerprinted and photographed, then directly to a border. If, they are identified as having done it before. We should setup a location far away to ship them to. This non-American needs to mind her own business, instead of trying to shovel her troubles on to us.","post_message":"Oh really?"},{"comment_id":"10158240785950641","commenter_b":"LETS GO BACK TO ..WHEN AMERICA WAS WHITE","commenter_a":"I love president Trump","post_message":"Happening Now: Judge Jeanine Pirro delivers remarks at #CPAC2017."},{"comment_id":"10152567053540927","commenter_b":"Rice did the same thing with her emails. Is she evil too?","commenter_a":"She is one evil person.","post_message":"They're taking her own staff's word for what could possibly have been a major national security risk!?!"},{"comment_id":"10153256299899726","commenter_b":"The bakers were physically raped by this couple","commenter_a":"We let people wear rags which scares me to be approached but this is silly","post_message":"WATCH: Lesbian Couple Accuses Christian Bakers of  Mental Rape"},{"comment_id":"10154885483751037","commenter_b":"Ugly nacty women","commenter_a":"Rachel Rauth","post_message":"Sen. Elizabeth Warren has a message for Mitt Romney."}]
