[{"comment_id":"10154592077846756","commenter_b":"Good grief. I could pee a puddle deeper than her.","commenter_a":"She will never be first lady.","post_message":"As she readies to address the Republican National Convention Monday night, it's not so clear exactly what kind of first lady Melania Trump would be. But she's left some clues."},{"comment_id":"1361368557222876","commenter_b":"Toni, I never commented previously so I don't know what your delusion of reality is. Trump never banned all Muslims. My buddy Wayne Allen is very capable of comprehending what the fuck Trump said. He isn't an intellectually lacking derelict who has lost his way and found himself sucking Democratic titty. What Trump stated is that he would implement a vetting procedure to insure ISIS doesn't send men in with the hundred thousand other young refugees this piece of shit Democratic government is wanting to allow in. I fight for the people, brotha. Not the government. I protect this land we walk on from those who wish to impose radicalism here. Those people are our government. I am the mother fucker that will bleed on my home soil, for the real interest of our nation, not individual interests. As far as Native Americans suffering from our conquering; yeah, well, that's ...","commenter_a":"You people are the most ignorant people around. Your even more so then the Trump idiots. Leave these people alone. You should be more afraid of your neighbors. More Americans kill Americans then Muslims do. Watch the news.","post_message":"More than 20 people were stung by a swarm of bees outside a mosque in Phoenix, Arizona."},{"comment_id":"10152993326411336","commenter_b":"bahahaha hahaha........I love your comment....exactly","commenter_a":"So we agree....no gun is responsible for a crime.","post_message":"“No religion is responsible for terrorism. People are responsible for violence and terrorism.”  Moments ago, President Barack Obama delivered remarks at The White House Summit on Countering Violent Extremism. @webpagelink"},{"comment_id":"10153715295681336","commenter_b":"Nancy Pelosi ? What are you smoking?","commenter_a":"As a GOP Tea Party, it's the best news I have heard this whole year! This RINO had to go, he's dishonest, he campaign as a Tea Party Patriot and then became a Liberal hack as many of them usually do! When I saw Nancy Pelosi defending this clown, I knew we were betrayed.","post_message":"“It’s become clear to me that this prolonged leadership turmoil would do irreparable harm to the institution… This morning, I woke up and I said my prayers...and I decided, you know, today is the day I’m going to do this.”  Moments ago,  Speaker John Boehner announced why he has decided to resign this year."},{"comment_id":"549265795241268","commenter_b":"Those boarders should never been opened... Obama fault all the evil happening in the world, is all due to Obama turning loose the Muslim maggots and Mexicans by mostly the Muslims... Their eating up all the good stuff in the world just like maggots do and ruining everything!!!!","commenter_a":"Yes","post_message":"BREAKING: Mexican Military Invading US, Begin Shooting Texas Residents.  We Trump's wall now. This is getting out of hand.  Do you think we should close our borders?"},{"comment_id":"1687154254839815","commenter_b":"To spy over the Congress and international leaders is a serious matter and the Congress should really act immediately to resolve it !","commenter_a":"Try him for his CRIMES!!","post_message":"Obama used the NSA to SPY on members of Congress to ram through his unpopular and disastrous Iran nuclear deal.   What do you want your Congress to do in response?"},{"comment_id":"1442368625820278","commenter_b":"@username maybe they would consider it if people would stop coming here illegally !! If America is not such a coveted place to be then stay in your country and deal with the shit you are handed !! It's quite simple ! But come here and mooch, steal, kill, sodomize , rape and terrorize then there will be action !! I'm not condoning it who likes war it's ugly but it is what it is !!","commenter_a":"The chinese & north koreans have killed millions, the russians and so on why just nail the USA? Ask China & Russia what their ammo is made from! Chocolates & jelly bean? Really, wake-up!","post_message":"People don't understand how bad this really is."}]
