[{"comment_id":"10154103585977015","commenter_b":"They have ruined these children's life....they should be deported and banned from returning!!! If they return, they should be executed.","commenter_a":"LEAD POISONING BETWEEN THEIR EYES IS THE ONLY SOLUTION ! !","post_message":"Members of a Muslim rape gang shouted  akbar in court yesterday as they were jailed for raping girls aged 11 and 13..."},{"comment_id":"10153793064907452","commenter_b":"We have to go bail him out!!! 2,000 pesos!!!","commenter_a":"Sal zorro is at it again 😂😂","post_message":"As officers rushed to the Los Angeles International Airport amid false reports of shots fired, they encountered a man dressed as Zorro outside Terminal 7. @webpagelink"},{"comment_id":"976040162431405","commenter_b":"I haven't watched this show in years and don't see how it's still on the air! These women are so \"out of touch\" with the real world, they're clueless!","commenter_a":"These women on the view must b a special kind of stupid","post_message":"Thank you, Dr. Ben Carson!"},{"comment_id":"473761302814995","commenter_b":"Get rid of all those freeloading motherfuckers.","commenter_a":"No- what part of ILLEGAL aliens does the government not understand?","post_message":"Bernie Sanders is calling for a path to citizenship for Mexican immigrants, saying \"We have 11 million people in the United States who are now undocumented and I believe they deserve a path towards citizenship... I believe that what immigration reform means is uniting families, not dividing families.\" Do you agree with this?"},{"comment_id":"10154137971976323","commenter_b":"You cannot stop it, it's a done deal. The pacific couldn't stop the TPPA, North Americans couldn't stop NAFTA. These deals are done above our heads, I very much doubt you would be allowed to leave the EU even if you wanted to.","commenter_a":"Have you read the EU's conditions on public services they want within TTIP? It looks to me as though these would offer considerable protection to NHS services; are we sure that our Government would have similar protections? See @webpagelink I was very much against TTIP and concerned about EU position until a colleague brought this to my attention.","post_message":"\"If being in the EU has brought us TTIP, it has also brought us the means to stop it.\""},{"comment_id":"579350648893184","commenter_b":"These other ones need to keep on walking","commenter_a":"At Portland High graduation three young muslim woman remained seated during the National anthem, one of them grabbed the hand of the young muslim man who was standing , trying to get him to sit.He brushed her hand aside and remained standing.Then she turned around to face a large group Muslims and tried to get them to sit.Everyone of them remained standing.","post_message":"Muslim Students Walk Out During National Anthem [VIDEO]. If you don't respect our country, feel free to leave. Do you find this disrespectful?"},{"comment_id":"1420510454708671","commenter_b":"i wonder if there will be a point when the majority, or at least, SOME, Republicans will grow some balls, and say ENOUGH???.....and i just sent an email to both of my state's gutless excuses for elected officials and pledged my unwavering dedication to get their sorry asses whipped come next election...","commenter_a":"Lol your funny Trump you don't have all the control like u think u do lol","post_message":"Got him!"}]
