[{"comment_id":"10154789513347908","commenter_b":"Bernie concede and join forces with Hillary. We all know this is what will happen anyway. We have to start now if not we will be wishing so if trump wins!","commenter_a":"Thank you, Bernie Sanders.","post_message":""},{"comment_id":"10156946907525389","commenter_b":"@username you are just a hater. Stop disrespecting people specially Muslims.","commenter_a":"Love this man!","post_message":"\"Why didn't she say, 'Hey, make better lifestyle choices?' If you want to join something, why don't you join a church, why don't you join the Boy Scouts or the Girl Scouts?\"  Milwaukee County Sheriff David A. Clarke Jr criticized Hillary Clinton's comment on joining \"positive gangs.\" @webpagelink"},{"comment_id":"662083353949972","commenter_b":"@username the police and you need to respect the first amendment","commenter_a":"These are adults who are supposed to be leaders in our community. They have the power to take life and they are the ones acting like children who have taken their ball and gone home. Is it any wonder these children are afraid of police and concerned with their actions? Shame. Shame on them. Shame on them for proving the children's point.","post_message":"Some Jefferson Parish deputies won't volunteer for security detail at Bonnabel High School football games after several team members kneeled during the national anthem during last weekend's game."},{"comment_id":"1448117561874659","commenter_b":"They generally don't prohibit it but they train the employees to give the robbers the money because the owners have insurance for that.","commenter_a":"Looks like 30 people who should have been able to defend themselves and their businesses.","post_message":"A trio of armed teenagers is now accused of more than 30 robberies across King and Pierce counties."},{"comment_id":"10154855250569062","commenter_b":"please name a book that would represent all citizens lol come on now. Tennessee is like 81% christian so i think the book works fine @webpagelink/ it represents the people not the government, so there is your seperation :P","commenter_a":"Even when I was an atheist, the bible was a good read. Some of them just need to get their head out of their butt to look at things objectively.","post_message":"Good idea? Bad idea?"},{"comment_id":"1341790949180015","commenter_b":"There are people in the world that defend raping children and killing babies . Ignore these people .","commenter_a":"Disgusting.","post_message":""},{"comment_id":"10153009921992507","commenter_b":"I'm with you. I could teach a class in this at this point, because most women DO NOT CLIMAX without clitoral stimulation, no amount of deep thrusting will do","commenter_a":"This is quite common, and enjoyable for the man if he grows up. When she's using the vibrator & he is inside it feels like the penis is vibrating","post_message":"Awkward!"}]
