[{"comment_id":"10153981518484749","commenter_b":"These drivers are trespassing on private property. The property owner is 100% within her rights to report each trespasser to the police and have their cars towed.","commenter_a":"why not have it towed? make a deal with a local tow company and get a commission off each car towed from your driveway","post_message":"\"Happy digging, at least it's not raining.\""},{"comment_id":"10152641754716367","commenter_b":"Yes she is!!! She wears Spanx.","commenter_a":"Mucho baggae...g","post_message":"The Hillary Clinton email controversy is a reminder of one inescapable fact: She comes with baggage."},{"comment_id":"833697490010213","commenter_b":"All babies are precious I guess your mother didn't think like you or you wouldn't be here idiot","commenter_a":"How but killing the mother so she can't have anymore kids","post_message":"How many of you would have been aborted under this perverted logic?"},{"comment_id":"10153216491624877","commenter_b":"I just saw a story about her on the ID channel on Sunday. She's ridiculous and should be ashamed of herself. She actually chose a life of crime over her kids when they were younger. There's nothing cute about what she's doing or has done. She should be locked up.","commenter_a":"She needs to sit her old, thieving behind down somewhere.","post_message":"Notorious jewel thief Doris Payne strikes again. Fresh out of prison, Payne is linked to a missing $33,000 diamond ring. Watch how it unfolded below.  Grio fam, 84 years old and Doris is still doing her. What do you think?"},{"comment_id":"632098943657535","commenter_b":"Stank bitch","commenter_a":"Wow!","post_message":"Oh Really? Kim Burrell Preaches a Hateful Sermon About 'Perverted' Homosexuals -- Days Before She's Scheduled to Appear on Ellen DeGeneres [Video]"},{"comment_id":"1059213794114079","commenter_b":"You look like my next door neighbor. No seriously! My next door neighbor wears a hijab. She's one of the sweetest people we know. Even brought us cookies for Christmas!","commenter_a":"Islam is the best","post_message":"She stood up in an incredible way."},{"comment_id":"10153663594614160","commenter_b":"You've Been Blamed because you brought us down to our Knees but we'll fix it all under Trump and wipe away ALL traces of your rotten deeds against our Beloved America--now go kiss some more Muslim butt and bring in more Illegals you only have 7months left ---","commenter_a":"Of course he is trying to deflect blame.","post_message":"\"I have been blamed by Republicans for a lot of things\""}]
