[{"comment_id":"10153443636529087","commenter_b":"She is another racist B*t*&","commenter_a":"Influential? I think her 15 minutes were up some time ago.","post_message":"Influential conservative commentator Ann Coulter called claims that Ted Cruz was a natural born US citizen \"absolutely false,\" joining Donald Trump in questioning whether Cruz can legally run for president."},{"comment_id":"825517894248057","commenter_b":"Sure I can agree with that but you need a way to pay off debt. Taxes are revenue for the government which are used for various expenses. When you balance the budget that means you are simply not paying down debt but spending less than you have. We need to start moving in a direction where we will run surpluses and thereby pay off previous debt. Just like a company, a government should not be run by debt. Now theoretically by increasing taxes = more revenue which could be used to pay off debts but that doesn't always work in modern society. We are a people who now are all run my debt, we own nothing anymore.","commenter_a":"Realistically the only way to reduce the deficit is increasing taxes. The problem is Hilary wants to increase to help her buddies and Bernie wants to increase taxes to add more social services. The other two will uses those taxes, cut spending and find other ways to be more efficient to reduce deficit.well trump will cuz Cruz will just have to give money to his buddies in the establishment","post_message":"HA! Look at how much the tax plan of each candidate will directly affect your paycheck...  Your jaw will drop when you get to Bernie Sanders..."},{"comment_id":"10153379305754205","commenter_b":"I was more surprised that Kenny Rogers was still alive, but at what cost? What has happened to his face?","commenter_a":"Typical intolerant liberals. Always pointing fingers and putting words in people's mouth. I think your ignorance is actually funny and the final laugh will happen next January. You will have a reason for 8 years of your hate and intolerance.","post_message":"Kenny Rogers Loves Donald Trump"},{"comment_id":"1113233595363485","commenter_b":"She articulated well as an advocate of the legal justice system.","commenter_a":"Yes, the role of the defence attorney is to defend and protect the client at all costs. She did. He won. It wasn't right, but she did her job.","post_message":"\"I know my role in the justice system.\""},{"comment_id":"1402706749758182","commenter_b":"Awesome Donna! Way to #GrabEmByThePussy !","commenter_a":"No to Any replacement for Trump! No to Pence!! He could Never beat Hillary. Remember almost 1/2 of America did not even know who Mike Pence was a week ago and the V debate had poor ratings. 40 percent of America wull stay home on election day.","post_message":"Sen. Johnson kicked off Manufacturing Month with a special video message to students touring Pewaukee manufacturer TLX Technologies during their open house. Hundreds of students visited the business throughout the day to learn about careers in manufacturing."},{"comment_id":"631924593629516","commenter_b":"STUPID C..T","commenter_a":"Cheers for Hillary from Seddique Mateen, father of Pulse Nightclub Terrorist – and ideologue supporter of the Taliban and Critic of the LGBTQ community! • Seddique Mateen, the father of Orlando Pulse nightclub terrorist Omar Mateen, was spotted sitting behind Hillary Clinton at her campaign rally on Monday, August 8, in Kissimmee, Florida. • Clinton was paying tribute to the victims of the Pulse nightclub massacre at the rally when an employee of NBC affiliate WPTV noticed that one of the rally goers seated directly behind the Democratic presidential nominee was Seddique Mateen, the mass shooter’s father. • When asked about how Mateen received this preferred seating at her rally, Hillary Clinton, walked away without answering any questions. • Who instructed that Seddique Mateen be placed in such prominent seating at the Florida rally and why would they do so? • If it was a judgment error by Clinton’s staff ...","post_message":"\"I don't think what Donald J. Trump says is worse than actually what Hillary Clinton in fact has done.\"  - Green Party presidential nominee Dr. Jill Stein"},{"comment_id":"10156217121965725","commenter_b":"@username, ur just a stupid liberal who wont open ur eyes... If u think Veterans get better treatment than these illegals ! You must be screwing one. Idiot","commenter_a":"America needs Trump for President !!!","post_message":"Notice that illegal immigrants will be given ObamaCare and free college tuition but nothing has been mentioned about our VETERANS #DemDebate"}]
