[{"comment_id":"1724969627717594","commenter_b":"@username they don't do anything considering the billions of dollars we give them in aid that we couldn't attain ourselves. I'm not saying give Palestine money either just why give Isreal money to kill Palestinian children and so Israelis can have abortions?!","commenter_a":"If you realized what Isreal has done to the Palestinians you might donate to Hamas as well.","post_message":"WATCH: Filmmaker Ami Horowitz discovers that some American college students are willing to donate money to the militant group Hamas, after being told it will help “destroy Israel.” @webpagelink"},{"comment_id":"10152926851271336","commenter_b":"My God leave the Good Doctor alone. Don't see you going after those that treat patients in their mammogram buses and doing blood and plasma draws that happen to be far more dangerous. Give the guy a break. He is licensed to practice in that state, the entire state. Can you blame the Dr. after what Obamacare has done to folks. Jesus Lord...go after POTUS for putting people in this position in the first place, without healthcare, sucking what was left of Medicare that the elderly needed and driving up healthcare coverage so govt gets a buck.","commenter_a":"Need more like him and fewer like Obama.","post_message":"Mississippi health officials are threatening to revoke the medical license of an 88-year-old doctor because he treats patients out of his Toyota Camry. Dr. Carrol Landrum says his patients are too poor to travel to him, so he goes them."},{"comment_id":"10154163706682908","commenter_b":"The insurance companies own half our congress. That's why. Obama had to settle for the ACA. Couldn'tget them to bring single payer to the floor.","commenter_a":"The reason we spend the most with the worst outcomes is because we save people who wouldn't have ever had a chance elsewhere in the world. Our 911 system is a model for the global community and have a lots of saves who would've died elsewhere. The people that we save and live often go on to live on ventilators and long term care. Ever been to sub-acute hospital? That's where all $ to outcome ratio goes out the window. Are you going to be the one to tell someone you're pulling the plug on their ventilator because they are costing too much?","post_message":""},{"comment_id":"462218217236106","commenter_b":"Transgender? It's a Guy who wears girl shit. That's no Transo, that's a stupid crossdresser who can't tell the difference between a P and a V. Sheesh! This country is Fucked up on this stupidass politically-correct bullshit. Wipe the makeup off and take the wig off or you'll get that shit Scraped off and that wig Split by angry parents and/or boyfriends.","commenter_a":"LET ME FIND OUT MY DAUGHTER, GRANDDAUGHTER HAD THIS FREAK WALK INTO THE SAME RESTROOM WITH THEM AND FOUND OUT THE SCHOOL OKed IT I`M GOING TO OWN A BIG PART OF THAT SCHOOL SYSTEM! THIS FREAK IS A MALE AND ALWAYS WILL BE ONE, HE HAS MALE DNA, MALE GENES MALE FINGER PRINTS A MALES RIB CAGE AND MALE PLUMBING NO SUCH THING AS A TRANS GENDER! THIS FREAK NEEDS TO STOP PLAYING DRESS UP AND PRETEND! HE MAY GET MORE THAN HE`S LOOKING FOR BY SOME DAUGHTERS DAD!","post_message":" girls have rights, and they shouldn have to share a bathroom with a boy, said a parent. See how this transgender student is causing a firestorm in a Missouri high school."},{"comment_id":"948831575172245","commenter_b":"Women see active duty don't they?","commenter_a":"Isn't he a FELON? Can he even vote?","post_message":"T.I. reveals a woman will not earn his vote in the 2016 presidential election because \"women make rash decisions.\" And he thinks \"you might be able to the Lochness Monster elected before you could [get a woman].”  Apparently, the rash decisions of male leaders did not result in broken levees in New Orleans, a trillion-dollar deficit due to decades-old wars, and a huge gun control problem that results in mass shootings almost weekly.  Amid major backlash, T.I., issued an apology for his sexist comments. MORE ----> @webpagelink"},{"comment_id":"1159718984066336","commenter_b":"Hang that ugly devil.","commenter_a":"go figure","post_message":"Disgusting."},{"comment_id":"10153068348838717","commenter_b":"That is true but we all know she will never be a President","commenter_a":"She's just a Lying P.O.S!!! She will NEVER be a President!!!","post_message":"Presidential candidate Hillary Clinton sits down with Josh McElveen on CloseUP."}]
