[{"comment_id":"1110306035681925","commenter_b":"She's a evil hypocrite","commenter_a":"Good point!","post_message":"'Hillary Clinton doesn’t miss an opportunity to ridicule Donald Trump’s illegal immigration solution of a wall on the southern border — but that’s exactly what she’s deployed to keep undesirables away from her.'"},{"comment_id":"10153171684108352","commenter_b":"Gun or no gun this girl would have stabbed him. And believe me, I would have too.","commenter_a":"And why do kids have access to guns?????","post_message":"Florida sisters, aged 15 and 11, are charged with murder of 16-year-old brother who they shot dead"},{"comment_id":"10152612105311636","commenter_b":"Stupid women","commenter_a":"Because it causes serious mental health pronlems","post_message":"Remind us why this isn't legal in the UK again?  via Independent US"},{"comment_id":"1011356012327296","commenter_b":"The lady must go to prison","commenter_a":"Looney toon","post_message":"Should the Hillary Clinton investigations continue?"},{"comment_id":"1518093821534153","commenter_b":"Cindi Marcum then why do you ppl think that muslims have the right to travel to the u.s. and and park their lazy asses here, mooch off of us and kill at will while trying to enforce their barbaric ways of life on us....hmmmm?","commenter_a":"So if it's in the rights of the protesters to block a road where does my rights to travel freely fit into that agenda so I can say get to work , seek medical attention or buy food , ect","post_message":"Wow! Talk about fear mongering!?"},{"comment_id":"10153482045808984","commenter_b":"She is a nut","commenter_a":"I would hate to have lived under her roof , she is not fit to be president. Or anything else.","post_message":"Hillary Clinton is known for her liberal view on just about every topic she chooses to sink her teeth into. And looking at this, her next move might be to include children in her agenda...  Do you think Hillary needs to be stopped?"},{"comment_id":"10152617242161680","commenter_b":"@username When did DHS keep illegal aliens out ? They watch our borders watch them walk right in. DHS is a waste of taxpayers money. We have Military FBI & CIA.","commenter_a":"Republican Logic: \"We care so much about stopping illegal immigration that we're going to cut off funding to the Agency responsible for stopping illegal immigration.\" Just brilliant. Truly.","post_message":"Senate Democrats are considering a shift in strategy that could offer a resolution to a long Senate impasse over funding the Department of Homeland Security — and put more pressure on House Speaker John Boehner."}]
