[{"comment_id":"10153200811382377","commenter_b":"I'll agree with you on that , but it still doesn't change my position on accepting unvetted refugees !","commenter_a":"So he just declared the Obama administration a terrorist group then !!","post_message":"British Prime Minister David Cameron: \"The Muslim Brotherhood is not the only movement that promotes values which appear intolerant of equality and freedom of faith and belief.\""},{"comment_id":"10153727550292300","commenter_b":"Go naked girl! Again and again!","commenter_a":"South beach is super ghetto now.","post_message":"In video taken by witnesses and posted on a website where it went viral, Angelic Valle is completely naked when she “placed a steel chair leg into her buttocks,” according to the police report."},{"comment_id":"1672143779721068","commenter_b":"Holy cow. This woman is aging in dog years. In four years, she'll be a shrunken head.","commenter_a":"That's because only stupid woman will vote for her just because she's a woman.just like people voted for Obama just because he was black.","post_message":"A great defender of women's rights? You decide."},{"comment_id":"10158240785950641","commenter_b":"LETS GO BACK TO ..WHEN AMERICA WAS WHITE","commenter_a":"I love president Trump","post_message":"Happening Now: Judge Jeanine Pirro delivers remarks at #CPAC2017."},{"comment_id":"10155845816789778","commenter_b":"Idiots...its about illegal immigrants and nothing more....drama is what they thrive on","commenter_a":"stupid is as stupid does. these people are here legally and commit no crimes, yet they do not want the president to deport those who would cause harm or come in illegally.","post_message":"Delia Goncalves was live with Jose Andres about #ADayWithoutImmigrants.   Several DC-area restaurants will be closing as a part of the movement."},{"comment_id":"1263844570323065","commenter_b":"yep. Sobbing now.","commenter_a":"Started crying before I even opened the article","post_message":"These Holocaust survivors just regained a lost part of their childhood. - Jon Comulada"},{"comment_id":"10154113431396037","commenter_b":"Wolves in sheep's clothing","commenter_a":"...sickos for 'god'...","post_message":"The Christian Prayer Center website not only charged consumers $9 to $35 for prayers but also \"deliberately\" confused some consumers into signing up for recurring monthly payments, according to authorities."}]
