[{"comment_id":"10153597569599411","commenter_b":"@Zoran...again, you get a life...we are pretty happy and fine. Not like a poor illegal immigrants as Zoran trying to stay in the west....","commenter_a":"No one should feed barbarian Russian junta fascism invaders.","post_message":""},{"comment_id":"10153441041876037","commenter_b":"She was living a lie by her own choosing. Time to clean it up.","commenter_a":"When her tan started to fade did anyone ever think she looked a bit less black?","post_message":"In a resignation post, the civil rights activist vows to fight for “what is right and good in this world.”"},{"comment_id":"10153675906043132","commenter_b":"Ben's is too good for her He's lucky she sent him home He had too much class for her","commenter_a":"Shawn wins - there.","post_message":"Last night's The Bachelorette: Let's discuss."},{"comment_id":"10152829725821051","commenter_b":"if she shop lifts why isn't' the bitch in jail","commenter_a":"You mean she isn't stealing now?","post_message":"This shoplifter has never had a job. She current lives in rent-free housing and receives monthly benefits. She says if her benefits aren't raised, she'll go back to stealing."},{"comment_id":"872957136089257","commenter_b":"lol bitch...u aint smart","commenter_a":"Harashi Dang u get this pic? Lol","post_message":"Classic. ~Will  More photos at Afghanistan Combat Footage - Funker530"},{"comment_id":"10154269776132619","commenter_b":"What is ISRAEL SUPPOSED TO DO?????????? let the rest of the world walk all over them????? I don't think so..... If a lot more countries in the world were like ISRAEL the world would be a better place....","commenter_a":"Let's black list the UN. It needs to go. Thugs in suits.","post_message":"A push is currently being made in the United Nations to have the Israeli Defense Forces added to the blacklist of the council for Children and Armed Conflict."},{"comment_id":"1729831163913652","commenter_b":"According to her, if you don't vote for her, your a Sexist.","commenter_a":"If youre thinking of voting because shes a woman Please dont vote at all This is about the future of the U.S And this *woman* Cares nothing for equality women Nor blacks... Nor anyone but her corporate buddies","post_message":"Hillary Clinton told a colorful story in Reno that ended with the former secretary of state barking like a dog to slam Republicans ... @webpagelink"}]
