[{"comment_id":"639736896151349","commenter_b":"That's great and all but how do these women make money now?","commenter_a":"yeah and there'll be some bleeding heart liberal who'll be out fighting for robots rights and defending human trafficking because \"pedophelia is a disease!\" and we \"shouldn't judge\".","post_message":"Experts believe that cyborg prostitution will help ‘clean up the industry’ by reducing sexually transmitted diseases and ending sex slavery."},{"comment_id":"10152594464675927","commenter_b":"Go F♤♤K yourself Hussein, and that thing you call a wife !","commenter_a":"speaking OF \" ignorant\"...","post_message":"You should NEVER apologize for being a proud American.  NEVER."},{"comment_id":"10153662067420950","commenter_b":"Teresa you need a big fat,one stuck in your mouth so you can't talk but choke","commenter_a":"Trump's mouth is actually helping to elect Democrats in November. I wonder how many Republican leaders were meeting this morning and asking one another \"How in the hell can we shut this guy up?\"","post_message":"\"I'll say one thing about the Democratic Party,\" Trump observed. \"At least they stick together.\""},{"comment_id":"1678495722420749","commenter_b":"She's a POS!","commenter_a":"Um Killery! Benghazi is in Libya!!! You are responsible (Culpable) for 4 Americans dying needlessly over there on September 11 2012! You are a Lying POS!","post_message":"Hillary Clinton did not mention the four Americans who were killed in the Sept. 11, 2012 terror attack in Benghazi."},{"comment_id":"10153277362054170","commenter_b":"she is such STUPID IDIOT","commenter_a":"Her strategy, which has worked in the past, is to blame everything as due to \"Right-wing extremists\" and denounce reports of her past as \"old news.\" The liberal press will support her.","post_message":"Well, the much-awaited Hillary announcement video is out, and we've got it here. If you can find a rationale for a Hillary presidency anywhere in it, by all means let us know. We couldn't."},{"comment_id":"870676293063413","commenter_b":"She can leave anyway. Useless","commenter_a":"Well,bye","post_message":""},{"comment_id":"10153974318380496","commenter_b":"Let them protest but not riots, vandalism and violence. These people r starting to scare me. Saw a sign outside trump towers saying rape melania and kill trump. What kind of people r they. Trump has to stay cool and not start tweeting.","commenter_a":"Thank God someone with common sense.","post_message":"While protests in Atlanta and around the country have been peaceful, that isn't the case for all. Now a major city's officials are saying that enough is enough.  “If you’re upset with the election, please don’t come out and protest,” the city's police chief said. “We are done with criminal activity in this city. It’s time to move on and to move forward.”"}]
