[{"comment_id":"10154905959166320","commenter_b":"Women hate liars...","commenter_a":"no they just hate the mean ones 😬","post_message":"What do you make of this? In an interview Madonna said, 'Women Betrayed Us' by Voting for Donald Trump.  Also she said that she has not had a good night's sleep since the election.  (Image: Fox News/AP)"},{"comment_id":"10153780337219203","commenter_b":"I am so fucking over this black lives matter shit. But, you know, I'm a basic white bitch so what do you expect?","commenter_a":"Not true....he said all American lives matter. He's the only one who had the balls to say it and you should give him credit for that DB.","post_message":" lives matter, Sanders responded to uproarious cheers."},{"comment_id":"10154024040699497","commenter_b":"Stop being such a pussy!","commenter_a":"And people are just standing for this? I follow the Onion, and certainly didn't fall in line with Justice Scalia's opinions, but let me tell you this - this is a new standard of low. I could leave a brief comment, but this is so far beyond the usual pallor of any statement even a satirical form of journal should ever make, I find myself disgusted into making a statement. As human beings, we are all equal in death, but as Americans, we are something more. We are held to a certain equity of values that we inherit no matter where we fall on the narrow spectrum of political attitudes held in this country. And I am personally offended by the scrapping masses of groundlings hurling insults about a dead political figure before his family had even had a chance to attend the funeral. Shame on all of you. Good ...","post_message":"BREAKING:"},{"comment_id":"10155184641741509","commenter_b":"They wanted that sweet Brazilian booty","commenter_a":"I really think these dudes were out looking for mad hookers and they got robbed because of it LMFAO!!!!","post_message":"JUST IN: US swimmers Jack Conger and Gunnar Bentz were removed from their flight from Rio de Janeiro to the United States by Brazilian authorities, US Olympic Committee spokesman Patrick Sandusky told CNN Sports contributor Christine Brennan. Earlier this week, the two swimmers were with teammates Ryan Lochte and James Feigen, who are wanted for questioning by Brazilian police after questions were raised over their accounts of being robbed."},{"comment_id":"10153851537376162","commenter_b":"They are bad dogs they should exterminate that race!!!","commenter_a":"Let me guess it was a pit bull??","post_message":"PET ATTACK: A 34-year-old woman with physical disabilities is in critical condition after she was brutally attacked by her family pet on Chicago's Southwest side."},{"comment_id":"702885809874123","commenter_b":"Just as ugly as she is!","commenter_a":"Very ugly dress looks likes she's wearing a curtains.","post_message":"It caught everyone's attention because..."},{"comment_id":"685676394932163","commenter_b":"Throw her in jail.","commenter_a":"Plus she is now blaming her server stupidity on Collin Powell. Isn't that racist?","post_message":"The double standard..."}]
