[{"comment_id":"10156268992405093","commenter_b":"What is it..?...A Witch would go down nice.","commenter_a":"She is just ordinary folk like us. See, she can laugh at herself (not really) and wants everybody to see how much she is like us and SO down to earth. Oh my how have we misjudged her all this time?! What a fraud!!!!!","post_message":"It's just.... It's just too easy."},{"comment_id":"10153571120640779","commenter_b":"It's a bitch...","commenter_a":"Karma.","post_message":"USA Swimming, the national governing body of competitive swimming, has banned convicted rapist Brock Turner for life."},{"comment_id":"10153382589804411","commenter_b":"shutup bastard","commenter_a":"Fuck them they are just as much terrorists as Isis","post_message":" we are facing a kind of danger that is unprecedented in history, which targets humanity itself,"},{"comment_id":"1112320072187475","commenter_b":"Comparing this flooding to hurricane katrina is like trying to compare Benghazi to Iraq 😂😂💦","commenter_a":"What\"s happening in the US of A before the election happened in the Philippines. The big news network had been obviously bias against one candidate and it seems that this candidate cannot do anything right for them for obvious reasons. Even the Roman Catholic hierarchy are all bent on preventing our presidential candidate to win the election. But lo and behold the people have spoken and are up in arms against these giant nerworks and rallied their candidate of choice to win decisively. Wake up America you are being manipulated by a few who have selfish interest and only have themselves to enjoy if their will be done.","post_message":"President George W. Bush was torn to shreds in 2005 by mainstream media commentators for his initial response to Hurricane Katrina – yet President Obama’s detached response to the recent Louisiana floods has been met with resounding silence from those same outlets."},{"comment_id":"1586246148346927","commenter_b":"It looks like the hind end of A stripe ass baboon !","commenter_a":"Not just no but hell no I will burn any I find","post_message":"Michelle Obama does not deserve to have her face on anything. Will you buy these stamps?"},{"comment_id":"1037623106257736","commenter_b":"Many foreigners are required to take English in school unlike Americans.","commenter_a":"if you want to go to murica you have to speak engrish","post_message":"A study found that 77% of immigrants have high school diplomas and over 40% graduated from college."},{"comment_id":"1613037799000233","commenter_b":"Thanks to Trump! He has successfully stirred up America. I'm still with Hillary Clinton!","commenter_a":"Ever since the election, the real closet racists have come out..","post_message":"A teacher shouted the N-word in the middle of class, stunning her eighth grade students. The video has millions of views and the teacher has since been fired. @webpagelink"}]
