[{"comment_id":"1079846958771328","commenter_b":"redneck racist are that way","commenter_a":"wtf happened in just 4 years","post_message":"LULZ."},{"comment_id":"546896738832150","commenter_b":"Don't worry just go vote under a dead guys name or pick up a few illegals and get them to vote too. What democrats do all the time .","commenter_a":"I accidentally vote for Cain, so the four percent is a little high.","post_message":"POLL: Who won the VP debate?"},{"comment_id":"933893426670406","commenter_b":"I'm sure Myra Hindley was a serial killer @username, that's only one name, I could name a few. Woman r quite capable of becoming serial killers. The statement is true, most serial killers start with killing and torturing animals","commenter_a":"thats how serial killers start!","post_message":"'My first bow kill lol'"},{"comment_id":"1168212589885878","commenter_b":"Yikes!","commenter_a":"Ben may be a fair to middling Doctor but he needs a major lesson in history and about 20 years political experience.","post_message":"America deserves better."},{"comment_id":"10153868854236336","commenter_b":"Heck yeah","commenter_a":"It's OUR country. We don't have to agree. I'm sick of people like this telling other people to leave. You don't make the rules buddy.","post_message":"\"The silent majority has been silent way too long.\"  Harris County Sheriff Mike Jolley says he's proud to be political incorrect, and if you don't like it, you can leave his county. @webpagelink"},{"comment_id":"10154862137916756","commenter_b":"Yes, It's sad to see our Democracy gone to Totalitarianism. We're ruled by the subversive evil Corperations who War on terror was a scam. More honestly put it was WAR to produce terrorist so Corperations could exploit, kill and take down America itself by stripping freedoms as the Patriot act does and by spending the majority of monies on WAR. Now the Red Scare if being probigated by the Democreeps","commenter_a":"I'm stressed about the ugliness that this election has revealed in my fellow Americans. It is disgusting and frightening.","post_message":"Are you?"},{"comment_id":"924477534340446","commenter_b":"@username your mother should have swallowed","commenter_a":"If she really wants to make America whole again, she should do the right thing, and GTFO of politics altogether. It's a start at least.","post_message":"Do you agree with Hillary Clinton? #SCPrimary"}]
