[{"comment_id":"1007821319338322","commenter_b":"She's a piece of work.","commenter_a":"She is nothing but a conceded witch, only standing by her unfaithful husband because he was the POTUS, and therefore a untrustworthy, spiteful person who only cares about herself. I see a demon in her when she laughs!!!","post_message":"The book claims she repeatedly screamed obscenities at her husband, Secret Service personnel and White House staffers — all of whom lived in terror of her next tirade."},{"comment_id":"1064573833613565","commenter_b":"So much hate is was fuels the violence like what happened in Orlando .for all that keep on with with Muslim need to die why hide your face if your so though to say thoughts words only cowers hide behind masks .....","commenter_a":"Gun control does not work and this is proof","post_message":"The FBI, Orlando Police and officials gave an update on the Pulse terror attack. Here's the latest: @webpagelink"},{"comment_id":"510537979128082","commenter_b":"Hahahaha when she bends you over will see your complex","commenter_a":"Liar liar pants on fire burn in hell","post_message":"Join us in wishing Hillary Clinton a very Happy Birthday!"},{"comment_id":"10153556310231336","commenter_b":"dumb racist pos","commenter_a":"Dumb niggas","post_message":"After waiting about 20 minutes while the women talked, U.S. Senator Bernie Sanders was pushed away again when he tried to take the microphone back."},{"comment_id":"1712281645723927","commenter_b":"Ash Jesus another self righteous know it all illegal immigrant go back to your country bitch this is my country not yours","commenter_a":"Makes me laugh that those who are here \"legally\" think they are any better than those who cross the border. Yes deport those with criminal record, but why throw out hard working folks like my parents who come here for a better life and contribute to this country. They also pay their taxes. People screaming out CRIMINALS to immigrants as if US citizens weren't criminals. Instead of complaining about immigration, perhaps you should demand the government to stop exploiting other countries' resources and their people. Bring down your ignorance and arrogance down a notch. Seriously, who do you all think you are? When you die and rot in your tomb, you won't be needing your \"citizenship\".","post_message":"Do you agree or disagree with the majority of Americans on this?"},{"comment_id":"10153209058106509","commenter_b":"Oooh looks like you are a dumb chick trapped inside human body. Go get an operation...free yourself ha!","commenter_a":"All the people who think he was a girl trapped in a boy's body are sick and have missed basic biology lessons. For that punk - rot in hell.","post_message":"Crossing out \"Josh,\" the 17-year-old signed \"Leelah\" in a suicide note.  @webpagelink"},{"comment_id":"988968067881864","commenter_b":"Wake up woman","commenter_a":"I am not an HRC supporter, but folks, please don't start reposting these kinds of photos. This could have been taken hours before the event. If you can show me this size crowd with HRC on the stage, then I would repost. If you repost and it's false, the left will attack you and We all lose credibility","post_message":"SHOCK PHOTOS:"}]
