[{"comment_id":"10156457619055354","commenter_b":"She's only fit to lead her prison cell block at this point.","commenter_a":"Well, Hillary, if you hadn't enabled the enemy by letting the Benghazi attack go on, sending arms to our enemies, selling, for your own profit, 1/3 of our uranium to Russia and in many other ways letting terrorists know that it's open season on Americans, we wouldn't be having to listen to you whine that you want us all unarmed so we can't fight back.","post_message":"Unserious and out of touch."},{"comment_id":"1193499157336779","commenter_b":"Poor people. Blessed to live but with these memories. Prayers","commenter_a":"Very sad! I can't imagine the horror! God bless you always!","post_message":"\"We were just about to say the prayer to be released,\" said Felecia Sanders, one of three people who survived when a gunman opened fire during Bible study at her Charleston church on June 17."},{"comment_id":"10153894836055579","commenter_b":"Deport Muslims and illegals, provide help for the mentally ill. Uphold current laws. Problem solved.","commenter_a":"Can somebody explain to me the connection between the NRA and this 20 year mentally disturbed individual in Oregon? How come we don't hear Obama or Hillary talking about the thousands killed every year via violent criminals in major cities all over the US? Where's their plan to stop that violence? How many law abiding gun carrying citizens have been involved in a mass shooting in the US?","post_message":"Hillary Clinton on guns:  is wrong with us that we can stand up to the NRA? Watch full video here: @webpagelink"},{"comment_id":"10153879434881337","commenter_b":"and fuck u bitch","commenter_a":"FUCK OBAMA!!!!!!!","post_message":"PRESIDENTIAL APPROVAL: Kendrick Lamar keeps it short and sweet with his reaction to Barack Obama's \"song of the year\" praise..."},{"comment_id":"10152829564776770","commenter_b":"Go home Clintons","commenter_a":"Bullshit cover up","post_message":"Hillary is secretly a great person, says Clinton campaign"},{"comment_id":"10153952866914726","commenter_b":"IN TODAY'S WORLD YOU CAN DO ALL KINDS OF THING LIKE MAKE UP POLL NUMBERS AND VOTES HELL I,M SURPRISED THEY DON,T HAVE BUSH IN FIRST PLACE THESE DUMB FUCKS KEEP TRYING TO PUSH BUSH IN A RACE HE DOES NOT BELONG THE ONLY WAY HE IS GOING TO WIN IS IF YOU JUST GIVE THE FUCKING THING TO HIM","commenter_a":"Don't look now people, but there may be a Clinton & a Bush in the 2020 or 2024 races. George Prescott Bush(Jeb's son) & Chelsea Clinton.","post_message":"The Bushes are back and looking for a big win — whatever it takes..."},{"comment_id":"10153653057081438","commenter_b":"Used to be, \"This may be upsetting to you.\" Then I would close my eyes. Yes, I get triggered, but it's not neuroscience to accommodate folks.","commenter_a":"Ovid yes and no. EVERY single one of the stories includes silencing of one kind or another-- often violent, often sexual violence. But it is a political poem by an exiled poet who was being silenced. HE tells a story about a bad (silencing) king and then says something directly to the emperor-- \" And you oh Augustus...\" Zeus was a rapist but he does not get praise for his philandering; his wife punishes the victim (the mother of nearly every demigod) since her husband is in power, but some god or goddess usually intervenes. Those rapes or dalliances are metaphorical for deeper political angst in Rome.","post_message":"Some professors believe trigger warnings build trust. Others think they stifle free discourse."}]
