[{"comment_id":"492044497655936","commenter_b":"Is she for real? Did someone really vote her stupid ass into office?","commenter_a":"Elizabeth Warren is a Douchebag","post_message":"If Democrats REALLY believed Trump's speech was ineffective, they'd want him to give MORE speeches like that, not fewer."},{"comment_id":"539258706198723","commenter_b":"Fuck her","commenter_a":"She wrote the book on \"reckless\" and \"dangerous foreign policy\". Just ask Sean Smith's mother.","post_message":"Hillary Clinton took aim at Republican candidate Donald Trump's foreign policy calling it \"reckless\" and possibly \"dangerous.\" Do you agree or disagree?"},{"comment_id":"579018038952469","commenter_b":"Safi Cedrick Varda this actually aired like today ..... in 2016!!!","commenter_a":"What was the point of this?","post_message":"They actually aired this."},{"comment_id":"10153956657931336","commenter_b":"Amen she needs to go to jail u r correct","commenter_a":"112 million raised and supposedly all from minorities and women. This woman is the single biggest threat to our country. She is actually worse than Obama and as we know that is as bad as it gets. The nazi queen needs to go to prison","post_message":"The Hillary Clinton campaign said that puts her total raised in 2015 to spend on the presidential primary campaign at $112 million."},{"comment_id":"10154996300568827","commenter_b":"And when they do they can get arrested for indecent exposer. And if they do it in front of one child they should ALL have to register as a sex offender.","commenter_a":"Why do we need to see his returns...? He was a private citizen...show me yours...","post_message":"Protesters plan to pull their pants down to protest Trump."},{"comment_id":"567943360046309","commenter_b":"How did you get where you are if that is true and by the way lady, the last time I checked the White House was occupied by a Black Family !Stop feeling sorry for yourself ! Get therapy and get over yourself !","commenter_a":"When hate is all you got to sell","post_message":"“This country was founded on racism and sexism, point blank.\""},{"comment_id":"10154352639558271","commenter_b":"That maybe so but I do agree with her ideas. Today's education is a joke and only benefits unions and their members. You might disagree but that's my story and I'm sticking to it.","commenter_a":"I think generals know more about the military than a civilian. I don't think you would want a dentist fixing your car. Wise up sir.","post_message":"There may be a theme to the way Donald Trump is selecting members of his cabinet.  Metro State professor Norman Provizer talks about the President-elect's choices with Anne Trujillo Denver7 today at 4pm on Politics Unplugged."}]
