[{"comment_id":"1313010822072720","commenter_b":"And she thinks the transgendered individuals are scary","commenter_a":"sick.","post_message":"‘Are you going to let the Devil rape your children?’"},{"comment_id":"1788613674701059","commenter_b":"Shut up hoe","commenter_a":"It amazes me how rude some of you people can be . They're having a fucking child! Like come on now , stop being so immature talking about \" he's carrying the baby , \" or \" his girlfriend looks like a man\". Smh people 😒😑. Congratulations Dj Khaled & Nicole Turk ❤️","post_message":"Baby Alert! "},{"comment_id":"10153544665036159","commenter_b":"about as transparent as a full inkwell","commenter_a":"Because all requests and responses must be vetted by the White House. Who would ever imagined!","post_message":"Transparency?"},{"comment_id":"1862910250609136","commenter_b":"Girl bye, take your dirty mouth with you","commenter_a":"Go to Gitmo you A hole!","post_message":"Lol. Celebs can't even."},{"comment_id":"10153550520716336","commenter_b":"Hillary might be in jail.","commenter_a":"It's obvious that @username wants Jeb Bush to be the Republican nominee. On the Debate last night, NO ONE received harder questions than Donald Trump. NO ONE! I don't want Jeb Bush or Donald Trump to be the nominee. @username you're NOT being Fair and Balanced.","post_message":"Which GOP presidential candidate do you think gave the most impressive performance during the Fox News-Facebook prime-time debate?"},{"comment_id":"10153414475016167","commenter_b":"Damn uppity women with their words and assertiveness","commenter_a":"They should know we Chicago folks like a good shout out. Have they never been to a Cub, Bear or Hawks game? It is enthusiastic and honest.","post_message":"Add this to the list of things the media would never attack a male politician for:"},{"comment_id":"1422900164405547","commenter_b":"My integrity will not allow such a travesty. She is a war monger.","commenter_a":"We can't , CANNOT, be punitive at this time in history and not vote for Clinton. I KNOW Bernie would have been a WAY better President, but I will hold my nose and vote for Clinton.","post_message":"I don't know if it's a world record but Donald Trump has been sued more than 3,500 times over the past 30 years. This isn't someone who should be president."}]
