[{"comment_id":"930363577060209","commenter_b":"She is as STUPID as HILLARY","commenter_a":"Germany's Government \"feel good\" Migrant policy has consequences.","post_message":"CLUELESS..."},{"comment_id":"2088211734736585","commenter_b":"Stupid cow!","commenter_a":"Your a stupid person","post_message":"Cokie Roberts called supporters of Donald Trump \"morally tainted\" on MSNBC's \"Morning Joe,\" then received a heavy dose of push back."},{"comment_id":"613869622133977","commenter_b":"She wants to, if you see the full speech, it is quite clear.","commenter_a":"I didn't vote for Angela Merkel but I have to come to her defence. I don't believe her aim is to discriminate anyone. She is speaking about \"Vollverschleierung\" which means to completely cover the face. I don't think she wants to ban all veils.","post_message":"Elizabeth Plank explains her opposition to German Chancellor Angela Merkel's proposed veil ban."},{"comment_id":"424515887751925","commenter_b":"Kick her out if she won't wear the uniform","commenter_a":"Sorry sweetheart, you cannot honestly believe we who are proud of our Marines are going to consider your sensibilities against our men. Grow up.","post_message":"Liberal Chick has really lost it. Marines in uniform are now offensive? This is cuckoo for cocoa puffs."},{"comment_id":"10154354649676336","commenter_b":"This is exactly what you get when you allow illegals into the country!!!","commenter_a":"With all of the organic fruit, spinach, sprouts, vegetables and now vitamins being recalled I have decided to start a strict diet of twinkies and chips ahoy. They never get recalled.","post_message":"Warning: Recalled products include Nature Made gummy multivitamins and supplements containing vitamin C, B vitamins and folic acid."},{"comment_id":"10153850884477235","commenter_b":"Only a woman who knows full well that things have changed since the days of screen time for weather \"girls\" only could say something so offensive. She is not worried about being masculinized out of a job.","commenter_a":"Mentally challenged","post_message":"The stupid, it burns."},{"comment_id":"1066102216758740","commenter_b":"DON\"T choose Hillary!! Jump aboard the TRUMP TRAIN 2016! He will work for America!!!","commenter_a":"Why should we choose Hillary ???? Bill didn't he choose every other women BUT Hillary","post_message":"\"She's a natural leader, she's a good organizer, and she's the best darn change-maker I ever met in my entire life.\"  President Bill Clinton said Hillary Clinton is \"worth every single year she's put into making people's lives better.\""}]
