[{"comment_id":"10154377596014411","commenter_b":"Does anyone realize what is happening? History is repeating itself and no one is taking notice. The Middle East is on fire. Obama and Hillary started this with Libya, they had no business getting involved. Now we have a flood of Muslims who hate American and our culture. They do not want to be equal, they want to dominate and change America and the West to a Muslim country. This is a fact, Turkish President is building mosques all over the West and no one is paying attention. In Turkey they are burning down churches, killing and raping Christians. It's a genocide but Obama only brings in Muslims no Christians. Americans are being told, to take down crosses, take pork from American public schools, allow Muslims to have pray time in public schools, Our children are learning Islam is the faith to be. WAKE UP PEOPLE. They are moving in ...","commenter_a":"I dont think people are comprehending how much people are actually crossing over in europe. its not like in north america. Canada for example scrapes the cream of the crop at 10,000 vs half a million in germany alone. So its full of feel good stories. Whats left stays in europe and the people keep coming and summer has just started. We're talking about a city moving into the EU completely needing of support. At the rate of growth. They'll have a small country entering the EU (mostly unscreened). Europes economy is already weak. Germany has a strong economy, but they're carrying the bulk of the weight. Swedens already cracking under the weight of just one year. Not to mention the culture shock of a sudden mix of two completely different cultures. Hes not saying turn them away. Obviously care for them. But you cant have this number of them ...","post_message":"Dali Lama to Germany: You're doing it wrong"},{"comment_id":"1675805602436783","commenter_b":"Wicked prick!","commenter_a":"That is what happens when you try to work \"across the aisle\" with a group of people that have no desire to work with you.","post_message":""},{"comment_id":"10153465361664714","commenter_b":"I'm just sorry u all have to go thur you show up lifting an I'm praying they do not take it of. I've been in your shoes girls,an the ownly way is to move on is to try an find a way to forgive an forget,I. Found it in my bible there isn't one single person out there that donest havesomething bad or a secret hidden in their closet, I'm just sorry something as this is blown so far there,but I can say this ,I love the show an praying it back on u r like my family,an I'll miss u.","commenter_a":"In not excusing at all what he did, but how is he a pedophile or rapist? Kids touching kids around their own age aren't pedophiles. It's molestation, yes. When an adult touches a child in a sexual manner, that's a pedophile. A rapists is some one who rapes another person. He didn't have sex or oral with his sisters. He's not a rapists and he's not a pedophile. He was a molester. I'm not saying what he did was nothing, but can we call it what it is without adding false titles? The diggers called trans people pedophiles and we no that's bogus, but do we need to stoop down to their level? If we do, we're just as bad in our thinking as they are.","post_message":"More on the 19 Kids and Counting scandal."},{"comment_id":"10153146887251955","commenter_b":"She is ugly like hell!!","commenter_a":"Hair fell out because nothing in her head to attach to","post_message":"Bald first lady?   'Jeopardy!' appearance raises questions"},{"comment_id":"10152705258007144","commenter_b":"How can we believe anything he says after lying so many times??..and they said Obama lies!!!! And I am one of the 47%!","commenter_a":"Dipshit: Same path doesn't equal new outcome","post_message":"Mitt Romney is quickly rebuilding his campaign network for an \"almost certain\" run."},{"comment_id":"936212533138468","commenter_b":"Stupid bastards, Mexicans are not the only illegals in this country, canadians, europeans and some Asians... Also blacks are not leading the welfare race, more whites are on welfare than the rest of the races! Let that marinate..... Get your assets out there and pick strawberries if you support trump so readily","commenter_a":"Americans will be lining up - lining up - I tell you - for those lucrative strawberry picking jobs.","post_message":"Turns out America's food production relies heavily on immigrant labor, and our farmers are NOT pleased."},{"comment_id":"10153772364848132","commenter_b":"Such a strong woman...","commenter_a":"What a wonderful tribute to your husband this morning Kathie Lee... May God be with you and your family at this difficult time...","post_message":"This emotional tribute from Kathie Lee Gifford is so touching."}]
