[{"comment_id":"10153869731497042","commenter_b":"These animals with guns","commenter_a":"This this is an open and closed case? And the guy is just lucky that he wrestled the gun from his father, and killed him, before his father could kill him first? Or maybe, just maybe, he was the shooter, and he is just telling police a story. Just sounds a little fishy, don't you think?","post_message":"QUADRUPLE FATAL SHOOTING: Police are investigating after they received a call from a man saying he killed his father — but only after the father allegedly shot and killed his bedridden mother, girlfriend and friend at a home in Rowland Heights, California."},{"comment_id":"1776409695942163","commenter_b":"@username, sorry to say this but you might have missed the point.","commenter_a":"Michelle isn't even remotely in her category .. get real...sorry.?","post_message":"Nothing wrong with nude modeling, but could you imagine how they would scream if Michelle Obama had done this? Hypocrites..."},{"comment_id":"10156094482870354","commenter_b":"Throw that fat stank ass pig in the pen!","commenter_a":"She deserves the same","post_message":"***UPDATE***"},{"comment_id":"1158452534233281","commenter_b":"All that fighting over an ugly fat chick?!","commenter_a":"White trailer park trash punks","post_message":"We doubt if just one person was to blame in this insane road rage incident caught on tape. But it's clear that this woman refuses to let it go.  And after pushing and pushing the other driver, she gets a wet blast she never expected.  And it didn't end there..."},{"comment_id":"10153703121996051","commenter_b":"If you are joking haha good one...if not well...Abusive bitch? Kids tested? Gwah lordy be. What a generation of pansies..","commenter_a":"There are ways to pin this abuse on this bitch. The father has to use some tactics to have the courts on his side. I would get the kids psychologically evaluated, have them testify in court in regards to the mother's abuse and a list of other stuff. I would make this bitch pay!","post_message":"A dad was looking through his son's iPad when he stumbled across this footage of the boy's mother."},{"comment_id":"892830167500429","commenter_b":"Well when you're being raped - tell me about that theory again or in a 'dickless' gun free zone. (Hahha)","commenter_a":"Tell them if you knew you had to play inthe park, you would have brought a bigger bat.","post_message":"They have hunting... And dicks on their brain! @webpagelink"},{"comment_id":"10153882229389062","commenter_b":"Man she looks like a man!","commenter_a":"I don't think she got the memo.","post_message":"The 6 officers charged in Freddie Gray's death have been released on bail @webpagelink"}]
