[{"comment_id":"986949048053489","commenter_b":"Yes take her to Court","commenter_a":"Do it! Do it!","post_message":""},{"comment_id":"10153222967261378","commenter_b":"Time for her to be shot in the face.","commenter_a":"Time for her to be released from her position.","post_message":"READY FOR MORE JAIL: Back at work and continuing to refuse same-sex marriage licenses, Kentucky clerk Kim Davis said she'll go back to jail again if that's what it comes to. Watch her tearful interview..."},{"comment_id":"10153107912406051","commenter_b":"I hope she gets eaten by a carnivorous flower","commenter_a":"Or go egg free. Its possible. Vegan all the way!!","post_message":"We're going through the worst egg shortage in US history. What does that mean? It means get ready to pay a lot more for all your food."},{"comment_id":"10153424422192377","commenter_b":"cruz wants megyn on his side, strong women has nothing to do with it.","commenter_a":"Give me a break!!","post_message":"\"Listen, I know that Donald — it makes him feel really tough; it makes him feel like a very, very big man to threaten people. And in particular, he seems to have a problem with strong women,\" Cruz said. \"I don't know why that is, but it seems to really bother him.\""},{"comment_id":"1204331449626601","commenter_b":"Lol","commenter_a":"I know I probably shouldn't but I find this diabolically hilarious.","post_message":"Someone sneaked up behind him  (via Daily Mail Australia)"},{"comment_id":"558350940997625","commenter_b":"TRUMP 16 the rest are weak ! Non presidential . The to Cubans will open our borders to Cuba Canada and Mexico because there parents were illegals also . Period","commenter_a":"Donald J. Trump 2016","post_message":"\"...a man who has a multi-decade history of exploiting the immigration laws to take advantage of the little guy is not someone we can trust to stand with the working men and women of this country.\""},{"comment_id":"10154046898184199","commenter_b":"I think the verbal abuse has to be severe (to the point of verbal battery) before they will enforce it but this is how the state has defined it but I'm not a lawyer and if theres a lawyer reading this could you please explain it better the rcw codes tend to be confusing.","commenter_a":"Ok so for the internet lawyers out there, or real lawyers, riddle me this: If I start cursing out someone on the street, can a cop arrest me? Have I broken the law?","post_message":""}]
