[{"comment_id":"1152390574850299","commenter_b":"Wish these women would press charges! That would be wonderful...","commenter_a":"This woman should bring legal charges. It is too bad she did not haul off and slug him then and there. There are too many honest credible women coming forward to ignore. Even die-hard Trump supporters should think twice about supporting such a lech. And no, the Clintons are not paying all these women to come forward. Use spell check if you want to be taken seriously Maynard.","post_message":"This makes 12 women that Trump is accused of not being able to keep his grubby, tiny hands off of."},{"comment_id":"1292853950724756","commenter_b":"Or marry him, or bear his children, or even be in the same room with him. Not worth any amount of money could buy a smart woman.","commenter_a":"Always a lady with class, dignity and honesty.","post_message":"She's absolutely right."},{"comment_id":"10157833326000093","commenter_b":"The most hated woman in the world !","commenter_a":"Time to put the Clintons and their never-ending, gross and creepy scandals out to pasture.","post_message":"The Clintons and their minions deserve to be driven from public life."},{"comment_id":"10153986318004071","commenter_b":"Still I could look up plenty more lyrics","commenter_a":"But he just did a commercial with little yachty which doesn't make sense 🤔🤔. In lil yachtys biggest song he saids ''tell her I can get that pussy easily''. Wake up sheeple","post_message":"LeBron James is speaking out against Donald J. Trump's 'locker room talk.'"},{"comment_id":"1300466673353815","commenter_b":"If they all count, then re count where Hillary won by small margins...","commenter_a":"Jill stein sucks proletarian donkey dick","post_message":"We're at Trump Tower in NYC standing up for voting justice."},{"comment_id":"10152996037727869","commenter_b":"Abortions are legal, fingerbanging little kids illegal. Change the law if you want to stop abortions and legalize kid screwing. Oh, but you have Christians like the Duggars fighting for you. Good luck with that. I'll pray that you elect pedophiles so you can pray away the sin and let the criminals walk around molesting new victims. Jesus forgives. but society should prosecute crimes. He admitted to committing CRIMES!","commenter_a":"you might wanna find out more about the Duggars before you endorsed supporting them today..this is why YOU WILL NOT BE PRESIDENT. america doesn't want a president who thinks sexual abuse of children is ok or normal.","post_message":"We’re headed into Memorial Day weekend.  That means more than just picnics and sales and the start of summer.  It’s a time to offer tribute, prayers and thanks to the heroic men and women of America’s military who for over two centuries have laid down their lives to protect our freedoms.    But we should also remember the many wounded warriors who survived the battles, but came home with deep and lasting scars.  They deserve the very best care we can give them.  Not only through the Veterans Administration, but through private aid groups, like K9s For Warriors.  It’s a non-profit group that provides service dogs to vets with PTSD, traumatic brain injuries and other disabilities, to help them return to civilian life with independence and dignity.  100 percent of individual donations go to the program.  And 95 percent of the service dogs they train are rescued from shelters.  So when you donate to them, you don’t just help a veteran, you save a dog, too. Talk about doubling your money!  To learn more, go online to K9sForWarriors.org."},{"comment_id":"10156219984965725","commenter_b":"Go home. You're drunk.","commenter_a":"WE NEED TRUMP!!! #Trump2016","post_message":"Signing my tax return...."}]
