[{"comment_id":"927501820717545","commenter_b":"Perfectly stated.","commenter_a":"Translation: \"I am begging all my supporters, that despite conning you into voting for me, you need to come to DC. I need a display of reverence and adoration. I will be mostly alone but I am terrific and I alone make a great show!... Oh, come as you are... preferably in white sheets.\".","post_message":"Twitter reply of the year goes to Tony!  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1238351549542994","commenter_b":"Take this woman's FB from her. That's stupid!","commenter_a":"No! Edwards did not ask Obama and liar Hillary to stay away! He's lying! He wanted them there but Obama did not want to give up his golf! Hillary is having serious health issues with seizures and needs her sleep!!!!! Trump Landslide!!!!!","post_message":"Donald J. Trump slams President Obama for not interrupting his vacation to visit Louisiana after deadly flooding in Baton Rouge and parts of Lafayette."},{"comment_id":"638227583024858","commenter_b":"They were all womanizers.","commenter_a":"President Lincoln: \"...that government of the people, by the people, for the people, shall not perish from the earth.\" President Kennedy: \"...Ask not what your country can do for you.\" Dr.Martin Luther King Jr. \"....one day we will be judged not by the color of our skin but by the content of our character.\" Donald Trump: \"...Grab 'em by the p***y\"","post_message":"Watch a Republican CNN commentator call on Trump to step down after tape was released of him explaining how to sexually assault women: \"He is a pig, he is vile. This is consistent behavior by him...He is not fit to be the Republican nominee. He is not fit to be called a man.\""},{"comment_id":"10154221226031509","commenter_b":"Its not a stare down, lol! Whe one talks the other listens & thinks, then vise versa.","commenter_a":"Obama is intimidated by Putin he can't even look at him in the eyes.","post_message":"Heads slightly bowed, looking extremely serious: What were Obama and Putin discussing?"},{"comment_id":"10153696766386159","commenter_b":"Blue laws are state laws or local laws that regulate in state commerce and are not the purview of the Federal Government. Few states have Blue Laws any more. In our state, only alcohol (package sales) are banned and that decision is made locally - not by the state. We have dry counties and dry townships. That decision is made by local residents.","commenter_a":"Freedom OF religion is also freedom FROM religion.","post_message":" United States of America did not create religious liberty. Religious liberty created the United States of America."},{"comment_id":"10152747594996051","commenter_b":"@username smart lady","commenter_a":"All this complaining about someone suggesting that one be responsible when getting our tax money. This is crap something needs to be done but then again the bleeding heart unimformed idiots will start crying. Look around and show me the starving people just look at the size u don't get that size while starving.","post_message":"People getting food stamps in this state need to get ready for some big changes."},{"comment_id":"1170571449649992","commenter_b":"A lot of dumb chicks out there..","commenter_a":"Love it!!!","post_message":""}]
