[{"comment_id":"448351221956139","commenter_b":"I'm from Texas and Perry has done a good job for jobs and everything else, except shutting the border down. He gets an F for that...........","commenter_a":"Trump,Rick Perry is a very bright man.He lead Texas very good for many years.","post_message":"It seems that Donald Trump has now turned his attention to this rival GOP candidate."},{"comment_id":"10153161332178606","commenter_b":"with friends like that who's need enemies! She's just evil.","commenter_a":"Good. She can go to JAIL !","post_message":"Police said a teen had second thoughts about committing suicide, but his friend encouraged him to do so. @webpagelink"},{"comment_id":"1260234220691789","commenter_b":"We don't care anymore you protested us to death.","commenter_a":"UI hope these idiots Freeze out there in MN","post_message":"LIVE NOW: Protest against Trump's immigration order happening in Minneapolis, Minnesota. STORY: @webpagelink"},{"comment_id":"1227335790638732","commenter_b":"You are a Pussy, bitch !!!","commenter_a":"Lmaooooo Go Ana....I LOVE IT 😂","post_message":"EPIC! Oh, and the woman in red is a REPUBLICAN! This happened tonight on CNN.  Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"10153414168399024","commenter_b":"it's a big city...Houston may have enough fag votes for that bitch, but Texas does not! The voters of Houston will wake up and dump the fag...","commenter_a":"My question is, how did a liberal get elected in....Texas.","post_message":"Of course, Annise Parker doesn't care what the voters think. Typical liberal. @webpagelink #tcot #ccot"},{"comment_id":"10154376028466509","commenter_b":"He's dead lady.","commenter_a":"Biden would be a better president than Hillary.","post_message":"President Barack Obama presents \"four big questions that we as a country have to answer \" during his State of the Union address.   #SOTU updates: @webpagelink"},{"comment_id":"1023375851016759","commenter_b":"You're wasting every body else's.","commenter_a":"67 out of the HOW MANY THOUSANDS of people that visit daily? Get your shit straight IFLS. scaring people for no reason. Pathetic.","post_message":"Way to go, anti-vaxxers."}]
