[{"comment_id":"458537397670174","commenter_b":"NO She can Stick it !!!","commenter_a":"No way and the kids are not going to either.","post_message":"Will You Cave To Michelle And Only Eat Where She Wants?  Comment 'yes' or 'no'."},{"comment_id":"1404359436262533","commenter_b":"Craigslist HIRED HACKS.","commenter_a":"Sorry not happening!","post_message":"WATCH LIVE: Local organizations are protesting at Phoenix City Hall to call upon Mayor Greg Stanton to make Phoenix a sanctuary city, among other actions."},{"comment_id":"10153335826619714","commenter_b":"Finally!!!","commenter_a":"@username Durrah Afyouni Masah Azar @username Maya Maaytah","post_message":"Vogue shoots & profiles Andreja Pejić"},{"comment_id":"10154496276031636","commenter_b":"Women are only carriers? What a disgusting mindset to see an entire sect of humanity as subhuman. For the record, men can vanish off the face of the earth tomorrow and humanity will still survive.","commenter_a":"What a sad sight to watch, so many people fighting for the right to kill there own children. Children are the children of the Father. Man can make babies with artificial overs, in a tube, but women can not have babies without a man's sperm, woman are only carrers, all children come from there father first. Maybe instead of worrying about having aborstions, we worry about the decay in society which cases the need for them in the first place. We must raise our standards.","post_message":" intent is to try to put the fathers in the process. My bill would stop the abortion if the father does not agree to the abortion."},{"comment_id":"1058824504164459","commenter_b":"@username are they in mexico legally? if they aren't, they'd be in a mexican jail. if they are. then go after your gvt for not preventing the assaults. the fact is this.. ILLEGAL entry to any country, including mexico, is against the LAW. Mexico has enforced their law and the US MUST TOO. That means a wall since mexican cartels have made another business out of smuggling people into the us and those who can't pay the cartels, find a different way. Mexico didn't like it when Guatemala did it to them and we don't like it here either.","commenter_a":"Mexico has the largest border wall on earth bordering Guatemala to the south in order to protect it from the violence and to protect its mexican culture. It shows the historically true nature of mexican politics since Maximilian was executed. Nothing in mexico is good for America at this time. We dont need there people drugs or crime.","post_message":"\"Suicide bombings in Israel went from 1,000 a year to zero a year once they put that fence up.\"  Yesterday, Mike Huckabee spoke to Uma Pemmaraju about walls, using Israel as an example of why they work."},{"comment_id":"10155239787299411","commenter_b":"Says the Muslim cunt !fuck you and Muhammad","commenter_a":"Is Denmark a Christian or Pagan country?Seems like a dictator country. Forcing people to embrace religion against their will. Sad to see another country being brainwashed to reject the immigrant after all the destruction they had done to their country. Evil system being employed by the world government to spread hatred and misery for their own expenses. Screw the Minister!!! Bunch of hypocrite running the top country post. N shame on the citizens whom do not do a about it/opposing the motion. U are just as two faced ass***e just like your leaders.","post_message":"'Un-Danish?'"},{"comment_id":"10153443009598984","commenter_b":"She is a total THUG herself. She is helping to take Baltimore down the sewer. She needs to go it there is any hope for that city.","commenter_a":"I think Sharpton should pay it!!! He caused the riots or Jackson.","post_message":"The fact that she expects Americans to do THIS for her after the things she's said and the way she handled the riots is truly mind boggling.  Are you outraged by the Baltimore mayor's request?"}]
