[{"comment_id":"10153087733461350","commenter_b":"She is truly fit and very pretty but sorry I still do NOT think seeing a huge belly and huge belly button sticking out is that appealing. Pregnancy is a beautiful thing, but come one get some class. I know all of you that think showing everything is great will have a fit over my comment. But if people would be honest, see through material showing huge bellies with huge belly buttons is not that appealing. I guess nothing is supposed to be left to the imagination or in the bedroom. I have seen some very sexy maternity outfits and this is not one.","commenter_a":"When is Jenna due ? Amazing fitness ! Love all y'all !","post_message":"Do you have questions for our #startTODAY experts? Ask below!  Jean Chatzky, Joy Bauer, Jill Martin and Jenna Wolfe are taking your questions on money, diet, fitness and getting organized. questions."},{"comment_id":"507737642755232","commenter_b":"Hillary has a list of wars that she provoked go take care of your wives, she be to dangerous for you, she be a backstabbing. Learn to read.","commenter_a":"This man trump will be too dangerious for the oval office he will lead america to another third world war so to all you red necks supporting he's cause do the right thing before you unleash hell on earth","post_message":"Every day I wake up determined to deliver a better life for the people all across this nation that have been ignored, neglected and abandoned. -DJT"},{"comment_id":"602469266610319","commenter_b":"Your 15 mins of fame is running out!","commenter_a":"She needs help, yes.","post_message":"Sarah Palin was just hit with a massive curve ball, she needs your help.  This is horrible, we love her. Let's show her we have her back.  Can we get 10,000 'LIKES' for Sarah Palin?"},{"comment_id":"10154258845019087","commenter_b":"Crooked Hillary, Star Trek, and a wussy looking dog......that fits you. #dbap","commenter_a":"Too many fail to realize that had the shoe been on the other foot, DT and his supporters would be screaming to high heaven about the system being rigged - so stuff it.","post_message":"A petition calling on the Electoral College voters to cast their ballot for Hillary Clinton instead of Trump has amassed over 600,000 signatures in less than a day."},{"comment_id":"967628599952830","commenter_b":"Treason is what most our crooked federal employees should be charged with","commenter_a":"When both the Republican establishment and the Democrat establishment attack the SAME candidate, then you know YOU'VE FOUND YOUR GUY!! DONALD TRUMP for PRESIDENT!! 🇺🇸🇺🇸🇺🇸","post_message":"Uh-oh..."},{"comment_id":"1242112452475449","commenter_b":"REMEMBER!! ..The Leftist Liberal News Agencies, pushed very hard for the E.U. to take in the Islamic Immigrants with Islamic Ideologies.","commenter_a":"Islam is a cancer and needs to be removed","post_message":"President Obama says the killings in Paris are \"an attack on the civilized world.\" For more coverage: @webpagelink"},{"comment_id":"1793816267524585","commenter_b":"Amy you should be ashamed for trying to get people to vote for that criminal!!! The things she's going to do to our country aren't going to effect you because you have money !!!","commenter_a":"I'd be much more concerned if I voted for someone who was indited and convicted of high crimes against the United States and humanity!","post_message":"\"Your voting history is public record.\""}]
